{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior R&D Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior R&D Engineer with over 13 years of experience in full stack development and a strong foundation in C++, C, and electronic design. Proficient in version control with **GIT** and has hands-on experience with **MFC** and **STM32** frameworks. Demonstrated ability to deliver innovative electronic solutions while ensuring high-performance and compliance standards. Highly skilled in developing AI/ML-driven applications with a robust understanding of **JavaScript/TypeScript**, **Python**, **Flutter**, and frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven track record in designing and deploying cloud-native systems on **AWS** and **Azure**, focusing on microservices, event-driven architectures, and CI/CD pipelines. Committed to aligning projects with regulatory standards, including HIPAA and PCI DSS, and experienced in MLOps practices utilizing **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior R&D Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained high-performance applications using **C++** and **C** to support innovative R&D projects in the electronic design sector.\n- Leveraged **GIT** for version control, ensuring effective collaboration and code management across project teams.\n- Designed and implemented user interfaces using **MFC**, enhancing usability for embedded systems.\n- Interfaced with **STM32** microcontrollers for efficient electronic design and prototyping, achieving a **20%** improvement in response times.\n- Conducted rigorous testing and debugging, reducing software defects by **30%** through systematic reviews and real-time documentation practices.\n- Collaborated with cross-functional teams to integrate electronic design concepts into software solutions, enhancing functionalities and performance.\n- Spearheaded research initiatives focused on optimizing algorithm efficiency, resulting in performance enhancements of up to **15%**.\n- Actively participated in design reviews and code audits to maintain high-quality standards across software development processes.\n- Developed technical documentation for software applications to facilitate knowledge sharing and training across teams.\n- Managed project milestones and deliverables, ensuring alignment with overarching research goals and deadlines."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **C++** and **C** to design and implement efficient algorithms and systems that enhance product features and stabilize high-performance environments.\nUtilized **GIT** for version control and collaboration, ensuring seamless integration and deployment of code across multiple teams and projects with a focus on agile methodologies.\nDeveloped embedded systems using **MFC** and **STM32**, improving the functionality and reliability of electronic designs by **30%** in performance metrics.\nConducted thorough electronic design principles to optimize circuit layouts, achieving an overall reduction in production costs by **15%** while maintaining quality standards.\nImplemented rigorous R&D methodologies to iteratively develop prototypes and validate product concepts, contributing to a **25%** faster project delivery rate.\nInitiated collaboration across cross-functional teams to gather requirements and transform them into technical solutions, enhancing team communication and project alignment.\nDocumented all design processes and improvements, contributing to knowledge management efforts that reduced onboarding time for new engineers by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed C++ applications and libraries to enhance performance and reliability of embedded systems, ensuring adherence to strict timelines and quality standards (version 1.0).\n• Collaborated with cross-functional teams using **GIT** for version control, facilitating smooth code integration and effective collaboration among development teams (over 50 repositories).\n• Designed electronic systems using **MFC** for graphical user interface applications, contributing to user-centric product designs and user experience improvements (internally focused on 5 key projects).\n• Implemented microcontroller-based solutions with **STM32**, overseeing the entire product lifecycle from conceptualization through to deployment and post-launch support, focusing on reducing development time by 30%.\n• Conducted thorough testing and debugging of new features, ensuring high reliability and compliance with industry standards through rigorous quality assurance (achieving a 98% bug-free deployment record).\n• Engaged in design reviews and provided mentorship to junior engineers, sharing knowledge on best practices in **electronic design** and coding standards, enhancing team capabilities and ensuring project alignment with company objectives.\n• Optimized existing algorithms and protocols, leading to performance improvements of up to 25% in resource utilization and execution speed.\n• Developed comprehensive documentation for the engineering process, reducing onboarding time for new team members by 40% and improving knowledge transfer across projects."
    }
  ],
  "skills": "**Programming Languages:**\n\tC++, C, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda; Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, Nginx, Let’s Encrypt, Certbot, MFC, STM32, electronic design",
  "apply_company": "Kingspan Light + Air"
}