{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Engineer with 13+ years of experience in troubleshooting and root cause analysis, focusing on technical reporting and communication within mechanical systems. Demonstrated proficiency in engine maintenance and automation while ensuring adherence to HSE standards. Proven ability to deliver high-performance applications across diverse industries, leveraging a tech stack that includes **JavaScript/TypeScript, Python, Flutter, React, Next.js, Vue, Node.js, FastAPI, Django**. Skilled in developing AI/ML-powered platforms that enable predictive analytics and real-time processing with a strong grasp on **AWS** and **Azure** for cloud-native deployments. Experienced in implementing microservices, event-driven architectures, and CI/CD pipelines, alongside maintaining compliance with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong background in MLOps, including model training and orchestration with **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Conducted root cause analysis to identify and resolve complex issues in engine maintenance, ensuring optimal performance and adherence to **HSE standards**.\n• Developed and implemented engine automation solutions, leveraging advanced **mechanical systems** to drive efficiencies and reduce downtime by **20%**.\n• Provided troubleshooting support for mechanical failures, significantly improving response times and customer satisfaction by **15%**.\n• Produced technical reports and communicated findings effectively to stakeholders, ensuring clarity and transparency in project updates.\n• Coordinated with cross-functional teams to enhance **communication** and collaboration on engineering projects, resulting in streamlined processes.\n• Utilized **Microsoft Office** tools to create comprehensive documentation and presentations that facilitated decision-making and project approval.\n• Delivered exceptional **customer service** by addressing client concerns and technical queries, increasing client retention rates by **10%**.\n• Maintained documentation of **networking** solutions and engine specifications, ensuring compliance with industry best practices and standards."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Demonstrated strong troubleshooting skills by identifying and resolving 9 complex engine maintenance issues, ensuring high operational efficiency in mechanical systems.\n• Employed root cause analysis techniques to diagnose recurring technical problems, enhancing service reliability and decreasing downtime by 25%.\n• Automated engine diagnostics and maintenance processes using advanced engineering tools, leading to a **30%** reduction in manual intervention and improved safety measures in compliance with HSE standards.\n• Collaborated effectively with cross-functional teams to communicate technical findings and performance enhancements, utilizing **Microsoft Office** for creating detailed reports and presentations.\n• Provided exceptional customer service by addressing client inquiries related to engine performance and maintenance, ensuring satisfaction rates above **90%**.\n• Managed the integration of networking solutions within mechanical systems to optimize machine operations and data reporting.\n• Developed and maintained technical documentation for engine maintenance and troubleshooting procedures, streamlining the onboarding process for new engineers."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Ensured adherence to **HSE standards** while maintaining and troubleshooting mechanical systems, identifying root causes to streamline operations and improve efficiency.\nPerformed **engine automation** to enhance reliability and reduce downtime, supporting high-performance operations in line with organizational goals.\nConducted technical reporting, utilizing **Microsoft Office** tools to document processes, outcomes, and recommendations based on performance metrics of **3** major systems.\nProvided expert **communication** and customer service, aiding clients through complex technical issues and ensuring accurate troubleshooting of mechanical failures while maintaining a satisfaction rate of **90%**.\nApplied **networking** principles to enhance system integration across multiple platforms, improving seamless operation between various engines and processes.\nExecuted **root cause analysis** on failed systems, resulting in the implementation of corrective measures that reduced incidents by **40%** over a **6-month** period.\nCreated and delivered technical training sessions for team members on **engine maintenance** best practices, boosting team competency and confidence.\nCollaborated with cross-functional teams to improve product design and engineering processes, ensuring that all mechanical systems meet industry standards and customer expectations."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n **Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n **API Technologies:**\n\tOAuth2\n\tJWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n **Other:**\n\tengine maintenance\n\ttroubleshooting\n\troot cause analysis\n\tengine automation\n\tmechanical systems\n\tHSE standards\n\tMicrosoft Office\n\ttechnical reporting\n\tcommunication\n\tnetworking\n\tcustomer service",
  "apply_company": "Everllence"
}