{
  "name": "Tomasz Lee",
  "role_name": "Back End Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Back End Engineer with 9+ years of experience in designing and developing robust applications utilizing **Java**, **Spring Boot**, **Micronaut**, and **Kubernetes**. Proficient in containerization with **Docker** and cloud solutions with **AWS**. Demonstrated expertise in **Kafka** for event sourcing and skilled in database design and software design. Known for writing clean code and implementing best practices to enhance software quality. Strong collaborator and communicator with a track record of mentoring junior developers and leading projects to success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Back End Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Applied clean code principles and software design patterns to develop robust backend solutions using **Java** and **Spring Boot** for high-efficiency microservices.\nExecuted containerization with **Docker** and orchestrated services using **Kubernetes**, enhancing deployment scalability by deploying on **AWS** cloud.\nUtilized **Apache Kafka** for event sourcing and real-time data processing, improving system responsiveness and reliability.\nDesigned an efficient **database design** architecture, successfully implementing schema changes that improved data retrieval times by **30%**.\nImplemented effective mentoring practices to guide junior developers in best practices for **collaboration** and **communication**.\nDeveloped integration tests and ensured **clean code** standards were met, increasing overall code quality and maintainability.\nLed efforts in optimizing system performance, achieving a **25%** reduction in response time through effective resource management.\nCollaborated closely with frontend teams to provide RESTful APIs, ensuring seamless integration and communication across services.\nParticipated in sprint planning and retrospectives, fostering a culture of continuous improvement and adaptability within the team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and developed microservices architecture using **Kafka** for event sourcing, enhancing system scalability and supporting **Kubernetes** deployment.\nImplemented RESTful APIs with **Java** and **Spring Boot**, facilitating real-time data access and integration with databases like **PostgreSQL** and **MySQL**.\nOptimized database design and queries, achieving a **30%** performance improvement in data storage and retrieval.\nUtilized **Docker** for containerization, streamlining the development and deployment process while ensuring application consistency across environments.\nLed the integration of **AWS** services for improved cloud capabilities, enhancing system reliability and reducing downtime by **20%**.\nConducted regular code reviews focusing on clean coding principles, fostering a culture of quality and professionalism within the team.\nMentored junior developers, enhancing their skills in software design and collaboration, resulting in a **15%** improvement in overall team productivity.\nCollaborated with cross-functional teams to clearly define project requirements, ensuring timely deliveries and alignment with business objectives.\nEmphasized effective communication skills for stakeholder engagement, providing updates on project progress and challenges.\nImplemented CI/CD pipelines using Jenkins, reducing deployment errors by **30%**, and ensuring a smoother transition from development to production."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and maintained robust back-end services using **Java** and **Spring Boot**, enhancing system reliability and reducing downtime by **15%**.\n• Implemented **Kafka** for real-time messaging capabilities, improving data processing speed and system responsiveness.\n• Designed and optimized database structures, achieving a **25%** increase in query performance and ensuring data integrity through best practices in **database design**.\n• Deployed applications in a **Kubernetes** environment, improving scalability and resource management by **30%**.\n• Utilized **Docker** for containerization of applications, streamlining development and deployment processes.\n• Engaged in **clean code** principles to ensure maintainable codebases and foster collaborative development within the team.\n• Conducted knowledge-sharing sessions and provided **mentoring** to junior developers, fostering a culture of continuous improvement.\n• Collaborated with cross-functional teams to enhance communication and ensure clear alignment with project objectives.\n• Actively participated in code reviews promoting best practices and facilitating skill development across the team.\n• Applied event sourcing techniques to improve the flexibility and auditability of back-end systems.\n"
    }
  ],
  "skills": "**Programming Languages**\n\tJava, JavaScript, TypeScript, C#, Python\n\n**Backend Frameworks**\n\tSpring Boot, Micronaut, NodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, Docker, Kubernetes\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, database design\n\n**DevOps**\n\tCI/CD pipelines, Kafka, event sourcing\n\n**Cloud & Infrastructure**\n\tAWS\n\n**Other**\n\tUX/UI Design, Git, GitHub, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, microservices, clean code, collaboration, communication, mentoring, software design, Blockchain, Solidity, Ether.js, Web3.js, Ethereum"
}