{
  "name": "Rei Taro",
  "role_name": "Software / Application Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Skilled Software / Application Developer with over 10 years of experience in crafting robust and efficient backend systems. Proficient in **C#**, **.NET**, and **Microsoft Azure**, with a specialized focus on developing **RESTful APIs** and automation solutions leveraging **PowerShell** and **Power Automate**. Experienced in **Low-Code Development** and creating scalable applications that enhance operational efficiency. Strong problem-solving skills combined with a collaborative mindset, backed by a history of successful contributions to critical projects in agile environments. Originating from a background that includes significant work with high-profile clients such as VISA, Sii Poland, and Reply Polska, I bring a solid foundation in both software architecture and effective communication.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Software / Application Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed automation solutions using **C#** and **.NET** frameworks to streamline document handling and user onboarding processes.\nImplemented low-code development strategies with **Power Apps** and **Power Automate** to enhance user engagement by improving workflows.\nEngineered RESTful APIs for efficient communication between frontend applications and backend services, achieving **99.9%** uptime.\nLeveraged **Microsoft Azure** for deploying scalable applications, utilizing cloud services to ensure high availability and reliability in operational environments.\nManaged SQL databases to handle data storage and retrieval efficiently, ensuring data integrity across systems.\nLed agile team collaborations to address integration challenges, resulting in a **25%** reduction in deployment times through effective problem-solving and communication.\nUtilized **PowerShell** scripts for automation, streamlining repetitive tasks, and enhancing overall team productivity by **30%**.\nEnsured compliance with industry standards through comprehensive testing and security assessments, boosting system security measures.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **C#** and **.NET** to develop low-code applications, enhancing user interactions and improving operational efficiency by **30%**.\nImplemented **PowerShell** scripting for automation tasks, significantly reducing manual workloads and time spent on routine processes by **50%**.\nDesigned and deployed backend services using **Microsoft Azure** and **RESTful APIs**, achieving seamless integration of various applications and services within the ecosystem.\nExecuted **Power Automate** workflows to streamline document processing, resulting in a **40%** faster handling time for user onboarding tasks.\nCollaborated with cross-functional teams using Agile methodologies to ensure effective communication and project milestones were met, facilitating successful deployments of new features at least **3 times** a quarter.\nLeveraged SQL for database management and optimization, ensuring data integrity and smooth performance of applications in production environments.\nWorked on enhancing problem-solving strategies in project initiatives, contributing to a **20%** increase in team productivity through effective collaboration and communication techniques."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **C#** and **.NET** to develop scalable backend services, enhancing automation for trade execution and portfolio management.\nEngineered **RESTful APIs** to facilitate smooth communication between frontend and backend systems, ensuring efficient data retrieval and interaction for users.\nLeveraged **Microsoft Azure** for cloud-based solutions, improving application deployment speed by **30%** and reliability.\nImplemented workflow automation solutions using **Power Automate** and **Power Apps**, increasing operational efficiency by **25%**.\nCollaborated with cross-functional teams with a focus on **Agile** methodologies, enhancing team communication and project turnaround time by **15%**.\nApplied **SQL** for database management and optimization, resulting in reduced query response times by **20%**.\nDeveloped comprehensive test plans and executed rigorous QA processes using **PowerShell**, ensuring software integrity and reliability.\nDemonstrated strong problem-solving skills by troubleshooting complex issues, leading to improved system performance and user satisfaction."
    }
  ],
  "skills": "Programming Languages: C#, Python (3.8+), SQL, Bash, JavaScript\n\n\tBackend Frameworks: .NET, FastAPI, Flask, Django, Celery\n\n\tFrontend Frameworks: \n\n\tAPI Technologies: RESTful APIs, REST/gRPC APIs\n\n\tServerless and Cloud Functions: AWS (EC2, S3, Lambda), Microsoft Azure, Azure DevOps\n\n\tDatabases: PostgreSQL, MySQL, MongoDB, Redis\n\n\tDevOps: Docker, Kubernetes, GitHub Actions, CI/CD, Git\n\n\tCloud & Infrastructure: \n\n\tOther: Automation, Low-Code Development, Power Apps, Power Automate, Agile, Problem-solving, Communication, Collaboration, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, PyTest"
}