{
  "name": "Tomasz Lee",
  "role_name": "Senior QA Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior QA Engineer with 9+ years of experience in manual testing, test automation, and quality assurance for mobile applications and backend services. Proficient in **Playwright**, **Cypress**, and **Appium** for automated testing, as well as skilled in building CI/CD pipelines with **Docker** and **Kubernetes**. Expert in microservices architecture and cloud platforms, utilizing **monitoring tools** such as **Prometheus**, **Grafana**, **Datadog**, and **New Relic** to ensure application performance and reliability. Proven track record in optimizing testing processes, leveraging scripting languages to enhance test strategies, and delivering high-quality software solutions. Strong communication skills with a collaborative approach to leading cross-functional teams and completing projects efficiently.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and implemented test automation strategies for backend services, ensuring robust quality assurance protocols across applications.\nDesigned comprehensive manual testing processes for mobile applications, achieving a defect rate reduction of **30%**.\nUtilized **Cypress** and **Playwright** to automate functional and regression tests, enhancing test coverage by **50%**.\nIntegrated CI/CD pipelines within **Azure DevOps**, resulting in a **40%** decrease in deployment time and faster release cycles.\nExecuted and maintained containerization strategies using **Docker** and **Kubernetes** to streamline testing environments.\nCollaborated with developers to establish a **microservices architecture**, improving scalability and facilitating quicker testing and deployment cycles.\nEmployed **monitoring tools** such as **Prometheus**, **Grafana**, and **Datadog** for observability, enabling real-time feedback on system performance and stability.\nConducted performance testing and optimization to ensure high availability and reliability of services, reducing latency by **25%**.\nEnhanced communication across teams to streamline the integration of quality processes, fostering a culture of continuous improvement."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented comprehensive **test automation** strategies using **Cypress** and **Playwright**, improving test coverage by **40%** across various applications.\nConducted **manual testing** for mobile applications, identifying critical bugs and reducing overall defect rates by **20%**.\nCollaborated with development teams to design and execute **backend services** tests, ensuring robust functionality in a **microservice architecture** environment.\nLed the integration of **CI/CD pipelines** using tools such as **Docker** and **Kubernetes**, streamlining the deployment process and enhancing product release frequency by **50%**.\nDeveloped automation scripts using various **scripting languages**, facilitating efficient regression testing across multiple platforms.\nUtilized monitoring and observability tools like **Prometheus**, **Grafana**, and **Datadog** to analyze application performance and ensure system reliability.\nTrained and mentored junior QA engineers, improving the team's overall skill set and productivity by **30%**.\nEffectively communicated with stakeholders to refine testing strategies and report on quality metrics, enhancing transparency and project timelines.\nRegularly performed code reviews and shared best practices in quality assurance, fostering a culture of continuous improvement within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Performed thorough QA and manual testing of mobile applications, ensuring a seamless user experience and adherence to quality standards.\nExecuted test automation scripts using **Cypress** and **Playwright**, improving test coverage by 40% and reducing regression testing time by **50%**.\nDeveloped and maintained CI/CD pipelines utilizing **Docker** and **Kubernetes**, enhancing deployment efficiency and reliability.\nCollaborated with backend services in a **microservice architecture** to ensure comprehensive test cases and validation of service integrations.\nImplemented observability tools such as **Prometheus** and **Grafana** for monitoring application performance and identifying issues early in the development cycle.\nParticipated in cross-functional teams to provide insights on mobile application performance, utilizing tools like **New Relic** and **Datadog** for real-time monitoring.\nCreated detailed test cases and documentation to facilitate knowledge transfer and align team objectives during the development cycle.\nEngaged in daily standups and code reviews, contributing to team communication and ensuring adherence to project goals.\nLeveraged scripting languages to automate testing processes, resulting in a 30% reduction in manual testing efforts and increased test accuracy.\nDelivered feedback and participated in discussions regarding potential improvements to enhance mobile application quality and reliability."
    }
  ],
  "skills": " **Programming Languages** \n\t Python, JavaScript, TypeScript \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework \n\n **Frontend Frameworks** \n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL \n\n **Serverless and Cloud Functions** \n\t AWS, Azure \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n **DevOps** \n\t CI/CD pipelines, Docker, Kubernetes \n\n **Cloud & Infrastructure** \n\t cloud platforms, monitoring tools, observability tools, Prometheus, Grafana, Datadog, New Relic \n\n **Other** \n\t UX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, QA, manual testing, mobile applications, backend services, microservice architecture, test automation, Playwright, Cypress, Appium, communication skills, Jest, Moq, Selenium, JMeter"
}