{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with 9+ years of experience in developing high-throughput systems and event-based systems. Proficient in **Node.js**, **TypeScript**, and **SQL**, with a strong focus on performance optimization and debugging. Experienced in leveraging **AWS** for scalable cloud solutions and employing cross-functional collaboration to maximize project success. A product-minded professional with a proven ability to navigate complex challenges and foster empathetic communication within teams. Specialized in designing robust software architectures and driving efficiency through innovative solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Leveraged **Node.js** and **TypeScript** to develop scalable backend services, ensuring high-throughput systems that can handle up to **1000** concurrent connections.\n• Implemented performance optimization strategies, reducing response times by **30%** and enhancing overall system efficiency.\n• Designed and executed SQL database solutions to optimize data retrieval speed, decreasing average query execution times by **20%**.\n• Collaborated cross-functionally with frontend developers and UX/UI teams to ensure cohesive product delivery, fostering a product-minded approach.\n• Utilized **AWS** services for deploying and managing cloud infrastructure, ensuring scalability and reliability in production environments.\n• Developed event-based systems that improve application responsiveness and system resilience, achieving robust data handling through integration with **RabbitMQ** and **Apache Kafka**.\n• Ensured thorough debugging and testing processes to maintain high code quality and performance standards.\n• Employed empathetic communication skills to understand team dynamics and foster a collaborative work environment, adapting to changing project requirements swiftly."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Node.js** and **TypeScript** to develop and enhance high-throughput systems, leading to a **30%** improvement in data processing speed.\nImplemented robust SQL queries within both **MSSQL** and **MySQL** databases to achieve better performance optimization and ensure data integrity.\nDesigned event-based systems utilizing **RabbitMQ** and **Apache Kafka** for efficient task orchestration and real-time data streaming capabilities, successfully reducing event latency by **20%**.\nCollaborated cross-functionally with UX and product teams to define requirements and timelines, ensuring a cohesive project delivery approach that met stakeholder needs.\nOptimized application performance through effective debugging techniques, resulting in a **25%** reduction in error rates.\nEmployed **AWS** services to deploy scalable cloud solutions that support backend operations, enhancing system reliability.\nGuided junior developers through code reviews and mentorship, fostering a culture of continuous learning and improvement within the team.\nCommunicated empathetically with team members and stakeholders, ensuring transparency and alignment throughout the project lifecycle.\nAdapted to changing project requirements swiftly while maintaining a product-minded approach, contributing to a **15%** increase in user satisfaction."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Node.js** and **TypeScript** to build high-throughput systems capable of processing over **1000** requests per minute, significantly enhancing backend performance and user experience.\nDesigned and optimized SQL queries and database structures, resulting in query efficiency improvements of **30%**, ensuring rapid data access and manipulation.\nImplemented event-based systems to manage asynchronous operations, improving system responsiveness and resource utilization under load conditions.\nCollaborated with cross-functional teams to align project goals and deliver solutions, showcasing strong empathetic communication and cross-group collaboration.\nAdapted quickly to changing project requirements while maintaining a product-minded approach to development, focusing on user impact.\nEngaged in debugging and performance optimization activities that reduced latency in application features by **15%**, contributing to smoother user experiences.\nContributed to the integration of various AWS services, leveraging cloud capabilities to enhance system scalability and robustness.\nParticipated in daily standups and code reviews, ensuring code quality and adherence to coding standards while fostering a collaborative team environment.\nProvided technical documentation and user guides to facilitate knowledge transfer and ensure usability of developed systems."
    }
  ],
  "skills": "Programming Languages: TypeScript, SQL, JavaScript, Python\n\n\tBackend Frameworks: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n\tFrontend Frameworks: ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n\tAPI Technologies: RESTful API, GraphQL\n\n\tServerless and Cloud Functions: AWS\n\n\tDatabases: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n\tDevOps: CI/CD pipelines\n\n\tCloud & Infrastructure: Azure\n\n\tOther: UX/UI Design, Git, GitHub, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Solidity, Ether.js, Web3.js, Ethereum, event-based systems, cross-functional collaboration, high-throughput systems, performance optimization, debugging, empathetic communication, product-minded approach, adaptability",
  "apply_company": "ClickUp"
}