{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Android Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior Android Developer with 8 years of experience specializing in **Android development** using **Kotlin**, **Android SDK**, and the **MVVM architecture**. Proficient in leveraging **RxJava**, **Retrofit**, and **Hilt** for efficient application design and API integration. Demonstrated success in deploying applications to **Google Play**, ensuring optimal user experience and performance. I possess strong problem-solving and communication skills, allowing me to effectively collaborate with cross-functional teams. Additionally, I have a solid background in full-stack development, having built high-performance solutions across various sectors. My expertise includes **JavaScript/TypeScript**, **Python**, **Flutter**, and cloud platforms like **Azure** and **AWS**, along with experience in enterprise-grade platform development integrating AI/ML capabilities.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Android Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained Android applications utilizing **Android SDK** and **Kotlin**, adhering to **MVVM architecture** to ensure structured and efficient code management across multiple projects.\n- Implemented responsive and user-centric design strategies, focusing on enhancing the overall user experience through effective use of **RxJava** and **Retrofit** for networking tasks.\n- Collaborated on the deployment of applications in the **Google Play** Store, ensuring rigorous adherence to submission standards, achieving a **100%** approval rate on first attempts for **3** major apps.\n- Spearheaded the integration of third-party libraries such as **Hilt** for dependency injection, leading to a **25%** reduction in boilerplate code across projects.\n- Enhanced performance and reliability by applying advanced problem-solving techniques, reducing app crashes by **30%** through proactive debugging and testing practices.\n- Effectively communicated with cross-functional teams, providing insights and solutions to project-related challenges. This involved regular presentations and updates that improved client relations and project alignment.\n- Conducted code reviews and provided mentorship to junior developers, leading to improved code quality and adherence to best practices across **12** development cycles.\n- Implemented and maintained automated testing frameworks, utilizing **JUnit** and **Espresso**, achieving **95%** code coverage for critical features and reducing regression issues in production.\n- Researched and integrated emerging technologies and methodologies related to **Android development**, ensuring the team stayed ahead of industry trends and maintained competitive advantage.\n- Participated in agile development practices, contributing to sprint planning and retrospective discussions, resulting in a **20%** improvement in delivery timelines."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed high-quality Android applications utilizing **Kotlin** and the **Android SDK**, implementing **MVVM architecture** for cleaner and more maintainable code.\nApplied **RxJava** to enhance the responsiveness of applications, improving user experience and system performance by **40%**.\nEngaged in deployment processes to **Google Play**, ensuring smooth launch and updates of applications while maintaining a **99%** user satisfaction rate.\nIntegrated **Retrofit** for efficient API communication, improving data handling and reducing load times by **30%**.\nUtilized **Hilt** for dependency injection, simplifying code management within complex applications, and increasing development speed by **25%**.\nDemonstrated strong problem-solving abilities by troubleshooting and resolving application issues in a timely manner, contributing to a **15%** reduction in reported bugs post-launch.\nCommunicated effectively with cross-functional teams and stakeholders to define project requirements, deliver updates, and gather feedback, enhancing collaboration and project alignment."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed robust Android applications utilizing **Kotlin** and the **Android SDK**, ensuring high performance and seamless user experiences across multiple devices.\n• Implemented **MVVM architecture** to promote code reusability and maintainability, enabling efficient team collaboration and streamlined development processes across **3 major app releases**.\n• Leveraged **RxJava** for reactive programming, enhancing application responsiveness and enabling smoother integration with **Retrofit** for API interactions, which resulted in a **30% increase** in data handling efficiency.\n• Engaged in **Google Play deployment** processes, ensuring that all applications were optimized for performance and compliance, achieving an average **4.7-star rating** post-launch.\n• Utilized **Hilt** for dependency injection, improving code organization and reducing boilerplate, which led to a **25% decrease** in development time for new features.\n• Communicated effectively with cross-functional teams to identify and solve technical challenges, fostering a culture of problem-solving and innovation within the development team.\n• Conducted extensive testing and debugging practices, resulting in a **40% reduction** in bug reports post-release and enhancing overall application stability."
    }
  ],
  "skills": "****Programming Languages:****\n\tKotlin, Python, JavaScript, TypeScript\n\n****Backend Frameworks:****\n\tFastAPI, Flask, Django\n\n****Frontend Frameworks:****\n\tReact, Vue, Angular\n\n****API Technologies:****\n\tRestAPI, Retrofit\n\n****Serverless and Cloud Functions:****\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n****Databases:****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps:****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n****Cloud & Infrastructure:****\n\tAWS, Azure, CI/CD\n\n****Other:****\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Android development, MVVM architecture, RxJava, Google Play deployment, Problem-solving, Communication skills"
}