{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Lead/Staff Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Proficient in **Python**, relational databases, and data modeling, with expertise in distributed systems and cloud platforms, particularly **AWS**. Skilled in infrastructure-as-code, container orchestration, and DevOps pipelines, ensuring platform reliability and observability. Accomplished in applying software design patterns and testing practices to enhance performance optimization.\n\nAn innovative Full Stack Developer with 13+ years of experience in delivering high-performance applications in the healthcare and financial sectors. Demonstrates leadership with a strong collaborative mindset and proactive, pragmatic approach. Experienced in building AI/ML-powered platforms using **FastAPI** and **Django**, and deploying cloud-native systems on **AWS** and **Azure**. Committed to compliance-driven development and MLOps, with hands-on expertise in **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Lead/Staff Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Led the design and implementation of scalable **cloud platforms** for healthcare and fintech using **Python** and **AWS**, ensuring high platform reliability with performance optimization strategies that reduced response times by up to **30%**.\n• Engineered distributed systems with a focus on **data modeling** and **relational databases**, leveraging **PostgreSQL** and **MongoDB** to support efficient data storage and retrieval, achieving a data query optimization of **25%**.\n• Developed and maintained **DevOps pipelines** with **GitHub Actions** and **CircleCI**, ensuring observability and robust testing practices that led to a **40%** reduction in deployment failures.\n• Implemented **infrastructure-as-code** using **Terraform**, streamlining the creation and management of cloud resources with versioning aligned to **2.0** standards.\n• Built and orchestrated **containerized environments** using **Docker** and **Kubernetes (EKS)**, ensuring seamless deployment processes for microservices and facilitating rollback capabilities with **99%** uptime.\n• Cultivated a collaborative mindset within teams through effective leadership and strong communication, leading to increased project engagement and a **15%** improvement in team productivity.\n• Spearheaded the adoption of advanced **testing practices**, establishing a suite of automated tests using **Jest** and **Cypress**, which enhanced coverage to **95%** across different codebases.\n• Championed proactive monitoring and observability solutions, integrating tools like **ELK Stack** and **Prometheus** to track system performance and quickly diagnose issues, yielding a **20%** reduction in incident resolution times.\n• Engaged in software design patterns, ensuring pragmatic approaches were applied to complex system challenges, promoting maintainable and extensible codebases.\n• Drove performance optimization initiatives across platforms, resulting in system enhancements that supported real-time analytics and reduced latency issues for high-traffic applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Led the modernization of core financial platforms by migrating to microservices architecture, utilizing **Python** and implementing **software design patterns** for enhanced scalability and performance in high-volume transactional systems.\n• Developed relational database solutions and established effective **data modeling** practices to support critical financial applications, ensuring data integrity and performance.\n• Architected distributed systems with **cloud platforms** such as **AWS** and incorporated **infrastructure-as-code** to streamline deployment processes and enhance platform reliability.\n• Implemented **DevOps pipelines** for continuous integration and deployment, enhancing operational efficiency and software testing practices by **50%**.\n• Collaborated with cross-functional teams, fostering a **collaborative mindset** and strong communication to drive projects forward, leading to a **20%** decrease in project delivery times.\n• Designed and deployed an observability framework to monitor system performance and platform reliability, achieving a **99.9%** uptime across services.\n• Championed performance optimization initiatives, resulting in a **30%** improvement in application responsiveness and efficiency.\n• Emphasized proactive leadership by mentoring junior engineers and establishing best practices in development and testing strategies for enhancements in team performance."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Led the design and optimization of backend services for a global e-commerce platform using **Python** (FastAPI, Django) and **Node.js** (NestJS, Express), focusing on high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\n\n- Engineered distributed systems leveraging **AWS** services for cloud solutions to improve platform reliability and performance optimization.\n- Oversaw infrastructure-as-code implementation using tools like Terraform and managed container orchestration with **Kubernetes**, ensuring efficient DevOps pipelines and seamless deployments.\n\n- Spearheaded testing practices and observability strategies, integrating monitoring tools to enhance system performance and reliability, reducing downtime by **30%**.\n- Championed data modeling and utilized relational databases such as **PostgreSQL** and **MongoDB**, ensuring robust data integrity and fast data access across high-traffic e-commerce environments.\n\n- Fostered a collaborative mindset and strong communication within cross-functional teams, implementing leadership strategies that improved project completion rates by **25%**.\n- Introduced pragmatic solutions for proactive incident response and troubleshooting in software design patterns, driving a 15% decrease in resolution times for critical issues.\n\n- Developed and optimized data storage solutions using caching mechanisms with **Redis** and **Cassandra** to enhance performance, achieving a **40%** improvement in read operations.\n\n- Implemented observability practices to monitor and analyze system behavior, ensuring platform reliability and reducing performance bottlenecks.\n\n- Advocated for role-based access control (RBAC) and OAuth 2.0 protocols throughout the platform, ensuring compliance with GDPR and enhancing security measures to protect user data."
    }
  ],
  "skills": " \n**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, relational databases, data modeling\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, DevOps pipelines\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, infrastructure-as-code, container orchestration\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Terraform, Ansible, Helm, Docker Compose, distributed systems, observability, platform reliability, software design patterns, testing practices, performance optimization, leadership, strong communication, collaborative mindset, proactive, pragmatic"
}