{
  "name": "Tomasz Lee",
  "role_name": "Automation QA",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Automation QA professional with 9+ years of extensive experience in quality assurance, specializing in automation testing, E2E testing, and CI/CD processes. Proficient in **Playwright**, **TypeScript**, and REST APIs, with a strong command over tools like **Postman**, **Swagger**, and **curl**. Demonstrated capability in both manual and automated testing within Agile and Scrum methodologies, ensuring high-quality deliverables in client-server architecture. Experienced in cross-platform mobile testing and database management using SQL and NoSQL. Original strengths include adeptness in utilizing **Apache Kafka**, **RabbitMQ**, and **Redis** alongside a robust full stack development background in **ReactJS**, **NextJS**, **.NET**, and **C#**. Committed to optimizing testing processes and enhancing collaboration across teams to achieve project goals effectively.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Automation QA",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Playwright** for automation testing, enhancing the testing process efficiency by **30%**.\nExecuted **E2E testing** with a focus on multi-platform applications, ensuring high reliability across browsers and devices.\nDeveloped and maintained **REST APIs** testing protocols using **Postman** and **Swagger**, significantly improving API reliability.\nImplemented and monitored **CI/CD** pipelines to automate deployments, achieving a **40%** reduction in release time.\nCollaborated in an **Agile** and **Scrum** environment with cross-functional teams to optimize the testing process, ensuring alignment with project goals.\nDrafted comprehensive test cases and automation scripts using **TypeScript**, contributing to a **25%** increase in test coverage.\nExecuted SQL and **NoSQL** queries for data validation, verifying the integrity of the application’s data layer.\nParticipated in client-server architecture testing, ensuring robust functionality and performance across clients.\nConducted cross-platform mobile testing to ensure compatibility and superior user experience.\nLeveraged **AI testing tools** for predictive analysis, enhancing the effectiveness of the testing strategy."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and executed **automation testing** strategies, ensuring high-quality deliverables and seamless user experience across platforms.\nImplemented **E2E testing** using **Playwright** and **TypeScript** to guarantee application reliability, leading to a 20% reduction in post-release defects.\nIncorporated **REST APIs** testing using tools like **Postman** and **Swagger**, resulting in enhanced service reliability and integration efficiency.\nSet up and maintained **CI/CD** pipelines using automation tools, accelerating deployment times by 30% while minimizing errors.\nCollaborated in an **Agile** environment, actively participating in **Scrum** meetings to facilitate timely project adjustments and effective sprint planning.\nDesigned test cases and conducted **cross-platform mobile testing** to ensure comprehensive coverage and compatibility across various devices.\nConducted performance and regression tests leveraging **HTTP protocol** standards, improving application response times by 15%.\nUtilized **SQL** and **NoSQL** databases for effective data management and validation during testing processes.\nMentored junior QA team members on best practices and the use of **AI testing tools**, bolstering overall team competency and efficiency.\nRegularly reviewed development and testing workflows, implementing enhancements that increased throughput and reduced manual errors by 25%."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Executed comprehensive **E2E testing** strategies using **Playwright** and **TypeScript**, elevating software quality assurance processes and ensuring robust system performance.\nDeveloped automated test scripts to streamline **QA** processes, achieving a **30%** reduction in testing time.\nCollaborated in an **Agile** environment, participating in **Scrum** ceremonies to align testing efforts with product development timelines.\nIntegrated **REST APIs** and utilized **Postman** and **Swagger** for thorough testing and validation of API endpoints, ensuring seamless data exchange.\nLeveraged **SQL** and **NoSQL** databases to validate data integrity and performance, improving accuracy in test results by **15%**.\nEnhanced CI/CD pipelines to facilitate continuous integration and deployment, achieving deployment cycles at an average of **2 releases per week**.\nUtilized **curl** for testing and troubleshooting HTTP requests, improving response validation speed.\nSupported cross-platform mobile testing initiatives, ensuring application stability across devices.\nContributed to the development of a client-server architecture, optimizing application performance and user experience.\nParticipated in code reviews and provided valuable feedback, fostering knowledge sharing and adherence to coding standards."
    }
  ],
  "skills": " **Programming Languages**\n\tTypeScript, Python\n\n **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **API Technologies**\n\tRESTful API, GraphQL, REST APIs, Postman, Swagger, curl\n\n **Serverless and Cloud Functions**\n\t\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL, NoSQL\n\n **DevOps**\n\tAWS, Azure, CI/CD pipelines, CI/CD\n\n **Other**\n\tUX/UI Design, Git, GitHub, NUnit, xUnit, Selenium, Moq, JMeter, Jest, Automation testing, E2E testing, QA, Agile, Scrum, client-server architecture, HTTP protocol, AI testing tools, cross-platform mobile testing, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Blockchain: Solidity, Ether.js, Web3.js, Ethereum"
}