{
  "name": "Tomasz Lee",
  "role_name": "Senior Field Service Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Highly adaptable Senior Field Service Engineer with over 9 years of experience in troubleshooting mechanical and electrical systems, alongside a proven track record in performance testing. Skilled in organizing and leading teams to deliver exceptional customer support and satisfaction while demonstrating strong report writing capabilities. Adept in utilizing Microsoft Office for documentation and reporting, seamlessly integrating technical expertise to enhance service delivery. Possesses strong organizational skills and team leadership qualities, ensuring projects are completed efficiently and effectively, while also managing engine performance assessments.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Service Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Demonstrated strong troubleshooting skills by diagnosing mechanical and electrical issues in engine systems, ensuring operational efficiency and safety compliance (HSE).\n• Enhanced customer support initiatives by providing timely maintenance and technical assistance, contributing to a 30% increase in customer satisfaction ratings.\n• Led a team of field technicians, fostering effective organizational skills and team leadership to successfully complete **9** major projects ahead of schedule.\n• Conducted thorough performance testing on electrical systems, achieving a **15%** increase in overall system reliability.\n• Produced detailed report writing for equipment performance and maintenance schedules, utilizing **Microsoft Office** for documentation and analysis.\n• Adapted quickly to changing field environments and customer needs, effectively managing multiple service requests simultaneously.\n• Collaborated with cross-functional teams to ensure seamless integration of mechanical and electrical components in engine systems, boosting operational uptime by **20%**.\n• Maintained comprehensive records and logs to facilitate performance reviews and improvement strategies, ensuring adherence to quality standards."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Led team leadership efforts in troubleshooting and performance testing of mechanical and electrical systems, resulting in a 20% reduction in on-site resolution times.\nUtilized strong organizational skills to coordinate equipment installations and maintenance, ensuring adherence to HSE standards.\nProvided exceptional customer support, maintaining a 95% satisfaction rate through effective communication and problem-solving capabilities.\nDeveloped and maintained comprehensive report writing practices, improving documentation accuracy by **30%**.\nTrained and mentored junior technicians in troubleshooting techniques and operational best practices, fostering a culture of continuous improvement.\nAdapted quickly to changing field conditions and client needs, demonstrating flexibility and resilience in high-pressure situations.\nConducted assessments and inspections of engine performance, directly contributing to a **15%** increase in operational efficiency.\nImplemented Microsoft Office tools for detailed project reporting, enhancing data presentation and readability by **25%**.\nCollaborated with cross-functional teams to drive improvements in service delivery and technical support processes, achieving project milestones consistently."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Executed mechanical and electrical troubleshooting for engine systems, ensuring optimal performance in the field.\n• Conducted performance testing to identify areas for improvement, leading to a 15% increase in engine efficiency.\n• Provided exceptional customer support, resolving client issues within an average of **2 hours** to maintain high satisfaction ratings.\n• Managed organizational tasks and reporting utilizing **Microsoft Office**, producing detailed reports that improved team communication by **30%**.\n• Led a team by fostering adaptability and collaboration, ensuring all project deadlines were met without compromising quality.\n• Developed comprehensive report writing standards to streamline documentation processes for field service activities.\n• Enabled mechanical and electrical systems enhancements based on field data analysis, resulting in a **25%** reduction in service visits.\n• Participated in HSE (Health, Safety, and Environment) compliance audits, reinforcing commitment to safety standards across the team.\n• Implemented training programs to elevate team leadership capabilities and overall performance in service delivery."
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS,\n\tBackend Technologies: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices,\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis,\n\tDatabase Systems: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB,\n\tCloud & DevOps: AWS, Azure, CI/CD pipelines,\n\tOther Skills: UX/UI Design, Git, GitHub, RESTful API, GraphQL, Python, Redux, mechanical, electrical, engine, HSE, troubleshooting, performance testing, customer support, Microsoft Office, report writing, team leadership, organizational skills, adaptability",
  "apply_company": "Everllence"
}