{
  "name": "Tomasz Lee",
  "role_name": "Senior Web Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Web Engineer with 9+ years of experience, proficient in **TypeScript**, **gRPC**, and web infrastructure. Demonstrated expertise in API integration, dependency management, and build tooling, enhancing developer experience through effective documentation and robust SDKs. Specialized in **microservices** architecture and distributed systems with hands-on experience in **Apache Kafka**, **RabbitMQ**, and **Redis**. Skilled in both frontend and backend technologies, including **ReactJS**, **NextJS**, **.NET**, and **C#**. Proven track record in delivering high-quality solutions, optimizing performance, and streamlining development processes through cross-functional collaboration and leadership in development projects.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **TypeScript** in developing scalable web applications, ensuring robust type safety and maintainable code structure.\nImplemented **gRPC** for efficient communication between microservices, enhancing system performance and enabling smooth API integration.\nDesigned and maintained web infrastructure, focusing on high availability and resilience across different modules.\nExecuted dependency management strategies to streamline library and package updates, minimizing downtime and integration issues.\nEnhanced build tooling processes to improve developer experience, with a focus on reducing build time by **30%** and increasing deployment frequency.\nChampioned API integration efforts, resulting in a cohesive and seamless user experience across services.\nCreated detailed documentation for system architecture and API endpoints, improving cross-team collaboration and onboarding efficiency by **40%**.\nFostered cross-functional collaboration with UX/UI designers and product stakeholders to drive feature development aligned with user needs.\nSpearheaded the development of a web-based customer management platform using **.NET 7**, leveraging **ReactJS** and **Next.js**, boosting user satisfaction by **25%**.\nImplemented CI/CD pipelines on **Azure DevOps**, significantly reducing deployment time by **40%** and enhancing delivery cycles.\nOptimized MSSQL database queries, reducing average execution time by **20%** for improved system responsiveness.\nIntegrated **Redis** for caching, decreasing database load and improving response times by **35%**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Spearheaded the development of robust web infrastructure leveraging **TypeScript** and **Angular**, which significantly enhanced system reliability and maintainability.\n• Integrated **gRPC** for efficient client-server communication, streamlining data exchange processes by **40%**.\n• Executed comprehensive API integrations with **.NET Core** and third-party SDKs, ensuring seamless functionality across applications and platforms.\n• Developed custom build tooling and managed dependencies, resulting in a **20%** decrease in build times and consistent version control.\n• Collaborated cross-functionally with product managers and design teams, ensuring alignment on system requirements and project timelines, which improved delivery speed by **25%**.\n• Produced detailed documentation for APIs and SDKs, facilitating ease of use and enhancing developer experience across the board.\n• Designed and maintained responsive UI components using **ReactJS** and **Tailwind CSS**, increasing user engagement by **25%**.\n• Implemented CI/CD pipelines with **GitHub Actions**, achieving a **30%** reduction in deployment errors and improving overall project stability.\n• Managed and optimized databases using **PostgreSQL**, **MSSQL**, and **MySQL** for high performance and quick data retrieval.\n• Conducted thorough code reviews and provided mentorship to junior developers, elevating team productivity and ensuring adherence to best practices.\n• Created interactive data visualizations with **D3.js** for enhanced project tracking and reporting, improving stakeholder engagement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **TypeScript** and **gRPC** to build efficient web infrastructures, enhancing overall developer experience by **30%**.\nImplemented efficient dependency management practices, leading to a **25%** reduction in build times using modern **build tooling** strategies.\nIntegrated various third-party SDKs to facilitate seamless **API integration**, thus improving cross-functional collaboration and data sharing.\nDocumented key processes and frameworks, providing comprehensive technical documentation and user guides that improved onboarding time by **15%**.\nContributed to the development of an internal CRM system using **.NET Framework** and **Angular**, improving sales team productivity by **20%**.\nImplemented **RabbitMQ** to manage message queues for processing customer notifications asynchronously, reducing system load during peak usage.\nCreated a set of reusable components in **Angular** and **C#** to accelerate development for future projects.\nWorked with **SQL Server** to manage and retrieve customer information, improving query efficiency.\nAssisted in migrating legacy code from **ASP.NET WebForms** to **.NET Core**, enhancing system performance and maintainability.\nCollaborated with the DevOps team to set up automated builds and releases in **Azure**, speeding up deployment processes.\nWorked with **Vue.js** to improve the frontend experience on a client-side dashboard, boosting user satisfaction ratings by **40%**.\nParticipated in daily standups and code reviews to ensure alignment with project goals and coding standards."
    }
  ],
  "skills": " **Programming Languages**\n\t TypeScript, Python\n\n **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t HTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL, gRPC, API integration, documentation\n\n **Serverless and Cloud Functions**\n\t AWS, Azure\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\t CI/CD pipelines, web infrastructure, dependency management, build tooling\n\n **Cloud & Infrastructure**\n\t N/A\n\n **Other**\n\t UX/UI Design, Git, GitHub, Redux, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, cross-functional collaboration, developer experience, SDKs",
  "apply_company": "Justera Group"
}