{
  "name": "Tomasz Lee",
  "role_name": "Senior Support Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled in Kubernetes, Terraform, Prometheus, and cloud platforms including **AWS**, **GCP**, and **Azure**, I am an experienced .NET Full Stack Developer with over 9 years in crafting and implementing robust applications. My background includes a solid understanding of distributed systems and microservices architecture while leveraging tools such as **Apache Kafka**, **RabbitMQ**, and **Redis** for effective messaging. Proficient in both frontend and backend development with technologies like **ReactJS**, **NextJS**, **.NET**, and **C#**, I have a proven track record of optimizing performance while streamlining development processes. Additionally, I excel in technical communication and analytical problem-solving, fostering collaboration across teams and leading projects to successful outcomes, all while demonstrating empathy and flexibility in customer support roles.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Provided **technical support** for enterprise customers, utilizing **AWS**, **GCP**, and **Azure** cloud services to resolve issues and optimize their infrastructure.\n• Utilized **Linux** for troubleshooting server environments and ensuring system reliability and uptime of **99.9%**.\n• Conducted performance monitoring and logging with **Prometheus**, ensuring system metrics and alerts were effectively managed, increasing system reliability by **30%**.\n• Developed and maintained infrastructure as code using **Terraform**, streamlining deployment processes and improving deployment speed by **50%**.\n• Collaborated with cross-functional teams to troubleshoot complex issues, applying **coding** skills to identify root causes and implement solutions.\n• Analyzed customer support trends and feedback to improve service delivery through empathy and analytical problem solving, enhancing customer satisfaction ratings.\n• Maintained strong technical communication, providing timely updates and documentation to stakeholders, which improved response times by **20%**.\n• Supported **Kubernetes** orchestration for containerized applications, ensuring smooth scaling and management of cloud resources.\n• Created custom shell scripts to automate routine diagnostics and maintenance tasks, significantly reducing resolution time.\n• Effectively used networking knowledge to diagnose and resolve connectivity issues, enhancing overall network reliability.\n• Participated in SDLC processes, providing insights on technical documentation and process improvement, contributing to a **15%** increase in project delivery efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **AWS** and **Azure** for deploying cloud-based solutions, ensuring high availability and scalability of services.\nImplemented **Kubernetes** for container orchestration, leading to a **40%** improvement in resource utilization.\nDesigned and maintained infrastructure as code using **Terraform**, streamlining the setup and management of cloud environments.\nMonitored systems performance with **Prometheus**, proactively identifying issues and reducing downtime by **20%**.\nExecuted **Shell scripting** for automation of routine tasks, increasing operational efficiency by **30%**.\nEngaged in **technical communication** with cross-functional teams to clarify system requirements and troubleshoot issues effectively.\nProvided **customer support** in resolving technical queries and incidents, maintaining a **95%** satisfaction rate.\nAnalyzed technical problems to determine root causes, employing **analytical problem-solving** techniques to develop effective solutions.\nFostered a flexible work environment, accommodating team members' diverse needs and promoting empathy in discussions.\nAdhered to Software Development Life Cycle (**SDLC**) methodologies, ensuring systematic project planning and execution.\nMentored junior engineers, enhancing their technical skills and fostering a collaborative team environment."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **AWS**, **Azure**, and **GCP** cloud services to enhance system scalability and reliability, supporting a user growth of over **5000** clients.\nImplemented **Kubernetes** for managing container orchestration, achieving a **30%** increase in application deployment speed.\nDeveloped automation scripts using **Terraform** and **Shell** to streamline infrastructure provisioning, reducing setup time by **40%**.\nMonitored system performance with **Prometheus**, ensuring uptime and rapid issue identification for optimum customer support.\nEngaged in technical communication with clients to provide troubleshooting assistance, resulting in a **95%** customer satisfaction rating based on feedback surveys.\nImplemented reliable networking solutions, enhancing the connectivity and security of cloud applications used in the organization.\nCollaborated in agile **SDLC** practices, ensuring high-quality deliverables through effective problem-solving and flexibility in approach.\nFacilitated knowledge sharing through technical documentation and user support guides, thereby improving internal capabilities and support efficiency.\nParticipated in daily standups and peer reviews to promote transparency and adherence to coding standards across the development team."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, GCP\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tKubernetes, Terraform, Prometheus, Linux, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tNetworking, Shell\n\n**Other**\n\tUX/UI Design, Git, GitHub, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Analytical Problem Solving, Customer Support, Technical Communication, Empathy, Flexibility",
  "apply_company": "Chronosphere"
}