{
  "name": "Rei Taro",
  "role_name": "Senior Tech Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Tech Engineer with 10+ years of experience specializing in **PHP**, **Java**, **AWS**, **Docker**, and **API** design. Proficient in developing high-quality, scalable backend systems and services, with a proven track record of delivering impactful projects in Agile and Lean environments. Strong ability to collaborate effectively, utilize **React** for frontend functionalities, and integrate **DevOps** practices in software development. Formerly contributed to significant projects in leading organizations such as VISA, Sii Poland, and Reply Polska, demonstrating expertise in AI/ML pipelines and financial platforms.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Tech Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered backend services using **PHP** and **Java** to streamline document automation, user onboarding, and reporting workflows.\nDeveloped event-driven solutions with **Docker** to manage asynchronous processing for financial transaction requests.\nDeployed microservices on **AWS** and utilized **Agile** methodologies to manage infrastructure as code, ensuring seamless cloud operations.\nCreated and maintained data pipelines for regulatory data exchange with API integrations, ensuring timely and accurate data flow.\nLed security assessments and integrated OAuth2 for secure, scalable authentication systems, achieving a 99.9% uptime.\nCollaborated with cross-functional teams to address system integration challenges, ensure compliance, and oversee release strategies, improving deployment efficiency by **30%**.\nUtilized **Lean** principles to enhance team communication and streamline project workflows."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Docker** and **AWS** for container orchestration and cloud-based deployments, ensuring efficient development and delivery processes.\nImplemented robust **APIs** leveraging **PHP** and **Java** to facilitate seamless data communication between microservices and frontend applications.\nApplied **Agile** methodologies and **Lean** principles to enhance team collaboration, promote iterative development, and increase delivery speed by up to **30%**.\nArchitected user-friendly interfaces with **React**, significantly improving user engagement and onboarding times by **25%**.\nSpearheaded DevOps initiatives, incorporating continuous integration and delivery (CI/CD) practices to accelerate code deployment cycles by **50%**.\nFostered strong communication across cross-functional teams, aligning technical objectives with business goals to maintain project focus and ensure delivery within **90 days**.\nContinuously engaged in training and mentoring junior engineers on best practices in technology adoption and application development, improving team skill sets and morale."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Engineered robust APIs using **Flask** and integrated communication channels with **WebSocket** to deliver seamless data interactions, meeting agile development standards.\n• Developed and maintained backend systems for trade execution and portfolio management, utilizing **PostgreSQL** and **Docker** for optimal data handling and containerization.\n• Collaborated with cross-functional teams to create and enhance user-facing applications with **React**, ensuring a responsive and user-friendly interface.\n• Implemented CI/CD practices within a **DevOps** framework, facilitating efficient development cycles and an agile workflow.\n• Designed and executed comprehensive testing strategies with tools like **PyTest** and **tox** for application reliability and quality assurance, targeting a **99%** code coverage.\n• Deployed scalable solutions on **AWS**, leveraging cloud services for enhanced performance and flexibility in trading applications.\n• Optimized backend task execution through **Celery** and **RabbitMQ**, improving job scheduling efficiency by over **30%**.\n• Conducted regular code reviews and communicated effectively with team members, fostering a culture of continuous improvement and learning."
    }
  ],
  "skills": " **Programming Languages** \n\t PHP, Java, Python (3.8+), SQL, Bash, JavaScript \n\n **Backend Frameworks** \n\t FastAPI, Flask, Django, Celery \n\n **Frontend Frameworks** \n\t React \n\n **API Technologies** \n\t REST/gRPC APIs, API, Microservices \n\n **Serverless and Cloud Functions** \n\t AWS (EC2, S3, Lambda) \n\n **Databases** \n\t PostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps** \n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, DevOps \n\n **Cloud & Infrastructure** \n\t Azure \n\n **Other** \n\t Agile, Lean, LLMs, communication, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git, Kafka",
  "apply_company": "MyEdSpace"
}