{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Advanced Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As an advanced Software Engineer with 8 years of experience, I possess strong skills in **.NET**, **C#**, **Azure**, and **SQL**, coupled with practical experience in **Microsoft SQL Server** and modern **JavaScript** frameworks. I am adept at implementing **ASP.NET** applications, utilizing **AJAX** for enhanced user experiences, and leveraging CI/CD practices using **Git**, **GitHub**, and **Jenkins** to streamline development processes. My problem-solving skills are complemented by a commitment to quality assurance (QA) and troubleshooting to deliver high-performance solutions in the healthcare and financial sectors.\n\nI have led the development of enterprise-grade platforms with a full-stack approach, utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My cloud expertise spans across **Azure** services, reinforcing the delivery of secure and compliant applications aligned with industry standards like HIPAA, FHIR, PCI DSS, and SOC 2. My background includes developing and deploying machine learning pipelines and MLOps workflows with tools such as **MLflow**, **Airflow**, and **Kubeflow**, enabling predictive analytics and intelligent automation functionalities.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Advanced Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **.NET** and **C#** to architect and develop scalable, full-stack healthcare and financial platforms, ensuring compliance with industry standards and regulations.\nEmployed **Azure** cloud services to implement robust CI/CD pipelines, automating the deployment process and increasing development efficiency by **30%** using tools such as **GitHub Actions** and **Jenkins**.\nDesigned and managed **SQL** databases including **Microsoft SQL Server**, optimizing performance for large-scale data processing and ensuring data quality and integrity with automated testing strategies.\nApplied **JavaScript** frameworks like React and ASP.NET to create user-friendly interfaces, enhancing user engagement through **AJAX** functionalities and responsive design.\nLed cross-functional teams in problem-solving sessions that improved application performance by **25%**, leveraging technical documents as guidelines for new feature implementations.\nConducted quality assurance (QA) testing, using **Jest** and **Cypress** for frontend applications and **PyTest** for backend services, ensuring seamless integration and functionality across the tech stack.\nUtilized effective troubleshooting methodologies to diagnose and resolve software defects, reducing bug occurrence by **40%** post-deployment.\nCollaborated in the creation and maintenance of detailed technical documents for all software projects, ensuring clear communication among development teams and stakeholders.\nEngaged in continuous learning and application of **cloud native patterns** to enhance software architecture, leverage microservices, and improve scalability and fault tolerance across platforms.\nChampioned the integration of active feedback loops in software development, significantly enhancing stakeholder satisfaction with regular updates and progress reports."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed and modernized robust financial applications utilizing **.NET** and **C#**, adhering to best practices in **Cloud Native Patterns** for scalability and maintainability across platforms.\n- Designed and implemented back-end services with **ASP.NET** and integrated **SQL** databases, ensuring efficient data handling and interaction with **Microsoft SQL Server**.\n- Employed **CI/CD** methodologies using **GitHub** and **Jenkins** to streamline deployment processes, improving release cycles by **30%**.\n- Collaborated with cross-functional teams to create detailed **technical documents** and facilitate seamless communication regarding project progress and challenges, enhancing overall team productivity.\n- Leveraged problem-solving skills to troubleshoot critical application issues, reducing downtime by **25%** and contributing to high system availability.\n- Utilized **JavaScript**, including **AJAX**, to enrich user experience in front-end applications, contributing to higher user engagement metrics.\n- Implemented comprehensive **Quality Assurance (QA)** processes that improved software reliability and significantly reduced bugs in production.\n- Engaged in continuous learning and adaptation to new tools and technologies, ensuring team stays at the forefront of industry advancements."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented advanced solutions using **.NET** and **C#** to design and optimize backend services for a highly scalable platform, achieving a **99.9%** uptime across key functionalities.\nDeveloped robust applications with **ASP.NET**, ensuring seamless integration with **Microsoft SQL Server** for efficient data management and retrieval, processing **up to 10,000** transactions daily.\nUtilized **JavaScript** and AJAX for enhancing user interactivity, establishing a responsive and engaging user experience that improved user satisfaction ratings by **30%**.\nExecuted exceptional CI/CD strategies through **GitHub**, **Jenkins**, and **Git**, streamlining deployment processes and reducing code integration time by **40%**.\nEmployed **Azure** for developing cloud-native applications, ensuring scalable architecture solutions that reduced operational costs by **15%**.\nDeveloped and maintained technical documents for software systems, reflecting strong problem-solving skills and promoting transparency in coding practices.\nConducted comprehensive Quality Assurance (QA) testing to identify bugs and validate software functionality, resulting in a **50%** decrease in post-deployment issues.\nEnhanced troubleshooting capabilities through systematic approaches and collaborative techniques, addressing issues in real-time to resolve user queries promptly.\n"
    }
  ],
  "skills": "Programming Languages:\n\tC#, .NET, JavaScript, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, ASP.NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, AJAX\n\n**API Technologies:**\n\tREST, OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), Microsoft SQL Server, MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Cloud Native Patterns\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Git, Quality Assurance (QA), Troubleshooting, Problem Solving, Technical Documents, Let’s Encrypt, Nginx, Certbot"
}