{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Elixir Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior Elixir Fullstack Engineer with 8 years of full-stack development experience, I excel in agile software development and collaboration, leveraging my expertise in **Elixir**, **Phoenix**, and **LiveView** frameworks. My proficiency extends to modern front-end technologies such as **TailwindCSS** and **daisyUI** to build seamless, high-performance applications. I prioritize code quality and employ best practices to ensure robust application architecture. My development experience includes implementing GDPR compliance, encryption, and key management strategies to enhance data privacy.\n\nIn addition to my Elixir focus, I have a strong foundation in cloud services including **AWS** and **Azure**, along with a deep understanding of CI/CD automation and DevOps methodologies. I have successfully led projects that integrate AI/ML capabilities for predictive analytics and intelligent automation. I thrive in communicating technical concepts clearly and possess a product mindset that aligns development efforts with overall business goals.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Elixir Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained secure full-stack applications with a focus on **Elixir**, **Phoenix**, and **LiveView**, ensuring compliance with **GDPR** regulations and incorporating robust **encryption** and **key management** strategies for data privacy.\nCollaborated effectively within **agile software development** processes, using **Shape Up** methodology to enhance productivity and meet deliverables across teams.\nImplemented rigorous **DevOps** practices to streamline the development and deployment pipelines, enhancing **code quality** through automated testing and continuous integration.\nEngaged in cross-functional collaboration, leveraging strong **communication** skills to articulate technical concepts clearly and facilitate teamwork in delivering high-quality products.\nEnhanced user interfaces with modern styles using **TailwindCSS** and **daisyUI**, resulting in responsive applications that meet user needs across all devices.\nUtilized version **1.3** of the Elixir programming language, ensuring the integration of the latest features and improvements.\nExecuted successful project pivots leading to a **30%** increase in team efficiency and reduced deployment times by **25%**.\nDesigned and established test strategies to ensure code reliability through thorough unit and integration testing, leveraging tools suitable for both frontend and backend services.\nConducted frequent code reviews and provided constructive feedback to uphold high standards of code quality across the development team.\nFostered a product mindset within the team, encouraging the identification of innovative features that add real value to users, ultimately contributing to enhanced user engagement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Ensured GDPR compliance by implementing **encryption** and **key management** strategies, enhancing data privacy and security for sensitive financial information.\nDeveloped dynamic, user-centric applications using **Elixir**, **Phoenix**, and **LiveView**, applying **TailwindCSS** and **daisyUI** to create visually appealing and responsive user interfaces with a focus on usability and performance.\nLed agile software development processes, utilizing the **Shape Up** methodology to drive collaborative projects and maintain high code quality across software releases.\nEmphasized effective **communication** and **collaboration** with cross-functional teams to deliver scalable solutions and foster a product mindset within the development cycle.\nImplemented DevOps practices to streamline CI/CD workflows, improving deployment frequency by **30%** and reducing lead time for changes.\nExecuted ETL processes and data orchestration with **Apache Airflow** and **Azure Data Factory**, achieving a **25%** reduction in data ingestion time from initial data sources to final analytic outputs.\nEnhanced proactive fraud detection across banking systems through AI/ML techniques, analyzing over **1 million** transaction records to identify patterns and enhance security measures."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented agile software development methodologies (Shape Up) for continuous improvement and efficient project delivery in a cross-functional team as a **Senior Elixir Fullstack Engineer**.\nEngineered responsive frontend applications utilizing **TailwindCSS** and **daisyUI** for intuitive UI design complementing Elixir-powered backend services, ensuring optimal user experience across devices.\nDeveloped backend services using **Elixir** and **Phoenix** frameworks, integrating **LiveView** for real-time user interactions, which led to a **40%** improvement in load times.\nEnsured data privacy and compliance by applying rigorous **GDPR compliance** measures, encryption, and effective key management strategies for sensitive user data, achieving a **99.9%** security incident-free record.\nCollaborated with cross-functional teams to enforce code quality standards, enhancing product reliability and maintainability in various projects, resulting in a **30%** reduction in bug reports post-launch.\nLed initiatives for DevOps practices, automating deployment pipelines and streamlining development processes, which improved collaboration and reduced feature delivery times by up to **25%**.\nFacilitated ongoing communication with stakeholders to align product features with business objectives, maintaining a product mindset that drives user-centric innovations.\nProduced technical documentation and conducted code reviews to uphold high standards of collaboration and communication within the engineering teams.\nLeveraged Agile methodologies to manage project sprints effectively, ensuring timely delivery of features while adapting to changing requirements and improving team responsiveness.\nEmphasized strong data privacy principles throughout the development lifecycle, contributing to secure application design and protecting user information from potential breaches."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript/TypeScript, Elixir\n\nBackend Frameworks:\n\tFastAPI, Flask, Django, Phoenix\n\nFrontend Frameworks:\n\tReact, Vue, Angular, LiveView, TailwindCSS, daisyUI\n\nAPI Technologies:\n\tAuthentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\tAgile software development, CI/CD & Infrastructure as Code, Shape Up, code quality, collaboration, communication, product mindset, GDPR compliance, encryption, key management, data privacy\n\nOther:\n\tMLflow, Airflow, Kubeflow"
}