{
  "name": "Rei Taro",
  "role_name": "Senior AppSec Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior AppSec Engineer with over 10 years of experience in security automation, vulnerability assessment, and backend systems. Proficient in Bug Bounty, Pentesting, and implementing OWASP standards, with hands-on knowledge of **Burp Suite**, **SonarQube**, and **Snyk** for security testing. Expertise in application security testing methodologies, including SAST and DAST, leveraging **Jenkins** and **GitLabCI** for CI/CD pipelines. Skilled in infrastructure as code using **Terraform** and **Helm** to enhance security posture. Proven ability to deliver high-quality solutions while communicating effectively and solving complex security challenges at leading organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior AppSec Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Burp Suite** and **SonarQube** for thorough **SAST** and **DAST**, ensuring security vulnerabilities were identified and resolved during development phases, adhering to industry standards such as **OWASP**.\nEmployed **Security Automation** tools to streamline pen-testing procedures and enhance overall application security.\nImplemented CI/CD best practices using **Jenkins** and **GitLabCI**, achieving a 25% reduction in deployment times and increasing release frequency to an average of **3 times/week**.\nLed comprehensive security assessments, leveraging knowledge in **Pentesting** and bug bounty programs to uncover potential security flaws and weaknesses in existing systems.\nCollaborated with engineering teams to integrate security protocols throughout the development lifecycle, fostering a culture of **problem-solving** and **communication** around security best practices.\nDesigned and maintained security policies and procedures, ensuring compliance with regulatory requirements, effectively managing risks across all applications."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Conducted comprehensive security audits leveraging **Burp Suite**, **Snyk**, and **SonarQube** to ensure compliance with industry standards and enhance application security.\nExecuted **Pentesting** activities that identified vulnerabilities and improved security posture, utilizing tools for **DAST** and **SAST** processes.\nImplemented **CI/CD** pipelines with **Jenkins** and **GitLabCI** to automate security testing and enhance deployment processes, achieving a **30%** reduction in deployment time.\nDeveloped security automation strategies, integrating **Terraform** for infrastructure as code and maintaining consistent and scalable environments, resulting in a **25%** improvement in deployment efficiency.\nEngineered secure data exchange pipelines, applying **OWASP** principles, and utilized **WAF** technologies to safeguard web applications.\nCollaborated with cross-functional teams to facilitate clear communication, resolve complex security challenges, and ensure ongoing compliance with regulations.\nApplied expert problem-solving skills to address security issues promptly, significantly reducing remediation times by **40%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented **Security Automation** protocols to enhance the security posture of backend services ensuring safe trade execution, portfolio management, and account tracking.\nConducted **Pentesting** using tools like **Burp Suite** and **OWASP** methodologies, ensuring compliance with regulatory standards including MiFID II and GDPR.\nUtilized **SAST** and **DAST** strategies to analyze code quality and enhance application security, achieving a **40%** reduction in vulnerabilities over **6 months**.\nDeveloped comprehensive **CI/CD** pipelines using **Jenkins** and **GitLabCI**, streamlining deployment processes and enabling **30%** faster release cycles.\nManaged infrastructure as code using **Terraform** and **Helm** for maintaining secure deployment environments, reducing setup time by **50%**.\nCollaborated with cross-functional teams to communicate security findings and improvements, fostering a culture of security-first development.\nEmployed **SonarQube** and **Snyk** to continuously monitor code quality and dependencies, leading to proactive security risk management and resolution of **95%** of identified issues."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Jenkins, GitLabCI, Terraform, Helm\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Bug Bounty, Pentesting, OWASP, SAST, DAST, Burp Suite, SonarQube, Snyk, WAF, Security Automation, Communication, Problem-solving",
  "apply_company": "Swapcard"
}