{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior AI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior AI Engineer with 8 years of full-stack development experience, uniquely positioned to leverage expertise in **Python**, **AI**, **NLP**, and **automation**. Proven proficiency in data cleaning and API integration, with a strong ability to develop and implement workflow automation solutions. Adept at utilizing **pandas** in data manipulation and scientific literature analysis to drive insights and innovative solutions.\nAdept at driving machine learning initiatives, I have a solid background in creating frameworks that utilize **LLMs** and building powerful ML pipelines. I have successfully integrated AI/ML capabilities into high-performance platforms, ensuring compliance with industry standards such as HIPAA and PCI DSS.\nIn my prior roles, I have effectively communicated complex technical concepts to stakeholders, demonstrating strong communication skills while managing project timelines and ensuring quality in delivery.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and integrated AI and NLP features into applications, enabling smart financial dashboards and personalized health recommendations, utilizing frameworks such as **spaCy** and **Hugging Face Transformers**.\n- Automated workflows and data cleaning processes, leveraging **Python** with libraries like **pandas** to prepare and analyze large datasets effectively.\n- Enhanced data processing systems through streamlined API integration, ensuring seamless communication and functionality across diverse platforms.\n- Established automated testing strategies and CI/CD workflows to facilitate robust application deployments and reduce manual intervention, utilizing **GitHub Actions**, **CircleCI**, and **Azure DevOps**.\n- Collaborated with cross-functional teams to refine AI-driven solutions by implementing scientific literature analysis workflows, enhancing model performance and accuracy.\n- Engaged in regular communication with stakeholders to discuss project progress, technical specifications, and future enhancements, ensuring alignment with organizational objectives.\n- Led initiatives to continuously improve deployment efficiency and data processing times, achieving a reduction in deployment time by **30%** and a **50%** increase in processing speed for large datasets.\n- Researched and applied cutting-edge LLMs to enhance existing healthcare and financial models, contributing to a **20%** increase in anomaly detection rates.\n- Contributed to the development of comprehensive documentation that facilitates knowledge transfer and onboarding processes across project teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed AI and NLP-driven solutions, focusing on fraud detection and transaction classification using **scikit-learn** and **XGBoost**, enhancing system security and operational efficiency.\n- Engaged in workflow automation by integrating efficient **API** solutions, streamlining data handling and processing to ensure seamless communication across platforms.\n- Strengthened data cleaning processes using **pandas** to ensure high data quality for analysis and model training, enhancing the performance of AI models.\n- Collaborated with cross-functional teams to synthesize insights from scientific literature, effectively communicating findings and innovations to stakeholders.\n- Implemented automation strategies that improved operational workflows by **30%** through improved data ingestion methods and real-time analytics.\n- Designed and executed **Python**-based scripts for data preprocessing, significantly reducing processing time by **20%**.\n- Utilized advanced statistical methods to analyze transaction patterns, enabling proactive measures against potential fraud activities with an accuracy increase of **15%** in detection rates."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **pandas** for data cleaning and scientific literature analysis, streamlining workflows and enhancing data quality for AI-driven projects.\nImplemented and optimized **AI** and **NLP** models to automate various processes, significantly improving efficiency and accuracy across the platform.\nDesigned and developed APIs for seamless **API integration** between **AI** tools and existing systems, ensuring smooth data flow and operational synergy.\nCollaborated closely with cross-functional teams to document and communicate project requirements effectively, demonstrating strong **communication skills** and fostering a collaborative environment.\nExecuted automation strategies that reduced manual effort by approximately **40%**, allowing teams to focus on high-priority tasks.\nConducted regular assessments and improvements of machine learning models to maintain precision, leveraging latest techniques in **workflow automation** with results showing an **85%** accuracy in predictions.\nChampioned data-driven decision-making by employing advanced **AI** techniques for real-time data analysis and reporting, enhancing overall project outcomes and stakeholder satisfaction.\nUtilized **large language models (LLMs)** for analyzing customer feedback and improving service delivery, boosting customer satisfaction scores by up to **25%**.\n"
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tAPI integration\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS, Azure\n\n **Other:** \n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, NLP, pandas, data cleaning, automation, workflow automation, LLMs, scientific literature analysis, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, communication skills",
  "apply_company": "Twine"
}