{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience specializing in **Python**, **Django**, **FastAPI**, and **Microservices** architecture. Proficient in **SOLID** principles, OOP, and design patterns such as MVC and MVVM, with a strong focus on **RESTful API** development and optimizing application performance. Demonstrated expertise in database optimization, caching strategies, and implementing clean, maintainable code through **Code Quality**, **Clean Code**, **DRY**, and **KISS** principles. Knowledgeable in algorithms related to data structures, sorting, and searching methods to enhance application efficiency.\n\nWell-versed in deploying scalable solutions across **AWS** and **Azure** environments while ensuring compliance with industry standards such as HIPAA and PCI DSS. Additionally, skilled in building AI/ML-powered applications and MLOps practices for orchestration and model serving using **MLflow** and **Airflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed robust backend solutions leveraging **Python** and **FastAPI**, ensuring adherence to **SOLID principles**, **Design patterns**, and **OOP** practices for efficient, scalable architecture.\nEngineered RESTful APIs to support microservices architecture, optimizing for **database performance** using **PostgreSQL** and implementing **caching strategies** for enhanced response times, achieving query performance improvements of up to **50%**.\nCreated and maintained clean, efficient code by following **Clean Code** principles, incorporating **Code Quality** checks and **Profiling** practices that reduced application bottlenecks by **30%**.\nImplemented advanced **Dependency Injection** techniques to enhance modularity in the application structure, resulting in a **20%** reduction in code complexity and improved maintainability.\nContributed to the application optimization process, identifying and resolving issues related to **Memory Management** and **Data Structures**, leading to a **40%** improvement in resource utilization.\nCollaborated with cross-functional teams to deliver high-quality software products, emphasizing thorough testing and validation using tools like PyTest to achieve **100%** test coverage for critical components.\nUtilized **MVVM** and **MVC** design patterns to ensure effective data flow, providing a seamless development experience across frontend and backend integration.\nEngaged in regular code reviews to uphold **Clean Code** standards and foster a culture of knowledge sharing within the engineering team, enhancing overall team productivity by **25%**.\nDeveloped backend services that integrate effectively with modern frontend frameworks, ensuring seamless communication through clearly defined **RESTful APIs** and promoting best practices in API documentation."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Engineered microservices architecture utilizing **Python** (FastAPI, Django) to elevate the core financial platforms' scalability and performance, effectively managing **9 million** transactions per day.\n• Developed RESTful APIs in **Node.js** (NestJS/Express) for seamless client-server communication, ensuring reliable service with **99.9%** uptime.\n• Implemented optimized code practices following **SOLID** principles, ensuring high-quality software with minimal technical debt and improved maintainability.\n• Created interactive front-end applications using **Vue.js** (3) and integrated with state management libraries like Redux Toolkit for delivering high-performance financial tools.\n• Devised event-driven architecture employing **Kafka**, **RabbitMQ**, and **Azure Service Bus** for efficient asynchronous workflows crucial for processing payments, alerts, and compliance tasks.\n• Designed and operated ETL pipelines to process financial data from various sources with **Apache Airflow** and **Azure Data Factory**, delivering both batch and real-time analytics.\n• Developed machine learning models using **scikit-learn** and **XGBoost** for fraud detection, harnessing historical transaction data to boost detection accuracy by up to **85%**.\n• Implemented ML pipelines using **MLflow** and **Airflow** for real-time credit scoring and transaction classification tasks, significantly optimizing backend service integration."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Designed and optimized backend services for a global e-commerce platform using **Python** (**Django**, **FastAPI**) to ensure adherence to OOP principles, implementing **SOLID** design patterns to enhance maintainability and scalability across key modules like checkout and order fulfillment.\n• Developed RESTful APIs leveraging **Django** for microservices, adhering to **MVC** architecture, ensuring efficient communication between client and server components.\n• Applied best practices in code quality including **Clean Code**, **DRY**, and **KISS** principles, resulting in a codebase that achieves a **30%** increase in reliability and maintainability.\n• Engineered real-time features using **WebSockets** and **Kafka** for event-driven architecture, enhancing order updates and inventory tracking, which improved user engagement metrics by over **25%**.\n• Oversaw database optimizations and implemented **Caching** strategies with **Redis**, achieving a **40%** reduction in database read pressure during peak traffic periods.\n• Created documentation and maintained code quality through regular profiling, ensuring adherence to software engineering best practices in memory management and application optimization.\n• Developed frontend components in **Vue.js**, ensuring seamless integration with backend services while following the **MVVM**Architectural pattern for interactivity enhancement.\n• Collaborated on system designs following **Domain-Driven Design** principles and optimized algorithms for performance improvements, streamlining critical data structures for business logic applications.\n• Ensured secure transactions by integrating payment gateways such as Stripe and PayPal, maintaining PCI compliance across transactional processes while ensuring reliable customer experiences.\n• Conducted thorough reviews and incorporated feedback loops to implement feature flagging and deployment practices, including **Kubernetes** namespaces, facilitating controlled rollouts and risk mitigation."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, PHP\n\n**Backend Frameworks:**\n\tDjango, FastAPI, Laravel\n\n**Frontend Frameworks:**\n\tVue, React, Angular, Vue.js\n\n**API Technologies:**\n\tRESTful API, Microservices\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, S3, RDS\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tOOP, SOLID, Design patterns, Dependency Injection, MVC, MVVM, Data Structures, Algorithms, Sorting, Searching, Code Quality, Clean Code, DRY, KISS, Application Optimization, Database Optimization, Caching, Profiling, Memory Management, English, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "ScrumLaunch"
}