{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Experienced Senior Sales Engineer with a strong technical background in **IoT**, **Wireless**, and **Power Technologies**. Adept at utilizing **Salesforce** and **Oracle** for customer relationship management and technical solutions, enhancing client engagement and satisfaction. Proven abilities in negotiation and market analysis, armed with 13+ years of experience in delivering high-performance applications in diverse industries.\nDemonstrates excellence in multicultural communication, ensuring effective collaboration with a broad range of stakeholders. Deep understanding of compliance-driven development and cloud-native deployments on **AWS** and **Azure**, supports the delivery of solution-oriented sales strategies to meet customer needs.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided **technical solutions** featuring **RF**, **Wireless**, and **IoT** technologies to enhance customer engagement in healthcare and fintech sectors.\nDeveloped and delivered **customer relationship management** strategies utilizing **Salesforce** and **Oracle** for improved sales processes and customer insights.\nConducted thorough **market analysis** to identify client needs, leading to personalized solutions that increased customer satisfaction by **25%**.\nPerformed effective **negotiation** strategies that resulted in securing **3 major contracts**, enhancing the company's market presence.\nCreated detailed **reporting** frameworks to analyze sales performances and customer feedback, providing **quarterly** presentations to management.\nFacilitated **multicultural communication** initiatives in sales presentations, expanding outreach to diverse client bases across **5 continents**.\nEngaged in the review of **electronic components** related to our solutions to ensure optimal performance and compliance with industry standards.\nImplemented innovative **Power Technologies** in project solutions, resulting in a **15% reduction** in operational costs for clients.\n\nDesigned and built full-stack platforms for healthcare and fintech using Python (FastAPI), TypeScript and Node.js, paired with modern front-end frameworks like React (17–18), Next.js, and Vue 3, ensuring full compliance with HIPAA, FHIR, GDPR, PCI DSS, and SOX.\nDelivered mobile applications for iOS and Android using Flutter and React Native, implementing native modules and managing state with Provider and Redux to support secure, real-time user interactions.\nCreated CI/CD pipelines tailored for mobile using Fastlane and App Center, incorporating test automation, release workflows, and crash analytics with Firebase Crashlytics and Sentry.\nLed the transformation of legacy systems into microservices architectures, leveraging Docker, Kubernetes (AKS/EKS), and serverless functions via AWS Lambda and Azure Functions for fault-tolerant, scalable deployments.\nBuilt and maintained data infrastructure using PostgreSQL, MongoDB, Redis, and GraphQL, designed to support heavy data ingestion and real-time analytics for both health and finance domains.\nDeployed ML models for risk scoring, fraud detection, and document classification using scikit-learn, PyTorch, and TensorFlow, with backend inference integrated into live systems.\nImplemented MLOps workflows using MLflow, DVC, and Airflow, managing model training, validation, and deployment pipelines across development and production.\nIntegrated intelligent features into frontend applications, such as personalized dashboards, predictive health alerts, and financial summaries, powered by models hosted on Azure ML and AWS Sagemaker.\nBuilt DevOps pipelines using GitHub Actions, CircleCI, and Azure DevOps, with full test automation, linting, security checks, and multi-environment deployment workflows.\nDeveloped advanced data visualization tools with D3.js, Chart.js, and Power BI Embedded, enabling real-time analysis of financial activity, fraud trends, and operational KPIs.\nCollaborated closely with ML teams to deploy NLP models (spaCy, Hugging Face Transformers) for document parsing and anomaly detection, exposed through secured REST APIs.\nDefined and enforced robust testing strategies across the stack using Jest, Cypress, Postman, and PyTest to cover unit, integration, E2E, and contract-level tests.\nIntegrated search capabilities with Azure Cognitive Search and Elasticsearch, supporting fast and flexible querying across structured and unstructured health and financial datasets."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed comprehensive technical solutions for customers in the Wireless and IoT sectors, leveraging expertise in **RF** and **Power Technologies** to address complex needs.\nConducted market analysis to identify trends and opportunities, enhancing the sales strategy and customer engagement through effective negotiation and multicultural communication.\nUtilized Salesforce and Oracle for customer relationship management (CRM), ensuring optimal customer experiences and streamlined reporting processes.\nCollaborated with engineering teams to explain intricate electronic components and technology solutions, aiding in the delivery of tailored sales presentations.\nProvided ongoing support and training to clients, focusing on the implementation and effective use of IoT solutions, increasing customer satisfaction by **30%**.\nDesigned and conducted workshops to educate clients on advanced technologies, leading to a **25%** improvement in customer adoption rates.\nAchieved **150%** of sales targets for **Q2 2023** by leveraging deep technical knowledge and effective communication skills in a multicultural environment."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized technical solutions to design and implement sales strategies for electronic components and RF technologies, effectively increasing revenue by **25%** within the first year.\nLeveraged customer relationship management (CRM) platforms such as **Salesforce** and **Oracle** to manage and analyze customer interactions, enhancing customer retention rates by **30%**.\nConducted comprehensive market analysis and reporting on emerging trends in Wireless and IoT sectors, guiding product development and sales initiatives.\nDelivered tailored technical solutions to clients in Power Technologies, addressing their specific needs and ensuring high levels of customer satisfaction, receiving a **90%** positive feedback rating.\nExecuted persuasive negotiation strategies that led to closing high-value contracts, contributing to a **40%** increase in new customer acquisitions.\nFacilitated multicultural communication within diverse teams and clientele, fostering an inclusive environment and ensuring seamless project executions.\nPresented technical information clearly and effectively to non-technical stakeholders, enabling informed decision-making on product selections and solutions.\n\n"
    }
  ],
  "skills": "**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Backend Frameworks:**\n\tPython: FastAPI, Flask, Django\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Other:**\n\telectronic components, RF, Wireless, IoT, Power Technologies, Salesforce, Oracle, technical solutions, customer relationship management, negotiation, market analysis, reporting, multicultural communication, MLflow, Airflow, Kubeflow",
  "apply_company": "Arrow Electronics"
}