{
  "name": "Patryk Zaslawski",
  "role_name": "AI Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As an accomplished AI Engineer with over 8 years of experience in software engineering, I excel in deploying and refining Large Language Models (LLMs) and leveraging **Machine Learning frameworks** for innovative solutions. Proficient in **Python**, I specialize in developing applications that incorporate cutting-edge technologies like **LangChain**, **Transformers**, and **OpenAI APIs**. I have a hands-on experience with multi-model evaluation, feedback loops, and utilizing embeddings for effective data handling. My expertise extends to **vector databases** such as **Pinecone**, **Weaviate**, and **FAISS**, enabling optimized architectures for retrieval-augmented generation (RAG). Familiar with **MLOps tooling** for deployment and **observability**, I ensure robust and scalable systems. Additionally, I bring a strong background in developing secure, efficient applications using frameworks like **FastAPI**, **Django**, and front-end technologies such as **Angular**, **React**, and cloud platforms like **AWS** and **Azure**. My extensive knowledge in modern software practices positions me as a valuable asset in creating enterprise-grade solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "AI Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Python** to develop and deploy AI solutions integrating **Large Language Models**, ensuring seamless interaction with **OpenAI APIs** and efficient processing through **Docker** and **Kubernetes**.\nImplemented **observability** practices in AI workflows to monitor and optimize model performance using tools like Grafana and Prometheus.\nDesigned and executed **multi-model evaluation** strategies, leveraging frameworks such as **LangChain** and **Transformers** to enhance model accuracy and response relevance.\nExecuted **feedback loops** for continuous learning and model improvement, integrating **embeddings** and **vector databases** like **Pinecone** and **Weaviate** for effective data storage and retrieval.\nDeveloped **RAG architectures** for **retrieval-augmented generation**, enhancing the capability of AI models to access and utilize external data sources efficiently.\nSpearheaded **MLOps tooling** integration to automate the machine learning lifecycle, ensuring seamless transition from development to production with minimal downtime.\nPromoted the use of **Python**-based environments for AI-related coding, guiding best practices for containerization and orchestration with **Docker** and **Kubernetes**.\nMentored and supported team members in leveraging **Machine Learning frameworks** to drive AI initiatives, ensuring best practices and adherence to project timelines.\nCollaborated with cross-functional teams to define AI project requirements, facilitating data-driven decision-making and outcome improvements.\nTrained junior engineers on utilizing **Docker** and **Kubernetes** for deploying AI applications, focusing on scalability and performance optimization across environments."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed and deployed AI solutions utilizing **Python** and integrated machine learning frameworks such as **Transformers** and **LangChain** to improve system performance and scalability in AI tasks.\nDesigned and implemented **retrieval-augmented generation (RAG)** architectures to enhance the functionality of large language models, ensuring a responsive and robust AI system.\nLeveraged **OpenAI APIs** in conjunction with **Pinecone** and **Weaviate** for effective management of embeddings and vector databases to improve data retrieval capabilities.\nImplemented **feedback loops** in AI models to continuously refine performance through **multi-model evaluation** techniques, achieving a **15%** increase in accuracy metrics.\nManaged real-time observability for AI models using **Docker** and **Kubernetes**, enabling seamless deployment and scaling while ensuring high availability.\nApplied best practices for MLOps tooling, incorporating CI/CD pipelines for automated model training and deployment in a containerized environment.\nCollaborated on developing a machine learning monitoring dashboard that included performance metrics, achieving a **20%** reduction in model downtime through proactive management.\nOptimized model training processes and data flows using **Kubernetes**, streamlining operations and improving execution time by **30%**.\nConducted extensive research and testing on various ML frameworks to enhance model effectiveness and reliability, contributing to improved overall system performance.\nFacilitated cross-functional teams in developing features for AI applications, utilizing both cloud-based and on-premise solutions to achieve business goals."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Leveraged **Python** and **Machine Learning frameworks** to design and implement AI-driven applications, optimizing performance and enhancing capabilities across various projects.\nUtilized **Transformers** from libraries such as **Hugging Face** to build and fine-tune models for natural language processing tasks, enabling advanced functionalities like **retrieval-augmented generation**.\nImplemented **LangChain** to facilitate the integration of language models with external data sources, enhancing the capabilities of multi-model evaluation for improved AI outputs.\nDeveloped and managed embedding models using **Pinecone**, **Weaviate**, and **FAISS** for efficient vector data retrieval, ensuring fast access to relevant information for user queries.\nEmployed **Docker** and **Kubernetes** for containerization and orchestration of AI services, streamlining deployment processes and ensuring scalability in cloud environments.\nCreated and maintained feedback loops in AI systems to improve model accuracy and relevance based on user interactions and performance metrics.\nDesigned automated MLOps pipelines using **CI/CD** principles and tools to enhance the efficiency of the model training and deployment processes.\nImplemented observability practices in machine learning applications, employing tools like **Prometheus** and **Grafana** to monitor model performance and system health, ensuring timely feedback and iterative improvements.\nConducted load testing and performance optimization for AI models, ensuring they can handle up to **1000** concurrent requests with minimal latency, thus enhancing user satisfaction.\nBuilt backend services for AI applications focusing on seamless integration with existing systems and third-party APIs, ensuring robust and reliable interactions.\nImplemented security measures such as **RBAC** for managing access and authorizations within the AI systems, safeguarding sensitive data and maintaining compliance with best practices.\nFacilitated the application of **OpenAI APIs** for developing innovative functionalities and enhancing user experiences in AI-driven projects."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, OpenAI APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, vector databases, Pinecone, Weaviate, FAISS\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Machine Learning frameworks, LangChain, Transformers, multi-model evaluation, feedback loops, embeddings, retrieval-augmented generation, RAG architectures, MLOps tooling, observability"
}