{
  "name": "Tomasz Lee",
  "role_name": "Senior Java Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Accomplished Senior Java Engineer with 9+ years of experience in developing and implementing innovative microservices-based applications. Proficient in **Java**, **Spring**, and cloud-native solutions leveraging **Docker**, **Kubernetes**, and CI/CD practices with **GitHub Actions**. Expertise in optimizing performance and ensuring reliability through observability and logging strategies, utilizing **PostgreSQL**, **Redis**, and **RabbitMQ** for efficient data management and messaging. Well-versed in Agile methodologies and effective communication skills, leading cross-functional teams in delivering high-quality software products. Additionally skilled in backend technologies like **Python**, **FastAPI**, and **Flask**, alongside frontend frameworks such as **Angular** and **TypeScript**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and developed scalable microservices architecture using **Java** and **Spring** for complex web applications.\nImplemented and managed **Redis** for caching mechanisms, significantly improving data retrieval speeds by **35%**.\nUtilized **PostgreSQL** databases, optimizing complex queries that reduced execution time by **20%**.\nIntegrated **RabbitMQ** for efficient task queuing and asynchronous processing, enhancing system performance.\nDeveloped CI/CD pipelines utilizing **GitHub Actions** for streamlined deployment processes, decreasing deployment time by **40%**.\nLeveraged **Docker** and **Kubernetes** for containerization and orchestration, ensuring consistent development and production environments.\nCollaborated with cross-functional teams utilizing **Agile** methodologies to deliver high-quality software solutions on time.\nImplemented observability and logging strategies to enhance application monitoring and issue resolution.\nDeveloped robust backend RESTful APIs using **FastAPI**, allowing seamless interactions between frontend and backend components.\nConducted code reviews and mentored junior developers, fostering a culture of continuous learning and skill enhancement."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and integrated microservices using **Java**, **Spring**, and **RabbitMQ**, contributing to a 15% increase in system performance through optimized task orchestration.\nEngineered scalable applications leveraging **Docker** and **Kubernetes**, leading to an enhanced production environment with 30% fewer deployment errors via CI/CD practices utilizing **GitHub Actions**.\nDesigned and utilized **PostgreSQL** for real-time data access and optimized database queries, resulting in improved data retrieval times.\nImplemented **Redis** as a caching solution, cutting response times for client requests by 25%, ensuring high availability and responsiveness.\nUtilized **TypeScript** and **Angular** for front-end development, enhancing user engagement by 25% through intuitive interface design with **Tailwind CSS**.\nConducted code reviews and provided mentorship in Agile environments, fostering communication and improving team productivity by 20%.\nCreated observability and logging solutions to monitor application health and performance, employing tools like **Prometheus** and **Grafana**.\nCollaborated with cross-functional teams to define and prioritize project requirements, ensuring delivery timelines were met consistently.\nDesigned interactive reporting dashboards with **D3.js**, facilitating project status tracking for stakeholders.\nLed the migration of legacy systems towards a microservices architecture, enhancing scalability and maintainability for future developments."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed microservices using **Java** and **Spring**, contributing to a robust and scalable architecture for internal applications.\nImplemented CI/CD pipelines utilizing **GitHub Actions** for automated testing and deployment, reducing deployment time by **30%**.\nDesigned and optimized data storage solutions with **PostgreSQL**, improving database performance and queries by **25%**.\nUtilized **Redis** for caching, significantly enhancing application response times and user experience.\nContainerized applications with **Docker** and orchestrated with **Kubernetes** for efficient scaling and management of services.\nDeveloped and deployed observability practices through **logging** and monitoring solutions to ensure system reliability and performance insights.\nIntegrated **RabbitMQ** for asynchronous messaging, enhancing performance during high load situations.\nCollaborated in an Agile environment, conducting daily standups and participating in code reviews to foster teamwork and quality assurance.\nCreated technical documentation and user manuals for microservices, facilitating knowledge transfer among engineering teams.\nUtilized **TypeScript** and **Angular** to develop user-friendly interfaces, improving client satisfaction by **15%**."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, Python, TypeScript, Rust, C++, Solidity\n\n **Backend Frameworks**\n\tSpring, FastAPI, Flask, .NET, ExpressJS, NestJS, Microservices\n\n **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\tKNative, AWS, Azure, Docker, Terraform\n\n **Databases**\n\tPostgreSQL, MSSQL Server, MySQL, MongoDB, DynamoDB, CosmosDB, SQLAlchemy\n\n **DevOps**\n\tCI/CD pipelines, GitHub Actions, Kubernetes, Observability, Logging\n\n **Cloud & Infrastructure**\n\tAWS, Azure, Docker, Kubernetes\n\n **Other**\n\tUX/UI Design, Git, GitHub, Redux, Apache Kafka, RabbitMQ, Redis, Celery, Agile, Communication, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Retool, Zapier",
  "apply_company": "Protolabs"
}