{
  "name": "Andrzej Ito",
  "role_name": "Senior BigData Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior BigData Engineer with over 9 years of experience, I specialize in **BigData**, **Java**, **Python**, **SQL**, and **AWS** technologies including **Glue**, **LakeFormation**, **IAM**, **S3**, and **Kinesis**. My expertise in deploying solutions using **Terraform** and **HelmCharts** enhances system scalability and performance. I have a proven history of leading cross-functional teams in an **Agile** environment, effectively mentoring junior engineers, and delivering projects focused on user experience and innovation. I am passionate about enhancing accessibility and driving technical excellence in all my endeavors.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior BigData Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "- Lead the development of data processing pipelines using **AWS** services such as **Glue**, **S3**, and **Kinesis** to manage and analyze large datasets in line with Big Data principles.\n- Utilize **Java** and **Python** for developing scalable solutions, ensuring code efficiency and data integrity in Big Data applications.\n- Implement **SQL** querying techniques to extract, transform, and load (ETL) data efficiently from relational databases during data processing operations.\n- Employ **Terraform** and **HelmCharts** for infrastructure as code (IaC) to automate resource provisioning and management across environments.\n- Collaborate in an **Agile** environment, focusing on iterative development and continuous improvement, resulting in a 30% reduction in project delivery time.\n- Strengthen communication efforts by leading team meetings and documentation that improved cross-functional collaboration by 40%.\n- Designed and developed Hybrid Single Page Applications using **Java**, **Spring Boot**, **React 17**, and **Redux 4.2.1** to enhance user interfaces in real-time applications.\n- Worked on the UI layer using **Angular 14**, **HTML5**, **CSS**, and **Bootstrap** to create rich, interactive web pages with over 99% uptime in user accessibility.\n- Developed automated Docker image deployments to both development and production environments using **Jenkins** and **Ansible**, decreasing deployment time by 50%.\n- Gained hands-on experience with Core Java, specifically in **Multithreading**, **Concurrency**, and data structures that optimized application performance."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed data processing applications utilizing **Java** and **Python** for efficient data manipulation and analysis in Big Data environments.\n• Designed and maintained SQL queries and data pipelines in compliance with **AWS** services such as **S3**, **Glue**, and **LakeFormation** to ensure seamless data integration and storage solutions.\n• Leveraged **AWS Kinesis** for real-time data streaming and processing, successfully handling over **1 million** records per second.\n• Utilized **Terraform** for infrastructure as code to deploy and manage cloud resources, maintaining version control and ensuring reproducibility of environments.\n• Implemented security measures including **IAM** roles and policies to manage access control across **AWS** resources, facilitating a secure and compliant architecture.\n• Adopted **Agile** methodologies to enhance team productivity and delivered projects which increased processing efficiency by **25%**.\n• Utilized effective communication skills to collaborate with cross-functional teams and articulate technical concepts clearly, driving alignment in project goals.\n• Conducted performance tuning and optimization of data workflows leading to reduced processing times by up to **40%**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Leveraged **AWS** services including **S3**, **Glue**, and **LakeFormation** for efficient data storage and processing in Big Data environments, ensuring seamless integration and data workflow automation.\n• Developed data processing pipelines using **Python** and **SQL**, optimizing data retrieval and transformation processes to handle datasets exceeding **1TB**.\n• Implemented infrastructure as code using **Terraform** to streamline deployment processes and manage resources in cloud environments, significantly reducing deployment time by **30%**.\n• Collaborated in an **Agile** team setting to deliver high-quality Big Data solutions, maintaining clear communication and project transparency with stakeholders.\n• Created data models and wrote complex SQL queries to support analytics initiatives and BI reporting, improving reporting accuracy by **20%**.\n• Designed and implemented **Kinesis** data streams for real-time data processing, enhancing data ingestion speeds to handle up to **100,000** records per second.\n• Managed access and security protocols utilizing **IAM** to ensure compliance and security best practices across cloud services.\n• Provided mentorship and guidance to junior engineers, fostering an environment of learning and knowledge sharing within the team."
    }
  ],
  "skills": "  **Programming Languages**\n\tJava, Python, SQL, C++, C#, Kotlin\n\n  **Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA\n\n  **Frontend Frameworks**\n\tReact, Vue, Angular\n\n  **API Technologies**\n\tSOAP, REST APIs\n\n  **Serverless and Cloud Functions**\n\tAWS, Glue, LakeFormation, IAM, S3, Kinesis\n\n  **Databases**\n\tMS SQL Server, Oracle, MongoDB, PostgreSQL, Redis\n\n  **DevOps**\n\tTerraform, HelmCharts, Agile\n\n  **Cloud & Infrastructure**\n\tBigData\n\n  **Other**\n\tMicroservices, SOLID, DRY, LINQ, Communication",
  "apply_company": "SoftServe"
}