{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven professional with 13+ years of experience delivering high-performance applications in the healthcare and financial industries. Highly adept in **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for robust frontend and backend development. Proven capability in strategic planning and collaboration, essential for aligning engineering solutions with customer needs.\nExpert in improving processes through problem solving and negotiation, ensuring compliance with industry regulations. Strong proficiency in CRM solutions and Microsoft Suite, including **Microsoft Excel**, **Microsoft Word**, and **Microsoft Outlook**, enhancing communication and customer relationship management. Demonstrated success in developing AI/ML-powered platforms focused on real-time performance and predictive analytics, while effectively deploying cloud-native systems on **AWS** and **Azure**. Experienced in building microservices, event-driven architectures, and CI/CD pipelines that drive operational efficiency.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged **CRM** systems to enhance customer relationships, ensuring prompt and effective communication with clients and prospects.\n- Conducted strategic planning sessions and developed tailored sales strategies for **Pumps**, particularly specializing in **Progressing Cavity Pump** solutions.\n- Utilized **Microsoft Excel** for detailed sales analytics and forecasting, resulting in a **15%** improvement in sales projections.\n- Developed comprehensive presentations and proposals using **Microsoft Word** that effectively communicated product benefits and technical specifications.\n- Managed high-stakes negotiations with key clients, achieving a **20%** increase in contract values through effective problem-solving and collaboration.\n- Collaborated with cross-functional teams to address customer needs, enhancing satisfaction scores by **10%** through exceptional service.\n- Maintained consistent and clear communication with stakeholders, leading to a **30%** reduction in query response time.\n- Analyzed market trends and customer feedback to strategize product positioning, directly correlating to an increase in market share in the **Pumps** sector.\n- Supported the onboarding process for new clients, ensuring an efficient transition and high customer satisfaction throughout.\n- Implemented strategic training sessions for sales staff on effective use of **CRM** tools, increasing overall team productivity by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Collaborated with cross-functional teams to enhance customer relationship management (CRM) strategies, ensuring optimal engagement and satisfaction, resulting in a **20%** increase in customer retention rates.\n- Developed strategic planning frameworks that improved sales processes and customer outreach initiatives, achieving a **15%** growth in quarterly sales metrics.\n- Conducted in-depth market research and problem-solving sessions to identify customer needs, leading to tailored solutions that enhanced service delivery.\n- Facilitated training sessions and workshops for sales teams on leveraging **Microsoft Excel** and **Microsoft Outlook** for improved productivity and data management.\n- Implemented negotiated agreements with clients, increasing deal closure rates by **30%** through effective communication techniques and persuasive collaboration.\n- Utilized **Pumps** technology and knowledge of **Progressing Cavity Pump** systems to provide technical expertise in sales presentations, demonstrating product value to potential clients."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **CRM** tools to manage and analyze customer interactions, ensuring effective relationship management and enhancing customer satisfaction through strategic planning.\nImplemented advanced **problem-solving** techniques to address customer inquiries and technical challenges, leading to a **30%** increase in customer retention rates.\nDeveloped comprehensive sales strategies based on market analysis and customer feedback, facilitating targeted campaigns that resulted in a **20%** increase in sales revenue within the first **6 months**.\nCollaborated with cross-functional teams to ensure alignment of sales strategies with customer feedback, driving enhancements to product offerings that increased customer engagement.\nConducted data analysis using **Microsoft Excel** to track sales performance and optimize pricing strategies, successfully identifying trends that informed decision-making processes.\nLed negotiations with clients to secure contracts and close deals, achieving a **15%** higher closing ratio than the industry average.\nCreated presentations and reports utilizing **Microsoft Word** and **Microsoft Outlook** to communicate effectively with stakeholders and customers.\nProvided continuous support and training to team members on customer relationship techniques, improving team communication and sales performance.\nMaintained up-to-date knowledge of industry trends and product developments to boost sales strategy effectiveness and customer engagement initiatives."
    }
  ],
  "skills": "Programming Languages:\n\t•\tPython: FastAPI, Flask, Django\n\t•\tJavaScript/TypeScript: React, Vue, Angular\n\nBackend Frameworks:\n\t•\tNone\n\nFrontend Frameworks:\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\nAPI Technologies:\n\t•\tNone\n\nServerless and Cloud Functions:\n\t•\tAWS: ECS, Lambda, RDS, S3\n\t•\tAzure: App Services, Blob Storage, SQL Database\n\nDatabases:\n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\t•\tRedis\n\nDevOps:\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\nCloud & Infrastructure:\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\nOther:\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\t•\tNginx\n\t•\tLet’s Encrypt\n\t•\tCertbot\n\t•\tPumps\n\t•\tCRM\n\t•\tMicrosoft Excel\n\t•\tMicrosoft Word\n\t•\tMicrosoft Outlook\n\t•\tProgressing Cavity Pump\n\t•\tCustomer Relationship Management\n\t•\tStrategic Planning\n\t•\tProblem Solving\n\t•\tNegotiation\n\t•\tCollaboration\n\t•\tCommunication",
  "apply_company": "NOV"
}