{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience in Software Development and delivering high-performance applications. Proficient in **Kotlin**, **Spring Boot**, **PostgreSQL**, and deploying cloud-native systems on **AWS**. Strong expertise in implementing **CI/CD** pipelines and ensuring code quality through best practices. Excellent stakeholder communication skills, adept at discussing Product Architecture and aligning solutions with business needs. Skilled in developing applications using **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in backend technologies including **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms for predictive analytics and real-time processing, with a robust background in MLOps utilizing **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained backend systems using **Kotlin** and **Spring Boot**, ensuring high performance and reliability in software development.\nImplemented CI/CD pipelines with tools for automated testing and deployment, enhancing code quality and reducing integration time by **30%**.\nCollaborated with stakeholders to gather requirements for product architecture, leading design discussions and technical reviews to ensure alignment with business goals.\nManaged database solutions using **PostgreSQL**, optimizing queries and structures for better data handling and retrieval efficiency, achieving a **25%** improvement in response time.\nDesigned and integrated cloud services on **AWS**, leveraging various resources for scalable and cost-effective deployments, enhancing overall application performance.\nConducted regular code reviews to uphold code quality standards, ensuring maintainable solutions and facilitating cross-team knowledge sharing, leading to a **20%** decrease in critical defects.\nParticipated in agile ceremonies, providing updates and feedback, while promoting effective stakeholder communication throughout project lifecycles.\nExecuted advanced data management techniques, strengthening data integrity and consistency across applications and optimizing backend interactions.\nCreated comprehensive documentation for system architecture and processes to support long-term maintenance and scalability of backend solutions.\nMentored junior developers, fostering a culture of continuous learning and improvement within the software development team."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Executed software development best practices to ensure high code quality and maintainable architecture while developing backend solutions using **Kotlin** and **Spring Boot**.\nCollaborated with cross-functional teams and stakeholders to align product architecture with business objectives, enhancing systems' alignment to **AWS** cloud infrastructure.\nImplemented CI/CD pipelines to streamline deployment processes and improve release cycles, ensuring consistent application performance and reliability.\nDesigned database models and optimizations using **PostgreSQL**, handling transactions and integrating with microservices for high concurrent loads, providing a seamless user experience.\nMaintained high performance of existing systems through effective code reviews, refactoring, and application of design patterns, resulting in a reduction of technical debt by **30%**.\nManaged end-to-end development of applications, contributing to significant increases in operational efficiency by up to **40%** and enhancing stakeholder communication during the project lifecycle.\nUtilized Agile methodologies to track progress and communication, ensuring timely delivery of backend services and features that align with user and business needs."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable backend services utilizing **Kotlin** and **Spring Boot** for a high-traffic e-commerce platform, ensuring optimal performance and reliability in core functionalities.\nEngineered data access layers with **PostgreSQL** to manage distributed data storage, enabling real-time product inventory tracking and efficient order processing for over **100k** monthly active users.\nImplemented CI/CD pipelines for automated deployment using **AWS** tools, significantly reducing deployment time by **30%** and improving overall code quality and team productivity.\nCollaborated with cross-functional teams to define and refine the product architecture, managing stakeholder communication effectively to align development efforts with business goals.\nMaintained rigorous code quality standards through peer reviews and automated testing, ensuring the reliability and performance of all deployed services.\nDesigned and optimized services to operate within AWS Lambda, improving system responsiveness and reducing operational costs by **25%**.\nUtilized an agile methodology for software development, leading to timely delivery of features and enhancements that align with evolving user needs.\nMonitored application performance and scalability using **AWS CloudWatch**, making data-driven decisions to enhance system functionality and user experience.\nConducted workshops and training sessions on best practices in coding and architectural design for junior developers, fostering a culture of continuous improvement and knowledge sharing within the team."
    }
  ],
  "skills": " **Programming Languages:** \n\tKotlin, Python, JavaScript/TypeScript\n\n **Backend Frameworks:** \n\tSpring Boot, FastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, ECS, S3, RDS\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n **Cloud & Infrastructure:** \n\tAWS, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:** \n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Software Development, Code Quality, Product Architecture, Stakeholder Communication, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Huspy"
}