{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Software Engineer with 10+ years of experience in delivering high-performance software solutions, specializing in **TypeScript**, **Node.js**, **Python**, **AWS**, and **Kubernetes**. Proficient in designing and developing **REST APIs** and utilizing **PostgreSQL** and **Redis** for efficient data management. Extensive experience with CI/CD practices using **GitHub Actions** and **Jenkins** to ensure rapid, reliable software delivery. Expertise in modern frameworks and libraries including **React.js**, within dynamic full stack environments.\n\nDemonstrated ability to build cloud-native applications on platforms like **AWS** while ensuring compliance with standards such as HIPAA and PCI DSS. Proven skills in microservices architecture and event-driven systems, with a focus on secure and maintainable solutions. Additionally, brings practical experience in MLOps with tools like **MLflow**, **Airflow**, and **Kubeflow**, driving real-world impact through intelligent analytics, automation, and decision-making.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented full-stack applications primarily using **TypeScript**, **Node.js**, and **Python** (FastAPI), ensuring robust REST API development to deliver responsive and scalable solutions.\n• Leveraged **AWS** for cloud services and **Kubernetes** for container orchestration, optimizing deployment processes and achieving a **95%** uptime across applications.\n• Built and maintained **PostgreSQL** and **Redis** databases for high-performance data storage and retrieval, managing databases of over **1 million** health and financial records.\n• Created continuous integration and deployment pipelines using **GitHub Actions** and **Jenkins**, streamlining development workflows with a focus on code quality and rapid iterations, achieving deployment speeds up to **5 times** faster.\n• Developed applications with modern front-end technologies, including **React.js**, ensuring seamless user experiences with a focus on responsive design principles and accessibility standards.\n• Employed DevOps strategies and practices, leading to a reduction in deployment-related issues by **30%** and enhancing developer collaboration through shared repositories and automated testing protocols.\n• Collaborated with cross-functional teams, including data scientists, to integrate machine learning capabilities and provide predictive insights, enhancing application intelligence by incorporating features powered by trained models.\n• Contributed to the modernization of legacy systems by introducing microservices architecture, significantly improving system maintainability and scalability, resulting in better resource utilization.\n• Established security best practices around development processes, focusing on frameworks like **Express** and maintaining compliance with industry standards like HIPAA and GDPR.\n• Ensured application performance optimization by monitoring key metrics, applying **Terraform** for infrastructure as code, and managing configurations effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Expertly crafted robust **REST API** solutions using **Node.js** (Express) and **Python** (Django), ensuring seamless integration and functionality within financial platforms.\nLeveraged **TypeScript** to enhance code quality and maintainability in front-end applications built with **React.js** (18), achieving a performance optimization of up to **25%**.\nSpearheaded the transition to a microservices architecture, improving system scalability and maintainability, and processing up to **1,000** simultaneous transactions.\nUtilized **PostgreSQL** and **Redis** for efficient data storage and caching strategies, enhancing application response times by **40%**.\nImplemented CI/CD pipelines with **GitHub Actions** and **Jenkins**, expediting deployment cycles and reducing rollback rates by **15%**.\nCollaborated in an agile environment, employing tools such as **Kubernetes** for container orchestration and improving team productivity through automated deployments.\nDesigned and developed high-quality ETL processes utilizing **Terraform**, **Apache Airflow**, and **AWS** for reliable data ingestion from diverse sources.\nExecuted real-time analytics applications using **D3.js** and **Power BI Embedded**, providing stakeholders with actionable insights and reports on financial transactions.\nEnhanced application security through best practices and tools, ensuring compliance with industry standards in banking systems."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed backend services using **Node.js** (Express) and **Python** (Django, FastAPI) to build scalable and high-performing REST APIs for e-commerce platforms, achieving **99.9% uptime**.\n• Optimized application performance with **Redis** for caching and **PostgreSQL** for reliable data storage, reducing average response time by **40%** during peak traffic.\n• Collaborated with frontend teams to create seamless interfaces using **React.js** and **TypeScript**, enhancing user experience through fast, responsive designs compatible with **HTML5/CSS3** standards.\n• Leveraged **AWS** services for deployment, ensuring efficient resource management and cost-effectiveness, reducing operational costs by **25%**.\n• Implemented CI/CD pipelines with **GitHub Actions** and **Jenkins**, which streamlined code integration and application delivery, providing faster deployment cycles by **30%**.\n• Deployed application services using **Kubernetes**, facilitating container orchestration and scalability, contributing to a deployment frequency of up to **20 times per week**.\n• Integrated third-party payment systems such as **Stripe**, **PayPal**, and **Razorpay**, ensuring secure transactions and compliance with PCI-DSS standards.\n• Drove tooling and infrastructure automation with **Terraform** to improve infrastructure management efficiency and consistency across development and production environments.\n• Applied robust security measures, including **OAuth 2.0** for user authentication and role-based access control, maintaining strict adherence to GDPR requirements to protect user data.\n• Enhanced system reliability by utilizing **Nginx** for load balancing and application delivery, improving throughput during high load periods by **50%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript, Java, Kotlin, Swift\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js, Express\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST API\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Glia"
}