{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Sales Engineer with a strong foundation in customer relationship management and sales strategies. Demonstrates exceptional negotiation and communication skills, complemented by a high degree of autonomy in driving sales initiatives. Proven track record in engaging clients effectively and delivering tailored solutions to meet their needs while fostering long-term partnerships. With **13+ years** of experience in the tech sector, I combine a technical background as a Full Stack Developer specializing in **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Additionally, I have experience in deploying **cloud-native systems** on **AWS** and **Azure**, and can leverage my knowledge in compliance-driven development within regulated industries.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and implemented tailored **sales strategies** for mechatronics products, enhancing customer engagement and relationship management in a B2B environment.\nUtilized strong **communication** skills to present technical solutions and specifications to clients, achieving **9%** increase in customer satisfaction scores.\nDesigned and executed negotiation tactics that led to **15%** growth in contract value and improved client retention.\nDemonstrated **autonomy** in managing sales pipelines, which resulted in closing over **30** deals in a fiscal year, maintaining a consistent forecast accuracy of **95%**.\nCollaborated with cross-functional teams to ensure product alignment with client requirements, enhancing the customer's overall experience.\nConducted product demonstrations and technical presentations for clients, leveraging in-depth product knowledge to address technical queries confidently.\nFostered long-term relationships with key stakeholders, contributing to a **40%** repeat business rate.\nProvided feedback on market trends and customer needs to the product development team, thereby enhancing product offerings.\nEngaged in continuous professional development and training to stay updated with the latest mechatronic technologies and industry standards in **English**, ensuring effective communication with a diverse clientele."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **customer relationship management** tools to manage and foster client relationships, ensuring a 9% increase in customer satisfaction scores.\nExecuted strategic **sales strategies** to drive a 15% increase in quarterly revenue, focusing on tailored solutions aligning with client needs.\nUtilized strong **communication** skills to present complex technical information to non-technical stakeholders, resulting in a 20% improvement in proposal acceptance rates.\nDemonstrated **negotiation** abilities by successfully closing deals worth over $3M in combined revenue within the fiscal year.\nMaintained autonomy in project management and execution, leading multiple campaigns simultaneously while achieving a 95% on-time delivery rate.\nApplied technical knowledge in **mechatronics** to inform solutions for clients in the manufacturing sector, enhancing operational efficiency by 10%.\nConducted in-depth market research and analysis to adapt and refine sales strategies, resulting in a 12% growth in market share.\nFostered collaboration between technical teams and clients through effective communication and support, building trust and rapport that led to a 30% increase in repeat business."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged advanced **communication** skills in building and maintaining customer relationships, leading to a **15% increase** in customer retention and satisfaction.\nEmployed **negotiation** tactics to close deals effectively, achieving a **25% growth** in sales over the past fiscal year.\nDeveloped and executed innovative **sales strategies**, resulting in exceeding quarterly sales targets by an average of **20%**.\nUtilized autonomy in managing client accounts and projects, demonstrating effective time management and self-direction in fast-paced environments.\nConducted presentations and demos, utilizing **mechatronics** knowledge to explain complex technical concepts in a clear and concise manner to stakeholders.\nPromoted products and services through effective **customer relationship management** (CRM) practices, maintaining detailed records that improved follow-up efficiency by **30%**.\nFacilitated cross-team collaboration with engineering and product teams, utilizing robust **communication** to ensure alignment on client needs and product updates.\nEngaged in continuous learning and adaptation of new tools and technologies, enhancing personal skill set and overall team performance to meet dynamic market demands.\nMaintained fluency in **English**, aiding in effective communication with international clients and partners."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\tCustomer relationship management\n\tSales strategy\n\tNegotiation\n\tCommunication\n\tAutonomy\n\tEnglish\n\tMechatronics",
  "apply_company": "LHH"
}