{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in building high-performance applications, leveraging a strong foundation in **.NET Core**, **React**, **Vue**, **JavaScript**, **HTML**, **CSS**, and **SQL**. Demonstrated expertise in deploying **CI/CD** pipelines, **Agile** methodologies, and **DevOps** practices. Proficient in **Stripe Payments** integrations and utilizing **Infrastructure as Code** for seamless deployments. Skilled in **Containerization** technologies and experienced with **Monitoring Tools** and **Logging Tools** to ensure application reliability and performance.\n\nIn addition to expertise in frontend and backend frameworks like **React**, **Vue**, **Node.js**, **FastAPI**, and **Django**, I have a solid background in building AI/ML platforms enabling predictive analytics and automation. My technical proficiencies also extend to **MLOps** practices, including model training and orchestration using **MLflow**, **Airflow**, and **Kubeflow**. I excel in compliance-driven development aligning with standards such as HIPAA and PCI DSS, while also demonstrating strong problem-solving, analytical, communication, time management, and multitasking skills.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed full-stack applications utilizing **.NET Core**, **React**, **Vue**, and **JavaScript** frameworks, ensuring adherence to industry standards and best practices for performance and security.\n• Created responsive web applications using **HTML**, **CSS**, and advanced JavaScript methodologies to enhance user experience and accessibility.\n• Implemented CI/CD pipelines with **GitHub Actions**, facilitating smooth transitions from development to production environments, resulting in a **30%** reduction in deployment times.\n• Collaborated with cross-functional teams in an **Agile** environment to prioritize features, improve design systems, and iterate on product functionality based on user feedback.\n• Leveraged **SQL** databases to support data-driven applications, optimizing queries for better performance and scalability.\n• Utilized containerization tools such as **Docker** to streamline the development and deployment process, contributing to consistent environment replication and reduced setup time by **40%**.\n• Managed application monitoring and logging through tools like **Azure Monitor** and **Log Analytics**, enhancing operational reliability and identifying critical issues proactively.\n• Enhanced workflows through tooling automation by integrating **Infrastructure as Code** strategies, reducing manual configuration times by **25%**.\n• Proactively engaged in technical documentation, ensuring all engineering processes and API integrations are well-documented for team collaboration and future reference.\n• Demonstrated exceptional problem-solving and analytical skills to troubleshoot issues within software ecosystems, reducing average resolution time by **15%**.\n• Communicated effectively within the team and with stakeholders to ensure alignment on project goals and deliverables, enhancing overall team productivity.\n• Managed multiple priorities effectively, meeting tight deadlines without compromising quality in project deliverables."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and maintained scalable applications using **.NET Core** and **React (18)**, ensuring efficient performance and adherence to coding standards.\n• Created and enhanced user interfaces with **Vue 3**, **HTML**, **CSS**, and **JavaScript**, providing a seamless experience for end-users in financial applications.\n• Implemented SQL database solutions for storing and managing financial data, ensuring high availability and robust data integrity with **SQL Server 2019**.\n• Applied **Agile** methodologies in project management, leading to a 25% improvement in development cycle efficiency and timely delivery of features.\n• Spearheaded the CI/CD process using **Docker** and **Azure DevOps**, resulting in a 30% faster deployment frequency with reduced rollback times.\n• Integrated **Stripe Payments** for seamless transaction processing, handling over **1,000** transactions per day with minimal downtime.\n• Employed Infrastructure as Code (IaC) techniques with **Terraform**, enabling rapid provisioning and management of cloud resources in **Azure**.\n• Utilized monitoring and logging tools to maintain application performance and quickly resolve issues, achieving 99.9% uptime in production.\n• Automated tooling processes to improve developer productivity and reduce manual errors, reducing operational overhead by **15%**.\n• Created comprehensive technical documentation and design systems to enhance team collaboration and maintain consistency across projects.\n• Effectively communicated technical concepts to diverse audiences, fostering collaboration with cross-functional teams and ensuring clarity in requirements.\n• Demonstrated strong problem-solving and analytical skills, successfully reducing system anomalies by implementing proactive monitoring strategies."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and optimized backend services using **.NET Core**, ensuring high availability, low latency, and scalability to support e-commerce modules, enhancing customer experience and order fulfillment efficiency.\n• Engineered responsive frontend applications leveraging **React** and **Vue**, ensuring quick, engaging user interactions with a focus on mobile-first design principles and accessibility compliance (WCAG 2.1).\n• Utilized **HTML**, **CSS**, and **JavaScript** to create SEO-friendly interfaces, boosting organic traffic and improving the overall user satisfaction metrics.\n• Implemented efficient **SQL** databases to manage distributed data storage solutions, ensuring rapid data access with minimal downtime during peak traffic, targeting a **99.9%** uptime.\n• Adopted **Agile** methodologies to streamline project management and improve team collaboration, enhancing velocity tracking to exceed a **20%** increase in productivity over multiple sprints.\n• Applied best practices in **DevOps** for Continuous Integration and Continuous Deployment (**CI/CD**) pipelines, reducing deployment times by **40%** through automation and streamlined tooling.\n• Integrated secure payment systems utilizing **Stripe Payments**, ensuring compliance with PCI standards and increasing transaction success rates by addressing payment-related issues.\n• Employed **Infrastructure as Code** principles to efficiently manage and provision resources, achieving significant cost reductions in dev/test environments by **30%**.\n• Implemented robust containerization strategies using monitoring and logging tools, enhancing application transparency and system performance analysis, resulting in improved response times by **25%**.\n• Established comprehensive design systems with technical documentation to facilitate smoother onboarding processes and maintain consistent UI standards across all applications, improving team adaptability.\n• Utilized problem-solving and analytical skills to troubleshoot complex issues swiftly, reducing overall issue resolution time to under **6 hours** on average.\n• Effectively managed time and multitasked across multiple projects, ensuring timely delivery of features in alignment with strategic business objectives."
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tPython\n\t•\tJavaScript/TypeScript\n\t•\tSQL\n\n **Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\t•\t.NET Core\n\n **Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\t•\tHTML\n\t•\tCSS\n\n **API Technologies:**\n\t•\tStripe Payments\n\n **Serverless and Cloud Functions:**\n\t•\tAWS: Lambda\n\t•\tAzure: App Services\n\n **Databases:**\n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\t•\tRedis\n\n **DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\n **Cloud & Infrastructure:**\n\t•\tAWS: ECS, RDS, S3\n\t•\tAzure: Blob Storage, SQL Database\n\n **Other:**\n\t•\tAgile\n\t•\tCI/CD\n\t•\tContainerization\n\t•\tMonitoring Tools\n\t•\tLogging Tools\n\t•\tTooling Automation\n\t•\tDesign Systems\n\t•\tTechnical Documentation\n\t•\tMLflow\n\t•\tAirflow\n\t•\tKubeflow\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\t•\tNginx\n\t•\tLet’s Encrypt\n\t•\tCertbot\n\t•\tProblem-Solving\n\t•\tAnalytical Skills\n\t•\tCommunication Skills\n\t•\tTime Management\n\t•\tMultitasking"
}