{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Python Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Python Software Engineer with 13+ years of experience in developing high-performance applications across the healthcare and financial sectors. Proficient in **Python**, **FastAPI**, and **microservices**, with hands-on expertise in building REST and gRPC APIs, utilizing **OpenAPI** for documentation. Skilled in containerization with **Docker** and **Docker Compose**, and experienced in orchestration with **Kubernetes**.\nDeep understanding of Machine Learning principles, with experience in AI/ML platforms and integrating **GenAI**, **LangChain**, and **LangGraph** technologies. Demonstrated capability in deploying applications on **AWS** services such as **S3**, **EC2**, **Lambda**, and **API Gateway**, and in CI/CD processes using **Git**, **GitHub Actions**, and **AWS CodePipeline** alongside infrastructure as code with **Terraform** and **CDK**.\nStrong advocate of software engineering best practices, compliance-driven development, and aligning solutions with industry standards. Known for delivering innovative solutions through automation and predictive analytics, while maintaining a focus on quality and performance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and built full-stack applications adhering to **software engineering best practices** utilizing **Python** and **FastAPI** to ensure robust performance and maintainability.\nDeveloped and deployed **microservices** architecture using **Docker**, **Kubernetes**, and AWS services such as **Lambda** and **EC2**, enabling scalable solutions with high availability across **9** different systems.\nImplemented seamless **REST** and **gRPC** APIs with OpenAPI specifications, resulting in improved communication between services and reduced latency by **25%** in data retrieval operations.\nIntegrated **CI/CD** pipelines leveraging **GitHub Actions** and AWS CodePipeline, achieving a **30%** increase in deployment efficiency and continuous integration of features with automated testing and error handling.\nLed the design and implementation of machine learning algorithms and operations, utilizing tools like **LangChain** and **GenAI**, enhancing data processing efficiency and model deployment time by **40%**.\nManaged cloud resources using **Terraform** and CDK for automated infrastructure provisioning, reducing manual setup time by **50%** across development and production environments.\nConducted in-depth code reviews and mentoring sessions in **English** at a B2/C1 level to align team practices with high standards and to enhance collaborative software development efforts.\nDeveloped user-centric API functionalities facilitating seamless integration for external partners and enhancing user experience by incorporating feedback-driven improvements.\nUtilized modern frameworks and libraries to ensure responsive and performant web applications, adhering to design principles and best practices in code quality.\nStreamlined backend processes using efficient data retrieval techniques and optimizing existing databases for query performance, demonstrating proficiency with SQL and NoSQL solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and maintained scalable microservices architectures using **Python (FastAPI, Django)**, improving performance for high-throughput financial systems with **REST** and **gRPC** APIs.\n• Designed, containerized, and orchestrated applications using **Docker**, **Docker Compose**, and **Kubernetes**, facilitating seamless deployment and scalability across cloud environments.\n• Implemented CI/CD pipelines with **GitHub Actions** and **AWS CodePipeline**, ensuring robust software delivery and adherence to **software engineering best practices**.\n• Built and deployed machine learning models for proactive fraud detection leveraging **scikit-learn**, **XGBoost**, and integrated solutions within the **AWS** ecosystem, ensuring real-time anomaly detection in over **100,000 transactions per day**.\n• Developed interactive dashboards using **D3.js** and Power BI Embedded, offering analytics for user engagement and operational metrics, successfully reducing decision-making time by **30%**.\n• Created and managed **ETL** pipelines using **Apache Airflow** and **Azure Data Factory** for ingesting financial data, supporting both batch and real-time processing for data-driven decision-making.\n• Designed and implemented **event-driven architectures** utilizing **Kafka** and **RabbitMQ**, enhancing system efficiency with improved asynchronous communication across critical workflows handling **over 50,000 events per minute**.\n• Utilized **AWS** services, including **S3**, **EC2**, and **Lambda**, to enhance application reliability and performance, achieving a **99.9% uptime** for cloud-based systems.\n• Enhanced collaboration across teams by documenting and refining **OpenAPI** specifications for all microservices, ensuring consistent and clear API integrations."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **FastAPI** for backend service design and optimization, ensuring scalability and high availability in a microservices architecture across a global e-commerce platform.\nImplemented **REST** and **gRPC** APIs, achieving over **99.9%** uptime and low latency response times for core functionalities like checkout and order fulfillment.\nDeveloped CI/CD pipelines using **GitHub Actions** and **AWS CodePipeline** for streamlined deployments and enhanced development efficiency.\nDesigned real-time features leveraging **Docker** and **Kubernetes** for deployment and orchestration, resulting in high-performance order updates and inventory management.\nEngineered distributed data storage solutions with **AWS S3**, **EC2**, and **Lambda**, ensuring fast access and resilience through a combination of **Redis** caching and **AWS** services.\nImplemented Machine Learning models using **scikit-learn** and **TensorFlow**, leading to a **15%** increase in conversion rates through personalized product recommendations.\nApplied software engineering best practices to ensure the integrity and maintainability of code, including documentation and code reviews.\nDeveloped, tested, and deployed microservice applications in **Docker** containers, facilitating easier integration and scalability across modular components.\nBuilt and integrated APIs using **OpenAPI** standards, ensuring clear documentation and usability for frontend and third-party integration.\nCollaborated in a team using **Git** for version control, achieving seamless cooperation on projects and ensuring consistent delivery of software increments.\nFostered best practices for security and compliance, including **OAuth 2.0** for authorization and ensuring GDPR standards for user data protection."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, microservices\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST, gRPC, OpenAPI, API Gateway\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, S3, EC2\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Docker Compose, Kubernetes, GitHub Actions, GitLab CI/CD, AWS CodePipeline\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Azure: App Services, Terraform, Ansible, Helm, CDK\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Machine Learning, GenAI, LangChain, LangGraph, CI/CD, Git, software engineering best practices, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, English B2/C1"
}