{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Full Stack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior Full Stack Engineer with 8 years of experience, I excel in developing scalable and high-performance applications using **.NET**, **C#**, **.NET Core**, **ASP.NET Web API**, and **Entity Framework**. My technical proficiency extends to **TypeScript**, **Vue.js**, **Vuex**, **Pinia**, and database solutions such as **MSSQL** and **PostgreSQL**. I have a strong command of implementing **RESTful APIs** and have successfully integrated cloud services including **Azure**, **AWS**, and **GCP**.\n\nI possess extensive knowledge of **CI/CD** practices, alongside experience with **Docker**, **Kubernetes**, and infrastructure as code tools such as **Terraform** and **Helm**. My background in microservices architecture and messaging systems like **RabbitMQ**, **Kafka**, and **Azure Service Bus**, allows me to design robust and efficient systems.\n\nIn addition to my technical skills, I emphasize strong collaboration, mentoring, and agile methodologies including **TDD** and **BDD**. I am adept at conducting unit, integration, and end-to-end testing to ensure the delivery of high-quality software solutions. My previous roles in the healthcare and financial domains have honed my ability to meet compliance requirements and deliver innovative solutions aligned with industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained RESTful APIs using **ASP.NET Web API** and **Entity Framework** for robust data handling and storage in **MSSQL** and **PostgreSQL**.\n- Engineered scalable applications with **.NET Core** and **C#** focusing on **microservices** architecture to enhance system reliability and maintainability.\n- Utilized **TypeScript**, **Vue.js**, and **Vuex** to build dynamic user interfaces, improving user engagement metrics by **25%**.\n- Implemented CI/CD pipelines leveraging **Docker**, **Kubernetes**, and **GitHub Actions** to ensure rapid deployment cycles with a **50%** reduction in release times.\n- Designed and executed comprehensive unit and integration testing using **NUnit** and **MSTest**, ensuring code quality and reliability with over **95%** code coverage across multiple services.\n- Collaborated in an Agile environment participating in daily stand-ups, sprint planning, and retrospectives to enhance team performance and product delivery times.\n- Mentored junior developers on best practices in **TDD**, **BDD**, and modern development practices, fostering a culture of continuous improvement.\n- Integrated Azure services and utilized **Terraform** for infrastructure as code, facilitating faster provisioning of cloud resources, thus reducing setup time by **40%**.\n- Enhanced system messaging with **RabbitMQ** and **Kafka**, optimizing data flow and enabling real-time analytics across applications.\n- Streamlined application monitoring and logging processes using **Azure Application Insights** and **ElasticSearch** to ensure proactive performance management.\n- Facilitated cross-team collaborations to develop new features, improving user satisfaction scores significantly.\n- Engaged with stakeholders to gather requirements and design solutions that align with business objectives and technology frameworks."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Led the development of scalable financial platforms employing **.NET Core** and **ASP.NET Web API** architecture, enhancing system performance by **30%** to manage high-volume transaction systems effectively.\nDesigned and implemented RESTful APIs utilizing **Entity Framework** and **LINQ**, achieving a **25%** increase in data retrieval efficiency and improved maintainability within the applications.\nUtilized **Vue.js** (version 3) and **TypeScript** to craft interactive and responsive user interfaces, effectively employing **Pinia** for state management to streamline the user experience in financial dashboards.\nIntegrated asynchronous messaging using **RabbitMQ** and **Kafka** for an efficient, event-driven architecture, facilitating real-time communication and achieving near-instantaneous alert and transaction processing.\nBuilt and optimized CI/CD pipelines using **Docker** and **Kubernetes**, increasing deployment frequency by **40%** through automation in build, test, and release processes.\nConstructed robust ETL processes with **Python** and **Apache Airflow**, ensuring timely ingestion of financial data from internal and third-party sources with up to **99%** accuracy.\nMentored junior developers in Agile methodologies, focusing on **TDD** and **BDD** practices to improve code quality and team collaboration, resulting in a **15%** reduction in bugs during production.\nImplemented comprehensive unit and integration testing strategies that improved application reliability, reducing defect rates by **20%** post-deployment."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained robust web applications utilizing **.NET 6+**, **C#**, and **ASP.NET Web API**, ensuring adherence to best coding practices and design patterns for optimal performance and maintainability.\nEngineered scalable and efficient microservices architecture, facilitating seamless integration of various backend processes using **Entity Framework**, **LINQ**, and **RESTful API**, resulting in improved response times by up to **40%**.\nImplemented continuous integration and deployment (CI/CD) pipelines with **Git**, **Docker**, and **Kubernetes**, leading to smooth deployments with minimal downtime and a structured workflow that improved development speed by **30%**.\nUtilized front-end technologies such as **Vue.js**, **TypeScript**, and **Vuex**, developing responsive applications that enhanced user engagement with a mobile-first approach, contributing to a **25%** increase in user satisfaction ratings.\nDesigned and optimized database solutions using **MSSQL** and **PostgreSQL**, ensuring high availability and performance for dynamic data storage and retrieval, with a focus on reducing query execution times by **50%**.\nCollaborated within an Agile team, utilizing techniques such as **TDD** and **BDD**, which fostered a culture of robust testing and better product quality, ensuring fewer post-deployment bugs by **70%**.\nMentored junior developers on best practices in coding and facilitated knowledge-sharing sessions to improve team efficiency and knowledge retention.\nImplemented extensive testing frameworks, conducting **Unit Testing**, **Integration Testing**, and **End-to-End Testing**, ensuring application reliability and functionality across different user scenarios.\nIntegrated third-party services and APIs, enhancing application capabilities while maintaining security and efficiency in data exchange.\nLeveraged cloud services such as **Azure** and **AWS** for application hosting and assets management, ensuring scalable and high-performance delivery across global platforms."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, C#, .NET, .NET Core, .NET 6+\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, ASP.NET Web API, Entity Framework\n\n**Frontend Frameworks**\n\tJavaScript/TypeScript (React, Vue.js, Angular), Vuex, Pinia\n\n**API Technologies**\n\tRESTful API, JWT, OAuth2\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, MSSQL\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm\n\n**Cloud & Infrastructure**\n\tAzure, AWS, GCP\n\n**Other**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Microservices, RabbitMQ, Kafka, Azure Service Bus, Unit Testing, Integration Testing, End-to-End Testing, Agile, TDD, BDD, Collaboration, Mentoring, Nginx, Certbot"
}