{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Front End Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Front End Software Engineer with 13+ years of experience in delivering high-performance applications, primarily focused on crafting seamless user interfaces and engaging web experiences. Proficient in **Vue.js**, **React**, and **Angular**, with expertise in **CSS**, **Tailwind CSS**, **Bootstrap**, and layout techniques such as **Flexbox** and **Grid**. Experienced in utilizing tools like **Storybook**, **Figma**, and **Sketch** for design implementation and prototyping.\nStrong background in automated testing and integration, utilizing frameworks such as **Cypress**, **Jest**, and **Playwright** to ensure robust and scalable applications. Well-versed in continuous integration and deployment (CI/CD) practices to streamline development workflows and enhance efficiency.\nAdditionally, skilled in JavaScript/TypeScript, Python, and building REST APIs, ensuring a comprehensive approach to development that aligns with cloud-native environments, particularly on **Azure**. Proven track record in compliance-driven approaches, focusing on implementing standards that meet industry regulations. Leverages AI tools and an automation-first strategy to optimize development processes and enhance software capabilities.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Front End Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained interactive web applications using **Vue.js** and **React** (17–18), creating visually appealing user interfaces with **CSS**, **Tailwind CSS**, and **Bootstrap** to ensure responsiveness and usability.\n• Collaborated on defining and enforcing robust testing strategies using **Cypress** and **Jest** to achieve comprehensive coverage across unit, integration, and end-to-end tests.\n• Implemented CI/CD pipelines tailored for front-end projects, ensuring automation-first approach with tools such as **GitHub Actions** and **CircleCI** to streamline deployment workflows.\n• Integrated REST APIs for seamless backend communication, adhering to best practices in data security and performance to enhance application responsiveness.\n• Worked with design systems and prototyping tools like **Figma** and **Sketch** to collaborate with UI/UX teams, implementing designs using component libraries like **Storybook**.\n• Enhanced user experience through dynamic features and interactive components, addressing user needs and improving engagement in line with project goals.\n• Utilized automation tools to incorporate testing and deployment processes efficiently, reducing manual errors and improving turnaround times.\n• Actively participated in code reviews, fostering knowledge sharing and maintaining high standards for code quality and maintainability.\n• Produced advanced data visualizations using **D3.js** and **Chart.js**, enabling real-time analysis of user interactions and application performance metrics.\n• Created user-focused features such as responsive layouts and intuitive navigation, emphasizing performance optimization in line with best practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Applied front-end development skills using **React (18)**, **Vue 3**, and **Next.js** to create responsive and engaging user interfaces for various applications.\nUtilized **Tailwind CSS** and **Bootstrap** for styling, ensuring alignment with modern design principles and creating user-friendly layouts.\nImplemented reliable and efficient **REST APIs** to enhance application performance and facilitate seamless integration with back-end services.\nConducted comprehensive testing using **Cypress**, **Jest**, and **Playwright** to ensure high-quality code and deliver a bug-free user experience in at least **3 major releases** per quarter.\nCollaborated with UX/UI Designers using **Figma** and **Sketch** to convert wireframes and prototypes into high-quality code while ensuring adherence to design specifications.\nEngaged in CI/CD practices to streamline deployment, reduce errors, and improve the automation-first approach, implementing processes that decreased delivery time by **30%**.\nParticipated in code reviews and provided mentorship in front-end technologies to fellow team members, enhancing overall team skill sets.\nMaintained awareness of industry trends and best practices in front-end development, actively contributing innovative ideas to project discussions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed responsive, SEO-friendly user interfaces utilizing **Vue.js (3)**, **React (18)**, and **Angular**, ensuring high standards for mobile-first design and accessibility compliance (WCAG 2.1).\n- Implemented **Tailwind CSS**, **Bootstrap**, and **Flexbox** for efficient styling and layout strategies, resulting in a **30%** improvement in user engagement metrics.\n- Created high-fidelity prototypes and design variations using **Figma** and **Sketch**, enabling quick iteration in the design phase based on user feedback.\n- Streamlined UI testing using **Cypress** and **Jest** to maintain high-quality standards and enforce a robust CI/CD pipeline, reducing bug rates by **25%**.\n- Designed and optimized REST APIs in **.NET** and **C#**, facilitating seamless interaction between frontend components and backend services, processing over **10,000** requests per minute.\n- Collaborated with backend teams to integrate data streams from **MSSQL**, providing a solid foundation for dynamic data management and user personalization.\n- Employed an automation-first approach to continuously improve deployment processes in Azure, resulting in a **40%** faster time-to-market for new features.\n- Implemented feature flags for A/B testing, allowing for controlled feature rollouts and minimizing risks during major updates.\n- Enhanced application performance through advanced state management with **Redux Toolkit** and real-time interactions using WebSockets.\n- Leveraged AI tools to optimize user recommendations and personalization strategies, improving conversion rates based on real-time data analysis."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#\n\tPython\n\n**Frontend Frameworks:**\n\tReact\n\tVue.js\n\tAngular\n\tCSS\n\tTailwind CSS\n\tBootstrap\n\tFlexbox\n\tGrid\n\tStorybook\n\tFigma\n\tSketch\n\tPlaywright\n\tCypress\n\tJest\n\n**API Technologies:**\n\tREST APIs\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Artificial Intelligence & Machine Learning:**\n\tMLflow\n\tAirflow\n\tKubeflow\n\tAI tools\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\tMSSQL\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tCI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\tAutomation-first approach\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose"
}