{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Unity Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Unity Engineer with 8 years of experience, I leverage my strong skills in **Unity**, **C#**, and game development to create interactive, high-performance live service games. My background in developing robust systems includes expertise with **MonoBehaviours**, **ScriptableObjects**, **Prefabs**, and **Addressables**, ensuring seamless game flow and user experience.\nWith hands-on experience in **GoLang**, **Redis**, **SQL**, and **Docker**, I implement scalable backend solutions and maintain efficient CI/CD processes. My technical acumen extends to collaborating in cross-functional teams to deliver innovative gaming experiences aligned with player expectations and industry standards. I thrive on integrating agile methodologies and real-time data processing to foster adaptive game environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Unity Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and optimized building blocks for game development using **C#**, implementing **MonoBehaviours**, **ScriptableObjects**, and **Prefabs** to enhance gameplay dynamics and increase user engagement.\nArchitected and managed live service games, ensuring functionality conforms to player needs and business objectives through responsive deployment strategies and feature updates by utilizing **CI/CD** practices.\nLeveraged **Docker** for containerization of game services and microservices, enabling seamless integration into development workflows and improving runtime environments.\nDesigned and implemented efficient caching mechanisms using **Redis**, optimizing game state management and player session persistence across distributed systems.\nCollaborated on backend infrastructure leveraging **GoLang** to build performance-focused server systems for multiplayer environments, enhancing scalability and reducing latency.\nUtilized **SQL** to maintain relational databases for game data storage, ensuring efficient data retrieval and integrity, and improving overall game performance metrics.\nExecuted **Addressables** management to streamline asset handling in Unity, reducing build times by **30%** and improving memory management.\nDeveloped robust testing strategies using **CI/CD** tools, incorporating automated unit tests and integration tests to maintain code quality for game features.\nImplemented advanced analytics and monitoring tools for live service games to evaluate player engagement, retention rates, and monetization metrics, significantly enhancing player experience.\nParticipated in agile development processes, contributing to sprint planning and code reviews, leading to **20%** faster release cycles and improved team collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed and maintained gameplay features and systems using **C#** scripting in Unity, leveraging **MonoBehaviours** and **ScriptableObjects** to enhance modularity and reusability in game development.\n- Designed and implemented game assets and components using **Prefabs**, resulting in streamlined workflows and improved load times by **15%**.\n- Utilized **Addressables** for efficient asset management, achieving a load time reduction of **20%** during game runtime.\n- Integrated **Redis** for state management and caching mechanisms, significantly improving performance and response times in live service games.\n- Collaborated on CI/CD pipelines using **Docker**, enabling automated testing and deployment processes which reduced release cycles by **30%**.\n- Designed and developed backend services using **GoLang** and **SQL**, facilitating data-driven decision-making to enhance player experiences.\n- Contributed to real-time updates and features in live service games, ensuring stability and responsiveness for over **500K** active users.\n- Implemented robust data structures and algorithms for core game functionality, enhancing performance for game mechanics and reducing lag during critical gameplay moments."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **Unity** to develop high-quality game mechanics and interactive features, enhancing gameplay experience for live service games with optimized performance metrics, processing over **1000** concurrent users.\nDesigned and implemented custom **MonoBehaviours** and **ScriptableObjects** to build reusable game components, resulting in a **30%** reduction in development time for new features.\nLeveraged **Prefabs** and **Addressables** for efficient content management and asset loading, achieving a **25%** improvement in memory usage and load times for real-time updates.\nIntegrated **Redis** for game state management and caching mechanisms, ensuring rapid response to player actions and state changes during live sessions, effectively managing over **500,000** calls per minute.\nCollaborated with cross-functional teams to establish CI/CD pipelines using **Docker**, streamlining the build and deployment process, reducing release cycles by **50%**.\nDeveloped backend services in **GoLang** for matchmaking and player data storage, ensuring seamless player interactions and retention through efficient database management with **SQL**.\nConducted performance testing and optimization strategies to maintain a smooth user experience under heavy load, achieving an average latency of under **150ms** during peak usage.\nParticipated in live operations, monitoring server health and player feedback, implementing hotfixes and creating content updates to enhance player engagement continuously.\nEngaged in code reviews and mentoring junior developers on best practices, including proper utilization of **MonoBehaviours** and design patterns specific to **Unity** game development."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, C#, GoLang\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tNginx, JWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, game development, live service games, MonoBehaviours, ScriptableObjects, Prefabs, Addressables",
  "apply_company": "Limit Break"
}