{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Software Engineer with 8 years of experience in full-stack development, adept at leveraging **Python 3**, **FastAPI**, **PostgreSQL**, and **Google Cloud Platform** to deliver high-performance applications across the healthcare and financial sectors. Proficient in real-time data processing and crafting robust APIs and web services that enhance system integration and functionality.\n\nDemonstrated ability to implement scalable solutions using **RabbitMQ**, **Apache Kafka**, and **Google Pub/Sub** for efficient messaging and data streaming. Skilled in employing modern JavaScript/TypeScript technologies such as **React** and **Node.js**, as well as frameworks like **Django** to build seamless user experiences.\n\nStrong problem-solving skills and a collaborative team player, I have led the development of enterprise-grade platforms that incorporate AI/ML capabilities for predictive analytics and intelligent automation. My technical journey is complemented by hands-on experience with monitoring tools and CI/CD processes, ensuring that applications meet compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python 3** and **FastAPI** to develop scalable APIs for full-stack applications in the healthcare and financial sectors, ensuring adherence to high compliance standards.\nEmployed **PostgreSQL** for robust data storage and management, enhancing query performance for large-scale datasets by **30%**.\nImplemented real-time data processing solutions using **RabbitMQ** and **Apache Kafka**, improving data throughput and reducing latency issues by **25%**.\nDesigned and maintained web services, ensuring seamless integrations with third-party tools and services while focusing on **APIs** to streamline functionality.\nConducted thorough problem-solving sessions and debugging processes, enhancing application performance and reliability through collaborative team efforts.\nOversaw deployment and monitoring of applications in a cloud environment using **Google Cloud Platform**, improving deployment efficiency by **40%**.\nCollaborated effectively with cross-functional teams to troubleshoot issues quickly and implement solutions, resulting in a **20%** reduction in downtime across services.\nEmployed **Monitoring tools** to ensure ongoing performance insights and proactive issue resolution in production environments.\nDeveloped unit and integration tests to improve code quality and maintainability by covering **90%** of codebase with thorough test cases, increasing team confidence in deployments.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented scalable APIs and web services using **Python 3**, **FastAPI**, and **PostgreSQL**, achieving a **40%** reduction in response time for high-use endpoints.\nEngineered robust data processing solutions leveraging **Apache Kafka** and **RabbitMQ** for real-time notifications and event handling, enhancing system reliability and throughput by **30%**.\nDeveloped comprehensive analytics dashboards by integrating **Google BigQuery** and monitoring tools, providing live insights into transaction data with a **95%** uptime guarantee.\nCollaborated with cross-functional teams to adopt **Google Cloud Platform** services, improving deployment efficiency and reducing infrastructure costs by **25%**.\nUtilized **Redis** for caching strategies, speeding up data retrieval processes significantly and improving user experience on financial platforms.\nImplemented solutions for real-time data processing and ETL workflows using **Apache Airflow**, streamlining data ingestion pipelines from both internal and external sources.\nProactively identified and resolved software issues through team collaboration and problem-solving strategies, ensuring high-quality deliverables in each project phase."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python 3** and **FastAPI** to design and optimize backend services for a global e-commerce platform, achieving **99.9% uptime** and low latency across critical modules like checkout and order fulfillment.\nEngineered real-time data processing features with **RabbitMQ** and **Apache Kafka**, facilitating prompt order updates and enhancing customer support with rapid response times.\nDeveloped robust APIs and web services using **PostgreSQL** and **Redis**, ensuring **high scalability** for handling over **10,000 concurrent users** during peak traffic.\nLed team collaboration efforts to implement agile methodologies, focusing on problem-solving strategies that enhanced project delivery speeds by **30%**.\nIntegrated **Google Cloud Platform** for streamlined deployment and cloud services, enabling efficient search relevance optimization.\nApplied **Real-time data processing** techniques to enhance user experiences, resulting in a **15% increase** in conversion rates through personalized recommendations.\nImplemented monitoring tools to oversee application performance, achieving improved fault tolerance in distributed systems, supported by **ScyllaDB** and **Google BigQuery** for analytics. \n\nDeveloped and optimized e-commerce frontends using React (version **18**) and Vue 3, yielding fast, responsive applications compliant with accessibility standards (WCAG 2.1).\nCreated seamless payment workflows integrated with **Stripe** and **PayPal**, ensuring secure and tokenized transactions that comply with PCI standards.\nEstablished role-based access control (RBAC) and OAuth 2.0 protocols, fortifying security measures to protect user data and comply with GDPR regulations."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython 3\n\n**Backend Frameworks:**\n\tFastAPI\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tAPIs\n\tWeb services\n\n**Serverless and Cloud Functions:**\n\tGoogle Cloud Platform\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\tScyllaDB\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3)\n\tAzure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow\n\tAirflow\n\tKubeflow\n\tRabbitMQ\n\tApache Kafka\n\tGoogle Pub/Sub\n\tReal-time data processing\n\tMonitoring tools\n\tAuthentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)\n\tProblem-solving\n\tTeam collaboration"
}