{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Integration Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Integration Engineer with 8 years of experience, I excel in developing and integrating high-performance solutions within the healthcare sector, focusing on Mirth, HL7, XML, and JSON for seamless data exchange. I possess advanced skills in **API** integration and have hands-on experience in **data migration**, ensuring data integrity and compliance with industry standards. My technical proficiency extends to **Python** and **JavaScript**, enabling me to leverage modern frameworks for effective problem solving.\n\nMy strong foundation in **cloud architecture** with platforms such as **Azure** and **AWS**, coupled with expertise in **MS-SQL** and **SQL**, allows me to architect robust systems that are scalable and secure. I pride myself on my excellent communication and time management skills, which support effective collaboration with cross-functional teams to deliver high-quality results.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Integration Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed integration solutions using **Mirth** to facilitate data exchange and interoperability between healthcare systems, utilizing **HL7** messaging standards and data formats like **XML** and **JSON**.\n- Achieved data integrity and seamless data migration processes within healthcare applications leveraging **Python** and **JavaScript**, while implementing robust API integrations for optimal functionality.\n- Architected cloud-based solutions adhering to best practices in **cloud architecture**, ensuring scalable and secure data handling throughout the integration lifecycle.\n- Managed and implemented SQL databases such as **MS-SQL** for structured data storage, achieving a data retrieval improvement of up to **30%** through optimized queries and indexing strategies.\n- Spearheaded problem-solving initiatives that enhanced system functionality and user experience, achieving a **95%** satisfaction rate in stakeholder feedback through effective communication and timely project updates.\n- Implemented ETL processes for data integrity verification and ensured seamless data flow between systems, leading to a **40%** reduction in data discrepancies during migrations.\n- Collaborated cross-functionally to deliver integration projects on time, consistently meeting deadlines and enhancing time management within the development team, resulting in a **20%** acceleration in project completion timelines.\n- Designed technical documentation and procedural guides for all integration processes, aiding team knowledge transfer and future project scalability."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Applied **API** design principles to facilitate seamless integration and data exchange between healthcare systems and third-party applications using **Mirth** and **HL7** standards.\nUtilized **Python** and **JavaScript** to implement data migration solutions, ensuring data integrity and accuracy during the transition from legacy systems.\nEngineered robust cloud architecture to support data flow and integration processes, enhancing performance and scalability for a variety of systems.\nDesigned and constructed XML and JSON-based data interchange formats to optimize the communication between disparate systems and improve data accessibility.\nCollaborated effectively with cross-functional teams, showcasing strong problem-solving and communication skills to troubleshoot complex integration issues and deliver timely solutions.\nManaged multiple integration projects, demonstrating excellent time management skills to ensure all milestones were achieved within **90%** of deadlines.\nLeveraged **MS-SQL** for database management and data query optimization, enabling efficient data retrieval and storage solutions for integration tasks.\n "
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **HL7** and **XML** standards to design and implement robust APIs for seamless data integration and interoperability within healthcare systems, enhancing communication and data exchange accuracy by **30%**.\nDeveloped migration strategies for transitioning legacy data to modern platforms using **JSON** and **Python**, achieving successful data integrity and minimizing downtime by **20%** during integration processes.\nEngineered cloud architecture solutions that include deploying applications on **MS-SQL** databases while ensuring data integrity and compliance, reducing operational costs by **15%** through optimized resource allocation.\nEmployed **Python** for scripting automated data validation and transformation processes, improving data processing speed and reliability while reducing manual intervention by **50%**.\nImplemented effective problem-solving strategies leading to reduction of integration issues by **25%** during implementation phases, promoting smooth project execution.\nFostered collaboration and clear communication with cross-functional teams to ensure timely delivery of integration projects, enhancing time management and project success rates by **40%**.\nMaintained comprehensive documentation of integration processes and APIs to facilitate future maintenance and scalability, contributing to a more organized approach to ongoing data management.\nExploited **JavaScript** and related technologies for developing user-friendly interfaces that interact with backend systems, ensuring efficient data handling and user experience.\nDemonstrated in-depth experience in troubleshooting integration discrepancies and proposing actionable solutions to maintain system reliability and performance, resulting in improved system uptime and reliability."
    }
  ],
  "skills": "****Programming Languages:****\n\tPython, JavaScript\n\n****Backend Frameworks:****\n\tFastAPI, Flask, Django\n\n****Frontend Frameworks:****\n\tReact, Vue, Angular\n\n****API Technologies:****\n\tMirth, HL7, JSON, XML, API\n\n****Serverless and Cloud Functions:****\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n****Databases:****\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, MS-SQL, SQL\n\n****DevOps:****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n****Cloud & Infrastructure:****\n\tcloud architecture\n\n****Other:****\n\tdata migration, data integrity, problem solving, communication, time management, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Diagnexia"
}