{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Analytics Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior Analytics Engineer with 8 years of experience specializing in data architecture and data pipelines development. Proficient in **SQL**, **dbt**, **Python**, **Git**, and machine learning techniques for predictive modeling and data analysis. I excel in crafting data transformation solutions that enhance performance and efficiency. My strong background in CI/CD ensures smooth data pipeline automation and integration. \n\nSkilled in fashioning robust data documentation and engaging in effective communication to facilitate organizational collaboration. I leverage my experience with statistical methods and organizational skills to deliver analytics solutions that drive strategic decision-making. I have a proven track record in managing complex projects across the healthcare and financial sectors, utilizing state-of-the-art technologies like **JavaScript**, **TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, **Django**, **Azure**, and **AWS**. My expertise also includes building enterprise-grade platforms with AI/ML capabilities for real-time data processing.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Analytics Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and maintained cloud-native data architecture leveraging **SQL**, **dbt**, and **Python**, optimizing complex data transformations and ensuring compliance with established data modeling standards.\nDeveloped robust data pipelines for efficient data ingestion, transformation, and documentation, supporting high data integrity and accessibility across various healthcare and financial applications.\nImplemented CI/CD strategies using **Git** for deployment automation, ensuring rapid delivery and reliability of analytics solutions across multiple environments.\nCollaborated with cross-functional teams to integrate machine learning capabilities and statistical methods into data workflows, enhancing predictive modeling for patient risk and fraud detection.\nExecuted data analysis initiatives to identify trends and drive insights, utilizing advanced techniques in analytics and communication skills to present findings effectively.\nEstablished comprehensive data documentation practices for data models and pipelines, ensuring transparency and scalability in the analytics processes.\nArchitected scalable ETL processes to streamline data integration workflows across various data sources.\nUtilized modern frameworks and tools, including **FastAPI** and **GitHub Actions**, to design efficient data workflows and maintain high-quality coding standards.\nLed efforts to document data architecture decisions and workflows, improving organizational knowledge and facilitating onboarding processes.\nDelivered high-quality data visualization reports that enhanced stakeholders' understanding of key metrics and operational KPIs, using tools like **Tableau** and **Power BI**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** and **dbt** for effective **data modeling** and **data transformation**, improving data accuracy and accessibility for analytical tasks in financial systems.\nDesigned and implemented efficient **data pipelines** using **Python**, ensuring seamless **data architecture** and integration with internal and third-party data sources, processing over **1 million** transactions daily.\nLeveraged **Git** for version control in collaborative projects, maintaining code integrity and facilitating CI/CD practices to achieve a **30%** reduction in deployment times.\nEmployed **machine learning** techniques for predictive modeling and statistical analysis to generate insights from financial data, enhancing decision-making processes and achieving a **25%** increase in predictive accuracy.\nDeveloped comprehensive documentation for data processes and architectural decisions, ensuring clarity and facilitating knowledge transfer among team members.\nCommunicated data-driven insights to stakeholders effectively, using strong **organizational skills** to prioritize tasks and manage project timelines efficiently.\nImplemented automated testing and monitoring systems to ensure the reliability of data transformations, reducing errors by **15%** in the initial data load process."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **SQL** and **dbt** for effective data transformation and modeling, ensuring high-quality data architecture and reliable analytics across platforms.\nDeveloped and maintained **data pipelines** utilizing **Python** for streamlined data processing, allowing for efficient **data analysis** and reporting.\nImplemented **CI/CD** practices to automate data workflow deployments, reducing manual errors and improving overall efficiency by **30%**.\nEngaged in **machine learning** projects, applying **statistical methods** and **predictive modeling** using Python libraries to derive actionable insights from complex datasets.\nLed the **data documentation** process, ensuring clear communication of data flow and schemas for cross-functional teams, enhancing collaboration by **25%**.\nEmployed **Git** for version control, enabling efficient code management and collaborative development on analytics projects.\nConducted thorough **data analysis** to provide insights that informed business decisions, resulting in a **20%** increase in operational efficiency.\nCommunicated findings effectively to stakeholders, leveraging strong organizational skills to present complex data stories clearly and concisely."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tNginx, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, dbt, data modeling, data transformation, data architecture, data pipelines, data documentation, machine learning, statistical methods, predictive modeling, data analysis, communication, organizational skills, Keycloak (OIDC, RBAC), Let’s Encrypt, Certbot",
  "apply_company": "OpenClassrooms"
}