{
  "name": "Patryk Zaslawski",
  "role_name": "Azure Cloud Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Senior Python Full Stack Developer with 8+ years of experience, I possess a strong expertise in **Azure Cloud**, **Azure DevOps**, **Terraform**, and **PowerShell**, enabling me to design and implement high-performance solutions specifically tailored for cloud environments. I have a proven track record in CI/CD processes and proficiency in **Azure Services** that enhance system reliability and security. My technical skills encompass **Python** and frameworks such as **FastAPI, Django, Flask, SQLAlchemy**, complemented by frontend technologies including **Angular, Vue, React**, and **Next.js**. I am experienced in utilizing **Azure Monitor**, **Application Insights**, **Microsoft Sentinel**, and **Microsoft Defender** to ensure robust security and monitoring practices. My background also includes expertise in **database optimization** with **PostgreSQL**, **MySQL**, and **MongoDB**, as well as a thorough understanding of **Security Best Practices** and **Network Setup**. I am committed to delivering enterprise-grade solutions aligned with industry standards and best practices in cloud computing.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Azure Cloud Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Designed and implemented scalable cloud solutions leveraging **Azure Cloud**, ensuring compliance with security standards and best practices.\n• Developed and maintained CI/CD pipelines using **Azure DevOps** for automated testing, deployment, and release management of **Python** microservices.\n• Provisioned and managed infrastructure with **Terraform** and **Azure Bicep**, optimizing deployment times and enhancing infrastructure as code practices.\n• Utilized **Azure Monitor** and **Application Insights** for monitoring performance and application health, ensuring proactive issue resolution.\n• Integrated and configured **Microsoft Sentinel** and **Microsoft Defender** for comprehensive security monitoring and threat detection in cloud environments.\n• Led cloud adoption initiatives by implementing the **Cloud Adoption Framework** and establishing **Azure Landing Zones** for secure and compliant deployment.\n• Managed user identities and access with **Active Directory** and **Entra ID**, enforcing security best practices across Azure services.\n• Automated cloud workflows using **PowerShell** scripts for efficient resource management and configuration across environments.\n• Played a pivotal role in team collaboration using **Atlassian Jira** for project tracking and organization, enhancing team productivity.\n• Guided the team in adhering to Microsoft certification pathways, ensuring team members maintain current knowledge in **Azure Services** and security protocols.\n• Collaborated on cross-functional teams to integrate Azure workloads with legacy systems, establishing cohesive cloud environments.\n• Mentored junior engineers in best practices for cloud architecture and application security, promoting a culture of continuous learning and improvement.\n• Implemented network setup strategies for secure communications between Azure resources and on-premises solutions.\n• Developed operational dashboards using **Power BI** and **Grafana** to provide insights into service performance and usage patterns.\n• Spearheaded migration projects to **Azure**, ensuring minimal disruption and optimal resource utilization during transitions.\n• Actively participated in capacity planning and optimization strategies to ensure resources were aligned with application needs."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Implemented and managed **Azure Cloud** infrastructure using **Terraform** and **Azure Bicep**, ensuring compliance with the **Cloud Adoption Framework** and best practices for security and scalability.\n• Developed and maintained CI/CD pipelines with **Azure DevOps** and automation scripts in **PowerShell** to streamline deployment processes, resulting in a **30% reduction** in deployment times.\n• Configured and monitored services in **Azure Monitor** and **Application Insights**, leading to improved system performance and reduced downtime by **15%**.\n• Ensured robust security best practices within Azure environment, leveraging **Microsoft Defender**, and **Microsoft Sentinel** for enhanced threat detection and compliance monitoring.\n• Collaborated with cross-functional teams to design and implement network setups that integrate **Active Directory** and **Entra ID** for secure user authentication across services.\n• Automated cloud resource management and monitoring, leading to a **20%** cost reduction through optimal resource allocation and scaling strategies.\n• Engaged in continuous integration and delivery methodologies using **Git**, enhancing collaboration across teams and significantly improving code quality.\n• Developed and maintained documentation utilizing **Atlassian Jira** for tracking and managing tasks and projects, leading to increased operational efficiency.\n• Achieved **Microsoft Certifications** validating expertise in Azure services, demonstrating commitment to professional growth and skills enhancement.\n• Engaged in infrastructure as code (IaC) practices, significantly simplifying resource deployment and configurations while minimizing manual errors.\n• Established **Microsoft 365** and **Microsoft Intune** configurations to ensure secure mobile device management and application deployment across company devices."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented CI/CD pipelines using **Azure DevOps** and **Git**, achieving a **30%** reduction in deployment time and ensuring consistent delivery of features across all environments.\nUtilized **Azure Monitor** and **Application Insights** for proactive performance tracking and error detection, enhancing system health visibility and incident response time by **25%**.\nDesigned and executed Azure infrastructure using **Terraform** and **Azure Bicep** to automate provisioning and management, leading to increased operational efficiency and streamlined cloud resource management.\nDeveloped secure access management strategies using **Active Directory** and **Entra ID** to uphold **security best practices** while ensuring compliance with industry standards.\nCreated automated scripts with **PowerShell** to facilitate operations and perform routine maintenance tasks within Azure environments, reducing manual workload by **40%**.\nArchitected and maintained scalable backend services in **Python** to support various cloud applications, ensuring high availability and optimized performance.\nLeveraged **Azure Services** including **Microsoft Defender** to enhance security frameworks and mitigate risks associated with cloud deployments.\nIntegrate monitoring tools and services such as **Microsoft Sentinel** for comprehensive threat detection and response in Azure environments.\nUtilized **Atlassian Jira** for project management, tracking progress, and collaborating with teams to ensure timely completion of Azure projects.\nLed cloud adoption initiatives using the **Cloud Adoption Framework** to migrate legacy systems and implement Azure Landing Zone strategies for better governance and compliance.\nConducted comprehensive network setups within Azure, ensuring robust architecture and resilient network topologies for a wide range of applications.\nExecuted performance and load testing strategies using tools like Apache JMeter and Locust to validate the robustness and stability of Azure-based applications under high traffic conditions."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure Functions\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Azure Cloud, Azure DevOps, Azure Bicep, Terraform, Azure Services, Azure Monitor, Microsoft Sentinel, Microsoft Defender, Azure Landing Zone\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Git, PowerShell, Network Setup, Security Best Practices, Cloud Adoption Framework, Active Directory, Entra ID, Microsoft 365, Microsoft Intune, Atlassian Jira, Microsoft Certifications"
}