{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Backend Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Backend Developer with 13+ years of experience in delivering high-performance applications across the healthcare and financial sectors. Proficient in **Java**, **Kotlin**, and **Spring Framework**, with extensive knowledge of **Postgresql** and **MySQL** for database management. Skilled in implementing **microservices** architectures, and experienced in utilizing **AWS** services such as **S3**, **Fargate**, and **Lambda** for cloud-native deployments. Strong advocate of Scrum methodologies with a commitment to quality assurance through **unit testing** and **integration testing**. Well-versed in **Git** for version control and **Gradle** for build automation.\n\nAlso experienced with **Python** for backend development, and have hands-on expertise in developing AI/ML-driven applications. Notable in delivering compliance-driven solutions aligned with standards such as HIPAA and PCI DSS. Excellent verbal and written communication skills, facilitating effective collaboration within teams.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Kotlin** to develop backend services following **microservices** architecture, ensuring efficient communication and data integrity across systems.\nEmployed **Spring Framework** to build robust RESTful APIs, facilitating seamless integration with various front-end applications and services.\nManaged databases using **PostgreSQL** and **MySQL**, optimizing queries and ensuring data security, availability, and performance.\nImplemented comprehensive **unit testing** and **integration testing** strategies, utilizing tools like JUnit and Mockito to deliver a high-quality codebase and minimize regressions in production.\nCollaborated in an agile environment using **Scrum** methodologies, participating in daily stand-ups, sprint planning, and retrospectives to enhance project delivery.\nLeveraged cloud technologies such as **AWS** for deployment, using **S3** and **Lambda** for storage and serverless compute solutions, achieving a **30%** reduction in server costs.\nExecuted CI/CD pipelines with **Git** and **Gradle**, enhancing code deployment efficiency and reducing deployment times by **40%**.\nDeveloped microservices capable of handling up to **1000** concurrent requests, ensuring fault tolerance and quick scalability with proper load balancing and service discovery features. \nApplied best practices for **verbal communication** and **written communication** to create clear documentation and facilitate collaboration among cross-functional teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Executed backend development tasks utilizing **Java**, **Kotlin**, and the **Spring Framework** to create scalable microservices tailored for financial applications.\nMaintained databases using **PostgreSQL** and **MySQL**, ensuring efficient data retrieval and management for up to **500,000** daily transactions.\nUtilized **Git** for version control to maintain code integrity and conducted **unit testing** and **integration testing** to ensure quality and performance standards in all services developed.\nCollaborated in an Agile environment employing **Scrum**, enhancing team productivity and project delivery timelines by **20%**.\nMigrated legacy systems to a microservices architecture, implementing robust API layers for seamless integration with frontend applications developed in **React**, **Vue**, and other frameworks.\nLeveraged **AWS services** including **S3**, **Fargate**, and **Lambda** for scalable application deployment and management, reducing the cost of infrastructure by **30%**.\nCommunicated effectively with cross-functional teams to gather requirements and deliver features that improved user engagement and satisfaction metrics by **15%**.\nCreated thorough documentation for both technical processes and user guides to enhance understanding and usability, supporting onboarding and training initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed robust backend services using **Java**, **Kotlin**, and the **Spring Framework**, ensuring system reliability and performance for high-traffic applications.\nEngineered microservices architecture to facilitate scalability and maintainability, utilizing **PostgreSQL** and **MySQL** for efficient data management across various modules.\nImplemented unit testing and integration testing methodologies to ensure high code quality and facilitate efficient CI/CD processes with **Git** and **Gradle**.\nManaged cloud infrastructure on **AWS**, leveraging services such as **S3**, **Fargate**, and **Lambda** to optimize application performance and reduce operational overhead.\nParticipated in agile Scrum methodologies, contributing to sprint planning, retrospectives, and daily stand-ups to enhance team collaboration and project throughput.\nEnsured high code integrity and compliance by conducting thorough reviews and fostering effective **verbal communication** and **written communication** skills within the team.\nFocused on system monitoring and improvements, leading to a **30%** reduction in service downtime and enhancing overall user experience.\nUtilized logging and monitoring tools to quickly diagnose and resolve performance issues, maintaining system uptime at **99.9%**.\nCollaborated with front-end developers to integrate user-facing elements and optimize APIs for faster response times, resulting in a **25%** increase in application speed."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Kotlin, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Framework\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Fargate, S3\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Terraform, Ansible, Helm, Docker Compose, microservices, Scrum, unit testing, integration testing, Nginx, Let’s Encrypt, Certbot, verbal communication, written communication"
}