{
  "name": "Rei Taro",
  "role_name": "Senior Security Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Detail-oriented Senior Security Engineer with over 10 years of experience in Incident Response, Security Operations, and Threat Intelligence. Skilled in Automation and Cross-functional Collaboration, effectively leveraging expertise in Networking technologies, TCP/IP, and various operating systems including Windows, MacOS, and Linux. Proficient in Coding and Scripting, with a strong focus on Malware Analysis, Digital Forensics, and Intrusion Detection. Adept at Incident Management and Performance Management, ensuring robust security measures are in place and maintained. Proven track record of implementing effective detection and response engineering strategies and contributing to high-impact projects across reputable organizations such as VISA, Sii Poland, and Reply Polska. Additionally, experienced in developing high-performing APIs and scalable services utilizing **Python** (**FastAPI**, **Django**, **Flask**) and cloud platforms like **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Led **Incident Response** initiatives to address security incidents, applying expertise in **Detection and Response Engineering** to mitigate threats in real-time.\nImplemented **Automation** workflows that improved efficiency by **35%**, utilizing scripting in **Python** and **Bash** to streamline processes across security operations.\nIdentified and responded to anomalies using **Intrusion Detection** systems, leveraging **TCP/IP** networking technologies to enhance monitoring capabilities.\nConducted **Malware Analysis** and **Digital Forensics** investigations to detect and respond to security breaches effectively, reducing average incident resolution time by **50%**.\nCollaborated with cross-functional teams, including **Windows**, **MacOS**, and **Linux** administrators, to develop cohesive security strategies that align with broader organizational goals.\nManaged **Logs Processing** and incident management tasks, utilizing tools to ensure proper tracking and timely response to reported incidents, maintaining a compliance rate of **100%** for regulatory audits.\nEngaged in **Threat Intelligence** and **Threat Hunting** activities, proactively identifying vulnerabilities and developing custom scripts to enhance detection mechanisms."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Automated incident response workflows by developing backend systems in **Python** and **FastAPI**, significantly improving incident management efficiency by **25%**.\nImplemented security operations strategies by creating event-driven microservices using **Celery** and **Redis**, allowing for asynchronous processing of financial data and reducing transaction request handling time by **30%**.\nExecuted robust security audits, utilizing **OAuth2** and **Azure AD B2C** for authentication, ensuring adherence to industry standards and compliance across environments.\nEngineered automated detection and response mechanisms through data pipelines, using **Apache Airflow** and **Azure Functions**, achieving a streamlined data flow that reduced regulatory data processing time by **40%**.\nCollaborated with cross-functional teams to enhance security operations, facilitating smooth system integrations and achieving successful release management under tight deadlines.\nStrengthened security posture by employing networking technologies and scripting to enhance intrusion detection while performing malware analysis and digital forensics on various operating systems, including **Windows**, **MacOS**, and **Linux**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented and optimized **automation** processes for incident response, enhancing the efficiency of security operations and ensuring timely resolution of incidents.\nConducted **malware analysis** and **digital forensics** to identify threats, leveraging data from various sources to support detection and response engineering.\nDeveloped and maintained robust **logs processing** systems to analyze security events across multiple platforms, encompassing **Windows**, **MacOS**, and **Linux** environments.\nFostered **cross-functional collaboration** with IT and development teams to integrate security measures throughout the software development life cycle, ensuring adherence to security protocols.\nUtilized **TCP/IP** networking technologies to design secure communication channels, enhancing the organization’s threat intelligence capabilities.\nAutomated incident management workflows using scripting in **Python** and **Bash**, significantly improving response times by up to **30%**.\nEngaged in proactive **threat hunting** activities, identifying vulnerabilities before they could be exploited, while achieving a **25%** reduction in potential threats.\n\n"
    }
  ],
  "skills": " **Incident Response**, **Security Operations**, **Automation**, **Cross-functional collaboration**, **Detection and Response Engineering**, **Networking technologies**, **TCP/IP**, **Windows**, **MacOS**, **Linux**, **Coding**, **Scripting**, **Malware analysis**, **Digital forensics**, **Intrusion detection**, **Threat intelligence**, **Threat hunting**, **Logs processing**, **Incident Management**, **Performance management**,  \n\tLanguages: Python (3.8+), SQL, Bash, JavaScript,  \n\tFrameworks: FastAPI, Flask, Django, Celery,  \n\tCloud & DevOps: AWS (EC2, S3, Lambda), Azure, Docker, Kubernetes, GitHub Actions, Azure DevOps,  \n\tDatabases: PostgreSQL, MySQL, MongoDB, Redis,  \n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow,  \n\tOthers: REST/gRPC APIs, Microservices, Kafka, CI/CD, PyTest, Git  ",
  "apply_company": "Meta"
}