{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Android Platform Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Experienced Senior Android Platform Engineer with a robust background in embedded systems development and system-level debugging, bringing over 8 years of software engineering expertise. Proficient in **C++**, **Kotlin**, and **Android AOSP**, I effectively design and implement high-performance solutions for automotive systems. Expertise in **Android OS internals**, **Hardware Abstraction Layer (HAL)**, and **embedded Linux** ensures seamless integration and functionality. Strong knowledge of automotive communication buses, **Android Automotive OS**, and **Over-the-Air (OTA) updates** contributes to my ability to deliver secure and reliable applications. I am well-versed in **virtualization technologies** and **hypervisors**, combined with a focus on **embedded systems security** and automotive functional safety standards, enabling me to craft innovative and compliant automotive solutions tailored to industry needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Android Platform Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and optimized embedded systems using **C++** and **Kotlin** for the Android AOSP, enhancing system performance by **30%**.\nImplemented the Hardware Abstraction Layer (HAL) for Android OS internals, ensuring seamless integration with automotive communication buses, leading to a **15%** reduction in latency.\nEngaged in system-level debugging for embedded Linux systems, significantly improving the reliability and stability of automotive applications.\nArchitected and developed solutions that comply with automotive functional safety standards, ensuring adherence to ISO 26262 in developing secure embedded systems.\nDesigned and deployed Over-the-Air (OTA) updates strategy, facilitating efficient software deployment and version control with **95%** success rate.\nWorked with virtualization technologies and hypervisors to create a robust environment for testing and deploying embedded applications.\nLed the development of features in the Android Automotive OS, impacting user experience and driving satisfaction rates up by **20%**.\nContributed to embedded systems security initiatives, implementing advanced security protocols to protect vehicle systems from potential threats.\nCollaborated in cross-functional teams to deliver high-quality automotive software solutions, utilizing communication and problem-solving skills in fast-paced environments.\nMentored junior engineers on embedded systems development using **C++**, focusing on best practices, performance optimization, and system safety compliance."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Developed and maintained **C++** and **Kotlin** modules for embedded systems, ensuring high-performance integration within the **Android Automotive OS** environment.\n- Engaged in **system-level debugging** of automotive communication buses, enhancing system reliability and stability by troubleshooting communication failures.\n- Designed and implemented **Hardware Abstraction Layer (HAL)** interfaces to ensure seamless interaction between hardware components and software, improving device interaction by **30%**.\n- Contributed to **embedded Linux** development, enhancing system operational efficiency and overall performance metrics by reducing boot time by **15%**.\n- Spearheaded the implementation of **Over-the-Air (OTA) updates**, facilitating secure, hassle-free upgrades for embedded applications in accordance with automotive functional safety standards.\n- Developed and tested software components for **automotive communication buses**, ensuring compliance with industry standards and protocols while reducing latency by **20%**.\n- Created virtualization solutions using **hypervisors** to enhance security and isolation of embedded applications, strengthening the overall platform against vulnerabilities.\n- Ensured robust **embedded systems security** practices, implementing security protocols that reduced potential threats by **40%** in automotive deployments.\n- Collaborated with cross-functional teams to define and adhere to **automotive functional safety standards**, resulting in higher-quality software releases and fewer post-launch defects.\n- Applied best practices in software development, including automated testing frameworks, ensuring **95%** code coverage and reliable delivery of features."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and optimized **embedded systems development** workflows for **Android Automotive OS** utilizing **C++** and **Kotlin** to enhance performance and functionality across vehicle interfaces.\nImplemented **system-level debugging** tools to troubleshoot and resolve issues within the **Android OS internals**, ensuring smooth operation within automotive applications.\nContributed to the development of the **Hardware Abstraction Layer (HAL)**, enabling seamless integration between hardware components and the Android platform for robust system performance.\nDesigned and executed strategies for **automotive communication buses**, facilitating reliable data transfer and communication within vehicle systems.\nEnhanced security measures by applying **embedded systems security** principles to protect against vulnerabilities and ensure the integrity of automotive applications.\nExecuted **Over-the-Air (OTA) updates** to improve software distribution and maintenance processes, achieving a **30%** reduction in manual update efforts.\nLeveraged **virtualization technologies** and **hypervisors** to create virtual environments that simulate automotive hardware for testing and development purposes, improving resource utilization by **40%**.\nMaintained compliance with **automotive functional safety standards** to guarantee the safety and reliability of software applications in automotive systems.\nCollaborated with cross-functional teams to define and implement best practices for **embedded Linux** development, enhancing code quality and system performance.\nConducted rigorous performance testing using advanced tools, attaining a **25%** increase in the responsiveness of the Android platform under peak load conditions.\nParticipated in the integration of **embedded systems security** measures, ensuring compliance with industry standards and safeguarding against vulnerabilities in automotive applications."
    }
  ],
  "skills": " **Programming Languages:**\n\tC++, Kotlin, Python, \n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, \n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor,\n\n **API Technologies:**\n\tREST & gRPC APIs, \n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), \n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQLAlchemy, Pydantic, Celery,\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, \n\n **Cloud & Infrastructure:**\n\tNginx, Certbot, Let’s Encrypt,\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, automotive communication buses, Android AOSP, Android OS internals, Hardware Abstraction Layer (HAL), embedded systems development, embedded Linux, system-level debugging, virtualization technologies, hypervisors, embedded systems security, Over-the-Air (OTA) updates, automotive functional safety standards"
}