{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "A dedicated Software Engineer with 8 years of full-stack development experience, specializing in delivering high-performance web applications using **React**, **JavaScript**, **HTML**, and **CSS**. Proven expertise in optimizing UI/UX for enhanced user engagement and satisfaction. Demonstrated capability in testing libraries to ensure robust application performance and reliability. Strong background in cross-team collaboration and mentoring, fostering knowledge sharing and skill enhancement among peers. I excel in performance profiling and optimization techniques, ensuring applications run efficiently in production. My programming knowledge extends to **Ruby** and **Go**, allowing for versatile project contributions. My history includes building secure and compliant solutions in healthcare and finance, leveraging cloud services such as **Azure** and **AWS**, and integrating AI/ML capabilities for advanced analytics. Passionate about public speaking and writing to share insights and strategies within the tech community.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** for developing intuitive and responsive user interfaces, enhancing user engagement through effective **UI/UX** strategies and modern design principles.\nEmployed **JavaScript**, **HTML**, and **CSS** to ensure seamless integration and functionality across the full-stack development of web applications.\nConducted comprehensive testing using various **testing libraries** such as Jest and Cypress, ensuring high code quality and performance across modules.\nCollaborated effectively in cross-team environments, driving **full-stack development** initiatives and integrating feedback into iterative design processes.\nMentored junior developers, fostering skill development in coding standards, performance profiling, and best practices.\nDemonstrated proficiency in **performance profiling**, optimizing applications for enhanced speed and user experience.\nLeveraged agile methodologies in collaboration with teams to deliver projects on time, maintaining consistent communication to align developmental goals.\nPresented technical knowledge and insights through public speaking engagements, sharing best practices and innovations within the team.\nDocumented processes and technical specifications, contributing to a knowledge base and improving team performance through effective **writing** skills."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)**, **JavaScript**, **HTML**, and **CSS** to design and develop dynamic, user-centered front-end applications, enhancing UI/UX for financial dashboards and administrative portals.\nConducted performance profiling to optimize application responsiveness, ensuring a seamless user experience across all platforms.\nCollaborated across teams to ensure alignment on project goals, enhancing project delivery efficiency and fostering a culture of mentoring within the development team.\nLed the modernization of financial platforms by adopting a microservices-based architecture using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, increasing scalability and maintainability for high-volume transaction systems.\nDeveloped analytics dashboards with **Power BI Embedded** and **D3.js**, enabling operations teams to analyze financial activity in real-time, resulting in a 30% decrease in time spent on manual reporting.\nIntegrated messaging systems like **Kafka** and **RabbitMQ** to facilitate robust event-driven architectures, enhancing processing efficiency for transactions and alerts.\nBuilt and managed ETL pipelines using **Apache Airflow** and **Azure Data Factory**, allowing for the batch and real-time ingestion of financial data from numerous sources, including third-party APIs.\nImplemented **AI/ML** fraud detection systems with tools like **scikit-learn** and **XGBoost**, proactively reducing fraud cases by 25% through improved predictive analytics.\nCreated machine learning pipelines for credit scoring and transaction classification using **MLflow** and **Airflow**, enabling real-time decisions and enhancing operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and optimized responsive web applications utilizing **React** (18), **JavaScript**, **HTML5**, and **CSS3**, ensuring high-quality UI/UX designs that enhance user engagement.\n• Employed testing libraries to write unit and integration tests, ensuring high reliability and performance efficiency in all web applications.\n• Collaborated cross-functionally with UI/UX designers and backend teams to deliver full-stack solutions that meet project specifications, enhancing overall product quality.\n• Mentored junior developers in best practices for **full-stack development**, fostering a collaborative learning environment within teams and improving team output by **20%**.\n• Conducted performance profiling using tools such as Lighthouse and React DevTools, identifying bottlenecks and implementing optimizations that improved page load times by **30%**.\n• Spearheaded public speaking initiatives for internal knowledge-sharing sessions, elevating team awareness around new technologies and methodologies.\n• Authored technical documentation and best practices guides to facilitate smoother onboarding processes and knowledge transfer among development teams.\n• Engaged in continuous learning to keep up with evolving web technologies, including advancements in **Ruby** and **Go**, that may enhance performance and scalability in future projects."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, JavaScript, HTML, CSS\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django), Ruby, Go\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tCross-team collaboration, Mentoring, Full-stack development, Performance profiling, Public speaking, Writing, Testing libraries, UI/UX, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)"
}