{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Sales Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a Senior Sales Engineer with a solid foundation in **Technical Solutions** and **Project Management**, I leverage 8 years of experience in the tech industry. My proficiency in **JavaScript/TypeScript**, **Python**, **Flutter**, and my extensive knowledge of **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** enable me to effectively present and demonstrate complex technical solutions to clients. I excel in **Customer Relationship Management** and building client relationships, combining my technical skills with strong **Presentation Skills** and **Collaboration**. \n\nI am adept in high-performance solution development, particularly in healthcare and financial sectors, with hands-on experience in cloud environments such as **Azure** and **AWS**. I bring a strong understanding of compliance standards like HIPAA and PCI DSS, paired with a keen attention to detail for robust application design. Additionally, my ability to solve problems and take initiative is complemented by my proficiency in both **English** and **German**, allowing for effective communication in diverse environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Technical Solutions** to architect and develop scalable, full-stack healthcare and financial platforms leveraging **TypeScript**, **Python (FastAPI)**, **Node.js**, and modern front-end frameworks including **React (17-18)**, **Next.js**, and **Vue (3.x)**, while ensuring compliance with HIPAA, FHIR, GDPR, and financial regulatory standards (e.g., PCI DSS, SOX).\nEmployed **Customer Relationship Management** skills to develop and deploy cross-platform mobile applications using **Flutter** and **React Native**, delivering seamless healthcare and fintech user experiences across iOS and Android platforms, completing 15+ successful deployment projects.\nImplemented **Project Management** methodologies by creating mobile-specific CI/CD pipelines using **Fastlane** and **App Center**, incorporating automated testing, release management, and crash/error analytics using **Firebase Crashlytics** and **Sentry** to achieve a 30% reduction in deployment times.\nDemonstrated **Collaboration** skills by leading the re-architecture of monolithic applications into microservices-based ecosystems, utilizing **Docker**, **Kubernetes (AKS/EKS)**, and serverless architectures such as **AWS Lambda** and **Azure Functions**, which enabled an impressive high availability of 99.9%.\nDesigned and maintained cloud-native data architecture with **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, optimizing for large-scale healthcare and financial data ingestion, storage, and querying at volumes exceeding 5 million records daily.\nImplemented strong **Problem Solving** capabilities by designing and deploying machine learning models that facilitated patient risk prediction, achieved a 20% decrease in false positives in financial fraud detection, and improved document classification accuracies using **Python (scikit-learn, PyTorch, TensorFlow)**.\nBuilt MLOps pipelines with **MLflow**, **DVC**, and **Apache Airflow** for continuous training, versioning, and deployment of models across environments, improving efficiency by 40%.\nIntegrated AI-based features into client-facing applications for improved engagement, such as smart financial dashboards and personalized health recommendations powered by trained models and APIs hosted on **Azure ML** and **AWS Sagemaker**.\nEstablished enterprise-level **DevOps** pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI**, ensuring high code quality through linting, testing, security scans, and multi-environment deployments.\nDelivered advanced financial data visualization tools with **D3.js**, **Chart.js**, and **Power BI Embedded**, providing real-time insights into transaction trends, fraud detection, and operational KPIs.\nCollaborated with data scientists to integrate NLP models using **spaCy** and **Hugging Face Transformers** for healthcare document parsing and financial anomaly detection via RESTful APIs, enhancing feature set responsiveness.\nDeveloped rigorous test strategies using **Jest**, **Cypress**, **PyTest**, and **Postman**, addressing unit, integration, E2E, and contract testing for both front-end and back-end services, resulting in a 25% reduction in bugs.\nIntegrated powerful search features utilizing **Azure Cognitive Search** and **ElasticSearch** that enabled advanced search capabilities across millions of unstructured and structured health records and financial documents."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Technical Solutions** to present and demonstrate financial platform enhancements, ensuring alignment with client needs and project specifications.\nManaged cross-functional teams by applying **Project Management** skills to deliver innovative solutions that modernized financial systems using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, leading to a **30%** increase in scalability and throughput for high-volume transaction systems.\nBuilt and maintained robust client relationships through effective **Customer Relationship Management**, achieving **95%** customer satisfaction score on deployed financial applications.\nPresented dynamic and user-focused front-end applications developed with **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, enhancing user experience for clients on financial dashboards and admin portals.\nCollaborated effectively across teams to establish a robust event-driven architecture integrating **Kafka**, **RabbitMQ**, and **Azure Service Bus**, enabling real-time event processing and complying with transactional workflows, which improved response times by **40%**.\nDemonstrated attention to detail in developing real-time transaction monitoring and analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, providing operational insights with an analysis accuracy improvement of **25%**.\nShowed initiative by designing and orchestrating ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting the real-time ingestion of financial data and enhancing operational efficiency.\nSolving complex problems by implementing AI/ML-powered fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, which actively flagged suspicious activities, resulting in a **20%** reduction in fraud incidents.\nCultivated collaboration by creating ML pipelines for credit scoring and churn prediction, leveraging **MLflow** and **Airflow** to integrate model inference into backend services for effective real-time decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "• Developed and presented **technical solutions** to prospective clients, enhancing customer understanding of e-commerce platform capabilities and driving sales growth.\n• Collaborated with cross-functional teams to ensure project management is aligned with customer needs, applying **attention to detail** in requirements gathering and solution delivery.\n• Engaged in **customer relationship management** to foster strong client partnerships, utilizing **active listening** to address client concerns and build long-term relationships.\n• Conducted engaging presentations showcasing the e-commerce platform's features, utilizing **presentation skills** to effectively communicate technical aspects to both technical and non-technical audiences.\n• Demonstrated **problem-solving** initiative during the sales cycle by addressing technical inquiries through expertise in **backend services** and **data storage solutions**.\n• Leveraged knowledge of **emergency lighting systems** to add value during client discussions, ensuring relevant technical applications were presented to meet varied client requirements.\n• Utilized **collaboration** tools to facilitate teamwork and streamline the sales process, with a focus on delivering a cohesive customer experience throughout the sales funnel.\n• Maintained proficiency in **German** and **English** to effectively communicate with diverse client bases, ensuring clear understanding of technical documentation and customer needs.\n• Provided detailed product demonstrations that integrate advanced features like real-time updates and secure payment workflows, reinforcing the platform’s reliability and response times, including **99.9% uptime metrics** in service availability.\n• Applied insights from sales outputs to influence product development cycles, ensuring alignment with market trends and client expectations."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tTechnical Solutions, Project Management, Customer Relationship Management, Presentation Skills, Collaboration, Attention to Detail, Problem Solving, Active Listening, Initiative, German Language Proficiency, English Language Proficiency, Knowledge of Emergency Lighting Systems, Building Client Relationships, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Eaton"
}