{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Backend Engineer with 8 years of experience, I excel in delivering robust and scalable backend solutions incorporating **Golang**, **Kotlin**, and **PHP**. My extensive knowledge of **AWS** cloud services and CI/CD practices enables me to streamline deployment processes and enhance application reliability. I am well-versed in microservices architecture, ensuring scalable and maintainable systems that drive business growth.\nI have a proven track record in database management, embracing strategic problem solving and fostering collaboration within cross-functional teams. My adaptability and curiosity towards emerging technologies empower me to implement innovative solutions effectively.\nAdditionally, I possess a strong foundation in full-stack development with technologies like **JavaScript**, **Python**, **React**, **Node.js**, and **Django**, along with experience in **machine learning** applications and cloud integrations. I thrive on leading projects that not only meet compliance standards but also leverage advanced analytics for impactful insights.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained microservices architecture using **Golang** and **PHP** to enhance scalability and performance in backend systems.\n- Implemented CI/CD pipelines using **GitLab** and AWS services, focusing on fast and reliable deployment processes that resulted in a **30%** reduction in deployment time.\n- Collaborated with cross-functional teams to solve complex backend-related problems, leading brainstorming sessions that improved system design and performance.\n- Designed robust database schemas and optimized queries for high-performance operations with AWS RDS and DynamoDB, significantly improving data retrieval times by **45%**.\n- Engaged in regular problem-solving discussions that fostered a culture of curiosity and innovation among team members, leading to enhanced team collaboration and improved product features.\n- Actively participated in code reviews and maintained high-quality standards, ensuring all code adheres to best practices and provided mentorship to junior developers.\n- Conducted performance tuning and scaling of backend services, achieving a **50%** decrease in latency during peak traffic periods.\n- Collaborated with DevOps teams to implement monitoring and alerting solutions using AWS CloudWatch and similar tools to ensure system reliability and uptime.\n- Developed APIs and backend services following RESTful principles, ensuring efficient data exchange and integration with frontend applications.\n- Engaged in continuous learning and exploration of new technologies, such as serverless architecture with **AWS**, to stay updated with industry trends and improve system architecture."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Golang** and **Kotlin** to enhance microservices architecture for financial platforms, improving response times by **30%** and system resilience.\nImplemented **AWS** solutions, leveraging cloud services for scalable backend infrastructure, resulting in a **25%** reduction in operational costs.\nCollaborated with cross-functional teams to design and optimize APIs, enhancing database interactions and ensuring data integrity across **PostgreSQL** and **MySQL** systems.\nMaintained version control and streamlined code deployment processes using **GitLab** and CI/CD practices, achieving a **40%** increase in deployment efficiency.\nConducted thorough problem-solving sessions with team members, fostering a culture of collaboration that led to more innovative solutions and quicker issue resolution.\nExpanded backend capabilities by integrating asynchronous processing models equipped with **RabbitMQ** for transaction handling.\nDeveloped and maintained robust documentation for backend services, significantly reducing onboarding time for new team members by **20%**.\nDemonstrated a curious approach towards emerging technologies, continually researching **PHP** updates and database optimization techniques to enhance the team's development processes."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **AWS** for deploying microservices architecture while ensuring robust application delivery and performance optimization.\nCollaborated with cross-functional teams to effectively solve complex problems through innovative design and implementation, focusing on improving system efficiency across **Golang**, **Kotlin**, and **PHP** backend services.\nImplemented CI/CD pipelines using **GitLab**, streamlining project deliverables while enhancing deployment speed and reliability across applications by **75%**.\nOptimized database interactions across various platforms, ensuring rapid data accessibility and integrity, reducing query time by **50%** through efficient database indexing and design.\nDesigned and optimized backend services using **Golang** and **PHP**, building scalable solutions that support a user base of over **1 million** users, ensuring low latency and high availability.\nEngaged in collaborative problem-solving sessions with development teams to address bottlenecks and improve system workflows, fostering a culture of curiosity and knowledge-sharing.\nAdministered synchronization between **Kotlin**-based services and legacy systems, enabling seamless data flow and consistency during transitions.\nLed the transformation of monolithic systems into microservices to enhance maintainability and scalability, reducing system downtime by **40%** during migration efforts.\nConducted rigorous testing and debugging of services to ensure quality and performance standards, achieving **99.9%** uptime across deployed applications."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, Golang, Kotlin, PHP\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD (Terraform, Ansible, Helm, Docker Compose)\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMicroservices, Problem Solving, Collaboration, Curiosity, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)",
  "apply_company": "OLX"
}