{
  "name": "Tomasz Lee",
  "role_name": "Senior iOS Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior iOS Engineer with expertise in Swift and SwiftUI, complemented by a strong foundation in Python. Over 9 years of experience in the software development lifecycle, emphasizing A/B Testing and effective Ads Systems implementation. Proven skills in problem-solving and collaboration, delivering high-quality code reviews and thorough documentation. Experienced in leading development efforts and streamlining processes, with a background in distributed systems and microservices architecture, equipped with knowledge in modern frameworks and a commitment to delivering robust mobile solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Swift** and **SwiftUI** to design and develop user-friendly iOS applications, enhancing user engagement metrics by 30%.\nConducted A/B Testing to optimize app features, resulting in a 20% increase in conversion rates.\nCollaborated with cross-functional teams to gather requirements and implement effective solutions, improving project delivery timelines by 25%.\nConducted thorough code reviews to ensure code quality and adherence to best practices, reducing bugs by 15% prior to release.\nCreated comprehensive documentation for software functionality and design decisions, streamlining onboarding for new team members.\nDemonstrated strong problem-solving skills to troubleshoot issues, significantly reducing resolution times by 40%.\nIntegrated ads systems into applications, improving monetization strategies and increasing ad revenue by 35%.\nMentored junior developers, fostering a culture of collaboration and continuous learning within the team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Swift** and **SwiftUI** to design and implement user-friendly interfaces, leading to a **20%** increase in user satisfaction ratings.\nConducted A/B Testing to analyze user behavior and optimize ads systems, achieving a **35%** increase in conversion rates.\nApplied strong problem solving skills to troubleshoot and resolve issues in mobile applications, reducing bug counts by **40%** before release.\nCollaborated with cross-functional teams to define system requirements, promoting effective teamwork and timely project deliveries.\nPerformed thorough code reviews, ensuring adherence to best practices and enhancing code quality among team members.\nDocumented development processes and technical specifications, improving knowledge sharing and onboarding for new developers.\nLed mentorship sessions for junior developers, boosting team collaboration and skill development, achieving a **50%** improvement in team efficiency.\nDeveloped high-performance mobile applications, continuously optimizing for speed and user experience using **Python** for backend services integration."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Swift** and **SwiftUI** to develop and enhance iOS applications, resulting in an increase in user engagement by **30%**.  \nConducted A/B testing to analyze user behavior, optimizing app features for improved performance based on data-driven insights.  \nApplied **Python** for backend integration to support mobile applications, streamlining data processing tasks by **25%**.  \nDemonstrated exceptional problem-solving skills by debugging and resolving application issues effectively, ensuring timely updates for users.  \nCollaborated with cross-functional teams to ensure alignment on project objectives and promote a culture of teamwork and open communication.  \nPerformed code reviews to maintain high-quality code standards and foster foundational learning among team members.  \nDeveloped comprehensive technical documentation and user guides to facilitate onboarding and enhance knowledge sharing across teams."
    }
  ],
  "skills": "**Programming Languages**\n\tSwift, SwiftUI, Python, JavaScript, TypeScript, C#, .NET\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, Microservices, Entity Framework\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, A/B Testing, Ads Systems, Problem Solving, Collaboration, Code Review, Documentation, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, Jmeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Whatnot"
}