{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior DFM Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic Senior DFM Engineer with 13+ years of experience in manufacturability and design for manufacturing (DFM) across industries. Expertise in **SolidWorks** and **3D CAD** for precision design, coupled with a strong understanding of GD&T principles, material selection, and sheet metal machining processes. Proven track record in enhancing product manufacturability and efficiency through innovative design solutions, including 5-axis machining and 3D printing.\nExceptional problem-solving and communication skills, fostering collaboration in multidisciplinary teams to deliver customer-focused results. Adaptable professional with a commitment to continuous improvement and excellence in manufacturing standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior DFM Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **SolidWorks** and **3D CAD** tools to design and develop complex CNC components, ensuring manufacturability and adherence to GD&T standards.\nConducted thorough analysis of design specifications to optimize the manufacturability of products, achieving a **15% reduction** in production costs through effective DFM strategies.\nCollaborated with cross-functional teams to implement new sheet metal and 3D printing techniques, resulting in an **increase of 25% in production efficiency** and improved product quality.\nLed problem-solving workshops to address manufacturing challenges, enhancing team communication and collaboration, which contributed to a **30% decrease** in project turnaround time.\nEstablished material selection guidelines that improved durability and reduced waste, achieving a **20% improvement** in material usage efficiency for new product releases.\nMentored junior engineers on CNC operations and 5-axis machining processes, cultivating a culture of adaptability and continuous learning in the engineering team.\nFocused on customer satisfaction by actively engaging with stakeholders to understand their needs and expectations, which led to a **40% increase** in positive feedback on product designs.\nImplemented robust communication protocols within the engineering team to ensure timely updates and alignment, facilitating smoother project progress.\nConducted regular design reviews to assess manufacturability aspects and provide actionable insights for design improvements, contributing to enhanced engineering quality standards."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Applied advanced **3D CAD** techniques in **SolidWorks** to ensure optimal design for manufacturability (DFM) while enhancing product quality and minimizing production costs.\nUtilized **GD&T** principles to provide precise tolerancing and to support efficient **5-axis machining** processes, resulting in a **20%** reduction in post-production adjustments.\nCollaborated with cross-functional teams to assess material selection and **sheet metal** fabrication strategies, achieving a **15%** increase in production efficiency.\nEmployed **3D printing** technologies to prototype designs, facilitating rapid iteration and testing, which reduced design cycle time by **30%**.\nCommunicated effectively with stakeholders to gather requirements and provide updates, ensuring alignment and transparency throughout the product development lifecycle.\nDemonstrated problem-solving skills by identifying and mitigating manufacturability issues early in the design phase, leveraging an adaptable approach to meet project timelines.\nFocused on customer needs by integrating feedback into product designs, enhancing the overall user experience and satisfaction rates by over **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied **DFM** principles to enhance manufacturability in designs for CNC & **3D CAD** technologies, resulting in streamlined production processes and cost savings of up to **15%**.\nUtilized **SolidWorks** to create detailed 3D models and assemblies, achieving a **30%** reduction in design iterations through effective problem-solving and collaboration with cross-functional teams.\nEmployed **GD&T** methodologies to ensure precision and compliance in part specifications and tolerances, enhancing product quality and reducing fabrication errors by **20%**.\nConducted extensive material selection analysis for **sheet metal** components, optimizing performance and cost while ensuring manufacturability in line with customer focus requirements.\nFacilitated communication between engineering and manufacturing teams, fostering a collaborative environment that improved turnaround time for prototypes by **25%**.\nIntegrated advanced techniques in **3D printing** and **5-axis machining** for innovative solutions, achieving rapid prototyping cycles and scalability in production volumes.\nDemonstrated adaptability in addressing customer feedback and evolving project requirements, effectively driving design enhancements and ensuring alignment with client objectives.\nImplemented robust problem-solving strategies to identify and address design challenges, leveraging data-driven insights to elevate product results and customer satisfaction.\nFostered strong relationships with clients by maintaining a focus on customer needs, ensuring deliverables met expectations while adhering to timelines and quality standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\t\n\n **Frontend Frameworks:**\n\t\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tCNC\n\t3D CAD\n\tSolidWorks\n\tGD&T\n\tmanufacturability\n\tDFM\n\tsheet metal\n\t3D printing\n\t5-axis machining\n\tmaterial selection\n\tproblem-solving\n\tcommunication\n\tcollaboration\n\tadaptability\n\tcustomer focus",
  "apply_company": "Xometry"
}