{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with over 13 years of diverse experience in software design, data structures, algorithms, and query execution, specializing in **C++** and **MongoDB Atlas**. Proven track record in developing high-performance applications that leverage distributed systems and cloud-native solutions. Expert in implementing **Change Streams** for real-time data processing and management.\n\nLeveraging a comprehensive tech stack including **JavaScript/TypeScript**, **Python**, **Flutter**, **Node.js**, **React**, **Next.js**, **Vue**, **FastAPI**, and **Django** to deliver robust full-stack applications. Demonstrated experience in building AI/ML-powered platforms focused on automation and predictive analytics.\n\nProficient in deploying systems on **AWS** and **Azure**, and adept in modern software practices like CI/CD pipelines and microservices architecture. Strong advocate of compliance-driven development with working knowledge of HIPAA, FHIR, PCI DSS, and SOC 2 standards. Passionate about mentoring junior developers and fostering collaboration within the team.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C++** to enhance system performance and optimize **query execution** for high-demand applications.\nEmployed strong **data structures** and **algorithms** knowledge to streamline backend processes and reduce operational latency by **25%**.\nDesigned and developed scalable and efficient software solutions through effective **software design** principles, ensuring maintainability and adaptability to future needs.\nContributed to **cloud-native** architecture by integrating solutions with **MongoDB Atlas**, leveraging features such as **Change Streams** to enable real-time data processing.\nCollaborated closely with teams to foster collaboration and enhance project outcomes, mentoring juniors to build technical proficiency and confidence in coding practices.\nLed the analysis and optimization of **database internals** for improved performance and reliability across systems, achieving a reduction in query time by **40%**.\nApplied expertise in **distributed systems** to architect solutions capable of handling increased workloads while ensuring fault tolerance and redundancy.\nConducted thorough performance testing and optimization to enhance system efficiency, yielding a performance improvement of over **30%** across multiple applications.\nDeveloped documentation and best practices to promote knowledge sharing among team members, ensuring a collaborative and learning-oriented work environment."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized software design principles to architect and implement distributed systems, ensuring reliable data handling and scalability for high-performance applications.\nMentored junior developers on efficient data structures and algorithms practices, fostering collaboration and enhancing team productivity.\nExecuted complex queries and optimized query execution plans in **MongoDB Atlas**, leveraging **Change Streams** for real-time data updates and notifications, improving data responsiveness by **30%**.\nDeveloped cloud-native solutions using **Node.js** and **Python**, contributing to the modernization of core financial platforms with enhanced performance and scalability.\nParticipated in code reviews and collaborative problem-solving sessions to improve overall software quality and maintainability.\nImplemented best practices for integrating **C++** components into existing architectures, optimizing performance across distributed systems.\nConducted regular team workshops focusing on database internals to improve collective knowledge and efficiency in database management.\nDeployed microservices in a cloud environment, enhancing system reliability and reducing operational costs by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C++** for implementing efficient query execution, enhancing the performance of backend services in a high-load environment.\nDemonstrated strong understanding of **data structures** and **algorithms** to optimize software design and execution in distributed systems, resulting in reduced latency by **30%**.\nApplied principles of **software design** for scalability and performance improvements across multiple services, with a notable emphasis on cloud-native strategies to deploy resilient applications.\nMentored junior developers on best practices in database internals, specifically focusing on **MongoDB Atlas** and its **Change Streams** capabilities for real-time data handling.\nCollaborated with cross-functional teams to design and optimize data processing workflows, employing strong problem-solving skills to tackle complex challenges in data management.\nIntegrated distributed systems principles for robust application architecture, ensuring high availability and fault tolerance in a multi-node environment.\nEngaged in continuous improvement practices, including technical documentation and code reviews, fostering a collaborative atmosphere within the development team.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tC++, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, MongoDB Atlas\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, mentoring, collaboration, query execution, database internals, data structures, algorithms, software design, cloud-native, distributed systems",
  "apply_company": "MongoDB"
}