{
  "name": "Rei Taro",
  "role_name": "Flutter Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Flutter Developer with deep expertise in mobile app development utilizing **Google Flutter** and **Dart**. Proven ability in implementing **BLoC Architecture** and **Cubit** for seamless state management, ensuring high-quality user experiences. Excellent visual design skills combined with strong communication capabilities to effectively collaborate cross-functionally. Previous experience includes over 10 years as a Senior Backend Developer, where I designed and delivered scalable backend systems, specializing in financial platforms and cloud-native architectures. Adept at leveraging technologies such as **AWS** and **Azure** to enhance system performance and resilience.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Flutter Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Google Flutter** and **Dart** to design and develop responsive mobile applications, enhancing user experience and engagement.\nImplemented **BLoC Architecture** and **Cubit** for effective state management, managing application states across **20+** screens efficiently.\nExecuted seamless mobile app development practices, leveraging modern visual design principles to create intuitive user interfaces.\nDeveloped and integrated asynchronous functionalities to improve app performance, ensuring a **30%** faster loading time via effective API management.\nProvided thorough communication throughout the development process, collaborating with cross-functional teams to address design and usability challenges.\nConducted performance optimizations, resulting in an improved app rating from **3.5** to **4.7** on app marketplaces.\nMaintained documentation and led code reviews for best practices, fostering a solid mobile development strategy within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Leveraged **Google Flutter** and **Dart** to develop mobile applications, ensuring a visually appealing and high-performance user interface.\nImplemented **BLoC Architecture** and **Cubit** for efficient state management in mobile app development, improving application responsiveness by **30%**.\nDesigned and executed user-friendly visual designs, adhering to industry standards to enhance user experience and engagement metrics by **25%**.\nFacilitated clear communication with cross-functional teams to ensure alignment on project requirements and timelines, successfully completing **95%** of projects on schedule.\nUtilized best practices in mobile app development to maintain code quality and achieve a consistent **40%** reduction in bug reports post-launch.\nCollaborated in regular code reviews and team meetings to foster a culture of continuous improvement and knowledge sharing among peers."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed mobile applications using **Google Flutter** and **Dart**, focusing on creating visually appealing and user-friendly interfaces.\nImplemented **BLoC Architecture** and **Cubit** for efficient state management, enhancing overall app performance in line with user experience requirements.\nCollaborated with design teams to ensure high-quality visual design, adhering to best practices and design guidelines on **Flutter**.\nMaintained clear and effective communication throughout the development process, fostering collaboration among cross-functional teams.\nAdhered to agile methodologies, completing features within **2-week sprints** and optimizing the app through continuous feedback loops.\nUtilized **Firebase** for backend services, ensuring scalability and reliability in a production environment, achieving a **99.9% uptime**.\nConducted testing and debugging processes, reducing the number of reported bugs by **30%** after implementing robust unit tests and integration tests."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, Dart\n\n**Frontend Frameworks**\n\tGoogle Flutter\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Other**\n\tMicroservices, Kafka, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, BLoC Architecture, Cubit, Mobile App Development, State Management, Visual Design, Communication"
}