{
  "name": "Rei Taro",
  "role_name": "Data Science and Machine Learning Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Results-driven Data Science and Machine Learning Engineer with over 10 years of experience in developing and implementing machine learning solutions. Proficient in leveraging **Python** along with libraries such as **scikit-learn**, **TensorFlow**, and **PyTorch** for advanced data modeling, data preprocessing, feature engineering, and model validation. Skilled in statistical methods and data visualization to derive actionable insights from complex datasets. Demonstrated expertise in managing projects with **Git** and working within **virtual machines** to streamline data workflows. Strong collaboration skills with a history of delivering impactful projects in financial platforms and AI/ML pipelines for leading organizations like VISA, Sii Poland, and Reply Polska. Committed to adhering to medical device regulations while ensuring quality documentation throughout the development process.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Data Science and Machine Learning Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Leveraged **Python** alongside **scikit-learn**, **TensorFlow**, and **PyTorch** to create machine learning models for predictive analytics, enhancing project efficiency by **30%**.\nImplemented feature engineering and data preprocessing to improve model performance, achieving a **15%** increase in predictive accuracy.\nCollaborated effectively with cross-functional teams to drive documentation processes, ensuring clear communication of machine learning workflows across departments.\nUtilized **Git** for version control, managing codebase updates for more than **20** projects collaboratively.\nApplied statistical methods to validate and test data models, contributing to adherence to medical device regulations.\nDeveloped data visualizations to present findings and insights, assisting stakeholders in understanding complex analytics through data-driven narratives.\nEngaged in ongoing model validation to meet evolving business needs, enhancing user onboarding and document automation processes.\nEmployed Azure virtual machines for scalable computational resources, successfully managing over **10** high-demand workloads."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Python** for data preprocessing and feature engineering to enhance machine learning models, improving accuracy by **15%**.\nEmployed **scikit-learn**, **TensorFlow**, and **PyTorch** for model validation and performance evaluation, achieving a model efficiency increase of **20%**.\nDeveloped robust documentation to support model development and deployment, ensuring compliance with medical device regulations.\nManaged version control effectively using **Git**, enabling seamless collaboration across project teams and enhancing code quality.\nApplied statistical methods for data analysis and visualizations, increasing insights clarity for stakeholders by **30%**.\nEngaged in collaborative efforts with interdisciplinary teams to align project objectives with business goals, maintaining strong communication channels throughout the workflow.\nIntegrated technology solutions through the deployment and management of virtual machines, optimizing resource usage and enhancing processing capabilities."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented machine learning algorithms with **scikit-learn**, **TensorFlow**, and **PyTorch** to enhance backend services for trade execution and portfolio management.\nUtilized **Python** for data preprocessing and feature engineering, improving model validation processes by **30%**.\nCollaborated with cross-functional teams to ensure seamless integration of data visualization tools, delivering analytics through REST APIs.\nDocumented methodologies and processes to comply with medical device regulations, including adherence to standards and practices.\nEngineered real-time data processing modules using **asyncio**, ensuring high throughput for trading data processing by achieving latencies of less than **50ms**.\nDeveloped robust testing frameworks using **PyTest** to validate model performance and operational stability, contributing to a **25%** reduction in bugs during development cycles.\nUtilized **Git** for version control, enabling collaborative workflows to manage project updates efficiently and effectively in a team of **9** engineers.\nEmployed statistical methods to analyze trading data, enhancing decision-making processes and outcomes for stakeholders."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\t\n\n  **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n  **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n  **Cloud & Infrastructure**\n\tvirtual machines\n\n  **Other**\n\tmachine learning, scikit-learn, TensorFlow, PyTorch, data preprocessing, feature engineering, model validation, statistical methods, data visualization, medical device regulations, collaboration, documentation, Pandas, NumPy, Airflow, MLflow, Kafka, PyTest"
}