{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of robust experience in developing high-performance applications tailored for diverse industries, particularly healthcare and finance. Proficient in **React**, **TypeScript**, **Next.js**, and supporting technologies such as **Tailwind**, **shadcn/ui**, and **Storybook**. Hands-on expertise in modern development practices using **Vitest**, **Node.js**, and **PostgreSQL**, ensuring the delivery of efficient and scalable frontend solutions.\nDemonstrated track record in deploying cloud-native architectures with **Azure Kubernetes Service** and leveraging **Pulumi** for infrastructure management. Experienced with CI/CD processes, utilizing **Flux** for streamlined deployments while maintaining code integrity using **GitHub**.\nExcellent communicator with a collaborative mindset, skilled in rationalizing complex project requirements and aligning team efforts via tools such as **Linear**, **Notion**, and **Slack**. Strong background in integrating compliance measures, ensuring that solutions meet necessary standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** and **TypeScript** to design and develop user-centric applications, focusing on performance and scalability with modern front-end techniques.\nImplemented state management solutions utilizing **Next.js** and **Node.js**, ensuring a seamless user experience and efficient data handling across the application.\nIntegrated component libraries like *Tailwind* and *shadcn/ui* to enhance UI/UX and maintain consistency across various frontend projects, accelerating development time by **30%**.\nDeveloped and maintained CI/CD workflows using **GitHub Actions** and **Pulumi** for efficient deployment processes and environment management.\nCollaborated with design teams using **Storybook** to create and test UI components in isolation, increasing the reusability of components across multiple projects by **25%**.\nEmployed advanced testing frameworks such as **Vitest** for robust unit and integration testing, ensuring high-quality code with a test coverage of over **90%**.\nParticipated in Agile methodologies by utilizing tools like **Linear** and **Notion** for project management, enhancing team collaboration and communication via **Slack**.\nLed initiatives to refactor legacy components, achieving code optimization and performance enhancements, which resulted in an average loading time decrease of **15%**.\nProvided mentorship to junior engineers, fostering team growth and knowledge sharing in best practices for frontend development.\nEnabled seamless data interaction and visualization strategies by utilizing **PostgreSQL** as a reliable data store, ensuring efficient querying and reporting capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)** and **TypeScript** to craft engaging front-end applications, incorporating **Next.js** and **Tailwind CSS** for optimal user experience and performance.\nImplemented state management effectively using **Redux Toolkit** to enhance application responsiveness and efficiency in financial tools and admin panels.\nCollaborated with cross-functional teams and utilized tools like **GitHub** and **Slack** for seamless project management and communication, ensuring timely delivery of features.\nEngaged in code documentation and component libraries with **Storybook**, fostering a reusable and maintainable codebase that adheres to best UI practices.\nConducted testing with **Vitest** to maintain high code quality and performance metrics, achieving a test coverage goal of **95%**.\nParticipated in the integration of **shadcn/ui** components to ensure design consistency across multiple applications, contributing to a cohesive product design.\nContributed to DevOps practices using **Azure Kubernetes Service** and **Pulumi** for efficient deployment and scalability of front-end applications, leading to an uptime improvement of **99.9%**.\nWorked closely with backend teams to optimize API consumption, ensuring that frontend applications interacted seamlessly with underlying services and resource endpoints.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **React (18)**, **TypeScript**, and **Next.js** to create high-quality, responsive frontend applications, improving user engagement on e-commerce platforms.\nImplemented UI components with **Tailwind CSS** and **shadcn/ui**, ensuring a visually appealing and consistent user experience while adhering to design principles.\nDeveloped and documented reusable components using **Storybook**, fostering collaboration and efficiency in the team’s development process.\nConducted testing and validation of UI features through **Vitest**, ensuring reliability and high performance in production environments.\nIntegrated backend services with **Node.js** to ensure seamless data flow and improve application efficiency, contributing to optimized page load times by over **30%**.\nLeveraged **PostgreSQL** for efficient data handling and storage solutions, resulting in enhanced application responsiveness during peak traffic periods.\nCollaborated with cross-functional teams using tools like **GitHub**, **Linear**, **Notion**, and **Slack** to streamline project management and maintain clear communication throughout the development lifecycle.\nParticipated in deployment and orchestration of applications using **Azure Kubernetes Service** and **Pulumi**, ensuring scalable and reliable deployment strategies for production environments.\nPlayed a pivotal role in the iterative development process, focusing on implementing agile methodologies and feature prioritization, which led to a reduction in project delivery timelines by **20%**.\nConsistently applied best practices in accessibility and SEO optimization, enhancing user engagement and ensuring compliance with WCAG 2.1 standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, Tailwind, shadcn/ui, Storybook, Vitest\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Azure Kubernetes Service, Terraform, Ansible, Helm, Docker Compose, Pulumi, Flux\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Linear, Notion, Slack",
  "apply_company": "Avido"
}