{
  "name": "Tomasz Lee",
  "role_name": "Senior Design Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled in **TypeScript**, **React**, **GraphQL**, **Node.js**, and **Postgres**, with 9+ years of experience as a Full Stack Developer. Proven expertise in designing user-centric **Design Systems**, **Component Systems**, and **Prototyping** to enhance user experience and streamline development. Well-versed in **Redis** for efficient data management, alongside a solid foundation in **analytics modeling** and **product specs**. Strong track record of **CI/CD** practices to optimize deployment processes. Exceptionally collaborative with advanced skills in **effective communication**, providing ownership and embracing diversity in team environments. A proactive problem solver committed to delivering high-quality solutions that meet customer needs.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Design Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **React** and **TypeScript** to design and develop user-centric web applications, enhancing overall user engagement by **30%**.\nImplemented **GraphQL** for efficient data retrieval, resulting in a **50%** decrease in API response times.\nCollaborated with UX/UI designers using **Figma** for wireframing, prototyping, and establishing a design system to ensure consistency and usability across the platform.\nEmployed **Node.js** for server-side development, integrating seamlessly with **Postgres** for reliable data management.\nDeveloped and optimized caching strategies with **Redis**, achieving a **35%** reduction in database load.\nConducted customer research and analytics modeling, providing insights that shaped product specs and design decisions.\nLed CI/CD initiatives with Azure DevOps, improving deployment efficiency by **40%** and enhancing team collaboration through effective communication.\nEmphasized ownership and problem-solving to tackle challenges in the design process, ensuring high-quality outputs that meet user needs.\nFostered diversity in team discussions, contributing to a rich collaborative environment and innovative design solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **TypeScript** and **React** to design and develop interactive prototypes, improving user interface consistency by **20%**.\nImplemented **GraphQL** for efficient data fetching, resulting in a **30%** decrease in loading times for user-facing applications.\nDeveloped and maintained robust component systems aligned with design systems, ensuring scalability and reusability across projects.\nLeveraged **Node.js** for backend development, streamlining communication between frontend and database while supporting **PostgreSQL** for data management.\nEnhanced application performance by integrating **Redis** for effective caching strategies, leading to a **25%** improvement in response times.\nCollaborated with cross-functional teams to define product specs and analytics modeling, ensuring clarity in project goals and alignment with user research.\nLed the creation of dynamic wireframes using **Figma**, enabling a faster design iteration process and stakeholder feedback integration.\nDrove the implementation of CI/CD pipelines, leveraging tools to automate testing and deployment, decreasing bug incidents in production by **30%**.\nFacilitated effective collaboration through regular team meetings to enhance ownership and transparency in project progression.\nConducted code reviews and provided mentorship to junior developers, promoting a culture of diversity and knowledge sharing within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **TypeScript** and **React** to develop user-friendly interfaces, enhancing user engagement by **30%**.\nDesigned and implemented efficient **GraphQL** APIs for improved data retrieval and management capabilities, optimizing server response time by **25%**.\nCollaborated with cross-functional teams to create design systems and components, promoting design consistency across multiple projects.\nEmployed **Node.js** to build backend services, improving application performance and reducing loading times by **15%**.\nUsed **Postgres** for database management, streamlining data access and enhancing retrieval speeds, resulting in a **20%** increase in operational efficiency.\nIntegrated **Redis** to implement caching strategies, significantly reducing database queries and improving application response time.\nLeveraged **Figma** for prototyping and wireframing, facilitating effective design communication and gathering user feedback.\nParticipated in CI/CD processes to automate deployments, contributing to a **40%** reduction in release cycles.\nConducted user and customer research to inform design iterations, ensuring alignment with user needs and expectations.\nFostered an environment of collaboration and effective communication, encouraging a diverse team atmosphere and driving ownership across projects."
    }
  ],
  "skills": " **Programming Languages**\n\t HTML, CSS, JavaScript, TypeScript, Python\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t AWS, Azure\n\n**Other**\n\t UX/UI Design, Git, GitHub, Redux, Figma, Wireframing, Design System, Component System, Prototyping, Analytics Modeling, Product Specs, Collaboration, Effective Communication, Ownership, Diversity, Customer Research, Problem Solving, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Ashby"
}