{
  "name": "Rei Taro",
  "role_name": "Senior Software Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-oriented Senior Software Engineer with over 10 years of experience in building cutting-edge systems with a strong focus on **TypeScript**, **React**, **C#**, and **.NET** technologies. Proficient in cloud services like **AWS** and **Azure**, and skilled in **CI/CD**, **Terraform**, and **Kubernetes** for efficient deployment and management. Expertise in innovative fields such as digital identity, verifiable credentials, open banking, and AI integrates seamlessly with comprehensive project management, including defining user stories and ensuring effective communication among stakeholders. Proven success in delivering high-quality API designs and automation tools, leveraging frameworks like **FastAPI**, **Django**, and **Flask** to enhance performance and scalability. Demonstrated impact across industries with contributions to leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **C#**, **.NET**, and **Azure** to engineer scalable backend services, enhancing user authentication with digital identity solutions.\nDeveloped client-side applications using **TypeScript** and **React**, implementing user stories to ensure robust frontend functionality.\nLeveraged **CI/CD** practices to streamline deployment processes, enhancing project efficiency by **30%** and reducing downtime by **20%**.\nManaged infrastructure using **Terraform** to provision resources on **AWS** and **Azure**, maintaining a consistent and compliant environment.\nOrchestrated containers using **Kubernetes** to improve microservices management, achieving a **15%** increase in system reliability.\nIntegrated **open banking** standards to facilitate secure financial transactions, adhering to industry regulations and compliance.\nImplemented asynchronous processing solutions with **Celery** and **Redis** to manage event-driven workflows, resulting in a **40%** improvement in processing speed.\nConducted rigorous security assessments and integrated **OAuth2** for managing user identities, ensuring the application met the highest security standards.\nCollaborated with cross-functional teams to effectively tackle system integration challenges and address project requirements through clear communication."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **TypeScript** and **React** to design and develop robust user interfaces, enhancing user experiences and engagement by **30%**.\nImplemented backend services with **C#** and **.NET**, achieving application performance improvements by **25%** and ensuring high reliability in high-intensity environments.\nEngineered and maintained CI/CD pipelines in **Azure** and **AWS**, reducing deployment times by **40%** and increasing deployment frequency.\nLed the migration of applications to cloud native architectures on **Azure App Services** while employing **Terraform** for infrastructure provisioning, ensuring consistency across environments with **98%** uptime.\nDeveloped and optimized serverless solutions using **Azure Functions**, streamlining the processing of requests and enhancing overall system responsiveness.\nSpearheaded the integration of digital identity solutions, leveraging **OAuth2** and **Azure AD B2C** for secure user authentication and enhancing security compliance across applications.\nFacilitated cross-functional team collaboration to gather actionable user stories, actively communicating technical concepts and requirements to ensure project alignment and success."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **TypeScript**, **React**, and **.NET** to develop dynamic front-end applications enhancing user interaction and experience.\nLeveraged **C#** and **Azure** to create scalable backend services, supporting seamless integration across platforms with **AWS** services for cloud-based solutions.\nImplemented CI/CD pipelines to automate deployment processes, ensuring efficient code delivery and compliance with quality standards.\nUtilized **Terraform** for infrastructure as code, enabling consistent environment provisioning across development and production systems.\nMaintained high code quality through regular code reviews and adherence to industry best practices in **Kubernetes** for managing containerized applications.\nDesigned and implemented verifiable credential solutions within the context of open banking, enhancing digital identity management.\nCollaborated with cross-functional teams to gather user stories, effectively communicating needs and driving project alignment to business goals.\nContributed to AI-based projects, optimizing algorithms for data processing using languages like **Rust** and **Go**, resulting in performance improvements of up to **30%**.\nEngaged in continuous learning with emerging technologies and frameworks to ensure the team remains at the forefront of the software engineering landscape."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, TypeScript, C#, Rust, Go, C++\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery, .NET\n\n**Frontend Frameworks**\n\tReact\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices, Kafka\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Terraform\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, digital identity, verifiable credentials, open banking, user stories, communication",
  "apply_company": "Propellerhead"
}