{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I possess a strong proficiency in **Golang**, **SQL**, and **data warehousing**, and have a solid understanding of messaging systems such as **Nats** and **Kafka**. My expertise also extends to building APIs and managing observability metrics using **Prometheus** and **Grafana** within cloud environments like **AWS**. I have a proven track record in implementing agile methodologies and maintaining clean code, while ensuring rigorous testing for robust application development.\n\nMy background includes developing high-performance solutions in the healthcare and financial sectors, utilizing modern **JavaScript/TypeScript**, **Python**, and **Flutter** technologies. I have led enterprise-grade platform development that integrates AI/ML capabilities, enhancing predictive analytics and intelligent automation. Additionally, my experience in microservices architecture, event-driven systems, and CI/CD automation allows me to deliver secure applications compliant with standards such as HIPAA, PCI DSS, and SOC 2. I excel in communication, teamwork, and adaptability, enabling me to thrive in fast-paced environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented messaging systems using **Nats** and **Kafka** for real-time data streaming across distributed applications, enhancing system scalability and performance.\nDeveloped APIs for robust data warehousing solutions integrating **SQL** databases, ensuring efficient data indexing and retrieval for analytics and reporting.\nDesigned enterprise-level observability metrics leveraging **Prometheus** and **Grafana** to monitor application performance and optimize scalability and reliability of services.\nCollaborated in an **agile** environment to deliver high-quality software adhering to **clean code** principles, fostering teamwork and effective communication among cross-functional teams.\nArchitected and developed advanced distributed systems using **Golang** for handling high-throughput workloads, contributing to increased throughput by **30%** in data processing.\nLed the integration of blockchain technologies, focusing on **EVM** compatibility for transaction security and transparency solutions, enabling compliance with **PCI DSS** and **SOX** regulations.\nExecuted comprehensive testing strategies utilizing **Jest**, **Cypress**, and **Postman**, achieving over **95%** test coverage across both front-end and backend services.\nEnsured flexibility and self-motivation in rapidly changing project scopes, contributing to the successful delivery of projects within timelines and enhancing organization efficiency.\nDeveloped data visualization solutions incorporating **D3.js** and **Power BI Embedded**, resulting in real-time insights into operational KPIs and transaction trends for stakeholders.\nEstablished continuous integration and deployment pipelines employing **GitHub Actions** and **Azure DevOps**, enabling faster deployment cycles and improved release management processes."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Golang** to develop and deploy scalable microservices which improved transaction throughput by **25%** over previous systems.\nLeveraged **SQL** for efficient data querying and management, optimizing query execution time by **40%**, enhancing overall data retrieval processes.\nDesigned and maintained **data warehousing** solutions which managed over **10TB** of financial data, improving reporting speed and accuracy.\nImplemented **messaging systems** such as **Kafka** and **Nats** to facilitate real-time communication among microservices, reducing latency in transaction processing by **30%**.\nParticipated in the design and execution of APIs to ensure seamless integration between financial systems, achieving **99.9%** uptime and reliability.\nMonitored system performance using **observability metrics** tools like **Prometheus** and **Grafana**, leading to a **20%** increase in operational efficiencies through proactive issue resolution.\nCollaborated in an **agile** team environment, demonstrating **flexibility** and **effective communication** to drive project goals and foster teamwork across departments.\nMaintained code quality and project organization by adhering to **clean code** principles and implementing rigorous **testing** methodologies.\nActively participated in the integration of blockchain solutions, enhancing security and traceability for financial transactions, thereby strengthening compliance with industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and maintained **APIs** for robust backend services, employing **Golang** and **SQL** to optimize data retrieval and enhance performance across various modules.\n• Designed data warehousing solutions that streamline data indexing and management, improving data access times by up to **25%** for analytics and reporting.\n• Implemented and managed messaging systems with **Nats** and **Kafka**, ensuring reliable communication between microservices and facilitating event-driven architecture for better system responsiveness.\n• Created observability metrics using **Prometheus** and **Grafana**, allowing for real-time monitoring and performance insights, resulting in a **30%** reduction in system downtime through proactive issue resolution.\n• Collaborated in an **agile** environment, participating in sprints to promote fast delivery of features and improvements while ensuring clean code standards and thorough testing practices.\n• Led a small team in developing blockchain-based solutions compliant with **EVM**, which increased transaction security and transparency for users, showcasing innovative approaches to security challenges.\n• Fostered teamwork and flexibility by driving cross-departmental workshops, enhancing communication skills among teams, and establishing a culture of continuous improvement.\n• Self-motivated to undertake independent projects contributing to the development of efficient algorithms, yielding productivity boosts by **15%**.\n• Prioritized organization within the codebase and project management to streamline workflows, improving the overall efficiency of the engineering team.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Golang\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, messaging systems, Nats, Kafka, blockchain, EVM, data warehousing, data indexing, observability metrics, Prometheus, Grafana, agile, clean code, testing, communication, teamwork, flexibility, organization, self-motivated",
  "apply_company": "Consensys"
}