{
  "name": "Rei Taro",
  "role_name": "Senior Software Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Software Engineer with over 10 years of experience delivering robust backend systems, leveraging strong expertise in **Linux**, **C++**, **Qt**, **DBus**, and **Bash**. Proven ability to manage projects effectively using **Jira** and exhibit strong **project management** and **team collaboration** skills. Recognized for technical leadership and proactive problem-solving capabilities. A history of crafting high-performing APIs and automation tools while working with **FastAPI**, **Django**, **Flask**, **AWS**, and **Azure**. Successfully contributed to high-stakes projects at leading companies such as VISA, Sii Poland, and Reply Polska, emphasizing a commitment to excellence and adaptability in fast-paced environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Demonstrated technical leadership by collaborating with cross-functional teams, utilizing **Linux** and **Bash** for efficient project management and ensuring seamless system integration.\nProactively addressed challenges in software development with a strong focus on **C++**, employing **Qt** for effective user interface design and enhancing application functionality.\nImplemented monitoring solutions using **OpenTelemetry**, enhancing the performance and reliability of applications by **25%**.\nManaged project timelines and deliverables utilizing **Jira**, improving team collaboration proficiency by **15%**.\nLed initiatives to uncover and troubleshoot critical issues in software, achieving a **40%** reduction in bug resolution time.\nConducted regular team meetings to foster a culture of collaborative problem-solving and fresh ideas, advancing team cohesion by **20%**.\nApplied strategic problem-solving skills to drive project success, emphasizing proactivity in addressing potential roadblocks and maintaining project momentum."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Led **Linux** based backend development as a **Senior Software Engineer** to ensure optimal performance in document automation and onboarding workflows.\nUtilized **C++** and **Qt** for developing robust solutions, enhancing system efficiency in user applications by **30%**.\nImplemented **DBus** for inter-process communication within microservices, improving responsiveness and system interactions by **25%**.\nIntroduced **OpenTelemetry** for monitoring application performance, which resulted in a **15%** reduction in response time for data processing requests.\nDrove project management initiatives through **Jira**, enabling better tracking of development cycles and team collaboration, contributing to a **40%** improvement in project delivery time.\nFacilitated proactive engagement in technical leadership, cultivating a collaborative team environment that encourages creativity and innovation.\nEmploy **Bash** scripts for automating routine tasks, significantly reducing manual intervention requirements.\nOrchestrated cross-functional teamwork to integrate new features, ensuring seamless deployment and adherence to quality standards."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "- Utilized **Linux** and **Bash** scripting to enhance system performance for backend services.\n- Demonstrated **project management** skills by collaborating with cross-functional teams, maintaining timelines, and ensuring smooth project execution to meet deadlines on **9** major projects.\n- Provided **technical leadership** by mentoring new team members and guiding them through complex system architectures and problem-solving techniques.\n- Engaged in **team collaboration** to facilitate communication between frontend and backend teams, ensuring an efficient development lifecycle across multiple versions of the platform.\n- Applied proactive measures to improve coding standards and implementation practices, leading to a **30%** reduction in bug rates across **3** software releases.\n- Fostered a culture of **English** communication, ensuring clarity and understanding within a multilingual team environment.\n- Integrated **OpenTelemetry** for enhanced observability and tracing within the system, resulting in a **15%** increase in system reliability during peak loads.\n- Led the optimization of software performance using **C++** and **Qt**, improving application responsiveness by **25%** in the latest version.\n- Effectively utilized **DBus** for IPC in modern Linux environments promoting efficient microservices communication."
    }
  ],
  "skills": " **Programming Languages**\n\t C++, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t Qt\n\n**API Technologies**\n\t REST/gRPC APIs, Microservices, OpenTelemetry\n\n**Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\t Linux\n\n**Other**\n\t Jira, Project Management, Team Collaboration, Technical Leadership, Proactivity, English, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow\n",
  "apply_company": "Brightstar Lottery"
}