{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Backend Engineer with 8 years of experience in building scalable solutions using **Go**, **Cassandra**, **Kafka**, and **Kubernetes**. Proficient in cloud environments such as **AWS** and **GCP**, and experienced with containerization technologies like **Docker**. I excel in developing efficient and fault-tolerant distributed systems while leveraging **Envoy Proxy** for microservices communication.\nWith a strong foundation in **React** for front-end integration, I prioritize a product mindset and team collaboration to deliver top-notch software solutions. My adaptability allows me to thrive in dynamic settings, continuously learning and applying new technologies. I have a proven track record in designing and deploying secure and compliant applications, with an emphasis on maintaining high-performance standards across healthcare and financial sectors.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable, distributed backend systems using **Go**, ensuring robust performance and reliability across microservices architectures.\nImplemented and managed **Cassandra** databases for high-volume data ingestion and real-time analytics, optimizing query performance for demanding applications.\nUtilized **Kafka** for building event-driven architectures, enabling seamless data streaming and real-time processing across various services and components.\nDeployed and orchestrated containerized applications using **Kubernetes** and **Docker**, ensuring high availability, scalability, and efficient resource management in cloud environments.\nCollaborated effectively in cross-functional teams, leveraging strong team collaboration skills to drive project success and meet product deliverables in a fast-paced environment.\nAdopted a product mindset to deliver features that enhance user experiences and maintain high standards of software quality and performance.\nEnsured adaptability to new technologies and frameworks, continuously integrating best practices into the development process, especially in **React** for front-end deployments.\nAchieved a 30% reduction in deployment times by utilizing CI/CD practices and the **Envoy Proxy** for service mesh implementations.\nLed initiatives that improved the performance of distributed systems by implementing advanced monitoring and logging solutions leveraging cloud services like **AWS** and **GCP**.\nConducted performance optimizations in the backend, improving response times by **15%** on average across various APIs using strongly-typed languages to prevent errors and increase maintainability.\nEstablished successful strategies for maintaining system uptime and operational reliability, contributing to a **99.9%** service level agreement (SLA) success rate.\nDesigned scalable APIs and integrated third-party services using RESTful principles, enhancing system interoperability and feature extensibility."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented and deployed robust **distributed systems** leveraging **Go** and **Cassandra** to ensure high availability and fault tolerance in data storage and processing for backend services.\nDesigned and orchestrated containerized applications using **Docker** and **Kubernetes**, achieving a seamless CI/CD pipeline that facilitated deployment cycles reduced by **30%**.\nAdopted an event-driven architecture by integrating **Kafka** to optimize data flow and processing, supporting real-time analytics and enhancing system responsiveness for transactional workloads.\nCollaborated with cross-functional teams to define backend functionality and requirements, driving a **product mindset** and ensuring alignment between technical and business goals, resulting in **25%** faster feature delivery.\nDeveloped microservices with a focus on **strongly-typed languages**, enabling safer coding practices and reducing runtime errors for critical financial applications.\nFostered a culture of **team collaboration** and **adaptability** by mentoring junior engineers and conducting code reviews to uphold high coding standards and best practices in software development.\nLeveraged cloud services like **AWS** and **GCP** to enhance application deployment and scalability, successfully managing resource usage and reducing operational costs by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services for a global e-commerce platform using **Go** and **Cassandra**, ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\nEngineered real-time features using **Kafka** and event-driven architecture, enabling responsive order updates, dynamic inventory tracking, and real-time customer support.\nDeveloped frontend applications using **React (18)**, enhanced with **TypeScript** and **Redux Toolkit**, delivering fast, responsive user experiences on both web and mobile platforms.\nLeveraged **AWS** and **GCP** for distributed data storage and computing, ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows and caching frequently accessed resources for performance gains.\nIntegrated AI/ML-based recommendation engines using **scikit-learn**, **LightGBM**, and **TensorFlow**, optimizing search relevance and improving conversion rates based on real-time behavioral data.\nImplemented **Kubernetes** for container orchestration and **Docker** for application deployment, enabling efficient scaling and management of backend services.\nCreated responsive, SEO-friendly e-commerce UIs optimized for mobile-first engagement and accessibility compliance (WCAG 2.1).\nBuilt secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, applying tokenized transactions and PCI-compliant handling of sensitive data.\nApplied role-based access control (RBAC) and **OAuth 2.0** for secure customer and admin access, ensuring GDPR compliance and user data protection throughout the platform.\nDemonstrated strong collaboration and adaptability within a cross-functional team, focusing on delivering features with a product mindset while adhering to deadlines and quality metrics."
    }
  ],
  "skills": " **Programming Languages:**\n\tGo, Python(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular), strongly-typed languages\n\n**Backend Frameworks:**\n\tFlask, Django, FastAPI\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tEnvoy Proxy\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Cassandra\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, distributed systems, product mindset, team collaboration, adaptability, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n"
}