{
  "name": "Tomasz Lee",
  "role_name": "QA Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented QA Engineer with 9+ years of experience in manual and automated testing for web and mobile applications. Proficient in **Playwright**, **Selenium**, and test case management tools like **Qase** and **TestRail**. Exceptional skills in accessibility testing, issue tracking with **Jira**, and utilizing **Agile methodology** to enhance testing processes. Committed to delivering high-quality software through meticulous web application and mobile application testing. Strong communication skills and a collaborative mindset enable effective teamwork and project success. Dedicated to continuous learning and improvement in QA practices.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conduct comprehensive **manual QA testing** on web and mobile applications to ensure functionality and accessibility standards are met.\nUtilize **Playwright** and **Selenium** for **automation testing**, effectively reducing testing time by **30%**.\nDevelop and manage detailed test cases in **Qase** and **TestRail**, successfully leading to a **20%** increase in test coverage.\nEmploy **issue tracking tools** like **Jira** to document and track bugs, facilitating a smooth workflow within the **Agile methodology** framework.\nExecute **accessibility testing** to enhance user experience across diverse platforms, achieving compliance levels of **95%**.\nCollaborate with development teams in troubleshooting issues and ensuring clear communication, fostering a culture of continuous learning and improvement.\nParticipate in sprint planning and review sessions, contributing to the iterative enhancement of testing protocols and processes.\nImplement best practices in **test case management**, ensuring all testing activities align with project goals and deadlines.\n\nDemonstrated strong communication skills while supporting team collaboration and enhancing overall project efficiency."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Conducted **manual QA testing** for web and mobile applications, ensuring high-quality standards were met and increasing defect detection by **20%**.\nUtilized **Selenium** and **Playwright** for **automation testing**, reducing regression testing time by **35%** and enhancing release cycle efficiency.\nManaged **test case management** using **Qase** and **TestRail**, streamlining the QA process and improving traceability of testing efforts.\nCollaborated with cross-functional teams in an **Agile** environment, fostering **team collaboration** and improving product delivery timelines by **15%**.\nPerformed **accessibility testing** to ensure application compliance with WCAG standards, enhancing user experience for individuals with disabilities.\nLeveraged **Jira** for **issue tracking**, effectively communicating bugs and enhancements to development teams, leading to a **40%** reduction in critical post-release issues.\nParticipated in continuous learning initiatives to stay updated with the latest QA methodologies and tools, contributing to the overall knowledge of the QA team.\nConducted thorough code reviews and training sessions with junior QA testers, improving overall team performance and communication skills across the board."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Executed manual QA testing for web and mobile applications, ensuring compliance with accessibility standards, thus enhancing user satisfaction by **15%**.\nDeveloped and executed comprehensive test cases using **Playwright** and **Selenium**, increasing bug detection rate by **30%** prior to production.\nUtilized Qase and TestRail for effective test case management and documentation, improving tracking accuracy and reporting efficiency.\nParticipated in Agile methodology practices, contributing to daily standups and retrospectives, strengthening team collaboration.\nEngaged in continuous learning to stay updated with the latest QA techniques, enhancing overall testing strategies within the team.\nPerformed rigorous testing on web applications, identifying and reporting issues through **Jira**, leading to quicker resolution times.\nCollaborated closely with development teams to ensure an agile feedback loop, which led to a **25%** reduction in defect rework instances.\nConducted thorough accessibility testing to assure compliance with WCAG standards, fostering inclusivity in the applications.\nDocumented testing results and provided detailed reports to stakeholders, significantly improving communication and transparency amongst teams."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tNone specified\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tAWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure:**\n\tNone specified\n\n**Other:**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, manual QA testing, web applications testing, mobile applications testing, accessibility testing, Playwright, test case management, issue tracking tools, Qase, TestRail, Jira, Agile methodology, automation testing, strong communication skills, continuous learning, team collaboration"
}