{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in backend development and cloud platforms, utilizing **GoLang**, **Python**, and **PostgreSQL**. Proven skills in designing and implementing **distributed systems** and optimizing performance through effective **debugging** and **performance-tuning**. Adept in deploying applications on **AWS**, **GCP**, and **Azure**, and experienced in implementing **CI/CD** processes using **GitLab CI** and **ArgoCD**.\nWell-versed in modern architectures including **microservices**, **REST**, and **gRPC**, with hands-on knowledge in monitoring and logging tools like **Prometheus**, **Grafana**, **Loki**, and **Tempo**. Strong problem-solving mindset complemented by effective English communication skills. Previous experience in building AI/ML-powered platforms and a deep understanding of compliance-driven development practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **GoLang** and **Python** for backend development of distributed systems, ensuring robust performance and scalability across cloud platforms like **AWS**, **GCP**, and **Azure**.\nImplemented **Kubernetes** for orchestrating containerized applications, enhancing deployment speeds by **30%** and improving system reliability with **99.9%** uptime.\nDeveloped and maintained CI/CD pipelines using **GitLab CI** and **ArgoCD**, enabling automated deployment workflows that reduced time-to-market by **25%**.\nEnhanced database performance and reliability utilizing **PostgreSQL**, optimizing queries and setting up **Cloud Object Storage** for efficient data management.\nArchitected APIs with **gRPC** and **REST** to facilitate seamless integration between microservices, improving interoperability and system scalability in a distributed environment.\nLeveraged **Prometheus**, **Grafana**, and **Loki** for monitoring and observability, ensuring high-performance tuning and proactive debugging of live applications.\nEmployed problem-solving mindset for system optimization, debugging, and performance-tuning, effectively reducing latency by **15%** across various services.\nCollaborated with cross-functional teams utilizing strong English skills to communicate technical requirements and drive successful project outcomes.\nFocused on distributed systems strategy to foster a culture of continuous improvement within the cloud-native architecture, aligning with best practices and industry standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **GoLang** for backend development, optimizing performance in cloud-native environments and contributing to distributed systems.\nImplemented microservices architecture and container orchestration using **Kubernetes**, ensuring high availability and scalability of services across **AWS** and **GCP** cloud platforms.\nDesigned and maintained robust database solutions using **PostgreSQL** and **Cloud Object Storage** for efficient data management, driving a 30% increase in data retrieval speeds.\nEstablished CI/CD pipelines using **GitLab CI** and **ArgoCD**, streamlining deployments and reducing release times by 40%.\nDeveloped RESTful APIs and gRPC services for seamless communication between microservices, leveraging protocols to enhance performance in critical financial operations.\nIntegrated monitoring and observability tools such as **Prometheus**, **Grafana**, **Loki**, and **Tempo** to proactively identify and resolve issues, maintaining system reliability.\nOptimized existing applications and backend systems through performance-tuning and debugging, achieving a 25% reduction in load times for major features.\nEmployed a problem-solving mindset to troubleshoot complex technical challenges and deliver innovative solutions to financial applications.\nCommunicated effectively in English to collaborate with cross-functional teams and articulate technical concepts clearly."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Designed and optimized backend services for a global e-commerce platform using **GoLang** and **Python** (FastAPI, Django), ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\n• Implemented CI/CD pipelines with **GitLab CI** and **ArgoCD**, providing a streamlined development process leading to faster deployments (achieved a **30%** reduction in deployment time).\n• Engineered real-time features using **GCP Pub/Sub**, **Kafka**, and **RabbitMQ**, enabling responsive order updates, dynamic inventory tracking, and real-time customer support.\n• Developed distributed systems employing **PostgreSQL** and **Cloud Object Storage**, ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows and achieving a **99.9%** uptime.\n• Integrated performance-tuning practices in backend services, resulting in a **40%** improvement in response times across critical API endpoints.\n• Created responsive, SEO-friendly e-commerce UIs using **Next.js** and **HTML5/CSS3**, optimized for mobile-first engagement and accessibility compliance (WCAG 2.1).\n• Built secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, applying tokenized transactions and PCI-compliant handling of sensitive data.\n• Applied role-based access control (RBAC) and **OAuth 2.0** for secure customer and admin access, ensuring GDPR compliance and user data protection throughout the platform.\n• Leveraged **Kubernetes** for orchestration and management of containerized applications in a cloud environment, enhancing reliability and scalability.\n• Monitored application performance using **Prometheus**, **Grafana**, and **Loki**, ensuring continuous optimization and efficient debugging capabilities."
    }
  ],
  "skills": "Programming Languages:\n\tGoLang, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tgRPC, REST\n\n**Serverless and Cloud Functions:**\n\tAWS, GCP, Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, ArgoCD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Cloud Object Storage, GCP Pub/Sub\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Prometheus, Grafana, Loki, Tempo, debugging, optimization, performance-tuning, distributed systems, backend development, CI/CD, problem-solving mindset, strong English skills"
}