{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Cloud Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Cloud Engineer with 10+ years of experience in delivering high-performance software solutions, particularly in cloud environments. Proficient in **Linux**, **Cloud** services including **Azure** and **AWS**, and well-versed in **CI/CD** processes and **Automation** strategies, ensuring efficient deployment and management of applications. Demonstrated expertise in **Scripting** and **Monitoring** systems to enhance operational efficiency and reliability. Experienced in **Virtualization** and **Networking**, facilitating secure and scalable environments for enterprise solutions. \n\nSkilled in modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**, with comprehensive knowledge in the full stack including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Leveraged microservices architecture and event-driven systems to develop maintainable solutions compliant with standards like HIPAA, FHIR, PCI DSS, and SOC 2. \n\nBrings practical experience in MLOps—from developing ML pipelines to managing production workflows utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**. Passionate about building systems that are not only technically proficient but also drive real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tLeveraged **Linux** and **Cloud** technologies to design and implement highly available and scalable solutions, enhancing system performance and reliability in dynamic environments.\n•\tAutomated deployment pipelines utilizing **CI/CD** practices, integrating tools like GitHub Actions and Azure DevOps to streamline release processes and minimize downtime.\n•\tDeveloped monitoring systems to ensure optimal performance across cloud infrastructures, employing strategies that reduced incident response times by up to **30%**.\n•\tImplemented virtualization solutions that improved resource allocation and reduced costs by **25%** through efficient usage of cloud resources.\n•\tEngaged in scripting for automating routine tasks and processes, significantly reducing manual intervention through the use of **Bash**, **Python**, and **PowerShell** scripting.\n•\tEnhanced collaboration across multiple teams to optimize DevOps practices and encourage a culture of continuous improvement in deployment strategies.\n•\tManaged cloud-native applications with tools like **Docker** and orchestrated services using **Kubernetes** for improved scalability and fault tolerance.\n•\tExecuted robust networking solutions to facilitate secure and efficient data transfer across platforms, adhering to industry regulations and best practices.\n•\tOversaw the establishment of comprehensive test strategies and automated testing frameworks, achieving a **40%** reduction in bugs during deployment.\n•\tUtilized **Monitoring** tools and dashboards to provide insights into system health and performance metrics, enabling proactive troubleshooting and system enhancements."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Executed cloud solutions by leveraging **Linux** environments to enhance system reliability and operational efficiency.\nDesigned and implemented CI/CD pipelines utilizing **Automation** tools, optimizing deployment processes and minimizing downtime by **30%**.\nDeveloped and maintained monitoring systems to ensure high availability and performance of applications, employing **Cloud** technologies for scalable resources.\nStreamlined virtualization processes to enhance resource utilization, enabling rapid scaling of services by **40%** under heavy traffic conditions.\nCollaborated effectively with cross-functional teams to drive meaningful improvements in system performance and resilience, using **DevOps** practices to facilitate smoother workflows.\nAutomated routine tasks and scripts to improve operational efficiency, reducing manual intervention and errors in production environments.\nUtilized **Networking** concepts to enhance secure communications within cloud environments, achieving compliance with internal and external security standards.\nEngaged in continuous learning and collaboration to adopt emerging technologies and methodologies in **Cloud** architecture and **DevOps** strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented **CI/CD** pipelines to automate deployment processes and improve release cycles, resulting in a **30% increase** in deployment speed.\nDesigned and maintained cloud infrastructure using **Linux** and **Virtualization** technologies to support application scalability and reliability in a high-traffic environment.\nAutomated system monitoring and alerting processes to ensure high uptime and performance metrics are met, achieving a **99.9%** service availability rate.\nCollaborated across teams to optimize cloud resource utilization through efficient **scripting** and **automation** strategies, leading to a **20% reduction** in costs.\nManaged and maintained **Cloud** environments, focusing on **Networking** and **Automation** for seamless application integration and operation.\nLed the development of monitoring solutions that provide insights into application performance, directly contributing to reduced downtime and improved customer experience.\nFacilitated cross-functional collaboration sessions to streamline workflows and ensure continuous improvement in **DevOps** practices.\nSupported the creation and maintenance of documentation related to system architecture and processes, enhancing team growth and knowledge sharing."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Linux, Automation, Scripting, Monitoring, Virtualization, Networking, Collaboration",
  "apply_company": "SMART Technologies"
}