{
  "name": "Mariusz Jan Skobel",
  "role_name": "System Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-118083397/",
  "profile_summary": "System Engineer with 10+ years of experience in network technologies and cloud services, proficient in **Microsoft Teams**, **Skype for Business**, **Direct Routing**, **Trunking**, **Anynode**, and **Office 365**. Skilled in deploying and managing environments on **Linux** distributions such as **Debian** and **Ubuntu**, with a strong service orientation and teamwork abilities. Excellent communication skills in both German and English, facilitating collaboration across diverse teams. Previously, I delivered high-performance software solutions in healthcare and finance using modern technologies like **JavaScript/TypeScript**, **Python**, and **Flutter**. Experienced in full stack development with frameworks such as **React**, **Next.js**, **Vue**, and **Node.js**, alongside backend services with **FastAPI** and **Django**. Adept at building cloud-native applications on **Azure** and **AWS**, emphasizing secure, maintainable solutions that adhere to compliance standards such as HIPAA, FHIR, and PCI DSS. Passionate about leveraging technology to drive real-world impact and enhance system performance.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "System Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tImplemented effective service orientation strategies to enhance system reliability and user satisfaction by leveraging **Microsoft Teams** and **Skype for Business** functionalities.\n•\tManaged direct routing and trunking configurations with **Anynode**, ensuring seamless communication across platforms.\n•\tAdministered and optimized **Office 365** services on both **Debian** and **Ubuntu** systems, increasing operational efficiency by **30%**.\n•\tCollaborated in a team-oriented environment, demonstrating strong teamwork and communication skills in both **German** and **English**, facilitating successful project deliveries.\n•\tUtilized Linux environment to streamline server management tasks, improving processing times by **20%** across system operations.\n•\tImplemented network technologies enhancements, performing maintenance and troubleshooting to reduce downtime incidents by **40%**.\n•\tFacilitated cross-functional team meetings utilizing **Microsoft Teams**, which led to a **15%** uptick in project communication effectiveness.\n•\tDeveloped and maintained system documentation in accordance with service orientation principles, resulting in improved onboarding time for new team members by **25%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Leveraged **Microsoft Teams** and **Skype for Business** to enhance communication and collaboration within teams, improving response time by **30%**.\nConfigured and managed **Direct Routing** and **SBC** (Session Border Controller) for seamless integration of telephony services, ensuring **99.9%** uptime and reliability.\nImplemented **trunking** solutions for efficient call routing and management, resulting in a **20%** reduction in telephony costs.\nUtilized **Office 365** tools to streamline workflows and document sharing, increasing team efficiency and productivity.\nProvided technical support and problem resolution with Linux environments (**Debian** and **Ubuntu**), enhancing system performance and stability for internal applications.\nApplied **Network Technologies** principles to optimize network architecture and ensure robust service orientation across departments.\nCultivated teamwork and service orientation within cross-functional groups, leading to an **increased project completion rate of 25%**.\nDemonstrated strong communication skills in both **German** and **English**, facilitating effective interactions with international clients and stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Managed communication systems and network technologies, ensuring effective integration of **Microsoft Teams** and **Skype for Business** with a focus on **Direct Routing**, resulting in a streamlined communication for over **1000** users.\nConfigured and optimized **Session Border Controllers (SBC)** and implemented **trunking** solutions using **Anynode** to enhance call quality and reduce latency for external communication channels.\nAdministered **Office 365** services on **Linux** environments, including **Debian** and **Ubuntu**, ensuring high availability and security for collaborative tools used by team members.\nFostered team collaboration and seamless communication by providing support across multilingual environments, leveraging proficiency in **German** and **English** to resolve issues and conduct training sessions for staff members.\nLed service orientation initiatives, conducting over **20** network assessments to identify improvements that enhance system performance and reliability within the organization.\nCollaborated with cross-functional teams to implement best practices in communication workflows, promoting effective **teamwork** and ensuring consistent application of security policies across all platforms."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n  **Backend Frameworks:**\n\t\n\n  **Frontend Frameworks:**\n\t\n\n  **API Technologies:**\n\t\n\n  **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\t\n\n  **Other:**\n\tMicrosoft Teams, Direct Routing, Skype for Business, SBC, Trunking, Anynode, Office 365, Linux, Debian, Ubuntu, Network Technologies, Service Orientation, Teamwork, Communication Skills, German, English, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow"
}