{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Engineering Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "With 8 years of experience as a Full Stack Developer, I excel in delivering high-performance solutions utilizing **Angular**, **PHP**, **MySQL**, and **Symfony**. My strong foundation in **Agile** methodologies supports effective project management and team collaboration in remote settings. I am adept at creating data-driven applications that meet business goals, accounting for compliance needs and best practices. Beyond technical skills, I have a proven track record in product management, effective communication, team management, and coaching, ensuring that all team members contribute effectively to project success. My comprehensive background also includes full-stack development with **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside experience with various frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have extensive cloud experience with **Azure** and **AWS**, having led the development of enterprise-grade platforms that seamlessly integrate AI/ML capabilities for predictive analytics and real-time data processing. I am well-versed in microservices architecture, event-driven systems, and CI/CD automation, further enhancing the robustness and security of applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineering Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Led Agile team efforts in the successful design and architecture of online platforms, utilizing **Angular** and **PHP** along with **MySQL** and **Symfony** to meet evolving user requirements and enhance functionality.\n- Fostered a collaborative and data-driven environment, ensuring a clear communication channel among teams and actively participating in product management activities to align with project goals.\n- Implemented coaching techniques within the team to improve skills in **data management** and **software development**, enhancing productivity by **20%**.\n- Drove the adoption of **Agile methodologies** to streamline workflows, resulting in a **30%** increase in project delivery speed.\n- Conducted regular team management sessions, providing feedback and support to enhance team performance and engagement while promoting a culture of remote work.\n- Oversaw the code quality and deployment processes, integrating **best practices** and ensuring adherence to standards for developing and operating applications across various environments.\n- Engaged in cross-functional collaboration with stakeholders to ensure product features are effectively aligned with user needs and market demands, leading to an improved customer satisfaction score of **15%**.\n- Spearheaded the analysis of project requirements to implement effective solutions using modern frameworks, achieving project milestones within **10%** of projected timelines.\n- Cultivated a culture of continuous improvement through peer reviews and feedback, enhancing team capabilities and product quality across various deployments."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Angular** and **PHP** frameworks to develop scalable and maintainable applications, ensuring seamless integration with **MySQL** database systems while enhancing code quality and performance in line with Agile methodologies.\nEmployed data-driven decision-making strategies to optimize feature development, leading to a 30% increase in team productivity and improved project delivery timelines by 15%.\nCoached and mentored engineering teams in best practices for software development, fostering a culture of continuous improvement and enhancing team collaboration in remote work environments.\nExecuted product management duties by prioritizing backlogs and aligning development efforts with business objectives, ensuring that critical features were delivered on time and to specification.\nFacilitated effective communication across cross-functional teams to streamline development processes and encourage innovative solutions, resulting in a 20% reduction in critical bugs post-release.\nOversaw Agile ceremonies, including sprint planning and retrospective meetings, to drive accountability and adapt team strategies to meet evolving project needs.\nSpearheaded initiatives to enhance team skills through knowledge-sharing sessions, resulting in a 25% increase in skill proficiency within the team over a **6-month** period."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Spearheaded product management initiatives for engineering projects, focusing on Agile methodologies to drive team efficiency and adaptability in a **PHP** and **MySQL** environment.\n• Fostered communication within cross-functional teams, ensuring seamless collaboration while overseeing project milestones and objectives aligned with business goals.\n• Championed data-driven decision-making by implementing advanced analytics frameworks, enhancing product features based on user feedback and usage patterns, using tools such as **Angular** and **Symfony**.\n• Conducted regular coaching sessions to elevate team performance and skill proficiency, particularly in areas related to backend and frontend development.\n• Facilitated remote work strategies that improved productivity by **30%**, ensuring team members maintained quality output regardless of location.\n• Managed project timelines effectively, ensuring **100%** on-time delivery for critical updates and new feature rollouts\n• Engaged in team management activities to foster a culture of accountability and innovation within the engineering team, directly contributing to a **25%** increase in team velocity.\n• Collaborated on product feature life cycles, from conceptualization to deployment, ensuring responsiveness to market needs and stakeholder feedback."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, PHP\n\n **Frontend Frameworks:**\n\tAngular, React, Vue\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Symfony\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Agile, Data-Driven, Product Management, Communication, Team Management, Coaching, Remote Work",
  "apply_company": "Click&Boat"
}