{
  "name": "DANIEL HE",
  "role_name": "Android Developer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Results-driven Android Developer with 9 years of experience in creating robust and user-friendly applications using **Kotlin**, **Jetpack Compose**, and **Kotlin Coroutines**. Skilled in employing **Agile Methodology** to enhance project delivery and integrating **Continuous Integration** practices for improved efficiency. Adept at implementing **Automated Testing**, **Unit Testing**, and **Integration Testing** to ensure high-quality software. Proficient in utilizing tools such as **Jira**, **Git**, and **Confluence** to optimize team collaboration and project management. Strong foundational knowledge in **Java** and proven success in developing scalable solutions across industries, including healthcare, eCommerce, and finance, through a commitment to clean and efficient coding standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Android Developer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Kotlin** and **Android Development** to create robust mobile applications with a focus on performance and user experience.\nImplemented **Jetpack Compose** for UI development, enhancing application responsiveness and reducing development time by 25%.\nCollaborated in Agile Methodology environments, leading to a 30% increase in project delivery speed and efficiency.\nConducted rigorous **Unit Testing** and **Integration Testing**, improving code reliability by 40% and ensuring optimal performance.\nDesigned CI/CD pipelines through **Git** and **Jira**, streamlining the development process and decreasing deployment times by 50%.\nLeveraged **Kotlin Coroutines** for asynchronous programming, resulting in a 20% enhancement in app responsiveness.\nEnsured digital accessibility standards were met, improving user engagement metrics by 15%.\nFacilitated team collaboration utilizing **Confluence**, allowing for more effective documentation and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Developed mobile applications using **Kotlin** and **Jetpack Compose**, ensuring high-quality user interfaces and experiences aligned with Android standards.\nImplemented **Kotlin Coroutines** for asynchronous programming, enhancing application performance and responsiveness by up to **30%**.\nApplied **Automated Testing** strategies including **Unit Testing** and **Integration Testing**, achieving a **95%** code coverage that improved software reliability.\nUtilized **Continuous Integration** tools like **Jira** and **Git** for efficient project management and version control, facilitating a faster development cycle.\nParticipated in **Agile Methodology** practices, contributing to sprint planning and reviews to ensure alignment with project goals and user needs.\nCollaborated on documentation strategies using **Confluence**, enhancing team communication and project clarity by a **40%** increase in accessibility for all stakeholders."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Developed efficient Android applications using **Kotlin** and **Jetpack Compose**, enhancing user experience and accessibility by 25%.\nUtilized **Kotlin Coroutines** for asynchronous programming, resulting in a 50% improvement in app responsiveness.\nImplemented **Automated Testing** strategies including Unit Testing and Integration Testing, reducing bugs by 30% and ensuring code quality.\nParticipated in Agile Methodology for project management, completing 9 sprints in 6 months with a team of 5 developers.\nIntegrated tools like **Jira**, **Git**, and **Confluence** for improved collaboration and project tracking within the development cycle.\nFostered a culture of Continuous Integration and DevOps practices, speeding up deployment cycles by 40%.   "
    }
  ],
  "skills": "Programming Languages: Kotlin, Java, JavaScript, Go, Python, SQL, Swift\n\n\tBackend Frameworks: Spring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n\tFrontend Frameworks: React, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest\n\n\tAPI Technologies: RESTful API design\n\n\tServerless and Cloud Functions: AWS Lambda, API Gateway\n\n\tDatabases: MySQL, PostgreSQL, Redis, MongoDB\n\n\tDevOps: Docker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline, Continuous Integration, Automated Testing, Unit Testing, Integration Testing\n\n\tCloud & Infrastructure: AWS (EKS, RDS, CloudFront, S3), CloudWatch, ELK Stack\n\n\tOther: Microservices, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies, Digital Accessibility, Jira, Git, Confluence, Agile Methodology"
}