{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior PowerBI Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Experienced **Senior PowerBI Engineer** with 10+ years in developing data-driven solutions, specializing in **data management**, **data transformation**, and **report development**. Proficient in ensuring data quality and adherence to **Microsoft best practices**, while implementing robust **data modeling** strategies to enhance insights for stakeholders. Skilled in managing **user permissions** and web accessibility features to ensure inclusivity in reporting environments. Demonstrated ability in creating technical documentation to support project continuity and collaboration. Additionally, leveraged strong development background in **JavaScript/TypeScript**, **Python**, and **Flutter**, with extensive experience in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven track record of building cloud-native applications on **Azure** and **AWS**, integrating advanced **AI/ML** capabilities for real-time analytics. Committed to delivering high-performance, secure, and maintainable software solutions that comply with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2, while fostering team collaboration through tools like **MS Teams**.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior PowerBI Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed engaging and interactive Power BI reports and dashboards to visualize complex financial data, leveraging **Power BI** for comprehensive report development and data visualization.\n• Managed data transformation and data modeling processes to ensure high-quality, accurate data for analysis, adhering to **Microsoft best practices** in data management.\n• Implemented web accessibility standards within reporting solutions to ensure compliance and inclusivity for all users, enhancing user permissions and experience.\n• Collaborated with cross-functional teams through **MS Teams**, facilitating effective communication and project management throughout the report development lifecycle.\n• Established data quality metrics and conducted comprehensive assessments to maintain integrity and reliability of datasets utilized in reporting.\n• Documented technical processes and best practices for reporting solutions, ensuring clarity and consistency in project documentation for future reference.\n• Conducted training sessions for stakeholders on how to interpret and utilize Power BI dashboards effectively, resulting in a **30%** increase in report usage across departments.\n• Participated in regular audits of data management practices, improving data quality by **25%** through targeted interventions and proactive reporting.\n• Enhanced reporting capabilities by integrating advanced data transformation tools to streamline workflow, reducing report generation time by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and enhanced data reporting solutions leveraging **Power BI** to provide insights into financial platforms, ensuring adherence to **Microsoft best practices** for report development and data management.\nExecuted data transformation processes, maintaining high **data quality** and effective **data modeling**, resulting in a **30%** improvement in report accuracy and timeliness.\nCollaborated on web accessibility initiatives, ensuring user permissions were effectively managed to meet compliance standards across all financial applications.\nMaintained technical documentation for all data processes and reporting workflows, facilitating knowledge transfer and onboarding for new team members, achieving a **50%** reduction in training time.\nFacilitated seamless communication and collaboration utilizing **MS Teams**, enhancing team productivity by **25%** through streamlined project updates and discussions on report development.\nImplemented comprehensive data management strategies, transforming complex datasets into actionable insights through meticulous report development, achieving an increase of **20%** in stakeholder satisfaction.\nConducted workshops on data visualization best practices, empowering product teams to create accessible and engaging reports, fostering a user-centric approach to data presentation."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and managed **PowerBI** reports, ensuring data quality and accuracy through effective **data transformation** and modeling techniques, in alignment with Microsoft best practices.\n• Ensured web accessibility (WCAG 2.1 compliance) of data visualizations and reports to support inclusive user experiences.\n• Collaborated with stakeholders through **MS Teams** for thorough **data management**, demonstrating strong communication and teamwork skills to gather report requirements and validate deliverables.\n• Spearheaded the implementation of **user permissions** protocols to secure sensitive data and enhance role-based access control for users, ensuring robust governance over report accessibility.\n• Created comprehensive technical documentation to guide internal processes and empower users to leverage **PowerBI** effectively, enhancing overall productivity by **20%**.\n• Led the **data quality** initiatives by applying rigorous evaluation metrics, contributing to a **30%** reduction in data inconsistencies across reports.\n• Oversaw the deployment of custom dashboards which improved decision-making speed for executive leadership by **40%**, supporting strategic initiatives.\n• Conducted regular training sessions for team members on optimizing **PowerBI** functionalities, resulting in a **25%** increase in report utilization across departments."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular),\n\n**Backend Frameworks:**\n\tDjango, FastAPI, Flask,\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular,\n\n**API Technologies:**\n\tNginx, JWT, OAuth2, Keycloak (OIDC, RBAC),\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL),\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis,\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose,\n\n**Cloud & Infrastructure:**\n\tAWS, Azure,\n\n**Other:**\n\tPowerBI, data management, data transformation, Microsoft best practice, report development, web accessibility, user permissions, data modeling, data quality, technical documentation, MS Teams",
  "apply_company": "eir evo talent"
}