{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Software Engineer with 8 years of experience, I excel in **Node.js**, **TypeScript**, and **AWS**, leveraging my expertise in crafting high-performance applications in the healthcare and financial sectors. My technical proficiency includes building scalable solutions using **DynamoDB** and implementing **event-driven systems**, ensuring seamless operations and integrations. I am well-versed in Agile methodologies, fostering collaboration and communication within teams to drive project success.\n\nIn addition to my full-stack development capabilities, I specialize in microservices architecture and CI/CD automation, developing robust applications compliant with industry standards such as HIPAA and PCI DSS. I possess strong hands-on experience in creating machine learning pipelines and MLOps workflows with tools like **MLflow**, Airflow, and Kubeflow. My curiosity and problem-solving mindset drive me to explore innovative ways to enhance business processes and deliver high-quality software solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed scalable, event-driven systems leveraging **Node.js** and **TypeScript** to enhance platform efficiency and performance.\nUtilized **AWS** services and **DynamoDB** for infrastructure management and data storage, ensuring seamless access and integration across platforms.\nCollaborated in an Agile environment to deliver robust software solutions, fostering a culture of collaboration and effective communication among cross-functional teams.\nArchitected and deployed full-stack applications, ensuring high availability in logistics operations through cloud-native design and infrastructure as code practices.\nImplemented automated testing and CI/CD pipelines to streamline the development process, incorporating technologies such as GitHub Actions and AWS services.\nDrove integration with third-party services to enhance functionality and user experience, focusing on maintaining high communication standards with stakeholders.\nExemplified curiosity by continuously exploring new technologies and tools to improve software delivery in logistics and technology integration projects.\nMentored junior developers, sharing insights into event-driven architectures and scalable solutions, while encouraging a collaborative and communicative team environment."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** (NestJS/Express) and **TypeScript** to lead the modernization of financial platforms, implementing a microservices-based architecture that increased scalability and maintainability for high-volume transaction systems by over **30%**.\nEmployed **AWS** for cloud solutions and orchestrated event-driven systems using **Kafka**, **RabbitMQ**, and **Azure Service Bus** to enhance communication and real-time event processing, streamlining compliance workflows by **25%**.\nFostered collaboration and integration by working closely with cross-functional teams in an **Agile** environment, ensuring alignment on project goals and timely delivery of software solutions.\nDeveloped dynamic front-end applications utilizing frameworks such as **React** (18), **Vue 3**, and **Next.js** with **TypeScript**, incorporating **Redux Toolkit** and **Tailwind CSS** to enhance user experience on financial dashboards, reaching user satisfaction metrics of over **90%**.\nDesigned and built real-time transaction monitoring dashboards using **D3.js** and **Power BI Embedded**, enabling operations teams to detect anomalies efficiently and generate actionable insights with a response time reduction of **40%**.\nCreated and managed ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, facilitating batch and real-time data ingestion from financial sources, which improved data processing efficiency by **20%**.\nImplemented AI/ML-powered fraud detection using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, analyzing transaction patterns to proactively flag over **99%** of suspicious activities in banking systems.\nEstablished machine learning pipelines for tasks such as credit scoring and churn prediction with **MLflow** and **Airflow**, ensuring real-time decision-making capabilities by integrating model inference directly into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Engineered backend services using **Node.js** and **TypeScript**, ensuring high availability and scalability across e-commerce modules, including checkout and order fulfillment.\n• Developed event-driven systems leveraging **AWS** and integrating **DynamoDB** for real-time customer updates and inventory tracking, enhancing user engagement by over **30%**.\n• Collaborated in an Agile environment to optimize workflows, unifying teams and improving project delivery timelines by **25%** through effective communication and integration strategies.\n• Designed and implemented secure data storage solutions for high-traffic applications, ensuring fault tolerance and quick access using **DynamoDB** and **AWS**.\n• Contributed to successful logistics integrations that streamlined processes and improved operational efficiency.\n• Engaged in infrastructure as code practices utilizing tools like Terraform, reducing deployment times by over **40%**.\n• Fostered a culture of curiosity and exploration within the team, encouraging innovation and new ideas that significantly improved project outcomes.\n• Participated in cross-functional collaboration sessions, facilitating smooth integration of services and features across the platform.\n• Applied meticulous communication strategies to align with stakeholders, ensuring project goals were consistently met and exceeded."
    }
  ],
  "skills": " **Programming Languages:**\n\tNode.js, TypeScript, Python, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, DynamoDB\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Agile, Event-driven systems, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Collaboration, Communication, Curiosity, Logistics, Integration",
  "apply_company": "Cimpress Technology"
}