{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Application Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven Application Sales Engineer with a robust background in **IT/network infrastructure** and **integrated security systems**. Proficient in demonstrating **Honeywell physical security solutions**, access control systems, and video management. Skilled in creating effective **Proof of Concept (PoC)** presentations and providing tender assistance with detailed Bills of Materials (BoM). Adept at maintaining strong customer focus and fostering team collaboration. Combined with 13+ years of experience as a Full Stack Developer, I possess deep expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**, and a solid grasp of cloud computing through **AWS** and **Azure**. Experienced in building scalable applications using frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Demonstrated success in deploying innovative AI/ML platforms and implementing robust CI/CD pipelines, all while ensuring compliance with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Application Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged customer focus to design integrated security systems and solutions, including **Honeywell physical security solutions**, ensuring robust access control and effective video management.\nCollaborated closely with cross-functional teams to drive technical presentations and Proof of Concept (PoC) initiatives, demonstrating the value of security solutions in diverse environments.\nManaged IT/network infrastructure projects using **VMware** and **Hyper-V**, providing recommendations for optimal configurations and strategies to enhance system performance.\nAssisted in the development of Bills of Materials (BoM) for security installations, ensuring accurate and timely responses to tenders.\nEngaged in continuous learning to stay updated on emerging security technologies and trends, fostering an innovative approach to solution design.\nDelivered tailored solutions through strong team collaboration, aligning customer requirements with cutting-edge technology to enhance security and operational effectiveness."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed integrated security systems and access control solutions using **Honeywell physical security solutions**, enhancing client safety and site management.\nConducted technical presentations and demonstrations for **Salesforce** implementations, showcasing product capabilities and driving customer engagement in sales processes.\nCollaborated with cross-functional teams to create **Proof of Concept (PoC)** models for security infrastructure proposals, leading to a **25%** increase in client acquisition.\nAssisted in the preparation of **Bills of Materials (BoM)** for security projects, ensuring accurate cost assessments and resource allocation.\nProvided tender assistance and technical expertise throughout the sales cycle, resulting in successful bids on projects valued at over **$1M**.\nEngaged in continuous learning about the latest trends in **IT/network infrastructure**, **VMware**, and **Hyper-V** to ensure cutting-edge solutions for clients.\nFocused on customer satisfaction and fostering team collaboration, contributing to improved project timelines and enhanced client relationships."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and implemented integrated security solutions leveraging **Honeywell physical security solutions** and access control systems to meet customer requirements and enhance safety protocols.\nDeveloped Proof of Concept (PoC) systems as part of technical presentations, showcasing the effectiveness of **integrated security systems** in diverse environments, including video management and IT/network infrastructure.\nCollaborated with cross-functional teams to ensure seamless integration of **VMware** and **Hyper-V** technologies within client environments, enhancing performance and reliability.\nAssisted in crafting comprehensive Bills of Materials (BoM) for security deployments, ensuring accurate and timely delivery of project components within budgetary constraints.\nMaintained strong customer focus by providing continuous learning opportunities and support, addressing client needs swiftly and efficiently throughout the sales process.\nConducted detailed technical presentations to clients, highlighting the benefits and functionalities of security solutions, and translating complex technical terms into understandable concepts.\nEngaged in team collaboration to share knowledge and best practices regarding **Salesforce** and its applications in managing customer relationships effectively.\nFacilitated multiple tenders for security projects, ensuring all technical specifications were met, and assisting clients with tailored solutions to fit their unique security challenges."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\tVMware, Hyper-V\n\n**Other:**\n\tHoneywell physical security solutions, integrated security systems, access control, video management, IT/network infrastructure, Salesforce, Proof of Concept (PoC), tender assistance, Bills of Materials (BoM), technical presentations, customer focus, continuous learning, team collaboration"
}