{
  "name": "Rei Taro",
  "role_name": "Software Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Skilled Software Developer with over 10 years of experience in designing and delivering robust backend systems, particularly in financial platforms. Proficient in **.NET Core**, **C#**, **SQL Server**, **Web Services**, **.NET Framework**, **MVC**, and **Entity Framework**. Demonstrated ability to create efficient and scalable services, while showcasing strong problem-solving capabilities and exceptional organizational skills. Recognized for attention to detail and effective time management, contributing to successful projects at leading organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Software Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "- Developed scalable web services using **.NET Core** and **C#**, implementing efficient architecture to enhance application performance.\n- Designed and maintained databases with **SQL Server** to optimize data retrieval and storage, achieving query performance improvements of up to **30%**.\n- Utilized **Entity Framework** for data manipulation and ensured smooth CRUD operations while adhering to best practices in **MVC** framework design.\n- Collaborated with cross-functional teams, applying strong **problem-solving** abilities in order to resolve integration challenges and deliver timely project milestones.\n- Demonstrated effective **time management** and **organizational skills** by prioritizing tasks and handling multiple projects simultaneously, meeting **100%** of deadlines.\n- Ensured a high standard of **attention to detail** in code reviews and testing processes, leading to a decrease in post-release defects by **40%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed backend systems using **.NET Core** and **C#** to create scalable web services that streamline user onboarding and manage complex reporting processes.\nEngineered database solutions and optimized SQL queries in **SQL Server** to enhance performance and reliability across applications.\nImplemented web application design patterns with **MVC** and data access strategies through **Entity Framework** to improve code maintainability and efficiency.\nManaged the deployment and integration of services, ensuring adherence to organizational standards and enhancing overall organizational skills and time management.\nApplied strong problem-solving skills to troubleshoot and resolve technical challenges, enhancing application performance by **30%**.\nConducted thorough testing and code reviews, improving attention to detail and ensuring compliance with best practices before every release.\nCollaborated effectively with cross-functional teams to ensure successful integration of new features while maintaining regulatory compliance."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed robust backend services for trade execution, portfolio management, and account tracking utilizing **Python**, **Flask**, and **PostgreSQL**, enhancing trading operations by up to **25%**.\n• Engineered high-performance real-time price feed processors employing **asyncio**, **WebSockets**, and **Redis**, delivering up-to-the-minute trading data for high-frequency transactions with latency reduced to **50ms**.\n• Collaborated closely with frontend teams to facilitate seamless data delivery via REST APIs and WebSocket channels, ensuring efficient user interaction with the platform, achieving user satisfaction scores above **90%**.\n• Ensured compliance with regulatory requirements including **MiFID II** and **GDPR**, while implementing internal data security protocols to safeguard sensitive information.\n• Implemented comprehensive test suites leveraging **PyTest**, **tox**, and mock servers, streamlining QA and CI processes and reducing bugs in production by **30%**.\n• Introduced job queuing and scheduling solutions powered by **Celery** and **RabbitMQ**, optimizing backend task execution and enhancing process management efficiency."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, C#, .NET Core\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery, .NET Framework, MVC, Entity Framework\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Web Services, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL Server\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tPandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, problem-solving, time management, organizational skills, attention to detail, PyTest, Git, Kafka"
}