{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Java Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "Results-driven Java Developer with 8 years of experience, proficient in **Java**, **Spring**, and implementing **Microservices** architecture. I possess strong cloud proficiency with **AWS** and containerization expertise using **Docker** and **Kubernetes**. Skilled in infrastructure as code with **Terraform** and application development utilizing various database solutions including **MongoDB** and **Atlas**. I excel at building **RESTful APIs**, ensuring seamless and efficient integration.\n\nIn addition to my core Java and Spring capabilities, I am adept in **Python** and **JavaScript**, leveraging these languages as needed for versatile development solutions. Experienced in CI/CD practices with **GitLab** and embracing **Agile Development** methodologies, I am committed to delivering high-quality software while fostering effective **communication skills** among cross-functional teams. My prior work encompasses building high-performance applications focused on automation and compliance, notably within the healthcare and financial domains.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Java Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained microservices architectures using **Java**, **Spring**, **Docker**, and **Kubernetes**, ensuring robust deployment and scalability in cloud environments such as **AWS**.\nImplemented CI/CD pipelines using **GitLab** for efficient code integration and deployment, enhancing collaboration and productivity in an **Agile Development** environment.\nDesigned and developed RESTful APIs to facilitate seamless communication between various services, ensuring high availability and performance.\nManaged databases including **MongoDB** and **Atlas** for scalable data storage solutions, optimizing database integration with microservices.\nCollaborated with cross-functional teams to enhance communication skills and ensure alignment on project milestones and technical solutions.\nUtilized **Terraform** and **Skaffold** for infrastructure as code (IaC) implementations, streamlining environment management and deployment processes.\nConducted code reviews and provided mentorship to junior developers, fostering a strong team-oriented culture.\nImplemented unit tests and CI strategies to enhance code quality and facilitate smooth software releases, focusing on continuous integration practices.\nLeveraged strong **Java** and **Python** programming skills to contribute to backend development and infrastructure improvements in existing systems."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and modernized financial platforms using **Java**, ensuring successful implementation of **Microservices** architectural patterns to enhance scalability, maintainability, and throughput of high-volume transactions systems.\nUtilized **Spring** framework to build backend services while contributing to the front-end development using **JavaScript** frameworks, enhancing user experience through responsive designs.\nImplemented **RESTful APIs** for seamless integration across platforms, enabling efficient communication between front-end and back-end systems, achieving a 30% reduction in latency.\nCollaborated in an **Agile Development** environment to drive project timelines and deliverables while improving team communication and workflow.\nApplied **Docker** and **Kubernetes** for containerization and orchestration of applications, leading to a streamlined deployment process and improving scalability by 25%.\nManaged configurations and provisioning using **Terraform**, automating infrastructure setup, which reduced lead time for deployment by 40%.\nEnsured high availability and manageability of databases using **MongoDB** and **MongoDB Atlas**, achieving 99.9% uptime for critical services.\nFocused on maintaining CI/CD practices using **GitLab**, reducing the code release cycle from bi-weekly to one week, enhancing deployment frequency.\nFostered effective communication skills within teams to ensure project alignment and delivery, achieving a 15% increase in stakeholder satisfaction ratings."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed RESTful APIs and microservices architecture using **Java** with **Spring** to ensure fast and efficient backend services for ongoing platform enhancements.\nImplemented CI/CD pipelines with **GitLab**, facilitating seamless integration and delivery of application updates, leading to a **30%** reduction in deployment times.\nUtilized **AWS** for cloud services, optimizing application performance and cost-efficiency while managing infrastructure as code with **Terraform**.\nEmployed containerization strategies with **Docker** and orchestrated deployments with **Kubernetes**, achieving **99.9%** uptime for critical services during peak traffic periods.\nMaintained and optimized distributed databases including **MongoDB** and **Atlas**, enabling rapid data retrieval and ensuring high availability for user transactions.\nCollaborated in agile development environments, enhancing communication and teamwork skills, driving successful project outcomes with sprint completion rates of **95%**.\nParticipated in code reviews and paired programming sessions, ensuring high-quality code standards and effective knowledge sharing within the development team.\nDesigned and implemented microservices to handle user authentication, payment processing, and order fulfillment, contributing to a **25%** increase in application responsiveness and user satisfaction.\nMonitored application performance using logging tools and implemented proactive debugging strategies, resulting in a **40%** decrease in critical bugs post-deployment."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming, Atlas), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Skaffold, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Agile Development, Communication Skills, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)"
}