{
  "name": "Rei Taro",
  "role_name": "Senior Flutter Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Flutter Engineer with over 10 years of robust experience in developing high-quality applications using **Flutter**, **Dart**, and **BLoC** architecture. Proficient in implementing **Clean Architecture** and employing **Atomic Design** principles to create responsive and visually appealing interfaces. Skilled in utilizing **Flutter Widgets** and optimizing performance for mobile applications, ensuring seamless user navigation with tools like **Navigator** and **GoRouter**. Strong expertise in building and integrating **RESTful APIs**, adept in version control through **Git**, and committed to debugging and performance optimization. Excellent communicator and collaborator, demonstrating effective teamwork in delivering impactful solutions within fast-paced environments, having previously contributed to key projects at top-tier organizations including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Flutter Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented responsive UI components with **Flutter** and **Dart**, adhering to **Clean Architecture** principles and **Atomic Design** methodology to enhance user experience and maintainability.\nUtilized **BLoC** and **Cubit** state management to facilitate efficient data flow and component interactions, contributing to a smoother application performance.\nDeveloped and optimized RESTful APIs to ensure seamless integration and data exchange between the client and backend, achieving a response time reduction of **30%**.\nEmployed **Git** for version control practices, maintaining a clean history and collaboration among a team of **9** engineers.\nConducted rigorous debugging sessions to identify and resolve issues, enhancing overall app performance and stability ahead of release milestones by **15%**.\nCollaborated effectively with cross-functional teams for project planning and execution, ensuring alignment on objectives and timely delivery of features, fostering a strong team environment.\nExploited **Flutter Widgets** for crafting reusable components to accelerate development time, leveraging their modularity for improved workflow.\nDesigned and implemented navigation solutions using **Navigator** and **GoRouter**, enhancing user interaction and accessibility across multiple application screens."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed high-performance applications using **Flutter** and **Dart** to enhance user experience and responsiveness by 30%.\nImplemented Clean Architecture patterns and **BLoC** and **Cubit** state management, ensuring maintainable and scalable codebases for complex applications.\nDesigned and optimized user interfaces with **Flutter Widgets**, adhering to **Atomic Design** principles, resulting in a consistent user experience across **3** different platforms.\nUtilized **GoRouter** for efficient navigation management, improving routing performance by **25%** over previous implementations.\nWrote and maintained **RESTful APIs** for seamless data communication between frontend and backend services, ensuring compliance with industry standards.\nConducted thorough debugging and performance optimization processes, achieving a **40%** increase in application speed and reliability.\nFostered effective teamwork and communication within the engineering team to enhance project collaboration and timely delivery, contributing to an overall **20%** reduction in release cycles.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed engaging mobile applications using **Flutter** and **Dart**, ensuring adherence to **Clean Architecture** principles for scalable and maintainable code.\n• Implemented state management solutions utilizing **BLoC** and **Cubit** to enhance app performance and responsiveness across diverse devices.\n• Created intuitive user interfaces with **Atomic Design** and **Flutter Widgets**, achieving a seamless user experience across different screen sizes and resolutions.\n• Collaborated with cross-functional teams to integrate **RESTful APIs**, delivering robust data handling and ensuring smooth operation of features.\n• Conducted thorough debugging and performance optimization processes, tracking application health and functionalities for versions 1.0 and 1.1.\n• Actively participated in code reviews and team meetings, fostering a collaborative environment for **teamwork** and effective **communication**.\n• Utilized **Git** for version control, maintaining high coding standards and documentation for projects under development.\n• Employed modern navigation techniques with **Navigator** and **GoRouter**, improving user flow and interface navigation by over **20%** in user feedback.\n• Demonstrated problem-solving skills and a proactive approach to tackling challenges, ensuring projects were delivered on time and within scope."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, Dart\n\n**Frontend Frameworks**\n\tFlutter, BLoC, Cubit, Clean Architecture, Atomic Design, Flutter Widgets, Responsive Design, Navigator, GoRouter, Mocktail\n\n**API Technologies**\n\tREST/gRPC APIs, RESTful APIs\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Debugging, Performance Optimization, Teamwork, Communication",
  "apply_company": "It's Prodigy"
}