{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "With a robust background in project management and team coordination, I excel in driving initiatives that enhance customer liaison and facilitate continuous improvement in operational processes. Over 8 years of experience as a Full Stack Developer has equipped me with advanced technical skills, including proficiency in **JavaScript**, **TypeScript**, **Python**, and **Flutter** technologies. I have successfully developed enterprise-grade platforms leveraging **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, complemented by extensive experience in cloud technologies such as **Azure** and **AWS**.  \n  \nMy ability to develop and implement complex solutions is matched by my strong understanding of mechanical assembly and electrical schematics, enhancing my contributions in multi-disciplinary environments. I am committed to ensuring industrial maintenance standards while leading projects that focus on process engineering, ensuring adherence to compliance and security standards. My skills in communication enable me to effectively bridge technical teams and customer needs, facilitating project success in challenging environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Managed and coordinated mechanical assembly operations, ensuring efficient processes through effective project management and team coordination.\n• Communicated technical information and project updates clearly to stakeholders and team members, enhancing overall transparency and collaboration.\n• Conducted electrical schematics analysis to diagnose and troubleshoot issues, contributing to continuous improvement initiatives and maintaining high standards in industrial maintenance.\n• Evaluated and implemented process engineering modifications to optimize workflow and reduce downtime, leading to a **15%** increase in operational efficiency.\n• Acted as a customer liaison, ensuring that client needs and specifications were understood and met throughout project lifecycles, enhancing customer satisfaction metrics by **20%**.\n• Executed regular maintenance procedures on engineering systems, ensuring compliance with industry standards and regulations, and reducing unexpected failures by **25%**.\n• Developed training materials and conducted workshops in **English**, improving team skills in assembly techniques and safety protocols by **30%**.\n• Collaborated with cross-functional teams to achieve project milestones on time, utilizing excellent communication skills to resolve any roadblocks efficiently.\n• Drove initiatives for continuous improvement, utilizing feedback and performance metrics to implement best practices and innovative solutions throughout operational processes."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Collaborated with cross-functional teams to enhance project management efficiency, ensuring seamless communication and coordination across departments while effectively managing mechanical assembly and electrical schematics for engineering projects.\nDeveloped and implemented industrial maintenance strategies that drove continuous improvement in operations, resulting in a **15%** increase in system reliability and efficiency.\nActively participated in process engineering initiatives to optimize workflows, reduce downtime, and enhance productivity metrics by **20%** through innovative solutions and customer liaison.\nCoordinated team efforts during diverse projects, providing clear guidance and support to improve collaboration and ensure timely project completion, leading to a **95%** on-time delivery rate.\nConducted training sessions in English to bolster team communication capabilities, fostering a more cohesive work environment and enhancing overall team performance.\nUtilized mechanical assembly and electrical schematics expertise to troubleshoot issues and implement solutions effectively, resulting in a **30%** reduction in project lead times."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Managed project timelines and deliverables for mechanical assembly and electrical schematics, ensuring effective communication and coordination among teams to meet project objectives.\nLed industrial maintenance initiatives, applying process engineering techniques to enhance operational efficiency and minimize downtime by up to **25%**.\nCollaborated with cross-functional teams to improve continuous improvement processes, resulting in a **15%** increase in overall project success rates.\nServed as the customer liaison to provide technical guidance and clear reporting, ensuring that client requirements were consistently met and expectations exceeded.\nUtilized team coordination skills to facilitate the seamless integration of mechanical and electrical systems, fostering collaboration and problem-solving among diverse stakeholders.\nConducted training sessions for team members in best practices and industry standards, enhancing team competency and improving productivity by **30%**.\nEmployed strong English communication skills to produce comprehensive project documentation and technical reports, aiding in knowledge transfer and future reference."
    }
  ],
  "skills": " **Other** \n\tmechanical assembly, electrical schematics, project management, communication, team coordination, industrial maintenance, process engineering, customer liaison, continuous improvement, English \n\n **Programming Languages** \n\tPython, JavaScript, TypeScript \n\n **Backend Frameworks** \n\tFastAPI, Flask, Django \n\n **Frontend Frameworks** \n\tReact, Vue, Angular \n\n **API Technologies** \n\tJWT, OAuth2 \n\n **Serverless and Cloud Functions** \n\tAWS (ECS, Lambda), Azure (App Services) \n\n **Databases** \n\tPostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD \n\n **Cloud & Infrastructure** \n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose \n\n **Authentication & Security** \n\tKeycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot \n\n **Artificial Intelligence & Machine Learning** \n\tMLflow, Airflow, Kubeflow",
  "apply_company": "Shick Esteve (Rians)"
}