{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior ASIC Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior ASIC Engineer with over 10 years of experience in digital design and verification. Proven skills in **VHDL**, **Verilog**, and **SystemVerilog**, with hands-on expertise in **ASIC** and **FPGA** design. Adept at utilizing **EDAs** and **CAD** tools for efficient design workflows, ensuring compliance with industry standards. Proficient in programming with **Python** and **Perl** for automation and process improvement, supporting robust **DevOps** practices and CI/CD automation. Experienced in managing complex hardware projects with a strong focus on documentation and compliance processes.\nDeeply knowledgeable in developing high-performance solutions that integrate seamlessly with software architectures, leveraging my extensive background in **Java**, **C#**, and cloud platforms using **AWS** and **Azure**. Passionate about driving innovation in hardware and software systems to create impactful and efficient solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior ASIC Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented ASIC and FPGA digital design projects, ensuring compliance with industry standards and regulations, leveraging tools like **VHDL**, **Verilog**, and **System Verilog**.\n• Developed and maintained HW configuration processes using Python for automation scripts and enhanced EDA toolchain efficiency, aimed at optimizing the hardware design workflow.\n• Established robust DevOps practices for ASIC workflows, implementing CI/CD pipelines with tools like **GitHub Actions** and **Jenkins** to streamline design verification and synthesis phases.\n• Authored comprehensive documentation for design processes, configuration settings, and compliance guidelines, ensuring clarity and adherence to project specifications.\n• Led the synthesis and verification efforts for complex ASIC designs, employing advanced verification methodologies and tools to achieve a 90% reduction in bug rates during pre-silicon validation.\n• Collaborated with cross-functional teams to align designs with requirements, enhancing overall process efficiency by 30% through effective communication and documentation.\n• Conducted configuration management, tracking changes across multiple revisions, and maintaining integrity of design files leading to improved compliance audits.\n• Utilized advanced EDA and CAD software suites to enhance design accuracy and efficiency, achieving a 15% faster turnaround on design cycles.\n• Spearheaded compliance checks, ensuring all designs met necessary regulatory standards to safeguard against project delays or non-compliance penalties."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Perl** for automation and scripting in the development and integration of ASIC design tools and verification flows, enhancing productivity by **30%**.\nExecuted digital design verification strategies using **VHDL**, **Verilog**, and **SystemVerilog**, resulting in a **50%** reduction of bugs in the final silicon bring-up phase.\nDeveloped and maintained comprehensive documentation for ASIC design and verification processes, ensuring compliance with industry standards and delivering clarity for cross-functional teams.\nImplemented CI/CD pipelines using **DevOps** methodologies, integrating automated tests and building processes, which improved deployment frequency by **40%** and reduced cycle time.\nConducted thorough synthesis and timing analysis using **EDA** tools with **CAD** methodologies, ensuring that designs meet performance specifications while adhering to power and area constraints.\nParticipated in peer reviews and compliance assessments for design documentation to ensure consistency and adherence to established protocols, improving overall team compliance by **25%**.\nCollaborated closely with hardware teams in the design, implementation, and verification phases to ensure seamless integration of **ASIC** and **FPGA** technologies in final products.\nEngaged in continuous improvement of design and verification processes by leveraging innovative approaches and tools in digital design, contributing to a culture of quality and excellence."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python**, **C#**, and **Perl** for the design and development of ASIC hardware, enhancing digital design processes and ensuring compliance with industry standards through thorough documentation.\nDesigned and implemented **digital design** methodologies, leveraging **VHDL**, **Verilog**, and **SystemVerilog** for **FPGA** and ASIC development, focusing on optimized synthesis and verification processes to meet stringent time-to-market timelines.\nLed DevOps initiatives, implementing **CI/CD** pipelines that reduced integration time by **30%**, streamlining the development to production workflow for ASIC projects.\nConducted rigorous verification processes using **EDA** tools, ensuring designs conformed to specifications, achieving **95% verification coverage** prior to synthesis.\nManaged configuration and compliance checks effectively, ensuring that all developments adhered to industry regulations while improving overall product quality through a structured process.\nDeveloped custom scripts in **Python** for automation in design processes, reducing manual workload by over **40%** and enhancing team productivity.\nCollaborated with cross-functional teams to refine design specifications and provide technical documentation, supporting project milestones from conception to completion.\nEngaged in continuous learning and adaptation of new technologies, contributing to a **20%** improvement in project delivery timelines through the adoption of innovative design tools and methodologies.\nOptimized workflows by integrating CAD tools for enhanced design accuracy and performance tracking, resulting in an overall improvement of project execution metrics."
    }
  ],
  "skills": "Programming Languages:\n\tPython, Perl, C#, Java\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), CI/CD & Infrastructure as Code",
  "apply_company": "global semiconductor company"
}