{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior EUC Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "With 8 years of experience, I am a Full Stack Developer who successfully integrates robust security practices into high-performance solutions suitable for enterprise environments. I have a strong background in **Desktop Virtualization**, **Mobile Device Management**, and **Identity Access Management**, which are critical for the role of a Senior EUC Engineer. My expertise includes building applications with **React**, **Node.js**, and **Python**, while also leveraging cloud platforms like **Azure** and **AWS** for seamless deployment and scalability. I possess hands-on experience in **Enterprise Security**, implementing strategies like the **Zero-Trust security model** and **Endpoint Protection** methodologies.\n\nI have led the development of enterprise-grade applications that prioritize customer adoption, and I'm proficient in translating complex technical concepts for various audiences through strong **presentation** and **interpersonal skills**. Additionally, I excel in **time management**, ensuring that project timelines align with compliance standards and customer expectations. My approach combines technical acumen with a focus on client needs, aiming to enhance user experience across **SaaS Services** and enterprise architectures.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior EUC Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and evaluated **Enterprise Security** solutions to enhance secure access and management of desktop and mobile devices, ensuring robust **Endpoint Protection** and adherence to the **Zero-Trust security model**.\nImplemented strategies for **Mobile Device Management** across various platforms, achieving a **30% increase** in device security compliance and reduced unauthorized access incidents by **25%**.\nDesigned and executed **Desktop Virtualization** environments efficiently using **Microsoft desktop operating system** standards, streamlining application deployment processes and improving system performance metrics by **40%**.\nFacilitated presentations and training sessions on **SaaS Services** and **Identity Access Management**, enhancing **Customer Adoption Management** by empowering users with best practices and technical knowledge.\nLed the migration to a centralized **Desktop Management** system that decreased operational costs by **20%**, while simultaneously improving user experience and support response times.\nConducted thorough evaluations of enterprise architecture solutions, ensuring that all configurations aligned with industry-standard security frameworks and best practices.\nCollaborated with cross-functional teams, demonstrating strong **interpersonal skills** to coordinate efforts in achieving project milestones and deadlines, enhancing overall project delivery by **15%**.\nAssured effective management of mobile device platforms that supported remote work strategies, significantly increasing productivity among employees during transitional periods.\nExecuted time management strategies to prioritize tasks effectively, resulting in a **10% increase** in project efficiency while managing multiple concurrent engineering initiatives.\nSupported presales activities by implementing tailored solutions addressing client-driven requirements through effective **presentation skills**, enabling improved client relationships and project scope clarity."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and implemented **Zero-Trust security model** strategies to enhance **Enterprise Security** across systems, ensuring secure access to sensitive financial platforms.\n• Managed **Desktop Virtualization** solutions to streamline user experiences while optimizing resource allocation and improving system performance.\n• Facilitated **Identity Access Management** practices, ensuring that access to systems matched users' roles to maintain data integrity and enhance security.\n• Optimized **Windows application deployment** processes for end-users, improving deployment efficiency by **20%** through automated systems and effective management of resources.\n• Spearheaded the adoption of **SaaS Services** for mobile device management, improving user satisfaction ratings above **90%** through efficient device provisioning and support.\n• Conducted presentations to promote new desktop management strategies, enhancing customer adoption management efforts and resulting in a **25%** increase in positive feedback from stakeholders.\n• Collaborated on cross-functional teams to enhance the **enterprise architecture**, aligning IT initiatives with business goals and delivering timely solutions.\n• Applied strong interpersonal skills in user training sessions, resulting in **75%** of participants feeling more confident in using new systems effectively.\n• Leveraged time management techniques to prioritize and execute multiple projects simultaneously, consistently meeting deadlines and delivering high-quality outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented **Endpoint Protection** strategies to secure desktop and mobile environments, ensuring adherence to the **Zero-Trust security model** across all endpoints.\nManaged **Desktop Virtualization** infrastructure to provide seamless access to applications and resources, enhancing user mobility and productivity within the enterprise environment, benefiting over **500+ users**.\nSpearheaded **Identity Access Management** solutions, establishing **role-based access controls (RBAC)** and secure authentication methods, guaranteeing compliance with GDPR and protecting sensitive data.\nDelivered effective **Windows application deployment** strategies, improving deployment efficiency and reducing time to access by **30%** through the use of automation tools.\nDesigned and supported **Mobile Device Management** systems, ensuring secure access and compliance for **200+ mobile devices** across the organization, resulting in a **25% reduction in security incidents**.\nConducted pre-sales consultations to showcase enterprise security capabilities, directly contributing to **a 15% increase in customer adoption**, utilizing strong **presentation and interpersonal skills**.\nDeveloped and executed enterprise security policies, improving overall **Enterprise Architecture** effectiveness and reducing vulnerabilities by **40%**.\nUtilized **SaaS Services** to streamline operational processes, ensuring high availability and the effective management of enterprise applications.\nProvided ongoing **customer adoption management**, ensuring that teams effectively utilize new technologies and enhance their operational workflows through regular training and support, improving overall satisfaction scores by **20%**.\nLeveraged effective **time management** practices to prioritize tasks and facilitate smooth project delivery within deadlines, successfully completing initiatives ahead of schedule by an average of **10%**."
    }
  ],
  "skills": "****Programming Languages:****\n\tPython, JavaScript, TypeScript\n\n****Backend Frameworks:****\n\tFastAPI, Flask, Django\n\n****Frontend Frameworks:****\n\tReact, Vue, Angular\n\n****API Technologies:****\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n****Serverless and Cloud Functions:****\n\tAWS (ECS, Lambda), Azure (App Services)\n\n****Databases:****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps:****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, CI/CD\n\n****Cloud & Infrastructure:****\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n****Other:****\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Desktop Virtualization, Mobile Device Management, Desktop Management, Identity Access Management, Zero-Trust security model, Endpoint Protection, Enterprise Security, Microsoft desktop operating system, Windows application deployment, Mobile Device Platforms, SaaS Services, Enterprise Architecture, Pre Sales experience, Customer Adoption Management, Presentation skills, Interpersonal skills, Time management",
  "apply_company": "Omnissa"
}