{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior Software Engineer with 10+ years of experience building high-performance, cloud-native applications using **C#**, **ASP.NET**, **Azure**, and **SQL**. Highly skilled in modern web technologies such as **JavaScript** with hands-on expertise in **AJAX** for dynamic user interfaces. Proficient in CI/CD operations with tools like **Jenkins** and **GitHub**, ensuring robust software delivery pipelines. Strong understanding of Cloud Native Patterns and Object-oriented programming principles, complemented by a solid background in Agile methodologies such as **Scrum**.\nDemonstrated success in leading the development of enterprise platforms, leveraging a deep knowledge of full-stack frameworks, including **React**, **Vue**, and **Node.js**. Committed to building secure, maintainable software solutions that comply with strict industry standards. Brings practical experience in microservices architecture and event-driven systems, alongside a passion for delivering technical strategies that yield significant real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and developed robust applications employing **C#**, **ASP.NET**, and **SQL** within a cloud-native architecture, implementing agile methodologies and adhering to Scrum practices.\n• Collaborated on CI/CD pipelines using **GitHub** Actions and **Jenkins**, ensuring seamless integration and deployment workflows across multiple services and environments.\n• Leveraged **JavaScript**, **AJAX**, and related frameworks to enhance user interfaces, delivering intuitive user experiences for various web applications.\n• Created and maintained scalable, cloud solutions on **Azure**, optimizing database performance and ensuring high availability for transactional systems.\n• Integrated automated testing frameworks and strategies covering unit, integration, and E2E tests using tools like Jest and Cypress, improving code reliability and reducing deployment risks by up to **30%**.\n• Engaged in code reviews and collaborative development efforts, mentoring junior developers on **object-oriented programming** principles and best practices.\n• Participated actively in Scrum ceremonies, contributing to sprint planning and retrospective meetings, fostering team cohesion and alignment on goals.\n• Championed efficient use of version control systems like **Git**, enhancing team productivity and maintaining code integrity throughout the development lifecycle.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Leveraged **C#** for backend development and implementation of robust APIs in financial software solutions, ensuring high performance through efficient coding practices.\nUtilized **Azure** cloud services to deploy applications and manage resources, improving scalability by **30%** while reducing operational costs.\nEmployed **SQL** for database management and optimization, resulting in quicker query responses and enhanced transaction processing speed by **40%**.\nDesigned and developed interactive user interfaces using **JavaScript**, enhancing user engagement and experience across financial platforms, adhering to responsive design principles.\nFacilitated CI/CD pipelines using **GitHub** and **Jenkins**, accelerating software releases by **50%** and improving deployment efficiency.\nIntegrated **ASP.NET** and **AJAX** to streamline front-end and back-end communication, enhancing application responsiveness and reducing load times significantly.\nApplied **Cloud Native Patterns** to ensure high availability and fault tolerance in distributed systems, adapting to cloud environments effectively.\nParticipated in **Scrum** methodologies to deliver high-quality software in iterative cycles, contributing to continuous improvement in team productivity.\nDemonstrated strong **object-oriented programming** skills to develop modular and maintainable code, streamlining future updates and feature additions.\nExhibited fluency in English for effective communication with diverse teams, clients, and stakeholders, fostering collaboration and clarity in project objectives."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **C#** within **ASP.NET** framework to design and optimize backend services for e-commerce applications, ensuring high performance and scalability to handle over **10,000** concurrent users.\nEmployed SQL for efficient data management and robust querying practices, resulting in latency reductions of up to **30%** across critical database interactions.\nImplemented CI/CD pipelines using **GitHub** and **Jenkins**, streamlining the deployment process and enhancing development workflow efficiency by **40%**.\nDeveloped dynamic web applications leveraging **JavaScript** and AJAX technologies, focusing on responsive design and cross-browser compatibility, improving user engagement by achieving a **20%** increase in user retention.\nCollaborated in an Agile **Scrum** environment to deliver project milestones on time, maintaining a project velocity of over **25** story points per sprint.\nIntegrated cloud services using **Azure**, ensuring seamless scalability and performance monitoring for various applications, leading to enhanced infrastructure uptime.\nManaged version control with **Git**, enabling efficient collaboration among team members and maintaining code quality through rigorous code reviews.\nAdhered to Cloud Native Patterns and Object-oriented programming principles to develop maintainable and modular codebases that enhance system reliability.\nFostered an environment of continuous improvement, mentoring junior developers and promoting best practices in software development.\nDemonstrated fluency in English, facilitating effective communication with international teams and stakeholders."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, C#, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, ASP.NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, AJAX\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, CI/CD, Git\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose, Cloud Native Patterns\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Object-oriented programming, Scrum, Fluency in English",
  "apply_company": "Relativity"
}