{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior SREngineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior SREngineer with 13+ years of experience specializing in **AWS**, **Python**, and **DevOps** practices. Proven expertise in monitoring and observability using **Cloudwatch** and **DataDog**, facilitating effective incident response and problem-solving in high-performance applications across the healthcare and financial sectors. Proficient in leveraging **Terraform** and **OpenTelemetry** for infrastructure as code and seamless observability integration.\n\nAccomplished in building AI/ML-powered platforms with proficiency in **AI**, **ML**, and MLOps tools like **MLflow** and **Airflow**, ensuring robust predictive analytics and automation capabilities. Strong background in deploying cloud-native systems, implementing microservices, event-driven architectures, and CI/CD pipelines on **AWS** and **Azure**.\n\nExemplary communication skills with a deep understanding of compliance-driven development aligned with standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior SREngineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Implemented **AWS** infrastructure for scalable deployments, utilizing services such as **CloudWatch** and **Terraform** for efficient resource management and observability.\n• Designed and built full-stack platforms utilizing **Python** and frameworks including **FastAPI**, ensuring robust performance and reliability in critical healthcare and fintech applications.\n• Established and maintained DevOps practices for incident response, employing **DataDog** for monitoring and alerting to ensure high availability and performance.\n• Led initiatives in **SRE** by enhancing system reliability through thorough root cause analysis and implementation of automation scripts to resolve recurring issues, significantly increasing uptime.\n• Delivered advanced AI and ML solutions, integrating models using **AWS** and open-source libraries for predictive analytics and real-time monitoring of system performance.\n• Developed and executed incident response strategies, actively communicating with stakeholders to ensure transparency and effective problem-solving during outages.\n• Enhanced observability across all services through the implementation of **OpenTelemetry**, ensuring comprehensive tracking of system health and performance metrics.\n• Collaborated with cross-functional teams to optimize application performance, focusing on continuous improvement of existing systems and processes.\n• Created **CI/CD** pipelines employing robust CI tools, integrating testing frameworks to maintain code quality and streamline deployment workflows.\n• Engaged in proactive monitoring and troubleshooting, utilizing metrics from **AWS CloudWatch** and **DataDog** to foresee and mitigate potential outages, enhancing system reliability by **25%**.\n• Championed the adoption of best practices within the team, offering mentorship in communication and technical skills to foster growth and a culture of learning."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **AWS** solutions to enhance observability and incident response capabilities in the financial systems, streamlining operational workflows.\nUtilized **Terraform** for Infrastructure as Code (IaC), automating provisioning and management of cloud resources, leading to a **30% reduction** in deployment time.\nDeveloped robust **observability** frameworks using **OpenTelemetry** and **Cloudwatch**, enabling proactive monitoring and troubleshooting across digital platforms with **99.9% uptime**.\nLeveraged **DataDog** to provide real-time insights into system performance, improving response time to incidents by **40%** through effective alerting mechanisms.\nApplied **DevOps** best practices to promote automation and continuous integration/continuous deployment (CI/CD) pipelines, achieving a **50% improvement** in release cycles.\nCollaborated effectively with cross-functional teams to solve complex problems, enhancing communication and coordination during incident responses.\nEmployed **AI** and **ML** techniques in maintenance activities and to support performance enhancements, integrating predictive analytics to foresee and mitigate potential system failures.\nFostered a culture of continuous improvement in **problem-solving** methodologies, leading to optimized processes and reduced operational risks across platforms."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented effective **AWS** infrastructure and automated cloud resource management using **Terraform**, enhancing the deployment process and operational efficiency in a high-traffic environment.\nLeveraged **OpenTelemetry** for comprehensive observability of services, enabling proactive incident response and facilitating seamless debugging and performance monitoring across platforms.\nEngineered resilient backend services in **Python** (FastAPI, Django), focusing on low latency and high availability, pivotal for maintaining service uptime of over **99.9%**.\nDeveloped robust monitoring solutions with **CloudWatch** and **DataDog**, significantly improving incident detection times by **30%**, and reducing mean time to recovery (MTTR).\nUtilized an array of AI/ML tools, such as **scikit-learn** and **TensorFlow**, to enhance product recommendation algorithms, driving a conversion rate improvement of **15%** through data-driven insights.\nConducted thorough incident response drills and troubleshooting sessions ensuring stakeholder communication and effective problem-solving during critical system outages.\nCollaborated with DevOps teams to establish best practices and continuous integration/continuous deployment (CI/CD) pipelines, resulting in a **40%** reduction in deployment times and increased team efficiency.\nMaintained clear and effective communication of SRE objectives and progress to various stakeholders, ensuring alignment with business goals and optimizing system performance.\nCreated a culture of observability and accountability across engineering teams, promoting knowledge sharing and skills development to enhance team capabilities in problem-solving and incident management.\n"
    }
  ],
  "skills": "**Cloud & Infrastructure:**\n\tAWS, Azure: App Services, Blob Storage, SQL Database\n\tCloudwatch, DataDog\n\n**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Other:**\n\tAI, ML, OpenTelemetry, observability, incident response, problem-solving, communication",
  "apply_company": "Robin AI"
}