{
  "name": "Mariusz Jan Skobel",
  "role_name": "Full Stack .NET Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Full Stack .NET Developer with 10+ years of experience delivering high-performance software solutions in healthcare and finance. Proficient in **.NET** frameworks and skilled in **APIs** development, while bringing strong leadership and communication skills to the table. Expert in modern technologies including JavaScript/TypeScript, Python, and Flutter, with hands-on expertise across the full stack using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building and deploying cloud-native applications on **Azure** and **AWS**, and leading the development of enterprise platforms that embed AI/ML capabilities for real-time analytics, automation, and intelligent decision-making. Strong background in microservices architecture, event-driven systems, and CI/CD automation, focused on building secure, maintainable solutions that meet compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Brings practical experience in MLOps—from developing ML pipelines and deploying models to managing production workflows—using tools like **MLflow**, **Airflow**, and **Kubeflow**. Passionate about building systems that are not only technically sound but also drive real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Full Stack .NET Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tUtilized **.NET** to design and implement scalable, full-stack solutions, ensuring optimal performance and adherence to industry performance benchmarks.\n•\tDeveloped RESTful **APIs** for integration with various systems, enhancing data flow and functionality within applications.\n•\tDemonstrated leadership in orchestrating cross-functional teams to achieve project milestones and foster collaborative communication across departments, resulting in a **20%** increase in project efficiency.\n•\tManaged the transition of monolithic applications into microservices-based architectures, employing **Docker** and **Kubernetes** (AKS/EKS) for improved scalability and maintainability.\n•\tOptimized and maintained cloud-native databases using **PostgreSQL** and **MongoDB**, supporting data storage and querying for **over 1 million** records, while ensuring data integrity and security.\n•\tImplemented enterprise-level DevOps pipelines using **Azure DevOps** and **GitHub Actions**, achieving continuous integration and delivery, reducing deployment time by **30%**.\n•\tDeveloped user interfaces in **React** (17–18) and **Vue 3**, focusing on enhancing user experience while adhering to responsive design standards and best practices.\n•\tIncorporated effective testing strategies utilizing **Jest**, **Cypress**, and **Postman**, ensuring a robust development process with **95%** code coverage across both front-end and back-end services.\n•\tCollaborated with stakeholders to gather requirements and communicate project statuses, improving transparency and alignment with business objectives.\n•\tDelivered impactful financial data visualization tools using **D3.js** and **Power BI Embedded**, providing insights that mitigated risks and improved decision-making processes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Demonstrated strong **leadership** in overseeing the full software development lifecycle as a **Full Stack .NET Developer**, successfully fostering a collaborative team environment.\n\nUtilized **.NET** technologies to build and maintain robust **APIs** and applications, enhancing system performance and deliverability for a variety of stakeholders.\n\nDesigned and developed scalable solutions employing both front-end and back-end technologies, facilitating seamless user experiences and ensuring comprehensive system functionality.\n\nAdapted best practices in **Full Stack Development** using frameworks like **React** and **Express**, ensuring high-quality code through rigorous testing and version control strategies.\n\nFostered effective **communication** across cross-functional teams, ensuring alignment on project goals and promoting knowledge sharing among team members.\n\nLed initiatives for optimizing application performance, achieving a **30%** reduction in load times through advanced coding techniques and optimization strategies.\n\nImplemented continuous integration and deployment practices to increase development velocity, resulting in a **15%** boost in overall project delivery timelines.\n\nConsistently monitored and analyzed system metrics, leading to a **20%** improvement in application uptime and reliability over a year."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "- Developed and maintained APIs utilizing **.NET** frameworks, ensuring a seamless and secure communication channel between frontend and backend services.\n- Led a team of software developers in a full stack environment, mentoring team members and fostering effective communication to achieve project objectives and deadlines.\n- Implemented robust error handling and logging mechanisms within the **.NET** ecosystem to improve system reliability and troubleshooting, focusing on core aspects of **APIs**.\n- Collaborated with stakeholders to gather requirements and refine project goals, effectively communicating technical concepts to non-technical audiences to improve overall project alignment.\n- Enhanced application performance and user experience by optimizing **.NET** solutions across various modules such as inventory management and user authentication.\n- Conducted thorough code reviews and implemented best practices to uphold high coding standards while utilizing **.NET** technologies for efficient software development.\n- Enabled continuous integration and delivery processes within the **.NET** stack, automating deployment workflows to reduce time-to-market for new features by **30%**.\n- Monitored application performance and user feedback to iterate and implement enhancements, achieving a **20%** increase in user satisfaction scores over **6** months.\n- Successfully integrated third-party services such as payment gateways and analytics tools, ensuring secure transactions and compliance with industry standards.\n- Delivered high-quality documentation for all developed features and API endpoints, facilitating better maintenance and onboarding processes for new team members."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tPython(FastAPI, Flask, Django)\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tAPIs\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tLeadership, Communication, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}