{
  "name": "Tomasz Lee",
  "role_name": "Webfocus Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic WebFOCUS Engineer with 9+ years of experience in designing and implementing ETL processes and complex reporting systems. Proficient in **WebFOCUS**, **Iway**, **DataMigrator**, and **ReportCaster**. Strong background in database management, with extensive knowledge of **Oracle** and **SQL Server**. Demonstrated ability to optimize data flow and enhance security utilizing **Security Center**. Equipped with a solid foundation in application development with expertise in **.NET**, **C#**, and web technologies like **ReactJS** and **NextJS**. Recognized for delivering robust solutions, leading cross-functional teams, and driving successful project completions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Webfocus Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **WebFOCUS** for developing and maintaining business intelligence solutions, ensuring accurate and efficient data reporting.\nDesigned and implemented ETL processes using **Iway** DataMigrator to facilitate seamless data integration from various sources.\nDeveloped and scheduled reports with **ReportCaster**, achieving a 50% reduction in report delivery times.\nCollaborated with cross-functional teams to gather requirements and translate them into actionable project tasks, significantly improving project delivery efficiency.\nEnsured data security through the implementation of best practices in **Security Center**, safeguarding sensitive information across all reports and analytics.\nConducted data analysis on **Oracle** and **SQL Server** databases, boosting reporting accuracy by 30%.\nOptimized SQL queries and indexed database tables, resulting in a 25% increase in report generation speed.\nTrained team members on **WebFOCUS** and integrated technologies, enhancing workforce skill sets and collaboration.\nStreamlined report generation processes, leading to a notable increase in user adoption and satisfaction ratings by 40%."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "- Developed data extraction and transformation processes using **ETL** methodologies, ensuring seamless data flow within systems.\n- Created and managed reports with **WebFOCUS**, leading to a 20% increase in reporting efficiency for business intelligence.\n- Implemented robust data migration solutions utilizing **Iway** and **DataMigrator**, successfully migrating over 1 million records with 99% accuracy.\n- Ensured data security compliance by utilizing **Security Center** for access management and security audits.\n- Enhanced reporting capabilities by designing automated schedules with **ReportCaster**, resulting in 50% faster report generation.\n- Managed databases on **Oracle** and **SQL Server**, optimizing performance by applying best practices in indexing and query design.\n- Collaborated with cross-functional teams to gather requirements and define technical specifications, ensuring projects were delivered on time.\n- Conducted thorough testing and validation of data processes, maintaining a 100% success rate in deployments.\n- Provided training and ongoing support for end-users to enhance their understanding of reporting tools, increasing user satisfaction ratings by 35%."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **WebFOCUS** for report generation and data visualization, aligning deliverables with user requirements and boosting report accessibility by **30%**.\nExecuted ETL processes with **Iway DataMigrator** to streamline data integration from multiple sources, enhancing data consistency and reliability across systems.\nImplemented robust security measures utilizing **Security Center**, ensuring compliance with data protection regulations and safeguarding sensitive information.\nDeveloped and optimized SQL queries in **SQL Server**, resulting in a **40%** improvement in report generation time and overall system performance.\nCreated automated reporting processes with **ReportCaster**, reducing manual report distribution time by **50%**.\nExecuted data migration projects, ensuring seamless transfer of data from legacy systems to **Oracle** databases while maintaining data integrity.\nParticipated in code reviews and Agile sprints, contributing to project planning and ensuring the alignment of goals with organizational objectives.\nProduced comprehensive technical documentation for processes and workflows, promoting knowledge sharing and improving team efficiency.\nEngaged in troubleshooting and resolving database-related issues, reducing downtime by maintaining operational readiness and efficiency.\n"
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n\t**Backend Frameworks**\n\n\tBackend Technologies: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n\t**API Technologies**\n\n\tRESTful API, GraphQL\n\n\t**Databases**\n\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Oracle, SQL Server\n\n\t**ETL Tools**\n\n\tWebFOCUS, Iway, DataMigrator\n\n\t**Reporting Tools**\n\n\tReportCaster\n\n\t**Security Tools**\n\n\tSecurity Center\n\n\t**Messaging & Caching**\n\n\tApache Kafka, RabbitMQ, Redis\n\n\t**Cloud & Infrastructure**\n\n\tAWS, Azure\n\n\t**DevOps**\n\n\tCI/CD pipelines\n\n\t**Testing Tools**\n\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\n\t**Blockchain**\n\n\tSolidity, Ether.js, Web3.js, Ethereum\n\n\t**Other Skills**\n\n\tUX/UI Design, Git, GitHub, Python, Redux"
}