{
  "name": "Patryk Zaslawski",
  "role_name": "L2 Cloud Operations Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-driven L2 Cloud Operations Engineer with 8+ years of experience in cloud infrastructure and software engineering. Proficient in **AWS**, **Infrastructure as Code** using **Terraform** and **CloudFormation**, implementing **CI/CD** pipelines, and managing container orchestration with **Kubernetes** and **Docker**. Expertise in monitoring and performance optimization using **Prometheus** and **Grafana**. Strong foundation in back-end development with **Python** and **Go**, ensuring robust and scalable solutions. Adept in troubleshooting and effective communication to drive solutions in fast-paced environments, and passionate about enhancing cloud infrastructure for e-commerce, financial, and healthcare sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "L2 Cloud Operations Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Managed **CI/CD** pipelines, leveraging tools such as **GitHub Actions** and **Azure DevOps** to automate testing and deployment of **Python microservices**, significantly improving deployment speed by **30%**.\n- Utilized **Kubernetes** (AKS/EKS) and **Docker** to deploy and manage **cloud-native applications**, enhancing application scalability and resilience with an uptime improvement of **99.9%**.\n- Implemented **Infrastructure as Code** using **Terraform**, streamlining resource provisioning and reducing configuration drift during deployment processes by **40%**.\n- Developed incident response protocols focused on troubleshooting and communication, ensuring swift resolution of operational issues and minimizing downtime.\n- Leveraged monitoring tools like **Prometheus** and **Grafana** for observability, providing actionable insights on the health of the deployed **applications** and workflows, leading to a **25%** decrease in incident response times.\n- Collaborated with cross-functional teams on **AWS** services integration, fostering knowledge-sharing sessions to improve cloud-native design patterns and enhance system robustness.\n- Employed **Python** for automating workflows within a **cloud** environment, facilitating smoother data transfer and processing between legacy and modern systems, leading to improved operational efficiencies.\n- Engaged in continuous learning and mentoring of junior engineers, instilling best practices in **cloud** operations, monitoring, and troubleshooting within the **Python** environment.\n- Advocated for and implemented **Kubernetes** solutions, enhancing container orchestration capabilities to maintain service quality amidst increasing operational demands.\n- Delivered training sessions on **AWS**, **CI/CD** methodologies, and **cloud infrastructure**, improving team knowledge and reducing dependency on external resources."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Leveraged **AWS** Cloud services for deploying and managing applications, ensuring seamless integration with existing systems and enabling scalability for high-demand environments.\n- Implemented **Infrastructure as Code** using **Terraform** and **CloudFormation** to streamline deployment processes and maintain version control across multiple environments, reducing configuration errors by **30%**.\n- Developed and maintained **CI/CD** pipelines in **Kubernetes** environments, implementing **Docker** containers for application management, leading to a **40%** increase in deployment efficiency.\n- Utilized **Prometheus** and **Grafana** for monitoring system performance and health, proactively identifying performance bottlenecks and reducing downtime by **20%**.\n- Collaborated with development teams to troubleshoot issues across infrastructure and application layers, ensuring effective communication and resolution of technical challenges.\n- Designed and implemented automated infrastructure scaling and optimization strategies, enhancing operational efficiency with minimal manual intervention.\n- Configured and managed **Kubernetes** clusters for orchestrating containerized applications, enabling rolling updates and consistent service availability.\n- Applied best practices in **Python** scripting to automate routine tasks and improve system performance, leading to enhanced operational workflows.\n- Conducted thorough testing and validation of environment setups to ensure compatibility and stability across different platforms and services.\n- Fostered a culture of continuous improvement by providing training and support to team members, focusing on **troubleshooting** techniques and operational best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented and managed **Infrastructure as Code** solutions using **Terraform** and **CloudFormation**, ensuring scalable and reliable cloud infrastructure that supports operational needs.\nDeveloped and optimized **CI/CD** pipelines utilizing **Docker** and **Kubernetes** to enable seamless, high-frequency deployments of cloud applications, driving efficiency and consistency in release cycles.\nEnsured system performance and reliability by implementing observability tools such as **Prometheus** and **Grafana**, achieving a **30%** improvement in response times and proactive issue resolution.\nUtilized **Python** and **Go** for developing automation scripts, enhancing operational efficiency and reducing troubleshooting time by **25%**.\nConducted thorough troubleshooting of cloud-based applications and infrastructure, enhancing team productivity through effective **communication** and knowledge-sharing.\nCollaborated with cross-functional teams to deliver solutions that meet operational requirements in cloud environments, leading to a **40%** increase in team efficiency through effective project management and clear communication.\nDesigned and implemented scalable microservices architecture on AWS, facilitating smooth operations for various deployments, with a focus on service availability and redundancy.\nEstablished best practices for monitoring and logging, ensuring compliance with operational standards and enhancing overall system stability by minimizing downtime.\nStreamlined incident response processes, reducing mean time to recovery (MTTR) from incidents and improving system resilience under load.\nLed initiatives in optimizing cloud costs by reviewing and refining resource utilization, achieving up to a **20%** reduction in operational expenses."
    }
  ],
  "skills": "**Cloud & Infrastructure**\n\tAWS, Infrastructure as Code, Terraform, CloudFormation, Docker, Kubernetes\n\n**DevOps**\n\tCI/CD, GitHub Actions, GitLab CI/CD, Prometheus, Grafana\n\n**Programming Languages**\n\tPython, Go\n\n**Backend Frameworks**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies**\n\tREST & gRPC APIs\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Other**\n\ttroubleshooting, communication"
}