{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Backend Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "Results-driven Senior Backend Engineer with 8 years of diverse experience in delivering high-performance solutions, specializing in **PHP**, **SQL**, and **APIs** development. Proficient in implementing core principles like **OOP**, **SOLID**, and design patterns to create scalable and maintainable systems. Proven ability to contribute towards **TDD**, **DDD**, and clean architecture practices that improve code quality and team productivity.\n\nSkilled in using an extensive tech stack including **JavaScript** and **HTML/CSS** for frontend integration, alongside experience in version control systems. Strong analytical skills coupled with a proactive attitude enhance my capability to tackle complex challenges while fostering teamwork and collaboration. Committed to continuous learning and sharing knowledge within the team, I bring a sense of humor to my work environment, creating a positive and motivating atmosphere for those around me.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained **PHP** applications adhering to **SOLID** principles and **design patterns**, ensuring high-quality, structured code.\n• Collaborated in a team environment to implement RESTful **APIs** that support dynamic interactions with front-end systems, leveraging **SQL** for effective data handling.\n• Utilized **HTML**, **CSS**, and **JavaScript** to enhance user experience in web applications, ensuring alignment with modern **client-side** technologies.\n• Implemented **OOP** and **clean architecture** methodologies in development processes, promoting modular and maintainable code.\n• Focused on writing **TDD** compliant tests using frameworks to ensure robust, bug-free applications across all development phases.\n• Leveraged **version control systems** (e.g., Git) for efficient project management and team collaboration while maintaining code integrity.\n• Applied strong analytical skills to troubleshoot and resolve complex issues effectively, enhancing application performance and user satisfaction.\n• Actively participated in knowledge sharing within the team, displaying a proactive attitude towards mentoring and learning from peers.\n• Engaged in project-based teamwork with effective organizational skills to meet tight deadlines and facilitate smooth delivery of software solutions.\n• Leveraged humor and positive teamwork to foster a collaborative and enjoyable work environment."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Utilized **PHP** and **SQL** to develop and optimize backend services, ensuring robust performance and adherence to **OOP** principles and **SOLID** design patterns.\nEmployed **version control** systems for effective collaboration and streamlined development workflows in line with team methodologies, including **TDD** and **DDD**.\nDesigned and integrated RESTful **APIs** for seamless communication between front-end and back-end systems, enhancing data accessibility and user experience.\nCollaborated within cross-functional teams to build and maintain web applications using **HTML**, **CSS**, and **JavaScript**, prioritizing user-centered design and functionality.\nImplemented clean architecture principles in the design and organization of codebases, ensuring maintainability and scalability for future enhancements.\nConducted thorough testing and debugging of applications to ensure reliability and performance standards were consistently met, leveraging **analytical skills** to identify issues swiftly.\nDemonstrated a proactive attitude towards learning and teaching team members about best practices and emerging technologies, fostering a culture of knowledge sharing and continuous improvement.\nDisplayed strong organizational skills in managing multiple projects simultaneously, maintaining focus on deadlines and quality of deliverables, all while promoting teamwork and camaraderie within the team environment."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Utilized **PHP** and **SQL** to develop robust backend services in alignment with **OOP** principles and **SOLID** design patterns, ensuring maintainable and scalable code structure for the e-commerce platform.\nCollaborated closely with frontend developers and utilized **APIs** to integrate interactive features and data services, enhancing user experience with responsive design using **HTML**, **CSS**, and **JavaScript**.\nEngaged in **version control** practices to manage codebase history and streamline development workflows, ensuring smooth collaboration within the team.\nApplied **TDD** and **DDD** methodologies to ensure high quality and performance of delivered components, implementing rigorous testing for backend applications and services.\nImplemented organized, clean architecture for optimal software design, demonstrating strong **analytical skills** and a proactive attitude in identifying areas for improvement and innovation.\nParticipated actively in team meetings and project planning, fostering a collaborative environment that encouraged **teamwork** and mutual support among members.\nDemonstrated a willingness to **learn and teach**, mentoring junior developers on best practices and new technologies to strengthen team capabilities.\nUtilized humor to maintain morale and foster a positive work environment while tackling complex problems in the development process."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, PHP, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n**API Technologies:**\n\tAPIs, OIDC, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tOOP, SOLID, design patterns, TDD, DDD, clean architecture, version control, Testing, analytical skills, proactive attitude, organizational skills, teamwork, humor, willingness to learn and teach",
  "apply_company": "wecity"
}