{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Frontend Engineer with 8 years of experience, I excel in developing user-centric, high-performance web applications. My technical skill set includes **JavaScript**, **HTML5**, **CSS3**, **React**, and styling frameworks such as **Tailwind CSS** and **Bootstrap**. I have extensive experience in utilizing **REST API** for seamless backend integration and employing **GitHub** and **GitLab** for efficient version control.\n\nI prioritize collaboration and communication within cross-functional teams to achieve optimal project outcomes. My background in UI/UX design, enhanced by tools like **Figma**, allows me to create visually appealing interfaces while maintaining functionality. Additionally, I have a solid understanding of SEO practices that drive organic traffic to applications.\n\nCombining a strong frontend focus with knowledge of backend principles, I am adept at debugging and problem-solving, ensuring smooth user experiences across diverse platforms. I am committed to delivering high-quality software that meets business objectives and enhances user engagement.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained responsive web applications using **JavaScript**, **React**, **HTML5**, **CSS3**, and frameworks such as **Tailwind CSS** and **Bootstrap**, ensuring high performance and user engagement across platforms.\nCollaborated with designers to transform UI/UX designs from **Figma** into functional applications, meeting strict deadlines and ensuring design fidelity.\nImplemented RESTful APIs for smooth integration between front-end and back-end services, facilitating data exchange in real-time and enhancing user experiences.\nManaged version control and collaborative workflows using **GitHub** and **GitLab**, ensuring consistent code quality and ease of deployment through CI/CD practices.\nOptimized applications for SEO, following the best practices to improve visibility and user reach, resulting in a **30%** increase in organic traffic.\nLed cross-functional teams in troubleshooting and debugging complex issues, maintaining communication and achieving efficient problem resolution, contributing to a **95%** project delivery success rate.\nWorked with e-commerce platforms such as **WooCommerce**, enhancing online transaction capabilities and user experiences while integrating secure payment gateways.\nDeveloped modular and reusable components that align with modern development principles, improving maintainability and scalability across applications.\nExecuted performance monitoring and optimization strategies, achieving a page load time of under **3 seconds** and improving overall user retention rates.\nFostered collaboration in Agile environments, participating in sprint planning and reviews to align project goals and enhance team productivity."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained dynamic, user-focused front-end applications using **React (18)**, **JavaScript**, **HTML5**, **CSS3**, and **Tailwind CSS**, ensuring responsive and performant user interfaces for client engagements.\nCollaborated with cross-functional teams to implement and integrate **REST APIs**, enhancing the functionality and responsiveness of applications while maintaining adherence to best practices in **SEO**.\nUtilized **GitHub** and **GitLab** for version control and code management, streamlining collaboration efforts across diverse development teams.\nApplied design tools like **Figma** to translate wireframes into high-quality code, ensuring alignment with project requirements and enhancing user satisfaction.\nImplemented debugging techniques to resolve UI issues efficiently, improving the overall usability and performance of applications.\nLeveraged experience in eCommerce solutions such as **WooCommerce** to develop robust, feature-rich web applications tailored for online retail.\nParticipated in detailed code reviews and contributed to the enhancement of development guidelines, fostering a culture of continuous improvement and collaboration within the team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained web applications using **JavaScript**, **React** (18), **HTML5**, **CSS3**, and **Tailwind CSS**, ensuring high-quality front-end development aligned with project goals and user requirements.\nCollaborated with cross-functional teams to optimize UI/UX designs in **Figma**, leading to a 25% improvement in user engagement metrics through user-friendly interfaces.\nImplemented responsive web solutions ensuring compatibility across various devices, improving mobile performance by 30% and achieving accessibility compliance with WCAG 2.1 standards.\nContributed to the agile development process by participating in sprint planning, code reviews, and retrospective meetings, promoting effective **collaboration** and **communication**.\nUtilized **GitHub** and **GitLab** for version control and collaboration on source code management, streamlining team workflows and increasing deployment efficiency by 40%.\nIntegrated **WooCommerce** and optimized **REST APIs** for seamless e-commerce functionalities, resulting in a 15% increase in transaction conversions by enhancing user experience.\nConducted debugging sessions and quality assurance testing to resolve issues, reducing bug occurrence by 20% in final product releases.\nApplied SEO best practices to improve website visibility and ranking on search engines, resulting in a 35% increase in organic traffic over three months.\nLed initiatives to utilize **Bootstrap** and **Foundation** frameworks for consistent styling and layout standards across all branding projects, achieving a unified look and feel in compliance with corporate guidelines."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, JavaScript, HTML5, CSS3, Tailwind CSS, Bootstrap, Foundation, Figma\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**API Technologies:**\n\tREST API\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tWordPress, WooCommerce, SEO, Artificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, debugging, collaboration, communication",
  "apply_company": "Remote Office"
}