{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior ML Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior ML Engineer with over 10 years of experience in developing and implementing advanced Machine Learning (ML) solutions, including Deep Learning and Natural Language Processing (NLP) technologies. Proficient in using **Python**, **PyTorch**, and **Hugging Face** for building sophisticated models that enhance content understanding and information retrieval. Expertise in optimizing data pipelines for efficient inference, leveraging both **GPU** and **CPU** resources. Skilled in deploying robust ML workflows through hands-on experience with **Linux** environments.\n\nIn addition to ML competencies, I possess a comprehensive background as a Full Stack Developer, having delivered high-performance software solutions in healthcare and finance. Experienced with modern technologies such as **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven track record in cloud-native application deployment on **Azure** and **AWS**, leading the development of secure, compliant systems that adhere to regulations like HIPAA, and PCI DSS. A results-driven professional passionate about creating impactful systems that leverage AI/ML capabilities for real-time analytics and intelligent decision-making.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and deployed machine learning and deep learning models for tasks including patient risk prediction and financial fraud detection, utilizing **Python**, **PyTorch**, and **Hugging Face**, ensuring high performance on **GPU** and **CPU** architectures.\n• Designed robust data pipelines for model training and inference, optimizing workflows across multiple environments while ensuring consistency and version control.\n• Implemented advanced natural language processing algorithms for content understanding and information retrieval, integrating models into backend services through RESTful APIs.\n• Built and optimized MLOps workflows leveraging tools such as MLflow, DVC, and Apache Airflow, achieving **70% faster training times** on complex datasets.\n• Collaborated with cross-functional teams to ensure the integration of machine learning capabilities into client-facing applications, enhancing user experiences with predictive statistics and insights.\n• Established testing and validation strategies using a range of frameworks including Jest, PyTest, and Postman, leading to improved model accuracy and reduced error rates by **30%**.\n• Employed cloud solutions and infrastructure, including **AWS** and **Azure**, to host and manage machine learning models, providing scalable inference services to meet peak demand.\n• Integrated sophisticated search capabilities through Azure Cognitive Search and ElasticSearch, improving document retrieval speed by **50%** for diverse datasets."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented advanced **Machine Learning** solutions for financial platforms, applying methodologies with **Python** and **scikit-learn** to analyze transaction patterns and improve fraud detection capabilities.\nDesigned and developed scalable **Data Pipelines** using **Apache Airflow** and **Azure Data Factory** for efficient handling of batch and real-time data, increasing data processing efficiency by **30%**.\nCreated and managed **Inference** systems for real-time credit scoring and churn prediction directly integrated into backend services, enhancing decision-making speed by **40%**.\nLeveraged **PyTorch** to build and deploy customized deep learning models, improving prediction accuracy on user behavior and transaction classifications by **25%**.\nUtilized **Natural Language Processing** techniques to enrich content understanding and information retrieval systems, driving engagement and insights.\nConducted experiments and optimizations on GPU and CPU environments, managing resources effectively to maximize model training and inference performance.\nCollaborated with cross-functional teams to align AI/ML initiatives with business objectives, ensuring the delivery of high-impact projects on time, including integration of **Hugging Face** models for enhanced user interaction.\nDeveloped and maintained automated testing frameworks to validate model performance and data integrity, increasing deployment success rate to **98%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Engineered and optimized data pipelines for machine learning applications using **Python** and **Linux**, ensuring efficient processing and robust performance.\nDeveloped and implemented machine learning models with frameworks such as **PyTorch** and **Hugging Face** to enhance content understanding and natural language processing capabilities across multiple projects.\nManaged experimentation and model inference workflows on **GPU** and **CPU** clusters, achieving optimizations that improved inference speed by over **30%**.\nDesigned and executed algorithms for information retrieval and deep learning tasks, analyzing datasets exceeding **5TB** to derive actionable insights and optimize model performance.\nCollaborated with cross-functional teams to define requirements and implement ML solutions that improve user experiences and drive business growth by enhancing personalization features.\nUtilized advanced techniques in deep learning to develop robust models capable of accommodating diverse datasets while achieving state-of-the-art performance in evaluation metrics.\nConducted rigorous model evaluations and adjusted hyperparameters to enhance accuracy and reliability, resulting in improvements in key performance indicators by **15%**.\nEstablished best practices for model versioning and lifecycle management to ensure streamlined deployment and rollback strategies in line with enterprise standards.\nPresented findings and progress on ML initiatives to stakeholders, translating complex concepts into intuitive insights to support decision-making processes."
    }
  ],
  "skills": "   **Programming Languages**\n\tPython, JavaScript/TypeScript\n\n   **Backend Frameworks**\n\tFastAPI, Flask, Django\n\n   **Frontend Frameworks**\n\tReact, Vue, Angular\n\n   **API Technologies**\n\tNginx, JWT, OAuth2, Keycloak (OIDC, RBAC), Let’s Encrypt, Certbot\n\n   **Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n   **Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n   **DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n   **Cloud & Infrastructure**\n\t\n\n   **Other**\n\tMachine Learning, Deep Learning, Natural Language Processing, Hugging Face, PyTorch, MLflow, Airflow, Kubeflow, GPU, CPU, Data Pipelines, Inference, Content Understanding, Information Retrieval, Algorithms, Linux",
  "apply_company": "Accuris"
}