{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Software Engineer with 9+ years of experience in full stack development, proficient in **TypeScript**, **React**, **Node.js**, **GraphQL**, and **Postgres**. Demonstrated expertise in **Redis** and CI/CD practices, ensuring streamlined development and deployment processes. Skilled in Agile methodologies, facilitating effective communication and collaboration across teams. Proven track record of designing and implementing complex applications using **.NET**, **C#**, and delivering robust microservices architecture. Adept at leading development projects to successful completion while optimizing application performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **TypeScript** and **React** to enhance the front-end of a web-based customer management platform, achieving a **25%** increase in user satisfaction.\nCollaborated with cross-functional teams in an **Agile** environment, fostering seamless **communication** and **collaboration** to drive project success.\nDesigned and implemented GraphQL queries to streamline data fetching, improving application performance by ensuring efficient data retrieval.\nIntegrated **Node.js** for server-side logic, facilitating a stable and high-performing backend.\nUtilized **Postgres** as the database solution, focusing on data integrity and optimizing SQL queries to reduce average execution time by **20%**.\nDeveloped and maintained CI/CD pipelines, leveraging automation tools to cut deployment time by **40%**.\nIncorporated **Redis** for caching to enhance system response times, driving a **35%** reduction in database load.\nImplemented JWT-based authentication for secure user access, ensuring robust security measures across the platform.\nCreated dynamic and interactive data visualizations using **D3.js** and **Three.js**, enriching the end-user experience significantly."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed robust web applications using **React** and **TypeScript**, promoting improved maintainability and scalability in line with Agile methodologies.\n• Created and consumed **GraphQL** APIs to optimize data retrieval processes, enhancing the performance of front-end components by 20%.\n• Leveraged **Node.js** for server-side operations ensuring a seamless integration with **Postgres** for efficient data handling and faster access.\n• Implemented **Redis** as a caching solution, significantly reducing response times of API calls and driving a **25%** boost in overall application speed.\n• Designed and maintained CI/CD pipelines utilizing **GitHub Actions**, decreasing deployment errors by **30%** and ensuring smoother software releases.\n• Collaborated in Agile teams, utilizing effective communication and collaboration across cross-functional groups to ensure timely delivery of projects, meeting **100%** of deadlines.\n• Conducted regular code reviews, promoting best practices among team members and achieving a **15%** increase in code quality metrics.\n• Engaged actively in mentorship, fostering junior developer growth and improving team productivity metrics.\n• Designed interactive visualizations using **D3.js** for project tracking, which enhanced reporting clarity and user interactions by **25%**.\n• Maintained meticulous documentation for database management encompassing **MSSQL** and **MySQL**, optimizing query performance and overall system reliability."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **TypeScript** and **React** to build scalable, high-performance applications, leading to a **30%** increase in user engagement.\nDeveloped and optimized **GraphQL** APIs to streamline data retrieval processes, resulting in a **25%** decrease in load time for client applications.\nImplemented **Node.js** for server-side logic, enhancing application responsiveness and stability during high-traffic scenarios.\nManaged data storage and retrieval operations using **Postgres**, improving data integrity and query performance by **15%**.\nLeveraged **Redis** for caching solutions, significantly reducing response time for frequently accessed data.\nCreated and maintained CI/CD pipelines, facilitating smoother releases and a **40%** reduction in deployment downtime.\nParticipated in Agile methodologies, promoting collaboration and communication within cross-functional teams to enhance project delivery outcomes.\nConducted code reviews and provided mentorship to junior developers, fostering a culture of best practices and continuous improvement.\nDelivered comprehensive technical documentation and user guides that improved team knowledge transfer efficiency by **20%**.\nEngaged in daily standups to track project progress and address any challenges swiftly, ensuring alignment with project goals."
    }
  ],
  "skills": " **Programming Languages**\n\t TypeScript, JavaScript, C#, Python\n\n**Frontend Frameworks**\n\t ReactJS, Angular, VueJS, NextJS, NuxtJS, Material UI, TailwindCSS, Three.js, D3.js, React Native, Flutter, Chakra UI\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Messaging & Caching**\n\t Redis, Apache Kafka, RabbitMQ\n\n**Database Systems**\n\t PostgreSQL, MySQL, MSSQL Server, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD, AWS, Azure\n\n**Cloud & Infrastructure**\n\t (Included in DevOps)\n\n**Other**\n\t UX/UI Design, Git, GitHub, Agile, communication, collaboration, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Ashby"
}