{
  "name": "Mariusz Jan Skobel",
  "role_name": "Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Results-driven Software Engineer with 10+ years of experience in developing high-performance applications utilizing **Python 3**, **TypeScript**, **React**, and **Postgres**. Expert in modern frameworks and technologies including **GraphQL**, **Kotlin**, **Jetpack**, **Swift**, **SwiftUI**, alongside a strong foundation in cloud services such as **GCP** and agile infrastructure management with **Terraform**. Proficient in container orchestration using **Kubernetes** and dedicated to implementing robust, maintainable solutions that adhere to best practices and security compliance. Demonstrated ability to lead large-scale projects, ensuring seamless integration of machine learning capabilities and real-time data processing for actionable insights. Fluent in English and French, capable of collaborating with diverse teams to drive innovative solutions that make a tangible impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable full-stack solutions using **Python 3**, **TypeScript**, and **React** with a focus on performance and maintainability.\n• Developed cloud-native applications with **GraphQL** and **Postgres** for efficient data management and real-time operations in healthcare and finance sectors.\n• Collaborated in teams that utilized **Kubernetes** for orchestration and managed services, enhancing deployment efficiency and scaling capabilities by **30%.**\n• Conducted cross-platform mobile app development, integrating with native libraries and features, ensuring smooth functionality across iOS and Android platforms.\n• Led initiatives that modernized legacy systems into microservices architectures, contributing to a **40%** increase in system reliability and reduced downtime.\n• Implemented CI/CD pipelines using modern tools like **Terraform** and **GCP**, achieving deployment automation that reduced release times by **50%.**\n• Engaged in team-driven data visualization projects using advanced libraries and tools, delivering insights that improved decision-making processes by **25%.**\n• Maintained quality and performance metrics for applications by establishing testing strategies, which resulted in error rates dropping by **20%.**\n• Communicated effectively in both **English** and **French**, enhancing collaboration within diverse teams and client engagements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed scalable applications utilizing **Python 3** and **TypeScript** to meet evolving business needs in the financial sector.\nImplemented robust and dynamic front-end solutions using **React (18)** and **SwiftUI** to enhance user experiences, ensuring seamless interactions for financial platforms.\nDesigned and maintained back-end services with **GraphQL** and **Kotlin** for efficient data retrieval and management, improving application performance by up to **30%**.\nUtilized **Postgres** for data storage solutions, ensuring data integrity and optimizing queries for faster response times in high-load scenarios.\nDeployed microservices architecture with container orchestration using **Kubernetes** and **Terraform**, achieving a reduction in deployment times by **50%**.\nCollaborated using agile methodologies to iterate on user feedback and deliver features, enhancing team productivity and responsiveness to market changes.\nApplied CI/CD best practices for streamlined development workflows, significantly reducing release cycle durations by **40%**.\nEngaged in cross-functional communication in both **English** and **French**, facilitating clear specifications and expectations between stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python 3** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability in key modules like checkout, cart, and order fulfillment.\nImplemented **Postgres** as a reliable database solution, ensuring fast, fault-tolerant data access for high-traffic workflows while optimizing performance through strategic indexing and query optimization.\nDeveloped responsive web applications with **React** (version **18**), enhancing user experience on both web and mobile platforms through seamless interactions and engaging UI components.\nEngineered real-time features through **GraphQL** and event-driven architecture powered by **Kafka** and **RabbitMQ**, enabling dynamic order updates and real-time customer support with less than 100ms latency.\nIntegrated cloud services on **GCP** to deploy applications, utilizing **Kubernetes** for orchestration and **Terraform** for infrastructure management, ensuring scalable deployments.\nLeveraged best practices in **TypeScript** to develop maintainable and type-safe applications while enhancing collaboration in multi-developer environments.\nImplemented advanced caching strategies with **Redis**, increasing application responsiveness significantly, reducing read pressure on databases by **30%**.\nApplied modern frontend technologies including **Swift** and **SwiftUI** for mobile applications, delivering seamless user experiences in iOS environments.\nEngaged in multilinguistic communication, providing support in both **English** and **French**, enhancing team collaboration and client interaction across diverse markets.\nAdopted feature flags and blue-green deployments through **Kubernetes**, facilitating controlled rollouts and A/B testing to mitigate risk during major platform updates.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython 3, Kotlin, Swift, TypeScript\n\n**Frontend Frameworks:**\n\tReact\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tGraphQL\n\n**Serverless and Cloud Functions:**\n\tGCP, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, English, French"
}