{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a proficient Senior Software Engineer, I excel in developing robust backend solutions using **PHP** and have a strong command of **MySQL** and **Postgres** for relational database management. My expertise encompasses the design and implementation of **APIs**, as well as building **event-based applications** utilizing **Kafka** and **RabbitMQ**. I emphasize clean code principles and am adept at **Object-oriented Programming**, leveraging my skills in **React** for dynamic frontend functionalities. With over 8 years in software engineering, I also bring experience in **Git** for version control and have a solid grasp of **NIX Command Line** for efficient system management. My background includes teamwork and fostering open feedback within development teams to enhance project outcomes while adhering to industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and maintained robust APIs and backend systems using **PHP** and **PostgreSQL** to ensure seamless data handling and application performance.\n- Designed event-based applications utilizing **Kafka** and **RabbitMQ** to manage asynchronous data flows and improve system responsiveness.\n- Implemented clean code practices in **PHP** to enhance code maintainability and facilitate future development by the team.\n- Collaborated effectively within a team environment, promoting open feedback and communication strategies to foster a positive and productive workplace.\n- Leveraged **MySQL** for relational database management, ensuring efficient data storage and retrieval across multiple applications.\n- Led backend development efforts for complex systems, utilizing **React** for enhancing front-end user experiences.\n- Advocated for object-oriented programming principles to enable efficient code reuse and organization across projects.\n- Conducted code reviews and provided mentorship to junior developers, promoting best practices and clean code implementations in projects.\n- Utilized **Git** for version control, ensuring consistent project tracking and team collaboration through feature branches.\n- Engaged in command line operations within **NIX** environments to streamline development workflows and system management.\n- Developed comprehensive testing strategies, ensuring robust and reliable application deployment processes in line with team standards."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained high-quality backend solutions using **PHP** with a focus on clean code and **object-oriented programming**, enhancing application maintainability and performance.\n• Designed and implemented robust **APIs** to facilitate seamless communication between client-side applications and backend services, leveraging both **MySQL** and **Postgres** for efficient data management.\n• Collaborated effectively in a team environment, promoting **open feedback** and utilizing **Git** for version control, ensuring a smooth workflow among team members.\n• Designed and built event-based applications using **Kafka** and **RabbitMQ**, optimizing data processing for real-time responses and enhancing application scalability.\n• Implemented database optimization techniques for relational databases (**MySQL**, **Postgres**) leading to a 35% increase in query performance for high-traffic modules.\n• Led the adoption of modern JavaScript libraries like **React** for front-end development, achieving a 40% reduction in load times and enhancing user experience with dynamic interfaces.\n• Worked on the infrastructure using **NIX Command Line** tools to streamline deployment processes and automate routine tasks.\n• Conducted code reviews and implemented best practices in coding standards to ensure high-quality deliverables and foster continuous improvement in the development processes."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Developed robust APIs in **PHP** to streamline backend services, ensuring interoperability and high performance for user transactions.\n- Designed and optimized **Relational Databases** with a focus on **MySQL** and **Postgres**, achieving a **15%** reduction in query response times and improved data retrieval efficiency.\n- Leveraged advanced features of **Kafka** and **RabbitMQ** to create **event-based applications**, facilitating real-time data processing and enhancing system reliability.\n- Demonstrated strong **object-oriented programming** principles in crafting scalable backend solutions, improving maintainability and collaboration across cross-functional teams.\n- Championed clean code practices by conducting code reviews and implementing feedback loops, leading to a **20%** increase in code quality as reflected in reduced bug reports.\n- Utilized **React** to build dynamic, user-centric interfaces, enabling a faster user experience with **up to 30%** quicker load times through efficient state management and rendering techniques.\n- Collaborated in an Agile environment, fostering teamwork to prioritize project deliverables and facilitate a culture of open feedback, resulting in improved project delivery times by **25%**.\n- Engaged in continuous integration and deployment practices using **Git**, enhancing version control and ensuring seamless integration of new features and bug fixes.\n- Conducted thorough testing and optimization of backend systems, preparing for traffic scaling and ensuring readiness for peak loads through strategic performance strategies.\n- Fostered knowledge sharing among team members to elevate collective expertise in **NIX command line** tools and methodologies, ultimately enhancing overall team capability.\n- Proactively addressed issues in live applications by utilizing debugging skills and incident management processes, maintaining high uptime and availability standards."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython (FastAPI, Django, Flask), PHP, Object-oriented Programming\n\n**Backend Frameworks:**\n\tSpring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), Redis, Relational Databases\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, NIX Command Line, Git\n\n**Cloud & Infrastructure:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Other:**\n\tCelery, SQLAlchemy, Pydantic, Kafka, RabbitMQ, Event-based Applications, Clean Code, Teamwork, Open Feedback",
  "apply_company": "ChargePoint"
}