{
  "name": "Tomasz Lee",
  "role_name": "Senior MES Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior MES Engineer with 9+ years of experience in designing and implementing Manufacturing Execution Systems (MES) solutions. Proficient in leveraging tools and technologies like **Opcenter**, **PharmaSuite**, and **Camstar** to enhance manufacturing processes and ensure compliance with FDA and GMP standards. Highly skilled in project management and team collaboration, demonstrating exceptional communication and teamwork skills to lead cross-functional initiatives effectively. Additional expertise in application development with **.NET**, **C#**, **ReactJS**, and cloud computing, along with a background in microservices architecture and distributed systems using **Apache Kafka**, **RabbitMQ**, and **Redis**. Committed to delivering high-quality, compliant solutions while optimizing workflows and streamlining processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior MES Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Led the implementation of **PharmaSuite** and **Opcenter** to enhance the manufacturing execution systems (MES), ensuring compliance with **FDA** regulations and **GMP** standards across projects.\nDeveloped and executed process automation strategies using **POMS** and **XFP**, improving operational efficiency by 30%.\nCoordinated and facilitated **CSV** (Computer Systems Validation) efforts to ensure system compliance and maintain software quality, achieving a compliance rate of 100% during audits.\nCollaborated effectively with cross-functional teams, leveraging strong **communication** and **teamwork** skills to align project goals and exceed expectations.\nDesigned training modules and documentation to facilitate user adoption and best practices, increasing user satisfaction rates by 25%.\nImplemented change management processes to streamline transitions between legacy systems and new **Camstar** solutions, resulting in a 20% reduction in deployment time.\nParticipated in weekly review meetings to discuss project progress and risk mitigation strategies, ensuring timely delivery of MES projects.\nUtilized analytical tools for data-driven decision-making and reporting, helping to identify and implement performance improvements in manufacturing processes."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Led the design and implementation of Manufacturing Execution Systems (MES) to optimize production workflows and ensure compliance with FDA regulations, improving overall efficiency by **20%**.\n• Collaborated with cross-functional teams to define requirements for PAS|X, Opcenter, and PharmaSuite implementations, ensuring all stakeholders were aligned on project goals and timelines.\n• Developed and maintained integrating systems using **XFP** and **POMS** for real-time data monitoring and analysis, enhancing operational visibility.\n• Conducted validation processes in accordance with CSV standards, ensuring all systems meet GMP compliance, which contributed to a **15%** reduction in audit findings.\n• Provided training and mentorship to junior engineers on best practices and methodologies in MES technologies, enhancing team collaboration and communication skills.\n• Built custom dashboards and reports utilizing **Camstar** and other third-party tools, improving project tracking and decision-making processes.\n• Regularly communicated project status, risks, and solutions to management and stakeholders, fostering a transparent project environment.\n• Utilized teamwork strategies to lead a project that integrated new MES functionalities, resulting in a **30%** improvement in production output.\n• Implemented continuous improvement initiatives based on feedback from team members and performance metrics, driving a culture of innovation and responsiveness."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged skills in **MES** and **Opcenter** to enhance manufacturing processes, contributing to a **15%** increase in operational efficiency.\nApplied knowledge of **GMP** and **FDA** regulations to ensure compliance in all engineering solutions, reducing compliance-related issues by **30%**.\nCollaborated closely with cross-functional teams to achieve project goals, demonstrating exceptional **teamwork** and **communication** skills.\nLed the implementation of **PAS|X** in streamlining production workflows, resulting in a **25%** decrease in production downtime.\nUtilized **PharmaSuite** and **Camstar** to optimize production scheduling and resource management, significantly improving capacity utilization.\nDeveloped training materials and conducted workshops for end-users on **CSV** procedures to ensure adherence to best practices.\nWorked on systems interfacing with **XFP** and **POMS** for effective data exchange and reporting.\nEngaged in daily standups to align technical objectives with team efforts, maintaining transparency and collaboration across departments.\nProduced detailed documentation for system processes to enhance team knowledge and facilitate smoother onboarding for new engineers."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**DevOps**\n\tCI/CD pipelines\n\n**Other**\n\tUX/UI Design, Git, GitHub, Python, Redux, Solidity, Ether.js, Web3.js, Ethereum, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, MES, PAS|X, Opcenter, PharmaSuite, XFP, POMS, Camstar, FDA, GMP, CSV, Teamwork, Communication",
  "apply_company": "Accenture"
}