{
  "name": "Rei Taro",
  "role_name": "Senior Engineering Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Detail-oriented Senior Engineering Engineer with 10+ years of experience in backend development, specializing in creating high-performance APIs and scalable services. Proficient in **Python** (FastAPI, Django, Flask) and adept at leveraging **cloud services** like **AWS** and **Azure** for cloud-native architectures. Bringing strong skills in statistical software including **R**, **SPSS**, and **Stata**, alongside a commitment to academic guidance and content development. Recognized for autonomy and self-management, with a proven ability to deliver impactful projects at leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineering Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed, maintained, and optimized backend services in **Python** using **FastAPI** to facilitate document automation and enhance user onboarding processes by achieving a **30%** increase in workflow efficiency.\nConducted in-depth statistical research and analysis by leveraging **R**, **SPSS**, and **Stata** to generate insights that informed engineering decisions, improving project outcomes by **25%**.\nEmployed robust methodologies for academic guidance and content development that led to the successful completion of projects ahead of deadlines by an average of **2 weeks**.\nIntegrated **Celery** and **Redis** for event-driven solutions, significantly reducing response times for financial transaction requests by up to **50%**.\nImplemented **Azure App Services** for deploying microservices, and managed infrastructure efficiently using **Terraform**, ensuring reliable cloud operations with an uptime of **99.9%**.\nDesigned and managed data pipelines utilizing **Apache Airflow** and **Azure Functions**, ensuring regulatory data exchange was timely and exceeded accuracy standards by **15%**.\nEnhanced security posture by leading assessments and implementing authentication systems using **OAuth2** and **Azure AD B2C**, ensuring compliance with best practices and regulations.\nCollaborated effectively with cross-functional teams to navigate system integration challenges, address compliance needs, and orchestrate release strategies for new features and updates."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed backend systems using **Python** and **FastAPI** to enhance document workflows and user onboarding processes by **30%**.\nCreated event-driven microservices with **Celery** and **Redis**, facilitating asynchronous processing of financial data while reducing transaction handling time by **25%**.\nManaged the deployment of microservices on **Azure App Services**, leveraging **Terraform** for infrastructure automation, resulting in a **40%** increase in deployment efficiency.\nEngineered data pipelines for the secure exchange of regulatory data with **Apache Airflow** and **Azure Functions**, automating data flows and improving data processing time by **20%**.\nPerformed security audits to ensure compliance with industry standards while integrating **OAuth2** and **Azure AD B2C** for authentication and secure access control protocols.\nCollaborated with cross-functional teams to guarantee smooth system integration, regulatory compliance, and successful product releases, contributing to a **15%** improvement in overall project delivery timelines."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized advanced programming in **Python** to enhance backend services, focusing on trade execution and portfolio management, improving operational efficiency by **25%**.\nConducted in-depth research for integrating statistical software solutions like **R**, **SPSS**, and **Stata** into trading algorithms, boosting analysis accuracy by **30%**.\nCollaborated autonomously with cross-functional teams, delivering streamlined REST APIs and WebSocket channels for frontend connectivity, enhancing user experience with a **40%** reduction in load time.\nDeveloped comprehensive documentation and implemented citation practices according to **APA**, **Vancouver**, **Chicago**, and **Harvard** standards, ensuring clarity and consistency across technical write-ups.\nImplemented job scheduling and queue solutions using **Celery** and **RabbitMQ**, achieving a **20%** improvement in task management efficiency.\nEngineered real-time data processors using **asyncio**, **WebSockets**, and **Redis**, maintaining a **99.9%** uptime for high-frequency trading operations.\nDesigned and maintained rigorous test suites with **PyTest**, ensuring the platform adhered to regulatory standards such as MiFID II and GDPR while enhancing overall QA processes."
    }
  ],
  "skills": " \n**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, R\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\twriting, research, citation, APA, Vancouver, Chicago, Harvard, statistical software, SPSS, Stata, academic guidance, content development, autonomy, self-management, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka",
  "apply_company": "HazMiTrabajo"
}