{
  "name": "Rei Taro",
  "role_name": "Senior Elixir Fullstack Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Proficient in **Elixir**, **Phoenix**, and **TailwindCSS**, with a strong focus on developing robust backend systems and maintaining GDPR compliance. Skilled in creating responsive web applications with **LiveView** and implementing best practices in **encryption** and **data privacy**. Experienced in **DevOps** and agile software development methodologies, including **Shape Up** for streamlined project delivery. An adept communicator and collaborator with over 10 years of expertise in designing and delivering systems, specializing in financial platforms, AI/ML pipelines, and cloud-native architectures. Proven success in building high-performing APIs and scalable services with technologies such as **Python** (*FastAPI*, *Django*, *Flask*) and cloud platforms like **AWS** and **Azure** while contributing to impactful projects at leading organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Elixir Fullstack Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented GDPR compliance measures in data handling and storage to ensure data privacy and encryption in all backend systems.\nEngineered full-stack solutions using **Elixir**, **Phoenix**, and **LiveView** to enhance user experiences and operational efficiency.\nDeveloped responsive UI components with **TailwindCSS** and **daisyUI** to improve application aesthetics and accessibility, reducing user drop-off rates by **15%**.\nCollaborated with cross-functional teams utilizing **agile software development** practices, contributing to a **20%** increase in project delivery speed.\nAdopted **Shape Up methodology** to streamline project workflows and improve code quality, leading to a **30%** reduction in code review turnaround time.\nLed initiatives to improve team collaboration and communication, fostering an environment of continuous improvement and knowledge sharing.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed fullstack solutions in **Elixir** and **Phoenix**, implementing **LiveView** for real-time user interactions and leveraging **TailwindCSS** and **daisyUI** for modern UI design.\n• Ensured data privacy and compliance with **GDPR** standards through encryption and secure data handling practices, successfully maintaining the integrity of user information for over **1000** users.\n• Engaged in **DevOps** practices to streamline deployment processes and enhance operational efficiency, reducing deployment times by **30%** using automated workflows.\n• Practiced **agile software development** methodologies, including the **Shape Up methodology**, to enhance project management and delivery speed across teams.\n• Conducted regular code quality reviews and implemented best practices to improve code robustness, resulting in a **25%** decrease in post-release bug reports.\n• Fostered collaboration and communication within cross-functional teams to achieve seamless project execution and timely feature deliveries.\n• Continuously refined technical and non-technical requirements in a dynamic environment, adapting to changing priorities and improving overall project outcomes."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Elixir** and **Phoenix** to develop robust backend services for trade execution, focusing on agile software development methodologies to improve project delivery timelines by **20%**.\nLeveraged **LiveView** to enhance user experience with real-time updates on trade portfolio management, resulting in a **30%** increase in user engagement.\nImplemented **TailwindCSS** and **daisyUI** for frontend development to ensure a responsive and modern user interface, reducing the development time for UI components by **15%**.\nCollaborated with cross-functional teams to create and maintain secure REST APIs, ensuring compliance with GDPR regulations and rigorous encryption standards for data privacy.\nAdhered to best practices in code quality and testing, employing tools like PyTest and custom-built QA processes to maintain a **99.5%** code coverage rate.\nFacilitated effective communication and collaboration within an agile team, improving sprint retrospective feedback scores by **25%**.\nIntroduced DevOps practices to streamline deployment processes, reducing system downtime during updates by **40%**."
    }
  ],
  "skills": " **Programming Languages**\n\t Elixir, Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\t Phoenix, FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t TailwindCSS, LiveView, daisyUI\n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure, Docker, Kubernetes\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t GitHub Actions, Azure DevOps, CI/CD, DevOps, agile software development, Shape Up methodology\n\n **Cloud & Infrastructure**\n\t AWS (EC2, S3, Lambda), Azure, Docker, Kubernetes\n\n **Other**\n\t GDPR compliance, encryption, data privacy, code quality, collaboration, communication, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git"
}