{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Rust Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a proficient Senior Rust Engineer with 8 years of extensive experience, I possess strong competencies in **Rust**, focusing on building secure and high-performance solutions that integrate cryptography and blockchain technologies. My background encompasses comprehensive knowledge in **gRPC**, database design, networking protocols, and cybersecurity best practices. I have successfully led the development of enterprise-grade applications within the healthcare and financial sectors, employing **JavaScript/TypeScript**, **Python**, and **Flutter** frameworks to ensure seamless integration and performance.\nI am well-versed in full-stack development utilizing frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, along with significant cloud experience using **Azure** and **AWS**. My experience in microservices architecture, event-driven systems, and CI/CD automation has enabled me to create robust and secure applications compliant with standards like HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, I have hands-on experience in machine learning pipelines and MLOps workflows, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**, enhancing my versatility in delivering comprehensive technical solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Rust Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed high-performance applications using **Rust** and **gRPC**, employing efficient network communication protocols to enhance system interaction and reduce latency.\n- Ensured robust data security and integrity through advanced **cryptography** techniques, safeguarding sensitive information within applications.\n- Designed and maintained database systems that integrate seamlessly with application architecture, optimizing performance for large-scale transactions and data management.\n- Championed next-generation blockchain technology by implementing decentralized applications and smart contracts, enhancing transaction reliability and transparency.\n- Led initiatives in **cybersecurity** practices to defend against vulnerabilities, implementing security-focused audits and comprehensive penetration testing across systems.\n- Collaborated on cross-functional teams to deliver and maintain scalable solutions, leading to a **30%** improvement in system uptime and performance metrics.\n- Optimized existing codebases for performance and security, achieving a **20%** reduction in processing time for key transaction workflows.\n- Spearheaded the transition of legacy systems to modern frameworks, improving maintainability and scalability to meet increasing demand.\n- Mentored junior engineers, enhancing team expertise and fostering a culture of continuous learning and improvement in Rust and associated technologies.\n- Benchmarked system performance, achieving over **95%** efficiency across multiple applications, leading to increased user satisfaction and engagement."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **Rust** for developing secure, high-performance financial applications, ensuring robust **cryptography** and **cybersecurity** measures are integrated at every stage of the development process.\nEngineered and optimized **gRPC** services for seamless communication between distributed systems, improving data transfer speeds by **30%**.\nDesigned reliable database solutions, focusing on data integrity and performance, enhancing query execution times by **25%**.\nImplemented secure networking protocols that safeguarded financial transactions, achieving compliance with industry regulations and standards.\nContributed to the adoptions of blockchain technologies to increase transaction transparency and traceability within financial systems.\nDeveloped automated tests using **Rust's** testing framework, achieving a **90%** code coverage to ensure software reliability and maintainability.\nCollaborated with cross-functional teams to architect scalable systems, maintaining a focus on performance and security, while mentoring junior developers on best practices in software engineering."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied **Rust** for backend development, ensuring system reliability and performance in a high-demand engineering environment.\nUtilized **gRPC** for efficient communication between microservices, enabling rapid data exchange and reducing latency in service interactions.\nImplemented robust **cryptography** techniques to secure data in transit and at rest, ensuring the integrity and confidentiality of sensitive information.\nDesigned and optimized database schemas and queries to improve access time and performance, integrating **PostgreSQL** and **MongoDB** into the architecture.\nEngineered networking solutions to enhance connectivity between services and facilitate real-time data processing in distributed systems.\nContributed to the development of blockchain solutions, exploring decentralized technology to enhance platform reliability and security.\nEmployed best practices in **cybersecurity** to safeguard applications against threats, continuously monitoring and updating security protocols.\nCollaborated with cross-functional teams to ensure seamless integration of features and enhancements, leading to a 30% improvement in deployment efficiency.\nConducted performance tuning and load testing, achieving 99.9% uptime and decreasing response times by **25%** for high-traffic services.\nLed a team of developers to adopt **Rust** best practices, improving code quality and maintainability across **10+** service modules."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript, Rust\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tgRPC\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, database\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMachine Learning, MLflow, Airflow, Kubeflow, cryptography, networking, blockchain, cybersecurity, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "IOTA"
}