{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior FullStack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Full Stack Engineer with 13+ years of experience in delivering high-performance applications within dynamic environments, specifically in billing and credit card processing solutions. Proficient in **TypeScript**, **Node.js**, and front-end technologies like **React**, with a robust ability to build serverless architectures using **AWS**, **GCP**, and **Azure**. Expertise in implementing **EKS** for container orchestration and integrating **SQS** for asynchronous communication.\n\nHands-on experience in developing usage-based billing systems, metering, and invoicing, with a strong adherence to auditing and record-keeping standards. Adept at collaborating within cross-functional teams to solve complex problems, utilizing strong communication skills and ownership mindset in fast-paced environments. Furthermore, well-versed in **MongoDB** and compliance surrounding financial services. Background in AI/ML-powered platforms, employing tools such as **FastAPI**, **Django**, and CI/CD pipelines for continuous integration and delivery.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed full-stack applications utilizing **Node.js** and **TypeScript**, incorporating effective solutions for billing, invoicing, and credit card processing tasks within the **AWS** and **Azure** environments.\n• Implemented serverless components using **AWS Lambda** and **Azure Functions** to enhance application performance and reduce costs in telecommunications and finance domains.\n• Engineered dynamic user interfaces with **React** (17-18) and supported usage-based billing models through innovative state management and component architecture.\n• Created and maintained robust backend systems with **MongoDB** for record-keeping and auditing, ensuring compliance with financial regulations.\n• Led the use of **EKS** for deploying scalable applications in **Kubernetes** orchestrated environments, optimizing resource utilization and operational efficiency.\n• Collaborated with cross-functional teams to design microservices architecture for billing and metering functionalities, focusing on effective communication and teamwork within fast-paced settings.\n• Conducted thorough debugging and problem-solving to ensure high application performance and reliability across multiple platforms.\n• Applied **SQS** for effective message handling in serverless architecture, improving transaction handling times and user experience.\n• Maintained and enhanced CI/CD processes leveraging **GitHub Actions** and **Azure DevOps**, with complete test automation and security checks integrated across development environments.\n• Engaged with stakeholders to define project requirements and ownership of features, ensuring alignment with business goals and operational excellence."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Typescript** and **Node.js** to develop microservices for billing and invoicing systems, significantly improving transaction processing speeds by **30%**.\nEngineered front-end applications leveraging **React (18)** and **Next.js** for user interfaces, successfully enhancing user engagement metrics by **25%** through refined interaction design.\nImplemented usage-based billing solutions and metering services, achieving real-time data accuracy for over **100,000** transactions monthly.\nCreated asynchronous workflows with **AWS SQS** and **EKS**, ensuring reliable communication for payment processing and auditing tasks, which reduced error rates by **15%**.\nIntegrated **MongoDB** for robust record-keeping, allowing for seamless retrieval and management of financial data across various applications.\nDesigned and deployed serverless functions within the **AWS** environment to automate financial reports, resulting in a **40%** decrease in manual processing time.\nEnhanced team collaboration through effective communication practices and ownership of projects within a fast-paced development environment, navigating challenges with problem-solving and debugging skills.\nLeveraged **Azure** services for secure cloud solutions in credit card processing, adhering to stringent compliance and sales tax regulations, which improved audit response efficiency by **20%**.\nActively participated in team initiatives, fostering a culture of teamwork while mentoring junior developers in best practices of full-stack development."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed scalable backend services using **Node.js** (NestJS, Express) and **MongoDB**, ensuring robust data management and efficient handling of billing processes including **credit card processing** and **invoicing** for a global e-commerce platform.\n• Implemented serverless architecture and asynchronous messaging using **AWS SQS** and **EKS**, achieving high availability and responsiveness in a **fast-paced environment** with dynamic demand.\n• Engineered real-time functionalities through **WebSockets** and event-driven systems with **Kafka**, streamlining customer interactions and enabling efficient communication during peak traffic periods.\n• Built user-centric frontend applications with **React** (18) and **TypeScript**, facilitating *usage-based billing* features for enhanced user experience and engagement in both web and mobile environments.\n• Managed comprehensive data storage solutions using **Mongo**, **PostgreSQL**, and **Redis**, ensuring optimized performance and reliable access across high-traffic workflows while adhering to **record-keeping** principles.\n• Designed and integrated payment systems using **Stripe**, **PayPal**, and **Razorpay**, with a focus on secure processing for transactions and compliance with **sales tax** regulations.\n• Applied **role-based access control (RBAC)** and **OAuth 2.0**, ensuring secure user data management and compliance with data protection standards including **GDPR**.\n• Collaborated with cross-functional teams, enhancing **teamwork** and fostering **communication** to troubleshoot and resolve **problem solving** challenges during project developments.\n• Practiced **debugging** techniques in both **Node.js** and frontend frameworks, maintaining platform integrity and operational excellence throughout the software development lifecycle.\n• Spearheaded the creation of SEO-friendly UI components using **Next.js** and **HTML5/CSS3**, focusing on mobile-first design principles and compliance with accessibility standards **(WCAG 2.1)**."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.JS\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAWS, GCP, Azure\n\n**Serverless and Cloud Functions:**\n\tLambda, Serverless\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Terraform, Ansible, Helm, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, EKS\n\n**Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tCommunication, Problem Solving, Debugging, Teamwork, Fast-Paced Environment, Ownership, Billing, Credit Card Processing, Usage-Based Billing, Metering, CSP Marketplaces, Invoicing, Sales Tax, Auditing, Record-Keeping\n",
  "apply_company": "ClickHouse"
}