{
  "name": "Tomasz Lee",
  "role_name": "Senior ML Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior ML Engineer with 9+ years of experience in AI and ML, specifically in building and deploying Large Language Models and multi-agent systems. Proficient in **Python** and comfortable with **AWS** for cloud computing, with a focus on **MLOps** and model optimization. Skilled in implementing innovative reinforcement learning strategies and experimental design. Demonstrated leadership abilities complemented by strong communication and collaboration skills, enabling effective teamwork across diverse projects. Additionally experienced in full-stack development, with a solid foundation in **ReactJS**, **NextJS**, **.NET**, **C#**, and microservices architecture.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Python** and **AWS** to develop and deploy machine learning models, enhancing predictive accuracy by **30%**.\nImplemented multi-agent systems and MLOps practices to streamline the model development lifecycle, improving efficiency by **25%**.\nDesigned and executed experimental designs for model optimization, increasing performance metrics by **15%**.\nUtilized **AI** governance frameworks to ensure compliance and ethical standards in AI development.\nCollaborated with cross-functional teams to integrate **cloud computing** solutions into existing workflows, enhancing scalability.\nProduced and maintained comprehensive documentation to facilitate knowledge sharing and collaboration among team members.\nInitiated weekly leadership meetings to enhance team communication and foster collaborative problem-solving, resulting in an accelerated project timeline by **20%**.\nAdvocated for the adoption of containerization technologies to ensure consistent environments across development and production.\nConducted research on reinforcement learning techniques, contributing to innovative strategies for model training.\nEngaged in continuous learning to stay updated on emerging trends in AI, ML, and large language models."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and optimized machine learning models using **Python** and advanced **AI** techniques, contributing to improved model accuracy by **20%**.\nImplemented **MLOps** practices to streamline the deployment and monitoring of models, resulting in a **15%** reduction in time to market.\nUtilized **AWS** for cloud computing solutions, ensuring scalable and reliable model hosting services with an uptick in system availability by **30%**.\nDesigned and deployed reinforcement learning strategies within multi-agent systems, driving a **25%** improvement in agent performance.\nLed initiatives in experimental design to test and validate AI models, leading to insights that enhanced decision-making processes.\nCollaborated with cross-functional teams to define system requirements, fostering communication and enhancing teamwork, which led to a **40%** improvement in project delivery time.\nManaged and containerized applications using Docker and Kubernetes, facilitating efficient model deployment and resource management.\nConducted training sessions and code reviews, promoting a culture of knowledge sharing and leveraging leadership skills to enhance team capabilities.\nAssured AI governance through ethical AI practices and compliance, mitigating risks associated with AI implementations."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** for implementing Machine Learning algorithms and model optimization to enhance system accuracy and performance by **15%**.\nCollaborated on the design and deployment of **MLOps** pipelines, leveraging **AWS** for scalable cloud computing solutions and ensuring efficient model training and deployment.\nDeveloped multi-agent systems to improve decision-making processes, resulting in a **30%** increase in operational efficiency.\nEngaged in AI governance practices to ensure compliance and ethical considerations in AI projects, contributing to robust project frameworks.\nLed a team in containerization strategies using **Docker**, which reduced environment setup time by **40%**.\nConducted experiments for reinforcement learning, achieving breakthrough results in model training success rate.\nEmployed experimental design techniques to effectively test and validate models, enhancing reliability and accuracy.\nDemonstrated strong communication and collaboration skills by leading cross-functional teamwork to align project goals and milestones.\nProvided technical leadership to junior engineers, fostering an environment of continuous learning and growth.\nParticipated in daily standups and project updates to ensure project timelines were met and aligned with organizational objectives."
    }
  ],
  "skills": " **Programming Languages**\n\t Python,\n\n **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices,\n\n **Frontend Frameworks**\n\t HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS,\n\n **API Technologies**\n\t RESTful API, GraphQL,\n\n **Serverless and Cloud Functions**\n\t AWS, Azure,\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB,\n\n **DevOps**\n\t CI/CD pipelines, containerization,\n\n **Cloud & Infrastructure**\n\t cloud computing,\n\n **Other**\n\t AI, ML, Large Language Models, MLOps, multi-agent systems, reinforcement learning, model optimization, experimental design, AI governance, leadership, communication, collaboration, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Redux",
  "apply_company": "Genesys"
}