{
  "name": "Mariusz Jan Skobel",
  "role_name": "Automation Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Automation Engineer with 10+ years of experience in delivering high-performance software solutions. Proficient in **PowerShell**, **Python**, **Bash**, and **Git**, demonstrating expertise in automating processes and improving operational efficiency. Skilled in managing and deploying cloud infrastructure on **Azure** using tools like **Ansible**, **Terraform**, and **DSC**. Experienced in leveraging **Active Directory** and **Microsoft 365** for system integration and user management, and adept at utilizing **Windows Server** for reliable service delivery. Strong problem-solving abilities complemented by a commitment to detailed **technical documentation** and effective collaboration in a team setting.\nAdditionally, experienced in developing AI/ML capabilities within enterprise platforms using technologies like **Node.js**, **FastAPI**, **Django**, and cloud services on **Azure** and **AWS**. Proven background in microservices architecture, event-driven systems, and CI/CD automation, emphasizing secure and maintainable solutions compliant with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about building impactful automation solutions that drive real-world change.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Automation Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Design and maintain automation scripts using **PowerShell**, **Bash**, and **Python** to streamline operational tasks and improve system efficiency across **Azure** and Microsoft 365 environments.\n• Implement infrastructure as code strategies with **Terraform** and **Ansible**, ensuring consistent deployment and management of resources within **Windows Server** settings.\n• Manage and automate Active Directory operations, including user provisioning and access control, enhancing security and compliance within the organization.\n• Develop and integrate automation solutions to monitor and manage incidents using **FreshService** and **ServiceNow**, reducing response times by up to **30%**.\n• Collaborate in the development of technical documentation, providing clear guidelines and processes for automation procedures and scripts, ensuring team alignment and knowledge sharing.\n• Solve complex technical problems, employing analytical skills to diagnose issues with **Microsoft 365** services, resulting in improved system reliability and user satisfaction.\n• Conduct training sessions to upskill team members on **PowerShell**, automation best practices, and efficient incident management workflows, contributing to a more self-sufficient IT team.\n• Successfully lead the transition of manual processes to automated workflows, realizing a **20%** reduction in operational costs through enhanced efficiency and system reliability.\n• Maintain version control of automation scripts and infrastructure code using **Git**, ensuring traceability and collaborative development practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented **PowerShell** and **Bash** scripts to automate system administration tasks, resulting in a **30%** reduction in manual interventions and faster deployment cycles.\nUtilized **Git** for version control in collaboration with cross-functional teams, ensuring seamless integration and deployment of automation solutions.\nDeveloped and maintained configuration management using **Ansible** and **Terraform**, achieving consistent environments across **50+** servers, thus minimizing configuration drift.\nLeveraged **Azure** services for cloud automation, improving resource management and cost efficiency by **25%** through optimized provisioning strategies.\nConducted technical documentation of automation processes and system configurations, facilitating knowledge transfer and quick onboarding procedures for new team members.\nConfigured and managed **Active Directory** for user access control, ensuring compliance with organizational security policies for over **1,000** user accounts.\nStreamlined incident response workflows using **ServiceNow** and **FreshService**, reducing resolution time by **15%** through proactive monitoring and ticketing automation.\nResolved complex technical issues through effective problem-solving techniques, leading to a **40%** increase in system uptime and improved service reliability.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **PowerShell** and **Bash** scripting to automate deployment processes and streamline management workflows on **Windows Server** environments, significantly reducing manual intervention by **70%**.\nDeveloped automation scripts for configuration management using **Ansible**, ensuring consistent server provisioning and updates across **Microsoft 365** and **Azure** platforms, improving operational efficiency by **60%**.\nImplemented Infrastructure as Code (IaC) with **Terraform**, deploying scalable cloud resources on **Azure**, and reducing setup time for new environments by **80%**.\nManaged user identities and access control through **Active Directory**, facilitating seamless user management and increased security compliance across organizational systems.\nCreated and maintained technical documentation for automated processes and workflows, enhancing team knowledge and enabling faster onboarding of new team members.\nCollaborated with cross-functional teams to troubleshoot system issues, leveraging advanced **problem-solving** techniques to resolve incidents effectively and maintain high system uptime.\nEffective use of **Git** for version control and management of automation scripts, ensuring consistent code quality and facilitating team collaboration on shared projects.\nConducted regular audits and reporting on automation efficiencies and system performance, providing actionable insights that led to additional optimizations in workflows and automation strategies.\nLeveraged **FreshService** and **ServiceNow** platforms for ticketing and incident management, ensuring timely resolution of automation-related issues and enhancing service quality."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Bash, PowerShell, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Ansible, Terraform\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Windows Server, Active Directory, Microsoft 365\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Docker Compose, FreshService, ServiceNow, Problem Solving, Technical Documentation"
}