{
  "name": "Tomasz Lee",
  "role_name": "Senior Operations Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Operations Engineer with 9+ years of experience in cloud infrastructure and application development. Proficient in **AWS**, **Terraform**, **Ansible**, **Kubernetes**, **GitLab CI**, **Helm**, **Argo CD**, **Prometheus**, and **Grafana**, ensuring effective deployment and monitoring of applications. Strong background in microservices architecture, with a focus on incident response and security measures to enhance system reliability. Experienced in leading cross-functional teams to implement scalable solutions and optimize performance using both frontend and backend technologies like **ReactJS**, **NextJS**, **.NET**, and **C#**, while leveraging tools such as **Apache Kafka**, **RabbitMQ**, and **Redis** to drive seamless data flow. Committed to delivering high-quality projects on time and streamlining operations for continuous improvement.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Operations Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **AWS** services to deploy and manage cloud infrastructure, enhancing system reliability and performance by **30%**.\nImplemented infrastructure as code using **Terraform** to provision and manage resources, improving deployment efficiency and consistency across environments.\nAutomated configuration management processes using **Ansible**, reducing setup times by **40%**.\nManaged container orchestration with **Kubernetes**, facilitating scalable and resilient application deployments.\nDesigned CI/CD pipelines with **GitLab CI**, ensuring seamless integration and delivery, reducing lead time to production by **25%**.\nDeveloped and maintained Helm charts for efficient application packaging and deployment in Kubernetes clusters.\nLeveraged **Argo CD** for GitOps workflows, providing enhanced visibility and control over application deployments.\nMonitored system performance and health using **Prometheus** and **Grafana**, enabling proactive incident response and reducing downtime by **15%**.\nImplemented logging and monitoring solutions with **CloudWatch** to ensure robust incident response strategies and security posture.\nLed security initiatives ensuring applications met compliance requirements and established protocols for incident response."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented infrastructure as code using **Terraform** to provision and manage AWS resources, enhancing deployment efficiency by **40%**.\nAutomated configuration management with **Ansible**, reducing setup time for new environments by **50%**.\nDeployed containerized applications using **Kubernetes**, ensuring high availability and scalability in production environments.\nEstablished robust continuous integration and continuous deployment (CI/CD) processes utilizing **GitLab CI** and **Argo CD**, enhancing deployment reliability with a **25%** reduction in downtime.\nMonitored system performance and reliability with **Prometheus** and **Grafana**, allowing for proactive incident response and reduced incident resolution time by **20%**.\nSet up AWS monitoring services like **CloudWatch** for real-time performance insights, improving system notification thresholds for quicker response times.\nImplemented security best practices across all cloud services, adhering to compliance standards and conducting regular security audits.\nDeveloped and executed incident response strategies, minimizing potential downtime and ensuring swift recovery from outages.\nCollaborated with cross-functional teams to define operational policies and best practices for system management.\nProvided technical mentorship to junior engineers, enhancing team capabilities and promoting continuous learning."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Leveraged **AWS** cloud services to enhance system scalability and reliability, resulting in a 30% reduction in operational costs.\n• Employed **Terraform** for infrastructure as code which minimized deployment time by 25%. \n• Utilized **Ansible** for configuration management, achieving consistent server setups across **50+** instances.\n• Implemented **Kubernetes** for container orchestration, improving application availability and performance by **15%**.\n• Developed CI/CD pipelines with **GitLab CI**, facilitating automated testing and deployment processes, reducing time to production by **40%**.\n• Managed application releases using **Helm** and monitored system health through **Prometheus** and **Grafana**, ensuring a robust monitoring solution.\n• Responded to security events and incidents, improving response time by **50%** and reinforcing overall system security posture.\n• Created incident response plans and conducted drills which enhanced team preparedness for potential outages.\n• Collaborated with cross-functional teams during daily standups, ensuring alignment and swift resolution of operational issues.\n• Produced technical documentation and knowledge transfer sessions that improved team understanding of system operations and maintenance."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, Redux\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tTerraform, Ansible, Kubernetes, GitLab CI, CI/CD pipelines, Helm, Argo CD, Prometheus, Grafana, CloudWatch\n\n  **Cloud & Infrastructure**\n\tAWS, Azure\n\n  **Other**\n\tGit, GitHub, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, Security, Incident Response",
  "apply_company": "Pagestreet"
}