{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior QA Engineer with over 13 years of hands-on experience in automation and software quality assurance, specializing in **Selenium**, **Playwright**, and cloud testing tools like **BrowserStack** and **SauceLabs**. Expert in writing and executing test cases, automated testing frameworks, and CI/CD integration using **Gitlab** to ensure high-quality software delivery. Proficient in leveraging **Python** and **Django** for developing test scripts and facilitating automation processes.\n\nDemonstrated leadership and teamwork skills, with a strong ability to communicate effectively across multidisciplinary teams. Experienced in adhering to compliance-driven development standards, ensuring solutions align with industry best practices. Background in building reliable, high-performance applications in both the healthcare and financial sectors, including deploying cloud-native applications on **AWS**. Passionate about improving software quality and efficiency through innovative testing strategies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and implemented comprehensive **QA** strategies to enhance the overall quality of applications built with **Python**, ensuring high reliability across **Django** frameworks and compliance with industry standards.\n- Utilized **Selenium** and **Playwright** for automation testing, significantly improving test coverage and reducing manual testing time by **30%**.\n- Led testing efforts for web and mobile applications, focusing on collaboration tools like **Gitlab** to streamline workflows and increase deployment efficiency by **25%**.\n- Conducted thorough regression testing of applications deployed on **AWS**, ensuring consistent performance and safeguarding against production issues.\n- Collaborated with cross-functional teams to facilitate effective communication, driving project timelines and delivering features faster with improved teamwork.\n- Implemented automated test frameworks using **BrowserStack** and **SauceLabs** for real device testing across multiple environments, enhancing the robustness of releases.\n- Provided leadership in the QA team, mentoring junior engineers and fostering a culture of excellence and continuous improvement.\n- Designed and ran performance tests to benchmark applications, achieving a **15%** increase in load handling capacity and user satisfaction ratings.\n- Created detailed documentation of testing processes and outcomes, facilitating better understanding and communication of QA results to stakeholders.\n- Ensured rigorous testing of CI/CD integration with **AWS**, minimizing release failures and achieving a deployment success rate of **98%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Led QA automation initiatives by developing and executing test scripts using **Selenium** and **Playwright**, ensuring comprehensive test coverage across applications.\nImplemented robust QA strategies for **Python** (version 3.9) applications built on **Django**, enhancing overall quality and stability in the deployment process.\nCollaborated with cross-functional teams to communicate testing results and coordinate with software engineering to resolve defects within **GitLab**, achieving a **30%** reduction in open issues.\nUtilized cloud testing services such as **BrowserStack** and **SauceLabs** to enhance testing capabilities across multiple browsers and devices, resulting in improved user experience metrics by **25%**.\nChampioned team collaboration and communication by organizing QA workshops and knowledge-sharing sessions, fostering a culture of continuous improvement and technical excellence among 15 engineers.\nAutomated regression testing for critical financial applications, decreasing testing time by **40%** and allowing for more frequent releases.\nDeveloped and maintained test documentation and reports to streamline processes and ensure compliance with QA standards, contributing to better project visibility for stakeholders.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted automated testing strategies using **Selenium** and **Playwright** to ensure high-quality software delivery for a global e-commerce platform.\nLed QA initiatives and collaborated with development teams employing **GitLab** CI/CD integration to streamline deployment processes and improve application reliability.\nUtilized **AWS** services for test environment provisioning and management, ensuring scalability and cost-effectiveness in testing activities.\nExecuted rigorous test plans and maintained thorough documentation, ensuring compliance with QA standards and effectively communicating results to stakeholders.\nImplemented cross-browser testing using **BrowserStack** and **SauceLabs**, achieving over **90% test coverage** across various devices and browsers.\nEnhanced existing automation frameworks with **Django** and **Python** scripts, reducing manual testing time by **35%** and increasing efficiency in the QA process.\nMentored junior QA team members, fostering a culture of continuous learning and improvement, while promoting teamwork and effective communication within the team.\nUtilized leadership skills to drive QA project progress, ensuring timely delivery of quality software aligned with business goals and user expectations.\nStandardized best practices for automation testing, leading to improved defect detection rates and overall software quality on web and mobile applications."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython\n\n  **Backend Frameworks:**\n\tDjango\n\tFastAPI\n\tFlask\n\n  **Frontend Frameworks:**\n\tJavaScript/TypeScript\n\tReact\n\tVue\n\tAngular\n\n  **API Technologies:**\n\t\n\n  **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n  **Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\n  **DevOps:**\n\tDocker\n\tKubernetes\n\n  **Cloud & Infrastructure:**\n\tAWS: ECS\n\tAWS: RDS\n\tAzure: App Services\n\tAzure: SQL Database\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n  **Other:**\n\tQA\n\tAutomation\n\tSelenium\n\tBrowserStack\n\tSauceLabs\n\tPlaywright\n\tGitLab\n\tLeadership\n\tCommunication\n\tTeamwork\n\tMLflow\n\tAirflow\n\tKubeflow\n\tGitHub Actions\n\tGitLab CI/CD\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n",
  "apply_company": "Founderful"
}