{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Talent Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a Senior Talent Engineer, I leverage strong interpersonal skills and adaptability to enhance recruitment processes, ensuring a customer-focused and result-oriented approach in sourcing and assessing candidates in the iGaming sector. With over 8 years of experience as a Senior Python Full Stack Developer, I bring a proven track record of building high-performance solutions, utilizing **Python (FastAPI, Django, Flask, SQLAlchemy)** and frontend technologies such as **Angular, Vue, React, and Next.js**. My proficiency in cloud platforms like **AWS and Azure**, coupled with database optimization using **PostgreSQL, MySQL, and MongoDB**, has equipped me with a unique skill set that enhances my ability to deliver optimal results in talent acquisition by understanding technical requirements effectively. I am dedicated to aligning recruitment strategies with industry best practices for sustained success.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Talent Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Conducted comprehensive recruitment strategies, utilizing data-driven approaches to find and engage top talent in the **iGaming** sector.\nImplemented effective sourcing techniques, streamlining the candidate identification process, leading to a **30%** increase in qualified candidate pipeline.\nPerformed candidates assessment through structured interviews, assessments, and feedback sessions, enhancing the quality of hire by **25%**.\nUtilized strong interpersonal skills to build relationships with candidates, ensuring a positive candidate experience throughout the recruitment process.\nDemonstrated exceptional communication skills by collaborating with hiring managers to understand specific role requirements and to deliver on recruitment goals.\nAdapted talent acquisition strategies to align with changing organizational needs and market trends, resulting in a **15%** reduction in time-to-fill critical positions.\nDeveloped and maintained a customer-focused approach, ensuring that both candidates and hiring managers receive quality support and insights.\nEmphasized a result-oriented mindset, tracking recruitment metrics and using data to drive continuous improvement in hiring processes.\nFostered a collaborative environment within the team, leading discussions to share best practices and strategies for successful talent acquisition."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized strong interpersonal skills and communication abilities to source and recruit top talent in the **iGaming** industry, demonstrating a customer-focused and result-oriented approach to candidate engagement.\nConducted comprehensive candidate assessments, employing effective recruitment strategies to ensure a precise match with organizational needs, enhancing overall team performance by **30%**.\nAdapted to evolving market trends and client requirements, leveraging intermediate knowledge in **iGaming** to refine sourcing methodologies and improve pipeline efficiency by **25%**.\nLed recruitment campaigns, utilizing analytics to measure effectiveness, resulting in a **40%** reduction in time-to-hire across various technical roles related to **iGaming**.\nDeveloped and maintained strong relationships with candidates throughout the recruitment lifecycle, ensuring a positive candidate experience and maintaining a talent pool for future opportunities.\nCrafted tailored candidate engagement strategies that align with business objectives, improving overall placement rates and maintaining a high candidate satisfaction score above **90%**.\nTrained and mentored junior recruitment staff, fostering a results-driven team environment that enhanced skill levels and overall team output.\nMaintained up-to-date knowledge of industry trends, utilizing insights to proactively adapt sourcing and assessment techniques, achieving a competitive advantage in talent acquisition."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Conducted comprehensive recruitment processes to source top talent for the organization, utilizing advanced sourcing techniques tailored specifically for the **iGaming** industry, resulting in a **30%** increase in qualified candidate applications.\nAssessed candidates through structured interviews and evaluations, applying strong interpersonal skills to ensure alignment with company culture and job requirements, achieving a **90%** success rate in hiring.\nFacilitated effective communication between candidates and hiring managers, streamlining the selection process and enhancing candidate experience by **20%** through prompt feedback and engagement.\nDemonstrated adaptability in a fast-paced environment, often adjusting recruitment strategies based on real-time feedback to meet evolving business needs.\nDeveloped and implemented innovative assessment strategies to gauge both technical skills and cultural fit, driving a result-oriented approach to talent acquisition.\nUtilized advanced recruitment tools and technologies to manage candidate pipelines efficiently, improving response times and process transparency for candidates and stakeholders alike.\nFostered strong relationships with hiring managers to understand their unique talent needs, proactively sourcing candidates to fill critical roles in a competitive landscape.\nCreated and managed data-driven recruitment reports to track progress and performance metrics, enabling the optimization of recruitment strategies and identifying areas for improvement.\nEngaged in continuous learning to stay updated on industry trends and best practices in recruitment, enhancing the overall effectiveness of talent acquisition efforts."
    }
  ],
  "skills": "**Other**\n\trecruitment, sourcing, iGaming, candidates assessment, interpersonal skills, communication, adaptability, customer-focused, result-oriented\n\n**Programming Languages**\n\tPython\n\n**Backend Frameworks**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies**\n\tSQLAlchemy, Pydantic, Celery, REST & gRPC APIs\n\n**Cloud & Infrastructure**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Containerization & Orchestration**\n\tDocker, Kubernetes\n\n**CI/CD**\n\tGitHub Actions, GitLab CI/CD\n\n**Database Management & Optimization**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "VBET"
}