{
  "name": "Rei Taro",
  "role_name": "Senior Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with over 10 years of experience in developing high-performance user interfaces using **React**, **Typescript**, and state management frameworks like **Redux**. Proficient in leveraging modern web technologies including **WebGL** for real-time graphics and **PostGIS** for spatial queries to enhance application functionality. Expertise in collaborating within agile teams utilizing tools such as **Git**, **Github**, **Slack**, and **Shortcut** for version control and project management. Proven ability to integrate AI capabilities and data analytics solutions, including **Redshift**, **BigQuery**, **Snowflake**, and **Databricks**, into frontend applications. Recognized for developing comprehensive documentation, testing protocols, and performance profiling to ensure robust and scalable application delivery in high-traffic environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **React** and **Typescript** to create dynamic, user-friendly frontend applications, resulting in a **30%** increase in user engagement.\nImplemented state management solutions using **Redux**, improving data flow efficiency and reducing code complexity by **25%**.\nCollaborated with AI teams to integrate intelligent features into applications, enhancing user experience and functionality.\nOptimized performance through testing and profiling techniques, reducing load times by an average of **15%** across key web pages.\nEngaged with **PostGIS**, **S2**, and **H3** for spatial data management, enabling the development of innovative location-based services.\nLeveraged cloud data warehousing solutions such as **Redshift**, **BigQuery**, and **Snowflake** for enhanced data processing capabilities.\nUtilized **Databricks** for big data analytics, streamlining workflows for data integration and reporting purposes.\nEmployed version control and collaborative tools like **Git** and **Github** to effectively manage codebase and documentation, ensuring high-quality delivery of projects.\nFacilitated communication and project management through platforms like **Slack** and **Shortcut**, promoting team efficiency and project transparency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **React** and **Typescript** to develop high-performance user interfaces, enhancing user experience and engagement across various platforms.\nImplemented state management solutions with **Redux** to optimize data handling in complex applications, improving frontend responsiveness by **30%**.\nCollaborated with backend teams to ensure seamless integration of APIs, utilizing tools such as **PostGIS** and **BigQuery** for effective spatial data management and querying.\nConducted unit and integration testing to maintain code quality, achieving **95%** test coverage and reducing bugs reported in production.\nDeveloped comprehensive documentation on system architecture and API usage to ensure clarity and facilitate onboarding of new developers, resulting in a **20%** reduction in ramp-up time.\nEmployed version control using **Git** and collaborative platforms like **Github** to enhance teamwork and code management efficiency.\nActively participated in code reviews and profiling to improve application performance, contributing to an **up to 40%** increase in application load speed.\nUtilized project management tools such as **Slack** and **Shortcut** to streamline communication and manage development tasks effectively."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Leveraged **React** and **Typescript** to develop interactive user interfaces, enhancing usability and engagement across the platform.\nCollaborated with backend teams to integrate real-time data feeds, utilizing **WebSockets** and extensive API documentation to ensure seamless data exchange.\nDeveloped and maintained comprehensive testing protocols for frontend applications using **Git** version control and **Github** for versioning and collaborative development.\nUtilized **Redux** for state management, improving application performance and scalability with a focus on **AI** enhancements to optimize user experiences.\nDocumented technical processes and project progress effectively in **Slack** and **Shortcut**, ensuring alignment with team objectives and streamlined communication.\nIncorporated robust performance profiling techniques to enhance application efficiency and responsiveness, achieving a user satisfaction rating increase of **15%** post-deployment.\nImplemented visualization tools with **WebGL** to present complex data dynamically, leading to an increase in analytics engagement by **20%**.\nMigrated legacy systems to utilize **PostGIS** for spatial data handling, improving data retrieval speeds by **30%** and supporting advanced geospatial queries."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, Typescript\n\n**Frontend Frameworks**\n\tReact\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, PostGIS, Redshift, BigQuery, Snowflake, Databricks\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, WebGL, Kafka, Profiling, Testing, Documentation, Slack, Shortcut",
  "apply_company": "CARTO"
}