{
  "name": "Tomasz Lee",
  "role_name": "Senior Substation Design Engineer (Electrical)",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Substation Design Engineer with 9+ years of experience in substation physical design and advanced electrical engineering principles. Proficient in **AutoCAD**, **MicroStation**, and **Bentley Substation** for robust design and layout of substations, with expertise in grounding analysis, bus design, equipment configuration, and relay coordination. Demonstrated ability in implementing control schemes and integrating **SCADA** and substation automation principles. Renowned for exceptional communication skills, project leadership, and mentoring abilities, driving teams to successful project completion while maintaining high-quality standards.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Substation Design Engineer (Electrical)",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **AutoCAD** and **MicroStation** to create detailed substation physical design layouts, ensuring compliance with industry standards.\nLed the **grounding analysis** and **bus design**, achieving a 15% reduction in project costs through optimized configurations.\nConfigured equipment for substation projects, enhancing functionality and performance in line with regulatory requirements.\nConducted **relay coordination** studies to ensure reliability of system components, improving safety by 20%.\nDeveloped and analyzed **control schemes** to monitor and control substation operations effectively.\nImplemented **SCADA** systems that streamlined operations and improved operational efficiency in control processes by 30%.\nApplied principles of **substation automation** to design systems that reduce downtime and maintenance costs.\nEnhanced communication skills through cross-departmental collaboration, positively impacting project timelines by 25%.\nTook on project leadership roles, mentoring junior engineers and establishing best practices in electrical design.\nAchieved successful project completions on time and within budget for over **9** major substation projects, demonstrating strong project management capabilities."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Led the design and development of substation physical projects, utilizing **AutoCAD** and **MicroStation** to ensure precision in grounding analysis and bus design.\n• Managed equipment configuration and relay coordination for over 5 high-voltage substations, enhancing reliability and safety standards.\n• Developed comprehensive control schemes that improved substation automation efficiency by 20%.\n• Collaborated with cross-functional teams to implement **SCADA** systems, facilitating real-time monitoring and improved operational control.\n• Provided mentorship and training to junior engineers, leading to a 25% increase in team performance and skills development.\n• Conducted thorough design reviews and analysis, adhering to industry standards and best practices for substation engineering.\n• Demonstrated strong communication skills by presenting project updates and technical solutions to stakeholders, ensuring alignment and understanding.\n• Spearheaded project leadership initiatives, managing timelines and resources effectively to ensure on-time delivery of substation design projects.\n• Implemented advanced tools and techniques for grounding analysis, resulting in a remarkable 30% reduction in potential hazards and risks."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Led the design and implementation of substation physical designs, ensuring compliance with industry standards and enhancing safety protocols.\nConducted grounding analysis to provide reliable power systems, improving system reliability by **15%**.\nUtilized **AutoCAD** and **MicroStation** for drafting schematics and layouts, streamlining the design process by **25%**.\nConfigured substation equipment including relays and control schemes to optimize performance and functionality.\nCollaborated on SCADA systems and substation automation principles, enhancing real-time monitoring capabilities.\nManaged relay coordination to minimize downtime and ensure system integrity during operations.\nProvided mentorship to junior engineers and conducted training sessions to promote knowledge sharing and professional growth.\nParticipated in project leadership roles, ensuring projects were delivered on time and within budget by focusing on efficient resource allocation.\nCommunicated effectively with cross-functional teams to align project goals and updates, improving stakeholder engagement.\nPerformed equipment configurations and design evaluations using **Bentley Substation** tools to enhance design accuracy and efficiency."
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n\t**Backend Frameworks:** NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n\t**API Technologies:** RESTful API, GraphQL\n\n\t**Databases:** MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n\t**Cloud & Infrastructure:** AWS, Azure\n\n\t**DevOps:** CI/CD pipelines\n\n\t**Other:** Git, GitHub, Python, Redux, UX/UI Design, Blockchain: Solidity, Ether.js, Web3.js, Ethereum\n\n\t**Serverless and Cloud Functions**: (none)\n\n\t**Messaging & Caching:** Apache Kafka, RabbitMQ, Redis\n\n\t**Testing Tools:** NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\n\t**Project Management Skills:** AutoCAD, MicroStation, Bentley Substation, substation physical design, grounding analysis, bus design, equipment configuration, relay coordination, control schemes, SCADA, substation automation principles, communication skills, project leadership, mentoring skills"
}