{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Python Coding Specialist - AI Trainer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Python Coding Specialist with over 13 years of experience in software architecture, algorithms, and data structures, particularly focused on building high-performance applications in AI and ML domains. Highly skilled in **Python**, proficient in designing **RESTful APIs**, and adept in both frontend and backend development using **React**, **Node.js**, and **Django**. Extensive experience with asynchronous programming techniques and implementing microservices architecture.\nProficient in deploying and maintaining **cloud infrastructure** on **AWS** and **Azure**, ensuring scalability and efficiency of AI-driven systems. Strong focus on secure coding practices and debugging distributed systems within healthcare and financial industries, adhering to compliance standards such as HIPAA and PCI DSS. Excellent technical writing skills complemented by a background in metacognitive communication, ensuring clarity in complex technical concepts.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Python Coding Specialist - AI Trainer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** for developing robust algorithms and data structures, enhancing software architecture in diverse applications related to AI training.\nImplemented **object-oriented design** principles to craft efficient and maintainable code, contributing to the advancement of secure coding practices.\nEngaged in technical writing and communication, effectively documenting complex code and procedures for clear understanding among team members and stakeholders.\nDesigned and developed **RESTful API** services, ensuring seamless integration between frontend and backend systems with a focus on performance and scalability.\nApplied **asynchronous programming** techniques to optimize the responsiveness of applications, leading to an enhanced user experience in AI-driven platforms.\nEmployed **debugging distributed systems** methodologies, resulting in a **25%** reduction in system errors reported during production.\nContributed to the introduction of innovative solutions in training AI models by leveraging extensive experience in systems programming.\nParticipated in collaborative team meetings to facilitate metacognitive communication, fostering a culture of knowledge sharing and continuous improvement.\nDeveloped and optimized software solutions that meet stringent requirements while maintaining high performance and security standards in line with industry best practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** in developing efficient algorithms and data structures to enhance backend functionalities and optimization processes.\nEmployed **software architecture** principles to design scalable and maintainable systems, ensuring robust solutions for high-demand applications.\nImplemented asynchronous programming techniques to optimize performance in distributed systems, facilitating faster processing and responsiveness.\nDeveloped RESTful APIs to integrate various components, enabling seamless communication between frontend and backend services.\nApplied secure coding practices in all layers of development to safeguard sensitive financial data against breaches and vulnerabilities.\nConducted thorough debugging of distributed systems, leveraging logging and monitoring tools to enhance system reliability and performance.\nComposed technical documentation and guides to facilitate knowledge transfer among team members and enhance learning.\nParticipated in metacognitive communication strategies, promoting reflective thinking and collaborative problem-solving within the development team.\nCreated innovative solutions for **cloud infrastructure** management using **Azure**, ensuring efficient deployment and scalability of AI models.\nLeveraged **machine learning** techniques using **scikit-learn** and **XGBoost** for data analysis and predictive modeling, targeting trends with a measurable success rate of over **75%** in accuracy.\nDelivered impactful frontend development using **React (18)** and **Vue 3**, enhancing user interfaces and achieving a responsiveness score of **95%** on user testing metrics."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and optimized scalable backend services for applications primarily using **Python** and maintained *high quality* through **Object-Oriented Design** and **Algorithms**.\n- Implemented robust **RESTful APIs** to serve client requests efficiently, leveraging **Data Structures** to enhance data handling and processing speed.\n- Employed **Asynchronous Programming** techniques to improve application responsiveness, reducing latencies significantly and enhancing user experience.\n- Conducted thorough debugging of **Distributed Systems**, ensuring reliability and performance standards were met under high-demand conditions.\n- Authored clear and structured technical documentation, showcasing proficiency in **Technical Writing** and facilitating knowledge transfer.\n- Collaborated in designing backend architectures that supported secure coding practices, integrating **Secure Coding Practices** to protect sensitive data in applications.\n- Developed and maintained automated tests, applying *data structure* algorithms to improve code reliability and correctness, resulting in **90% test coverage**.\n- Led projects utilizing **Cloud Infrastructure** to ensure deployment efficiency and system robustness, achieving a **99.9% uptime** for applications.\n- Actively participated in code reviews, enhancing code quality and fostering effective **Metacognitive Communication** skills across teams.\n- Participated in system-wide architectural decisions, successfully implementing features that upheld best practices in **Software Architecture** for future scalability."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks**\n\tReact, Vue, Angular\n\n **API Technologies**\n\tRESTful API\n\n **Serverless and Cloud Functions**\n\tAWS: ECS, Lambda, Azure: App Services\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other**\n\tAlgorithms, Data Structures, Software Architecture, Frontend Development, Backend Development, Systems Programming, Asynchronous Programming, Memory Management, Object-Oriented Design, Secure Coding Practices, Debugging Distributed Systems, Technical Writing, Metacognitive Communication, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}