{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Quality Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a dedicated Senior Quality Engineer with 8+ years of experience, I excel in **Test Automation**, **Exploratory Testing**, and **Risk-based Testing** to drive efficiency in software delivery. Proficient in **Python**, I leverage my expertise in CI/CD processes using **GitHub Actions** and **Jenkins** to enhance testing workflows. Familiar with cloud services like **AWS**, **GCP**, and **Azure**, I ensure robust test strategies within **Distributed Systems**. My strong background in **Kubernetes** and my adaptability in diverse environments further enable seamless collaboration and mentorship within cross-functional teams. I am passionate about implementing effective testing methodologies while maintaining clear communication to achieve high-quality software solutions tailored to business objectives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Quality Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and executed comprehensive **test strategies** for Python-based applications in a **Kubernetes** environment, ensuring adherence to quality standards in various deployments across **AWS**, **Azure**, and **GCP**.\n- Integrated and optimized **CI/CD** pipelines using **GitHub Actions** and **Jenkins** to streamline automated testing and deployment processes, resulting in a **30%** reduction in release times.\n- Collaborated with cross-functional teams to facilitate **exploratory testing** and improve testing coverage, enhancing product quality and reliability across distributed systems.\n- Mentored junior engineers in **test automation** best practices, fostering a collaborative and supportive team environment.\n- Led risk-based testing initiatives to identify and prioritize high-risk areas in healthcare applications, ensuring compliance with **HIPAA**, **SOC 2**, and **ISO 27001** regulations.\n- Enhanced communication workflows and documentation practices to ensure all team members were aligned on quality expectations and development milestones.\n- Spearheaded the implementation of a robust testing framework using **Python** and integrated tools such as **Selenium** and **PyTest**, leading to a **40%** increase in testing efficiency for healthcare applications.\n- Promoted adaptability and agile practices within the team, resulting in improved responsiveness to project demands and changing requirements.\n- Conducted regular audits and reviews of testing processes to identify areas for improvement, implementing solutions that significantly reduced bug rates by **25%** in production.\n- Engaged in continuous learning and professional development, staying updated on industry trends in **distributed systems** and **test automation** to drive innovative testing solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Implemented **CI/CD** pipelines using **GitHub Actions** to automate testing and deployment processes, enhancing deployment frequency by **30%**.\n- Designed **test strategies** that leverage **Kubernetes** for managing test environments, increasing test coverage by **25%** in production-like settings.\n- Utilized **Python** for developing automated test cases and scripts, ensuring seamless integration with existing service architectures, which improved defect detection rates by **15%**.\n- Collaborated with cross-functional teams to optimize **test automation** efforts across **AWS** and **Azure**, enhancing coordination between development and testing phases.\n- Established best practices for **test automation** and **exploratory testing**, fostering a culture of quality and continuous improvement among team members.\n- Mentored junior engineers in **adaptability** and collaboration skills, leading to an improved team performance index by **20%**.\n- Conducted **risk-based testing** in distributed systems, prioritizing critical features, and ensuring significant risk mitigation for financial services.\n- Leveraged **Go** for developing performance testing tools that evaluated system scalability, resulting in improved system reliability metrics.\n- Enhanced test reporting using **Jenkins** integration with existing workflows, streamlining communication of testing outcomes with stakeholders.\n- Participated in code reviews and pair programming sessions that promoted knowledge sharing and enhanced team communication across the organization."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and implemented comprehensive **Test Strategies** for distributed systems, leveraging **Python** and **CI/CD** practices with **GitHub Actions** and **Jenkins** to ensure efficient and reliable software delivery, achieving a **30%** reduction in deployment times.\nExecuted **Exploratory Testing** and **Risk-based Testing** methodologies during the quality assurance processes, enhancing product quality and mitigating risks through thorough assessments across **AWS** and **Azure** environments.\nCollaborated with development teams to integrate **Test Automation** frameworks, utilizing tools like **Selenium** and custom **Python** scripts to streamline testing processes and reduce manual intervention by **50%**.\nDesigned and maintained automated test suites to ensure high performance in **distributed systems**, achieving a **40%** increase in test coverage and enabling quicker feedback loops.\nMentored junior quality engineers on best practices in **Test Automation**, enhancing team capabilities and fostering a culture of quality within the organization.\nAdapted to changing project requirements and communicated effectively with cross-functional teams to optimize testing processes and enhance collaborative efforts.\nEngaged in continuous learning and adaptation of emerging testing tools and techniques, ensuring the team's proficiency in modern QA practices and improving overall testing integrity.\nLed performance testing initiatives using tools like **Apache JMeter** and **Locust**, successfully identifying system bottlenecks and optimizing response times under peak workloads.\nEvaluated and integrated modern technologies like **Kubernetes** for efficient test environment management, promoting scalability and simplifying deployments in cloud environments like **GCP** and **AWS**.\nParticipated actively in code reviews and contributed to developing a robust culture of continuous improvement within the software development lifecycle."
    }
  ],
  "skills": "Programming Languages:\n\tPython, Go\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Test Automation, Exploratory Testing, Risk-based Testing, Distributed Systems, Test Strategy, Collaboration, Mentorship, Adaptability, Communication",
  "apply_company": "vCluster Labs"
}