{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Staff Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Staff Engineer with 13+ years of comprehensive experience in building scalable APIs and optimizing performance for high-performance applications in the healthcare and financial sectors. Proficient in **Ruby on Rails**, **Python**, **TypeScript**, and **AI/ML technologies**, with direct experience in both frontend and backend development using **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, and **Node.js**. \nDemonstrated expertise in developing AI-powered solutions that leverage **Knowledge Graphs** and **AI Gateways** for advanced analytics and automation, ensuring alignment with regulatory standards such as HIPAA and PCI DSS. Skilled in database design and distributed systems, with a strong foundation in mentoring technical teams and facilitating effective communication and collaboration. Acknowledged for contributions in deploying cloud-native systems on **AWS** and **Azure**, utilizing microservices and event-driven architectures, all while maintaining robust CI/CD pipelines.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Staff Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed scalable APIs using **Python** and **Ruby on Rails**, ensuring high performance and compliance with industry standards.\nLed performance optimization efforts for applications, leveraging **AI/ML technologies** to enhance data processing and decision-making capabilities.\nDesigned and executed database architectures, ensuring robust data design principles in support of both healthcare and fintech operations.\nMentored technical teams in best practices related to **Rust**, facilitating knowledge sharing and fostering a collaborative environment.\nImplemented distributed systems strategies, enabling fault-tolerant applications with effective resource management and scalability.\nCollaborated with cross-functional teams to integrate **Knowledge Graph** and **Language Server** capabilities, enhancing application intelligence and user experience.\nDelivered technical presentations to stakeholders, demonstrating project progress and aligning development with business needs.\nOptimized application performance through rigorous analysis and proactive troubleshooting, achieving improvements measured by a **30% reduction in response time**.\nEnhanced communication skills by facilitating workshops and team meetings focused on project alignment and collaboration across departments.\nGuided project planning efforts, ensuring timely delivery of features with a **100% success rate on delivery deadlines** in the last **12 months**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and optimized scalable APIs using **Python** and **Ruby on Rails** to enhance financial platform capabilities, achieving a **30%** increase in response times.\n• Leveraged **AI/ML technologies** and frameworks such as **scikit-learn** and **XGBoost** to implement advanced machine learning models for tasks like fraud detection, resulting in a **25%** reduction in false positives.\n• Collaborated across teams, utilizing strong communication skills to facilitate discussions on architecture design and technical mentorship in distributed systems development.\n• Architected and implemented robust and efficient database designs, improving data retrieval times by up to **40%** through effective indexing strategies and query optimization.\n• Engaged in performance optimization initiatives, regularly monitoring system metrics and conducting code reviews to ensure high-quality deliverables.\n• Designed and deployed **event-driven architectures** and message brokers such as **Kafka** and **RabbitMQ**, enhancing system scalability and reliability for operational workflows.\n• Spearheaded the integration of **AI Gateway** capabilities, facilitating seamless access to machine learning models across multiple applications.\n• Fostered collaboration within teams to create a **Knowledge Graph** that enhanced data relationships and insights used in decision-making processes, improving analytical outcomes by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered scalable APIs and optimized backend services for a global e-commerce platform leveraging **Ruby on Rails**, **Python (FastAPI, Django)**, and **Node.js (NestJS, Express)**, ensuring high availability, low latency, and robust performance across critical modules, such as checkout and order fulfillment.\nDeveloped intelligent AI/ML technologies integrated into applications, utilizing scikit-learn, LightGBM, and TensorFlow, to enhance product listings and improve conversion rates with real-time behavior analysis that led to a **20% increase** in user engagement.\nImplemented performance optimization strategies, harnessing **MongoDB**, **PostgreSQL**, and **Redis** for distributed data access, which resulted in **30% faster** response times for high-traffic e-commerce workflows.\nMentored team members on best practices for database design and scalable system architecture, fostering an environment of technical growth and collaborative problem-solving.\nCreated and maintained applications using **TypeScript**, **React (18)**, and **Vue 3**, ensuring a high-quality user experience across both web and mobile platforms.\nEnhanced application responsiveness and data access efficiency by implementing Redis caching for shopping cart sessions and product metadata, achieving a **40% reduction** in database load during peak hours.\nCollaborated effectively with cross-functional teams to implement controlled feature rollouts using **LaunchDarkly** and **Kubernetes**, enabling A/B testing and minimizing deployment risks.\nDesigned functionalities with a focus on language server integrations and automated workflows, streamlining processes aligned with user needs and platform goals.\nEnsured compliance with data protection regulations, applying RBAC and **OAuth 2.0** for secure user access, thereby safeguarding sensitive information and maintaining GDPR standards.\nCommunicated technical concepts clearly to team members and stakeholders, facilitating efficient collaboration within the software development lifecycle."
    }
  ],
  "skills": "Programming Languages:\n\tPython, TypeScript, Ruby, Rust\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Ruby on Rails\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tscalable APIs, AI Gateway\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, database design\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Nginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tAI/ML technologies, MLflow, Airflow, Kubeflow, performance optimization, Knowledge Graph, Language Server, technical mentorship, collaboration, communication skills, distributed systems"
}