{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Principal-level Individual Contributor (IC)",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Principal-level Full Stack Developer with 13+ years of experience in delivering high-performance applications across healthcare and financial industries. Proficient in **PHP**, **Java**, **C#**, **.NET**, and **ReactJS**, with a solid foundation in both frontend and backend development utilizing **Node.js**, **TypeScript**, and **AngularJS**. Experienced in building AI-driven solutions and automation frameworks, focusing on observability with tools such as **Grafana**, **Datadog**, and **New Relic**.\n\nExpert in deploying cloud-native systems on **AWS**, **Azure**, and **GCP**, and implementing infrastructure as code using **Terraform**. Well-versed in developing compliance-driven applications aligned with industry standards. Strong background in microservices architecture and CI/CD methodologies, complemented by a deep understanding of MLOps practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Principal-level Individual Contributor (IC)",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **PHP**, **Java**, and **C#** for designing and deploying scalable web applications as part of full-stack solutions, enhancing responsiveness and user experience.\nLeveraged **AWS**, **Azure**, and **GCP** for cloud services, implementing robust infrastructure management strategies to support application stability and scalability.\nImplemented advanced **AI** systems for intelligent data processing and user interaction automation, improving operational efficiency and decision-making accuracy.\nDeveloped CI/CD automation processes via **Terraform** and **Ansible**, streamlining deployment pipelines for multiple environments, resulting in a decrease of deployment errors by **30%**.\nIntegrated monitoring and observability tools such as **Grafana**, **Datadog**, and **New Relic**, enhancing system performance visibility and reducing incident response time by **25%**.\nDesigned and architected high-performance single-page applications with **ReactJS** and **AngularJS**, optimizing for **SEO** and accessibility standards, enhancing user engagement metrics by **40%**.\nLed the establishment of testing frameworks using **Postman**, **Jest**, and **Cypress** across the software development lifecycle, ensuring comprehensive test coverage and high code quality standards.\nFacilitated cross-disciplinary collaboration by mentoring team members on best practices in **cloud services**, **automation**, and **observability**, fostering a culture of innovation and continuous learning within the team.\nSpearheaded efforts to enhance web application security in alignment with industry standards, implementing advanced strategies to secure user data and transactions against evolving threats."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Node.js** (NestJS/Express) and **Python** (FastAPI, Django) to modernize core financial platforms with **microservices architecture**, significantly improving scalability and performance for processing over **1 million** transactions daily.\nDeveloped responsive front-end applications utilizing **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, employing **Redux Toolkit** and **Tailwind CSS** to enhance user experience for financial tools and admin panels, reaching **90%** user satisfaction in feedback surveys.\nEngineered real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, empowering operations teams with immediate insights into transactions and anomalies, achieving a **30%** reduction in response times for operational alerts.\nConceptualized and implemented a robust event-driven architecture with **Kafka**, **RabbitMQ**, and **Azure Service Bus**, facilitating asynchronous communication across critical workflows such as payments, alerts, and compliance, improving processing efficiency by **40%**.\nDesigned and built ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing, handling over **500TB** of data annually.\nCreated and deployed advanced machine learning models for fraud detection utilizing **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive identification of suspicious activities based on user behaviors and transaction patterns, reducing fraud incidents by **25%**.\nDeveloped ML pipelines for real-time credit scoring, churn prediction, and transaction classification, integrating model inference into backend services through **MLflow** and **Airflow**, improving forecasting accuracy by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Leveraged **PHP** and **Java** frameworks to develop and optimize high-performance backend services, ensuring application scalability and reduced latency.\n- Automated deployment processes using **Terraform** and **Ansible**, significantly increasing operational efficiency and reliability across both staging and production environments, achieving a **30% reduction** in deployment time.\n- Enhanced observability and monitoring strategies utilizing tools like **Grafana**, **Datadog**, and **New Relic**, leading to improved system reliability and a **25% decrease** in response time for critical service outages.\n- Implemented AI-driven solutions to enhance user experience and personalization using **AI** methodologies, resulting in a **15% increase** in user retention rates.\n- Developed responsive frontend applications with **ReactJS** and **AngularJS** while integrating **Typescript** for improved code quality and maintainability, achieving a **40% improvement** in developer productivity.\n- Designed scalable web applications on **AWS**, **Azure**, and **GCP**, ensuring the infrastructure is optimized for performance during peak traffic periods.\n- Orchestrated feature deployments using **NodeJS** and blue-green deployment strategies via **Kubernetes**, minimizing downtime during updates.\n- Collaborated in cross-functional teams to create a data-driven automation pipeline that reduced manual intervention by **50%**, improving overall project timelines and efficiency.\n- Conducted rigorous code reviews and maintained coding standards, driving improvements in code quality metrics and reducing technical debt across projects.\n- Championed the adoption of **WordPress** for scalable content management, enhancing site performance and user engagement metrics by **20%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, PHP, Java, C#, .NET, JavaScript/TypeScript, Typescript, NodeJS\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Symfony\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, AngularJS, ReactJS\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database, GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n **Other:**\n\tAutomation, AI, MLflow, Airflow, Kubeflow, Observability, Grafana, Datadog, New Relic, Nginx, Let’s Encrypt, Certbot, WordPress"
}