{
  "name": "Rei Taro",
  "role_name": "Data Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Data Engineer with over 10 years of experience in backend development and strong proficiency in SQL and **dbt**, leveraging **Snowflake** for data warehousing solutions and integration with **SAP** and **Salesforce** for enhanced business analytics. Expertise in the implementation of data visualization tools like **Power BI** to deliver actionable insights. Proven skills in version control using **Git** and CI/CD practices to streamline deployment processes. Recognized for strong teamwork and collaborative project delivery, having contributed to high-impact financial projects at industry leaders such as VISA, Sii Poland, and Reply Polska. Committed to designing and optimizing scalable backend systems and automation pipelines.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Data Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** to interact with databases effectively, ensuring accurate data retrieval and manipulation for analytics.\nImplemented **dbt** for data transformation, enhancing data quality and facilitating easier reporting processes.\nIntegrated with **Snowflake** to manage data warehousing solutions, optimizing storage and performance for large datasets.\nCollaborated with **SAP** and **Salesforce** to extract and integrate data from various sources, supporting comprehensive data analysis.\nDeveloped visualizations using **Power BI** to communicate insights and data-driven recommendations effectively.\nUtilized **Git** for version control, ensuring seamless collaboration and code management across the team.\nEnhanced deployment processes with **CI-CD** practices, achieving a deployment frequency of **5 times per week**.\nFostered **teamwork** by collaborating with cross-functional teams, addressing system integration challenges, and ensuring timely project completion."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Utilized **SQL** for efficient data querying and manipulation within various databases, ensuring accurate data reporting and analysis for internal stakeholders.\n• Built data transformation workflows using **dbt** to enhance data quality and consistency across the pipeline, achieving a reduction in processing time by **30%**.\n• Integrated **Snowflake** for scalable data warehousing solutions, enabling the team to handle a **50TB** increase in data storage without performance degradation.\n• Developed dashboards in **Power BI** for real-time data visualization, which improved decision-making speeds by **25%** and facilitated actionable insights.\n• Collaborated with **Salesforce** and **SAP** systems to ensure seamless data flow and integrity across platforms, enhancing user experience during the onboarding process.\n• Implemented version control using **Git** to manage code changes efficiently, resulting in a **40%** increase in team productivity and collaboration.\n• Established CI/CD pipelines to automate application deployment and minimize downtimes, achieving a deployment frequency of **3 times per week** through continuous integration strategies.\n• Fostered a culture of teamwork and cross-functional collaboration, successfully leading multiple projects to completion under tight deadlines while maintaining high quality standards."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **SQL** to construct and manage data pipelines, ensuring efficient data retrieval and integration across various platforms for analytics\nDeveloped data transformation workflows using **dbt** to enhance data quality and accuracy, leading to a **30%** reduction in data processing time\nLeveraged **Snowflake** for cloud-based data warehousing, achieving a **50%** improvement in report generation speed for stakeholders\nCollaborated with cross-functional teams to integrate data solutions with **SAP** and **Salesforce**, ensuring seamless data flow across systems\nEmployed **Power BI** for creating dynamic dashboards, providing actionable insights and visualizations that improved decision-making processes by **40%**\nManaged version control and collaborative development practices using **Git**, enhancing teamwork and project coordination across **5** major data projects\nImplemented CI-CD processes to automate deployment workflows, reducing manual effort and increasing code reliability in the data engineering lifecycle\nDemonstrated exceptional **teamwork** skills by actively participating in daily stand-ups and sprint planning, ensuring alignment on project goals and timelines."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, Snowflake\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, dbt, SAP, Salesforce, Power BI, teamwork"
}