{
  "name": "Tomasz Lee",
  "role_name": "Senior Frontend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Senior Frontend Engineer with 9+ years of experience in developing and implementing high-quality user interfaces. Proficient in **React**, **JavaScript**, **HTML**, **CSS**, and **SCSS**, with a solid understanding of **OOP** principles and an agile development environment. Adept at translating design concepts from **Figma** into responsive, dynamic web applications. Additionally, I possess experience in **.NET**, **C#**, and microservices architecture, ensuring a holistic approach to application development. Recognized for delivering optimized performance and maintaining seamless collaboration across teams to achieve successful project outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed engaging user interfaces utilizing **React** and **JavaScript**, ensuring a seamless user experience on the web-based customer management platform.\n• Optimized responsiveness and functionality using **HTML**, **CSS**, and **SCSS**, adhering to best practices in frontend development.\n• Spearheaded design collaboration with UX/UI designers through **Figma** to enhance platform aesthetics and usability, resulting in a **25%** increase in user satisfaction.\n• Improved application structure and performance by applying Object-Oriented Programming (**OOP**) principles, facilitating code reusability and scalability.\n• Employed Agile methodologies to streamline development processes and enhance team productivity, resulting in faster delivery and iteration.\n• Integrated robust data visualization features using D3.js and Three.js, enriching user interaction and insights.\n• Participated in regular code reviews and provided mentorship to junior developers, fostering a culture of continuous learning and improvement in the team.\n• Collaborated effectively in cross-functional teams, aligning frontend solutions with backend architectures and business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed interactive user interfaces using **React** and **JavaScript**, enhancing user experience by 25% through visually appealing designs with **Figma**.\n• Collaborated on the design and implementation of responsive web applications, utilizing **HTML**, **CSS**, and **SCSS** to ensure cross-browser compatibility and mobile responsiveness.\n• Engaged in Agile methodologies to streamline development processes, resulting in 30% faster project turnaround times.\n• Created custom style components that improved overall application performance and maintainability by 15%.\n• Conducted code reviews to enforce coding standards and best practices in **OOP**, contributing to a more robust codebase.\n• Collaborated closely with stakeholders to define UI/UX requirements and project timelines, ensuring timely project delivery.\n• Led training sessions for junior developers on using **React** effectively; fostered a culture of continuous improvement and shared knowledge within the team.\n• Implemented unit testing strategies to enhance code reliability, achieving a coverage rate of **85%**.\n• Utilized Agile project management tools to track development progress and ensure alignment with project goals."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **React**, **JavaScript**, **HTML**, and **CSS** to create dynamic and responsive user interfaces, enhancing user engagement by **30%**.\nEmployed **SCSS** for efficient styling, ensuring the maintainability and scalability of the codebase, contributing to a **15%** reduction in CSS file size.\nUtilized **Figma** to collaborate with designers, translating mockups into functional components, aligning closely with UX/UI best practices.\nApplied Object-Oriented Programming (**OOP**) principles to develop clean and efficient code, promoting reusability across the application.\nImplemented Agile methodologies in daily stand-ups and sprints to facilitate collaboration and streamline project workflows.\nMaintained a focus on delivering high-quality code through peer code reviews and adherence to established coding standards.\nContributed to cross-functional teams, effectively communicating project updates and technical requirements to stakeholders.\nProvided mentorship to junior developers, fostering a culture of continuous improvement and knowledge sharing within the team."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, TypeScript, Python, C#, OOP\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, HTML, CSS, SCSS, Figma\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Database Systems**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Agile",
  "apply_company": "SOFTSWISS"
}