{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior DevOps Engineer with 8 years of experience, I possess strong expertise in **AWS**, **Azure**, **Linux**, **Git**, **Jenkins**, and **CI/CD** methodologies, driving the deployment and automation of high-performance solutions in the healthcare and financial sectors. My solid foundation in **DevOps** practices enables me to build and manage scalable infrastructure, ensuring reliable performance and security across applications.\nI utilize **Ansible**, **Chef**, and **Kubernetes** for configuration management and orchestration, effectively implementing infrastructure as code. My proficiency in **Python** enhances my capability to develop and manage automation scripts, streamline workflows, and solve complex problem scenarios.\nIn addition to my technical skillset, I have a comprehensive understanding of networking principles and cloud services, which allows me to optimize system performance. I am adept at leading teams and fostering effective communication, contributing to project success through collaboration and knowledge sharing. My background in full-stack development with **React**, **Node.js**, **FastAPI**, and experience with **machine learning** pipelines further enriches my toolkit for developing innovative solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented enterprise-level DevOps pipelines utilizing **Jenkins**, **Git**, **Azure DevOps**, and **CircleCI**, enhancing deployment speed and reliability across **15+** environments.\nEngineered scalable infrastructure solutions using **AWS**, **Azure**, and **Kubernetes** (AKS/EKS), ensuring operational excellence and high availability through automation and monitoring.\nManaged and optimized configuration management using **Ansible** and **Chef**, resulting in a **30%** reduction in deployment time.\nDeveloped and maintained continuous integration and continuous deployment (CI/CD) processes, integrating automated testing, security scans, and version control across multiple projects, improving deployment frequency by **40%**.\nUtilized **Linux** for system administration and network configuration, ensuring seamless operations and high-performance environments.\nEnhancing application monitoring and logging capabilities through **ElasticSearch**, enabling real-time insights and proactive issue resolution.\nCollaborated cross-functionally with development and operational teams, promoting effective communication and knowledge sharing to drive project success.\nManaged network configurations and response protocols, ensuring optimal performance and security across cloud infrastructures.\nDeveloped robust scripting solutions in **Python** and advocated for infrastructure as code practices to automate routine tasks and enhance system reliability.\nApplied best practices in container orchestration with **OpenShift** and **Docker** to streamline application deployment and management processes.\nTrained junior team members on DevOps practices and tools, fostering a culture of continuous improvement and technical proficiency within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **DevOps** best practices and CI/CD methodologies using **Jenkins** and **Git**, enhancing deployment frequency by **30%** and reducing lead time for changes by **25%**.\nManaged **Linux** server environments to ensure high availability and performance of applications, achieving a **99.9%** uptime for critical financial services.\nAutomated configuration management and application deployment processes using **Ansible** and **Chef**, reducing setup time for new environments by **40%**.\nCollaborated with cross-functional teams to integrate networking solutions that support microservices, leading to a streamlined service architecture and improved system resilience.\nLeveraged **AWS** and **Azure** cloud services to deploy scalable solutions, optimizing resource utilization and achieving cost savings of **20%**.\nMonitored system performance and reliability metrics, applying troubleshooting techniques to resolve issues and improve overall productivity.\nPlayed a key role in implementing container orchestration tools like **Kubernetes** and **OpenShift**, automating application deployment and scaling processes.\nEmployed effective communication strategies to liaise between development and operations teams, ensuring alignment on project goals and delivery timelines."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Designed and optimized backend services for a robust cloud infrastructure using **Python** and **Node.js**, ensuring effective **DevOps** practices for high availability, low latency, and scalability across multiple microservices.\n- Implemented CI/CD methodologies using **Jenkins** and **Git** for streamlined deployment processes, resulting in a **30% reduction** in deployment time.\n- Utilized **Kubernetes** and **Docker** for orchestration and container management, improving resource utilization and enabling horizontal scaling.\n- Managed Linux environments, optimizing server configurations to enhance performance and security across operations.\n- Developed configuration management scripts using **Ansible** and **Chef** to automate server provisioning and application deployment, reducing manual errors by **45%**.\n- Ensured effective networking practices to maintain secure communication across cloud resources and services.\n- Conducted thorough performance monitoring and capacity planning, leveraging tools like **Prometheus** and **Grafana** to maintain optimal system performance and reliability.\n- Implemented infrastructure as code (IaC) using **Terraform** on AWS and **OpenStack**, facilitating rapid environment setups and configurations.\n- Engaged in collaborative communication with cross-functional teams, ensuring alignment on project objectives and timely delivery.\n- Provided mentorship to junior engineers on best practices in **SRE** and **DevOps**, fostering a culture of continuous improvement and knowledge sharing."
    }
  ],
  "skills": "Programming Languages:\n\tPython, Golang, Ruby, Scala\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Jenkins, Ansible, Terraform, Chef, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tOpenStack, Azure, AWS\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Networking, Communication, Git, Artifactory, Nginx, Certbot, Let’s Encrypt, Linux",
  "apply_company": "Blip.pt"
}