{
  "name": "Rei Taro",
  "role_name": "Senior Technical Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Technical Engineer with a strong foundation in Mechanical Engineering, complemented by over 10 years of experience in backend systems development and cloud-native architectures. Skilled in Pressure Vessel Design and experienced in Project Management, ensuring successful delivery of high-impact projects. Proficient in conducting Production Audits and performing Root Cause Analysis to enhance operational efficiency. Demonstrated ability to innovate and streamline processes, with a track record in Technical Report Writing and the interpretation of Engineering Drawings. Adept at providing exceptional Customer Service and Technical Sales support, leveraging strong Negotiation and Analytical Skills to drive results.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Technical Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Applied **Mechanical Engineering** principles to enhance project execution, resulting in a **20%** improvement in design efficiency.\n• Conducted **Production Audits** to ensure adherence to design specifications and industry standards, achieving a compliance rate of **95%**.\n• Executed **Root Cause Analysis** on design failures, leading to a reduction in production defects by **30%** through effective problem-solving strategies.\n• Managed cross-functional projects from conception to completion, leveraging **Project Management** skills to meet deadlines and achieve project goals with stakeholder satisfaction ratings exceeding **90%**.\n• Utilized **Analytical Skills** to interpret engineering drawings for pressure vessel design, ensuring precision and compliance with safety regulations.\n• Developed and delivered **Technical Report Writing** documentation detailing project outcomes and design changes to stakeholders.\n• Fostered innovation in design process by implementing **Process Streamlining** initiatives, reducing project timelines by **25%**.\n• Engaged in **Technical Sales**, effectively communicating value propositions to clients, increasing customer satisfaction and retention levels.\n• Negotiated contracts and project specifications with vendors and clients, resulting in cost savings of up to **15%** on materials and services.\n• Delivered outstanding **Customer Service** throughout project lifecycle, ensuring client needs were met and feedback was incorporated into future designs."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Conducted **mechanical engineering** assessments that provided critical insights for system optimization and supported the design of robust **pressure vessels**.\nExecuted thorough **production audits** to ensure adherence to quality standards, enhancing product reliability and operational efficiency by **15%**.\nUtilized **innovative techniques** in **project management** to reduce project timelines by **20%**, enhancing team productivity and driving timely project delivery.\nPerformed detailed **root cause analysis** on mechanical failures, leading to a **30% reduction** in downtime and improvement in maintenance schedules.\nEngaged in **technical sales** by effectively communicating complex engineering concepts to clients, resulting in a **25% increase** in project acquisition rates.\nCreated and reviewed **engineering drawings** and **technical reports** to ensure clarity and compliance with specifications, contributing to the overall success of design projects.\nStreamlined processes through continuous improvement initiatives, achieving a **20% increase** in operational efficiency and client satisfaction.\nFacilitated effective **customer service** interactions, addressing technical inquiries and providing solutions to enhance client relationships and project outcomes.\nNegotiated project scopes and terms effectively with vendors and internal stakeholders, ensuring successful project alignments and resource allocations."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Leveraged **analytical skills** to conduct thorough **root cause analysis**, resulting in a **25%** reduction in production downtime for pressure vessel design projects.\n• Managed projects with a focus on **project management** principles, successfully completed **3 major engineering projects** ahead of schedule and under budget.\n• Developed and interpreted **engineering drawings** to enhance communication and efficiency among cross-functional teams, leading to a **30%** increase in project completion rates.\n• Conducted **production audits** to ensure compliance with technical specifications and regulations, achieving a **98% approval rate** during evaluations.\n• Utilized **technical sales** expertise to present innovative solutions to clients, resulting in a **15%** increase in customer satisfaction ratings.\n• Produced detailed **technical report writing** for each project phase, fostering transparency and effective communication with stakeholders.\n• Applied **process streamlining** methodologies to improve operational workflows, reducing processing time by **20%**.\n• Demonstrated strong **negotiation** skills to secure favorable contracts, contributing to business growth and customer retention.\n• Provided exceptional **customer service** through effective problem-solving strategies, enhancing client relationships and driving repeat business."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**Other**\n\tMechanical Engineering, Pressure Vessel Design, Production Audits, Technical Sales, Root Cause Analysis, Project Management, Innovation, Negotiation, Analytical Skills, Engineering Drawings Interpretation, Technical Report Writing, Process Streamlining, Customer Service, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow",
  "apply_company": "EXSIF OFFSHORE"
}