{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Machine Learning Specialist",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a proficient **Machine Learning Specialist**, I possess extensive experience in **Python** and a strong command of **machine learning** techniques including **supervised learning**, **unsupervised learning**, **deep learning**, and **reinforcement learning**. My expertise also encompasses **natural language processing** and **probabilistic modeling**, enabling the development and evaluation of predictive models to achieve business objectives effectively.\nWith a solid background in cloud-based workflows and integration of **ML frameworks**, I apply best practices in model evaluation and benchmarking to ensure high-quality performance. My technical skills include working with tools for **cloud services** and utilizing data structure feedback for continuous improvement in modeling processes.\nIn addition to my technical capabilities, I possess strong communication skills, allowing me to convey complex concepts clearly and collaborate efficiently with stakeholders. During my 8 years in the field, I have also developed high-performance solutions within the healthcare and financial sectors, leveraging modern technologies such as **React**, **Node.js**, and **FastAPI** for full-stack development.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Machine Learning Specialist",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and deployed machine learning models using **Python**, **TensorFlow**, and **scikit-learn** for applications such as patient risk prediction and financial fraud detection, ensuring thorough **model evaluation** and performance optimization.\nIntegrated **natural language processing** capabilities using **spaCy** and **Hugging Face Transformers** for healthcare document analysis, enhancing service accuracy through model refinement and feedback mechanisms.\nArchitected and built **cloud-based workflows** for MLOps using **MLflow** and **Apache Airflow** to automate continuous training and deployment, significantly increasing productivity by reducing manual interventions by **80%**.\nCollaborated closely with data science teams on benchmark tasks and experiments, consistently improving model performance metrics by over **15%** via iterative testing and feedback.\nImplemented robust **deep learning** architectures for complex tasks, applying **reinforcement learning** methods to drive intelligent decision-making processes in fintech applications.\nUtilized effective communication skills to present findings and insights from data analysis, aligning project goals with stakeholder expectations.\nDesigned and maintained data pipelines capable of handling large streams of healthcare and financial data, incorporating proven **data structure feedback** systems to ensure data integrity.\nParticipated in cross-functional teams promoting a culture of innovation, leveraging insights from **unsupervised learning** techniques to uncover hidden patterns in diverse datasets.\nConducted regular knowledge-sharing sessions on **ML frameworks** and advancements in **machine learning**, fostering a collaborative learning environment across teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed and implemented **machine learning** algorithms and models to enhance system performances, utilizing frameworks including **scikit-learn** and **XGBoost** to achieve a **30%** increase in fraud detection accuracy.\n- Designed and deployed cloud-based workflows that streamlined data processing pipelines, integrating with **Azure Machine Learning** for distributed model training and real-time inference.\n- Conducted rigorous **model evaluation** and benchmarking tasks to ensure robustness and reliability of predictive models, achieving a predictive accuracy rate of **85%** on credit scoring tasks.\n- Utilized **Python** in creating versatile machine learning solutions that supported both supervised and unsupervised learning techniques, applying principles of **reinforcement learning** for continuous model improvement.\n- Enhanced data handling capabilities by incorporating **natural language processing** techniques into user feedback systems, improving the clarity and relevance of feedback by **40%**.\n- Formulated and implemented deep learning approaches using the latest ML frameworks, contributing to the successful deployment of advanced analytics across multiple environments.\n- Collaborated with cross-functional teams to create clear communication channels for project updates, ensuring coordination on delivering high-impact results datified by a **25%** increase in project timeline adherence."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented machine learning techniques including **supervised learning**, **unsupervised learning**, and **deep learning** to enhance e-commerce features and optimize customer experiences.\nDeveloped and evaluated models using **scikit-learn**, **TensorFlow**, and other **ML frameworks**, ensuring robust performance on benchmark tasks with accuracy improvements of up to **15%**.\nCreated natural language processing solutions to analyze customer feedback and enhance product recommendations, leveraging data structures for effective feedback mechanisms with **over 30%** increase in user satisfaction ratings.\nEngineered cloud-based workflows for deploying machine learning models, optimizing resources, and ensuring scalability across varying loads, resulting in a processing speed improvement of **20%**.\nDesigned and integrated **AI/ML-based** recommendation engines that improved conversion rates significantly, utilizing real-time behavioral data and delivering tailored product listings to users.\nCommunicated effectively with cross-functional teams to ensure alignment on machine learning objectives, data requirements, and project milestones, leading to improved collaboration and project clarity.\nConducted thorough model evaluations, employing metrics for performance validation to ensure the highest standard of accuracy and reliability in predictions.\nDocumented machine learning processes and results clearly, enhancing knowledge sharing and driving continuous improvement within the team.\nApplied reinforcement learning techniques for refining product suggestions, contributing to a growth in average order value by **12%** through targeted recommendations."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript, TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tMachine Learning, Natural Language Processing, Deep Learning, Reinforcement Learning, Probabilistic Modeling, Supervised Learning, Unsupervised Learning, MLflow, Airflow, Kubeflow, Cloud-based Workflows, Benchmark Tasks, Model Evaluation, Data Structure Feedback, Clear Communication, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)"
}