{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Field Engineer with 8 years of experience, I possess strong technical troubleshooting abilities and project management skills essential for delivering high-quality service in the medical technology and robotics sectors. I am adept at preventive maintenance and understand compliance standards like **IEC60601-1** and **IEC62353**, ensuring all systems operate efficiently and safely. My background includes developing solutions that enhance customer service through effective communication and analytical reasoning.\n\nIn addition to my core expertise, I leverage my full-stack development skills in **JavaScript**, **TypeScript**, **Python**, and **Flutter** to create and enhance software solutions. My experience extends across the healthcare and financial sectors, crafting enterprise-grade applications using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have deep cloud experience with **Azure** and **AWS**, leading initiatives that integrate AI/ML capabilities for predictive analytics and intelligent automation. Furthermore, I’m proficient in **CI/CD** automation, microservices architecture, and have hands-on experience with MLOps workflows employing **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Delivered exceptional **customer service** by supporting **medical technologies** and **robotics** in the field, ensuring a high level of **technical troubleshooting** and efficient **preventive maintenance**.\n- Managed field operations and activities through effective **project management**, handling up to **15** projects simultaneously while adhering to timelines and client expectations.\n- Applied **analytical reasoning** to diagnose and resolve technical issues, maintaining compliance with standards such as **IEC60601-1** and **IEC62353** to ensure equipment safety and reliability.\n- Communicated effectively with cross-functional teams and clients, fostering a collaborative environment and driving successful project outcomes through strong **communication skills**.\n- Utilized **SAP Field Service Management** to optimize scheduling and resource allocation, enhancing service delivery efficiency and customer satisfaction metrics by **20%**.\n- Conducted regular audits and assessments of medical equipment, ensuring they meet regulatory requirements and industry standards, thereby reducing downtime by **30%**.\n- Trained and mentored junior engineers on best practices in **preventive maintenance** and technical support, enhancing team performance and service quality.\n- Developed and maintained comprehensive documentation, including service reports and equipment manuals, to ensure compliance and facilitate knowledge transfer within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided exceptional **customer service** by effectively communicating technical troubleshooting solutions for **medical technologies** and **robotics**, ensuring high client satisfaction across multiple projects.\nExecuted **technical troubleshooting** with a focus on **preventive maintenance** strategies, ensuring compliance with standards such as **IEC60601-1** and **IEC62353**, enhancing equipment reliability by **20%**.\nLed project management efforts, coordinating cross-functional teams to fulfill **SAP Field Service Management** tasks efficiently, resulting in a **15%** reduction in response times.\nDemonstrated strong **communication skills** by training staff on the operation and maintenance of advanced biomedical devices, improving team proficiency by **30%** within **6 months**.\nUtilized **analytical reasoning** to diagnose technical issues effectively, which contributed to a **25%** decrease in equipment downtime through systematic preventive measures and prompt interventions.\nImplemented comprehensive reporting systems using **project management** tools to track service metrics, enabling data-driven decision-making and strategic improvements."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized advanced technical troubleshooting skills to diagnose and resolve issues related to **medical technologies** and **robotics** in field operations.\nPerformed preventive maintenance according to **IEC60601-1** and **IEC62353** standards, ensuring reliability and compliance of critical medical devices.\nExecuted on-site project management for **SAP Field Service Management** projects, coordinating with cross-functional teams to ensure timely delivery of services and optimize workflows.\nCommunicated effectively with clients, providing exceptional customer service to understand their needs and deliver tailored solutions in a clear and concise manner.\nLeveraged analytical reasoning to assess technical challenges and implement effective solutions, improving system performance by **20%** in operational environments.\nTrained junior engineers on troubleshooting techniques and best practices, enhancing team capabilities and fostering a culture of continuous improvement within the organization.\nMonitored equipment performance using data-driven insights, resulting in a **15%** reduction in downtime and an increase in customer satisfaction as reported in quarterly surveys.\nCoordinated and managed service projects with a focus on meeting planned timelines, utilizing strong project management skills to complete tasks ahead of the **Q4 2023** goals.\nEnhanced technical documentation for equipment usage and maintenance procedures, simplifying processes and improving team efficiency by **30%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tNginx, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Authentication & Security, Keycloak (OIDC, RBAC), Let’s Encrypt, Certbot, technical troubleshooting, project management, communication skills, analytical reasoning, customer service, preventive maintenance, IEC60601-1, IEC62353, SAP Field Service Management",
  "apply_company": "Johnson & Johnson MedTech"
}