{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Fullstack Engineer with 13+ years of experience specializing in **JavaScript**, **TypeScript**, **Node.js**, and **React**. Proven track record in developing high-performance, scalable applications while ensuring maintainability and security. Proficient in modern frameworks including **Next.js** and **NestJS**, with hands-on experience in relational databases like **PostgreSQL**.\n\nExpert in cloud environments, deploying applications using **AWS** and **Kubernetes**. Adept at implementing performance optimization strategies and adhering to best practices for software security. Committed to mentoring junior developers and promoting knowledge sharing within teams. Additionally, experienced in building AI/ML-powered platforms that support real-time processing and automation, with a robust background in compliance-driven development.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and built full-stack platforms utilizing **JavaScript**, **TypeScript**, and **Node.js**, combined with modern front-end frameworks like **React (17–18)** and **Next.js**, ensuring optimal **performance optimization**, **maintainability**, and **security** throughout the development lifecycle.\nImplemented RESTful services with **GraphQL** and **PostgreSQL** for efficient data retrieval and management, achieving a **60%** reduction in query response time.\nLeveraged **Kubernetes** to manage containerized applications, ensuring high availability and scalability, while also mentoring junior developers on best practices.\nDelivered robust applications focusing on **performance optimization** and code **maintainability**, all deployed on **AWS** infrastructure with continuous integration and delivery practices.\nCollaborated closely with cross-functional teams to enhance application security, complying with industry standards, and conducting regular security audits to align with the latest vulnerabilities and best practices.\nParticipated in code reviews and provided mentoring sessions for junior engineers, fostering a collaborative learning environment that improved team productivity by **25%**.\nDeveloped application features to enhance user experience while adhering to the best practices in **security**, significantly reducing potential vulnerabilities.\nLed efforts in optimizing database performance on **PostgreSQL**, resulting in a **40%** decrease in load times during heavy traffic periods.\nContributed to the development of internal libraries and tools with **Node.js** and **TypeScript**, improving coding efficiency and reusability across multiple projects.\nEngaged in regular performance and penetration testing using modern tools to continuously monitor and improve application health and security standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **JavaScript** and **TypeScript** expertise to modernize core financial platforms by migrating to microservices architecture with **Node.js** (NestJS/Express), enhancing maintainability and performance for high-volume transactional systems.\nEmployed **React** (18), **Next.js**, and **Vue 3** to build interactive front-end applications, utilizing **Redux Toolkit** and **Tailwind CSS** to deliver sleek, responsive interfaces for financial tools and admin panels, improving user engagement by **30%**.\nImplemented performance optimization techniques in real-time analytics dashboards using **D3.js** and **Power BI Embedded**, facilitating operations teams with instant insights into transactions and anomalies, reducing investigation time by **40%**.\nDesigned and deployed a robust event-driven architecture utilizing **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments and alerts, leading to a **50%** increase in processing efficiency.\nDeveloped ETL pipelines for ingesting financial data using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting batch and real-time processing of over **5 million** transactions per day.\nImplemented **machine learning** models for fraud detection with **scikit-learn**, **XGBoost**, and **Azure ML**, which enabled proactive detection of suspicious activity based on user behavior and transaction patterns, achieving a detection accuracy of **95%**.\nCreated ML pipelines for real-time credit scoring and churn prediction, leveraging **MLflow** and **Airflow** to seamlessly integrate model inference into backend services, enhancing decision-making capabilities for risk assessment.\nProvided mentoring and support to junior developers, fostering a collaborative environment that encouraged skills development and the adoption of best practices in security and performance optimization."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed scalable and maintainable full-stack e-commerce applications using **JavaScript** and **TypeScript**, ensuring best practices in performance optimization and security.\n• Engineered robust backend services with **Node.js** using **NestJS** and integrated **PostgreSQL** for efficient data storage, effectively managing over **1000** concurrent users with low latency.\n• Designed responsive user interfaces with **React** and **Next.js**, employing best practices for maintainability and performance, leading to a **30%** reduction in page load times across the platform.\n• Implemented real-time data features with **WebSockets** and event-driven architecture using **Kafka** and **RabbitMQ**, enhancing customer experiences through instant order updates and notifications.\n• Optimized the caching mechanism utilizing **Redis** for frequently accessed data, achieving a **40%** decrease in database read loads and significantly improving application speed.\n• collaborated with cross-functional teams to mentor junior developers in using **Node.js**, **React**, and **TypeScript**, fostering a culture of continuous learning and improvement.\n• Utilized **Kubernetes** for deploying applications with blue-green deployment strategies, allowing for safer updates and minimizing downtime during releases.\n• Conducted hands-on troubleshooting and performance tuning in cloud environments with **AWS**, ensuring high availability and disaster recovery mechanisms are in place.\n• Established secure API integrations with payment gateways such as **Stripe** and **PayPal**, adhering to PCI compliance standards for financial transactions.\n• Implemented role-based access control (RBAC) and **OAuth 2.0** for secure access management, ensuring GDPR compliance and protecting sensitive user data."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Backend Frameworks:**\n\tNode.js, NestJS, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Next.js\n\n**API Technologies:**\n\tGraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tperformance optimization, maintainability, security, mentoring, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Maze"
}