{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Salesforce Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Salesforce Engineer with 8 years of experience, I excel in utilizing essential **Salesforce** technologies including **Apex**, **Visualforce**, and **Lightning Web Components** to deliver high-performance solutions. My strong command of **JavaScript** further complements my expertise in integrating **Sales Cloud**, **Service Cloud**, and **Marketing Cloud** functionalities to meet business needs. I possess a solid understanding of **REST APIs** and **SOAP APIs** for seamless system integrations. \nI am proficient in organizational skills, proactivity, and possess exceptional interpersonal and communication skills, which allow me to effectively collaborate across teams and ensure project success. Additionally, I have a background in building scalable applications using technologies like **React**, **Next.js**, **Vue**, **Node.js**, and **FastAPI**, and have experience in cloud environments such as **Azure** and **AWS**. My experience includes leading development initiatives while adhering to compliance standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Salesforce Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and integrated **Salesforce** solutions using **Apex** and **Visualforce**, facilitating seamless communication between various services through **REST APIs** and **SOAP APIs**.\nImplemented advanced **Lightning Web Components** to enhance user interfaces, improving user engagement and satisfaction metrics by **30%**.\nCollaborated with cross-functional teams to deliver technical solutions for **Sales Cloud**, **Service Cloud**, and **Marketing Cloud**, leading to a **25%** increase in operational efficiency.\nDesigned and maintained robust data models, optimizing the integration of **Salesforce** with external systems, ensuring compliance and data integrity across all platforms.\nDemonstrated strong **JavaScript** skills by developing custom functionalities and automating processes, resulting in a **40%** reduction in manual entry errors.\nUtilized exceptional **organizational skills** in managing project timelines and deliverables, ensuring projects were completed ahead of schedule by an average of **15%**.\nFostered positive relationships with stakeholders and team members through excellent **interpersonal and communication skills**, facilitating a collaborative work environment.\nProactively identified opportunities for system enhancements and automations, contributing to the continuous improvement of the **Salesforce** ecosystem.\nConducted training sessions for end-users on **Salesforce** functionalities, enhancing user proficiency and adoption rates by **20%**.\nEstablished comprehensive documentation for **Salesforce** implementations, ensuring best practices and knowledge transfer within the team.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and developed Salesforce applications utilizing **Apex**, **Visualforce**, and **Lightning Web Components**, enhancing user experience and system performance for **Sales Cloud**, **Service Cloud**, and **Marketing Cloud** applications.\nImplemented robust integration solutions using **REST APIs** and **SOAP APIs** to streamline data flow between Salesforce and third-party systems, achieving a **30%** improvement in data synchronization and operational efficiency.\nLeveraged **JavaScript** to create dynamic, interactive components within the Salesforce ecosystem, improving user engagement and satisfaction ratings by **25%**.\nCollaborated with cross-functional teams to gather requirements and deliver tailored Salesforce solutions, enhancing project delivery timelines by **15%** through effective organizational and communication skills.\nFacilitated training sessions and knowledge-sharing workshops to enhance team understanding of **Salesforce** capabilities and best practices, raising overall team productivity by **20%**.\nProactively identified and resolved system issues, leading to a **40%** reduction in support ticket volume and increased overall performance metrics.\nDrove the adoption of agile methodologies within the team, improving project adaptability and stakeholder communication, resulting in a **10%** faster turnaround time for deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed custom applications using **Salesforce** with **Apex**, **Visualforce**, and **Lightning Web Components**, enhancing system performance and functionality across **Sales Cloud**, **Service Cloud**, and **Marketing Cloud**.\n• Created and maintained REST and SOAP APIs to integrate third-party systems, ensuring seamless data flow and efficiency in business operations.\n• Collaborated with cross-functional teams to gather requirements and deliver solutions that improve customer relationship management, leading to a **20%** increase in user satisfaction.\n• Designed and executed data migration strategies using **Salesforce** Data Loader and ETL tools, effectively transferring **500,000+** records without data loss.\n• Developed training materials and conducted workshops for end-users, improving team performance and adoption rates of **Salesforce** solutions by **30%**.\n• Utilized **JavaScript** and **Lightning Web Components** to create dynamic user interfaces, resulting in a more engaging and effective user experience.\n• Ensured compliance with organizational policies by implementing role-based access controls (RBAC) and security best practices, securing sensitive customer data.\n• Employed effective organizational and project management skills to oversee multiple initiatives simultaneously, meeting all deadlines with a **95%** success rate.\n• Demonstrated strong interpersonal and communication skills while collaborating with stakeholders, ensuring that project goals align with business objectives."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tPython(FastAPI, Flask, Django)\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular), Lightning Web Components\n\n**API Technologies:**\n\tREST APIs, SOAP APIs\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tSalesforce, Apex, Visualforce, Sales Cloud, Service Cloud, Marketing Cloud, English, organizational skills, proactivity, interpersonal skills, communication skills, MLflow, Airflow, Kubeflow, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)",
  "apply_company": "GRiT Solutions"
}