{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Technical Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Technical Engineer with 13+ years of experience in server administration and troubleshooting across diverse environments, including **Linux** and **Windows**. Proficient in **Shell**, **Bash**, and SQL to monitor system performance, resolve issues, and ensure high availability. Demonstrated ability to provide exceptional customer support and create comprehensive documentation.\n\nAdditionally, a Full Stack Developer with expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**. Hands-on experience in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in building AI/ML-powered platforms with a focus on predictive analytics and real-time processing, deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and CI/CD pipelines. Well-versed in compliance-driven development aligned with HIPAA, FHIR, PCI DSS, and SOC 2 standards, with a strong background in MLOps using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Technical Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Performed server administration tasks across **Linux** and **Windows** environments to ensure optimal system performance and reliability.\nUtilized **Bash** scripting to automate routine processes, enhancing efficiency and reducing manual errors.\nExecuted comprehensive monitoring and troubleshooting protocols to identify and resolve system issues, contributing to a 30% decrease in downtime.\nPrepared and maintained detailed documentation for system configurations and procedures to facilitate smooth onboarding and knowledge transfer.\nDelivered top-tier customer support to internal teams, addressing technical inquiries and resolving issues with a resolution success rate of 95% within the first interaction.\nManaged SQL databases, conducting regular maintenance, performance tuning, and security measures to safeguard data integrity and accessibility.\nCollaborated with cross-functional teams to enhance server infrastructure and workflow, contributing to project success and customer satisfaction.\nParticipated in design reviews and technical discussions, offering insights that led to a 20% improvement in deployment turnaround time.\nActively contributed to continuous improvement initiatives, leveraging technical expertise in **terminal** usage and **shell** scripting to streamline operations."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Linux** and **Windows** environments for effective server administration, resulting in a **20%** increase in system uptime and reliability.\nImplemented robust **SQL** monitoring and troubleshooting practices, enhancing data retrieval efficiency by **30%** and reducing query response times.\nDeveloped and maintained comprehensive documentation for system architectures and troubleshooting protocols, improving customer support response effectiveness by **15%**.\nConducted Shell scripting and automation using **Bash** to streamline routine terminal operations, significantly reducing manual intervention and operational overhead.\nProvided technical customer support for complex system issues, ensuring rapid resolution times that consistently met service level agreements (SLAs).\nManaged server deployments and configurations across multiple environments, ensuring compliance with best practices and security standards.\nLeveraged monitoring tools to identify potential system issues proactively, enhancing overall performance and user satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Provided expert **Linux** and **Windows** server administration, ensuring optimal performance and security in a multi-environment setup for high-traffic applications.\nUtilized **Bash** scripting and **Shell** tools to automate routine tasks and enhance system monitoring and troubleshooting, resulting in a **30%** reduction in incident response times.\nMaintained comprehensive documentation of server configurations, processes, and procedures to facilitate knowledge sharing and streamline onboarding for new team members.\nImplemented SQL database monitoring and performance tuning to support real-time data access for applications, achieving uptime of **99.9%** across all services.\nDelivered exceptional customer support by diagnosing issues promptly and using troubleshooting skills to resolve complex technical problems effectively, maintaining a customer satisfaction rate of **95%**.\nDesigned recovery strategies and monitored systems to ensure consistent application stability, yielding a **50%** decrease in downtime incidents during critical updates.\nCollaborated with cross-functional teams to enhance server infrastructure, optimizing performance and reducing latency across applications by meticulously analyzing usage patterns and traffic loads.\nProactively identified and mitigated potential risks by conducting regular system audits, ensuring compliance with best practices in server administration and maintenance."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tN/A\n\n**Frontend Frameworks:**\n\tN/A\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\tSQL\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tLinux\n\tShell\n\tTerminal\n\tWindows\n\tServer Administration\n\n**Other:**\n\tBash\n\tMonitoring\n\tTroubleshooting\n\tCustomer Support\n\tDocumentation\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\tMLflow, Airflow, Kubeflow",
  "apply_company": "Contabo"
}