{
  "name": "Rei Taro",
  "role_name": "Modern C++ Software Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Dynamic Modern C++ Software Developer with 10+ years of experience in designing and delivering robust backend systems. Proficient in **C++ 20**, **Boost.Asio**, and applying **asynchronous programming** principles to develop high-performance applications. Expertise in **UML design** and implementing the **FIX protocol** for financial transaction systems, alongside integrating with third-party services like **MetaTrader API**. Committed to writing **testable code** and enhancing software quality through rigorous **unit testing**. Strong problem-solving capabilities with excellent communication and interpersonal skills, making me a valuable team player and a self-starter adept at contributing to innovative projects.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Modern C++ Software Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Applied strong problem-solving skills by designing and implementing robust software solutions in **C++ 20** to enhance system efficiency and reliability.\nUtilized **Boost.Asio** for developing highly performant asynchronous applications, leveraging asynchronous programming techniques to optimize data handling and processing speed.\nConducted comprehensive unit testing to ensure the quality and reliability of code, facilitating the development of testable code in accordance with industry standards.\nEmployed UML design principles for clear software architecture and design documentation, fostering effective communication across teams.\nIntegrated the **FIX protocol** and **MetaTrader API** to facilitate high-frequency trading and real-time financial data processing.\nAdopted object-oriented principles to develop modular, maintainable systems that are self-starter friendly, ensuring easy scalability and updates.\nDemonstrated effective communication and interpersonal skills while collaborating with cross-functional teams to address software integration challenges and maintain project timelines."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **C++ 20** to develop high-performance backend applications, ensuring efficient implementation of **asynchronous programming** for improved responsiveness.\nImplemented **Boost.Asio** for developing network applications, enhancing communication between different services with a focus on non-blocking operations.\nConducted **unit testing** to guarantee the reliability and robustness of the codebase, adhering to **object-oriented principles** to promote reusability and maintainability.\nDesigned and documented system architectures using **UML design** techniques, facilitating clear communication of complex systems.\nIntegrated financial protocols such as **FIX protocol** and **MetaTrader API** to support trading functionalities, enabling seamless data transactions and report generation.\nFacilitated collaborative efforts among cross-functional teams to ensure project milestones were met on time and achieved successful software releases.\nDemonstrated strong problem-solving skills through in-depth analysis and debugging of complex software issues, achieving a 30% reduction in error rates.\nEmployed effective communication and interpersonal skills to mentor junior developers, fostering a self-starter environment within the team."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **C++ 20** and **Boost.Asio** to develop robust backend services, focusing on trade execution and portfolio management to enhance trading operations.\nImplemented asynchronous programming techniques to create efficient high-frequency trading applications, ensuring optimal performance and reliability.\nDesigned and executed unit testing frameworks to produce testable code, improving overall software quality and stability.\nApplied object-oriented principles to maintain clean and scalable codebases, fostering an environment of continuous improvement.\nEngaged in UML design methodologies to effectively communicate complex architecture to team members and stakeholders.\nIntegrated **FIX protocol** and **MetaTrader API** into financial trading platforms, enhancing communication between different services and systems.\nDemonstrated strong problem-solving skills by tackling technical challenges and fostering collaboration through effective communication and interpersonal skills.\nProactively contributed to team discussions, leveraging self-starter mentality to propose innovative solutions and improvements."
    }
  ],
  "skills": " **Programming Languages**\n\tC++ 20, Python (3.8+), SQL, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, MetaTrader API, FIX protocol\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tPandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, unit testing, asynchronous programming, UML design, object-oriented principles, testable code, strong problem-solving, communication skills, interpersonal skills, self-starter, English proficiency, PyTest, Git"
}