{
  "name": "Tomasz Lee",
  "role_name": "Senior Salesforce Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Salesforce Engineer with 9+ years of experience in implementing and optimizing Salesforce solutions including **Sales Cloud**, **Flow Builder**, **Lightning App Builder**, and **Data Loader**. Proven expertise in integration strategies and GTM operations, utilizing tools such as **HubSpot**, **Outreach**, **Gong**, and **ZoomInfo**. Skilled at project management and fostering effective communication across teams to drive successful project outcomes. Originally a .NET Full Stack Developer, proficient in **microservices architecture**, **ReactJS**, **NextJS**, **.NET**, **C#**, and cloud services, bringing a unique perspective to Salesforce development and implementation.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Salesforce Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Executed the integration of **Salesforce** and **Sales Cloud** to enhance customer relationship management, resulting in streamlined operations and increased sales productivity by **30%**.\nLeveraged **Flow Builder** and **Lightning App Builder** to automate business processes, achieving a **15%** reduction in manual interventions.\nManaged data migration tasks using **Data Loader**, ensuring accuracy and efficiency in data transfer across platforms.\nCoordinated **GTM operations** to align technical developments with business goals, enhancing project transparency and communication.\nIntegrated third-party tools like **HubSpot** and **Outreach** to optimize lead generation and nurture strategies, leading to a **20%** increase in conversion rates.\nUtilized **Gong** and **ZoomInfo** for data-driven insights, enhancing sales strategies and team performance by **25%**.\nImplemented CPQ solutions to streamline pricing and quoting processes, reducing quote turnaround time by **35%**.\nLed project management initiatives to improve cross-functional team collaboration and reduce project delivery timeframes by **20%**.\nStrengthened internal and external communication channels to support client engagements and team alignment, resulting in improved stakeholder satisfaction.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented integration solutions using **Salesforce**, increasing data accuracy by 20% through effective data flow management with **Data Loader**.\nUtilized **Sales Cloud** features for developing tailored applications on the **Lightning App Builder**, improving system usability for the sales team.\nDesigned and optimized automated workflows with **Flow Builder** to enhance operational efficiency by 35%.\nCollaborated with marketing teams to leverage **HubSpot** and **Outreach** for streamlined communication processes, ensuring a 22% increase in lead engagement.\nIntegrated tools like **ZoomInfo** and **Gong** for enhanced data analytics and reporting, leading to improved decision-making.\nManaged **CPQ** processes to deliver accurate pricing strategies, contributing to a 15% reduction in sales cycles.\nFacilitated project management initiatives to track project progress and ensure adherence to timelines, with an average delivery rate of 95% on time.\nExecuted strategy for **GTM operations**, aligning all teams on sales goals and initiatives, resulting in an increase of 10% in overall sales performance.\nProvided mentorship and training to junior engineers to enhance communication and technical skills, resulting in a 40% boost in team productivity.\nConducted thorough code reviews and maintained best practices across projects to improve quality standards."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Applied advanced skills in **Salesforce**, specifically with **Sales Cloud**, to enhance the internal CRM functionality based on user feedback, resulting in a **20%** increase in sales team productivity.\nLeveraged **Flow Builder** and **Lightning App Builder** to automate processes within Salesforce, reducing manual entry and improving operational efficiency by **30%**.\nExecuted data integration projects using **Data Loader** to import and export data smoothly, enhancing data accuracy by **15%** within the system.\nCollaborated with cross-functional teams on **GTM operations**, ensuring alignment with project timelines and effective use of tools like **HubSpot** and **Outreach** for lead management.\nUtilized **integration** techniques to streamline data flow between Salesforce and other systems, optimizing overall business operations.\nConducted regular project management sessions to track progress and facilitate open communication channels among team members, fostering a collaborative environment.\nProvided training and support on using **Gong** and **ZoomInfo** to improve sales strategies based on data insights and analytics.\nCreated comprehensive documentation for all implemented solutions, enhancing knowledge transfer and ensuring best practices were followed across teams.\nParticipated in code reviews and daily standups to maintain effective communication and adherence to coding standards within project goals.\n"
    }
  ],
  "skills": " **Programming Languages**\n\t Python, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t (No specific skills listed)\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t AWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t (No specific skills listed)\n\n**Other**\n\t UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Salesforce, Sales Cloud, Flow Builder, Lightning App Builder, Data Loader, Integration, GTM operations, HubSpot, Outreach, Gong, ZoomInfo, CPQ, Project Management, Communication",
  "apply_company": "Commit"
}