{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Engineer with 13+ years of experience in developing high-performance applications, particularly focusing on **AI** solutions and **distributed systems**. Proficient in **Python** and experienced in integrating modern technologies such as **Go** and **C/C++**. Adept at containerization and **microVM** deployment for scalable systems. Demonstrated expertise in building applications that support predictive analytics and real-time processing.\nSkilled in delivering robust and compliant solutions, adhering to industry standards such as HIPAA and PCI DSS. Strong hands-on experience in both frontend and backend development, utilizing **JavaScript/TypeScript**, **React**, **Next.js**, **Node.js**, along with strong foundations in MLOps leveraging **MLflow**, **Airflow**, and **Kubeflow** for model training and orchestration. Proven track record in implementing **CI/CD pipelines**, cloud-native systems on **AWS**, **Azure**, and advancing projects with microservices and event-driven architectures.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** to develop and enhance AI-driven applications, ensuring efficient algorithm implementation and data processing for advanced analytics.\nDesigned and implemented distributed systems architecture that utilized **Go** and **C** for high-performance applications, optimizing inter-service communication and scalability.\nDeveloped and maintained microservices utilizing **C++**, ensuring robust sandboxing and isolation to enhance system security and fault tolerance.\nEngineered full-stack solutions leveraging modern front-end frameworks, ensuring seamless integration with **Python** based backends while remaining compliant with industry standards.\nParticipated in the development of container runtimes by employing **Docker** and **Kubernetes**, achieving automated deployment processes that supported fault-tolerance and high availability across services.\nLed the migration of legacy codebases to modern microservices architectures, integrating various programming languages and techniques for improved maintainability and performance.\nImplemented robust testing frameworks and best practices to ensure code quality across diverse technologies, enabling continuous integration and delivery within advanced CI/CD pipelines.\nCollaborated with cross-functional teams to integrate AI features and enhance system capabilities, leveraging machine learning models to drive intelligent decision-making processes.\nManaged the performance tuning and optimization of applications, leading to a reduction in latency by up to **30%** and improving throughput for high-traffic scenarios.\nDeveloped extensive documentation and conducted knowledge sharing sessions to promote understanding of distributed systems principles and architectural patterns across teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Employed **Python** in developing and maintaining scalable **distributed systems**, ensuring high performance and reliability across various applications.\nUtilized **AI** techniques to enhance the functionality and efficiency of core services, driving innovation in product features and user experience.\nImplemented container runtimes for deployment processes, optimizing resource management and operational flexibility in cloud environments.\nDesigned and optimized systems using **Go**, improving system throughput and response times by up to **30%**.\nDeveloped **C** and **C++** modules to support high-performance computing requirements, achieving a reduction in latency by over **15%**.\nIntegrated **microVMs** and advanced **sandboxing** techniques to enhance application security and isolation across environments, ensuring robust protection against vulnerabilities.\nLed the modernization of legacy applications, resulting in a **40%** decrease in downtime and increased scalability through a microservices architecture.\nCollaborated with cross-functional teams to deliver impactful solutions while mentoring junior engineers on best practices in software engineering."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** for designing and optimizing backend services, ensuring scalability and high availability within a distributed system architecture for a global e-commerce platform.\nEngineered robust components using **Go** to enhance performance in microservices, contributing to low latency and high throughput.\nDeveloped efficient algorithms in **C** and **C++** for processing real-time data, significantly improving processing speeds by **30%**.\nImplemented distributed systems using **Docker** and **Kubernetes**, managing container runtimes to optimize resource allocation and application deployment.\nDesigned secure execution environments through **microVMs** and sandboxing technologies, enhancing application security while maintaining performance standards.\nLeveraged **AI** techniques in real-time recommendation systems to optimize user engagement, leading to a **20%** increase in conversion rates.\nCreated dynamic features utilizing **WebSocket** and moderate traffic solutions with message brokers like **Kafka** and **RabbitMQ** for real-time updates and notifications.\nEnhanced frontend user interfaces with responsive design technologies like **React (18)** and **Vue 3**, achieving performance metrics with load times under **2 seconds**. \nEnsured data integrity and accessibility through strategic database management using both **MongoDB** and **PostgreSQL**, achieving fault tolerance in high-traffic scenarios.\nImplemented actions to comply with GDPR through role-based access control (RBAC) and **OAuth 2.0**, safeguarding user data in the customer and admin interfaces."
    }
  ],
  "skills": "**Programming Languages:**\n\tC, C++, Go, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, distributed systems, container runtimes, microVMs, sandboxing, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot",
  "apply_company": "poolside"
}