{
  "name": "Rei Taro",
  "role_name": "Senior DevOps Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior DevOps Engineer with over 10 years of expertise in **CI/CD**, **configuration management**, and leveraging **DevOps tools** to streamline release management. Proficient in automating solutions and utilizing **service containers** within both **Linux** and **Windows** environments. Strong experience in monitoring tools and troubleshooting enterprise web applications, coupled with a successful track record in designing and delivering backend systems for financial platforms and AI/ML pipelines. Adept at creating high-performing APIs and scalable services using **Python** (**FastAPI**, **Django**, **Flask**) and deploying on cloud platforms like **AWS** and **Azure**. Exceptional communicator with proven contributions to impactful projects at leading organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented CI/CD pipelines to enhance release management and automate deployment processes, enabling faster delivery cycles.\nUtilized **DevOps tools** for effective configuration management and monitoring, improving system reliability and uptime by **30%**.\nDesigned and managed service containers using Docker, facilitating portability and consistency across development and production environments.\nDeveloped and maintained enterprise web applications with a focus on scalability and performance, leading to a **25%** increase in user engagement.\nStreamlined automation solutions with scripting in **Python**, reducing manual intervention and ensuring seamless workflows.\nManaged both **Linux** and **Windows** environments, ensuring operational stability and performance optimization.\nAuthored comprehensive documentation for troubleshooting procedures and best practices, improving team collaboration and efficiency.\nCommunicated effectively with cross-functional teams to address operational challenges and ensure project alignment with business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented CI/CD pipelines using **Azure DevOps** and **Git** to automate deployment processes, ensuring rapid and reliable application releases.\nLeveraged configuration management tools like **Terraform** for maintaining consistent infrastructure across **Linux** and **Windows** environments.\nDeveloped automation solutions that improved system efficiency by **30%**, reducing deployment times for enterprise web applications.\nUtilized **Docker** and **Kubernetes** for service containers management, enhancing scalability for SaaS applications with **99.9% uptime**.\nMonitored application performance and uptime using **Prometheus** and **Grafana**, addressing issues in real-time to maintain service reliability.\nCreated comprehensive documentation for deployment processes, troubleshooting techniques, and system configurations, fostering clear communication across teams.\nExecuted troubleshooting measures that resolved system outages within **15 minutes**, improving overall service availability and reliability.\nCollaborated effectively with cross-functional teams to ensure successful release management and compliance with regulatory standards."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **CI/CD** pipelines to automate deployment processes, improving release management and reducing deployment time by **40%**.\nApplied **configuration management** techniques to maintain consistency across development environments in both **Linux** and **Windows**, ensuring efficient operations.\nLeveraged **DevOps tools** for service containers to enhance the deployment of enterprise web applications and **SaaS** products, resulting in a **30%** increase in application availability.\nConducted thorough monitoring using **monitoring tools**, which facilitated proactive troubleshooting and improved system reliability by **25%**.\nDeveloped scripts to automate repetitive tasks, significantly reducing manual input and accelerating **documentation** processes.\nCollaborated with cross-functional teams to implement **automation solutions** for backend services, resulting in improved team communication and workflow efficiency.\n"
    }
  ],
  "skills": " **Programming Languages**\n\t Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t \n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t CI/CD, DevOps tools, configuration management, release management, service containers, GitHub Actions, Azure DevOps, Docker, Kubernetes, monitoring tools, automation solutions, troubleshooting, documentation\n\n **Cloud & Infrastructure**\n\t \n\n **Other**\n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Linux, Windows, scripting, communication",
  "apply_company": "Hyland"
}