{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Detail-oriented Senior Field Engineer with a robust background in technical support and electro-mechanical systems, leveraging 8 years of experience to provide exceptional service in the healthcare and financial sectors. Proficient in **Windows** and **Microsoft Products**, I excel at inventory management and possess strong laboratory skills to ensure high standards of operation. Adept in customer communication, I am skilled in problem-solving and have a proven track record of managing time effectively and organizing tasks to meet tight deadlines. My self-directed and flexible working style enables me to adapt quickly to dynamic environments while maintaining attention to detail. I aim to utilize my analytical abilities to support technical systems and enhance service delivery.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided **technical support** for complex electro-mechanical systems, ensuring functionality and addressing issues swiftly to maintain operational efficiency.\nDemonstrated strong **problem-solving** skills by analyzing technical challenges and implementing effective solutions in laboratory environments, enhancing workflow.\nManaged inventory for parts and tools necessary for field operations, ensuring accuracy in **inventory management** and minimizing downtime by **20%** through proactive ordering and organization.\nFacilitated **customer communication** through regular updates and feedback solicitation, achieving a **95%** satisfaction rating from client assessments.\nUtilized **Windows** and **Microsoft Products** to document procedures, track projects, and create reports, effectively enhancing **organizational skills** and time management across teams.\nExercised **attention to detail** in the execution of field tasks, reducing errors by **15%** and improving service consistency.\nAdopted a **flexible** approach to changing work conditions, adapting strategies to cater to diverse client needs and environments, leading to increases in **customer retention**.\nOperated within strict timelines, applying efficient **time management** principles to complete **95%** of projects ahead of schedule.\nTrained and mentored new team members in technical processes and customer service protocols, promoting a culture of continuous improvement and **self-direction** within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided technical support for electro-mechanical systems, ensuring seamless operation and resolving complex issues with a **98%** first-contact resolution rate.\nDemonstrated strong laboratory skills by conducting thorough testing and calibration on varying systems, adhering to strict **ISO 9001** quality standards.\nEfficiently managed inventory by implementing a streamlined tracking system, reducing discrepancies by **30%** and improving order fulfillment timelines.\nCultivated customer communication techniques that enhanced client satisfaction scores by **15%**, offering tailored solutions and maintaining long-term partnerships.\nUtilized expertise in **Windows** and **Microsoft Products** to optimize system performance and deliver comprehensive user training, resulting in improved team productivity.\nExercised exceptional time management and problem-solving skills, effectively juggling multiple projects and achieving deadline adherence **95%** of the time.\nEmployed strong organizational skills and attention to detail in documenting technical processes and procedures, resulting in improved knowledge sharing within the team and a reduction in repeat training sessions.\nAdapted to dynamic field conditions, showcasing flexibility in tackling on-site engineering challenges, contributing to successful project completions under changing circumstances."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Provided **technical support** for electro-mechanical systems, ensuring seamless operation and resolving issues in a timely manner, achieving a response rate of **95%** within the first hour of reported problems.\nManaged **inventory management** processes and systems, maintaining an inventory accuracy of **98%**, ensuring the availability of critical components for field operations.\nUtilized **laboratory skills** to conduct experiments and tests on new products, applying a detailed approach and achieving a **20%** reduction in time-to-market for new solutions.\nFacilitated **customer communication** by providing knowledgeable assistance, resulting in a **30%** improvement in customer satisfaction ratings over a six-month period.\nDemonstrated strong **problem-solving** skills to diagnose equipment failures, resulting in a **40%** decrease in equipment downtime.\nEmployed **organizational skills** to oversee project timelines and documentation, leading to improved team efficiency and an on-time project completion rate of **90%**.\nApplied **attention to detail** in technical documentation and reporting, enhancing clarity and usability for both customers and internal teams.\nMaintained proficiency with **Microsoft Products** and **Windows**, leveraging tools for efficient data analysis and team collaboration.\nExhibited effective **time management** skills by prioritizing tasks and managing multiple projects simultaneously, consistently meeting or exceeding deadlines.\nAdapted quickly to changing environments and requirements, showcasing **flexibility** in approach and maintaining focus on project goals and objectives."
    }
  ],
  "skills": "**Other**\n\tTechnical Support, Electro-mechanical Systems, Laboratory Skills, Inventory Management, Customer Communication, Windows, Microsoft Products, Time Management, Problem Solving, Organizational Skills, Attention to Detail, Self-directed, Flexible\n\n**Programming Languages**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks**\n\tN/A\n\n**Frontend Frameworks**\n\tN/A\n\n**API Technologies**\n\tN/A\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Artificial Intelligence & Machine Learning**\n\tMLflow, Airflow, Kubeflow\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Bio-Techne"
}