{
  "name": "Mariusz Jan Skobel",
  "role_name": "Team Lead Backend Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Team Lead Backend Developer with 10+ years of experience in building scalable, high-performance software solutions, specializing in **Node.js**, **JavaScript**, and **ECMAScript 6**. Demonstrated expertise in designing RESTful APIs and implementing **WebSockets** for real-time data exchange. Proficient in utilizing **MySQL**, **Redis**, and **RabbitMQ** to develop microservices-based architectures and messaging systems that enhance system resilience and performance. Proven ability to lead technical teams, guiding the development of efficient, maintainable software while fostering a collaborative work environment. Strong organizational, diagnostic, and troubleshooting skills allow for effective project management and rapid issue resolution.\n\nAdept in building cloud-native applications, with hands-on experience across the full stack using **React**, **Next.js**, and **Vue**. Additionally, experienced in CI/CD automation and principles of Agile development. Passionate about integrating innovative technology that supports organizational growth and delivers substantial business impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Team Lead Backend Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented **scalable infrastructure** using **Node.js** and **JavaScript (ECMAScript 6)**, ensuring seamless integration with **REST** and **WebSockets** for real-time data processing in backend applications.\n• Led the transition to **microservices** architecture, optimizing application performance and scalability while managing **Redis** for caching and **RabbitMQ** for messaging systems, resulting in a **30%** improvement in response time.\n• Conducted technical leadership in diagnosing and troubleshooting complex application issues, leveraging **MySQL** for effective data management and analytics, while maintaining **99.9%** uptime across services.\n• Established and maintained robust Git workflows for version control, ensuring code quality and collaboration across a team of developers.\n• Developed and managed **scalable infrastructure** to support rapid application growth, resulting in a **50%** increase in concurrent user handling without performance degradation.\n• Fostered organizational abilities by mentoring junior developers, promoting best practices in coding and design, which led to a **40%** reduction in onboarding time.\n• Collaborated with cross-functional teams to develop and implement diagnostic tools for tracking application health and performance metrics, achieving quicker fault resolution.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Led the development and modernization of financial platforms by adopting a microservices-based architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability, maintainability, and throughput for high-volume transaction systems.\n\n- Developed and deployed scalable microservices using **Node.js** to meet the architecture demands of over **100K** simultaneous transactions, ensuring efficient transaction handling.\n- Utilized **JavaScript** and **ECMAScript 6** for coding dynamic, user-focused front-end applications, achieving a response time decrease of **30%** for user interactions on financial dashboards.\n- Managed version control and collaboration through **Git**, implementing code reviews and technical leadership to guide a team of **9** developers.\n- Integrated asynchronous messaging systems like **RabbitMQ** to support real-time communication across services, significantly increasing system responsiveness and reliability.\n- Optimized database operations with **MySQL**, ensuring data integrity and reducing query times by **25%**, accommodating high transaction throughput.\n- Designed asynchronous event processing frameworks leveraging **RabbitMQ** and **Redis** for efficient message handling within microservice architecture.\n- Fostered a culture of organizational excellence and technical leadership, driving team performance, improving **diagnostic** and **troubleshooting skills** among team members."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Led the design and optimization of backend services for a global e-commerce platform utilizing **Node.js** (NestJS, Express) and **JavaScript** (ECMAScript 6) to ensure high availability, low latency, and scalability across critical modules such as checkout, cart, and order fulfillment.\n• Developed RESTful APIs and integrated **WebSockets** for real-time communication, enhancing order updates and dynamic inventory tracking to improve customer experience.\n• Collaborated with cross-functional teams to implement **RabbitMQ** for efficient messaging solutions, ensuring responsive order processing and real-time customer support.\n• Managed data storage strategies with **MySQL** and **Redis**, optimizing distributed data access to support over **100,000** concurrent users with minimal latency.\n• Engineered a microservices architecture that facilitated seamless scalability and maintainability, improving deployment efficiency by **30%**.\n• Provided technical leadership and mentorship to junior developers, fostering a culture of collaboration and continuous improvement while honing diagnostic and troubleshooting skills.\n• Utilized **Git** for version control and collaborative development, ensuring code quality and streamlined workflows within the team.\n• Implemented scalable infrastructure solutions using **Microservices**, supporting a dynamic workflow that reduced system downtime by **40%** during peak traffic.\n• Enhanced system resilience and performance through the application of caching strategies with **Redis**, successfully decreasing database read pressure and improving response times.\n• Championed organizational best practices that aligned with project goals, enhancing team productivity and project deliverables.\n• Spearheaded the integration of messaging systems to streamline inter-service communication and improve operational efficiency."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript/TypeScript, Python\n\n**Backend Frameworks:**\n\tNode.js, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST, WebSockets\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tMicroservices, Scalable infrastructure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, RabbitMQ, Git, Technical leadership, Organizational abilities, Diagnostic skills, Troubleshooting skills"
}