{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Mathematician Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-oriented professional with 8 years of experience as a Full Stack Developer transitioning into a Senior Mathematician Engineer role. Proven expertise in **AI**, **Mathematics**, and **Data Labeling**, with a strong analytical mindset to evaluate models effectively. Proficient in **Programming** using **JavaScript**, **TypeScript**, **Python**, and **Flutter** to build high-performance solutions, ensuring comprehensive problem-solving and communication skills throughout the development process.\n\nSkilled in full-stack development leveraging **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, with experience in cloud services such as **Azure** and **AWS**. I have developed enterprise-grade platforms that integrate machine learning capabilities for predictive analytics and real-time data processing, enhancing decision-making by ensuring effective **Model Evaluation** and implementing robust test procedures.\n\nMy technical background includes a solid understanding of microservices architecture, event-driven systems, CI/CD automation, and compliance with industry standards such as HIPAA, FHIR, and PCI DSS. Additionally, I bring hands-on experience in developing machine learning pipelines and implementing MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**, ensuring that I adapt complex technical requirements into practical applications seamlessly.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Mathematician Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Mathematics** and analytical skills to design and develop scalable, data-driven algorithms for healthcare and financial applications, ensuring precision and efficiency in numerical computations and statistical analysis.\nImplemented AI strategies for model evaluation and performance tuning across various applications, effectively enhancing predictive capabilities and user experience.\nApplied programming expertise in languages such as TypeScript and Python to create robust models for patient risk prediction and financial fraud detection, leveraging frameworks like **scikit-learn**, **PyTorch**, and **TensorFlow** in version **2.0** and higher.\nConducted detailed data labeling and validation processes to guarantee the quality of training datasets, directly impacting model accuracy for applications across health and finance domains.\nEngaged in reinforcement learning techniques (RLHF) to continually improve algorithm performance, incorporating user feedback directly into model iterations.\nCollaborated with cross-functional teams to produce clear and concise analytical writing, enabling stakeholders to understand complex mathematical concepts and their applications in solution design and implementation.\nLed problem-solving initiatives by integrating advanced AI features into applications, such as smart financial dashboards and personalized health recommendations, using APIs hosted on **Azure ML** and **AWS Sagemaker**.\nUtilized effective communication to present findings and optimize solutions, ensuring alignment between technical development and business objectives while fostering a collaborative work environment.\nEmployed test strategies using tools such as **Jest**, **Cypress**, and **Postman** to ensure comprehensive quality assurance across all layers of application development, contributing to reliability and user satisfaction.\nParticipated in model evaluation and optimization cycles, delivering insights on statistical performance metrics and improving overall model efficacy, contributing to better operational KPIs."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized advanced **Mathematics** techniques to develop and optimize algorithms for AI applications, enhancing predictive accuracy and efficiency in financial analytics.\nApplied **AI** methodologies to create real-time fraud detection systems, leveraging tools like **scikit-learn**, **XGBoost**, and **Azure Machine Learning** to analyze and interpret transaction data.\nConducted extensive **data labeling** and **model evaluation** to ensure the integrity and effectiveness of machine learning models deployed in banking systems, improving anomaly detection rates by **35%**.\nDeveloped and presented analytical reports demonstrating insights from data analysis, showcasing strong **analytical writing** and **communication** skills to stakeholders, thereby enhancing decision-making processes.\nImplemented innovative solutions to complex problems by combining **problem-solving** skills with mathematical modeling, resulting in **20%** reduction in processing times for high-volume transactions.\nCollaborated cross-functionally with teams to streamline processes and improve workflows, effectively communicating technical concepts to non-technical stakeholders, promoting seamless integration of mathematical frameworks within operational strategies.\nLeveraged programming skills in **Python** and **JavaScript** to support the development of algorithms and real-time applications, ensuring a robust architecture that supports both transaction security and data integrity.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized strong **Mathematics** skills to analyze complex algorithms and optimize backend services, enhancing reliability and performance metrics for key functionalities.\nEmployed **AI** techniques for developing models and integrating them into backend systems, improving functionality and user experience across the platform.\nDemonstrated exceptional **programming** capabilities by designing and optimizing backend services in **Python** (FastAPI, Django) and **Node.js** (NestJS, Express), achieving **99.9%** uptime for mission-critical modules like checkout and order fulfillment.\nLeveraged advanced analytical skills for **model evaluation** and troubleshooting, significantly reducing response time by **30%** and increasing conversion rates through real-time data analysis.\nImplemented real-time features with **WebSockets**, enhancing user interactions and achieving dynamic updates based on customer behavior, resulting in a **20%** improvement in response times.\nDeveloped robust data-driven applications with various frameworks including **React** (18), **Vue 3**, and **Angular**, ensuring mobile responsiveness that adheres to performance standards.\nApplied analytical writing techniques to document systems and algorithms, making insights more accessible to stakeholders and enhancing decision-making processes.\nExecuted efficient data storage strategies with **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra**, ensuring rapid data retrieval for **over 100K** daily active users.\nIntegrated ML-based recommendation systems using **scikit-learn**, **LightGBM**, and **TensorFlow** for personalized user experiences, positively influencing user engagement metrics by **25%**.\nImplemented secure payment processing workflows using **Stripe**, **PayPal**, and **Razorpay**, conforming to PCI DSS, thereby ensuring data security for all transactions."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, CI/CD (GitHub Actions, GitLab CI/CD), Terraform, Ansible, Helm\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Docker Compose\n\n **Other:**\n\tMathematics, AI, Data labeling, RLHF, Model evaluation, Analytical writing, Fact-checking, Programming, Problem-solving, Communication",
  "apply_company": "SME Careers"
}