{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Dynamic Senior Fullstack Engineer with 8 years of extensive experience in crafting high-performance solutions utilizing **Node.js**, **TypeScript**, **PostgreSQL**, **Angular**, and **NestJS**. Adept at implementing clean code principles and Domain-Driven Design (DDD) to ensure scalable and maintainable applications. Proven ability to leverage modern testing frameworks like **Jest** to deliver robust software alongside effective CI/CD practices. My background includes collaborating in team environments with techniques such as pair programming and active feedback loops to refine development processes.\n\nI possess a strong foundation in full-stack development, highlighted by my proficiency in **React**, **Next.js**, **Vue**, **FastAPI**, and **Django**. I have hands-on experience with cloud platforms such as **GCP**, and have successfully integrated AI/ML capabilities into enterprise-grade platforms. My approach emphasizes building secure and compliant applications adhering to standards like HIPAA and PCI DSS while employing deep expertise in microservices architecture, event-driven systems, and MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable, full-stack applications using **Node.js**, **TypeScript**, and **PostgreSQL**, implementing Clean Code principles and Domain-Driven Design (DDD) methodologies for robust application architecture.\nArchitected solutions with Angular and NestJS, ensuring streamlined development processes and high code quality through pair programming and regular feedback sessions, enhancing team collaboration and productivity.\nDesigned and executed automated testing strategies using **Jest**, encompassing unit, integration, and end-to-end tests, ensuring high test coverage and reliability of both front-end and back-end services.\nImplemented cloud solutions leveraging **GCP** (Google Cloud Platform) to optimize application deployment and performance, achieving a **50%** reduction in application load times through efficient resource management.\nDeveloped complex data models and RESTful APIs for seamless data interactions, ensuring compliance with industry standards and enhancing application functionality by up to **30%**.\nCollaborated closely with cross-functional teams, fostering an environment of innovation and adaptability through frequent collaboration and iterative feedback cycles, resulting in a **40%** increase in project completion efficiency.\nUtilized Agile methodologies to streamline project management and delivery, consistently meeting **95%** of project deadlines and demonstrating a commitment to high-quality software development.\nEngaged in thorough code reviews and team discussions to promote best practices, ensuring code maintainability and scalability across multiple projects.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** (NestJS) and **TypeScript** to develop and modernize financial platforms, enhancing scalability and maintainability for systems handling over **1M** transactions daily.\nApplied **PostgreSQL** to ensure efficient data management in high-volume transaction environments, improving data retrieval speeds by up to **30%**.\nEngaged in collaborative development practices, implementing **Clean Code** principles and **DDD** methodologies to deliver robust, maintainable applications.\nParticipated in pair programming sessions, fostering real-time feedback and collaboration among team members to drive continuous improvement and code quality.\nDesigned and developed dynamic front-end applications using Angular and other frameworks, achieving a **20%** improvement in user engagement through responsive and efficient interfaces.\nImplemented comprehensive testing using **Jest** to ensure code reliability and reduce regression issues by **25%** during deployments.\nLeveraged GCP services for cloud-based solutions, optimizing deployment processes and enhancing the overall performance of financial applications."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Focused on enhancing backend solutions leveraging **Node.js** (NestJS, Express) and **PostgreSQL** to improve performance and scalability for e-commerce platform functionality.\nEmployed **TypeScript** and **Angular** for frontend development, ensuring clean, maintainable code adhering to best practices and standards while delivering a seamless user experience.\nImplemented unit and integration tests using **Jest** to ensure code reliability and maintainability across the codebase, supporting continuous delivery and collaboration within development teams.\nAdopted **GCP** for cloud deployment strategies, improving application availability and optimizing resource management in a high-traffic e-commerce environment.\nPracticed **Clean Code** principles and adopted **DDD** (Domain-Driven Design) methodology to ensure the clarity and efficiency of the codebase, facilitating easier understanding among team members.\nEngaged in **pair programming** regularly to review code quality and share knowledge, fostering a collaborative team culture and enhancing overall productivity.\nUtilized **Shape Up** methodology to manage development cycles, ensuring timely delivery of features aligned with business objectives and optimizing project outcomes.\nProvided constructive feedback during code reviews to promote team growth and maintain high coding standards, enhancing team cohesion and performance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, NodeJS, NestJS\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Jest, Clean Code, DDD, Shape Up, pair programming, collaboration, feedback",
  "apply_company": "Dougs Compta"
}