{
  "name": "Damian Franciszek Pospiech",
  "role_name": "QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "QA Engineer with extensive experience in test automation and functional testing, underpinned by a strong foundation in **Python**, **JavaScript**, **TypeScript**, and **Golang**. Proficient in QA methodologies, regression testing, and API testing, ensuring high-quality deliverables through meticulous defect tracking and adherence to structured processes.\nLeveraging **cloud services** for scalable testing environments and deploying applications across both AWS and Azure. Well-versed in Agile methodologies, particularly **SCRUM**, to enhance team collaboration and project delivery. Demonstrated interpersonal skills and effective time management to drive projects forward while maintaining attention to detail. With over 13 years in software development, I bring a robust understanding of both frontend and backend systems, particularly in healthcare and financial sectors, enabling a comprehensive perspective on quality assurance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Performed comprehensive **test automation** strategies to ensure software quality and reliability, achieving a reduction in defect rates by **30%**.\nUtilized various **QA methodologies** including **functional testing**, **regression testing**, and **API testing** to validate software functionality and performance, leading to successful project deliveries on **85%** of timelines.\nEmployed **defect tracking tools** to identify, report, and monitor software defects, significantly improving issue resolution time by **25%**.\nCollaborated with cross-functional teams using **SCRUM** and **Agile** methodologies for effective project management and streamlined workflows, enhancing team communication and productivity.\nLeveraged programming languages such as **Python** and **JavaScript**, along with **Typescript**, to develop automated test scripts and frameworks, ensuring thorough test coverage across applications.\nIntegrated cloud services to effectively conduct tests in a scalable and secure environment, executing tests on deployed applications hosted on **AWS** and **Azure**.\nMaintained meticulous attention to detail during test case execution and reporting, ensuring high-quality deliverables and adherence to industry standards.\nDemonstrated excellent **interpersonal skills** to foster collaboration between development and QA teams, resulting in improved software development processes.\nManaged time efficiently to juggle multiple projects and deadlines, maintaining high standards of quality throughout the testing lifecycle.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **test automation** frameworks to streamline QA processes, reducing testing time by **40%** and enhancing overall efficiency.\nUtilized **Defect tracking tools** to log, manage, and prioritize issues, ensuring timely resolutions and maintaining high-quality standards in software releases.\nApplied **QA methodologies** to conduct **functional testing** and **regression testing**, achieving **99%** defect-free releases by adhering to established best practices.\nExecuted **API testing** of microservices developed in **Node.js** and **Python**, ensuring seamless integration and functionality across the financial platforms.\nCollaborated in **SCRUM** meetings, contributing to project planning and brainstorming sessions with strong **interpersonal skills** and a focus on team goals.\nLeveraged **Cloud services** for managing deployment processes and coordinating test environments, ensuring smooth operation in production settings.\nDemonstrated effective **time management** by prioritizing tasks and meeting project deadlines consistently, leading to a **30%** increase in project delivery speed.\nMaintained high **attention to detail** in testing procedures, guaranteeing the robustness and reliability of software before deployment."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented robust **test automation** solutions to enhance software reliability and accelerate the testing process, utilizing frameworks such as **Python** and **Golang** for comprehensive test coverage.\nUtilized **defect tracking tools** to identify, document, and manage defects efficiently, ensuring high-quality software delivery in alignment with QA methodologies and standards.\nConducted thorough **functional testing** and **regression testing** on e-commerce platform features to verify functionality and mitigate any risks prior to production deployments, improving software stability by **30%**.\nPerformed rigorous **API testing** using tools such as Postman and Swagger, validating endpoints in various environments to ensure operational efficiency and compliance with specifications.\nWorked collaboratively in an **Agile** environment, participating in daily **SCRUM** meetings and sprint planning sessions to improve team communication and project management, demonstrating strong **interpersonal skills** and **time management**.\nAttention to detail in implementing QA practices, leading to a decrease in critical defects reported post-release by **25%** through early detection and resolution strategies.\nFacilitated communication between development and QA teams, enhancing collaboration, understanding of features, and driving continuous improvement in testing processes and documentation.\nConducted exploratory testing and ensured best practices for testing mobile and web applications, utilizing **JavaScript**, **Typescript**, and cloud-based services to simulate real-world use cases.\nActively contributed to the integration of **cloud services**, ensuring scalability and performance of applications during testing cycles, while adhering to software compliance standards.\nMonitoring the effectiveness of testing processes and continuously refining approaches to improve overall QA productivity and software quality metrics."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Golang, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI testing\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\ttest automation, Defect tracking tools, QA methodologies, functional testing, regression testing, SCRUM, Agile, interpersonal skills, time management, attention to detail"
}