{
  "name": "Tomasz Lee",
  "role_name": "Machine Learning Specialist",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Machine Learning Specialist with 9+ years of extensive experience in developing innovative machine learning solutions. Proficient in **Python**, **NLP**, and **deep learning** techniques, specializing in **supervised learning**, **unsupervised learning**, and **reinforcement learning**. Proven expertise in **probabilistic modeling** and using **ML frameworks** to build and evaluate advanced models. Demonstrated ability to manage and optimize **cloud-based workflows**, ensuring efficient data processing and model deployment. Strong communicator with the capability to translate complex technical concepts into understandable language for cross-functional teams and stakeholders. Previously, designed and developed complex applications utilizing **.NET**, **C#**, and frontend technologies like **ReactJS**, and **NextJS**, ensuring robust performance and optimized processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Machine Learning Specialist",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Applied advanced machine learning techniques including **supervised learning**, **unsupervised learning**, and **reinforcement learning** for developing predictive models, enhancing decision-making accuracy by 30%.\nUtilized **Python** and various **ML frameworks** to implement algorithms for processing and analyzing large datasets effectively.\nDeveloped and deployed **cloud-based workflows** to streamline data processing pipelines, increasing operational efficiency by 25%.\nConducted rigorous testing and evaluation using **evaluation rubrics** to ensure model performance and reliability.\nImplemented **transformers** and other advanced **NLP** techniques to improve text processing tasks, resulting in a 20% increase in extraction accuracy.\nCollaborated with data scientists and stakeholders to communicate findings and insights clearly, ensuring alignment with business goals and strategies.\nDesigned and executed experiments to benchmark models, leading to a documentation of performance that informed future project directions.\nWorked on integrating **deep learning** architectures into existing systems to enhance feature extraction capabilities in complex datasets.\nPerformed probabilistic modeling to better understand data distributions, achieving a better fit in predictive modeling of user behavior."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **Python** and **Machine Learning frameworks** to develop and implement machine learning models, enhancing data-driven decision-making by 20%.\nUtilized **NLP** techniques to preprocess and analyze text data, achieving a 15% improvement in sentiment analysis accuracy.\nDesigned robust **supervised** and **unsupervised learning** algorithms, increasing predictive analytics capabilities by 25%.\nApplied **deep learning** methodologies utilizing frameworks like TensorFlow and PyTorch to build complex models that improved performance metrics by 30%.\nCreated and maintained cloud-based workflows for data processing and model training using **AWS** and **Google Cloud**, streamlining operations and reducing bottlenecks by 20%.\nDeveloped comprehensive evaluation rubrics for model performance assessment, leading to a 35% increase in model accuracy on test sets.\nConducted regular workshops on **reinforcement learning** and **probabilistic modeling**, boosting team knowledge and application of advanced analytics techniques.\nCollaborated with cross-functional teams to ensure clear communication of project goals and timelines, contributing to a 40% increase in project delivery speed.\nEngaged in continuous improvement of machine learning models, iterating on design and implementation based on feedback, which reduced errors by 30%.\nCreated cohesive reports and visualizations using tools like **Matplotlib** and **Seaborn**, enhancing stakeholder understanding of model results and trends."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Applied machine learning techniques including supervised and unsupervised learning to analyze large datasets, resulting in actionable insights for data-driven decision making.\nUtilized **Python** and **ML frameworks** to develop predictive models that improved forecasting accuracy by 30%.\nExecuted NLP strategies to enhance text processing capabilities, increasing data extraction efficiency by 25%.\nImplemented deep learning algorithms and reinforcement learning techniques to solve complex problems, achieving a 15% increase in model performance metrics.\nDeveloped probabilistic models for analyzing uncertainty and variability in data, which informed project risk assessments.\nCollaborated on cloud-based workflows to streamline data processing and model deployment in AWS and Azure, reducing operational overhead by 40%.\nCreated evaluation rubrics to assess model performance, ensuring compliance with project standards and improving deployment timelines by 20%.\nMaintained clear communication with stakeholders to report project progress and results, facilitating better alignment with business objectives.\nProvided technical support for integrating advanced NLP methods such as **transformers** into existing workflows, enhancing system capabilities.\nParticipated in regular team meetings to discuss project updates, align on technical objectives, and review code contributions."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Database Systems**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n**Cloud & Infrastructure**\n\tAWS, Azure, cloud-based workflows, CI/CD pipelines\n\n**Machine Learning**\n\tPython, machine learning, NLP, data science, supervised learning, unsupervised learning, deep learning, reinforcement learning, probabilistic modeling, ML frameworks, transformers, applied NLP\n\n**DevOps**\n\tGit, GitHub, CI/CD pipelines\n\n**Testing Tools**\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\n**Blockchain**\n\tSolidity, Ether.js, Web3.js, Ethereum\n\n**Other Skills**\n\tUX/UI Design, clear communication"
}