{
  "name": "Tomasz Lee",
  "role_name": "Senior Sailpoint Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Sailpoint Engineer with 9+ years of experience in Identity Access Management (IAM) and connector development. Proficient in **Sailpoint**, **SAP**, **GRC**, and **Ariba**, with a strong background in access provisioning and JML lifecycle management. Highly skilled in policy management and leveraging OOTB connectors for streamlined operations. Additionally, I possess strong analytical and troubleshooting skills, complemented by excellent communication abilities. My technical expertise includes a robust understanding of software development processes, with hands-on experience in architecting microservices and distributed systems using technologies such as **.NET**, **C#**, **ReactJS**, **NextJS**, and cloud services. Recognized for delivering high-quality solutions and effectively leading cross-functional teams to successful project completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sailpoint Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Led the development of identity access management solutions leveraging **Sailpoint** to enhance security and streamline **IAM** processes across platforms.\nDesigned and implemented **JML lifecycle** management strategies to optimize **access provisioning**, improving onboarding and offboarding efficiency by 30%.\nDeveloped and customized **OOTB connectors** to integrate with **SAP** and **Ariba**, improving data synchronization and compliance tracking.\nConducted thorough policy management audits within **GRC** frameworks, enhancing governance and risk management processes.\nUtilized analytical skills to troubleshoot issues related to connector development, reducing resolution times by 50%.\nCollaborated effectively with cross-functional teams, employing strong communication skills to align project goals and objectives.\nCreated detailed documentation and training materials to facilitate the onboarding of new team members in **Sailpoint** best practices.\nEngaged stakeholders through regular updates and feedback sessions, fostering transparency and project alignment.\nImplemented strategies to enhance user experience and system performance, leading to increased stakeholder satisfaction by 20%."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Sailpoint** for effective **IAM** solutions, improving access provisioning processes by up to **20%**.\nDeveloped and managed **GRC** policies to ensure compliance with **SAP** and **Ariba** integrations, enhancing security measures.\nLed the transformation of the **JML lifecycle**, implementing automation strategies that decreased manual processes by **30%**.\nConducted connector development for multiple systems, maximizing the use of **OOTB connectors** for increased deployment efficiency.\nApplied analytical skills to troubleshoot and resolve access issues, boosting resolution speed by **25%**.\nImplemented best practices in policy management, fostering a robust framework for ongoing compliance and risk management.\nFacilitated communication with cross-functional teams to gather requirements, ensuring alignment with project timelines.\nProvided documentation and training on best practices for new members, enhancing team capabilities in **Sailpoint** functionality.\nConducted regular audits of IAM processes to identify areas for improvement, leading to optimized access controls and reduced security risks."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented and managed **Sailpoint** for access provisioning across various systems, enhancing IAM processes.\nDeveloped connectors for **SAP** and **Ariba**, streamlining the JML lifecycle and improving policy management through effective integration.\nDesigned and executed 5 OOTB connectors, significantly reducing development time for new integrations by 30%.\nUtilized analytical skills to troubleshoot and resolve incidents, decreasing system downtime by **15%**.\nCollaborated with cross-functional teams to ensure compliance with GRC objectives, enhancing overall governance effectiveness.\nConducted detailed communication with stakeholders to gather requirements, ensuring alignment with organizational goals.\nParticipated in the design and implementation of security policies to safeguard sensitive information, thereby increasing data integrity.\nProvided training and technical documentation for team members on **Sailpoint** functionalities, promoting knowledge sharing and skill enhancement.\nMaintained and improved existing connector development practices, resulting in a **20%** increase in efficiency during the integration processes."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tSailpoint, IAM, SAP, GRC, Ariba, access provisioning, JML lifecycle, connector development, policy management, OOTB connectors\n\n**Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis; Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest; UX/UI Design, Git, GitHub, analytical skills, communication skills, troubleshooting",
  "apply_company": "RM Group (Switzerland)"
}