{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cloudnative Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Experienced Senior Cloud-native Engineer with 8 years of expertise in **Kubernetes**, **Golang**, and **microservices architecture**. Proficient in developing **cloud-native** applications utilizing **containers** and **distributed systems**, I have a robust background in building high-performance solutions for healthcare and financial sectors. My technical skillset includes modern JavaScript/TypeScript, **Python**, and **Flutter**, as well as frameworks and libraries like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have significant cloud experience with **Azure** and **AWS**, leading the enterprise-level platforms that incorporate automation and adhere to compliance standards such as HIPAA and PCI DSS. I excel in creating developer tools and implementing CI/CD automation processes, ensuring productivity and teamwork. Additionally, I possess hands-on experience in deploying machine learning pipelines, servicing ML models in production, and utilizing **MLflow**, **Airflow**, and **Kubeflow** for MLOps workflows.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloudnative Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Kubernetes** for orchestrating containerized applications in a **cloud-native** environment, ensuring seamless deployment and scaling across distributed systems.\nArchitected microservices-based solutions to enhance application performance, reliability, and maintainability, leading to a **30%** decrease in response times.\nEmployed **Golang** to develop efficient backend services, enhancing system throughput with a **25%** increase in handling concurrent requests.\nImplemented CNCF best practices and open-source developer tools to streamline workflows and automate deployments, reducing manual intervention by **40%**.\nDesigned and deployed high-availability microservices using **containers**, facilitating easier management and orchestration through **Kubernetes**.\nCollaborated with cross-functional teams to drive automation initiatives and improve teamwork, significantly increasing project delivery speed by **20%**.\nManaged CI/CD pipelines utilizing **automation** tools, resulting in faster release cycles and improved application stability.\nContributed to the enhancement of distributed system architectures, ensuring robust performance and fault tolerance in complex environments."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Employed **Kubernetes** to manage container orchestration for microservices, enhancing deployment efficiency and scalability in distributed systems.\nDesigned and developed cloud-native applications utilizing **Golang** and advanced **microservices** architecture, resulting in a **30%** increase in system performance and reliability.\nLeveraged **CNCF** tools and open-source frameworks to streamline development processes, promoting automation and reducing deployment times by **40%**.\nCollaborated closely with cross-functional teams to implement developer tools that facilitated continuous integration and delivery, improving overall team productivity.\nUtilized containers to encapsulate applications, ensuring consistent environments across development, staging, and production while reducing environment drift by **80%**.\nParticipated in knowledge sharing sessions to foster teamwork and enhance technical expertise across the organization, encouraging the adoption of cloud-native best practices.\nImplemented monitoring and logging solutions to maintain high visibility of the system's health and performance, ensuring proactive identification of issues and system optimizations."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Kubernetes** for orchestration in deploying scalable **microservices**, enhancing global e-commerce platform performance while ensuring service reliability and seamless updates during active deployment cycles.\nEngineered containerized applications utilizing **Golang** to create efficient, cloud-native services that support **distributed systems**, resulting in improved resource utilization and faster response times.\nAutomated infrastructure provisioning and management using **cloud-native** tools, significantly improving deployment speed by **30%** and reducing downtime to **5%** or less during updates.\nCollaborated cross-functionally to integrate **developer tools** for enhanced automation and continuous integration/continuous deployment (CI/CD) pipelines, streamlining workflows and increasing team productivity by **25%**.\nImplemented solutions based on **CNCF** principles, enhancing system robustness and agility in adapting to market changes in the e-commerce sector.\nDeveloped and managed containerized applications with a focus on high availability, enabling responsive application behavior under load with a **99.9%** uptime.\nFostered teamwork within agile squads to devise and execute strategies for maintaining a cohesive cloud-native architecture, maintaining adherence to industry best practices and open-source methodologies."
    }
  ],
  "skills": " **Programming Languages:**\n\tGolang, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tNginx, Keycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tmicroservices, distributed systems, cloud-native, automation, open-source, CNCF, developer tools, teamwork",
  "apply_company": "vCluster"
}