{
  "name": "Andrzej Ito",
  "role_name": "Tooling Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Tooling Engineer, I possess extensive expertise in **Solidworks** and **Mold Flow**, with over 9 years of experience in designing and developing effective tooling solutions that align with DFM (Design for Manufacture) principles. I am skilled in **injection mold tooling**, **LSR tooling**, and implementing **scientific molding practices** to enhance product quality and reduce development time. My strengths include strong analytical problem-solving abilities, exceptional customer communication, and a commitment to continuous improvement and process development. A self-starter with excellent organizational skills, I excel in leading teams to drive innovative solutions and foster a culture of flexibility and teamwork.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Tooling Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Apply **Solidworks** for precise tooling concepts and designs to support DFM (Design for Manufacture) in the development of injection mold tooling.\n• Utilize **Mold Flow** analysis to enhance the efficiency of **scientific molding practices**, ensuring robust process development in tooling design.\n• Exhibit strong **customer communication** skills to align project objectives and tooling specifications with client requirements.\n• Drive **continuous improvement** initiatives by analyzing tooling processes and implementing innovative solutions for productivity enhancement.\n• Leverage **analytical problem-solving** abilities to resolve complex tooling challenges in a timely manner.\n• Demonstrate exceptional **organization skills** to manage multiple tooling projects within tight deadlines and evolving specifications.\n• Maintain **flexibility** to swiftly adapt to changing project demands and collaborate across teams seamlessly.\n• Proven **self-starter** mentality, leading independent research towards optimizing **injection mold tooling**, resulting in a **20%** reduction in production errors.\n• Oversee the implementation of **process development** strategies that meet both quality standards and production timelines, reducing cycle times by as much as **15%**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Utilized **Solidworks** for tooling design and development, leading to a **25%** improvement in manufacturing efficiency.\n• Implemented **Mold Flow** analysis to optimize tool design, resulting in a **15%** reduction in cycle time.\n• Developed processes using **scientific molding practices** to ensure quality and precision in production, achieving a **99%** customer satisfaction rate.\n• Collaborated with cross-functional teams for **customer communication**, facilitating understanding of tooling needs and enhancing service delivery.\n• Enhanced **design for manufacture (DFM)** practices, ensuring all designs adhered to manufacturing capabilities.\n• Executed continuous improvement initiatives, improving tool reliability and reducing downtime by **30%**.\n• Participated in the development of **LSR tooling** to expand production capabilities.\n• Applied analytical problem-solving techniques to identify and resolve production issues, maintaining a focus on quality and efficiency.\n• Demonstrated flexibility in adapting designs based on feedback and evolving customer requirements, leading to a strong rapport with stakeholders.\n• Organized project timelines and deliverables effectively, ensuring on-time project completion as a self-starter with minimal supervision."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "- Leveraged **Solidworks** for tooling concepts and design, enhancing product developability, ensuring alignment with **DFM (Design for Manufacture)** principles.\n- Executed process development strategies, focusing on **injection mold tooling** processes, which resulted in a **15% increase** in efficiency.\n- Applied **Mold Flow** analysis to optimize tooling designs, achieving a **20% reduction** in cycle time during production.\n- Engaged in **customer communication** to ensure project requirements are met, resulting in **98% customer satisfaction** on tooling projects.\n- Championed continuous improvement initiatives, implementing scientific molding practices that led to a **30% decrease** in defects.\n- Organized and facilitated training sessions on **LSR tooling** techniques, promoting skill advancements among team members.\n- Maintained a flexible approach to problem-solving, ensuring that analytical methods were employed to address challenges effectively in tooling processes.\n- Demonstrated strong organizational skills by managing multiple projects simultaneously, maintaining adherence to deadlines and quality standards."
    }
  ],
  "skills": " **Programming Languages** \n\t Java, C++, C#, Python, SQL, PLSQL, Kotlin \n\n **Backend Frameworks** \n\t Spring, Spring Boot, Hibernate, Struts, JPA, Node.js \n\n **Frontend Frameworks** \n\t React, Vue, Angular \n\n **API Technologies** \n\t SOAP, REST APIs, Microservices \n\n **Databases** \n\t MS SQL Server, Oracle, MongoDB, PostgreSQL, Redis \n\n **Other** \n\t Tooling concepts/design, DFM (Design for Manufacture), Solidworks, Mold Flow, Injection mold tooling, Scientific molding practices, Process development, LSR tooling, Customer communication, Continuous improvement, Analytical problem-solving, Organization skills, Flexibility, Self-starter, SOLID, DRY, LINQ, Rabbit MQ"
}