{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Fullstack Engineer with 8 years of comprehensive experience in building high-performance applications leveraging **Java**, **SpringBoot**, **Node.js**, **React**, **Vue**, and extensive cloud infrastructure with **AWS** and **Azure**. Adept in Agile methodologies, with a proven track record in employing **Git**, **Jira**, and maintaining **Clean Code** practices to ensure streamlined development processes. \n\nPioneered enterprise-grade solutions in the healthcare and financial domains, integrating advanced features for user experience enhancement while ensuring compliance with standards such as HIPAA and PCI DSS. Expert in delivering structured, maintainable code and fostering team collaboration using **Agile**, **Scrum**, and **Kanban** frameworks. My background includes hands-on experience with **CI/CD automation**, microservices architecture, and building scalable applications that prioritize both performance and security.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained enterprise-level applications utilizing **Java**, **SpringBoot**, **Node.js**, and modern front-end frameworks like **React** and **Angular** (version 17-18), ensuring adherence to **Clean Code** principles in an **Agile** environment.\n- Architected scalable solutions with a focus on high-quality code and effective design patterns, collaborating in a **Scrum** and **Kanban** setup to enhance productivity and project delivery.\n- Implemented CI/CD pipelines using **Git** for version control and integrated project management tools like **Jira** to track development progress and manage tasks effectively.\n- Built user interfaces with **Vue** (3.x) to create responsive and dynamic applications, optimizing for performance and user experience.\n- Led efforts to enhance application performance by employing best practices in coding and design, resulting in a **30%** increase in application responsiveness and user engagement.\n- Collaborated cross-functionally with teams to ensure seamless integration between front-end and back-end services, utilizing **Node.js** and **Java** APIs for robust functionality.\n- Conducted code reviews and provided mentorship to junior developers, fostering a culture of continuous improvement and knowledge sharing.\n- Created comprehensive documentation and technical specifications for ongoing and new projects, enabling better onboarding and team collaboration.\n- Monitored application performance and implemented relevant optimizations, achieving improved load times by **25%** and reducing downtime through proactive troubleshooting measures.\n- Engaged in regular sprint planning and review sessions, contributing to project retrospectives to enhance team processes and efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **SpringBoot** to develop robust back-end services, ensuring high performance and scalability for financial applications with **99.9% uptime**.\nLed the modernization of financial platforms by adopting a microservices-based architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), significantly boosting maintainability and throughput for high-volume transaction systems.\nDeveloped dynamic, user-focused front-end applications leveraging **React** (18), **Vue 3**, and **Angular**, while applying Redux Toolkit and **Tailwind CSS** to enhance the performance and responsiveness of financial dashboards and admin portals.\nImplemented CI/CD pipelines using **Git** and **Jira** for version control and project management, enhancing team collaboration and efficiency within an **Agile** framework (Scrum and Kanban).\nIntegrated event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus** to support real-time event processing, handling over **10,000 transactions per minute** ensuring seamless communication for alerts and compliance workflows.\nCreated and orchestrated ETL pipelines utilizing **Python**, **Apache Airflow**, and **Azure Data Factory**, enabling batch and real-time ingestion of financial data from multiple sources, leading to a **40% reduction** in data processing times.\nDesigned AI/ML-powered fraud detection systems with **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, leading to a **30% increase** in the identification of suspicious activities within banking systems through advanced transaction pattern analysis.\nDeveloped ML pipelines for credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, integrating model inference directly into backend services to support real-time decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable backend services using **Node.js** and **Java (SpringBoot)** for high-performance e-commerce applications, enhancing system reliability and processing efficiency for over **100,000 daily transactions**.\n• Collaborated with cross-functional teams using **Agile** methodologies (Scrum, Kanban) to deliver new features and improvements in a rapid deployment cycle, reducing time-to-market by **30%**.\n• Engineered responsive frontend applications using **React** and **Angular**, ensuring seamless user interactions and mobile compatibility, achieving an application performance score exceeding **95%** on Lighthouse.\n• Integrated cloud solutions with **AWS** and **Azure** for hosting, storage, and service orchestration, streamlining infrastructure management and reducing operational costs by **25%**.\n• Implemented version control and collaboration workflows using **Git** and **Jira**, enhancing team productivity through efficient tracking of project progress and task assignments.\n• Adhered to **Clean Code** principles to maintain high standards of code quality and readability, conducting regular code reviews that improved code health metrics by **20%**.\n• Built and optimized APIs for seamless integration between frontend and backend services, using RESTful principles to ensure consistent data flow and user experience.\n• Ensured adherence to security best practices across the platform, implementing authentication and authorization protocols with OAuth 2.0 and ensuring **GDPR** compliance for user data handling.\n• Produced comprehensive documentation and onboarding materials to enhance team knowledge sharing and project transparency, facilitating smoother transitions for new developers."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tSpringBoot, FastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tAngular, React, Vue\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tGit, Jira\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Clean Code, Agile, Scrum, Kanban",
  "apply_company": "RockstarDevelopers GmbH"
}