{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of experience in C/C++, Cloud services, and microservices architecture. Proficient in **Linux**, **AWS**, **Azure**, and **GCP**, with strong expertise in **Python** and **Golang** for scalable system development. Demonstrated ability in implementing **CI/CD** pipelines, utilizing **Terraform** for infrastructure as code, and executing network segmentation strategies. Skilled in developing high-performance, multithreaded applications while ensuring software debugging and effective troubleshooting. Solid background in designing and implementing distributed systems, adept at collaborating across different teams to achieve project objectives efficiently. Expertise also includes work with **Apache Kafka**, **RabbitMQ**, and **Redis** for robust, scalable applications.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Golang** for building robust microservices architecture, enhancing system scalability and performance.\nDesigned and deployed applications on **AWS**, **Azure**, and **GCP** to ensure high availability and effective cloud resource management.\nImplemented **CI/CD** pipelines using **Terraform** and Azure DevOps, achieving a **40%** reduction in deployment time.\nDeveloped multithreading solutions in **C/C++**, improving application efficiency and resource usage by **30%**.\nConducted software debugging and optimization, resulting in a **20%** decrease in execution errors across the platform.\nIntegrated **Docker** containers for consistent development and deployment environments, which facilitated collaboration across teams.\nLeveraged **Linux** environments for application deployment, ensuring a secure and scalable infrastructure.\nApplied network segmentation and **DPI** techniques to enhance data security and traffic management, aligning with industry standards.\nCollaborated with cross-functional teams to incorporate feedback into software features, ultimately improving user satisfaction metrics by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and developed cloud-based solutions using **AWS** and **Azure**, resulting in a 15% increase in team collaboration efficiency.\nImplemented **Microservices** architecture with **Python** and **Golang** for task orchestration and enhanced system scalability.\nUtilized **CI/CD** pipelines with **Terraform** and **GitHub Actions**, reducing production deployment errors by 30%.\nManaged **Containers** for development and deployment, optimizing resource utilization across cloud environments.\nCollaborated with cross-functional teams to define system requirements and development timelines, ensuring timely project delivery.\nConducted performance optimization using **Linux** environments, leading to a 25% boost in system performance.\nIntegrated high-performance **C/C++** modules for low-level software debugging and improved application throughput.\nDeveloped RESTful APIs accessing data through optimized **PostgreSQL** and **MySQL** queries, ensuring efficient data storage and retrieval.\nMentored junior developers by conducting code reviews and training sessions, significantly improving team productivity.\nCreated custom reports and dashboards using data visualization libraries for enhanced project tracking and reporting."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **Golang** to develop and optimize microservices, enhancing system performance by **30%**.\nLeveraged **AWS**, **Azure**, and **GCP** for deploying and managing cloud-based infrastructure, ensuring scalability and reliability.\nImplemented **CI/CD** pipelines using **Terraform**, reducing deployment time by **50%** and increasing delivery frequency.\nApplied **Multithreading** techniques to improve application responsiveness and handle concurrent processing effectively.\nDesigned and maintained **Network Segmentation** protocols to enhance security measures across the infrastructure.\nDeveloped software using **C/C++** and **Linux**, contributing to the integration of **DPI** and **IPSec** functionalities for better network monitoring and security.\nOptimized code and implemented **Software Debugging** methodologies to enhance system stability and reduce issues by **25%**.\nCollaborated with cross-functional teams to ensure project alignment and adherence to coding standards.\nParticipated in sprint planning and reviews, fostering communication and continuous improvement within the team.\nProduced comprehensive technical documentation to facilitate knowledge transfer and onboarding for new developers."
    }
  ],
  "skills": " **Programming Languages**\n\t C/C++, Python, Golang\n\n **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Microservices\n\n **Frontend Frameworks**\n\t HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t AWS, Azure, GCP, Cloud\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\t CI/CD, CI/CD pipelines, Terraform, Containers\n\n **Cloud & Infrastructure**\n\t Linux, Network Segmentation, NFV, Software Forwarding\n\n **Other**\n\t UX/UI Design, Git, GitHub, Redux, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Multithreading, DPI, IPSec, Software Debugging",
  "apply_company": "Arista Networks"
}