{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Product Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a results-driven Product Engineer with 8 years of full stack development experience, I excel in utilizing **Python** and **Django** to create high-performance solutions, particularly in the healthcare and financial sectors. My proficiency with **AWS**, along with modern frameworks like **Vue.js**, allows me to build scalable applications aligned with business requirements. I have hands-on experience in integrating AI tools for enhanced functionality, ensuring intuitive **UX/UI design** to improve user engagement.\n\nMy strong foundation in Agile methodology fosters effective collaboration and problem-solving within cross-functional teams, while my empathetic communication style ensures alignment with stakeholders. Additionally, I have developed autonomous systems and enhanced existing platforms, demonstrating my commitment to delivering robust solutions that meet stringent compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Product Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained scalable applications using **Python** and **Django** to enhance product functionality and drive user engagement across healthcare and financial platforms.\n- Collaborated with cross-functional teams applying **Agile methodology**, ensuring smooth communication and empathy towards user needs throughout product development cycles.\n- Integrated AI tools and implemented intelligent features that improved user experience and provided personalized recommendations to end-users.\n- Employed **AWS** for cloud infrastructure, ensuring secure, scalable, and reliable deployment of applications, contributing to a **99.9% uptime** on the services.\n- Worked closely with UX/UI design teams to create intuitive interfaces, leading to a **40% increase** in user satisfaction as measured via feedback surveys.\n- Actively engaged in problem-solving sessions to quickly identify issues and implement fixes, ensuring high standards of product quality and performance.\n- Demonstrated strong collaboration skills by leading workshops and brainstorming sessions with various stakeholders, resulting in a **30% faster** development cycle.\n- Participated in code reviews and testing strategies utilizing **Jest**, **Cypress**, and **PyTest** to maintain code quality and reliability of both front-end and back-end services.\n- Managed deployment pipelines with **AWS**, focusing on automation and efficiency, which reduced the release time by **50%** while maintaining robust security measures.\n- Leveraged **Vue.js** for the development of responsive user interfaces, ensuring cross-browser functionality and optimal loading times for end-users."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Django** to develop and modernize financial platforms, employing a microservices architecture to improve scalability and maintainability for high-volume transaction systems.\nLeveraged **Vue.js** and **React (18)**, alongside **Typescript**, to create dynamic, user-friendly front-end applications for financial dashboards, achieving a performance increase of **25%** through optimized UI experiences.\nCollaborated in an Agile environment, emphasizing communication and empathy to ensure cross-functional alignment and problem-solving among teams.\nIntegrated **AI tools** into applications for advanced features like fraud detection, applying scikit-learn and XGBoost to analyze transaction patterns and proactively flag suspicious activities.\nDesigned and implemented UX/UI solutions that enhanced user engagement, focusing on user feedback to inform design choices, increasing user satisfaction rates by **30%**.\nDeveloped and orchestrated ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory** for real-time data ingestion, successfully processing over **500,000** transactions daily from various sources.\nImplemented autonomous systems to support real-time event processing and communication utilizing **Kafka**, **RabbitMQ**, and **Azure Service Bus** for improved transaction alerting and compliance workflows.\nExecuted ML pipelines for credit scoring and transaction classification, integrating model inference into backend services for real-time decisions, improving accuracy of predictions by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** (Django) to design and optimize backend services, ensuring high availability, low latency, and scalability for e-commerce applications, resulting in a **20%** improvement in response times across key modules like checkout and order fulfillment.\nEmployed **AWS** for cloud services management, enhancing system reliability and facilitating seamless deployment and scaling of applications by **30%**.\nCollaborated on Agile methodology-driven teams, fostering communication and empathy among cross-functional stakeholders to prioritize feature development, resulting in a **15%** increase in team efficiency and output.\nEngineered AI tools for personalized product recommendations, successfully utilizing machine learning frameworks to boost conversion rates by **25%** based on real-time user behavior analysis.\nDesigned responsive and user-friendly interfaces using **Vue.js** and HTML5/CSS3, optimizing for mobile-first engagement and achieving a **40%** drop in bounce rates.\nImplemented robust problem-solving strategies to troubleshoot critical issues in production, significantly reducing downtime incidents by **50%**.\nFacilitated collaboration sessions to gather user feedback, ensuring that UX/UI design aligns with customer expectations and improves overall user satisfaction scores by **20%**.\nOptimized autonomous systems for inventory management through real-time updates and event-driven architecture, increasing operational efficiency by **30%**.\nLeveraged secure payment processing integrations with **Stripe** and **PayPal**, achieving PCI compliance and enhancing customer trust in the payment workflows.\nApplied effective communication skills to articulate technical concepts to non-technical stakeholders, ensuring clarity and shared understanding in project goals and progress."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tDjango, FastAPI, Flask\n\n **Frontend Frameworks:**\n\tVue.js, React, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, AI tools, UX/UI design, Autonomous systems, Agile methodology, Problem-solving, Collaboration, Empathy, Communication"
}