{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior PowerBI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior PowerBI Engineer with 8 years of experience in data architecture, ETL processes, and advanced analytics within the healthcare and financial sectors. Expertise in **PowerBI**, **DAX**, **Power Query**, and **Dataflows** enables me to transform complex data into actionable insights, while my background in **SQL Server** ensures robust data modeling. Adept at designing APIs and seamless integrations for enhanced reporting capabilities. Proven ability to streamline data processes and implement effective solutions that optimize business intelligence operations. \nPossessing strong communication skills, I excel in collaborating cross-functionally to understand business needs and drive cloud-based solutions in **Azure**. Additionally, my comprehensive technical experience includes a solid foundation in **Python** for advanced data manipulation and automation, as well as knowledge of MLOps using tools like **MLflow** and **Airflow** for machine learning projects.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior PowerBI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented robust data architecture solutions utilizing **SQL Server**, **Azure**, and **ETL** processes to support scalable reporting and analytics for healthcare and financial platforms.\nDeveloped intricate data modeling strategies using **PowerBI**, **DAX**, and **Power Query**, resulting in streamlined reporting and enhanced insights from large datasets.\nExecuted dataflows to automate data integration and transformation tasks, ensuring data cleanliness and accuracy for client-facing applications.\nCollaborated with stakeholders to gather requirements and facilitate effective communication regarding reporting needs, enhancing operational efficiency and decision-making.\nUtilized **APIs** to extract and integrate data from various sources, ensuring seamless data flow for business intelligence applications.\nExecuted complex data visualizations on **PowerBI**, delivering insights that improved transaction trends analysis, fraud detection, and KPIs monitoring.\nPerformed data transformation and loading processes (ETL) to ensure robust data pipelines for reporting, enhancing efficiency by **25%** over previous workflows.\nDesigned and maintained dashboards and reports adhering to best practices in data presentation, positively impacting user engagement and satisfaction.\nProvided analytical support and training to end-users, boosting utilization of **PowerBI** features and empowering teams for self-service analytics.\nEngaged in continuous learning of latest **Azure** features to incorporate advanced analytics functionalities into existing solutions, maintaining competitive edge in the market."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Power BI** and **DAX** for designing and implementing interactive dashboards, enabling data-driven decision-making by optimizing data visualization across multiple financial platforms.\nEmployed **Power Query** for data transformation processes, ensuring accurate dataflows and efficient handling of data modeling to meet business requirements in **SQL Server** environments.\nCollaborated on data architecture strategies, including the development of APIs to enhance data accessibility and facilitate seamless integrations with financial applications and services.\nExecuted ETL processes leveraging **Azure** Data Factory, enabling robust data ingestion workflows from diverse sources while maintaining high data integrity and availability.\nCreated dataflows that streamlined the extraction, transformation, and loading of large datasets, improving reporting time by **30%**.\nCommunicated complex data insights to stakeholders effectively, ensuring clarity in reports and analyses presented through **Excel** and **Power BI** visualizations.\nDeveloped relational data models within **Power BI**, contributing to a **15%** increase in report performance and enabling quick access to key financial metrics.\nFostered team collaboration and knowledge-sharing sessions, enhancing understanding of data analytics principles and their application in financial reporting and compliance."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized effective data architecture and ETL processes using **SQL Server** and **Azure**, ensuring data integrity and accessibility for reporting and analytics within corporate workflows.\nLeveraged **PowerBI** and **DAX** to create insightful dashboards and reports that enhance data visualization and decision-making capabilities across departments.\nUtilized **Power Query** and **Dataflows** to transform and clean data from multiple sources, streamlining data preparation steps and improving overall data quality by **30%**.\nConducted data modeling to ensure robust data structure that supports effective reporting solutions, aligning with business strategies and objectives.\nIntegrated **APIs** for seamless data exchange across systems, enhancing system interoperability and reducing manual data entry.\nCollaborated effectively with cross-functional teams to gather requirements and deliver tailored data solutions, enhancing team communication and project outcomes.\nImplemented advanced analytical techniques and proven Excel skills to conduct data analysis, yielding significant insights into actionable strategies and improving performance metrics by **20%**.\nPresented findings and recommendations to stakeholders, using strong communication skills to convey complex data insights in an understandable manner.\n\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL Server\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure\n\n**Other:**\n\tPowerBI, DAX, Power Query, Dataflows, data modeling, ETL, Excel, communication",
  "apply_company": "syffer"
}