{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Technical Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Technical Engineer with 8 years of experience, I possess extensive expertise in **Linux**, **SQL**, and **Database** management, providing exceptional technical support and documentation in high-performance solutions. My strong foundation in **Bash** and **Shell** scripting complements my abilities in **Windows** and **Networking** environments, ensuring robust system performance and reliability. My experience includes leading cross-functional teams to build and optimize enterprise-grade platforms in the healthcare and financial sectors using **JavaScript**, **TypeScript**, **Python**, and **Flutter** technologies. \n\nI have a proven track record in full-stack development with frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, while also leveraging **Azure** and **AWS** cloud services for seamless deployment. I specialize in integrating AI/ML capabilities into applications for predictive analytics and real-time data processing, along with strong knowledge in microservices architecture and event-driven systems. My contributions adhere to compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2, ensuring secure application development.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Technical Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Provided **technical support** across various platforms including **Linux**, **Windows**, and **server** environments, ensuring optimal functionality and user satisfaction.\n- Created and maintained thorough **documentation** for system architecture, processes, and troubleshooting techniques to streamline onboarding and training for new team members.\n- Analyzed and managed databases, utilizing **SQL** for intricate queries and optimizations, leading to a **20%** improvement in data retrieval times.\n- Developed and automated **Bash** and **Shell** scripts for routine tasks and system monitoring, reducing manual workload by **30%**.\n- Monitored and enhanced **networking** performance, applying effective troubleshooting strategies to maintain reliable connectivity and uptime, resulting in a **99.9%** system availability.\n- Led successful migration projects to improve server environments, enhancing performance and security across **9** key applications.\n- Collaborated with cross-functional teams to identify and resolve escalated technical issues, achieving a **95%** first-contact resolution rate.\n- Conducted rigorous testing and optimization on network systems, establishing **best practices** that resulted in significantly decreased latencies.\n- Mentored junior technical staff, sharing knowledge and skills in Linux, SQL, and networking to foster a collaborative and innovative work environment."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Provided **technical support** for various **Linux** and **Windows** servers, ensuring seamless operation and uptime of critical financial applications.\n- Developed and maintained **SQL** databases, optimizing query performance and ensuring data integrity to support high-volume transaction processing.\n- Created comprehensive **documentation** for system architectures, processes, and best practices to enhance team collaboration and onboarding.\n- Utilized **Bash** and **Shell** scripting to automate routine tasks, improving operational efficiency by **30%**.\n- Conducted network troubleshooting and established secure connections, facilitating reliable communication between financial platforms and external services.\n- Collaborated with cross-functional teams to ensure robust **networking** solutions are in place to support event-driven architecture using tools like **Kafka** and **RabbitMQ**.\n- Championed server performance monitoring, maintaining an uptime of **99.9%** across multi-tier applications deployed on various infrastructures.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Provided **Technical Support** for Linux and Windows environments, ensuring optimal server performance and reliability.\n- Developed and maintained comprehensive **Documentation** for system configurations and network setups to enhance knowledge sharing and onboarding processes.\n- Reviewed and optimized **SQL** database queries to improve data retrieval times by up to **30%**, ensuring seamless application performance.\n- Automated routine server maintenance tasks using **Bash** and shell scripts, increasing operational efficiency and reducing manual effort by **25%**.\n- Monitored and configured **Networking** protocols to enhance system security and data integrity across multiple servers or environments, resulting in a **40%** reduction in downtime incidents.\n- Assisted in the setup and administration of database servers with a focus on **Database** design and management, contributing to an efficient storage architecture that supported applications.\n- Collaborated with cross-functional teams to diagnose and resolve technical issues within strict timelines, enhancing overall system reliability by **20%**.\n- Provided training and guidance on technical support procedures, improving team performance and reducing ticket resolution time by **15%**."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript, TypeScript, SQL\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\t\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tLinux, Windows, Networking\n\n **Other:** \n\tBash, Shell, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Technical Support, Documentation",
  "apply_company": "Contabo"
}