{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior AI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior AI Engineer with 13+ years of experience specializing in **Python**, **TypeScript**, and **AI agents** development, including **LLMs** and **prompt engineering**. Proven expertise in **DevOps** practices and **CI/CD** pipelines, ensuring efficient and scalable deployment of AI solutions. Skilled in cloud technologies, proficiently deploying applications on **AWS** and **Azure**.\n\nExtensive experience in building high-performance applications that leverage AI/ML capabilities, supporting predictive analytics and automation in the healthcare and financial sectors. Adept in the development of compliance-driven solutions in alignment with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Strong communicator with a solid background in MLOps, employing evaluation frameworks and orchestration strategies using **MLflow**, **Airflow**, and **Kubeflow** to enhance project efficiency.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and built full-stack platforms leveraging **Python** (FastAPI) and **TypeScript** to enhance AI-driven features and prompt engineering.\n• Developed and deployed AI agents utilizing LLMs for advanced predictive analysis and user interaction in applications, improving user experience and operational efficiency.\n• Built and maintained CI/CD pipelines for AI model deployment using **DevOps** practices and tools such as GitHub Actions, ensuring seamless integration and delivery of AI solutions.\n• Collaborated on evaluation frameworks to assess AI model performance and effectiveness in both healthcare and fintech sectors, resulting in a **25% reduction** in model deployment times.\n• Engaged in effective communication with cross-functional teams to translate AI concepts into practical applications, enhancing project alignment and stakeholder engagement.\n• Delivered mobile applications integrating AI features for iOS and Android using **Flutter** and **React Native**, optimizing real-time user interactions with native modules.\n• Created and tuned robust infrastructure to support machine learning workloads on **AWS** and **Azure** platforms, utilizing services like **AWS Lambda** and **Azure Functions** for fault-tolerant deployments.\n• Integrated advanced analytics capabilities into applications with **PostgreSQL** and **MongoDB**, facilitating high-volume data ingestion and real-time insights.\n• Developed DevOps strategies for the deployment of machine learning models, resulting in streamlined workflows and improved model availability by **30%**.\n• Implemented MLOps practices with **MLflow** and **DVC**, enhancing model lifecycle management from development to production environments.\n• Employed testing strategies using tools like **Jest** and **Cypress** to maintain code quality across AI projects, achieving over **90%** test coverage for critical components.\n• Enhanced applications with intelligent search capabilities by integrating **Azure Cognitive Search** and **Elasticsearch**, improving data retrieval times significantly."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** for the development and deployment of AI agents that enhance communication and prompt engineering capabilities across systems, ensuring efficient operation and user interaction.\nLeveraged **TypeScript** to build and maintain scalable codebases, supporting better development workflows and integration within the team, facilitating seamless collaboration.\nImplemented **DevOps** practices including CI/CD, optimizing deployment processes for AI applications while ensuring high availability and reliability through automated testing and integration processes.\nConducted thorough evaluations using various **evaluation frameworks** to track performance standard metrics of AI models, refining and enhancing their capabilities based on data insights.\nLeveraged cloud solutions to deploy scalable AI solutions within **AWS** and **Azure**, maximizing resource allocation and agility for AI models and ensuring robust performance.\nCollaborated across teams to enhance communication regarding project timelines and AI model performances, articulating complex concepts to non-technical stakeholders and ensuring alignment with business objectives.\nImplemented version control best practices to manage AI models and CI/CD pipelines efficiently, improving team productivity and reducing deployment errors by **30%**.\nIntegrated advanced **AI technologies** into existing workflows, achieving a **25%** reduction in manual intervention for routine tasks and increasing overall operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** (FastAPI, Django) and **TypeScript** to design and optimize backend services, achieving a **99.9%** uptime for a global e-commerce platform.\nEngineered real-time features leveraging **WebSockets** and an event-driven architecture with **Kafka** and **RabbitMQ**, resulting in timely order updates and dynamic inventory tracking, enhancing user experience by **30%**.\nDeveloped robust AI-driven solutions through prompt engineering and **LLM** frameworks, integrating AI agents to personalize user interactions across the platform, improving engagement metrics by **25%**.\nImplemented CI/CD practices using **DevOps** tools, ensuring seamless deployments and reducing deployment times by **50%**, enhancing efficiency and reliability of the development cycle.\nEmployed **Cloud** services for scalable infrastructure, optimizing resource management and reliability during peak traffic periods, ensuring **99.8%** scalability.\nCollaborated with cross-functional teams to establish evaluation frameworks for ongoing project assessments, improving project communication and alignment.\nIntegrated frontend applications using **React** (18), **Vue 3**, and **Angular**, enhancing user experiences on web and mobile devices while maintaining responsive design standards.\nImplemented **Redis** caching strategies that decreased data access times by **40%**, significantly improving application responsiveness.\nBuilt secure payment workflows using **Stripe**, **PayPal**, and **Razorpay**, adhering to PCI compliance for sensitive data handling.\nApplied role-based access control (**RBAC**) and **OAuth 2.0** to ensure secure customer and admin access, reinforcing GDPR compliance and user data protection measures."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCloud\n\n**Other:**\n\tprompt engineering, LLMs, AI agents, evaluation frameworks, communication",
  "apply_company": "Rounds"
}