{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Backend Engineer with over 10 years of experience crafting high-performance software solutions, specializing in **.NET**, **.NET Core**, and cloud environments such as **Azure Cloud**. Highly proficient in implementing **APIs**, following Agile methodologies, and utilizing **Gitflow** for streamlined development workflows. Adept at employing **Design Patterns** and **Multithreading** techniques to optimize backend architectures. Experienced in CI/CD processes using tools like **Octopus Deploy** and **AppInsights** for effective monitoring, alongside utilizing **PowerShell** and **Docker** for environment management.\n\nExpert in creating scalable systems that leverage modern frameworks and libraries, with a strong foundation in building and deploying applications that meet strict compliance standards. A proven track record in leading projects in MLOps and event-driven architecture, driving innovation and enhancing automation within enterprise platforms. Committed to developing secure and maintainable solutions that have a measurable real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tEngineered robust APIs and microservices architectures using **.NET** and **.NET Core** to support backend functionalities in compliance with organizational standards.\n•\tImplemented CI/CD pipelines leveraging **Azure Cloud** services, including **Octopus Deploy** and **Gitflow**, ensuring efficient deployment processes and seamless integration into the software lifecycle.\n•\tEmployed design patterns and multithreading techniques to optimize application performance, achieving a **30% improvement** in response times across various services.\n•\tUtilized **Postman** and **ReadyAPI** for comprehensive API testing, ensuring reliability and functionality of backend services with a coverage of **90%**.\n•\tArchitected software solutions in an Agile environment, facilitating iterative development and continuous improvement cycles for project delivery.\n•\tManaged containerization and orchestration with **Docker** and **Azure AKS** to enhance deployment efficiency, achieving a **50% reduction** in deployment times.\n•\tDeveloped monitoring and logging solutions using **AppInsights**, enabling real-time performance tracking and analytics to ensure high availability and reliability.\n•\tExecuted unit and integration testing to maintain code quality and performance using **BDD** methodologies, improving code maintainability by **40%**.  \n•\tCollaborated with cross-functional teams to deliver projects on time, contributing to a **15% increase** in overall productivity through effective team communication and planning."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **.NET** and **.NET Core** to build scalable backend services, implementing robust APIs that adhere to design patterns and best practices for effective system architecture within an **Azure Cloud** environment.\nEmployed **Agile** methodologies to streamline project workflows, ensuring timely delivery of features and enhancements while promoting collaborative team dynamics.\nImplemented multithreading techniques to optimize performance of backend applications, resulting in a **30%** increase in response time for high-volume transaction processing.\nManaged version control and collaboration through **Gitflow**, maintaining an organized and efficient codebase for feature branches and releases.\nConducted automated testing and continuous integration/continuous deployment (CI/CD) practices employing **Octopus Deploy**, which reduced deployment times by **50%** and increased overall system reliability.\nDeveloped and documented robust APIs using Postman and **ReadyAPI**, ensuring thorough testing and validation ahead of deployment to production environments.\nMonitored application performance with **AppInsights**, proactively identifying and resolving issues to enhance user experience and system uptime.\nExecuted effective infrastructure deployments in **Docker** and on **Azure AKS**, ensuring portability and scalability of application deployments across environments, achieving faster delivery cycles.\nLeveraged **PowerShell** scripts to automate routine tasks and system management functions, enhancing operational efficiency.\nCollaborated closely with cross-functional teams to gather and refine business requirements, ensuring alignment between technical solutions and business goals through Behavior-Driven Development (BDD)."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **.NET** and **.NET Core** along with **Azure Cloud** technologies to design and optimize backend services for scalable e-commerce solutions, ensuring high availability and performance across transactional systems.\nApplied Agile methodologies and **Gitflow** for streamlined collaborative development, achieving a 30% improvement in team throughput during sprints.\nImplemented **APIs** following design patterns and built multithreaded services for efficient data processing, enhancing the application's capability to handle over **1000** concurrent users.\nConducted Behavior Driven Development (BDD) practices with **Postman** and **ReadyAPI** to ensure robust testing and service integrity, reported a 20% reduction in bugs entering production.\nDemonstrated expertise in **CI/CD** practices utilizing **Octopus Deploy** for automated deployment processes, achieving a deployment success rate of **98%** with minimized downtime.\nMonitored application performance and reliability utilizing **AppInsights**, providing actionable insights that led to a **25%** increase in response speed for backend services.\nAutomated environment provisioning and management through **PowerShell** and **Docker**, enhancing deployment efficiency and consistency across various environments.\nEngaged in the deployment of microservices with **Azure AKS**, ensuring efficient container orchestration and scaling as per traffic demands.\nEnsured maximum uptime and performance by implementing effective caching strategies and multithreading techniques in backend processes.\nCollaborated with frontend teams to develop well-structured APIs for seamless integration with user interfaces built using various JavaScript frameworks."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET, .NET Core\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs, Postman, ReadyAPI\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Azure AKS\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Octopus Deploy\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose, Azure Cloud\n\n **Other:**\n\tAgile, Gitflow, Design Patterns, Multithreading, BDD, AppInsights, PowerShell, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow",
  "apply_company": "Banking"
}