{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Web Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Web Engineer with 10+ years of experience in delivering high-performance software solutions, specifically focusing on **TypeScript**, **API integration**, and **gRPC**. Demonstrated proficiency in **dependency management** and **build tooling**, ensuring efficient development processes and high-quality deliverables. Skilled in **SDK development** and creating comprehensive documentation to enhance developer experience. Proven ability to collaborate effectively within teams while maintaining a strong sense of autonomy in project execution. \nDeep expertise across the full stack with technologies like **JavaScript**, **Python**, **React**, **Node.js**, and **FastAPI**, including hands-on experience in **cloud-native applications** deployed on **Azure** and **AWS**. Extensive background in designing enterprise platforms that leverage AI/ML for real-time analytics and automation, while adhering to compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about driving impactful solutions through innovative and secure software architecture.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tUtilized **TypeScript** for developing robust and scalable web applications, demonstrating high-level expertise in **API integration** and effective **dependency management** across projects.\n•\tLed the design and development of high-quality **SDKs** which enhanced the developer experience by simplifying integration processes with existing systems.\n•\tCollaborated with cross-functional teams to document API functionalities and enhance product features, ensuring a seamless implementation across all services.\n•\tImplemented and optimized build tooling processes, reducing build times by **30%**, thereby improving overall development efficiency.\n•\tActively engaged in code reviews and pair programming sessions to promote collaboration and autonomy within the development team, contributing to a culture of continuous learning and excellence.\n•\tDesigned and implemented scalable, full-stack solutions for healthcare and finance using **TypeScript**, Python (FastAPI), and Node.js, with modern frontends in React (17–18), Next.js, and Vue 3.\n•\tLed the re-architecture of monolithic applications into microservices-based ecosystems employing **Docker**, **Kubernetes** (AKS/EKS), and serverless architectures (AWS Lambda, Azure Functions).\n•\tBuilt and deployed cross-platform mobile apps with **Flutter** and **React Native**, integrating native modules and managing state with **Provider** and **Redux**.\n•\tOptimized cloud-native data architecture using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL** for large-scale data ingestion, storage, and queries.\n•\tDelivered machine learning models for patient risk prediction, financial fraud detection, and document classification utilizing **Python** frameworks such as **scikit-learn**, **PyTorch**, and **TensorFlow**.\n•\tEstablished enterprise-level **DevOps** pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI**, ensuring streamlined deployments across multi-environment setups.\n•\tIntegrated **Azure Cognitive Search** and **ElasticSearch** for enhanced searching capabilities across vast datasets, increasing retrieval speeds by **50%**.\n•\tImplemented testing strategies using **Jest**, **Cypress**, **PyTest**, and **Postman**, covering test types including unit, integration, and E2E testing across both front-end and backend services."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained high-quality web applications with a strong emphasis on **TypeScript** for enhanced type safety and code maintainability.\nImplemented gRPC for efficient API integration, resulting in improved communication between microservices and enhanced system performance by **30%**.\nUtilized robust dependency management practices to ensure smooth package updates and reduce build failures, contributing to a **20%** increase in development velocity.\nStreamlined build tooling processes to facilitate faster development cycles, leveraging tools for automation and improving developer experience across teams.\nDesigned and documented comprehensive SDKs to provide developers with easy access to essential functionalities, increasing usage by **40%** among internal and third-party partners.\nCollaborated closely with cross-functional teams to define and refine project requirements, ensuring alignment with business goals and enhancing overall product quality.\nExercised autonomy in problem-solving and project management, leading initiatives that improved workflow efficiency and team productivity.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** to develop robust, maintainable code for frontend applications, enhancing developer experience and collaboration across teams.\nDesigned and managed seamless **API integrations** ensuring high-performance communication between frontend and backend services, streamlining dependency management and boosting build tooling efficiency.\nDeveloped comprehensive documentation for implemented features and SDKs, facilitating knowledge sharing and improving the onboarding process for new developers by **30%**.\nEngineered solutions with collaborative coding practices to support autonomy within the development team, enabling efficient project execution and adherence to timelines.\nImplemented modern software development practices and tools, contributing to the overall developer experience and project quality, leading to a **25%** reduction in bug reports and issues.\nParticipated actively in team collaborations, refining processes that led to faster iteration cycles and improved feature deployment in a fast-paced environment.\nActively engaged in code reviews and pair programming sessions, fostering a culture of continuous learning and skill enhancement within the team, resulting in a **40%** increase in shared knowledge.\n"
    }
  ],
  "skills": "Programming Languages:\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tgRPC, API integration\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, dependency management, build tooling, SDK development, documentation, developer experience, collaboration, autonomy",
  "apply_company": "Justera Group"
}