{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Test Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Test Engineer with 10+ years of experience specializing in software testing, including risk-based testing and boundary testing in regulated environments such as healthcare and finance. Proficient in creating and executing test scripts utilizing **SQL** for database verification. Well-versed in black-box, white-box, and gray-box testing methodologies, complemented by a strong analytical thinking and problem-solving skill set. Proven ability to collaborate effectively in team settings and communicate complex technical information clearly.\n\nIn addition to core testing skills, I bring hands-on expertise in modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**, with full stack experience across **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**. Experienced in building and deploying cloud-native applications using **Azure** and **AWS**. My background includes leading teams to develop enterprise platforms incorporating AI/ML for enhanced analytics, while ensuring compliance with standards such as FDA regulations, HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about delivering reliable, impactful software solutions through rigorous testing and quality assurance practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Test Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped comprehensive test scripts for software applications in compliance with **FDA regulations**, emphasizing risk-based testing methodologies to ensure product safety and effectiveness.\n•\tExecuted black-box, white-box, and gray-box testing strategies, aiding in the identification of **9** critical defects prior to release, resulting in a **25%** reduction of post-deployment issues.\n•\tConducted boundary testing to ascertain application resilience and performance limits, successfully identifying and rectifying **7** edge cases that improved system stability.\n•\tUtilized SQL for database testing and validation, ensuring the integrity and accuracy of **10 million** records in health and financial applications.\n•\tCollaborated with cross-functional teams to communicate test status and findings, enhancing teamwork and fostering an environment of analytical thinking and problem-solving.\n•\tDesigned and executed manual and automated tests using tools such as Jest, Cypress, and Postman to cover unit, integration, and end-to-end testing scenarios across both frontend and backend services.\n•\tLed discussions on testing strategies and approaches that align with **regulatory requirements**, ensuring all applications adhered to critical compliance standards.\n•\tParticipated in continuous improvement initiatives to refine testing processes, resulting in a **15%** increase in testing efficiency and effectiveness over **1 year**.\n•\tMentored junior testers on best practices in software testing methodologies and promoted effective communication and teamwork within the testing team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Executed comprehensive software testing practices, including **black-box**, **white-box**, and **gray-box** testing methodologies, to ensure robust quality assurance of financial applications in adherence to FDA regulations.\nDeveloped and executed risk-based testing strategies to prioritize testing efforts, ensuring critical functionalities were thoroughly validated under various scenarios for **financial platforms**.\nCreated detailed **test scripts** and conducted **boundary testing** to identify edge cases in application performance, contributing to an overall defect reduction of **25%**.\nCollaborated effectively within cross-functional teams, enhancing communication across developers, product managers, and stakeholders to foster a culture of quality and continuous improvement in the testing process.\nUtilized **SQL** for writing queries to validate data integrity and accuracy within the financial transaction systems, ensuring alignment with business requirements and user expectations.\nEmployed analytical thinking and problem-solving skills to investigate defects and maintain a clear, organized log of issues identified during testing phases, reducing total bug resolution time by **15%**.\nParticipated in regular test strategy meetings and agile ceremonies, providing feedback and insights based on testing outcomes, contributing to overall process enhancement and team efficiency.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Applied analytical thinking and problem-solving skills to develop and execute comprehensive test scripts, ensuring compliance with **FDA regulations** for software quality assurance.\nConducted risk-based testing methodologies, incorporating **black-box**, **white-box**, and **gray-box** testing techniques to assess software functionality and identify critical defects in **SQL** databases across multiple platforms.\nCollaborated with cross-functional teams to enhance software reliability and performance, leveraging teamwork and communication skills to effectively address defects and implement improvements.\nExecuted boundary testing strategies that encompassed **SQL** queries to validate edge cases, ensuring robustness and reliability within the system.\nDesigned and implemented automated test scripts that increased testing efficiency by **30%**, significantly reducing manual testing efforts and improving software release cycles.\nProvided detailed documentation and reporting of testing outcomes, facilitating evidence-based decision making and guiding development efforts to align with user requirements.\nMentored junior testers in best practices of software testing, enhancing team skill set and fostering a culture of quality throughout the software development life cycle."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, SQL\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak, Nginx\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMachine Learning, MLflow, Airflow, Kubeflow, software testing, FDA regulations, risk-based testing, test scripts, black-box testing, white-box testing, gray-box testing, boundary testing, analytical thinking, problem-solving, teamwork, communication",
  "apply_company": "Suvoda"
}