{
  "name": "Tomasz Lee",
  "role_name": "Senior System Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior System Engineer with 9+ years of experience in Linux systems and Infrastructure as Code. Proficient in **Ansible**, **Python**, **Go**, and cloud services like **GCP**. Strong understanding of networking protocols including **TCP/IP**, **HTTP**, and **DNS**. Well-versed in DevOps methodologies and CI/CD pipelines, facilitating seamless software delivery. Exceptional track record in designing, developing, and implementing scalable applications, leveraging familiarity with microservices architecture and distributed systems. Proven leadership skills in collaborating across teams to drive development projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior System Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Executed Infrastructure as Code practices using **Ansible** for seamless configuration management across **Linux** environments, enhancing deployment efficiency by **30%**.\nDeveloped and maintained CI/CD pipelines on **GCP**, cutting down deployment times by **40%**.\nAutomated infrastructure provisioning with **Python** and **Go**, leading to improved scalability and quicker iterations in system deployments.\nMonitored and optimized network protocols such as **TCP/IP** and **HTTP** to ensure robust connectivity and performance across distributed systems.\nImplemented comprehensive DNS strategies to improve system reliability and reduce latency by **20%**.\nCollaborated closely with DevOps teams to maintain system integrity and performance, enhancing overall infrastructure stability.\nIntegrated best practices in DevOps methodologies to streamline workflows and reduce manual interventions, boosting productivity by **25%**.\nProvisioned and managed cloud resources on **GCP**, leveraging automated tools for better resource allocation and performance.\n\nOriginal Strengths:\n- Spearheaded the design and development of a web-based customer management platform using **.NET 7** and **ReactJS**, improving user satisfaction by **25%**.\n- Designed and implemented a microservices architecture using **.NET Core** to modularize the system for scalability and maintainability.\n- Integrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing.\n- Utilized **Redis** for caching frequently accessed data, improving response times by **35%**.\n- Developed RESTful APIs with **.NET**, integrated with a **MongoDB** database for seamless data access.\n- Optimized **MSSQL** database queries to reduce average query execution time by **20%**.\n- Developed a reporting engine using **D3.js** and **Three.js** for interactive data visualizations.\n- Implemented **JWT-based** authentication and authorization to secure the application."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented Infrastructure as Code using **Ansible** to automate server provisioning and configuration, enhancing deployment speed by **40%**.\nDeveloped and maintained scalable cloud infrastructure on **GCP**, ensuring high availability and reliability for applications, leading to a **99.9%** uptime.\nUtilized **Linux** for server management and optimization, resulting in reduced resource consumption by **20%**.\nIntegrated and monitored **CI/CD** pipelines to streamline development workflows and automate testing, reducing deployment times by **25%**.\nManaged networking protocols including **TCP/IP** and **DNS** for smooth communication between distributed systems, improving data flow efficiency.\nDesigned and implemented APIs using **Python** and **Go**, ensuring robust integration and enhancing application performance.\nCollaborated with cross-functional teams to gather requirements and assess system architecture, resulting in on-time project delivery with high stakeholder satisfaction.\nAuthored comprehensive documentation for system processes and guidelines, aiding team onboarding and ensuring compliance with best practices.\nConducted training sessions on **DevOps** methodologies, fostering a culture of collaboration and continuous improvement within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Leveraged **Linux** for robust system environments, ensuring high availability and reliability of applications.\n• Utilized **Ansible** for automation of configuration management and deployment processes, achieving a deployment speed increase of **30%**.\n• Developed infrastructure as code frameworks using **Python** and **Go**, enhancing system scalability and maintainability across projects.\n• Managed and optimized server configurations in **GCP**, resulting in a **25%** reduction in operational costs.\n• Configured and maintained **DNS**, **TCP/IP**, and **HTTP** protocols to ensure efficient network communication and integration.\n• Implemented **DevOps** practices to streamline workflows and enhance collaboration between development and operations teams.\n• Designed and executed **CI/CD** pipelines to automate testing and deployment, reducing the time to market by **40%**.\n• Collaborated in cross-functional teams to identify and resolve system issues promptly, improving overall system downtime to **less than 1%**.\n• Provided mentorship and guidance to junior engineers, promoting skill development and knowledge sharing within the team.\n• Participated in system performance tuning and monitoring to ensure optimal system functionalities and prevent potential bottlenecks."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines, Ansible\n\n**Cloud & Infrastructure**\n\tGCP, DNS, TCP/IP, HTTP, Infrastructure as Code\n\n**Other**\n\tUX/UI Design, Git, GitHub, Python, Redux, Linux, Go, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "THE FRESH PRODUCTS EPZ LIMITED"
}