{
  "name": "Tomasz Lee",
  "role_name": "Senior Blockchain Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Accomplished Senior Blockchain Engineer with 9+ years of experience in software design and backend development, focusing on **blockchain** technologies and secure applications. Proficient in developing **RESTful APIs** and leveraging **AWS** for scalable solutions. Expertise in implementing **security** measures, ensuring compliance with **KYC** and **AML** regulations, and utilizing **AI tools** to enhance system efficiency. Strong background in **test coverage** and effective **state management** within complex applications. Possess excellent communication skills, facilitating collaboration across teams to lead development projects to successful delivery, while optimizing overall performance with a solid understanding of **workflow engines**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Blockchain Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **blockchain** technology to enhance transaction security and integrity within the customer management platform.\nDesigned and developed **backend** services using **.NET 7** and **ReactJS**, Next.js, contributing to a **25%** improvement in user satisfaction.\nFormulated and implemented **RESTful APIs** that interact with a **MongoDB** database, ensuring seamless data access across multiple services.\nIntegrated **AWS** for cloud computing solutions, optimizing deployment and scalability strategies.\nEnhanced software design principles, utilizing **microservices architecture** with **.NET Core** for improved maintainability and system scalability.\nEmployed **security** best practices by implementing JWT-based authentication and authorization, protecting user data effectively.\nIncorporated **test coverage** protocols, using unit and integration tests to maintain software reliability and quality.\nManaged **workflow engines** to streamline processes, resulting in a **40%** reduction in deployment time via **CI/CD pipelines** on **Azure DevOps**.\nImplemented advanced **state management** solutions for enhanced application performance and user interactivity.\nApplied AI tools for automated data analysis, contributing to improved user insights and operational efficiency.\nCollaborated with UX/UI designers to refine the platform’s interface, achieving a more intuitive user experience.\nUtilized **Redis** as a caching solution to reduce database load, leading to a **35%** improvement in response time.\nImproved data streaming capabilities by integrating **Apache Kafka** and **RabbitMQ**, enhancing system throughput and resilience.\nOptimized **MSSQL** database queries, reducing average query execution time by **20%** and improving performance metrics.\nDeveloped a reporting engine using **D3.js** and **Three.js** for creating interactive and insightful data visualizations."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and implemented **RESTful APIs** for secure data transactions incorporating **blockchain** principles, achieving a system reliability increase of **20%**.\n• Designed and maintained secure backend systems with a focus on **security**, improving compliance with **KYC** and **AML** regulations, leading to a **30%** reduction in security breaches.\n• Utilized **AWS** services for scalable storage and data processing, enhancing system performance and reliability.\n• Integrated **AI tools** to automate workflow processes, reducing manual input errors by **25%**.\n• Led software design initiatives, creating patterns and practices that improved architectural consistency across projects.\n• Implemented comprehensive test coverage strategies to ensure robustness and reliability within the application structure.\n• Established and managed a state management system that improved application responsiveness by **15%**.\n• Conducted regular communication with stakeholders to gather requirements and provide updates, ensuring clarity throughout development cycles.\n• Drove the adoption of **workflow engines** to streamline processes, decreasing project turnaround time by **20%**.\n• Mentored junior engineers on best practices for backend development and adherence to security protocols, fostering a culture of continuous improvement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Designed and developed backend solutions for blockchain applications, significantly improving system security and performance.\nImplemented **RESTful APIs** to facilitate seamless communication between the blockchain network and external services.\nUtilized **AWS** cloud services for deploying blockchain solutions, ensuring scalability and reliability of applications.\nDeveloped comprehensive software design strategies including state management and integration of **workflow engines** for enhanced process automation.\nEnsured 100% test coverage for critical components, improving software reliability and reducing bugs in production environments.\nIntegrated **KYC** and **AML** compliance measures using advanced **AI tools**, ensuring secure operations in blockchain transactions.\nEngaged in daily standups and technical discussions, promoting effective communication within the team.\nCollaborated with cross-functional teams to deliver innovative blockchain solutions, improving overall project outcomes by 30%.\nContributed to the implementation of security protocols within blockchain systems, safeguarding sensitive data and user privacy.\nProvided thorough documentation and training for team members on new blockchain technologies and methodologies."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, JavaScript, TypeScript\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tAWS, Azure\n\n  **Other**\n\tBlockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Redux, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, security, software design, communication, KYC, AML, AI tools, test coverage, workflow engines, state management",
  "apply_company": "Paxos"
}