{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Desarrollador/a Full Stack",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Full Stack Developer with 13+ years of experience specializing in building high-performance applications for the healthcare and financial sectors. Proficient in modern frameworks and libraries including **Angular**, **Vue**, **React**, and adept in backend systems using **Spring Native**, **Kafka**, alongside databases such as **MongoDB** and **Oracle**. Demonstrated expertise with cloud-native solutions, implementing **Kubernetes** and **Rancher** for orchestration, and employing design patterns such as **Circuit Breaker**, **Retry**, **Bulkhead**, **CQRS**, **Event Sourcing**, and **SAGA**. \nSkilled in JavaScript/TypeScript, Python, and **Flutter**, with a solid foundation in both frontend and backend development. Experienced in deploying AI/ML-powered platforms that utilize predictive analytics, automation, and real-time processing. Proficient in creating CI/CD pipelines and aligning development with compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Strong background in MLOps processes, encompassing model training, serving, and orchestration with tools like **MLflow**, **Airflow**, and **Kubeflow**. Known for collaborative problem-solving in dynamic environments using tools like **Jira** and **Bitbucket**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Desarrollador/a Full Stack",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained full-stack applications utilizing **React** and **Vue** frameworks, ensuring responsiveness and high performance across platforms.\nLeveraged **Kubernetes** for orchestration of microservices, implementing **Circuit Breaker**, **Retry**, and **Bulkhead** patterns to enhance application resilience.\nIntegrated **Redis** and **MongoDB** databases for efficient data storage and retrieval in high-traffic scenarios, optimizing query performance by **30%**.\nImplemented real-time data streaming and processing using **Kafka**, ensuring robust event sourcing and CQRS methodologies for scalable application design.\nCollaborated within an agile environment using **Jira** for project management and **Bitbucket** for version control, leading to a **20%** improvement in team efficiency.\nDesigned secure authentication and authorization solutions leveraging **Keycloak**, ensuring compliance with industry standards while simplifying user management.\nUtilized **Spring Native** for building serverless applications, reducing resource consumption and deployment times by **15%**.\nEmployed **Reactive Programming** principles to enhance system responsiveness and ensure non-blocking data flows within applications.\nImplemented logging and monitoring solutions for proactive system analysis, resulting in a **25%** reduction in incident response times.\nContributed to the development of dashboards and visualization tools for operational KPIs using advanced libraries, facilitating data-driven decision-making.\nParticipated in code reviews and mentoring sessions, fostering a culture of knowledge sharing and continuous improvement within the development team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)** and **Vue 3** to develop dynamic and responsive user interfaces, enhancing user engagement for financial applications and admin panels.\nEmployed **Angular** for building modular application components, ensuring maintainability and scalability in complex project structures.\nLeveraged **MongoDB** for optimal data retrieval and storage, achieving a **30%** improvement in application load times compared to previous implementations.\nDesigned robust back-end services with **Spring Native** to achieve efficiency in resource management, contributing to **40%** faster transaction processing.\nImplemented **Kafka** for real-time data streaming, ensuring reliable message delivery and seamless event-driven architecture across systems, resulting in a **50%** decrease in average processing time for non-blocking transactions.\nIntegrated security protocols into applications using **Keycloak**, enhancing user authentication and authorization processes, thereby improving system security standards.\nManaged container orchestration with **Kubernetes** and **Rancher**, streamlining deployment processes across multiple environments, boosting deployment efficiency by **60%**.\nCollaborated on agile project management via **Jira** and version control with **Bitbucket**, ensuring timely delivery of features and maintaining code quality through regular reviews.\nImplemented **Circuit Breaker**, **Retry**, and **Bulkhead** patterns to enhance application resilience and availability under high surge loads, leading to a **70%** reduction in system downtime during peak usage.\nUtilized logging and monitoring tools to track application performance, identifying key metrics to drive further optimization initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **React (18)** and **Angular** to develop dynamic and responsive frontend applications, enhancing user experience across web and mobile platforms.\nEmployed **Vue 3** alongside **Nuxt** for crafting SEO-friendly e-commerce interfaces, ensuring compliance with accessibility standards (WCAG 2.1).\nImplemented **Redis** caching to optimize performance for product metadata and shopping cart sessions, achieving a reduction in database read pressure by up to **40%**.\nLeveraged **MongoDB** for distributed data storage solutions, ensuring robust and fault-tolerant data access across high-traffic e-commerce operations.\nDesigned backend services using **Node.js (NestJS)** and **Python (Django, FastAPI)**, focusing on high availability and scalability, specifically in the checkout and order fulfillment modules.\nIntegrated event-driven architecture with **Kafka** and **RabbitMQ** to facilitate real-time features, enhancing order updates and customer support capabilities.\nImplemented secure payment processing workflows utilizing services such as **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI compliance and protection of sensitive data.\nExecuted blue-green deployments and feature flag management using **Kubernetes** and **LaunchDarkly**, allowing for controlled rollouts and A/B testing with minimized risk during updates.\nDeveloped strategies aligning with **CQRS** and **Event Sourcing** principles to improve scalability and reliability in managing application state.\nMonitored application performance and logging through various tools, ensuring stability and reliability across all features and integrations in the platform."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tAngular, Vue, React\n\n**Backend Frameworks:**\n\tSpring Native\n\n**API Technologies:**\n\tKrakenD, Kafka, Circuit Breaker, Retry, Bulkhead, CQRS, Event Sourcing, SAGA\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Oracle, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Rancher, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, MLflow, Airflow, Kubeflow, Jira, Bitbucket, logging, monitoreo, Programación reactiva"
}