{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience in building high-performance applications, primarily focusing on interactive user interfaces. Proficient in **JavaScript**, **HTML5**, **CSS3**, and modern frameworks such as **React**, **Tailwind CSS**, **Bootstrap**, and **Foundation**. Strong skills in UI/UX design and development, ensuring seamless user experiences while adhering to best practices in debugging and troubleshooting.\nExperienced in integrating **REST APIs** and maintaining source control through **GitHub** and **GitLab**. Familiar with **WordPress** and **WooCommerce** for content management and e-commerce solutions. Additionally, I am well-acquainted with SEO strategies to optimize applications for search engines.\nHands-on expertise in frontend development, combined with a solid understanding of backend integration and cloud deployment using **AWS** and **Azure**, allows me to deliver compliant and efficient solutions in fast-paced environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained dynamic web applications using **JavaScript**, **React**, **HTML5**, and **CSS3**, ensuring seamless user experiences and responsive design.\nUtilized **Tailwind CSS**, **Bootstrap**, and **Foundation** for crafting visually appealing interfaces and achieving consistency across the product line.\nCollaborated with design teams and stakeholders, using **Figma** to translate design mockups into functional, high-impact UI components.\nIntegrated various payment gateways and **WooCommerce** functionalities, enhancing e-commerce capabilities within web applications for improved revenue generation.\nDesigned and implemented REST APIs for efficient data retrieval and manipulation, ensuring optimized performance and adherence to security best practices.\nConducted thorough **debugging** and **troubleshooting** sessions to identify and resolve technical issues, maintaining a high standard of code quality and customer satisfaction.\nLed multiple projects that enhanced site performance, resulting in a **30%** increase in page load speed and improved user engagement.\nManaged version control and collaboration using **GitHub** and **GitLab**, facilitating seamless team collaboration and ongoing code integration.\nExecuted SEO strategies to enhance web visibility, resulting in a **40%** increase in organic traffic.\nProduced detailed documentation for all development processes, maintaining clarity and consistency for future developer onboarding and project continuity."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Created responsive and dynamic user interfaces for financial applications using **React** (18), **Tailwind CSS**, and **TypeScript**, enhancing overall user experience and engagement.\nUtilized **JavaScript**, **HTML5**, and **CSS3** to build and maintain high-quality web applications, applying best practices for UI/UX and ensuring cross-browser compatibility.\nCollaborated with design teams using **Figma** to translate wireframes and prototypes into functional web applications, ensuring alignment with the project's vision and objectives.\nOptimized front-end performance through meticulous debugging and troubleshooting, resulting in a **20%** increase in load times across multiple platforms.\nImplemented REST APIs to connect front-end interfaces with backend services, improving data retrieval and enhancing application functionality.\nUtilized version control tools like **GitHub** and **GitLab** for collaborative code management and versioning, contributing to a **30%** reduction in deployment-related errors.\nParticipated in code reviews and team meetings to share knowledge and techniques, fostering a culture of continuous improvement and learning within the development team.\nDeveloped custom WordPress themes and plugins, enhancing e-commerce capabilities with **WooCommerce**, improving site functionality and user engagement by over **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized user interfaces for the e-commerce platform utilizing **React** (18), **JavaScript**, **HTML5**, and **CSS3**, focusing on delivering a seamless shopping experience across web and mobile.\nCollaborated with design teams using **Figma** to create responsive and accessible e-commerce UIs, ensuring compliance with accessibility standards (WCAG 2.1) and improving overall user engagement metrics.\nImplemented styles and components using **Tailwind CSS** and **Bootstrap**, enhancing the platform’s visual appeal while maintaining performance and load efficiency across various devices.\nEngineered RESTful APIs for dynamic data retrieval and user interaction, ensuring efficient communication between frontend and backend systems, resulting in a **30%** reduction in load times for critical user actions.\nMaintained code quality using **GitHub** and **GitLab** for version control, implementing effective troubleshooting and debugging practices to swiftly resolve issues and improve application stability.\nOptimized SEO strategies during the development process, contributing to a **25%** increase in organic search traffic and improved search engine rankings for e-commerce listings.\nUtilized analytics tools to continuously assess user behavior and implement UI enhancements, resulting in improved customer retention rates by **15%**.\nParticipated in code reviews and team meetings to align development processes with project goals, fostering collaboration and knowledge sharing among team members."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, WordPress\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS3, Tailwind CSS, Bootstrap, Foundation, Figma\n\n**API Technologies:**\n\tREST API\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tAuthentication & Security: Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, SEO, UI/UX, Debugging, Troubleshooting",
  "apply_company": "Remote Office"
}