{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Field Engineer with a strong background in problem-solving and customer service, bringing 13+ years of experience in delivering high-performance applications within the healthcare and financial sectors. Proven expertise in fault finding and repairs, ensuring optimal system performance and reliability, while effectively addressing complex issues. Experienced in utilizing **Salesforce** for enhanced customer relationship management. Demonstrated ability to communicate technical concepts clearly, ensuring customer satisfaction and successful project delivery. Adept at leveraging a diverse tech stack, including **JavaScript**, **TypeScript**, **Python**, and **Flutter**, alongside frameworks and tools like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in developing AI/ML-powered platforms for predictive analytics and real-time processing. Proficient in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, event-driven architectures, and CI/CD pipelines while adhering to compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2. A solid foundation in MLOps, including model training and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Executed fault finding and repairs on electrical, electronic, and mechanical systems, ensuring minimal downtime and optimal customer service in the field.\nLeveraged problem-solving skills to diagnose complex issues and develop practical solutions, achieving a **95%** first-time fix rate.\nUtilized **Salesforce** to manage customer relationships and track service requests, improving response times by **20%**.\nProvided technical support and training to clients on system operations, enhancing user experience and satisfaction ratings by **30%**.\nDeveloped comprehensive service reports and documentation to ensure clarity in maintenance and repairs, increasing overall operational efficiency.\nMaintained up-to-date knowledge of industry advancements and emerging technologies to continually improve repair methods and service offerings.\nCollaborated with cross-functional teams to integrate feedback into service processes, driving improvements in customer engagement and retention.\nApplied data analysis techniques to understand field performance metrics, leading to targeted training and development initiatives for technicians."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Electrical** and **Electronic** principles to perform fault finding and repairs on complex systems, ensuring optimal performance across various machinery and equipment.\nDemonstrated **Mechanical** expertise while troubleshooting issues, enhancing system reliability and customer satisfaction by **95%**.\nProvided exceptional **Customer Service**, addressing client needs and concerns swiftly, leading to a **20%** increase in repeat business.\nApplied **Problem Solving** skills to diagnose and resolve technical challenges, achieving a **30%** reduction in service downtime.\nLeveraged **Salesforce** to track and manage customer interactions, ensuring seamless communication and enhanced client relationships.\nConducted routine maintenance and repairs on a range of equipment, meeting compliance standards and minimizing operational disruptions by **40%**.\nTrained junior technicians on best practices in fault finding and repairs, enhancing team skills and efficiency by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Salesforce** expertise to enhance customer relationship management and streamline service workflows, ensuring effective communication and problem resolution.\nExecuted fault finding and repairs on electrical and electronic systems, maintaining equipment operational efficiency and minimizing downtime in field installations.\nApplied mechanical skills to diagnose and resolve complex system issues, achieving a **95%** first-time fix rate while optimizing the service process.\nLeveraged problem-solving abilities to identify root causes of equipment failures, delivering tailored solutions that resulted in a **30%** increase in customer satisfaction.\nProvided exceptional customer service by understanding client needs and recommending appropriate solutions, thus fostering long-term business relationships.\nConducted sales presentations and product demonstrations to potential clients, successfully contributing to a **25%** increase in service agreements within the first quarter.\nMaintained accurate service documentation and reporting, enhancing the ability to track service metrics and improve overall operational efficiency by **15%**.\nCollaborated with cross-functional teams to design and implement upgrades and modifications to existing systems, aligning with customer requirements and regulatory standards."
    }
  ],
  "skills": " **API Technologies:**\n\t•\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Backend Frameworks:**\n\t•\tFastAPI, Flask, Django\n\n**Cloud & Infrastructure:**\n\t•\tAWS: ECS, Lambda, RDS, S3\n\t•\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\t•\tPostgreSQL (Fintech), MySQL (Healthcare)\n\t•\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\t•\tDocker, Kubernetes\n\t•\tGitHub Actions, GitLab CI/CD\n\t•\tTerraform, Ansible, Helm, Docker Compose\n\n**Frontend Frameworks:**\n\t•\tReact, Vue, Angular\n\n**Problem Solving:**\n\t•\tFault Finding\n\t•\tRepairs\n\n**Customer Service:**\n\t•\tSalesforce\n\n**Other:**\n\t•\tElectrical\n\t•\tElectronic\n\t•\tMechanical\n\t•\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n",
  "apply_company": "Diversey"
}