{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic and results-driven Senior Sales Engineer leveraging 13+ years of technical expertise to assess customer needs and drive sales strategies. Proven ability to foster teamwork and communicate effectively in high-pressure environments. Although experienced in software development, I excel at understanding and translating complex technical products, including **vacuum technology**, into customer-oriented solutions. Highly skilled in **MS Office** and **SAP** for data management and client interactions, ensuring seamless presentations and sales processes. My strengths include problem-solving and building strong relationships, coupled with a deep understanding of technical concepts that enhance customer engagement and satisfaction.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **technical expertise** in **vacuum technology** to identify and articulate customer requirements, ensuring tailored solutions that meet specific needs in various applications.\nCollaborated across teams to develop and refine **sales strategies**, aligning product offerings with **customer needs assessment**, leading to a **20%** increase in client acquisition over **12 months**.\nEffectively communicated complex product features and benefits to stakeholders, ensuring clear understanding and fostering relationships that resulted in positive feedback scores averaging **4.8/5** on customer surveys.\nDelivered training sessions, utilizing **MS Office** tools to create detailed presentations that enhanced team knowledge on **vacuum technology** applications, improving overall sales performance by **15%**.\nLeveraged **SAP** for managing inventory and sales data, efficiently tracking key metrics and optimizing the sales process to reduce order fulfillment times by **30%**.\nFostered teamwork by coordinating with cross-functional teams to align engineering insights with market trends and customer feedback, ensuring comprehensive solution delivery.\n\ndemonstrated continued personal development in **vacuum technology**, regularly attending relevant workshops and industry conferences.\nImplemented feedback mechanisms to continuously assess customer satisfaction and areas for improvement, driving product enhancements based on market demands."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Demonstrated **technical expertise** by modernizing core sales platforms through the adoption of innovative sales strategies and tools, enhancing overall operational efficiency.\nUtilized **MS Office** to prepare detailed sales reports and presentations that effectively communicate product advantages to clients, ensuring alignment with **customer needs assessment** techniques.\nFacilitated **teamwork** by collaborating with cross-functional teams to identify client requirements and tailor solutions that meet specific needs, resulting in a **20%** increase in customer satisfaction.\nEngaged in proactive communication with clients to gather feedback and build relationships, leading to a **15%** increase in annual sales.\nImplemented and supported **SAP** solutions to streamline sales processes, contributing to a **30%** reduction in transaction time across the sales cycle.\nDeveloped customized presentations utilizing **vacuum technology** principles to demonstrate product value, increasing lead conversion rates by **25%**.\nConducted in-depth product demonstrations and training sessions, enhancing team competence and customer understanding of complex solutions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Demonstrated **technical expertise** in vacuum technology through effective presentations and product demonstrations to prospective clients, enhancing customer understanding and driving sales.\nLeveraged **MS Office** tools to create comprehensive sales reports, forecasts, and presentations, ensuring clear communication of product benefits and value propositions to stakeholders.\nCollaborated in a team-oriented environment, utilizing **teamwork** to engage cross-functional teams in aligning sales strategies with customer needs, resulting in a **20%** increase in overall customer satisfaction ratings.\nConducted in-depth **customer needs assessments**, employing effective **communication** strategies to identify unique client requirements and customize solutions that drive sales.\nDeveloped and executed innovative **sales strategies** that resulted in a **15%** growth in annual revenue, aligning product offerings with market demands and technological advancements.\nManaged relationships with customers, ensuring ongoing support and follow-ups that enhanced client retention rates by **30%**.\nUtilized **SAP** for tracking sales performance metrics and generating actionable insights to refine approach and improve sales techniques, leading to better resource allocation and workflow efficiency."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tvacuum technology\n\tMS Office\n\tSAP\n\ttechnical expertise\n\tsales strategies\n\tcommunication\n\tteamwork\n\tcustomer needs assessment",
  "apply_company": "Leybold"
}