{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer (Backend)",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Software Engineer with 10+ years of experience in delivering high-performance **full-stack solutions** with an emphasis on **cloud-based applications**. Expert in **Python** and **PHP**, employing modern frameworks and technologies to create impactful software solutions. Proven track record of leading project delivery teams while maintaining high standards of code quality through **code review** and **design document review** processes. Proficient in **AI tooling**, leveraging advanced technologies to enhance applications with AI/ML capabilities.\n\nDemonstrated ability to mentor junior developers and guide them through complex project challenges. Skilled in building secure and compliant applications, focusing on industry standards and regulations, including HIPAA and PCI DSS. Strong background in developing scalable architectures and fostering collaboration across teams to achieve strategic goals.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer (Backend)",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed cloud-based applications using **Python** and **PHP** to meet project delivery goals, ensuring high code quality through robust code reviews and design document evaluations.\n• Led the design and implementation of scalable and secure full-stack solutions, focusing on maintaining efficiency in cross-functional teams and mentoring junior developers effectively.\n• Streamlined the development processes by integrating AI tooling for enhanced productivity and leveraging tools such as **FastAPI**, ensuring quick delivery of high-quality software.\n• Collaborated on project delivery timelines, significantly reducing turnaround time by **30%** while maintaining adherence to best practices in code review and design documentation.\n• Ensured the implementation of coding standards through regular code review sessions, improving overall team efficiency by **25%**.\n• Designed and maintained high-performance server-side applications, utilizing frameworks like **FastAPI** and **Flask**, optimizing backend services for client-facing applications.\n• Provided technical guidance and support to team members, mentoring them on using best practices in **Python** development and cloud architectures, contributing to a **40%** increase in team productivity.\n• Implemented and monitored performance metrics for backend systems, using tools such as **Docker** and **Kubernetes (AKS/EKS)** to improve application availability and scalability by **50%**. \n• Championed the deployment of modular backend architectures, while maintaining a strong focus on **cloud-based applications** to accommodate evolving project requirements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained **cloud-based applications** using **Python** to optimize backend services and enhance project delivery for diverse financial solutions.\nConducted code reviews and design document reviews to ensure quality standards and foster a culture of mentoring among junior developers, leading a team of **5** engineers through **4** successful project iterations.\nStreamlined backend processes and handled integration with **AI tooling** to implement advanced fraud detection and data analytics capabilities, resulting in a **30%** reduction in false positives and improved transaction security.\nEnhanced full-stack solutions by collaborating with front-end teams to create seamless user experiences, resulting in **15%** improvement in user engagement metrics.\nImplemented structured project delivery methodologies to ensure timely completion of **3** major product launches, increasing team efficiency by **25%** through effective task management and collaboration.\nActively participated in architecture discussions to design scalable systems, leveraging best practices and modern frameworks to adapt quickly to changing business requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented full-stack solutions focusing on **Python** for backend development, enhancing application performance and scalability in line with project delivery expectations.\nMentored junior developers, facilitating knowledge transfer and skills development in technologies such as **PHP**, **AI tooling**, and best practices for code review and design document review.\nDesigned and optimized cloud-based applications that aligned with **cloud services** strategies to ensure high availability and low latency, particularly for critical functions like user authentication and data processing.\nLed the development of backend services utilizing **FastAPI** and **Django**, achieving a latency reduction of **25%** for user requests and ensuring maintainability across **3** major modules.\nConducted rigorous code reviews that improved code quality metrics by **40%**, ensuring adherence to project standards and enhancing team collaboration.\nSpearheaded design document reviews to enhance architecture clarity and ensure alignment with product objectives, resulting in streamlined project timelines and improved stakeholder satisfaction.\nDeveloped and maintained **AI tooling** integrations that enhanced data processing efficiency, leading to a **30%** increase in predictive analytics capabilities for user engagement.\nUtilized a variety of databases such as **MongoDB** and **PostgreSQL** to ensure optimal data retrieval and support complex queries needed for backend operations, hitting performance metrics in line with SLAs."
    }
  ],
  "skills": "Programming Languages:\n\tPython, PHP\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tAI tooling, cloud-based applications, full-stack solutions, project delivery, mentoring, code review, design document review, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}