{
  "name": "Rei Taro",
  "role_name": "Modern C++ Software Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Results-driven Modern C++ Software Developer with over 10 years of experience specializing in C++ 20, **Boost.Asio**, and **asynchronous programming** to deliver robust financial platforms. Proficient in **unit testing** and **UML design**, with a strong command of the **FIX protocol** and **MetaTrader API**. Adept at problem-solving and fostering effective communication and interpersonal skills to collaborate with cross-functional teams. Proven success in driving impactful projects at prestigious organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Modern C++ Software Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **C++ 20** to engineer high-performance, asynchronous applications that enhance user experiences and operational efficiency.\nImplemented **Boost.Asio** for robust asynchronous programming to optimize the communication between financial trading systems and external APIs.\nConducted thorough **unit testing** to ensure code quality and reliability, achieving a test coverage rate of over **85%**.\nDesigned system architectures using **UML** to illustrate and communicate complex software designs effectively among team members.\nIntegrated **FIX protocol** for seamless real-time financial transaction processing, improving transaction speed by **30%**.\nDeveloped features interfacing with the **MetaTrader API** to automate trading processes, significantly reducing manual intervention.\nDemonstrated strong **problem-solving** skills by resolving critical system issues in collaboration with cross-functional teams.\nFostered effective **interpersonal and communication skills** to drive team collaboration and ensure stakeholders are aligned with project goals."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **C++ 20** to develop high-performance backend systems, ensuring efficient execution and reliability in application functionalities.\nImplemented **Boost.Asio** for network programming, enhancing asynchronous communication capabilities and improving system responsiveness.\nConducted thorough **unit testing** to guarantee code quality and robustness across all software components, increasing deployment confidence by **95%**.\nEmployed **UML design** methodologies for system architecture planning, facilitating effective communication of complex structures among team members.\nLeveraged **FIX protocol** and **MetaTrader API** to enhance financial transaction processing, improving transaction speed by **30%** through optimized asynchronous programming techniques.\nExercised advanced **problem-solving** skills to troubleshoot and resolve software issues, maintaining high levels of performance and reliability in product delivery.\nFostered strong **interpersonal skills** in cross-functional collaboration, ensuring alignment between development teams and stakeholders for successful project outcomes.\nDemonstrated excellent **communication skills** to articulate technical concepts clearly, helping to bridge gaps between technical and non-technical team members."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **C++ 20** and **Boost.Asio** to develop robust backend services aimed at optimizing trade execution, ensuring high performance in portfolio management and account tracking.\nEmployed unit testing methodologies to maintain code integrity and reliability through the entire development cycle, achieving a **90% test coverage** rate.\nApplied asynchronous programming techniques to enhance data processing efficiency, enabling real-time market data streaming that supports high-frequency transactions.\nDesigned and implemented UML diagrams for system architecture, facilitating clear communication and understanding of project requirements among cross-functional teams.\nIntegrated **FIX protocol** and **MetaTrader API** to enable seamless trading interactions, enhancing user experience and operational efficiency.\nDemonstrated advanced problem-solving skills to troubleshoot and resolve complex technical challenges, improving system stability by **35%** over project timelines.\nFostered interpersonal and communication skills to actively collaborate with frontend teams, ensuring smooth integration of backend services with user-facing applications.\n"
    }
  ],
  "skills": "Programming Languages:\n\t**C++ 20**, **Python (3.8+)**, **SQL**, **Bash**, **JavaScript**\n\n**Backend Frameworks:**\n\t**FastAPI**, **Flask**, **Django**, **Celery**\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t**REST/gRPC APIs**, **MetaTrader API**, **FIX protocol**\n\n**Serverless and Cloud Functions:**\n\t**AWS (EC2, S3, Lambda)**, **Azure**, **Docker**, **Kubernetes**, **GitHub Actions**, **Azure DevOps**\n\n**Databases:**\n\t**PostgreSQL**, **MySQL**, **MongoDB**, **Redis**\n\n**DevOps:**\n\t**CI/CD**, **Git**, **unit testing**, **asynchronous programming**\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\t**AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow**, **Microservices**, **Kafka**, **UML design**, **problem-solving**, **interpersonal skills**, **communication skills**"
}