{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Backend Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Backend Developer with 13+ years of experience in high-performance application delivery, specializing in **.NET**, **Spring Boot**, and cloud services, particularly **AWS**. Adept in API Design and Data Validation, ensuring robust and secure backend architectures. Proven track record of creating efficient server-side logic and services, contributing to scalability and performance enhancements in various applications. \n\nDemonstrated capacity in implementing microservices, achieving seamless integration, and fostering automation through CI/CD pipelines. Strong familiarity with compliance-driven development, aligning solutions with regulatory standards. Additional expertise in **JavaScript/TypeScript**, **Python**, and implementing **AI/ML** strategies, showcasing adaptability and a prowess for leveraging a diverse tech stack.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust **API Design** and integration strategies for backend services using **.NET** and **Spring Boot**, ensuring data validation and compliance with industry standards.\n- Engineered scalable backend solutions, leveraging cloud services like **AWS** for deployment and management of applications, ensuring high availability and performance metrics exceeding **99.9%** uptime.\n- Implemented comprehensive data validation techniques throughout service interactions to enhance data integrity and reliability, significantly reducing error rates by **40%**.\n- Collaborated on building interfaces with front-end frameworks such as **Angular** for seamless user experiences while integrating backend functionalities effectively.\n- Automated deployment pipelines with **AWS**, utilizing services such as Elastic Beanstalk, CloudFormation, and Lambda functions, reducing deployment times by **50%**.\n- Participated in code reviews and applied best practices for clean, maintainable code, resulting in a **30%** decrease in technical debt across projects.\n- Developed and maintained comprehensive unit tests and integration tests, achieving **80%** code coverage, leveraging tools like **JUnit** for backend services.\n- Integrated third-party APIs with secure, high-performance methods, ensuring timely data exchanges between external and internal systems, resulting in faster data processing times of **up to 20ms**.\n- Regularly monitored and optimized performance metrics of backend services, successfully improving response times by **25%** through rigorous analysis and updates.\n- Engaged in agile development practices, participating in daily stand-ups and bi-weekly sprints, helping ensure timely delivery of features and enhancements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed and optimized backend applications with **.NET** and **Spring Boot**, ensuring robust API design and data validation for seamless integration with front-end services.\nDesigned and implemented highly scalable RESTful APIs, utilizing **API Design** principles to enhance data accessibility and facilitate communication across microservices.\nMigrated existing services to cloud infrastructure on **AWS**, improving deployment efficiency and system resilience in high-demand environments.\nCollaborated with front-end teams using **Angular** to ensure effective data flow and user interface interactions, resulting in a 30% increase in user engagement.\nExecuted rigorous data validation processes to ensure integrity and consistency across all data transactions and API calls, achieving a 95% reduction in data-related errors.\nParticipated in a comprehensive 9-month project to refactor legacy code, which improved system performance by 40% through enhanced algorithms and streamlined workflows.\nImplemented logging and monitoring using **AWS CloudWatch** and **ELK Stack**, providing real-time insights and facilitating faster debugging and troubleshooting.\nAchieved a 25% reduction in response times by optimizing database queries and leveraging caching strategies during the development of high-traffic endpoints."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized backend services using **.NET** and **Spring Boot**, ensuring high availability, low latency, and scalability for various modules in an e-commerce platform, improving transaction speeds by **30%**.\nDesigned robust and secure RESTful APIs, focusing on **API Design** principles, to facilitate seamless integration with frontend applications built in **Angular** and other frameworks, leading to a **25%** enhancement in API throughput.\nImplemented data validation mechanisms to ensure the integrity and reliability of data inputs, thereby reducing data errors by **40%** and improving overall system stability.\nUtilized **AWS** for cloud infrastructure management, ensuring scalable deployment environments and optimizing resource allocation, cutting infrastructure costs by **20%**.\nCollaborated with frontend teams to ensure responsive UI designs, leveraging **Angular** for dynamic user interfaces, which improved user engagement metrics significantly.\nEnhanced backend performance by employing caching strategies and optimizing database queries, resulting in a **50%** reduction in response times for key database-driven features.\nConducted comprehensive testing and debugging processes to maintain high code quality and adhere to industry standards, achieving **99%** test coverage across critical components.\n"
    }
  ],
  "skills": "**Programming Languages**:\n\tPython\n\n**Backend Frameworks**:\n\tFastAPI, Flask, Django, .NET, Spring Boot\n\n**Frontend Frameworks**:\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies**:\n\tAPI Design\n\n**Serverless and Cloud Functions**:\n\tAWS: ECS, Lambda, RDS, S3\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**:\n\tAWS, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other**:\n\tMLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Data Validation"
}