{
  "name": "Andrzej Ito",
  "role_name": "Senior Casino Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Casino Engineer, I leverage over 9 years of experience in designing and building scalable software solutions tailored for the iGaming industry. My expertise includes performance optimization and implementing casino game mechanics that enhance user experience and drive engagement. I am proficient in data-driven decision-making, utilizing tools like **Excel** and **Power BI** for insightful analysis. I excel in mentoring junior engineers and collaborating within cross-functional teams to deliver impactful projects. Additionally, I possess strong negotiation and communication skills, ensuring alignment and success across projects focused on RNG and Live Casino innovations.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Casino Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2022",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Spearheaded the development of high-performance gaming services for **iGaming** applications, focusing on casino game mechanics and performance optimization.\n• Engineered robust RNG systems to ensure fairness and reliability in live casino environments.\n• Employed data-driven decision-making to analyze user engagement and optimize gaming experiences using **Excel** and **Power BI**.\n• Collaborated with cross-functional teams to enhance communication and negotiation strategies, improving project outcomes.\n• Mentored junior engineers on best practices in casino game development and **CRM** utilization strategies.\n• Developed and maintained automated systems using **Jenkins** and **Ansible** to streamline deployment processes, achieving an efficiency increase of **30%**.\n• Designed and implemented various campaigns to boost user engagement, leveraging advanced **campaign management** techniques.\n• Utilized analytical tools to drive performance metrics, optimizing gameplay for enhanced user satisfaction.\n• Led efforts in integrating **Java** and **Spring Boot** based architectures to build scalable and maintainable gaming services, achieving response times under **100ms**."
    },
    {
      "role": "Software Engineer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2022",
      "location": "Tokyo, Japan",
      "responsibilities": "• Leveraged **iGaming** expertise to design and develop innovative casino game mechanics, enhancing user engagement by **25%**.\n• Optimized performance of **Live Casino** games, ensuring smooth operation and responsiveness across platforms, achieving a **30%** reduction in latency.\n• Employed data-driven decision-making strategies, analyzing user feedback and game performance using **Excel** and **Power BI** for impactful campaign management.\n• Collaborated cross-functionally to negotiate game features and improvements, enhancing team communication and fostering a culture of mentorship.\n• Developed and refined **RNG** (Random Number Generator) algorithms to ensure compliance with industry standards and improve game fairness.\n• Facilitated training sessions for junior engineers on **CRM** tools and systems, increasing team productivity by **15%**.\n• Spearheaded campaign management initiatives using analytics tools, resulting in a notable uptick in user acquisition rates by **20%**.\n• Implemented performance optimization techniques that improved game load times by **40%** to enhance user satisfaction and retention."
    },
    {
      "role": "Software Engineer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Gained extensive experience in **iGaming** technologies, including integration of **RNG** systems and **Live Casino** applications to enhance gaming experiences.\n• Led performance optimization initiatives to boost system responsiveness by over **30%**, implementing effective casino game mechanics.\n• Utilized data-driven decision-making processes to inform product development and improve casino operations.\n• Engaged in effective negotiation and communication with stakeholders to align project goals with business objectives, resulting in improved stakeholder relations.\n• Leveraged advanced data analysis through **Excel** and **Power BI** to create insightful reports for performance tracking, leading to a **20%** increase in campaign effectiveness.\n• Managed CRM strategies for enhanced user engagement and retention, achieving a **15%** growth in user activity.\n• Spearheaded campaign management efforts that required strong mentoring skills to coach junior team members on best practices in **iGaming** development.\n• Developed web applications utilizing cutting-edge web technologies including **Spring MVC**, **jQuery**, **HTML**, **JavaScript**, **CSS**, and **AJAX controls**.\n• Converted designs from Photoshop and Figma to table-less semantic XHTML and CSS, improving webpage load times by over **25%**.\n• Implemented CORS using **Node.js**; developed REST services with **Node** and **Express**, improving backend communication efficiency.\n• Involved in designing **SSIS** packages to export data from flat file sources to **MS SQL Server**, streamlining data management processes."
    }
  ],
  "skills": "iGaming, RNG, Live Casino, performance optimization, casino game mechanics, data-driven decision-making, negotiation, communication, Excel, Power BI, CRM, campaign management, mentoring, \n\n**Programming Languages**\n\tJava, C++, C#, Python, SQL, PLSQL, Kotlin \n\n**Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA, Node.js \n\n**Frontend Frameworks**\n\tReact, Vue, Angular \n\n**API Technologies**\n\tSOAP, REST APIs \n\n**Serverless and Cloud Functions**\n\tMicroservices \n\n**Databases**\n\tMS SQL Server, Oracle, MongoDB, PostgreSQL, Redis \n\n**DevOps**\n\tRabbit MQ \n\n**Cloud & Infrastructure**\n\t \n\n**Other**\n\tSOLID, DRY, LINQ",
  "apply_company": "Ludicrum"
}