{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Software Engineer with 13+ years of experience in delivering high-performance applications with a strong focus on **Python**, **Node.js**, **Vue.js**, and **Flask**. Adept at developing modern data architectures and distributed systems while prioritizing performance optimization and code simplicity. Extensive expertise in cloud platforms including **AWS** and **Azure**, with a proven ability to implement scalable, collaborative solutions. \nAdditionally proficient in developing applications across healthcare and financial industries, with a strong foundation in both frontend and backend development using **React**, **Next.js**, **Django**, and **FastAPI**. Experienced in AI/ML-driven platforms, deploying real-time processing capabilities, and familiarity with compliance standards such as HIPAA and PCI DSS. Well-versed in problem-solving techniques and applying CI/CD pipelines for seamless integration and delivery.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed backend systems using **Python** and **Flask**, ensuring code simplicity, performance optimization, and maintainability across the software stack.\n• Leveraged **Java** and **Scala** for building robust distributed systems, enhancing scalability and reliability of applications.\n• Built modern data architectures utilizing **Node.js** and **VueJS** to deliver high-performance web and mobile applications.\n• Fostered a collaborative environment by working closely with cross-functional teams to solve complex problems and implement innovative solutions.\n• Designed and integrated cloud platforms for application hosting, using tools such as **AWS** and **Azure**, with specific implementations for scalable services.\n• Ensured seamless user experiences by focusing on code simplicity and maintaining efficient, clean code across the development phases.\n• Collaborated on debugging and optimization initiatives that improved system performance by up to **30%**.\n• Refactored legacy systems into modern architectures, witnessing a reduction in processing time by **40%** and increasing responsiveness of the application.\n• Mentored junior developers to foster collaborative problem-solving skills, enhancing team productivity and individual performance.\n• Participated in rigorous code reviews, contributing to the refinement of build processes that improved deployment efficiency by **25%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Node.js** (NestJS/Express) to modernize core financial platforms by migrating to a microservices architecture, enhancing scalability and performance for high-volume transactional systems.\nBuilt interactive front-end applications with **VueJS** 3 and **React** 18, employing **TypeScript**, Redux Toolkit, and **Tailwind CSS** for creating sleek, responsive interfaces tailored for financial tools and admin panels.\nDelivered real-time analytics dashboards using **React**, D3.js, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies.\nDesigned and deployed a robust event-driven architecture leveraging **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing with over **100** transactions per second.\nImplemented machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns, reducing false positives by **25%**.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, achieving a runtime efficiency improvement of **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** (Flask) and **Node.js** for crafting efficient backend services on a global e-commerce platform, ensuring system reliability and scalability that meets the needs of over **1 million** users.\nEngineered distributed systems to handle real-time transactions and customer interactions, leveraging cloud platforms for enhanced availability and responsiveness during peak traffic periods, achieving a **99.9%** uptime.\nApplied performance optimization techniques across **Java** and **Scala** frameworks, resulting in a **40%** reduction in page load times and improved overall user experience.\nFostered a collaborative environment, demonstrating expert problem-solving skills by leading the transition to modern data architectures, enhancing data processing efficiency by **30%**.\nEnhanced user interfaces using **VueJS** and **React**, incorporating code simplicity principles to streamline development processes and bolster team productivity.\nContributed to the design and implementation of reliable front-end solutions that improved user interaction across devices, achieving an average session duration increase of **25%**.\nDrove the adoption of modern practices in coding and deployment, including collaborative code reviews and the facilitation of efficient workflows through agile methodologies.\nImplemented robust application designs with a focus on security features, ensuring compliance with industry standards to protect sensitive user data and enhance platform trust.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, Scala, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFlask, FastAPI\n\n**Frontend Frameworks:**\n\tVue, React, Angular, VueJS\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS; Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database\n\n**Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT; distributed systems, modern data architectures, collaborative, problem-solving, code simplicity, performance optimization"
}