{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Sales Engineer with over 10 years of experience in **Automation**, **Digitalization**, **Cloud** technologies, and customer relationship management. Proven ability to develop and deliver innovative technical solutions, enhancing sales strategies and driving customer engagement. Experienced in closely communicating with clients to understand their needs and translate them into effective solutions. Strong background in developing backend systems and creating high-performing APIs using **Python** (**FastAPI**, **Django**, **Flask**), as well as deploying solutions on **AWS** and **Azure**. Notable contributions to impactful projects at top-tier organizations, including VISA, Sii Poland, and Reply Polska, complementing a solid foundation in **Mechatronics** and **Electronics**. Fluent in **German** and **English**, adept at fostering relationships to achieve business goals.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Developed and implemented **automation** strategies to enhance operational efficiency, achieving a **30%** reduction in process time.\n• Designed and deployed **cloud** solutions that improved customer relationship management through timely insights and analytics, utilizing **Azure** and **Terraform** for infrastructure management.\n• Engineered backend services using **Python** and **FastAPI**, enabling seamless integration for client-centric solutions in the **IIoT** space.\n• Developed event-driven architectures with **Celery** and **Redis** to optimize asynchronous processing and response times, increasing throughput by **50%**.\n• Created and maintained real-time data pipelines utilizing **Apache Airflow** and **Azure Functions** that ensured consistent data integrity for regulatory compliance.\n• Conducted effective **communication** with cross-functional teams to resolve integration challenges and support sales strategies.\n• Led security compliance assessments and integrated authorization frameworks such as **OAuth2** and **Azure AD B2C** to enhance security protocols for customer data protection.\n• Provided technical solutions that successfully addressed client requirements, resulting in a **20%** increase in customer satisfaction ratings.\n• Utilized specialized knowledge in **mechatronics** and **electronics** to innovate sales processes in both **German** and **English** markets."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Focus on **Cloud** solutions and **Automation** to enhance sales strategies and customer relationship management:\n\n- Developed backend systems using **Python** and **FastAPI** to automate document workflows, resulting in a **30%** reduction in processing time for user onboarding and complex reporting.\n- Created event-driven microservices with **Celery** and **Redis** to enable asynchronous processing of financial data, handling up to **5,000** transaction requests per minute.\n- Managed the deployment of microservices on **Azure App Services**, utilizing **Terraform** for infrastructure automation, ensuring a scalable environment with **99.9%** uptime.\n- Engineered data pipelines for secure regulatory data exchange, leveraging **Apache Airflow** and **Azure Functions** to automate workflows, increasing data handling efficiency by **25%**.\n- Performed security audits to ensure compliance with industry standards, integrating **OAuth2** and **Azure AD B2C** to fortify authentication and secure access controls.\n- Collaborated effectively with cross-functional teams to communicate technical solutions, ensuring seamless system integration and adherence to regulatory requirements."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Expertise in **Cloud** solutions for deploying automated processes that enhance sales strategy and customer relationship management.\n• Developed and implemented **Automation** strategies to streamline communications, optimizing customer interactions and management of technical solutions.\n• Integrated **IIoT** technologies to facilitate digitalization of sales processes, improving efficiency and tracking for customer insights.\n• Leveraged strong communication skills in **German** and **English** to effectively engage with clients, ensuring understanding of technical products and services.\n• Collaborated with cross-functional teams to drive technical solutions that meet customer needs and exceed expectations, resulting in a **20%** increase in customer satisfaction.\n• Spearheaded the introduction of **Prozesssteuerung** methodologies, leading to a **15%** reduction in operational costs while enhancing service quality.\n• Analyzed sales data to develop new strategies, achieving a sales growth of **30%** in a competitive market.\n• Effectively utilized **Mechatronics** and **Electronics** insights to communicate complex technical information clearly to clients, bridging the gap between technology and customer understanding."
    }
  ],
  "skills": "Programming Languages:\n\t**Python (3.8+), SQL, Bash, JavaScript**\n\nBackend Frameworks:\n\t**FastAPI, Flask, Django, Celery**\n\nFrontend Frameworks:\n\t**None**\n\nAPI Technologies:\n\t**REST/gRPC APIs, Microservices**\n\nServerless and Cloud Functions:\n\t**AWS (EC2, S3, Lambda), Azure**\n\nDatabases:\n\t**PostgreSQL, MySQL, MongoDB, Redis**\n\nDevOps:\n\t**Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git**\n\nCloud & Infrastructure:\n\t**Cloud**\n\nOther:\n\t**Automation, Digitalization, IIoT, Communication, Customer Relationship Management, Sales Strategy, Technical Solutions, Prozesssteuerung, Mechatronics, Electronics, German, English**",
  "apply_company": "ifm"
}