{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior Backend Engineer with 10+ years of experience in delivering high-performance software solutions, specializing in **PHP**, **Go**, and **RESTful APIs**. Proven expertise in Domain Driven Design, Unit Testing, and Integration Testing to ensure robust application performance. Proficient in deploying scalable solutions on **AWS** and utilizing **AWS SQS** for efficient message queuing. Adept at crafting maintainable, secure back-end systems while adhering to best practices and compliance standards.\n\nWith a solid foundation in **JavaScript/TypeScript**, **Python**, and **Flutter**, I bring a comprehensive full-stack perspective to backend development. My hands-on experience in building cloud-native applications and leading the development of enterprise platforms has fostered a keen understanding of integrating AI/ML capabilities into backend systems for enhanced analytics and automation. Passionate about building systems that provide practical solutions while making a tangible impact in healthcare and finance.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and developed robust server-side logic using **PHP** and **Go**, ensuring high performance and responsiveness to requests from front-end applications and RESTful APIs.\n• Implemented Domain Driven Design principles to structure code in a way that enhances maintainability, scalability, and team collaboration, especially for complex backend systems.\n• Developed and documented unit tests and integration tests covering key functionalities using test frameworks, significantly increasing code reliability by achieving over **85%** code coverage.\n• Deployed cloud services on **AWS**, leveraging **AWS SQS** for efficient message queuing and processing, supporting seamless integration between microservices and improving system responsiveness.\n• Collaborated with cross-functional teams to enhance existing backend features and optimize database queries, resulting in a performance improvement of up to **30%**.\n• Conducted code reviews and mentored junior developers, fostering a culture of quality and continuous improvement in backend development practices.\n• Maintained clear communication in **English** with stakeholders to ensure alignment with business requirements and timely delivery of backend solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed robust and scalable **RESTful APIs** using **PHP** and **Go** to enhance backend functionality for high-volume financial platforms.\n• Applied **Domain Driven Design** principles to architect applications, improving code organization and maintainability, leading to a **30%** reduction in technical debt.\n• Implemented comprehensive **Unit Testing** and **Integration Testing** strategies to ensure code quality and reliability, achieving over **90%** test coverage across critical services.\n• Leveraged **AWS** services, including **AWS SQS** for message queuing, facilitating asynchronous task processing and enhancing system responsiveness.\n• Collaborated with cross-functional teams to deliver features on time, resulting in a **25%** improvement in sprint completion rates.\n• Mentored junior developers on best practices and technologies, fostering a culture of continuous learning and improvement within the team, which increased overall team satisfaction by **15%**.\n• Created and maintained documentation for APIs and system architectures, ensuring clarity and understanding among team members and stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized robust **PHP** and **Go** backend services for high-performance applications, employing **RESTful APIs** that adhere to **Domain Driven Design** principles to ensure scalable and maintainable architecture.\nDesigned rigorous **Unit Testing** and **Integration Testing** processes to validate backend functionalities, achieving a code coverage of **85%**, ensuring software reliability and performance.\nImplemented message queuing solutions utilizing **AWS SQS** for decoupling services and enhancing application scalability, facilitating efficient message processing and delivery across diverse services.\nCollaborated with cross-functional teams to seamlessly integrate new features and services in the backend, resulting in a **30%** reduction in deployment time through enhanced CI/CD practices.\nMaintained a focus on clear, effective **English** communication to document project progress, technical designs, and developer handoffs, ensuring stakeholder alignment and clarity in project execution.\nEngaged in troubleshooting and debugging backend issues, decreasing incident response times by **40%** through active monitoring and performance optimization strategies."
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP, Go, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), AWS SQS\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Unit Testing, Integration Testing, English",
  "apply_company": "Hostaway"
}