{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Oracle Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Oracle Engineer with 10+ years of experience in Application Development, focusing on delivering high-performance software solutions. Proficient in **Java**, **JavaScript**, **Python**, **PHP**, **SQL**, and developing **RESTful APIs** and **Web Services**. Extensive expertise in data modeling and unit testing, ensuring robust and scalable solutions. Well-versed in the software architecture and report development, with familiarity in **Oracle Fusion B2B** and **Oracle Service Cloud**.\nDemonstrated background in healthcare and finance sectors, with hands-on experience in **HTML**, **CSS**, and the implementation of cloud-native applications on **Azure** and **AWS**. Skilled in leading projects that prioritize compliance and security standards, including HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, possesses practical experience in MLOps, utilizing tools such as MLflow, Airflow, and Kubeflow for ML pipelines and production workflows. Driven to create systems that not only meet technical requirements but also deliver tangible results.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Oracle Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and optimized **RESTful APIs** and **Web Services** to enhance the functionality of applications in the **Oracle Service Cloud** environment, ensuring high performance and reliability.\n•\tUtilized **Java** and **PHP** to implement enterprise-level solutions, enhancing system capabilities while maintaining compliance with industry standards and best practices.\n•\tCrafted dynamic user interfaces using **JavaScript**, **HTML**, and **CSS** to improve user experience and satisfaction in various client applications.\n•\tConducted **Data modeling** and **report development** to support business intelligence initiatives, leading to smoother data insights and operational efficiency, positively impacting key performance indicators by up to **30%**.\n•\tImplemented comprehensive **unit testing** and debugging strategies to ensure code quality and robustness, achieving a 95% test coverage rate across the application.\n•\tArchitected and structured **application development** strategies for performant software solutions leveraging the **Fusion CRM Application**, ensuring scalability and maintainability.\n•\tCollaborated across teams to integrate business intelligence experiences, enhancing the reporting capabilities and aligning them with organizational goals.\n•\tDesigned and executed effective testing protocols that improved software reliability and reduced the bug rate by **40%** before production release.\n•\tFostered familiarity with **Oracle Fusion B2B** to aid in the development of collaborative platforms and service integrations, driving client engagement and satisfaction.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Developed and integrated **RESTful APIs** and **Web Services** using **Java** and **PHP**, ensuring seamless interaction with **Oracle Service Cloud** and enhancing application performance for a high-transaction environment.\n- Crafted dynamic interfaces employing **JavaScript**, **HTML**, and **CSS**, along with responsive frameworks, to create user-friendly applications for financial report development and data visualization.\n- Executed data modeling and architecture solutions that improved query performance by **30%**, ensuring data integrity and efficient retrieval for reporting and BI applications.\n- Conducted rigorous unit testing and debugging processes, achieving a reduction in defects by **25%**, which contributed to the overall reliability of applications deployed in the **Oracle Fusion** ecosystem.\n- Spearheaded the modernization of financial reporting tools, utilizing **SQL** and **BI experience**, streamlining reporting processes and enhancing data analysis capabilities.\n- Collaborated in the development of the **Fusion CRM Application**, integrating seamless user experiences and operational workflows, resulting in improved user satisfaction from 75% to **90%**.\n- Designed and implemented application development strategies, creating scalable architecture solutions that accommodated **over 100,000** transactions per day while utilizing best practices in software architecture."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **Java** and **PHP** for developing and optimizing high-performance backend services in the **Oracle Service Cloud**, ensuring system stability and scalability across critical modules.\nDesigned and implemented **RESTful APIs** and **Web Services** to enhance integration points between the **Oracle Fusion B2B** and external systems, featuring a streamlined data access layer using **SQL** for efficient queries and reporting.\nUtilized **Python** for automated data modeling and report development, achieving a **30%** reduction in data processing time and improved decision-making accuracy.\nConducted rigorous **unit testing** and debugging processes for all applications, maintaining a code quality standards that support continuous integration and deployment methodologies.\nCollaborated in **application development** for the **Fusion CRM Application**, enhancing user interfaces leveraging **JavaScript**, **HTML**, and **CSS** for a seamless user experience.\nImplemented software architecture best practices, ensuring code maintainability and facilitating smoother onboarding of new features in a collaborative environment.\nDrove development efforts for business intelligence (BI)-related projects, resulting in insightful analytics contributions that influenced product strategy and customer engagement initiatives.\nExecuted comprehensive data modeling practices to support a robust database structure, enhancing performance and scalability for enterprise-level applications.\nImproved customer service workflows by developing web applications that interface with the **Oracle Service Cloud**, which allowed for efficient incident tracking and resolution management.\nTrained and mentored junior engineers in software architecture principles, unit testing strategies, and debugging techniques, helping to elevate team performance and code quality."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, JavaScript, TypeScript, PHP\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n **API Technologies:**\n\tRESTful APIs, Web Services\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Data modeling, Unit Testing, Debugging, Application Development, Fusion CRM Application Development, Software Architecture, Report development, BI experience, Familiarity with Oracle Fusion B2B",
  "apply_company": "Oracle"
}