{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Java Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior Java Engineer with over 9 years in software engineering, I possess advanced skills in Java development, using IDEs such as **IntelliJ** and **Eclipse**. I have a proven track record of building scalable and maintainable applications utilizing **Git** for version control and employing best practices in **HTML**, **CSS**, and **JavaScript** for frontend integration. My database expertise includes working with **Oracle** and **Postgres**, ensuring robust data management and retrieval. Additionally, I bring strong problem-solving skills and an ability to communicate complex technical concepts in **English**, contributing to effective teamwork and project success. My background as a full stack developer enhances my capability to collaborate across the software development lifecycle and deliver high-performance solutions tailored to client requirements.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed robust and scalable applications using **Java** and frameworks like **Spring** in alignment with best practices for software development.\nUtilized **IntelliJ** and **Eclipse** IDEs to write, debug, and test high-quality Java code, achieving a code quality score of **95%** based on code review metrics.\nCollaborated with cross-functional teams to design user interfaces using **HTML**, **CSS**, and **JavaScript**, enhancing user experience and achieving a **30%** increase in customer satisfaction ratings.\nManaged database interactions using **Oracle** and **Postgres**, optimizing performance through efficient query design, resulting in a **40%** reduction in load times.\nImplemented version control and collaboration tools such as **Git**, ensuring streamlined code integration and team collaboration.\nLed the adoption of agile methodologies within a team of **10+** engineers, promoting continuous integration and delivery practices.\nMentored junior developers in Java programming, fostering skill development and enhancing team productivity by **20%**.\nDesigned and maintained responsive web applications that operate seamlessly across multiple devices, providing a consistent user experience.\nParticipated in code reviews and provided constructive feedback to peers, promoting a culture of knowledge sharing and high coding standards.\nConfigured CI/CD pipelines to automate testing and deployment processes, which reduced release times by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized Java frameworks (such as **Spring** and **Hibernate**) to lead the development and optimization of scalable applications, ensuring efficient data management with **Oracle** and **Postgres** databases.\nCollaborated with front-end teams to create dynamic user interfaces using **HTML**, **CSS**, and **JavaScript**, maintaining compatibility across various browsers and devices.\nDeveloped and maintained version **1.2.0** of the internal project management tool in Java, achieving a **30%** reduction in processing time through optimal coding practices.\nImplemented CI/CD pipelines using **Git** for version control and **Eclipse** for efficient code deployment, improving release cycles by **20%**.\nWorked with software architecture patterns, including MVC and Microservices, to design robust applications and improve system modularity.\nEngaged in code reviews and knowledge-sharing sessions to foster team growth and elevate code quality standards, utilizing **IntelliJ** for advanced debugging features.\nTrained junior developers on best practices in **Java** development, enhancing team efficiency and speeding up onboarding processes by **25%**.\nParticipated actively in agile methodologies, conducting sprint planning and retrospectives to streamline project workflows and ensure alignment with project goals.\nConducted regular performance testing and refinement of applications, leading to an increase in overall application performance metrics by **15%**.\nEnsured all development adhered to coding standards and successful project delivery by utilizing **Git** for source control and employing best practices in the development lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Java** to design and optimize backend services for an e-commerce platform, achieving a **30%** improvement in performance metrics across checkout, cart, and order fulfillment modules.\nDeveloped robust RESTful APIs in **Java** to handle high-volume transactions, ensuring seamless integration between frontend interfaces and backend systems for real-time customer interactions.\nLeveraged **PostgreSQL** and **Oracle** databases with **Java** for designing, optimizing, and managing transactional databases, enhancing query performance by **25%**.\nBuilt dynamic, responsive frontends integrated with **Java** backends using **Angular** and modern frontend technologies like **HTML5**, **CSS3**, and **JavaScript**, applying state management strategies for smooth user experiences.\nAutomated builds, testing, and deployments with CI/CD pipelines utilizing **Git**, ensuring consistent and reliable delivery of features, reducing deployment times by **40%**.\nConducted unit and integration tests in **Java** and automated frontend testing, ensuring high code quality and reducing manual effort.\nImplemented observability in **Java** services using monitoring tools for performance tracking, error detection, and system health monitoring.\nMigrated legacy applications to **Java** microservices, modernizing backend systems while preserving critical business workflows.\nCollaborated with teams to design and develop SEO-optimized, mobile-friendly websites (integrated with **Java APIs**) for cross-device accessibility.\nParticipated in code reviews and utilized **Eclipse** and **IntelliJ** IDEs for maintaining high-quality code standards.\nEnhanced collaboration and communication skills by working in a diverse team environment, delivering projects in **Agile** methodologies."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, Python, JavaScript, SQL\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor, HTML, CSS\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Oracle\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n**Other:**\n\tGit, English, Keycloak (OIDC, RBAC), JWT, OAuth2, Pydantic, SQLAlchemy, Celery",
  "apply_company": "Action ICT SRL"
}