{
  "name": "Tomasz Lee",
  "role_name": "Senior Python Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Python Engineer with 9+ years of experience in creating and deploying scalable microservices using **Python**, **FastAPI**, and **Docker**. Proficient in developing RESTful and gRPC APIs, with a strong grasp of **OpenAPI** standards. Skilled in container orchestration with **Kubernetes** and implementing CI/CD pipelines using **GitHub Actions** and **Terraform**. Extensive knowledge of cloud services, particularly **AWS**, ensures robust and secure application deployments. Additionally, experienced in leveraging AI and ML technologies to enhance application functionality. Proven track record of optimizing development processes, conducting thorough code reviews, and fostering collaborative environments to drive projects to completion. Well-versed in modern software development practices and tools, including **Version Control** and comprehensive testing methodologies.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop scalable microservices architecture, enhancing application performance and scalability.\nImplemented automated CI/CD pipelines using **GitHub Actions**, leading to a reduction in deployment time by **40%**.\nLeveraged **Docker** and **Kubernetes** for containerization and orchestration, allowing for increased application reliability and scalability.\nCreated and maintained **REST**ful and **gRPC** APIs to ensure seamless communication between services, improving service reliability.\nIntegrated **AWS** services for resource management and deployment, ensuring high availability and cost efficiency.\nEmployed **Terraform** and **CDK** for infrastructure as code (IaC), optimizing resource provisioning and configuration.\nConducted thorough testing and code reviews to maintain high code quality standards, enhancing system reliability.\nCollaborated with cross-functional teams to implement machine learning strategies and leverage **AI** capabilities, improving decision-making processes.\nStreamlined version control processes to ensure effective code management and collaboration across teams.\nManaged the deployment and scaling of applications on cloud environments, achieving a **35%** improvement in response times while maintaining 99.9% uptime."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and **FastAPI** to design and develop scalable microservices, enhancing system flexibility and responsiveness.\nImplemented containerization using **Docker** and orchestrated deployments with **Kubernetes**, improving application reliability by 40%.\nDesigned RESTful APIs and integrated them with **OpenAPI** specifications to ensure clarity in service communication, resulting in a 30% reduction in client-side errors.\nLed the establishment of **CI/CD** pipelines through **GitHub Actions**, resulting in a 25% decrease in deployment times with consistent versioning control.\nConducted effective testing strategies to ensure code quality and adherence to standards, reducing critical bugs by 20% in released versions.\nEngaged in code reviews to promote best practices and foster knowledge sharing among team members, boosting overall team productivity by 35%.\nEmployed **AWS** services for scalable cloud infrastructure, ensuring 99.9% uptime and enhancing platform reliability.\nUtilized **Terraform** for infrastructure as code, streamlining deployment configurations with a 15% reduction in setup times.\nCollaborated with cross-functional teams to gather requirements, contributing to timely feature delivery and project success.\nIntegrated **LangChain** and **LangGraph** for AI-driven functionalities, enabling advanced data processing capabilities and user insights."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged Python and **FastAPI** to develop and implement scalable microservices, enhancing system architecture and responsiveness by 30%.\nDesigned and deployed containerized applications using **Docker** and **Kubernetes**, optimizing resource utilization and application deployment time by 25%.\nBuilt RESTful APIs and integrated **gRPC** for internal and external services, facilitating seamless communication and data exchange across platforms.\nUtilized **OpenAPI** for API documentation, improving developer onboarding time by 40% and ensuring adherence to best practices.\nImplemented CI/CD pipelines with **GitHub Actions** to automate testing and deployment processes, reducing potential errors and deployment time by 50%.\nManaged infrastructure as code using **Terraform** and **CDK**, enabling consistent environment setups and rapid scaling of services.\nCollaborated on AI and ML initiatives, integrating advanced algorithms into existing systems for enhanced functionality.\nConducted thorough unit testing and code reviews, ensuring high-quality deliverables and compliance with coding standards.\nProduced comprehensive technical documentation, fostering better understanding and knowledge sharing among teams, leading to a 20% reduction in support tickets.\nEngaged in active communication with cross-functional teams to ensure successful project execution and alignment with business objectives."
    }
  ],
  "skills": " **Programming Languages**\n\tPython\n\n **Backend Frameworks**\n\tFastAPI\n\tMicroservices\n\n **Frontend Frameworks**\n\tHTML\n\tCSS\n\tJavaScript\n\tTypeScript\n\tReactJS\n\tNextJS\n\tVueJS\n\tNuxtJS\n\tAngular\n\tMaterial UI\n\tThree.js\n\tD3.js\n\tReact Native\n\tFlutter\n\tChakra UI\n\tTailwindCSS\n\n **API Technologies**\n\tREST\n\tGraphQL\n\tgRPC\n\tOpenAPI\n\n **Serverless and Cloud Functions**\n\tAWS\n\tAzure\n\n **Databases**\n\tMSSQL Server\n\tMySQL\n\tPostgreSQL\n\tMongoDB\n\tDynamoDB\n\tCosmosDB\n\n **DevOps**\n\tDocker\n\tKubernetes\n\tCI/CD pipelines\n\tGitHub Actions\n\tTerraform\n\tCDK\n\n **Cloud & Infrastructure**\n\tAWS\n\n **Other**\n\tUX/UI Design\n\tGit\n\tGitHub\n\tTesting\n\tCode Reviews\n\tNUnit\n\txUnit\n\tSelenium\n\tMoq\n\tPostman\n\tCypress\n\tJMeter\n\tJest\n\tBlockchain\n\tSolidity\n\tEther.js\n\tWeb3.js\n\tEthereum\n\tAI\n\tML\n\tVersion Control\n\tLangChain\n\tLangGraph\n",
  "apply_company": "Grupo Digital"
}