{
  "name": "DANIEL HE",
  "role_name": "Senior React Native Developer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Driven Senior React Native Developer with extensive experience in **JavaScript**, **React.js**, and **React Native** for web and mobile app development. Proven ability to create scalable, user-centric applications that enhance user experience and engagement. Highly skilled in integrating **Open Source** technologies and collaborating effectively within teams. Recognized for proactive problem-solving skills and a self-driven approach, continuously optimizing application performance and fostering a culture of communication and teamwork.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Senior React Native Developer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed mobile applications using **React Native**, ensuring a seamless user experience and optimized performance across platforms.\nCollaborated with cross-functional teams to design and implement web solutions leveraging **JavaScript**, enhancing overall application functionality and responsiveness by 30%.\nEnhanced the user interface of mobile applications with **React.js**, improving user engagement by 25% through intuitive design.\nContributed to open-source projects, fostering community collaboration and demonstrating strong communication skills.\nProvided proactive solutions to complex development challenges, reducing bug resolution time by 40% and improving code quality across development teams.\nUtilized agile methodologies and led team meetings to ensure project milestones were met on time, demonstrating strong teamwork and leadership skills.\nImplemented best practices for **mobile app development**, improving app performance by 20% and user retention rates."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "• Developed web and mobile applications utilizing **React.js** and **React Native**, fostering a dynamic user experience and optimizing performance.\n• Collaborated effectively in a team environment, demonstrating strong communication skills to enhance project outcomes.\n• Implemented proactive strategies for code quality and project management, delivering features on schedule and exceeding expectations.\n• Leveraged **JavaScript** to build reusable components and improve development productivity by **30%**.\n• Engaged in open-source projects, providing contributions that increased community frameworks' efficiency.\n• Successfully led a project that integrated critical user features, resulting in a **40%** increase in user engagement."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Focused on mobile app development using **React Native**, delivering seamless user experiences across platforms.\nContributed to web development with **JavaScript** and **React.js**, enhancing application functionality and interactivity.\nCollaborated with cross-functional teams, leveraging strong communication skills to ensure project alignment and timely delivery.\nPlayed a proactive role in code reviews and knowledge sharing sessions, fostering an open-source culture within the team.\nImplemented testing strategies, reducing bugs by 30% and improving release cycles by 20%.\nUtilized version control systems, ensuring organized project management and team collaboration."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, JavaScript, Go, Python, SQL, Swift, Kotlin\n\n **Frontend Frameworks**\n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest, React Native\n\n **Backend Frameworks**\n\tSpring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n **API Technologies**\n\tRESTful API design\n\n **Databases**\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n **DevOps**\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline\n\n **Cloud & Infrastructure**\n\tAWS (EKS, RDS, CloudFront, S3, Lambda), API Gateway, Git, CloudWatch, ELK Stack\n\n **Other**\n\tMicroservices, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies, web development, mobile app development, Open Source, communication, team player, proactive, self-driven"
}