{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I possess a robust skill set in **C++**, **software design**, and **database internals**, which are essential for executing complex query strategies and optimizing transactional and analytical workloads. My strong foundation in **data structures** and **algorithms** allows me to design efficient software solutions, while my expertise in **cloud-native** applications spans multiple platforms including **AWS**, **Google Cloud**, and **Microsoft Azure**.\n\nI have successfully led the development of high-performance applications, integrating modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My experience includes developing enterprise-grade platforms in the healthcare and financial sectors and ensuring compliance with standards like HIPAA and PCI DSS. I also have a deep understanding of **MongoDB Atlas** and strong familiarity with cloud architectures.\n\nIn addition to my technical expertise, I thrive in collaborative environments, offering mentoring and coaching to junior developers. My knowledge of microservices architecture, event-driven systems, and CI/CD automation further empowers my ability to build robust, secure applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Ensured high performance and reliability in **cloud-native** applications by optimizing **C++** algorithms for query execution and implementing efficient database internals to manage both transactional and analytical workloads.\nDesigned and developed robust data structures and software designs that facilitate complex **MongoDB Atlas** operations and queries, enhancing data management efficiency.\nMentored and coached junior developers on best practices for **AWS**, **Google Cloud**, and **Microsoft Azure** deployment, fostering a collaborative team environment.\nCollaborated with cross-functional teams to architect scalable solutions in **cloud-native** environments, ensuring seamless integration across various platforms.\nUtilized performance metrics to identify and resolve bottlenecks in system performance, improving overall application efficiency by **30%**.\nParticipated in code reviews to maintain clean code standards and promote best practices in software development, while also improving team knowledge through effective collaboration.\nOptimized database performance for **MongoDB Atlas**, achieving query execution improvements resulting in reduced response times by **25%**.\nConducted workshops and training sessions to enhance team skills in data structures, algorithms, and software design principles relevant to **cloud-native** development.\nLed initiatives to implement advanced testing strategies for **cloud-native** applications, ensuring high-quality deliverables and lowering bug rates by **40%** through thorough unit and integration tests.\nFostered a culture of excellence and innovation through continuous learning, enhancing team capabilities in **C++** and software design methodologies."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged expertise in **C++** and **software design** to enhance transactional and analytical workloads, ensuring optimal performance and reliability in financial systems.\nImplemented and optimized **database internals** and **query execution** strategies to improve efficiency on high-volume transaction processing systems, achieving a **20% decrease** in system latency.\nCollaborated with cross-functional teams to design and develop scalable cloud-native applications deployed on **AWS**, **Google Cloud**, and **Microsoft Azure**, effectively aligning technology solutions with business objectives.\nMentored junior developers and conducted coaching sessions on **data structures** and **algorithms**, fostering a culture of continuous improvement and knowledge sharing within the team.\nDesigned and built ETL pipelines using **Python**, **Apache Airflow**, and **MongoDB Atlas**, facilitating the seamless integration of financial data from multiple sources, achieving **95% data integrity**.\nContributed to the modernization of legacy systems by adopting microservices architecture, enhancing maintainability and supporting the dynamic needs of financial applications.\nImplemented effective collaboration methods for project execution and delivery deadlines, resulting in a **30% improvement** in team productivity and project turnaround times."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **C++** to implement efficient data structures and algorithms for executing complex queries, contributing to optimal performance in high-transaction environments.\nEngineered and optimized **database internals** for scalable, cloud-native applications hosted on **AWS**, **Google Cloud**, and **Microsoft Azure**, ensuring reliability under analytical workloads and transactional workloads.\nDeveloped robust software design patterns that enhanced code maintainability and facilitated **mentoring** and **coaching** of junior developers, fostering a collaborative team environment.\nApplied advanced problem-solving techniques to navigate and resolve intricate software challenges, elevating overall project quality and efficiency.\nFacilitated **collaboration** among cross-functional teams to implement innovative solutions and ensure alignment with business goals, achieving a **30%** reduction in development cycle time.\nDesigned systems for high availability and resilience in handling **analytical workloads**, resulting in a **25%** increase in data processing speeds.\nEngaged in performance tuning and optimization of applications, achieving a **15%** reduction in resource consumption across projects.\nConducted code reviews and provided constructive feedback to improve code quality and best practices within team projects."
    }
  ],
  "skills": " **Programming Languages:**\n\tC++, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Google Cloud Functions, Azure Functions\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, MongoDB Atlas, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Google Cloud\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, Let’s Encrypt, Nginx, Certbot, query execution, database internals, data structures, algorithms, software design, transactional workloads, analytical workloads, mentoring, coaching, collaboration",
  "apply_company": "MongoDB"
}