{
  "name": "Tomasz Lee",
  "role_name": "Senior Web Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Web Engineer with 9+ years of experience in delivering high-quality web solutions. Proficient in **HTML**, **CSS**, **JavaScript**, and **Liquid** for creating dynamic web interfaces. Skilled in integrating with **Shopify** and managing content through various **CMS** platforms, ensuring optimal user experiences and adherence to **SEO** best practices. Adept at employing design tools like **Figma** and **Zeplin** for seamless collaboration with UI/UX teams. Strong understanding of version control using **Git**. Originally specialized in **.NET**, **C#**, **ReactJS**, and **NextJS**, with substantial experience in **microservices architecture**, demonstrating a proven track record of successfully leading projects and optimizing performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed responsive web applications using **HTML**, **CSS**, and **JavaScript**, enhancing user engagement metrics by 30%.\n• Managed e-commerce projects using **Shopify** and **Webflow**, driving a 25% increase in online sales through optimized site performance.\n• Created custom templates leveraging **Liquid** for dynamic content management, improving site loading times by 20%.\n• Collaborated with stakeholders to ensure SEO best practices were integrated into every development cycle, increasing organic traffic by 15%.\n• Utilized **Figma** and **Zeplin** for design handoff processes, streamlining communication between designers and developers and reducing design revisions by 25%.\n• Maintained and optimized project versions using **Git**, ensuring efficient version control and collaboration across the development team.\n• Conducted frontend testing and debugging to enhance cross-browser compatibility, resulting in a 98% pass rate on testing metrics.\n• Worked closely with content management systems (CMS) to ensure timely updates and functionalities that elevate user experience.\n• Assisted in the design and implementation of progressive web applications (PWA) to meet modern web standards, ensuring an optimal mobile and desktop interface."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and maintained responsive web applications using **HTML**, **CSS**, and **JavaScript**, resulting in a 20% increase in page load speed.\nImplemented SEO best practices in web designs, enhancing site visibility and driving a 30% growth in organic traffic.\nCollaborated with design tools like **Figma** and **Zeplin** to ensure accurate implementation of UI/UX designs for improved user experience.\nIntegrated e-commerce functionalities using **Shopify** and **Webflow**, streamlining the online shopping process for a 15% boost in conversion rates.\nUtilized version control with **Git** to manage codebase changes, facilitating a smoother workflow among team members.\nCreated and optimized custom CMS solutions to enable easy content management, leading to a 40% decrease in content update time.\nConducted thorough testing for cross-browser compatibility, ensuring 100% functionality across major browsers.\nLed workshops and training sessions for junior developers in **Liquid** templating language and web development best practices, fostering team growth and collaboration.\nAnalyzed user feedback and performance metrics to implement iterative improvements, achieving a 35% increase in user satisfaction scores."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed engaging and responsive websites using **HTML**, **CSS**, and **JavaScript**, optimizing user experience to increase customer engagement by **25%**.\nImplemented collaborative designs through **Figma** and **Zeplin**, ensuring pixel-perfect fidelity and seamless transitions from design to development, which reduced design-to-development time by **15%**.\nLeveraged **Shopify** and **Webflow** to create high-performing e-commerce platforms, increasing sales conversions by **30%**.\nEmployed **Liquid** templating language to customize Shopify themes, enhancing the functionality of online stores and delivering tailored customer experiences.\nConducted SEO audits and applied best practices to improve search engine rankings, resulting in a **40%** increase in organic traffic.\nUtilized **Git** for version control and collaborative coding, maintaining code integrity and facilitating efficient team workflows.\nParticipated in agile ceremonies, including daily standups and retrospectives, to ensure team accountability and project alignment.\nDelivered comprehensive technical documentation and CMS training materials for clients, resulting in improved user satisfaction and support efficiency.\nChampioned front-end performance optimizations, reducing load times by **20%** and significantly enhancing user retention.\n"
    }
  ],
  "skills": "**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, Webflow, Shopify, Liquid, CMS, SEO, Figma, Zeplin\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n**Database Systems**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & Infrastructure**\n\tAWS, Azure, CI/CD pipelines\n\n**DevOps**\n\tGit, GitHub\n\n**Testing Tools**\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\n**Blockchain**\n\tSolidity, Ether.js, Web3.js, Ethereum\n\n**Other Skills**\n\tPython, Redux, UX/UI Design",
  "apply_company": "Setsail Marketing"
}