{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Java Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Java Engineer with 10+ years of delivering high-performance software solutions, skilled in **Java**, **Spring**, and **API** development. Experienced in applying Domain-Driven Design (DDD) principles to create robust applications and proficient in integrating microservices using **Kafka** for real-time data processing. Expertise in CI/CD processes, ensuring smooth deployment cycles while adhering to SCRUM methodologies for Agile project management. Familiar with API specifications through **OpenAPI** and seasoned in utilizing **Maven** for project management and build automation.\nBrings a robust background in modern technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise across the full stack using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Demonstrated capability in developing cloud-native applications on **Azure** and **AWS**, and successfully led the development of enterprise platforms implementing AI/ML for real-time analytics, automation, and intelligent decision-making. Adept at building secure, maintainable solutions that comply with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about creating systems that drive tangible impact while ensuring technical excellence.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped robust API solutions using **Java** and **Spring**, adhering to API design principles and standards, ensuring seamless integration across microservices architectures.\n•\tImplemented Domain-Driven Design (DDD) strategies to enhance application scalability and robustness, ensuring that complex business requirements are efficiently modeled.\n•\tLed the establishment of CI/CD pipelines for continuous integration and deployment using tools like **Maven** and **Kafka**, improving deployment frequency by **40%** and reducing lead time for changes by **30%**.\n•\tCollaborated in a **SCRUM** framework, participating in sprint planning and daily stand-ups to manage project milestones and deliverables effectively.\n•\tUtilized **OpenAPI** specifications to document RESTful APIs, enhancing communication among team members and streamlining the onboarding process for new developers by **25%**.\n•\tExecuted serialization and communication protocols using **protobuf** and **gRPC**, achieving lower latency and increased performance in inter-service communications by **50%**.\n•\tManaged data streaming and messaging patterns using **Kafka**, ensuring reliable data delivery and processing for real-time applications.\n•\tDesigned and implemented unit and integration tests using JUnit and Spring Test, ensuring code quality and coverage exceeding **90%**.\n•\tInterfaced with external services through RESTful APIs and maintained backward compatibility during major upgrades, facilitating smooth transitions and enhanced user experiences.\n•\tDocumented system architecture and design patterns to foster knowledge sharing within the team and align with organizational best practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring** to design and develop scalable web services and APIs adhering to **OpenAPI** specifications, ensuring high performance and reliability in financial applications.\nImplemented **Kafka** for effective event streaming and messaging, enabling seamless data flow between microservices in a distributed system and enhancing system responsiveness.\nApplied Domain-Driven Design (**DDD**) principles to create a robust architecture that improves collaboration with stakeholders and aligns tech solutions with business goals.\nDeveloped and maintained CI/CD pipelines using **Maven** and version control systems, ensuring consistent and efficient deployment processes, reducing deployment time by **30%**.\nParticipated in SCRUM ceremonies to prioritize tasks and maintain clear communication across cross-functional teams, improving project delivery times.\nCollaborated in the integration of **gRPC** and **protobuf** for efficient communication between services, achieving optimized payload sizes and reduced latency in data transfer.\nLeveraged **API** management tools to enhance the security, monitoring, and governance of APIs, facilitating compliance with industry standards.\nEngaged in performance tuning and optimization efforts that led to a **25%** increase in application throughput during peak loads, ensuring seamless user experiences."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized backend services using **Java** and **Spring** for a high-performance e-commerce platform, ensuring robust API development and adherence to Domain-Driven Design (**DDD**) principles.\nImplemented event-driven architecture utilizing **Kafka** for real-time data processing, enhancing order updates and inventory management, leading to a 30% reduction in processing time across critical services.\nEmployed **CI/CD** pipelines to automate deployment processes, resulting in a deployment frequency increase by 50% and minimizing downtime during releases.\nCollaborated in an agile **SCRUM** environment, participating in daily stand-ups and sprint planning to facilitate adaptive planning and rapid response to changing project requirements.\nDefined and documented RESTful APIs following the **OpenAPI** specification, ensuring clear communication and integration with front-end components and third-party services.\nImplemented microservices architecture using **Maven**, ensuring modularity and scalability of the application, ultimately supporting a user base growth of 40% over six months.\nUtilized **protobuf** for data serialization in service communication, significantly reducing payload sizes and increasing throughput in inter-service communication.\nIntegrated **gRPC** for efficient and high-performance service-to-service calls, resulting in a decrease of latency by 20% in core functionalities.\nDesigned and maintained a resilient infrastructure with an emphasis on monitoring and logging to ensure high availability and responsiveness of all services.\nMentored junior developers through code reviews and knowledge-sharing sessions, fostering a collaborative and innovative team culture."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tSpring, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI, OpenAPI, gRPC, protobuf\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Kafka, DDD, SCRUM, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "BETWEEN TECHNOLOGY"
}