{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Electrical Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Electrical Engineer with 10+ years of experience in electrical installation and maintenance, ensuring compliance with health and safety regulations in diverse environments. Expertise in managing and optimizing **BMS**, **heating systems**, and **air conditioning**, complemented by hands-on capabilities in **plumbing** and **carpentry**. Proven track record in team collaboration, communication, and leading cross-functional projects that deliver high-quality results. Committed to adhering to strict compliance and safety standards while fostering a culture of teamwork and innovation. Holds a valid driving license and certifications in **IPAF** and **PASMA**, ready to leverage technical skills to enhance operational efficiency and project success.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Electrical Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tEnsured compliance with Health & Safety Regulations in all electrical installations and maintenance tasks, maintaining high standards of safety across all project sites.\n•\tLed the installation, maintenance, and repair of Heating Systems and Air Conditioning systems, adhering to best practices and industry standards in **BMS** integration.\n•\tCollaborated with cross-functional teams to enhance communication and promote team collaboration during complex electrical projects, ensuring timely project delivery.\n•\tImplemented effective methodologies for **Electrical Installation** projects, achieving a **20%** reduction in installation time and overall costs.\n•\tUtilized **CAFM System** for scheduling maintenance tasks and managing work orders, resulting in a **15%** increase in operational efficiency.\n•\tExecuted plumbing and carpentry tasks as part of installations and renovation projects, demonstrating versatility in skill and ensuring comprehensive project execution.\n•\tObtained and maintained certifications in **IPAF** and **PASMA**, facilitating safe working practices for both individual and team operations on-site.\n•\tSuccessfully maintained clear and open lines of communication with team members and stakeholders to optimize project outcomes.\n•\tDrove commitment to safety and quality standards by conducting thorough assessments of electrical installations and proposing timely solutions for compliance.\n•\tDemonstrated a valid **Driving License** for travel to project sites and meetings, ensuring flexibility and availability across the region."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Ensured compliance with **Health & Safety Regulations** during installation and maintenance of electrical systems, significantly reducing incidents by **30%**.\nPerformed **Electrical Installation** and **Electrical Maintenance** for complex systems, achieving a **95%** operational efficiency rate across multiple projects.\nCollaborated effectively with cross-functional teams, enhancing **Team Collaboration** and improving project delivery times by **15%** through streamlined communication.\nUtilized Building Management Systems (**BMS**) to optimize the performance of **Heating Systems** and **Air Conditioning**, leading to energy savings of up to **20%**.\nConducted regular inspections and maintenance on electrical infrastructure, ensuring compliance with industry standards and regulations.\nApplied knowledge in **Plumbing** and **Carpentry** to address multi-discipline challenges, providing innovative solutions to complex installation issues.\nDelivered training sessions focused on **Communication Skills** and **Team Collaboration**, resulting in improved team dynamics and project outcomes.\nMaintained accurate records within a **CAFM System**, enhancing operational visibility and drive strategic decision-making.\nUtilized **IPAF** and **PASMA** certifications to safely operate access equipment on-site, contributing to a hazard-free work environment."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Ensured compliance with **Health & Safety Regulations** while performing **Electrical Installation** and **Electrical Maintenance** on high-profile projects, focusing on optimal safety standards and quality assurance.\nDesigned and implemented **Building Management Systems (BMS)** for efficient energy management and monitoring, leading to a **25% reduction in operational costs** through streamlined controls and automation.\nLed troubleshooting and repairs of **Heating Systems**, **Air Conditioning**, and other essential systems, achieving a **15% improvement in system reliability** through proactive maintenance schedules.\nCollaborated effectively with cross-functional teams to enhance project outcomes and ensure timely completion, demonstrating strong **Team Collaboration** and **Communication Skills** throughout the project lifecycle.\nUtilized **CAFM System** for facility management processes, optimizing workflows and increasing team productivity by **30%** in handling service requests and maintenance schedules.\nConducted training sessions on best practices for the installation and maintenance of electrical systems, thereby improving team expertise and adherence to technical standards.\nManaged vendor relationships to ensure high-quality procurement of electrical materials, monitoring quality assurance and compliance under **current electrical standards**.\nMaintained valid **Driving License** and operated on-site machinery utilizing **IPAF** and **PASMA** certifications for safe and compliant working conditions, promoting a culture of safety and efficiency within the team."
    }
  ],
  "skills": "### **Programming Languages**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n### **Backend Frameworks**\n\t\n\n### **Frontend Frameworks**\n\t\n\n### **API Technologies**\n\t\n\n### **Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n### **Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n### **DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n### **Cloud & Infrastructure**\n\t\n\n### **Other**\n\tElectrical Installation, Electrical Maintenance, Health & Safety Regulations, BMS, Heating Systems, Air Conditioning, Plumbing, Carpentry, Communication Skills, Team Collaboration, CAFM System, Driving License, IPAF, PASMA, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "JLL"
}