{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Dynamic Senior Sales Engineer with 8 years of experience in cloud infrastructure and enterprise monitoring solutions across diverse sectors, particularly healthcare and finance. Proficient in delivering effective event management strategies utilizing tools like **AWS**, **Azure**, **GCP**, **Nagios**, **Datadog**, and **Splunk**. Skilled in SaaS product deployment and support, coupled with strong communication and presentation abilities.\n\nDemonstrated expertise in full-stack development, utilizing **Python**, **JavaScript**, **React**, **Next.js**, and **Node.js** to build robust applications. Building solutions on modern web technologies, with a solid understanding of microservices architecture, CI/CD automation, and network systems. I have a proven track record in compliance adherence, with a keen focus on standards like HIPAA, FHIR, PCI DSS, and SOC 2. Notable experience collaborating with technical teams and stakeholders to integrate innovative features and optimize enterprise-grade platforms.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged comprehensive knowledge of **AWS**, **Azure**, and **GCP** to monitor, manage, and enhance cloud infrastructure performance in enterprise environments.\n- Implemented and optimized enterprise monitoring solutions using **Datadog**, **Splunk**, and **Nagios**, ensuring robust event management and proactive incident response.\n- Developed SaaS solutions utilizing **Python** and **JavaScript** frameworks, ensuring high availability and scalability for clients.\n- Communicated effectively with cross-functional teams to present complex technical concepts, documentation, and solutions, driving successful project outcomes.\n- Provided expert guidance on cloud monitoring and incident management strategies, aligning them with business objectives to enhance operational efficiency.\n- Conducted training sessions on cloud infrastructure and monitoring tools for team members and end users, fostering a collaborative learning environment.\n- Maintained proficiency in **Linux** and **Windows** environments, facilitating seamless integration with network services and application deployments.\n- Documented monitoring processes and solutions, establishing clear guidelines for usage, maintenance, and troubleshooting for various teams.\n- Collaborated with stakeholders to gather requirements for monitoring and event management, contributing to the development of tailored solutions to meet customer needs.\n- Engaged in ongoing professional development within the field, keeping abreast of industry trends and emerging cloud technologies, specifically focusing on enterprise-level solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **AWS**, **Azure**, and **GCP** cloud solutions to enhance enterprise monitoring and event management frameworks, driving improvements in system performance and uptime across financial platforms.\nUtilized **Python** and **JavaScript** to provide robust SaaS solutions catered to client needs, ensuring seamless integration with existing infrastructures and workflows in financial environments.\nImplemented **Nagios** and **Datadog** for proactive monitoring and alerting of critical systems, reducing incident response time by **40%** and enhancing overall operational efficiency.\nDeveloped detailed presentations and communication materials to convey technical solutions to stakeholders, resulting in a **25%** increase in client engagement during product demonstrations.\nCollaborated with cross-functional teams utilizing **ServiceNow** and **Jira** to manage project timelines, streamline processes, and optimize service delivery, meeting **90%** of project milestones.\nDesigned and implemented cloud infrastructure solutions on **Azure** for high availability and security, hosting applications with a backup strategy that guarantees **99.9%** uptime.\nParticipated in strategic meetings, providing insights on network and system performance monitoring to improve service delivery standards.\nDrove the adoption of **Linux** and **Windows** server configurations to achieve an optimized operational environment for financial applications.\nProduced and maintained documentation for enterprise monitoring processes, supporting a culture of transparency and continuous improvement in event management practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented enterprise monitoring solutions using **Datadog** and **Nagios** to ensure high availability and performance visibility across cloud infrastructures on **AWS**, **Azure**, and **GCP**.\nManaged event management processes with tools like **Splunk** and **ServiceNow**, improving incident response times by **30%** and enhancing overall service reliability.\nProficiently used **Python** and **JavaScript** for backend and frontend development, previously created robust applications facilitating integration with enterprise-level solutions and customer-facing platforms.\nDemonstrated effective communication skills in presenting technical solutions to clients, ensuring clear understanding of product offerings and services including **SaaS** applications.\nUtilized **Linux** and **Windows** environments to support operations and facilitate product demonstrations, ensuring compatibility across various enterprise systems.\nDesigned and optimized solutions that scaled to meet peak demand, achieving a **20%** increase in customer satisfaction through reliable service delivery.\nParticipated in cross-functional collaborations and utilized tools like **Jira** for project management, leading to improved team efficiency and project timelines.\nAssessed customer needs and provided customized solutions by leveraging cloud-based technologies, leading to a **15%** uptick in sales through optimized presentations and demonstrations.\nContributed to the development of training materials and resources enhancing team knowledge on enterprise monitoring and cloud infrastructure best practices, facilitating a smoother onboarding process for new hires."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS, Azure, GCP\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, enterprise monitoring, event management\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Nagios, Datadog, Splunk, cloud infrastructure\n\n **Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD, Linux, Windows, network, SaaS, ServiceNow, Jira, presentation, communication",
  "apply_company": "BigPanda"
}