{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Automation Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Automation Engineer with 13+ years of experience in developing and implementing automation solutions to enhance operational efficiency. Proficient in **PowerShell**, **Bash**, and **Python** for scripting and automation tasks, coupled with a strong understanding of **Ansible**, **Terraform**, and **DSC** for infrastructure as code. Hands-on experience with **Azure** and **Microsoft 365**, alongside expertise in **Git** for version control and **FreshService** and **ServiceNow** for service management.\nSkilled in technical documentation and presentation, ensuring clear communication of processes and solutions. Proven ability in problem solving, with a strong background in setting up cloud-native infrastructure and automation workflows. Experienced in compliance-driven development aligned with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Automation Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **PowerShell** and **Bash** scripts to automate various workflows in the **Microsoft 365** and **Windows Server** environments, enhancing operational efficiency by **30%**.\nDeveloped and maintained automation processes using **Ansible** and **Terraform** for provisioning and managing infrastructure in **Azure**, which improved deployment times by **25%**.\nCollaborated with cross-functional teams to create comprehensive **technical documentation** for automated procedures, which improved team communication and knowledge sharing.\nLeveraged **Active Directory** to streamline user management and access controls, ensuring compliance with internal security policies.\nImplemented robust solutions for incident management using **FreshService** and **ServiceNow**, reducing average resolution time by **40%**.\nDesigned and executed automation testing frameworks, utilizing **Git** for version control, leading to improved accuracy and reliability in deployment cycles.\nActively resolved automation-related issues through effective **problem solving** techniques, contributing to enhanced system stability and performance.\n\nCommunicated automation project updates and findings to stakeholders, fostering transparent collaboration and informed decision-making."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed automation scripts using **PowerShell** and **Bash** to streamline processes and enhance operational efficiency across the organization.\nUtilized **Python** for scripting and developing automation solutions, improving deployment speed and reliability within Windows Server environments.\nManaged and maintained users and groups in **Active Directory**, ensuring secure access and compliance with Microsoft 365 services.\nWrote technical documentation to support automation workflows, facilitating easier handovers and knowledge transfer among teams.\nImplemented configuration management practices using **Ansible** and **Terraform**, automating server provisioning and reducing deployment times by **40%**.\nLeveraged **FreshService** and **ServiceNow** for incident management and automation of service requests, improving response times by **30%**.\nEngaged in continuous problem solving to troubleshoot automation issues and enhance system resilience.\nCollaborated with cross-functional teams to identify automation opportunities, enhancing communication and synergy across departments.\nVersioned automation scripts and configurations using **Git**, ensuring thorough documentation and rollback capabilities for all changes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **PowerShell** and **Bash** scripting to automate system management tasks, enhancing efficiency and reducing manual errors across Windows Server and Microsoft 365 environments.\nDeveloped and maintained automated deployment scripts using **Ansible** and **Terraform** for infrastructure provisioning in Azure, achieving consistent environment setups and streamlined configurations across **5+** environments.\nImplemented automation solutions for user account management in **Active Directory**, reducing onboarding time by **30%** and ensuring compliance with company security policies.\nCreated and executed automated backups and disaster recovery plans for servers, increasing system reliability and minimizing downtime by **20%** during incidents.\nCollaborated with cross-functional teams to produce and update technical documentation, ensuring clarity in automation processes and system changes to enhance team communication and knowledge sharing.\nLeveraged version control using **Git** to manage codebases for automation scripts, facilitating smoother collaboration and version tracking in team projects.\nUtilized **FreshService** and **ServiceNow** for incident management automation, improving response and resolution times, while effectively communicating technical issues to non-technical stakeholders.\nEngaged in problem-solving activities to identify inefficiencies in existing automation processes, driving continuous improvement initiatives to optimize workflows and system performance."
    }
  ],
  "skills": "Programming Languages:\n\tPython, PowerShell, Bash\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGit, GitHub Actions, GitLab CI/CD\n\tAnsible, Terraform, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tWindows Server, Active Directory\n\n**Other:**\n\tMicrosoft 365, FreshService, ServiceNow, problem solving, technical documentation, communication"
}