{
  "name": "Rei Taro",
  "role_name": "Senior Fullstack Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Fullstack Engineer with over 10 years of experience in developing and delivering robust applications, proficient in **C#**, **Angular**, and **T-SQL**. Skilled in designing microservices architectures and deploying applications on **Cloud Computing** platforms with a focus on IT Security. Proven expertise in creating scalable APIs and automating workflows, complemented by exceptional collaboration and communication skills. Previously contributed to critical projects for top-tier companies, showcasing a strong ability to interact with customers and stakeholders effectively.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed and maintained **Microservices** using **C#** and **Angular** for a robust full-stack application, ensuring high performance and scalability.\nLeveraged **T-SQL** for efficient database management and optimized queries that reduced data retrieval time by **25%**.\nEngineered cloud solutions with **Cloud Computing** practices on **SQL Server**, enhancing system reliability and uptime metrics by **30%**.\nApplied **Service Fabric** architecture for deploying applications, streamlining the deployment process and improving CI/CD times by up to **40%**.\nImplemented exhaustive **IT Security** protocols to secure application access, enhancing security compliance and minimizing vulnerabilities by **50%**.\nFostered strong **Customer Interaction** through effective **Collaboration** with cross-functional teams, ensuring smooth communication and a user-centric development approach.\nCreated documentation and led presentations to improve **Communication** across teams, resulting in a **20%** increase in project clarity and timelines."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Engineered robust **microservices** architecture using **C#**, **Angular**, and **T-SQL** to enhance system functionality and user interface interaction.\nUtilized **Service Fabric** for distributed application deployment, ensuring high availability and scalability across multiple environments, managing over **200** active services.\nCollaboratively designed and optimized analytical data structures in **SQL Server**, improving query performance by **40%** for customer analytics and reporting.\nImplemented comprehensive **cloud computing** strategies to migrate legacy systems to Azure, successfully enhancing system performance and reducing costs by **30%**.\nDeveloped and maintained secure application environments with a focus on **IT security**, ensuring compliance with applicable industry regulations and best practices.\nFacilitated effective **customer interaction** and **collaboration** with cross-functional teams, actively communicating feedback to optimize product features and enhance user experience.\nConducted training sessions and documentation for team members, fostering an environment of continuous improvement and knowledge sharing."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "- Enhanced trading operations through the development of scalable **Microservices** using **C#** and integration with **SQL Server** for trade execution, portfolio management, and account tracking.\n- Collaborated with cross-functional teams to ensure data delivery via **REST APIs** and **Angular** frontend, facilitating seamless user interactions with a focus on **Customer Interaction**.\n- Optimized backend process management by implementing job queuing and scheduling solutions using **RabbitMQ** and **Celery**, boosting efficiency in task execution by **30%**.\n- Established and ensured adherence to IT Security standards and regulatory frameworks, including MiFID II and GDPR, safeguarding sensitive trading data.\n- Conducted comprehensive testing utilizing **PyTest**, **tox**, and mock servers; achieved a **40%** reduction in QA cycle time, enhancing overall development efficiency.\n- Engineered real-time price feed processors using **asyncio** and **WebSockets**, successfully delivering trading data with a latency of less than **50ms** for high-frequency transactions.\n- Championed collaborative communication strategies across teams to align goals and enhance the agility of project progression, resulting in a **25%** improvement in project turnaround time."
    }
  ],
  "skills": "**Programming Languages**\n\tC#, Python (3.8+), SQL, T-SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tAngular\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Cloud Computing\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, SQL Server, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tCustomer Interaction, Collaboration, Communication, IT Security, AI/ML Tools (Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow), Kafka, PyTest, Git",
  "apply_company": "Inycom"
}