{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior AI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior AI Engineer with 8 years of experience in full-stack development utilizing **TypeScript**, **Node.js**, **Python**, and **React**. Adept in designing and implementing **REST APIs** for scalable SaaS applications, integrating advanced AI functionalities with tools like **LangChain** and **Vercel AI SDK**. Proven track record of collaborating across teams to drive innovation and enhance project outcomes.\n\nMy technical expertise extends into cloud environments, specifically **Azure** and **AWS**, ensuring robust deployments of enterprise solutions. I possess a solid foundation in microservices architecture and CI/CD automation, delivering high-performance applications with compliance to standards like HIPAA and PCI DSS. My experience includes developing machine learning pipelines and serving models in production, empowering organizations to leverage data efficiently.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and deployed scalable SaaS solutions leveraging **TypeScript**, **Node.js**, and **Python** (FastAPI), ensuring optimal performance and reliability for healthcare applications across platforms (iOS, Android).\n• Engineered REST APIs and integrated third-party services using **React** for web interfaces, maximizing user engagement and functionality.\n• Collaborated effectively with cross-functional teams to apply **LangChain** and **Vercel AI SDK** for embedding AI capabilities into applications, enhancing user experience and responsiveness.\n• Architected high-performance microservices utilizing **Docker** and **Kubernetes** (AKS/EKS) to improve application scalability, achieving fault tolerance and high availability across services.\n• Designed cloud-native data storage solutions with PostgreSQL and MongoDB, optimizing data models for **large-scale** ingestion, storage, and processing aligned with industry standards.\n• Delivered advanced data visualization components using **D3.js** and **Chart.js**, allowing for real-time KPI tracking and historical trend analysis across financial and healthcare data.\n• Established rigorous collaboration practices, driving alignment on project goals and leveraging team strengths to accelerate development cycles and ensure project success.\n• Maintained coding standards and implemented testing frameworks such as Jest and Cypress for comprehensive coverage across applications, supporting quality assurance and reliability.\n• Integrated advanced search features using **ElasticSearch** to optimize information retrieval from massive data sets, elevating user experience through enhanced search capabilities.\n• Managed deployment pipelines utilizing CI/CD tools (GitHub Actions, Azure DevOps), ensuring safe and efficient updates to production systems while minimizing downtime."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** and **Node.js** to develop robust REST APIs, enhancing communication within SaaS applications and improving overall system performance.\nLeveraged **Python** to create scalable backend solutions, integrating various finance-related functionalities while ensuring high throughput in transaction processing.\nDesigned and implemented AI features using **LangChain** and **Vercel AI SDK**, enabling advanced data processing and analysis capabilities for a variety of applications.\nCollaborated effectively with cross-functional teams, fostering cooperative relationship management and achieving project milestones ahead of schedule by **20%**.\nDeveloped dynamic web applications utilizing **React** and implemented version **18**, ensuring a user-centric design and optimizing application responsiveness.\nParticipated in the modernization of architectures using microservices, enhancing maintainability and scalability for financial transaction systems and reducing latency by **30%**.\nFostered code reviews and collaborative programming practices to ensure high-quality code delivery while mentoring junior developers in best practices for **REST APIs** and frontend frameworks.\nEmployed CI/CD practices for regular deployments, enhancing operational efficiency and ensuring smooth transitions in multiple software versions."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Engineered backend services and integrations for SaaS applications utilizing **Node.js** and **Python (FastAPI, Django)**, ensuring robust REST APIs for seamless data flow and collaboration across departments.\nDeveloped AI-driven features utilizing **TypeScript**, **LangChain**, and **Vercel AI SDK** for enhanced responsiveness and accurate data modeling within SaaS environments.\nDesigned and implemented efficient data structures for scalable applications using **MongoDB**, with a focus on real-time data processing and maintaining high availability for **MCP servers**.\nCollaborated with cross-functional teams to develop innovative user interfaces using **React**, incorporating responsive design principles to optimize user experience, focusing on accessibility and performance.\nUtilized modern frameworks and libraries to promote modular application design, achieving an average load time improvement of **30%** on key **frontend applications**.\nManaged deployment strategies through effective use of **Kubernetes** and CI/CD processes, including feature flags for controlled release of backend features.\nIncorporated feedback loop mechanisms for continuous improvement of AI models, leading to a **25%** increase in customer satisfaction through accurate and personalized interactions.\nCollaborated on the design and development of secure systems for handling user data, implementing industry-standard protocols, including role-based access control (RBAC) and OAuth 2.0, ensuring compliance with GDPR.\nFacilitated workshops and code reviews to enhance team collaboration and drive best practices in the development of scalable AI solutions."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Vercel AI SDK\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tMCP servers\n\n **Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, SaaS, collaboration ",
  "apply_company": "Hostaway"
}