{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a dedicated Senior Software Engineer with 8+ years in software development, I possess extensive expertise in delivering high-quality, efficient solutions using **.NET**, **C#**, **Java**, and **JavaScript** within diverse sectors. I have a strong understanding of **3-tier web architecture** and am adept at working with databases like **Oracle** and **MS SQL** to optimize data management. My experience is complemented by proficiency in **Azure DevOps**, **JIRA**, and version control systems such as **GIT** and **SVN**, contributing to smooth agile project management. I excel in problem-solving and communication, enabling me to effectively collaborate with cross-functional teams and stakeholders. My proficiency in software development practices ensures delivery of scalable and reliable systems aligned with modern agile methodologies.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Demonstrated expertise in **.NET** and **C#** for developing scalable, high-performance applications in a 3-tier web architecture, ensuring robust integration with healthcare data systems.\n- Utilized **JavaScript** frameworks to enhance user experience and interactivity in web applications, ensuring seamless communication with backend services.\n- Leveraged **Oracle** and **MS SQL** databases for efficient data storage, retrieval, and management, optimizing performance through indexing and query optimization.\n- Managed project workflows using **JIRA** and **Azure DevOps**, facilitating agile project methods for timely delivery of software solutions.\n- Collaborated with cross-functional teams to address complex problem-solving scenarios, ensuring the alignment of technical strategies with business objectives.\n- Championed communication among team members and stakeholders, fostering a collaborative environment focused on delivering innovative software solutions.\n- Led the development of secure, scalable microservices, integrated with cloud solutions on **Azure**, enhancing data exchange and real-time processing capabilities.\n- Implemented versioning and optimization practices, ensuring maintainability and performance of legacy and new systems.\n- Conducted code reviews and provided mentorship to junior engineers, promoting best practices in **C#**, **JavaScript**, and agile software development methodologies.\n- Ensured compliance with industry standards for data protection and software security, aligning with organizational policies and regulations."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Implemented and managed CI/CD pipelines using **Azure DevOps** and **GitHub Actions** to ensure continuous delivery and automated quality assurance for software releases.\nUtilized **JIRA** for agile project management, enhancing team collaboration and transparency in project tracking and reporting.\nDeveloped robust backend systems utilizing **.NET** framework and **C#** for enterprise-level applications, significantly improving performance and maintainability.\nApplied advanced problem-solving techniques to troubleshoot and optimize applications, resulting in a **30%** reduction in system downtime.\nDesigned and integrated scalable solutions within the **3-tier web architecture**, improving user experience and system resilience.\nCollaborated effectively with cross-functional teams, showcasing strong communication skills to deliver project objectives on time.\nContributed to the transition of legacy applications into modern microservices, ensuring compatibility with **Azure** cloud services and improving overall system architecture.\nLeveraged **SVN** and **GIT** for version control to maintain code integrity and streamline collaborative workflows within the development team.\nParticipated in daily stand-ups and sprint reviews as part of the agile methodology, fostering a culture of continuous improvement.\nEngaged in regular code reviews to uphold coding standards and enhance team knowledge sharing, leading to heightened code quality across the board."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Developed and maintained high-performance backend services using **C#** and **.NET** frameworks, focusing on enhancing logic flow and database interactions within a **3-tier web architecture**.\n- Utilized **Oracle** and **MS SQL** databases to architect and manage relational databases effectively, ensuring solution scalability and data integrity, contributing to a **40% reduction** in data retrieval times.\n- Collaborated on projects using **JavaScript** and **Agile project methods**, improving team effectiveness and delivering features on time, achieving a sprint completion rate of **95%**.\n- Engaged in effective **communication** with cross-functional teams to gather requirements and design solutions, resulting in a **30% decrease** in project misunderstandings.\n- Implemented version control using **GIT** and project tracking in **JIRA** to enhance team collaboration and transparency in code changes and project status updates.\n- Streamlined deployment processes using **Azure DevOps** for CI/CD, leading to quicker feature releases and consistent delivery of high-quality software.\n- Resolved critical issues within legacy systems by applying strong **problem-solving** skills, significantly enhancing the overall performance and user experience.\n- Designed user-centric applications leveraging modern frameworks, ensuring compatibility across multiple devices and enhancing customer satisfaction metrics by **25%**.\n- Participated in team retrospectives and contributed to process improvements, fostering a culture of continuous improvement and technical excellence within the software development lifecycle."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Java, JavaScript, Python, \n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, \n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs, \n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services), \n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Oracle, MS SQL, Redis \n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, GIT, SVN, JIRA \n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), \n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, 3-tier web architecture, agile project methods, problem-solving, communication",
  "apply_company": "Körber Supply Chain Madrid, S.L.U."
}