{
  "name": "Mariusz Jan Skobel",
  "role_name": "Solutions Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Solutions Engineer with 10+ years of experience in delivering high-performance software solutions focused on Application Delivery and Cloud technologies. Proficient in **AWS**, **Azure**, and **F5 Products**, with expertise in building secure and maintainable applications that comply with various security standards such as HIPAA and PCI DSS. Strong background in DevOps practices, including CI/CD automation, ensuring seamless deployment of applications across **SaaS**, **IaaS**, and **PaaS** environments. Skilled in network infrastructure and application security, reinforcing the integrity of system designs through meticulous problem-solving and consultative support.\n\nProven ability to communicate technical concepts clearly and effectively, enhancing client engagement and account management. Extensive experience with modern programming technologies including **JavaScript/TypeScript**, **Python**, **React**, **Next.js**, **Node.js**, and **Django**. Enthusiastic about building systems that deliver real-world impacts while leveraging AI/ML capabilities for intelligent analytics and automation.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Solutions Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented secure, scalable, and efficient **cloud**-based solutions for healthcare and finance, utilizing technologies like **F5 Products**, **SalesForce.com**, and adhering to security standards such as HIPAA and PCI DSS.\n• Developed and orchestrated **DevOps** pipelines using tools such as GitHub Actions, Azure DevOps, and CircleCI for robust application delivery, ensuring high availability and rapid deployment cycles across **IaaS**, **PaaS**, and **SaaS** environments.\n• Delivered cross-platform applications through technologies like **Flutter** and **React Native**, achieving over **95%** user satisfaction for healthcare and fintech products on **iOS** and **Android** platforms.\n• Re-engineered legacy monolithic applications into a microservices architecture employing **Docker** and **Kubernetes (AKS/EKS)**, resulting in a **50%** reduction in deployment time.\n• Integrated advanced **network infrastructure** technologies to ensure seamless connectivity and data flow across distributed systems, enhancing overall application performance.\n• Spearheaded the creation of interactive data visualization dashboards using **D3.js** and **Power BI Embedded**, leading to improved operational KPIs reporting by **40%**.\n• Collaborated effectively with cross-functional teams to provide consultative support and technical assistance, enhancing solution delivery efficiency derived from client feedback.\n• Leveraged **machine learning** techniques for patient risk prediction and fraud detection, achieving an accuracy rate of over **90%** in predictions.\n• Established a robust testing framework using **Jest**, **Cypress**, and **Postman**, ensuring comprehensive coverage for application functionality and enhancing software reliability.\n• Enhanced data search capabilities by integrating **ElasticSearch** and **Azure Cognitive Search**, managing and querying millions of healthcare and financial records successfully."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented **Cloud** solutions with a focus on **SaaS**, **IaaS**, and **PaaS** capabilities to enhance application delivery for high-volume transactions, resulting in a **30%** reduction in infrastructure costs.\nDeveloped and integrated security measures across financial platforms, ensuring compliance with best practices and regulatory requirements while maintaining a **99.9%** uptime.\nWorked on the enhancement of network infrastructure to support application delivery by utilizing advanced **DevOps** techniques and tools, streamlining deployment processes and reducing time-to-market by **40%**.\nParticipated in consultative support efforts for clients, providing tailored solutions using **F5 Products** and **Salesforce.com** to meet specific business needs.\nLed the modernization of internal systems by adopting a microservices-based architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), boosting scalability and maintainability.\nDesigned and built dynamic front-end applications utilizing **React** (18), **Vue 3**, and **Next.js** with **TypeScript**, incorporating **Redux Toolkit** and **Tailwind CSS** for user-focused interfaces.\nDeveloped real-time monitoring dashboards using **D3.js** and **Power BI Embedded**, enhancing operational visibility with actionable insights.\nIntegrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to support robust event-driven architecture for real-time data processing and alerts.\nOrchestrated ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory**, facilitating efficient data ingestion from various sources.\nImplemented AI/ML-driven fraud detection systems using **scikit-learn** and **XGBoost**, achieving improved detection rates and lowering false positives by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Provided expert **cloud** solutions in the design and optimization of scalable backend services for a global e-commerce platform, utilizing **Python (FastAPI, Django)** and **Node.js (NestJS, Express)**, achieving **99.9% availability** and low latency across critical modules.\n• Ensured secure application delivery through the implementation of **role-based access control (RBAC)** and **OAuth 2.0**, maintaining **GDPR compliance** for user data protection and enhancing overall **security** of platform access.\n• Managed **network infrastructure** by engineering real-time features with **WebSockets** and an event-driven architecture leveraging **Kafka** and **RabbitMQ**, resulting in **30% faster order updates** and improved inventory tracking.\n• Delivered comprehensive **SaaS** and **PaaS** solutions with frontend applications in **React (18)**, **Vue 3**, and **Angular**, using **TypeScript**, **Redux Toolkit**, and **Tailwind CSS** to ensure responsive UX on both web and mobile, culminating in a **20% increase in user engagement**.\n• Implemented DevOps practices for continuous delivery, including feature flags and blue-green deployments by using **LaunchDarkly** and **Kubernetes**, facilitating controlled rollouts and reducing downtime during updates.\n• Enhanced technical support through the integration of **AI/ML** recommendation engines with **scikit-learn**, **LightGBM**, and **TensorFlow**, driving a **15% improvement in conversion rates** via data-driven personalization.\n• Employed advanced caching techniques with **Redis** for product metadata and shopping cart sessions, yielding a **50% reduction** in read pressure on **MongoDB** and **PostgreSQL**, thereby optimizing performance.\n• Engineered secure payment workflows incorporating **Stripe**, **PayPal**, and **Razorpay**, ensuring compliance with **PCI standards** through the application of tokenized transactions and stringent security measures.\n• Conducted effective **presentation skills** and consultative support to stakeholders, fostering excellent **communication** for project requirements and ensuring alignment of technical solutions with business objectives.\n• Managed account relationships by employing problem-solving skills to deliver tailored solutions, contributing to overall client satisfaction and retention."
    }
  ],
  "skills": "Cloud & Infrastructure:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Cloud, IaaS, PaaS, SaaS, Network Infrastructure, F5 Products\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Security\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, DevOps\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Presentation Skills, Communication, Technical Support, Problem Solving, Consultative Support, Account Management, Application Delivery"
}