{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Security Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As a highly skilled Security Engineer with 8 years of full-stack development experience, I bring a deep expertise in **AWS**, **JavaScript**, **TypeScript**, **Python**, and **Bash** to enhance security protocols across applications. My proficiency in Security Assessment Tools (SAST, SCA) ensures that I implement best practices in software security, while my understanding of compliance standards such as **ISO 27001** and **ISO 27002** positions me well for roles requiring adherence to stringent security measures. \nI have successfully led teams in integrating security into the development lifecycle, enhancing secure coding practices, and conducting thorough third-party assessment processes.\nEquipped with strong English communication skills, I can effectively articulate security requirements and collaborate within diverse teams. My past experience as a developer in the healthcare and financial sectors allows me to bridge the gap between development and security, ensuring high-performance, compliant solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Security Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed robust security solutions for scalable, full-stack healthcare and financial platforms utilizing **AWS** while ensuring compliance with industry standards (e.g., ISO 27001, ISO 27002).\nImplemented security assessments as part of third-party assessment processes, enhancing overall project security with practices grounded in **JavaScript**, **TypeScript**, and **Python**.\nUtilized **Bash** scripts to automate security testing and reporting, effectively identifying vulnerabilities and reducing potential security risks by **30%**.\nConducted static application security testing (SAST) and software composition analysis (SCA) to ensure adherence to secure coding practices across all projects.\nCollaborated closely with development teams to enforce security best practices in CI/CD pipelines using **AWS** technologies, facilitating seamless integration of security measures into existing workflows.\nStrengthened application security through implementing and integrating security tools that supported real-time monitoring and incident response, achieving **99%** uptime across platforms.\nEstablished clear English communication channels with stakeholders to discuss security requirements, remediation plans, and compliance documentation, resulting in improved team collaboration.\nMaintained detailed documentation of security policies and procedures aligned with ISO standards to ensure comprehensive compliance and readiness for audits.\nEducated team members on security protocols and provided guidance on secure software development lifecycle (SDLC) practices, ultimately fostering a culture of security awareness across all levels of the organization."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented security best practices within cloud environments utilizing **AWS**, ensuring compliance with **ISO 27001** and **ISO 27002** standards to protect sensitive financial data.\nConducted static and dynamic application security testing (SAST) and software composition analysis (SCA) to identify vulnerabilities in applications written in **JavaScript**, **TypeScript**, and **Python**.\nDeveloped comprehensive security assessment processes for third-party applications to mitigate risks associated with external integrations.\nCollaborated with cross-functional teams to enhance secure coding practices and establish guidelines for secure software development life cycle (SDLC) based on industry standards.\nUtilized **Bash** scripting for automation of security tasks, improving operational efficiency by reducing manual interventions by up to **70%**.\nEngaged in continuous communication with stakeholders to ensure clarity on security requirements and to promote a culture of security awareness within the organization, effectively utilizing **English communication** skills.\nRegularly reported on security metrics and progress to senior management, providing insights that supported strategic decision-making and risk management initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Ensured compliance with **ISO 27001** and **ISO 27002** standards by implementing robust security measures, policies, and protocols across various cloud services like **AWS**.\nDeveloped and maintained secure application infrastructures using **Python** and **Bash** scripts, streamlining the process of security audits and assessments with **SAST** and **SCA** tools.\nConducted third-party assessment processes to evaluate the security posture of vendors and partners, ensuring adherence to security requirements and protocols.\nCommunicated effectively in **English** with stakeholders to address security concerns, compliance issues, and the implementation of security strategies.\nUtilized **JavaScript** and **TypeScript** for implementing security features in web applications, ensuring secure coding practices are followed throughout the development lifecycle.\nCreated detailed security documentation and reporting, enhancing awareness and understanding of security measures among development teams.\nCollaborated with cross-functional teams to embed security practices into the software development lifecycle, facilitating a culture of security awareness.\nTrained development staff on security best practices and secure coding guidelines, reducing vulnerabilities and enhancing overall application security."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, Bash\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, SAST, SCA, ISO 27001, ISO 27002, Third Party assessment processes, English communication"
}