{
  "name": "Patryk Zaslawski",
  "role_name": "Salesforce Business Solution Architect",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a seasoned **Salesforce Business Solution Architect** with over 8 years in software engineering, I excel in implementing **Salesforce Sales Cloud** and **Salesforce Service Cloud** solutions, focusing on data architecture and integration strategies. My expertise includes crafting efficient data solutions with a strong emphasis on **data quality, security**, and **governance**. I utilize agile project management methodologies to lead teams effectively and ensure successful project delivery. My background in Python and modern frameworks enhances my analytical and problem-solving skills, allowing me to develop robust third-party integrations and streamline processes. I pride myself on strong communication and collaboration abilities, fostering teamwork and mentoring others while adapting to the evolving needs of the business.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Salesforce Business Solution Architect",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and implemented **data integration strategies** for Salesforce applications, ensuring seamless data flow between **Salesforce Sales Cloud**, **Salesforce Service Cloud**, and other systems within the enterprise.\nArchitected secure **data architecture** practices that align with industry standards, enhancing **data quality** and **data governance** across platforms.\nLed cross-functional collaboration, driving **third-party integrations** that improved overall solution efficiency by 30% within a 6-month period.\nFacilitated agile project management, ensuring timely project delivery and adaptability to evolving business requirements.\nMentored junior team members in **Salesforce** best practices, fostering a knowledge-sharing environment that promoted collaboration skills and improved team performance.\nUtilized analytical skills to troubleshoot complex problems in Salesforce implementations, resulting in a 20% reduction in problem resolution times.\nConducted regular training sessions to enhance team proficiency in data security compliance and best practices, ensuring adherence to regulatory requirements.\nCommunicated effectively with stakeholders to gather requirements and provide updates, ensuring all team members were aligned with project goals.\nDesigned and implemented automated quality checks in Salesforce workflows, contributing to a 15% improvement in overall data integrity.\nChampioned data security strategies to protect sensitive information during integration processes, ensuring compliance with industry regulations."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and implemented **Salesforce** solutions leveraging **Salesforce Sales Cloud** and **Salesforce Service Cloud** to streamline data integration strategies, enhancing operational efficiency by **30%**.\n• Led agile project management initiatives to foster collaboration and communication across multi-disciplinary teams, improving project delivery timelines by **25%**.\n• Crafted data architecture frameworks ensuring high data quality and security, compliant with governance standards, resulting in a **40%** reduction in data-related issues.\n• Spearheaded third-party integrations with **Salesforce**, facilitating seamless data exchange and optimizing workflows, thus enhancing user experience.\n• Mentored junior team members on data governance best practices and developed training modules that improved team adaptability and project knowledge transfer.\n• Utilized analytical skills to assess data trends and provided actionable insights to stakeholders, driving informed decision-making processes.\n• Fostered a collaborative environment by implementing regular team meetings and ensuring transparency in project status, improving overall team morale and engagement.\n• Adapted quickly to changing project requirements and effectively solved complex problems, maintaining agile delivery in high-pressure situations.\n• Contributed to the optimization of **Salesforce** configurations, ensuring alignment with business needs while meeting regulatory compliance.\n• Established data security protocols for **Salesforce** applications, thereby ensuring adherence to industry regulations and protecting sensitive information."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Salesforce** and **Salesforce Sales Cloud** to design and implement data integration strategies, ensuring seamless data flow between systems and enhancing operational efficiency.\nDeveloped a robust data architecture leveraging **Salesforce Service Cloud**, enabling agile project management and improving data quality throughout the organization.\nImplemented third-party integrations with **Salesforce** tools, enhancing functionality and streamlining business processes for a user base of over **5,000** active users.\nConducted regular data governance assessments to ensure compliance with data security standards, achieving a **30%** reduction in data-related incidents.\nCollaborated with cross-functional teams to translate business requirements into technical specifications, utilizing strong communication and collaboration skills to foster effective teamwork.\nMentored junior team members, promoting knowledge sharing and adaptability within the team to meet evolving project demands.\nExecuted data analysis initiatives using analytical skills to inform decision-making, resulting in a **15%** increase in operational efficiency.\nLed problem-solving workshops to address complex challenges in Salesforce implementations, achieving resolution timelines shorter by **25%**.\nDeveloped documentation for data processes and integration workflows, enhancing data quality and ensuring consistent practices across teams.\nFacilitated agile project management methodologies to streamline workflows and enhance team productivity, delivering projects that met deadlines **100%** of the time."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython (FastAPI, Django, Flask) \n\n **Backend Frameworks:** \n\tSpring Boot \n\n **Frontend Frameworks:** \n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor \n\n **API Technologies:** \n\tREST & gRPC APIs \n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL) \n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD \n\n **Cloud & Infrastructure:** \n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot \n\n **Other:** \n\tSalesforce, Salesforce Sales Cloud, Salesforce Service Cloud, data integration strategies, data architecture, third-party integrations, agile project management, data quality, data security, data governance, analytical skills, problem-solving, communication skills, collaboration skills, mentoring, adaptability"
}