{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience in delivering high-performance web applications. Proficient in **React**, **TypeScript**, **Next.js**, and **Tailwind**, with a strong command of creating seamless user experiences. Well-versed in building and consuming **RESTful APIs** and **GraphQL**, ensuring robust data interaction and organization.\nDemonstrated expertise in testing frameworks such as **Jest** and **React Testing Library**, coupled with experience in end-to-end testing using **Playwright**. Skilled in implementing CI/CD practices to optimize development workflows and enhance code quality.\nAdditionally, I bring experience in compliance-driven development within the healthcare and financial sectors, understanding regulations such as HIPAA and PCI DSS. A strong foundation in **AI/ML** technologies and cloud services like **AWS** and **Azure** complements my capabilities, enabling the development of innovative solutions aligned with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React (17-18)** and **TypeScript** to architect and develop dynamic user interfaces, ensuring accessibility compliance throughout the application lifecycle.\nImplemented **Next.js** for server-side rendering and optimized performance, enhancing user experience and load times by **30%**.\nDesigned RESTful APIs and integrated **GraphQL** for efficient data management, enabling seamless communication between frontend and backend services.\nExecuted comprehensive unit and integration testing using **Jest** and **React Testing Library**, boosting code coverage to **95%** and improving overall application reliability.\nEstablished CI/CD workflows leveraging tools such as GitHub Actions and CircleCI, leading to a **40%** reduction in deployment time and enhanced release management.\nCollaborated with cross-functional teams to develop solutions that meet business requirements while ensuring adherence to web standards and accessibility best practices.\nProduced responsive designs utilizing **Tailwind**, ensuring mobile-first approaches and making applications compatible across diverse devices and browsers.\nMonitored and refined application performance, implementing measures that achieved a **25%** increase in loading speed and reduced server response times.\nParticipated in code reviews and provided mentorship to junior developers, fostering a culture of collaboration and continuous improvement within the team.\nLeveraged CMS integrations for dynamic content delivery, enhancing user engagement and content accessibility on platforms."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed user-centric web applications using **React** (18), **Next.js**, and **TypeScript**, ensuring exceptional performance and responsiveness tailored for financial tools and admin panels.\nImplemented CI/CD processes to streamline deployments and improve code quality, utilizing tools compatible with **React Testing Library** and **Jest** for comprehensive testing coverage over **95%**.\nEnhanced accessibility across applications by adhering to WCAG standards, ensuring a seamless experience for all users, including those with disabilities.\nCollaborated with cross-functional teams to integrate **RESTful APIs** and **GraphQL**, improving data retrieval efficiency by up to **30%**.\nUtilized **Tailwind CSS** to construct visually appealing and flexible designs that adapt to varying screen sizes, achieving mobile-first responsiveness.\nLeveraged **Playwright** for end-to-end testing, guaranteeing functionality and stability across different browsers and platforms before production releases.\nAdopted best practices for version control and documentation, ensuring maintainability and clarity in all **CMS** related updates and features.\nChampioned the development of reusable UI components, reducing development time for new features by approximately **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed high-performing frontend applications using **React (18)**, **Next.js**, and **TypeScript**, ensuring robust architecture and seamless user experiences.\nUtilized **Tailwind CSS** for styling, enhancing UI components for speed and responsiveness across web and mobile platforms.\nImplemented testing strategies using **Jest** and **React Testing Library**, achieving **95% code coverage** and improving overall code quality and reliability.\nIntegrated **GraphQL** and **RESTful APIs** for efficient data management and retrieval, resulting in **30% faster load times** for dynamic content.\nDesigned and enforced best practices for **Accessibility (WCAG 2.1)** compliance, ensuring the application is usable for all users, including those with disabilities.\nConducted A/B testing with **Playwright** to evaluate UI changes, using real-time feedback to optimize user engagement and drive conversion rates by **15%**.\nEngaged in **CI/CD** pipelines to automate deployment processes, reducing the time to market for new features and enhancements by **40%**.\nCollaborated with cross-functional teams to drive the overall vision of the content management system (**CMS**), enhancing user productivity and operational efficiency."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, Tailwind\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tRESTful APIs, GraphQL\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Terraform, Ansible, Helm, Docker Compose, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Jest, React Testing Library, Playwright, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, CI/CD, Accessibility, CMS",
  "apply_company": "Marketer.com"
}