{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Backend Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Backend Developer with 8 years of experience, proficient in **Python**, **REST**, **GraphQL**, **Docker**, and **SQL**. I have a strong foundation in developing robust backend systems using technologies such as **Java**, **C/C++**, and **MySQL**, and I am well-versed in asynchronous programming and caching techniques. My experience includes building high-performance applications within the healthcare and financial sectors, ensuring compliance with industry standards like HIPAA and PCI DSS.\nIn addition to my technical skills, I possess a solid understanding of coding principles and container-orchestration systems, further enhancing system reliability and scalability. I also excel in team collaboration and communication, contributing to seamless project delivery.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** to develop robust backend services, ensuring adherence to coding principles and best practices while enhancing performance and maintainability.\nDesigned and implemented **REST** and **GraphQL** APIs to provide seamless data access and integration, facilitating asynchronous programming and efficient communication between frontend and backend components.\nWorked with **Docker** to create containerized applications, optimizing deployment across various environments and enhancing the scalability of backend services.\nMaintained and managed databases with **SQL**, including **MySQL**, ensuring efficient data retrieval and storage, while implementing caching strategies to improve application performance.\nParticipated in the development and deployment of microservices using container-orchestration systems, enhancing application resiliency and achieving higher availability.\nCollaborated with cross-functional teams to translate business requirements into technical specifications, delivering features and solutions on time, using **HTML5** for creating user-friendly interfaces.\nConducted code reviews and mentored junior developers, promoting knowledge sharing and adherence to best coding practices while ensuring high-quality code delivery.\nEngaged in continuous learning and improvement efforts to stay current with industry trends, evolving languages and tools, including **English** communication skills for effective collaboration with international teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained scalable backend services using **Python** and **REST** APIs, ensuring high performance and reliability for financial platforms.\n• Implemented **SQL** database solutions with **MySQL**, optimizing queries to enhance data retrieval and storage efficiency by **30%**.\n• Utilized **Docker** for containerization of applications, facilitating smooth development and deployment processes across multi-environment setups.\n• Employed asynchronous programming techniques to improve system responsiveness and throughput, achieving up to **50%** reduction in request latency.\n• Applied coding principles to create clean, maintainable, and efficient codebases, resulting in faster onboarding and easier collaboration within development teams.\n• Leveraged **HTML5** and **Java** to build secure, dynamic web applications, enhancing user experiences based on stakeholder feedback.\n• Integrated caching mechanisms to optimize data access speeds, thereby improving application performance and reducing resource consumption by **40%**.\n• Actively utilized container-orchestration systems to manage application scalability effectively and automate deployment processes.\n• Communicated effectively in **English** to collaborate with cross-functional teams, providing technical insights and recommendations."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and optimized backend services using **Python** (Django) and **SQL** (MySQL), ensuring robust data management and adherence to coding principles to support **REST** APIs and **GraphQL** endpoints.\n• Utilized **Docker** for containerization of applications, enhancing deployment consistency and environment management across **container-orchestration systems** like Kubernetes.\n• Designed efficient caching strategies to improve application performance, applying **Redis** caching for high-traffic workflows, which reduced response times by up to **50%**.\n• Engaged in asynchronous programming to manage concurrent processes efficiently, leading to a **30%** improvement in request handling times.\n• Created data storage solutions using **MongoDB** and **PostgreSQL**, ensuring high availability and scalability for dynamic data workloads across **e-commerce** functionalities.\n• Integrated third-party payment processing systems, ensuring PCI compliance and secure transaction handling with proven technologies like **Stripe** and **PayPal**.\n• Collaborated with cross-functional teams to implement features using **Java** and **C/C++** when necessary, aligning closely with existing enterprise solutions.\n• Wrote and maintained clear, concise documentation of code and workflows in English, facilitating collaboration and knowledge sharing among team members.\n• Employed effective debugging and testing techniques to ensure reliability and security, leading to a **40%** reduction in production incidents."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, C/C++, JavaScript, TypeScript, HTML5\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST, GraphQL\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tcontainer-orchestration systems\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, asynchronous programming, caching, coding principles, English"
}