{
  "name": "Rei Taro",
  "role_name": "Senior Software Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Software Engineer with over 10 years of backend development experience, specializing in high-performance APIs and event-based applications. Proficient in **PHP**, **MySQL**, **Postgres**, **Kafka**, **RabbitMQ**, and adept at implementing clean code and robust object-oriented programming principles. Skilled in source code management using **Git** and familiar with **NIX command line**. Recognized for delivering scalable services and automation tools that support financial platforms and AI/ML pipelines. Demonstrated ability to thrive in a feedback culture and effectively collaborate within teams. Fluent in **English** and **German**, with a proven record at leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "- Developed robust backend solutions in **PHP** and **MySQL** to support scalable applications and efficient data retrieval.\n- Implemented APIs for seamless integration with front-end systems, enhancing user experience by 30%.\n- Engineered event-driven applications utilizing **Kafka** and **RabbitMQ** to optimize processing workflows, reducing latency by 25%.\n- Adhered to object-oriented programming principles and **clean code** practices, improving code maintainability with a **30%** reduction in technical debt.\n- Employed **Git** for source code management, ensuring smooth collaboration and version control across the development team.\n- Provided technical guidance and leveraged teamwork skills to coordinate effectively with peers, fostering a feedback culture that increased project efficiency by **15%**.\n- Utilized **NIX command line** tools for automating deployment tasks, enhancing operational workflows.\n- Communicated fluently in **English** and **German** to facilitate collaboration with international teams, ensuring project alignment.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Designed and developed robust backend systems utilizing **PHP** and **MySQL** to enhance document workflows and optimize user onboarding processes.\nEngineered event-driven applications employing **Kafka** and **RabbitMQ** for asynchronous processing of critical data transactions, improving response times by **30%**.\nImplemented clean and efficient **APIs** for seamless data exchange, ensuring adherence to object-oriented programming principles.\nManaged version control and source code management using **Git**, contributing to a **20%** reduction in deployment errors through better code collaboration practices.\nExecuted effective teamwork strategies and maintained a feedback culture within the development team, leading to successful project completions with an increased delivery rate of **15%**.\nConducted comprehensive testing and code reviews to uphold software quality standards, fostering a production-ready environment for agile releases.\nUtilized the **NIX command line** for efficient system operations, enhancing automation and deployment processes across various platforms.\nDemonstrated proficiency in both English and German to facilitate communication with international teams and stakeholders."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed robust backend services for trade execution, portfolio management, and account tracking utilizing **Python**, **Flask**, and **PostgreSQL**, enhancing trading operations.\n• Engineered real-time price feed processors with **asyncio**, **WebSockets**, and **Redis** to deliver up-to-the-minute trading data for high-frequency transactions.\n• Collaborated closely with frontend teams to integrate data through REST APIs and WebSocket channels, ensuring a seamless user experience with the platform.\n• Implemented regulatory compliance practices, adhering to requirements such as MiFID II and GDPR, while maintaining strict internal data security protocols.\n• Developed comprehensive test suites utilizing **PyTest**, **tox**, and mock servers to streamline QA and CI processes, ensuring efficient development cycles.\n• Introduced job queuing and scheduling solutions using **Celery** and **RabbitMQ**, optimizing backend task execution and process management efficiencies.\n• Utilized **Git** for source code management and clean code practices, promoting a feedback culture within the team, enhancing teamwork and personal development.\n• Engaged with event-based applications to improve the trading platform's responsiveness and scalability, demonstrating expertise in backend development."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, PHP\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tReact\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices, APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, RabbitMQ, backend development, object-oriented programming, event-based applications, clean code, source code management, Git, NIX command line, teamwork, feedback culture, English, German",
  "apply_company": "ChargePoint"
}