{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Field Engineer with 8 years of expertise, I possess strong proficiency in **C/C++**, **Python**, and **Java** development, with a focus on **Embedded** systems and **AUTOSAR** architecture. My experience encompasses **In-Vehicle Networking** and **OSI** protocols, enabling seamless communication in complex automotive environments. I am well-versed in real-time threading and networking concepts, including **UDP**, **Multicast**, and **VLAN** technologies, ensuring robust data handling in automotive applications.\n\nI have a solid background in **cloud-native** solutions, virtualization, and **Web Services**, which enable me to design scalable and efficient systems. In previous roles, I've successfully integrated **Hypervisors** and **Containers** for optimized system performance, while leveraging advanced tools for embedded system development. Additionally, I champion customer service and effective communication, ensuring stakeholder alignment and satisfaction throughout project lifecycles.\n\nFurthermore, I carry significant experience in full-stack development, utilizing **JavaScript**, **TypeScript**, **Flutter**, and frameworks such as **React**, **Next.js**, and **Vue**. My capabilities extend into **CI/CD** automation and deploying **microservices** architectures, enhancing the overall efficiency and security of applications. I am committed to delivering high-quality solutions that meet compliance standards and drive innovation within the automotive sector.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained cloud-native applications using **Python** and **.NET**, ensuring compliance with regulatory standards.\n- Architected communication protocols for imaging and diagnostic data transmission leveraging **UDP**, **Multicast**, and **DDS**, improving data integrity in vehicular systems.\n- Designed in-vehicle networking solutions utilizing **AUTOSAR** framework and **OSI** model principles, enhancing system interoperability and performance.\n- Implemented **Embedded** systems for real-time data processing in automotive applications, increasing efficiency by **30%**.\n- Collaborated on advanced applications in **AD/ADAS** and **Infotainment** systems, creating smarter user experiences in vehicles.\n- Led the integration of **Hypervisors** for virtualization solutions, enhancing resource management and fault isolation for multiple applications on a single hardware platform.\n- Utilized **Threading** techniques to optimize multi-threaded applications, reducing latency by **20%** in critical software components.\n- Established enterprise-level **Web Services** to facilitate communication between distributed systems and in-vehicle applications, achieving **99%** uptime.\n- Provided exceptional customer service and technical support, resolving complex issues related to **Cloud-Native** architecture and **Containers** in automotive systems.\n- Conducted presentations and training sessions for clients on new technologies and systems, improving adoption rates significantly.\n- Evaluated communication systems, implementing **VLAN** configurations for improved performance and segmentation of in-vehicle networks.\n- Drove the development of proactive support tools, improving customer satisfaction scores by **25%** through efficient communication and problem resolution."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized strong programming skills in **Python** to develop and maintain **cloud-native** applications for various in-vehicle and infotainment systems, enhancing performance and efficiency.\nImplemented **C/C++** for developing embedded applications under **AUTOSAR**, ensuring high reliability and compliance with industry standards for **AD/ADAS** systems.\nCollaborated on **in-vehicle networking** projects utilizing technologies such as **UDP**, **Multicast**, and **OSI**, leading to a **30%** increase in data transmission efficiency across multiple vehicle systems.\nDesigned and executed communication protocols in **SOME/IP** to improve interoperability within the embedded environment, achieving a **25%** reduction in response time for infotainment features.\nLeveraged **threading** and **virtualization** techniques to optimize the performance of applications running on **hypervisors**, ensuring smooth multitasking in resource-constrained environments.\nEngaged in **customer service** initiatives, providing technical support and training for system integrators on the use of **embedded** solutions and enhancing customer satisfaction ratings by **15%**.\nApplied expertise in **web services** to build APIs for real-time data sharing between vehicle systems and cloud platforms, supporting future advancements in connected vehicle technologies.\nOptimized data handling processes by implementing **containers** for application deployment, improving scalability and reducing operational costs by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized embedded systems utilizing **C/C++** and **Python** for in-vehicle applications, ensuring seamless communication across protocols such as **UDP** and **Multicast**.\nEngineered robust real-time features for **In-Vehicle Networking** leveraging **DDS** and **SOME/IP**, providing efficient data exchange for **AD/ADAS** functionalities across **9** vehicle modules.\nImplemented efficient threading and process management to enhance OS functionality, leading to an **80%** improvement in response time for critical components in various systems.\nDeveloped multi-layered communication architectures improving latency by **30%** using **OSI** model principles, thus ensuring reliable vehicle-to-infrastructure connectivity.\nIntegrated **AUTOSAR** compliant components, facilitating modular software design and promoting scalability within the vehicle environment.\nLed initiatives for **Cloud-Native** application support, facilitating scalable communication between embedded systems and cloud infrastructure for data-heavy applications like infotainment.\nExecuted advanced virtualization techniques using **Hypervisors** to enhance system reliability and reduce hardware costs by **25%**.\nApplied container orchestration strategies to improve deployment processes for systems, achieving a **50%** reduction in rollout times for software updates.\nEnhanced user experience by ensuring secure data communication and implemented role-based access control (RBAC) throughout embedded systems to safeguard customer data.\nCollaborated with cross-functional teams to deliver customer service excellence, providing real-time support and education on system capabilities and troubleshooting for **9** automotive clients."
    }
  ],
  "skills": "**Programming Languages:**\n\tC/C++, Python, Java, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tWeb Services, UDP, Multicast, DDS, SOME/IP\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCloud-Native, Virtualization, Hypervisors\n\n**Other:**\n\tAuthentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), AI & ML (MLflow, Airflow, Kubeflow), Customer Service, Communication, Presentation, Threading, In-Vehicle Networking, OS, VLAN, Embedded, AD/ADAS, Infotainment",
  "apply_company": "Real-Time Innovations (RTI)"
}