{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Analytics Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-oriented Analytics Engineer with 13+ years of experience, specializing in on-chain data analysis and data transformation. Proficient in **SQL**, **dbt**, and **SQLMesh**, driving efficient data engineering concepts and query optimization. Adept in blockchain technologies and smart contracts, ensuring robust data integrity and security.\nSkilled in deploying cloud-native systems on **AWS** and **Azure**, and experienced in building scalable applications with **JavaScript/TypeScript**, **Python**, and frameworks such as **React**, **Next.js**, and **Node.js**. Proven ability to deliver high-performance applications in both healthcare and financial industries.\nStrong background in AI/ML-powered platforms, implementing predictive analytics, automation, and real-time processing, alongside compliance-driven development in alignment with regulations such as HIPAA, FHIR, PCI DSS, and SOC 2 standards. Excels in community collaboration and integrates seamless data pipelines to enhance overall operational efficiency.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Analytics Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Performed on-chain data analysis to derive actionable insights from blockchain transactions, ensuring optimal performance through query optimization and effective data transformation.\nEngineered and optimized SQL databases, leveraging **PostgreSQL** for data integrity, and **SQL** for data manipulation, ensuring efficient data retrieval and storage in compliance with industry standards.\nDesigned and maintained robust ETL processes using **dbt** and **SQLMesh** to automate data transformations, guaranteeing accurate pipeline workflows and timely data availability.\nCollaborated within community-focused projects, enhancing data accessibility and fostering knowledge sharing for more effective blockchain analytics among stakeholders.\nDrafted and deployed smart contracts, facilitating automated transactions and ensuring transparency within blockchain ecosystems, while conducting thorough testing for security and functionality.\nUtilized advanced data engineering concepts to build scalable data solutions, enabling comprehensive reporting and analytics on blockchain metrics and performance indicators.\nIntegrated innovative data visualization tools, delivering user-friendly dashboards that present complex data insights effectively for stakeholders and decision-makers.\nWork with cross-functional teams to align on data-driven strategies, implementing feedback loops to enhance product features based on community collaboration and real-time analytics.\nConducted training sessions to share expertise in blockchain knowledge and analytics techniques, empowering team members for better data utilization and project contributions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Performed on-chain data analysis by developing and optimizing **SQL** queries for high-performance data retrieval in financial systems, ensuring quick access to critical data for analytics.\nImplemented data transformation processes using **dbt** and **SQLMesh** to create a streamlined and maintainable data pipeline for efficient reporting and analysis.\nCollaborated with cross-functional teams to enhance smart contract performance and integrate blockchain knowledge into data solutions, fostering community collaboration for innovative project developments.\nOptimized query performance for complex datasets, significantly reducing processing time by **30%** through the application of advanced data engineering concepts and techniques.\nLeveraged my understanding of blockchain data to assist in data governance initiatives, ensuring high-quality analysis and compliance with industry standards.\nApplied best practices in data engineering and transformation to support real-time analytics for fraud detection and transaction monitoring."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Performed **on-chain data analysis** to extract insights and trends from blockchain datasets, enhancing data-driven decision making.\nUtilized **SQL** for effective data querying and reporting, ensuring high performance through **query optimization** techniques on diverse datasets.\nImplemented data transformation processes using **dbt** and **SQLMesh**, improving data quality and accessibility for analytical purposes.\nCollaborated with cross-functional teams to develop and maintain **smart contracts**, ensuring they met business requirements and compliance standards.\nDemonstrated expertise in **data engineering concepts** to optimize data pipelines, enabling seamless data flow from sources to analytical tools.\nEngaged in **community collaboration**, facilitating knowledge sharing and best practices among team members, contributing to a cohesive working environment.\nLeveraged analytical tools to design and implement reporting solutions that drive insights and support business strategies effectively.\nSupported data governance initiatives to maintain data integrity and compliance with industry regulations, including GDPR guidelines.\nProactively identified opportunities for process improvements in data handling and reporting, leading to a 30% reduction in data retrieval times."
    }
  ],
  "skills": " **Programming Languages:**\n\tSQL\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\t\n\n **Frontend Frameworks:**\n\t\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n **Cloud & Infrastructure:**\n\t\n\n **Other:**\n\ton-chain data analysis\n\tdata transformation\n\tdbt\n\tSQLMesh\n\tsmart contracts\n\tblockchain knowledge\n\tquery optimization\n\tdata engineering concepts\n\tcommunity collaboration\n\tMLflow\n\tAirflow\n\tKubeflow\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\tNginx\n\tLet’s Encrypt\n\tCertbot"
}