{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I possess deep expertise in **.NET**, **C#**, **ASP.NET**, **Razor**, **SQL**, and RESTful APIs, enabling the development of scalable, high-performance web applications. Proficient in modern web technologies such as **JavaScript**, **HTML**, **CSS**, and XML, I excel in creating responsive and user-friendly interfaces that enhance the user experience. My strong acquisition of Agile methodologies ensures efficient team collaboration, while my problem-solving skills drive innovative solutions to complex challenges.\n\nI bring a comprehensive background in full-stack development, leveraging frameworks like **React** and **Next.js**, and am acquainted with **GraphQL** for efficient data retrieval. My previous roles included mentoring junior developers and fostering collaboration within cross-functional teams. I also have substantial experience with compliance and security standards, having implemented applications under guidelines such as HIPAA and PCI DSS. My ability to integrate technologies and work with diverse tech stacks positions me as a valuable asset for any team.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **.NET** and **C#** to architect and develop scalable, full-stack healthcare and financial platforms ensuring robust performance and maintainability.\nImplemented backend services using **SQL**, **ASP.NET**, and **REST**ful APIs, integrating with modern front-end frameworks to deliver responsive and user-centric applications.\nEngaged in Agile methodologies to continuously improve coding practices, prioritizing teamwork and collaboration to foster a productive development environment.\nDeveloped and maintained complex database systems using **SQL** and optimized queries for efficient data retrieval and management.\nDesigned and implemented MVC architecture, utilizing **Razor**, **HTML**, **XML**, **JavaScript**, and **CSS** to enhance application interactivity and user experience.\nLed initiatives to mentor junior developers, enhancing team capability in problem-solving and technical skill development.\nCollaborated effectively with cross-functional teams to gather requirements and deliver tailored solutions, improving project delivery timelines by **20%**.\nEstablished test strategies using testing frameworks, ensuring high code quality through unit and integration testing.\nSpearheaded integration of **GraphQL** APIs to enable flexible and efficient data querying, resulting in a **30%** improvement in application responsiveness.\nExecuted project deployments with an emphasis on continuous integration and delivery practices, contributing to an overall **15%** reduction in deployment-related issues."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Collaborated in an Agile environment to design and develop robust web applications using **ASP.NET**, **C#**, and **SQL**, enhancing user experiences and operational efficiency.\n• Implemented REST and GraphQL APIs to facilitate seamless data access across platforms, contributing to a 30% reduction in response time for critical financial services.\n• Leveraged MVC architecture principles to structure code effectively, improving maintainability and scalability of financial applications by **40%**.\n• Developed dynamic and responsive web interfaces using **HTML**, **CSS**, and **JavaScript**, ensuring accessibility and adherence to modern web standards across **9** financial products.\n• Mentored junior developers in best coding practices and software design, increasing team productivity by **25%** and fostering a culture of continuous learning and improvement.\n• Utilized problem-solving skills to troubleshoot and optimize existing codebases, leading to a **15%** increase in application performance and reliability.\n• Actively contributed to cross-functional collaboration efforts, resulting in improved project outcomes and enhanced stakeholder satisfaction scores by **10%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services using **ASP.NET** and **C#** to ensure high availability and scalability in a robust e-commerce platform environment.\nDeveloped RESTful APIs and integrated **GraphQL** for seamless data retrieval, enhancing overall system performance.\nCollaborated in an **Agile** environment, leading a team of developers while mentoring junior engineers in best practices and code optimization strategies.\nEngineered responsive and intuitive user interfaces using **HTML5**, **CSS**, **JavaScript**, along with **Razor**, ensuring accessibility and cross-browser compatibility.\nImplemented SQL for efficient data management and query optimization, leading to a **30%** improvement in application response time.\nAdopted MVC architecture in application development, improving code maintainability and project organization.\nUtilized XML for data exchange and configuration management, facilitating easier updates and modifications.\nApplied problem-solving skills to debug complex issues, resulting in a **25%** reduction in critical bugs and system downtime.\nMaintained clear and thorough documentation to promote collaboration among team members and stakeholders while adhering to industry standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, C#, SQL\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET, ASP.NET, Razor\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS, JavaScript\n\n **API Technologies:**\n\tREST, GraphQL\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, JWT, OAuth2, Keycloak, Let’s Encrypt, Nginx, Certbot, Agile, Problem-Solving, Mentoring, Collaboration",
  "apply_company": "StarRez, Inc."
}