{
  "name": "Rei Taro",
  "role_name": "Senior DevOps Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-oriented Senior DevOps Engineer with over 10 years of experience in leveraging **AzureDevOps** for continuous integration and deployment, and expertise in managing **Pipelines**, **Artifacts**, **Boards**, and **TestPlans**. Proficient in utilizing **Fortify**, **Snyk**, and **Venafi** for security and compliance within development processes. Experienced with **DataLake** management and implementation to facilitate data-driven decision-making and collaboration across teams. A proven track record of optimizing backend systems in financial platforms, and overseeing **cloud-native architectures** on **AWS** and **Azure**. Excels in designing high-performing APIs and automation tools with technologies like **Python** (**FastAPI**, **Django**, **Flask**), delivering scalable services that meet strategic business objectives for top-tier organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented **Azure DevOps Pipelines** to automate build and deployment processes, increasing deployment efficiency by **30%**.\nManaged **Azure DevOps Repos** to streamline code collaboration among teams, improving version control and reducing integration issues by **25%**.\nUtilized **Azure Boards** for agile project management, ensuring task prioritization and visibility, achieving a **15%** reduction in project delivery time.\nIntegrated **Fortify** and **Snyk** for continuous security assessment of applications, enhancing security compliance and vulnerability management.\nCollaborated in cross-functional teams to execute **Azure Artifacts** strategies, improving package management and availability across projects.\nLeveraged **Data Lake** solutions for efficient data storage and retrieval, optimizing data processing capabilities to handle incremental growth.\nFacilitated team collaboration through **Test Plans**, ensuring robust testing methodologies and quality assurance across the development lifecycle.\nMonitored and reported on infrastructure performance, achieving a **20%** decrease in system downtimes through proactive management."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Azure DevOps** to design and implement CI/CD **pipelines**, enhancing deployment efficiency by **30%**.\nCreated and managed **artifacts** within **Azure DevOps**, ensuring smooth version control and automated releases across all project stages.\nLeveraged **Azure Boards** for project management and tracking progress, leading to a **25%** improvement in team collaboration and task visibility.\nImplemented **Test Plans** in **Azure DevOps** to systematically validate software releases, reducing defect rates by **20%**.\nUtilized **Azure Repos** for version control, maintaining code integrity and historical changes for over **50** projects.\nConducted security assessments with tools like **Fortify**, **Snyk**, and **Venafi** to ensure robust application security and compliance with industry regulations.\nDesigned and maintained **Data Lake** architectures to support data analytics needs and foster data-driven decision-making across the organization.\nEngaged in cross-functional **collaboration** to streamline workflows, enhancing the ability to scale and deploy applications quickly and reliably."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **AzureDevOps** to manage project workflows through **Pipelines**, ensuring seamless CI/CD processes while supervising **Boards** for task tracking and progress monitoring.\nImplemented comprehensive testing strategies using **TestPlans** and integrated security measures like **Fortify** and **Snyk** into development life cycles to achieve a 95% reduction in vulnerabilities.\nOversaw version control with **Repos**, maintaining code integrity and fostering collaboration among team members in a high-stakes environment.\nDesigned and maintained extensive data storage solutions leveraging **DataLake** to support scalable data analytics and business intelligence initiatives.\nExecuted successful project management strategies to deliver features within a 2-week sprint cycle through agile methodologies while continuously optimizing workflows.\nFacilitated a 30% improvement in team communication and task tracking efficiency by implementing systemized documentation and regular stand-up meetings.\nCollaborated and delivered high-quality development environments that met regulatory compliance and internal security protocols, aligning with best practices in the industry, resulting in a 100% audit pass rate."
    }
  ],
  "skills": "Programming Languages:\n\t**Python (3.8+), SQL, Bash, JavaScript**\n\nBackend Frameworks:\n\t**FastAPI, Flask, Django, Celery**\n\nAPI Technologies:\n\t**REST/gRPC APIs, Microservices**\n\nServerless and Cloud Functions:\n\t**AWS (EC2, S3, Lambda), Azure**\n\nDatabases:\n\t**PostgreSQL, MySQL, MongoDB, Redis**\n\nDevOps:\n\t**Docker, Kubernetes, GitHub Actions, Azure DevOps, Fortify, Snyk, Venafi**\n\nCloud & Infrastructure:\n\t**DataLake, Collaboration**\n\nOther:\n\t**CI/CD, PyTest, Git, Pipelines, Artifacts, Boards, TestPlans, Repos, Kafka, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow**",
  "apply_company": "Globant"
}