{
  "name": "Tomasz Lee",
  "role_name": "Senior Field Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Field Engineer with 9+ years of experience in delivering exceptional customer support and technical training in complex engineering environments. Proficient in problem solving and documentation, ensuring clarity and efficiency in project execution. Demonstrated ability to collaborate effectively across multidisciplinary teams, utilizing strong communication skills to convey complex technical concepts. Proven background in engineering principles and fluid physics, complemented by knowledge of chemistry. Committed to enhancing operational workflows and optimizing project outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Provided **technical training** to team members on using **digital printing** technologies, enhancing overall technical knowledge and skills across the team.\nFacilitated **collaboration** between engineering and support teams to ensure seamless communication and effective problem-solving during project executions.\nExecuted detailed **documentation** practices for customer-facing platforms, ensuring all technical aspects are well-covered and easy to understand.\nDeveloped comprehensive **customer support** systems, leveraging digital tools to streamline service requests and improve response times.\nApplied **engineering** knowledge in **fluid physics** and **chemistry** to solve complex problems related to the design and operation of digital printing systems.\nConducted **problem-solving** workshops to identify and address customer issues effectively, resulting in a **30%** decrease in complaints.\nEngaged in cross-department meetings to strengthen **communication** channels and foster a culture of collaboration among teams.\nUtilized **data analysis** tools to refine operational workflows, leading to improved customer interactions and satisfaction scores by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Provided **technical training** to clients on digital printing technologies, ensuring smooth adoption and effective use of the systems.\n• Delivered exceptional **customer support** by troubleshooting complex issues, utilizing **problem-solving** skills to resolve client concerns regarding digital printing processes.\n• Collaborated with cross-functional teams to enhance system performance and streamline workflows, leading to a **15% increase** in efficiency across projects.\n• Conducted thorough **documentation** of system configurations and **engineering** specifications, contributing to improved maintenance and knowledge transfer.\n• Applied principles of **fluid physics** and **chemistry** in the development of innovative materials used in digital printing, increasing product reliability.\n• Actively engaged in **collaboration** with stakeholders to define product features and enhancements based on user feedback, fostering effective communication throughout the project lifecycle.\n• Led problem-solving workshops with teams, equipping engineers with strategies to tackle complex production challenges effectively.\n• Developed comprehensive training materials and user guides, enhancing customer understanding and support for product features.\n• Coordinated on-site installations and provided hands-on support for system upgrades, maintaining a high level of **customer satisfaction**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and maintained technical documentation for internal systems, enhancing knowledge transfer among teams while ensuring clarity in engineering specifications.\n• Collaborated effectively with cross-functional teams to solve technical challenges, utilizing strong problem-solving skills to improve system performance.\n• Provided expert-level customer support, troubleshooting issues that arose during system operation, improving customer satisfaction ratings by 15%.\n• Conducted technical training sessions to educate staff on the use of the CRM system and its associated technologies, improving user proficiency by **25%**.\n• Actively participated in collaborative projects to implement new features, combining **Vue.js** with backend services that improved system efficiency by **30%**.\n• Improved communication channels between internal stakeholders and the DevOps team to facilitate smoother project progression.\n• Applied knowledge of **fluid physics** and **chemistry** to improve product development processes and address complex engineering challenges.\n• Leveraged engineering principles in the design and development of systems, ensuring adherence to industry standards and best practices.\n• Utilized **.NET Framework**, **Angular**, and **SQL Server** to create scalable solutions, enhancing application performance by **20%**."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython,\n\tJavaScript,\n\tTypeScript,\n\tC#,\n\tSolidity\n\n  **Backend Frameworks**\n\tNodeJS,\n\tExpressJS,\n\tNestJS,\n\t.NET,\n\tEntity Framework,\n\tMicroservices\n\n  **Frontend Frameworks**\n\tReactJS,\n\tNextJS,\n\tVueJS,\n\tNuxtJS,\n\tAngular,\n\tMaterial UI,\n\tThree.js,\n\tD3.js,\n\tReact Native,\n\tFlutter,\n\tChakra UI,\n\tTailwindCSS\n\n  **API Technologies**\n\tRESTful API,\n\tGraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS,\n\tAzure\n\n  **Databases**\n\tMSSQL Server,\n\tMySQL,\n\tPostgreSQL,\n\tMongoDB,\n\tDynamoDB,\n\tCosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tCloud Services\n\n  **Other**\n\tUX/UI Design,\n\tGit,\n\tGitHub,\n\tTesting Tools: NUnit,\n\txUnit,\n\tSelenium,\n\tMoq,\n\tPostman,\n\tCypress,\n\tJMeter,\n\tJest,\n\tApache Kafka,\n\tRabbitMQ,\n\tRedis,\n\tProblem Solving,\n\tCollaboration,\n\tCommunication,\n\tTechnical Training,\n\tDocumentation,\n\tEngineering,\n\tFluid Physics,\n\tChemistry,\n\tDigital Printing,\n\tCustomer Support",
  "apply_company": "FUJIFILM Dimatix, Inc."
}