{
  "name": "Tomasz Lee",
  "role_name": "Senior Research Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Research Engineer with 9+ years of experience in technical project management and cross-functional collaboration. Proficient in implementing effective **Large Language Models (LLMs)** strategies, **information retrieval systems**, and **NLP (Natural Language Processing)** techniques. Hands-on expertise in **LLM fine-tuning**, **LLM hosting and inference optimization**, and **prompt engineering**. Demonstrated ability to drive AI research innovation and manage research documentation. Exceptional at prototyping and data manipulation, combined with strong communication skills and adaptability. Previous success in delivering complex applications as a **.NET Full Stack Developer**, specializing in **microservices architecture** and **distributed systems**, and skilled in **ReactJS**, **NextJS**, **.NET**, **C#**, and cloud services, optimizing performance and streamlining development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Research Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Led the development and optimization of **LLM hosting and inference optimization** strategies, resulting in increased efficiency by **30%**.\nDesigned and implemented innovative **information retrieval systems** leveraging **NLP (Natural Language Processing)** techniques to enhance data access speed and accuracy.\nConducted **LLM fine-tuning** to improve model performance, directly contributing to a **20%** increase in user satisfaction.\nUtilized **agent orchestration frameworks** to streamline workflows across various teams, ensuring smooth project execution.\nCollaborated with cross-functional teams to foster **clear communication** and enhance project outcomes through shared insights and innovation.\nManaged technical aspects and timelines of multiple projects using effective **technical project management** practices, completing deliverables on schedule by **95%**.\nEngaged in **data manipulation** and **prompt engineering** to develop prototypes for cutting-edge solutions, showcasing adaptability and speed to market.\nDocumented research processes and outcomes thoroughly, maintaining comprehensive **research documentation** for internal review and external stakeholders.\nFacilitated collaborative brainstorming sessions to drive **research innovation**, generating new ideas and exploring unexplored avenues in AI.\nUtilized advanced **data visualization** libraries like **D3.js** for presenting complex data insights to non-technical stakeholders."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Led the implementation of **LLM fine-tuning** strategies and refined **data manipulation** methods, resulting in a 20% improvement in model accuracy for information retrieval systems.\nDeveloped and optimized **agent orchestration frameworks**, enhancing the efficiency of AI-driven tasks and reducing response time by **30%**.\nIntegrated cutting-edge **NLP (Natural Language Processing)** techniques to streamline information retrieval, boosting information accessibility and relevance.\nConducted **AI research** initiatives leading to innovative project prototypes, contributing to a **15%** increase in project innovation outcomes.\nManaged cross-functional collaboration among teams to define system requirements, ensuring alignment on project goals and timely delivery.\nCommunicated complex technical concepts clearly to stakeholders, facilitating informed decision-making and effective project management.\nDesigned and documented research findings to support ongoing AI innovation initiatives, ensuring comprehensive knowledge sharing across teams.\nFostered adaptability within the development process by prototyping new features and methodologies, thereby encouraging continuous improvement.\nMentored junior engineers on **LLM hosting** and inference optimization techniques, enhancing team skill sets and performance.\nConducted regular collaboration sessions to discuss research progress and align on strategic goals, ensuring active participation from all team members."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **NLP (Natural Language Processing)** techniques to enhance the performance of information retrieval systems, resulting in a **25%** increase in query accuracy.\nLed the fine-tuning of **Large Language Models (LLMs)**, improving response time by **15%** in a production environment.\nManaged the deployment and hosting of LLMs, optimizing inference processes with solutions that cut downtime by **10%**.\nDesigned and implemented innovative **agent orchestration frameworks** that streamlined workflows among AI systems and data manipulation tools.\nCollaborated cross-functionally to integrate AI solutions into existing platforms, enhancing team productivity by **30%**.\nConducted research innovation initiatives focused on emerging AI technologies and their practical applications in current projects.\nFacilitated prototype development to rapidly iterate on AI solutions, improving the prototyping cycle time by **20%**.\nProvided clear communication and documentation regarding model performance and project advancement to stakeholders.\nParticipated in regular technical project management activities, ensuring alignment with overall strategic goals and deliverables.\nAdapted to evolving project requirements while maintaining a strong emphasis on research documentation for knowledge transfer."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tGit, GitHub\n\n**Other**\n\tFrontend Technologies, Messaging & Caching, Testing Tools, UX/UI Design, Large Language Models (LLMs), Information retrieval systems, LLM fine-tuning, LLM hosting and inference optimization, Prompt engineering, Agent orchestration frameworks, Data manipulation, NLP (Natural Language Processing), AI research, Research innovation, Technical project management, Cross-functional collaboration, Clear communication, Adaptability, Prototyping, Research documentation"
}