{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Experienced Senior Engineer with a robust skill set in **Fusion**, **Solidworks**, **AutoCAD**, and **Bluebeam Revu**, specializing in cost analysis and 3D modeling to deliver efficient and innovative engineering solutions. With 8 years of expertise in the healthcare and financial sectors, I have successfully integrated project management methodologies to efficiently collaborate across multidisciplinary teams and deliver high-performance platforms. My technical proficiency includes **Python**, **React**, **Node.js**, and experience with cloud services like **AWS** and **Azure**. I possess strong communication skills, enabling me to align cross-functional efforts while ensuring compliance with industry standards. My ability to manage projects from conception through execution has led to the development of scalable solutions that meet client requirements and exceed expectations.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted detailed **cost analysis** for project budgets and resource allocation, ensuring financial efficiency and optimized project delivery.\n- Developed intricate **3D modeling** designs using **Solidworks** and **Fusion**, achieving a **20% increase** in design accuracy and reducing time-to-market by **15%**.\n- Executed precise **metalworking** and **machining** tasks, adhering to tight tolerances and specifications for quality assurance.\n- Created comprehensive technical documentation using **AutoCAD** and **Bluebeam Revu**, facilitating clear communication among project stakeholders and enhancing collaboration.\n- Collaborated with cross-functional teams to streamline workflow processes, improving project management efficiency and fostering collaboration.\n- Managed project timelines and deliverables, ensuring all milestones were met according to schedule with regular updates through **MS Word** and **Excel** reports.\n- Leveraged strong communication skills to present project updates and technical details to diverse audiences, enhancing stakeholder engagement.\n- Orchestrated team meetings and collaborative sessions, driving effective communication practices and teamwork across departments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted detailed cost analysis on engineering projects, leveraging Excel to develop financial models that ensured project feasibility and profitability.\nUtilized **Fusion 360** and **SolidWorks** to create 3D models and simulations, enhancing the design process and reducing time-to-market for prototypes by **30%**.\nImplemented and managed project plans using **AutoCAD** and **Bluebeam Revu**, ensuring adherence to timelines and budget constraints across various engineering initiatives.\nFacilitated cross-functional collaboration through effective communication strategies, resulting in a **15%** improvement in team delivery times and project outcomes.\nLed project management efforts by employing Agile methodologies, which increased operational efficiency and team output by **20%**.\nPerformed advanced machining and metalworking processes to create high-quality components, adhering to industry standards and improving product reliability.\nMaintained meticulous documentation in **MS Word** and shared updates through collaborative platforms to keep stakeholders informed and engaged throughout project lifecycles.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Conducted **cost analysis** for project budgets, ensuring optimal allocation of resources and cost-efficiency across the engineering process.\n- Utilized **3D modeling** tools like **Fusion 360** and **Solidworks** to create intricate designs and prototypes, leading to a **20% reduction** in the prototyping phase.\n- Engaged in **metalworking** and **machining** to fabricate high-precision parts, maintaining quality standards that comply with industry codes.\n- Produced detailed technical documentation and reports using **MS Word** and **Excel** to streamline project management and facilitate effective communication among team members.\n- Employed **AutoCAD** and **Bluebeam Revu** for creating and reviewing engineering drawings, ensuring adherence to project specifications and high-quality deliverables.\n- Implemented **project management** techniques to oversee the lifecycle of engineering projects, generating timelines that achieved a **15% improvement** in project delivery time.\n- Fostered **collaboration** across cross-functional teams to ensure successful integration of engineering processes with manufacturing workflows.\n- Maintained clear **communication** with stakeholders to provide updates on project progress and address any potential obstacles proactively."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, cost analysis, 3D modeling, metalworking, machining, Fusion, Solidworks, AutoCAD, Bluebeam Revu, MS Word, Excel, project management, communication, collaboration",
  "apply_company": "Not specified"
}