{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience delivering robust ERP solutions, leveraging expertise in **Odoo**, **PostgreSQL**, **Python**, **Git**, **Docker**, and **CI/CD** methodologies. Adept at creating sustainable architectures while ensuring clean code practices through rigorous code reviews. Proven capability in developing AI-driven functionalities, enhancing application intelligence and automation. Highly skilled in the healthcare and financial sectors, focusing on compliance-driven development with a strong grasp of standards such as HIPAA and PCI DSS. Demonstrated proficiency in microservices and event-driven architectures, complemented by a solid foundation in MLOps, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow** for streamlined model training and orchestration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained an **ERP** system using **Odoo**, ensuring seamless integration and enhanced user experience.  \n• Leveraged **Python** for backend functionalities, implementing clean coding practices and sustainable architecture to improve maintainability and scalability.  \n• Designed and optimized databases using **PostgreSQL** to support high-volume transactions, achieving performance improvements of up to **60%**.  \n• Implemented **CI/CD** pipelines using **Docker** and **Git** for streamlined deployment processes, decreasing deployment times by **40%**.  \n• Conducted thorough **code reviews** to ensure adherence to best practices and maintainability, resulting in a **30%** reduction in technical debt.  \n• Collaborated with cross-functional teams to integrate AI solutions, enhancing system capabilities and user engagement through intelligent workflows.  \n• Created sustainable architectures by migrating legacy systems to cleaner, microservices-based solutions, improving system robustness and scalability.  \n• Developed and executed testing strategies to ensure effective development cycles and reduce bugs in production by **25%**, using tools like Jest and PyTest."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed and implemented sustainable architecture practices using **Python** and **PostgreSQL**, enhancing the efficiency of ERP solutions via the **Odoo** platform.\nConducted thorough code reviews ensuring adherence to clean code principles, improving code quality and maintainability across projects.\nLeveraged containerization tools like **Docker** and CI/CD methodologies to streamline deployment processes, achieving a **30%** reduction in release times.\nCollaborated with cross-functional teams to integrate AI functionalities into applications, enhancing decision-making capabilities and operational efficiency.\nDesigned and maintained robust database architectures in **PostgreSQL**, optimizing query performance to handle over **1 million** records efficiently.\nUtilized version control with **Git**, ensuring effective management of codebases and facilitating seamless team collaboration.\nEstablished best practices for software development lifecycle, contributing to enhanced team performance and successful project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** to develop and maintain various ERP modules within **Odoo**, enhancing functionality and performance while applying **CI/CD** pipelines for efficient deployment processes.\nDesigned and implemented sustainable architecture practices to ensure high maintainability and scalability of the codebase, adhering to **Clean Code** principles and conducting thorough **Code Reviews**.\nManaged database solutions using **PostgreSQL**, ensuring exceptional data integrity and performance under high-load conditions by optimizing queries and database structures.\nWorked collaboratively with cross-functional teams to integrate **AI** functionalities within the ERP system, delivering innovative solutions that improved decision-making and efficiency.\nLeveraged **Docker** for containerization of applications, simplifying the deployment process across various environments and ensuring consistency of software delivery.\nImplemented version control and team collaboration strategies using **Git**, maintaining a clean project history and facilitating team-based development efficiently.\nAutomated deployment processes using tools and practices that align with modern **CI/CD** strategies, significantly reducing deployment times by **30%**.\nDeveloped comprehensive documentation and best practices for ERP functionalities and workflows, ensuring clarity and ease of use for internal team members.\nEmphasized the adoption of an established **OCA** (Odoo Community Association) development frameworks to drive enhancements and community collaboration."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython,\n\n **Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango,\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript: React,\n\tVue,\n\tAngular,\n\n **API Technologies:**\n\tOAuth2,\n\tJWT,\n\tKeycloak (OIDC, RBAC),\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS,\n\tLambda,\n\tRDS,\n\tS3,\n\tAzure: App Services,\n\tBlob Storage,\n\tSQL Database,\n\n **Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\n **DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose,\n\n **Cloud & Infrastructure:**\n\tCI/CD,\n\n **Other:**\n\tOdoo,\n\tERP,\n\tAI,\n\tOCA,\n\tCode Review,\n\tClean Code,\n\tSustainable Architecture",
  "apply_company": "AlphaPet Ventures GmbH"
}