{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior iOS Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior iOS Engineer with 13+ years of experience, specializing in building high-performance applications in the healthcare and financial sectors. Skilled in **Swift** and **SwiftUI**, with a strong background in **Python** and leveraging AI/ML for innovative solutions. Proven expertise in implementing A/B testing strategies and optimizing ads systems for international commerce.\nAdept at infrastructure development, conducting thorough code reviews, and creating comprehensive documentation. Recognized for problem-solving abilities, a growth mindset, and collaboration in team settings. Experienced in delivering compliance-driven solutions aligned with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed mobile applications for iOS using **Swift** and **SwiftUI**, ensuring a seamless user experience and adherence to best practices in design and functionality.\n• Collaborated with cross-functional teams to establish robust A/B testing strategies to optimize app performance and user engagement, contributing to a **20%** increase in user retention rates.\n• Conducted thorough code reviews, enhancing code quality and fostering a culture of continuous improvement within the team, which resulted in a **30%** reduction in bug reports.\n• Designed and documented technical specifications for app features, improving project efficiency and clarity for all stakeholders involved.\n• Leveraged **Python** for backend integration, supporting features and functionalities in the iOS app environment.\n• Utilized problem-solving skills to address complex issues during app development phases, leading to quicker resolutions and smoother project timelines.\n• Drove team collaboration through regular agile meetings and sprint planning sessions, enhancing productivity and alignment across the team.\n• Provided clear documentation for all project phases, ensuring knowledge sharing and onboarding efficiency for new team members.\n• Contributed to the growth mindset within the team by advocating continuous learning opportunities and sharing industry innovations and best practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Swift** and **SwiftUI** to develop and maintain high-performance iOS applications, ensuring seamless user experience and adherence to best practices.\nConducted thorough **code reviews** to promote high-quality code standards and facilitate team collaboration, enhancing productivity by **30%**.\nImplemented **A/B testing** for feature releases, utilizing analytical tools to drive decision-making and optimize user engagement, resulting in an overall **15%** increase in user retention.\nCreated comprehensive technical **documentation** to support ongoing development and maintenance efforts, improving team understanding and decreasing onboarding time by **25%**.\nLeveraged **Python** for backend integrations and collaborated with cross-functional teams to streamline workflows and resolve challenges, showcasing strong **problem-solving** abilities.\nFostered a **growth mindset** within the team, encouraging continuous learning and adaptation to new technologies, driving innovation in **infrastructure** for financial applications.\nParticipated in discussions about **international commerce** systems, contributing insights that enhanced the overall product strategy and align it with market needs.\nActively contributed to team collaboration initiatives, embarking on feedback loops and project retrospectives to achieve collective goals while maintaining a **team-oriented** culture."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Swift** and **SwiftUI** to design and optimize native iOS applications, ensuring optimal performance and user experience across features like international commerce and ads systems.\nConducted comprehensive **code reviews** to maintain high-quality standards in **Python** back-end integrations and collaborated effectively within cross-functional teams.\nImplemented A/B testing frameworks to evaluate user interactions, leading to improved interface and functionality decisions across **version 1.3** of the application and increasing user retention by **25%**.\nCreated detailed and user-friendly documentation to support application development and facilitate seamless **team collaboration** within the development team.\nAddressed complex problem-solving challenges in application design, leveraging a **growth mindset** to innovate and iterate on features based on user feedback.\nDeveloped infrastructures ensuring high availability and scalability for **international commerce** platforms, significantly improving performance in peak traffic scenarios by up to **40%**.\nOptimized application efficiency using advanced features of **Swift** and **SwiftUI**, contributing to a more robust user interface and enhancing overall app performance.\nImplemented strategies for monitoring and debugging to uphold a high standard of reliability and function within the iOS environment."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Swift\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular, SwiftUI\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **Other:**\n\tA/B testing, ads systems, infrastructure, international commerce, code reviews, documentation, problem solving, growth mindset, team collaboration",
  "apply_company": "Whatnot"
}