{
  "name": "Mariusz Jan Skobel",
  "role_name": "Treasury Systems Architect/Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Treasury Systems Architect/Engineer with 10+ years of experience specializing in **Cloud systems** and **troubleshooting** for high-performance software solutions in healthcare and finance. Proficient in **monitoring**, **configuration management**, and incident & escalation handling to ensure seamless treasury operations and payment processes. Demonstrated ability to manage complex **data flows** and implement efficient systems administration practices while maintaining a strong attention to detail.\n\nSkilled in deploying applications on **Azure** and **AWS**, bringing a strong technical background in various frameworks and languages, including **JavaScript/TypeScript**, **Python**, and **Flutter**, with proficiency in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building enterprise platforms with robust **AI/ML capabilities** for automated real-time analytics and decision-making. Strong microservices architecture understanding with hands-on expertise in CI/CD automation, ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2.\n\nAdept at knowledge sharing and mentoring junior team members, driven by a passion for developing technically sound solutions that make a real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Treasury Systems Architect/Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented **cloud systems** to optimize treasury operations and payments processes, ensuring high availability and reliability.\n• Managed **incident handling** and **escalation handling** processes, monitoring systems for performance and troubleshooting issues proactively.\n• Utilized **configuration management** tools to maintain seamless operation of treasury applications while ensuring consistency across environments.\n• Developed efficient **data flows** for financial transactions, ensuring accuracy and integrity across multiple systems.\n• Collaborated with cross-functional teams to enhance **communication skills**, engaging in knowledge sharing and mentoring to uplift team capabilities.\n• Conducted thorough assessments of existing systems, leveraging **attention to detail** to identify areas for improvement and implement effective solutions.\n• Problem-solved complex issues in treasury operations using a methodical approach, taking on challenging configurations and setups.\n• Established robust monitoring systems for treasury applications, driving proactive troubleshooting strategies to minimize downtime and disruptions.\n• Delivered exceptional user experiences by integrating user-friendly interfaces in treasury applications, focusing on optimization and performance.\n• Leveraged analytical tools for enhanced visualization of treasury data, ensuring stakeholders have access to real-time insights and decision-making capabilities."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **ION Wallstreet Suite** to enhance treasury operations, ensuring seamless integration with legacy systems and improving payment processes by **25%**.\nLed systems administration efforts, implementing effective troubleshooting and configuration management protocols to reduce incident resolution time by **30%**.\nConducted meticulous monitoring of data flows and system performance, achieving a **99.9%** uptime across all treasury applications and services.\nFacilitated knowledge sharing and mentoring sessions within the team, improving communication skills and fostering a collaborative environment focused on problem-solving.\nDesigned and implemented cloud systems for scalable and reliable treasury solutions, leveraging **Azure** and **AWS** technologies to support high-volume transaction processing.\nStreamlined incident and escalation handling procedures, reducing average incident response time by **40%** through improved documentation and communication.\nDeveloped standardized protocols for configuration management, enhancing system reliability and simplifying audits for compliance.\nEngaged in proactive maintenance and troubleshooting efforts, identifying potential issues before they impact business operations, thus ensuring operational continuity."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Engineered and implemented **Cloud systems** for optimized **Treasury operations** handling payments processes, ensuring high levels of data flows and system reliability.\nFacilitated **incident handling** and **escalation handling** processes, effectively managing unforeseen issues to minimize downtime and ensure smooth operation of treasury systems.\nAdministered technical **systems administration** tasks, including troubleshooting and configuration management of treasury applications, achieving a **98%** resolution rate for system incidents.\nMonitored system performance and data integrity using advanced monitoring tools, leading to a **30%** reduction in response times across the treasury operations.\nConducted detailed **problem-solving** sessions, collaborating with cross-functional teams to identify potential bottlenecks in payment systems, which enhanced transaction processing efficiency by **25%**.\nMentored junior staff in **knowledge sharing** practices, fostering a collaborative environment and enhancing skills related to treasury systems and incident management.\nDemonstrated strong **communication skills** by presenting complex system workflows and strategies to stakeholders, ensuring clear understanding and alignment across teams.\nExercised meticulous **attention to detail** in system documentation and audits, which improved compliance and regulatory adherence in payment processes.\nImplemented various risk mitigation strategies and optimization solutions within treasury workflows to enhance operational efficiency and security.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Monitoring, Configuration management\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Cloud systems\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Incident handling, Escalation handling, Systems administration, Troubleshooting, Treasury operations, Payments processes, Data flows, Communication skills, Attention to detail, Problem-solving, Knowledge sharing, Mentoring"
}