{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Sales Engineer with over 10 years of expertise in designing and delivering robust backend systems tailored for financial platforms and AI/ML pipelines. Proficient in leveraging **AWS** and **Azure** for cloud-native solutions, with a deep understanding of cloud networking, IAM, security tools, and data redundancy strategies. Skilled in problem-solving and solution design, I have a strong track record of developing high-performing APIs, automation tools, and scalable services using technologies including **Python** (**FastAPI**, **Django**, **Flask**). My experience includes impactful contributions at esteemed organizations like VISA, Sii Poland, and Reply Polska, underscoring my capability to meet complex customer needs and exceed expectations.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Focused on cloud infrastructure and security solutions to enhance sales engineering efforts:\n- Engineered cloud networking solutions on **AWS** and **Azure**, ensuring high availability and performance across all deployments.\n- Designed and implemented identity and access management (IAM) strategies for secure cloud solutions, utilizing **Azure AD B2C** and establishing internal security protocols.\n- Conducted comprehensive security assessments leveraging various **security tools** to identify vulnerabilities and implement robust defenses.\n- Developed disaster recovery (DR) strategies and backup solutions, ensuring 99.9% uptime for mission-critical applications.\n- Utilized problem-solving skills to deliver tailored cloud solution designs, adapting to client needs and scaling them effectively for users up to **1000**.\n- Collaborated with cross-functional teams to ensure compliance with industry regulations, while also engaging in the proactive design of system integrations.\n- Maintained documentation for best practices and implementation strategies, contributing to the knowledge base shared within the organization for improved operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Leveraged **Azure** for cloud networking, ensuring seamless integration and deployment of scalable backend systems in Python and **FastAPI** to automate document workflows and streamline user onboarding.\n• Utilized **AWS** for storage solutions and security tool implementation, enhancing organizational data management and security protocols.\n• Developed and maintained event-driven microservices using **Celery** and **Redis**, enabling **asynchronous processing** of financial data and transaction requests, improving transaction efficiency by **30%**.\n• Managed deployment processes on **Azure App Services**, applying **Terraform** for infrastructure automation, resulting in a **25%** reduction in deployment times.\n• Engineered secure data pipelines for regulatory data exchange with **Apache Airflow** and **Azure Functions**, improving data flow efficiency by **40%**.\n• Conducted regular security audits to ensure compliance with industry standards, integrating **OAuth2** and **Azure AD B2C** for robust authentication, protecting sensitive data and access controls.\n• Collaborated with cross-functional teams, enhancing problem-solving strategies and solution design to ensure smooth system integration and successful release management."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Demonstrated expertise in **AWS** and **Azure** to architect cloud solutions that seamlessly integrate with backend services, enhancing scalability and performance.\nUtilized **Linux** and **Windows** environments to deploy and manage applications, ensuring robust performance and optimal resource utilization.\nImplemented cloud networking solutions to facilitate secure and high-performance connectivity for data access and communication.\nMaintained high levels of security through IAM and advanced security tools, safeguarding sensitive data while enabling efficient user management.\nEngineered solutions for disaster recovery (**DR**) and data backup strategies, ensuring business continuity and data integrity within critical operations.\nApplied problem-solving skills to design and implement resilient systems, contributing to a 25% increase in operational efficiency through improved service delivery.\nAchieved cloud certifications that enhance credibility and demonstrate advanced competencies in cloud technology and best practices.\nCollaborated with cross-functional teams to design compelling solutions tailored to client needs, leading to a 15% increase in client satisfaction ratings.\n"
    }
  ],
  "skills": "**Cloud & Infrastructure**\n\tAWS, Azure, Windows, Linux, Cloud networking, IAM, Storage, Security tools, DR, Backup, Cloud Certifications\n\n**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Problem-solving, Solution design",
  "apply_company": "Cloud Bridge"
}