{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Sales Engineer with 8 years of hands-on experience in **Cloud Technologies** including **AWS**, **Google Cloud Services**, and **Microsoft Windows Server**. Expertise in building solutions leveraging **JavaScript**, **Python**, and **RESTful API** integrations to drive customer success and technical sales excellence. Proficient in **Docker** and **Kubernetes** for containerization and orchestration, ensuring seamless deployment of applications in cloud environments.\n\nIn addition to strong technical acumen, I possess a solid understanding of database management with **MS SQL Server**, **Oracle**, and **PostgreSQL**, enabling me to support complex data architectures. My background in **Linux** and **z/OS** guarantees a comprehensive grasp of diverse operating environments, enhancing my capability in delivering tailored solutions to clients across various sectors. Skilled in collaborating with stakeholders and leveraging my expertise in healthcare and financial technologies to provide insightful solutions that align with business objectives.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Cloud Technologies** and **Docker** to design and maintain scalable server solutions across **Microsoft Windows Server**, **Linux**, and **AWS** environments, ensuring efficient sales engineering processes for high-impact solutions.\nDeveloped effective client-facing demos and technical presentations leveraging **JavaScript** and **Python**, showcasing advanced features of software solutions tailored to meet specific customer needs and addressing their unique challenges.\nImplemented **RESTful APIs** to integrate various software solutions, improving client interactions by enhancing the availability of services and data exchange, which increased customer satisfaction rates by **25%**.\nCollaborated with cross-functional teams to define technical requirements and manage product demonstrations using back-end technologies such as **PostgreSQL** and **MS SQL Server**, greatly enhancing the sales process and customer engagement.\nManaged deployments using **Kubernetes**, ensuring high availability and scalability of sales tools and resources that led to a **40%** decrease in deployment times.\nDesigned and executed training sessions for sales teams on using technology stacks, including **Google Cloud Services** and **Oracle**, empowering them with the skills needed to effectively sell cloud solutions.\nConducted live proof-of-concept events illustrating the effective use of **Docker** and **Kubernetes** for modern deployment practices, demonstrating a **30%** increase in conversion rates following the sessions.\nEngaged with customers to understand their existing IT infrastructure environments, utilizing **PowerShell** scripts for enhanced automation during proof-of-concept testing, yielding a more efficient setup process.\nProvided technical support for clients migrating to cloud solutions, leading to successful transitions for **15+** high-stakes projects within the first year of implementation.\nFostered relationships with enterprise clients by delivering customized technical information and assistance around the implementation of solutions using **z/OS** and legacy systems, ensuring customer loyalty and repeat business."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Demonstrated expertise in **Cloud Technologies** by leveraging **AWS**, **Google Cloud Services**, and container orchestration tools such as **Docker** and **Kubernetes** to enhance scalability and deployment processes for sales engineering solutions.\nUtilized **Linux** and **Microsoft Windows Server** to manage and configure server environments that support high availability and performance, ensuring seamless operations for sales teams.\nImplemented robust data management strategies using **MS SQL Server**, **Oracle**, and **PostgreSQL**, optimizing database performance and driving insights from customer analytics and sales data.\nDeveloped and maintained **RESTful APIs** to facilitate smooth integrations between various cloud services and internal systems, ensuring efficient data flow and interaction capabilities.\nCreated comprehensive technical documentation and presentations for sales pitches, fusing technical acumen in **Python** and **JavaScript** with client engagement strategies to effectively address customer needs.\nLeveraged **PowerShell** scripts to automate routine tasks and improve operational efficiency, aiding sales engineers in reducing manual overhead by **30%**.\nCollaborated with cross-functional teams to gather client requirements and provide tailored solutions that enhanced customer experiences, resulting in **15%** growth in client satisfaction ratings.\nEngaged with customers to demonstrate product capabilities and gather feedback, resulting in the successful rollout of **3** new features that led to an increase in sales conversions by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Leveraged **Cloud Technologies** including **AWS** and **Google Cloud Services** to architect and optimize scalable solutions for sales engineering, ensuring high availability for client applications.\n- Developed and maintained **RESTful APIs** using **Python** and **JavaScript**, aligning with sales and customer needs to enhance product functionality and performance.\n- Utilized **Docker** and **Kubernetes** for container orchestration, facilitating deployment processes and enabling rapid iterations of service delivery with version control for reliable performance monitoring across **Linux** and **Microsoft Windows Server** environments.\n- Conducted comprehensive data management using **PostgreSQL** and **MS SQL Server**, ensuring data integrity and compliance during interactions with client databases, while optimizing query performance.\n- Implemented automation scripts with **PowerShell** for system management efficiency, reducing manual overhead by **30%** in operational tasks.\n- Established training documentation and client-facing materials focused on integrating solutions on **Linux** and **z/OS**, optimizing the onboarding process and enhancing customer satisfaction ratings by **20%**.\n- Provided technical analysis and troubleshooting for client software deployments, achieving a resolution rate of **95%** on first contact, contributing to increased sales conversions.\n- Participated in design reviews and architecture discussions, merging client requirements with cutting-edge technologies to tailor solutions efficiently.\n- Engaged in direct communication with customers to understand their needs, enhancing service delivery and ultimately improving product adoption rates.\n- Championed the integration of innovative technologies that improved deployment timelines by **40%** and streamlined maintenance processes across systems."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful API\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, MS SQL Server, Oracle\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Microsoft Windows Server, Google Cloud Services, Azure (App Services, Blob, SQL), Linux, z/OS, IMS, PowerShell\n\n**Other:**\n\tSales Engineering, Artificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Rocket Software"
}