{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Full Stack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Full Stack Engineer with over 8 years of experience specializing in **React**, **JavaScript**, **TypeScript**, **Node.js**, and modern web app architecture. Proven expertise in designing and developing high-performance applications with a focus on API design, relational databases, and security best practices. I possess a strong background working with **Next.js** and adept at utilizing design tools such as **Figma**, **Sketch**, and **Photoshop** to create responsive and user-friendly interfaces.\nMy technical prowess is complemented by my extensive experience in cloud infrastructure, having worked with **AWS** and **Azure** to develop scalable solutions. I have a solid understanding of data manipulation and the importance of building secure applications. Additionally, I have successfully led projects that incorporate advanced design frameworks such as **Three.js** and **GSAP**, yielding engaging user interactions. Driven by a passion for innovation and excellence, I am adept at translating complex requirements into intuitive applications that elevate user experience.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed scalable web applications using **React** and **Next.js (17-18)**, ensuring modern web app architecture and user experience standards.\nUtilized **TypeScript** and **Node.js** to enhance code quality and maintainability while implementing robust API design strategies.\nDesigned and implemented relational databases with **PostgreSQL**, optimizing data manipulation and storage for high-performance applications.\nCollaborated with cross-functional teams to create comprehensive software solutions, leveraging **JavaScript** for dynamic UI components and server-side logic.\nIntegrated cloud infrastructure solutions, ensuring data protection and compliance with security standards throughout the development lifecycle.\nDelivered visually appealing UI designs using tools such as **Figma** and **Sketch**, translating designs into functional user interfaces in collaboration with design teams.\nExecuted front-end and back-end testing strategies utilizing frameworks such as **Jest** and **Cypress**, ensuring high code coverage and reliability.\nParticipated in code reviews to maintain code quality and best practices, boosting collaboration and knowledge sharing among team members.\nConducted performance optimizations across web applications, resulting in a significant improvement in load times and responsiveness by up to **30%**.\nEngaged in continuous learning of evolving technologies and frameworks including **GSAP** for advanced animations and **Three.js** for 3D web experiences."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Led the development of modern web applications using **React (18)**, **Next.js**, and **TypeScript**, ensuring high performance and responsiveness in user interfaces for financial dashboards.\nEngineered backend systems utilizing **Node.js (NestJS/Express)**, focusing on API design and microservices architecture to enhance scalability and maintainability of applications handling **9 million** transactions daily.\nDesigned and implemented secure interaction layers with relational databases, ensuring data manipulation techniques met industry standards for security and performance.\nCreated visually appealing prototypes and interfaces using design tools such as **Figma** and **Photoshop**, resulting in improved user experience and client satisfaction.\nOrchestrated seamless integration of frontend frameworks with robust backend services, adhering to best practices in modern web app architecture to deliver feature-rich applications.\nWorked with cloud infrastructure to deploy applications, leveraging services that support scalability and ensure secure data transactions across the platform.\nCollaborated in a team environment to apply **Javascript** and **GSAP** for smooth animations and transitions, enhancing the aesthetic appeal of user interactions in applications.\nParticipated in version control through **3** different code repositories, ensuring proper management and documentation of application versions and updates."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed robust frontend applications using **React (18)** and **TypeScript** to deliver dynamic and high-performance user interfaces while implementing modern web app architecture principles.\nDesigned and optimized backend APIs with **Node.js** leveraging frameworks like **Express**, ensuring seamless integration with frontend applications and supporting functionality for high-traffic e-commerce workflows.\nImplemented data manipulation and relational database management, utilizing **PostgreSQL** and caching strategies with **Redis**, resulting in a **30%** reduction in page load times and improved application responsiveness.\nIntegrated cloud infrastructure solutions using **AWS** to enhance scalability and reliability of applications, supporting deployment and management of multiple services.\nEnsured security throughout the platform by incorporating best practices in **API design**, implementing **OAuth 2.0** for secure user authentication, and achieving GDPR compliance for user data protection.\nCreated visually appealing UIs through design tools like **Figma** and **Photoshop**, translating designs into interactive components while adhering to accessibility standards (WCAG 2.1).\nApplied modern technologies and libraries, including **Next.js** for server-side rendering and improved SEO performance, successfully increasing organic traffic by **25%** post-deployment.\nPerformed continuous integrations and deployments to maintain application stability utilizing industry-standard practices and tools, ensuring low downtime during updates.\nLeveraged agile methodologies and collaborative tools to enhance cross-functional teamwork, ensuring the delivery of features on schedule and improving the overall quality of software produced."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, Javascript, TypeScript, Next.js, Vue, Angular, Three.js, GSAP, Figma, Sketch, Photoshop\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django), Node.js\n\n**API Technologies:**\n\tAPI design\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Relational databases\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Cloud infrastructure\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, CI/CD & Infrastructure as Code\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Security\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Modern web app architecture, Data manipulation"
}