{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Network Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Network Engineer, I bring a strong expertise in networking technologies including **Cisco**, **HPE**, **Aruba**, **Dell**, **EMC**, and **Extreme**. My proficiency in **LAN**, **WLAN**, network virtualization, automation, and security ensures the delivery of highly reliable network solutions. With a solid focus on network segmentation and Network Access Control (NAC), I am dedicated to maintaining robust security and compliance in all networking initiatives. I excel in fostering customer orientation and effective teamwork, utilizing strong communication skills in both **German** and **English**. Beyond networking, I have 8 years of experience as a Full Stack Developer with a tech stack that includes **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, **Django**, and cloud platforms like **Azure** and **AWS**. My background includes leading the development of enterprise-grade solutions with a focus on AI/ML capabilities and the integration of microservices architecture alongside CI/CD automation, ensuring high-performance and secure applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented advanced **networking** solutions with **Cisco**, **HPE**, and **Aruba** technologies to enhance corporate infrastructure, ensuring high availability and optimal performance within a scalable framework.\n- Developed and maintained secure **LAN** and **WLAN** configurations, focusing on effective **networksecurity** strategies to protect sensitive data across environments.\n- Utilized **networkautomation** tools for streamlined hardware configuration and management, improving deployment efficiencies by up to **25%**.\n- Participated in the design and execution of **networkvirtualization** initiatives, enabling seamless resource allocation and enhanced network management efficiency.\n- Fostered a culture of **customerorientation** by engaging with customers to understand their **networking** needs and delivering tailored solutions, improving satisfaction ratings by **15%**.\n- Led teamwork efforts across cross-functional squads, enhancing communication tools and methods which resulted in faster project completion times by an average of **30%**.\n- Developed and executed a segmentation strategy within enterprise networks, improving performance metrics and enhancing overall service reliability.\n- Continued professional development in **networking** trends and technologies, including certifications on **Dell**, **EMC**, and **Extreme** devices, to maintain up-to-date expertise and deliver optimal network solutions.\n- Provided bilingual support in **German** and **English**, ensuring effective communication with diverse clientele and team members, enhancing operational efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Demonstrated expertise in **networkautomation** and **networksecurity** by designing and implementing secure, efficient network infrastructures using **Cisco**, **HPE** and **Aruba** technologies for high-performance enterprise environments.\nLed the optimization of local area networks (LAN) and wireless local area networks (WLAN), achieving a **40%** improvement in data transfer rates through advanced **networkvirtualization** techniques.\nFostered **teamwork** and **communication** among cross-functional teams, contributing to project success and improvements in system integration practices.\nApplied **customerorientation** principles to understand client requirements and tailor solutions that enhance network reliability and user satisfaction, resulting in a **30%** reduction in support tickets.\nUtilized knowledge of **Dell** and **EMC** systems to deploy network storage solutions that increased data accessibility and disaster recovery capabilities by **50%**.\nImplemented **Segmentation** strategies to enhance network security protocols, safeguarding sensitive data against potential threats and achieving compliance with regulatory standards.\nCollaborated in a bilingual environment leveraging proficiency in **German** and **English** to ensure seamless communication with stakeholders and team members across different regions."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Demonstrated expertise in **networking** by designing and implementing robust LAN and WLAN solutions utilizing equipment from **Cisco**, **Aruba**, and **Dell** to ensure optimal connectivity and security for enterprise clients.\nEngineered network virtualization strategies enhancing performance and scalability, overseeing deployments of **HPE** and **Extreme** technologies to facilitate dynamic resource allocation and traffic management.\nApplied advanced **network automation** techniques to streamline operations and improve efficiency, employing modern tools for monitoring and configuration management.\nExecuted **network security** measures including NAC (Network Access Control) and segmentation strategies, reinforcing client data protection and compliance with industry standards such as GDPR.\nFostered effective **communication** and **teamwork** within cross-functional teams to deliver complex network solutions on time and within budget, enhancing customer orientation and satisfaction.\nAchieved significant improvements in network performance and reduction in downtime by implementing proactive management and troubleshooting techniques, resulting in a **20%** decrease in incident response time.\nFluently communicated in both **German** and **English** to assist diverse clientele in understanding technical requirements and solutions, enhancing client relationships and project outcomes.\nConducted training sessions on networking technologies for team members, bolstering skill development and promoting a culture of continuous learning and improvement across the organization."
    }
  ],
  "skills": " **Networking** \n\tCisco, HPE, Aruba, Dell, EMC, Extreme, LAN, WLAN, networking, networkvirtualization, networkautomation, networksecurity, NAC, Segmentation, customerorientation, teamwork, communication, German, English\n\n**Programming Languages** \n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks** \n\tFastAPI, Flask, Django\n\n**Frontend Frameworks** \n\tReact, Vue, Angular\n\n**API Technologies** \n\tJWT, OAuth2\n\n**Serverless and Cloud Functions** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure** \n\tAWS, Azure\n\n**Artificial Intelligence & Machine Learning** \n\tMLflow, Airflow, Kubeflow\n\n**Authentication & Security** \n\tKeycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot",
  "apply_company": "SVA System Vertrieb Alexander GmbH"
}