{
  "name": "Tomasz Lee",
  "role_name": "Senior ASIC Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Highly skilled Senior ASIC Engineer with 9+ years of experience in digital design and hardware (HW) development. Proficient in ASIC and FPGA design using **VHDL**, **Verilog**, and **System Verilog** for IP verification and linting processes. Expertise in automation and scripting with **Python**, **Perl**, and shell scripting to enhance EDA processes. Strong background in **DevOps**, CI/CD practices, and documentation, ensuring streamlined workflow and efficient team collaboration. Proven track record in delivering high-quality designs and optimizing performance within a cross-functional team environment, while leveraging a robust technical background in **C#** and **Java**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior ASIC Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **Perl** scripting for automation processes in the development of ASIC designs, achieving a reduction in cycle time by **30%**.\nDesigned and verified digital logic for ASIC components using **VHDL**, **Verilog**, and **SystemVerilog**, ensuring compliance with specifications and improving reliability ratings by **20%**.\nDeveloped and executed testbenches for IP verification, incorporating linting techniques to ensure high-quality code.\nImplemented CI/CD pipelines for hardware design flows, streamlining the deployment process by **40%** using **DevOps** principles.\nConducted synthesis and timing analysis, optimizing design performance to meet critical timing constraints by **15%**.\nCollaborated with cross-functional teams to document design processes, ensuring clarity and compliance with industry standards.\nEngaged in EDA tool selection and configuration to enhance design efficiency and automation capabilities.\nOversaw the integration of ASIC designs into larger systems, ensuring functional correctness and compatibility under varied test conditions.\nMentored junior engineers in digital design techniques and best practices, contributing to skill development and team performance."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and **Perl** for scripting and automation tasks, improving development speed by **20%**.\nDesigned and implemented **digital design** processes using **VHDL** and **Verilog**, ensuring high-quality and efficient ASIC designs.\nEngaged in **IP verification** strategies to validate design functionality, reducing bug count by **15%** before deployment.\nLed the migration of legacy systems to a modern **EDA** toolchain, streamlining workflows and boosting team productivity by **30%**.\nImplemented **CI/CD** practices within the development environment, utilizing tools to automate testing and deployment processes, enhancing overall release quality.\nAuthored comprehensive documentation for all design processes and newly automated workflows, resulting in a clearer project roadmap for current and future projects.\nConducted code reviews with a focus on **linting** and **synthesis**, fostering best coding practices among teams of engineers.\nCollaborated effectively with hardware teams during the integration of ASIC designs into larger systems, ensuring seamless interoperability with **HW** components.\nMentored junior engineers in **scripting** techniques and **digital design** principles, promoting a culture of continuous learning and development.\nExecuted performance optimization techniques in design simulations, achieving faster turnaround times on design iterations by **25%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **Python** and **Perl** scripting for automation and digital design processes, enhancing efficiency by **30%**.\nDesigned and implemented **FPGA** solutions in a collaborative environment, ensuring robust **HW** integration and performance evaluation by reducing error rates by **15%**.\nUtilized **C#** for developing high-level applications that support digital design workflows, contributing to overall project success.\nExecuted **EDA** tools for comprehensive analysis and simulation, enabling timely project deliverables and improved design accuracy.\nConducted **IP verification** processes using **VHDL**, **Verilog**, and **system Verilog**, achieving compliance with industry standards.\nParticipated in CI/CD pipelines alongside the DevOps team to streamline build, test, and deployment cycles, shortening delivery time by **25%**.\nEnsured thorough documentation of system processes and designs, facilitating knowledge transfer and reducing onboarding time by **20%**.\nEngaged in regular linting practices to uphold coding standards and identified potential issues in design verification processes.\nCollaborated in cross-functional teams to deliver quality digital design solutions while adapting to emerging technologies and methodologies.\nAssisted in synthesis processes for optimization of digital circuits, yielding a **10%** improvement in area and power efficiency."
    }
  ],
  "skills": "Programming Languages:\n\t**Python**, **C#**, Java, Perl, shell, TypeScript, JavaScript\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure, automation\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tCI/CD, DevOps\n\n**Cloud & Infrastructure:**\n\tCI/CD pipelines\n\n**Other:**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, ASIC, FPGA, HW, digital design, EDA, scripting, documentation, VHDL, Verilog, system verilog, IP verification, linting, synthesis",
  "apply_company": "IC Resources"
}