{
  "name": "Tomasz Lee",
  "role_name": "Senior Analytics Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Analytics Engineer with 9+ years of extensive experience in SQL, **BigQuery**, **Git**, and cloud platforms such as **GCP** and **AWS**. Proficient in data transformation and visualization tools including **DBT**, **Metabase**, and **Tableau**. Strong background in analytical programming languages such as **Python** and **R**, with a solid understanding of Agile methodologies. Originally trained as a .NET Full Stack Developer, leveraging skills in microservices architecture and tools like **Apache Kafka**, **RabbitMQ**, and **Redis** to deliver impactful data solutions. Demonstrated ability to optimize development processes and collaborate effectively across teams to achieve project milestones.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Analytics Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Analyzed and transformed datasets utilizing **SQL** and **BigQuery** to derive insights and improve decision-making processes for various business units, resulting in a 30% increase in reporting efficiency.\nDeveloped and maintained ETL pipelines using **DBT** to streamline data workflows, which decreased processing time by 25%.\nDesigned and implemented interactive dashboards with **Tableau** and **Metabase**, enhancing visibility into key performance metrics and operational data.\nCollaborated with cross-functional teams using **Agile** methodologies to ensure timely project delivery and alignment with business objectives.\nAutomated data collection and analysis processes using **Python** and **R**, reducing manual effort by 50% and increasing accuracy.\nUtilized version control with **Git** to manage code changes, ensuring high-quality code deployment in production environments.\nDeployed data solutions on cloud platforms such as **GCP** and **AWS**, optimizing resource allocation and scalability.\nParticipated in code reviews and provided mentorship to junior team members, fostering a culture of continuous improvement and knowledge sharing.\nInitiated data integrity checks and validation processes, achieving a 99.9% accuracy rate in data reporting.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **SQL** and **BigQuery** for efficient data analysis and management, leading to a **20%** improvement in query performance and execution speed.\nCollaborated with cross-functional teams within an **Agile** environment to ensure alignment on project goals and requirements, increasing project delivery timelines by **10%**.\nDeveloped dashboards and interactive reports using **Tableau** and **Metabase**, which improved data visibility and business decision-making processes by **30%**.\nImplemented data transformation workflows using **DBT** to enhance data quality and consistency across the analytics pipeline.\nLeveraged **GCP** and **AWS** for cloud-based data solutions, optimizing storage and processing capabilities for large datasets.\nAutomated data collection and analysis processes using **Python** and **R**, resulting in a **15%** reduction in manual reporting errors.\nManaged version control and collaboration through **Git**, fostering a cohesive development environment for analytics projects.\nConducted training sessions and workshops for team members on best practices in data analytics and visualization techniques.\nEngaged with stakeholders to gather insights and feedback, ensuring analytics deliverables met their needs and expectations."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **SQL** and **BigQuery** to analyze and manage large datasets, contributing to enhanced data-driven decision-making across the organization.\nDeveloped and maintained ETL processes using **DBT**, significantly reducing data processing time by 30%.\nCreated insightful data visualizations in **Tableau** and **Metabase**, enabling stakeholders to access real-time analytics with a reduction in report generation time by 25%.\nLeveraged **GCP** and **AWS** cloud services to optimize data storage and processing frameworks, supporting a seamless migration of 50TB of data.\nCollaborated with cross-functional teams in an **Agile** environment to deliver actionable insights, ensuring alignment with overall business goals.\nVersion-controlled all code and scripts using **Git**, improving team collaboration and project tracking efficiency.\nImplemented data modeling strategies to enhance data integrity and accessibility for analytics applications.\nConducted training sessions for team members on utilizing **Python** and **R** for statistical analysis, improving team skill sets and productivity by 15%.\nParticipated actively in sprint planning and retrospective meetings to continuously improve team performance and project outcomes.\nDocumented and streamlined processes, resulting in a comprehensive repository of analytics procedures for future reference."
    }
  ],
  "skills": "Programming Languages:\n\t**Python**, R\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\t**AWS**, **GCP**\n\n**Databases:**\n\t**SQL**, BigQuery, DBT, Metabase, Tableau, MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure:**\n\tAzure\n\n**Other:**\n\tUX/UI Design, Git, **Agile**, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis",
  "apply_company": "Top Doctors"
}