{
  "name": "Mariusz Jan Skobel",
  "role_name": "Principal Cloud Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Accomplished Principal Cloud Engineer with 10+ years of experience driving cloud engineering excellence through expertise in **Azure**, **GCP**, and **Terraform**. Deeply proficient in **GIT**, **Ansible**, and **Puppet**, with a solid foundation in CI/CD practices to ensure seamless deployment and integration of cloud-native applications. Proven history of technical leadership, fostering a collaborative community spirit, and motivating teams to innovate and solve complex problems efficiently. Experienced in delivering high-performance software solutions and leading multi-disciplinary teams that produce maintainable, secure applications compliant with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, brings robust skills across the full technology stack including **JavaScript/TypeScript**, **Python**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, alongside a practical background in MLOps utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**. Passionate about leveraging advanced technology to drive real-world impact and enhance organizational effectiveness.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Principal Cloud Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tLed the design and implementation of scalable cloud engineering solutions using **Azure** and **GCP**, ensuring high availability and performance for healthcare and finance applications.\n•\tUtilized **Terraform** for infrastructure as code (IaC), automating deployments and managing resource provisioning, reducing deployment time by **30%** across environments.\n•\tImplemented CI/CD pipelines with **Git** and **Ansible**, improving deployment frequency by **25%** and ensuring consistent application updates.\n•\tCollaborated effectively with cross-functional teams, demonstrating strong community spirit and adaptability to foster a culture of technical excellence and innovation.\n•\tProvided technical leadership in migrating monolithic applications to microservices, enhancing system scalability and maintainability, while optimizing cloud resource utilization.\n•\tFacilitated problem-solving sessions to address architectural challenges, resulting in streamlined workflows and improved project delivery timelines.\n•\tFostered collaboration among engineering teams, promoting best practices in cloud solutions and continuous improvement methodologies.\n•\tMentored junior engineers, instilling a sense of motivation to pursue professional development and technical mastery in cloud technologies.\n•\tDesigned and enforced governance policies for cloud environments, ensuring compliance with industry regulations and security standards, reducing potential vulnerabilities by **40%**.\n•\tConducted regular architecture reviews, optimizing cloud resource management for cost efficiency and performance improvement by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Demonstrated technical leadership in **Cloud Engineering** by architecting and implementing scalable solutions on **Azure** and **GCP** environments, ensuring operational excellence across financial platforms.\nLeveraged **Terraform** for infrastructure as code, managing deployment and configuration processes, which enhanced the reliability of cloud resources and reduced provisioning times by **30%**.\nDeveloped CI/CD pipelines using **GIT** and **Ansible**, streamlining deployment processes and increasing the deployment frequency by **50%** while minimizing downtime.\nImplemented robust monitoring and logging solutions to ensure system health and performance, facilitating a **15%** improvement in issue resolution times.\nFostered a community spirit and collaboration within teams by organizing regular knowledge-sharing sessions on cloud best practices and new technologies, promoting an atmosphere of continuous improvement.\nUtilized problem-solving skills to troubleshoot complex cloud architecture issues, reducing incident resolution time through a proactive approach and collaboration with cross-functional teams.\nAdapted to rapidly changing requirements and technologies within cloud engineering, maintaining motivation and focus to deliver high-quality solutions consistently.\nMentored junior engineers, nurturing their growth and development in cloud technologies and best practices, fostering a collaborative learning environment that promotes adaptability."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Led technical leadership in designing and optimizing cloud architectures for scalable backend services, employing **Azure** and **GCP** to enhance deployment strategies and reduce infrastructure costs by **30%**.\nDrove the implementation of CI/CD pipelines using **Terraform**, **GIT**, and **Ansible**, which accelerated deployment frequency by **50%** and reduced deployment failures by **40%**.\nEngineered automated provisioning and configuration management with **Puppet**, ensuring consistent infrastructure across environments and improving operational efficiency by **25%**.\nCultivated a community spirit by mentoring team members in best practices, fostering collaboration, and promoting problem-solving approaches that contributed to a **15%** increase in team productivity.\nEmphasized adaptability in addressing cloud-related challenges, successfully migrating **75%** of legacy applications to modern cloud infrastructure while minimizing downtime.\nApplied motivation techniques to boost team morale and commitment to project goals, resulting in timely project completions and exceeding service level agreements (SLAs).\nImplemented robust security measures in cloud environments, ensuring compliance with industry standards and enhancing data protection for sensitive user information.\nSpearedhead the integration of observability tools to monitor system health and performance, addressing potential issues proactively and reducing incident response time by **35%**."
    }
  ],
  "skills": "**Cloud & Infrastructure**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Puppet, CI/CD, GIT\n\n**Programming Languages**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Other**\n\tMLflow, Airflow, Kubeflow, technical leadership, community spirit, problem-solving, collaboration, adaptability, motivation"
}