{
  "name": "Tomasz Lee",
  "role_name": "Senior AI/ML Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Senior AI/ML Engineer with 9+ years of experience in developing and implementing advanced machine learning solutions using **Python**, **ML frameworks**, including **PyTorch** and **TensorFlow**. Proficient in data ingestion, transformation, and ensuring data quality while leveraging **LLMs**, **GenAI technologies**, and modern methodologies such as **CI/CD**, **Docker**, and **Kubernetes** to optimize deployment pipelines. Demonstrated expertise in **RAG** and **Vector databases** in conjunction with **MCP**, **LoRA**, and **QLoRA** to enhance machine learning model efficiency. Recognized for strong communication, collaborative skills, and effective problem-solving abilities. Committed to delivering innovative solutions and driving project success through a blend of technical acumen and cross-functional team leadership.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior AI/ML Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Implemented CI/CD pipelines leveraging **Docker** and **Kubernetes**, enhancing deployment efficiency by **40%**.\nUtilized **Python** and various ML frameworks such as **PyTorch** and **TensorFlow** for model development and training, increasing model performance by **30%**.\nDeveloped and maintained **data ingestion** and **data transformation** processes to ensure high **data quality** and seamless integration with existing systems.\nBuilt and optimized a data architecture using **Vector databases** for enhanced data retrieval speeds, improving query response times by **25%**.\nCollaborated with cross-functional teams to identify and troubleshoot data-related issues, employing strong **communication skills** and **problem-solving skills**.\nDesigned efficient **GenAI technologies** and **LLMs** implementation strategies, successfully integrating them into existing workflows.\nExecuted **RAG** methodologies to enhance model training and evaluation processes, ensuring alignment with business objectives and user needs.\nExplored and applied techniques such as **LoRA** and **QLoRA** for fine-tuning large language models, leading to improved outcomes in model adaptability and efficiency.\nFostered collaborative team dynamics, driving collective success in project completions and innovations in AI applications.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and developed machine learning models using **Python** and **PyTorch**, improving predictive accuracy by **20%**.\nImplemented deployment strategies for AI solutions using **Docker** and **Kubernetes**, streamlining the CI/CD pipeline processes and reducing deployment time by **40%**.\nUtilized **TensorFlow** and **sklearn** for data ingestion and transformation, enhancing data quality and processing efficiency across projects.\nDeveloped large language models (LLMs) and emergent GenAI technologies, achieving an increase in automated responses in AI agents by **35%**.\nCreated and maintained vector databases to optimize retrieval times for AI applications, leading to a **30%** increase in operational efficiency.\nExecuted data quality checks and improvements, ensuring the integrity and accuracy of machine learning datasets used in projects.\nCollaborated with cross-functional teams to define system requirements and project timelines, ensuring optimal communication and timely delivery.\nConducted training sessions on **ML frameworks** and best practices for junior developers, improving team capabilities and problem-solving skills.\nLed project reviews focusing on data transformation strategies and AI implementations, enhancing the overall project workflow and collaboration.\nMentored team members on **LoRA** and **QLoRA** methodologies, integrating advanced optimization techniques into ongoing projects."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "- Developed and maintained AI-powered solutions using **ML frameworks** such as **PyTorch** and **TensorFlow**, resulting in enhanced data processing capabilities for machine learning models by 35%.\n- Implemented **CI/CD pipelines** to automate deployment processes, achieving a **50% reduction** in deployment time.\n- Conducted **data ingestion** and **data transformation** using **sklearn**, ensuring data quality and integrity across the pipeline.\n- Engineered AI agents leveraging **GenAI technologies** to improve customer interaction by utilizing **Vector databases** for efficient retrieval of personalized data.\n- Collaborated with cross-functional teams to integrate advanced machine learning models (LLMs, **LoRA**, **QLoRA**) into existing systems, seamlessly enhancing their functionality.\n- Provided support in building **MLOps** systems, ensuring reliable and efficient deployment of AI applications at scale.\n- Actively participated in team meetings to leverage **collaborative skills** for effective project alignment and knowledge sharing.\n- Delivered comprehensive documentation and user guides for AI solutions, promoting clear communication of technical details across teams.\n- Proactively identified and solved problems related to AI implementations through innovative approaches and **problem-solving skills**.\n- Designed and implemented solutions on **Docker** and **Kubernetes** for container orchestration, enhancing application reliability and scalability."
    }
  ],
  "skills": " **Programming Languages** \n\t Python, JavaScript, TypeScript \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices \n\n **Frontend Frameworks** \n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL \n\n **Serverless and Cloud Functions** \n\t AWS, Azure \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Vector databases \n\n **DevOps** \n\t CI/CD pipelines, Docker, Kubernetes \n\n **Cloud & Infrastructure** \n\t Microservices, data ingestion, data transformation, data quality \n\n **Other** \n\t UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, ML frameworks, PyTorch, TensorFlow, sklearn, GenAI technologies, LLMs, RAG, AI agents, MCP, LoRA, QLoRA, LLM/MLOps, communication skills, collaborative skills, problem-solving skills"
}