{
  "name": "Tomasz Lee",
  "role_name": "Senior QA Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Senior QA Engineer with 9+ years of experience in Quality Assurance, specializing in Web Testing, Mobile Testing, and Back End Testing. Proficient in Agile methodologies, utilizing tools such as **Jira**, **Confluence**, and **TestRail** to ensure seamless project execution and team collaboration. Strong technical background in **MS SQL Server** and adept in using **Postman**, **Fiddler**, and **Kibana** for effective testing and monitoring. Experienced in the intricacies of microservices architecture with familiarity in **RabbitMQ**. Proven track record of delivering high-quality solutions while optimizing performance and enhancing operational efficiency.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted comprehensive **BackEndTesting** on web-based applications developed using .NET 7 and ReactJS to ensure system integrity and reliability, achieving a defect rate decrease of 30%.\nExecuted **WebTesting** for customer management platforms, ensuring compatibility across multiple browsers and devices, improving overall user satisfaction by 25%.\nEngaged in **MobileTesting** to validate mobile application functionalities, ensuring a seamless transition and maintaining a consistent user experience.\nUtilized **Jira** and **Confluence** to document testing procedures and results, enhancing team communication and project transparency.\nCollaborated in an **Agile** environment, participating in daily stand-ups and sprint planning sessions to align testing efforts with development cycles.\nPerformed **BackEndTesting** of APIs developed with .NET, utilizing **Postman** for endpoint validation and performance assessments, leading to a 40% reduction in integration issues.\nLeveraged **RabbitMQ** for managing message queuing in microservices, ensuring efficient task execution with a reported **20%** improvement in task completion times.\nImplemented database testing on **MS SQL Server**, optimizing queries and indexing, resulting in a 20% decrease in query execution times.\nUtilized **Fiddler** for traffic inspection and performance monitoring of web applications, contributing to increased application responsiveness.\nConducted performance analysis using **Kibana** for log management and error tracking, improving debugging efficiency by 35%.\nDeveloped and maintained test cases in **Testrail**, ensuring thorough coverage of critical application features while maintaining traceability of test executions.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Performed rigorous **BackEndTesting** on RESTful APIs developed with **.NET Core**, ensuring 99% test coverage and enhancing overall reliability.\nImplemented automated testing solutions using **Postman** and **Testrail**, achieving a 40% reduction in testing time across projects.\nUtilized **Jira** and **Confluence** for effective project management and documentation, leading to a more streamlined development process.\nConducted performance tests and monitoring using **Kibana**, identifying bottlenecks and improving system responsiveness by 20%.\nExecuted testing of cloud-based project management tools, ensuring compliance with quality standards and functional requirements to maintain a 98% acceptance rate.\nCollaborated with development teams to integrate **RabbitMQ** for reliable message handling and task orchestration, significantly improving system throughput.\nDesigned and maintained test strategies in an **Agile** environment, adapting to changes quickly and enhancing delivery timelines by 15%.\nCoordinated with stakeholders for requirement gathering and defined testing phases, maintaining transparency in product deliverables.\nPerformed testing across both web and mobile platforms, ensuring consistent functionality and experience across devices and versions.\nProvided mentorship to junior testers, fostering a culture of quality and increasing team performance based on consistent feedback loops."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Conducted extensive **WebTesting** and **MobileTesting** across multiple platforms, ensuring a 99% bug-free release cycle.\nExecuted **BackEndTesting** strategies using tools like **MS SQL Server** and **RabbitMQ**, achieving a 30% reduction in response times.\nUtilized **Jira** and **Confluence** for efficient project management and documentation, improving team collaboration in an **Agile** environment.\nDeveloped and maintained test cases in **Testrail** for rigorous tracking and reporting of QA processes, increasing test coverage by 40%.\nImplemented **Postman** to streamline API testing, allowing for seamless integration between systems.\nAnalyzed application performance with **Fiddler** and monitored logs using **Kibana**, resulting in proactive issue resolution.\nCollaborated with developers to enhance the existing testing frameworks and improve scalability, reducing manual testing efforts by 25%.\nParticipated in daily standups and code reviews ensuring alignment with project goals and coding standards, which supported a 15% improvement in team productivity.\nDelivered detailed reports and metrics that helped identify bottlenecks in the development cycle, leading to actionable insights for the team."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL, Postman\n\n **Serverless and Cloud Functions**\n\tAWS, Azure\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tCI/CD pipelines\n\n **Cloud & Infrastructure**\n\tRabbitMQ, Apache Kafka, Redis\n\n **Other**\n\tUX/UI Design, Git, GitHub, Agile, Jira, Confluence, Testrail, Fiddler, WebTesting, MobileTesting, BackEndTesting, NUnit, xUnit, Selenium, Moq, Cypress, JMeter, Jest, Kibana, Blockchain",
  "apply_company": "Social Discovery Group"
}