{
  "name": "Tomasz Lee",
  "role_name": "Senior Android Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Android Engineer with over 9 years of software development expertise, proficient in **Java**, **Kotlin**, and **Android** with a strong emphasis on **Jetpack Compose** and **Android Views**. Adept in implementing **Agile** methodologies and leveraging optimal **Data Structures** for enhanced application performance. Experienced in **Asynchronous Programming** and applying **Cryptography** and **Security Best Practices** to ensure robust application security. Proven track record of effective communication and collaboration across interdisciplinary teams to deliver high-quality applications that meet user requirements efficiently.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Android Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Java** and **Kotlin** for developing high-performance Android applications, improving code efficiency by **30%**.\nImplemented **Jetpack Compose** for building declarative UI, enhancing app development speed by **25%**.\nApplied **Agile** methodologies for project management, resulting in a **15%** increase in team productivity.\nLeveraged key **Data Structures** and **Asynchronous Programming** techniques to optimize application performance and responsiveness.\nEnsured robust application security by employing advanced **Cryptography** techniques and adhering to **Security Best Practices**, reducing vulnerability risks by **40%**.\nEmployed effective communication strategies to collaborate with cross-functional teams, fostering a culture of transparency and efficiency.\nParticipated in the design and architecture of Android applications, integrating with RESTful APIs and ensuring seamless data flow.\nConducted thorough code reviews and provided mentoring to junior developers, enhancing team skill levels and performance.\nMaintained up-to-date knowledge of Android development trends and technologies, ensuring the application remains competitive in the market."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **Java** and **Kotlin** to develop robust Android applications using **Jetpack Compose**, achieving a 20% reduction in development time.\nUtilized **Android Views** for creating seamless user interfaces that improved user retention by 15%.\nAdopted Agile methodologies to facilitate efficient project management, ensuring on-time delivery of **3** major app updates per quarter.\nApplied advanced **Data Structures** for enhancing app performance, reducing memory usage by 30%.\nImplemented **Asynchronous Programming** techniques to ensure smooth UI performance during data loading, decreasing load times by 25%.\nIncorporated security protocols and **Cryptography** best practices to safeguard user data, leading to zero reported security incidents over **12** months.\nLed cross-functional communication with product teams to define project scope and requirements, enabling alignment across **5** departments.\nMentored junior developers on best coding practices and design patterns, improving team collaboration and code quality.\nConducted peer code reviews to ensure adherence to security and performance standards, contributing to an overall code quality improvement rate of 35%.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Java** and **Kotlin** to develop high-performance Android applications, implementing features that adhere to **Security Best Practices** and optimized for asynchronous processing.\nDesigned and developed UI components using **Jetpack Compose** and traditional **Android Views**, delivering an engaging user experience while improving development efficiency by **30%**.\nEmployed **Data Structures** and **Algorithms** to enhance application performance, optimizing data handling and retrieval operations, achieving a **15%** reduction in memory usage.\nImplemented Agile methodologies within the team, ensuring timely delivery and adaptation to changing project requirements through regular sprint planning and retrospectives.\nCollaborated closely with cross-functional teams to integrate advanced functionalities, focusing on clear **Communication** to align with project goals and stakeholder expectations.\nDeveloped and maintained technical documentation, enhancing clarity around project architectures and application flow for improved team onboarding and knowledge sharing.\nParticipated actively in code reviews that enhanced code quality and fostered a culture of learning, ensuring adherence to coding standards and best practices.\nContributed to the refinement of application security measures, leveraging **Cryptography** techniques to safeguard user data and sensitive information, ensuring compliance with industry standards."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, Kotlin, Python, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, Android, Jetpack Compose, Android Views\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tBlockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Agile, Data Structures, Asynchronous Programming, Cryptography, Security Best Practices, Communication",
  "apply_company": "LastPass"
}