{
  "name": "Rei Taro",
  "role_name": "Software Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Skilled Software Engineer with over 10 years of experience in developing and delivering robust backend systems, specializing in service-oriented architecture and design patterns. Proficient in **.NET**, **C#**, **MS SQL Server (T-SQL)**, and implementing **REST APIs**. Experienced in cloud services like **Azure** and adept at CI/CD and DevOps practices to ensure efficient deployment and software delivery. Strong background in creating high-quality web services and applications, with additional skills in **Angular**, **JavaScript**, and **CSS**. Successfully contributed to projects at leading organizations, leveraging technical expertise to drive impactful results.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed robust web services and REST APIs using **.NET** and **C#** to enhance application functionality and alignment with service-oriented architecture principles.\nEngineered database solutions with **MS SQL Server (T-SQL)** ensuring high availability and optimized performance for data access and processing.\nImplemented front-end components with **Angular** and **JavaScript**, improving user experience with responsive design and interactive features based on **CSS**.\nEstablished CI/CD pipelines on **Azure** to automate deployments, increasing development efficiency by **30%** and minimizing release times.\nUtilized **Visual Studio** for streamlined development processes, enhancing code quality with integrated testing and debugging tools.\nApplied design patterns and best practices in software architecture to foster maintainability and scalability in all applications created.\nCollaborated with DevOps teams to streamline workflow processes, manage version control effectively across multiple projects involving **10+** developers.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **.NET** and **C#** for backend development, implementing service-oriented architecture to enhance system scalability and maintainability.\nDesigned and developed **REST APIs** to facilitate seamless communication between microservices and front-end applications, achieving response times under **100ms**.\nConducted comprehensive database management with **MS SQL Server** (T-SQL), optimizing queries to improve performance by over **30%**.\nImplemented **CI/CD** pipelines and DevOps practices to automate deployment processes, reducing deployment time by **50%**.\nCreated dynamic web applications using **Angular** and **JavaScript**, enhancing user experience through responsive design and efficient state management.\nEmployed version control systems, primarily using **Visual Studio**, to maintain code integrity, collaborating effectively with team members to ensure project milestones are met.\nEngaged in security best practices and design patterns to safeguard applications, conducting regular audits and implementing necessary fixes to vulnerabilities.\nCollaborated with cross-functional teams for successful integration of **Web Services** into existing systems, improving throughput and overall system functionality."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **.NET** and **C#** to develop robust backend services, ensuring optimal functionality for trade execution, portfolio management, and account tracking.\nImplemented **MS SQL Server (T-SQL)** to enhance data storage and retrieval processes, achieving a **20%** improvement in response times.\nDesigned and maintained **REST APIs** and **Web Services**, collaborating with frontend teams to facilitate seamless data exchange and user experience.\nLeveraged **Azure** for cloud deployment and scalability, contributing to a **99.9%** uptime for the trading platform.\nEstablished CI/CD pipelines with **DevOps** practices, reducing development cycle time by **30%** and improving deployment frequency.\nAdopted modern **Angular** and **JavaScript** frameworks for dynamic user interfaces, ensuring code quality through design patterns and service-oriented architecture.\nImplemented unit testing and automated QA processes utilizing **Visual Studio**, ensuring compliance with external regulations such as MiFID II and GDPR."
    }
  ],
  "skills": "        **Programming Languages**\n        \tPython (3.8+), SQL, Bash, JavaScript, .NET, C#\n\n        **Backend Frameworks**\n        \tFastAPI, Flask, Django, Celery\n\n        **Frontend Frameworks**\n        \tAngular, CSS\n\n        **API Technologies**\n        \tREST/gRPC APIs, Web Services, REST APIs\n\n        **Serverless and Cloud Functions**\n        \tAWS (EC2, S3, Lambda), Azure\n\n        **Databases**\n        \tPostgreSQL, MySQL, MongoDB, Redis, MS SQL Server (T-SQL)\n\n        **DevOps**\n        \tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, DevOps\n\n        **Cloud & Infrastructure**\n        \tAzure\n\n        **Other**\n        \tMicroservices, Kafka, service-oriented architecture, design patterns, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git\n"
}