{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Go Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Go Engineer with 10+ years of experience in developing and delivering high-performance software solutions. Proficient in **Golang**, **Linux**, and **Kubernetes**, with extensive hands-on expertise in debugging and building containerized applications using **Containers**, **Kubevirt**, **KVM**, and **QEMU**. Demonstrated skill in collaborating on **upstream projects** and creating robust test plans to ensure the reliability of software products. Self-driven and flexible, I excel in fast-paced environments, prioritizing effective communication in **English**. Additionally, I possess a strong background in cloud-native application deployment on **Azure** and **AWS**, along with experience in enterprise systems architecture and compliance standards such as HIPAA and PCI DSS. My commitment to building technically sound systems is complemented by practical experience in MLOps, deploying machine learning pipelines using tools like **MLflow** and **Airflow**, which drive real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Go Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained microservices using **Golang** and **Kubernetes**, ensuring scalability and performance across multiple CPU architectures in a cloud environment.\n•\tDesigned and implemented robust debugging strategies to troubleshoot and optimize applications, particularly within **Containers** and **KVM** environments.\n•\tCollaborated with cross-functional teams to create and execute test plans for efficient integration and deployment, leveraging **git** for version control.\n•\tUtilized **libvirt** and **QEMU** to manage and automate virtualization and deployment processes, enhancing system performance and resource utilization.\n•\tParticipated in upstream projects to contribute to community-driven enhancements and knowledge sharing within the **Linux** ecosystem.\n•\tMaintained flexibility in a rapidly changing environment, displaying strong self-driven capabilities while achieving project milestones on time.\n•\tCommunicated effectively in English, ensuring clear collaboration with global teams and stakeholders to achieve common objectives."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Linux** and **Kubernetes** to manage and orchestrate containerized applications, enhancing deployment efficiency and scalability while supporting **Golang** application development.\nPerformed debugging and improvement of **Kubevirt** and **KVM** configurations, ensuring optimal performance and reliability across various CPU architectures for virtualization solutions.\nLed collaboration efforts in upstream projects, contributing to open-source initiatives and ensuring code quality through comprehensive test plans and peer reviews.\nDemonstrated flexibility and self-driven approach while integrating **git** for version control, streamlining collaborative software development processes and improving code management practices.\nDesigned and implemented containerization strategies using **libvirt** and **QEMU**, achieving a reduction of deployment time by **30%** and enhancing the overall system's performance.\nCreated a robust development environment that supports **libguestfs** for virtual disk management, optimizing task executions and improving developer productivity by **25%**.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Collaborated on upstream projects and contributed to open-source initiatives, showcasing strong teamwork and flexibility in a fast-paced environment.\nUtilized **Golang** for building and maintaining efficient, scalable microservices aligned with modern architectural patterns in a **Kubernetes** ecosystem, ensuring responsiveness across applications.\nManaged containerized deployments using **Docker** and orchestrated scalable applications with **Kubevirt**, **KVM**, and **libvirt**, enhancing the platform's operational efficiency and resource utilization.\nConducted debugging sessions and implemented test plans to maintain high code quality, leveraging **git** for version control and collaboration among team members.\nParticipated in the design and implementation of CI/CD pipelines in a **Kubernetes** environment, enhancing the deployment process and minimizing downtime during updates.\nEngaged in cross-team collaboration to drive project enhancements and ensure alignment with organizational goals, promoting communication in English across diverse technical groups.\nDeveloped comprehensive documentation and best practices for **Linux** environments and cloud-native technologies, enhancing team knowledge and project handover processes.\nDrove initiatives for performance optimization in **CPU architectures**, ensuring applications maintain low latency and high availability across services.\nFostered a self-driven approach to project management, adapting strategies to meet changing requirements and ensure successful project execution."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, Golang, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tLinux, Containers, Kubevirt, KVM, libvirt, QEMU, libguestfs\n\n **Other:** \n\tCollaboration, Self-driven, Flexibility, English, Debugging, Test Plans, Upstream Projects",
  "apply_company": "SUSE"
}