{
  "name": "Tomasz Lee",
  "role_name": "Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Software Engineer with 9+ years of experience in developing complex applications, with a strong focus on backend technologies including **Python**, **Rust**, and **gRPC**. Proficient in building scalable **REST APIs**, deploying applications using **Docker** and **Kubernetes**, and implementing **CI/CD** pipelines for enhanced development efficiency. Experienced in microservices and monolithic architecture design. Proven problem solver with a solid drive for results and a collaborative team spirit. Adept in utilizing **ReactJS**, **NextJS**, and the **.NET** technology stack, alongside a deep understanding of distributed systems and cloud services. An effective communicator in English, committed to delivering high-quality solutions and optimizing application performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and maintained RESTful APIs to enhance application performance and data management. \nSpearheaded the design and development of a web-based customer management platform using **.NET 7**, **ReactJS**, and **Next.js**, improving user satisfaction by **25%**.\nIntegrated **gRPC** for efficient data communication and utilized **Docker** for containerization, ensuring robust deployment processes.\nDesigned and implemented a **Microservices** architecture using **.NET Core** to modularize the platform for enhanced scalability and maintainability.\nCollaborated with teams to implement **CI/CD** pipelines through **Azure DevOps**, reducing deployment time by **40%**.\nUtilized **Kubernetes** for orchestrating containerized applications, ensuring high availability and reliability.\nMobile support for a responsive design that accommodates changes smoothly resulting in a **35%** reduction in mobile response times.\nIntegrated **RabbitMQ** for task queuing and **Apache Kafka** for real-time data streaming, improving system resilience and throughput.\nOptimized **MSSQL** database queries and indexing, reducing average query execution time by **20%**. \nImplemented JWT-based authentication and authorization strategies to safeguard applications effectively. \nWorked collaboratively with UX/UI designers to enhance the platform’s user interface, leading to a greatly improved user experience."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and **Rust** for backend development, ensuring robust and efficient code quality in line with project goals.\nImplemented **gRPC** and **REST APIs** for seamless communication between microservices, optimizing system performance across the board.\nDeployed applications using **Kubernetes** and **Docker**, enhancing scalability and reliability of development and production environments.\nDesigned and executed CI/CD pipelines, significantly reducing integration and deployment time by **30%**.\nDeveloped microservices architecture, improving system scalability and aligning with agile development practices for increased team efficiency.\nCollaborated effectively in team settings to define project requirements and development timelines, ensuring timely project delivery with a **15%** increase in collaboration efficiency.\nConducted problem-solving sessions and code reviews, fostering a team spirit that improved overall productivity and capability of junior developers.\nManaged integration with databases such as PostgreSQL, MSSQL, and MySQL, ensuring optimal performance and data retrieval.\nCreated custom reporting tools using data visualization libraries to enhance project tracking and stakeholder communication.\nEnsured adherence to software development best practices while continuously improving internal processes to drive success."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** for developing and optimizing backend services, streamlining data processing and enhancing application efficiency by **30%**.\nImplemented **gRPC** for efficient communication between microservices, facilitating faster data access with reduced latency by **15%**.\nDesigned and developed REST APIs following industry best practices, ensuring robust data exchange between client and server applications with **99.9%** uptime.\nContainerized applications using **Docker** for consistent deployment across environments, improving scalability and reducing deployment times by **40%**.\nManaged orchestration of containers with **Kubernetes**, ensuring high availability and efficient resource management across **15+** services.\nContributed to the establishment of a CI/CD pipeline using Jenkins, resulting in a deployment frequency increase of up to **50%**.\nParticipated in migrating monolithic applications to a microservices architecture, enhancing system flexibility and maintainability.\nCollaborated effectively within a team-oriented environment, utilizing problem-solving skills to overcome technical challenges.\nDemonstrated strong proficiency in English for both written and verbal communication, ensuring clear documentation and reporting.\nEngaged in daily standups and cross-functional project discussions to drive alignment towards common objectives."
    }
  ],
  "skills": "• **Programming Languages**\n\tPython, Rust\n\n• **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n• **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n• **API Technologies**\n\tRESTful API, GraphQL, gRPC\n\n• **Serverless and Cloud Functions**\n\t\n\n• **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n• **DevOps**\n\tAWS, Azure, CI/CD pipelines, Docker, Kubernetes\n\n• **Cloud & Infrastructure**\n\t\n\n• **Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Problem Solving, Drive, Team Spirit, English Proficiency"
}