{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Full Stack .NET Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Full Stack .NET Developer with 13+ years of experience in delivering high-performance applications, particularly in the healthcare and financial sectors. Proficient in **.NET Core**, **.NET Framework**, **JavaScript**, **TypeScript**, and **Python**, consistently applying clean code principles and modern architecture design patterns to ensure maintainable and scalable solutions. Expertise in frontend and backend development using **React** and deploying systems on **MS Azure**, leveraging **Azure DevOps** and CI/CD tools for efficient deployments.\nArchitecting AI/ML-powered platforms to support predictive analytics, automation, and real-time processing using **Azure AI**. Experienced in agile methodologies, ensuring alignment with compliance requirements such as HIPAA, FHIR, PCI DSS, and SOC 2. Strong background in MLOps with hands-on experience in model training and orchestration using tools such as MLflow, Airflow, and Kubeflow. Excellent communication skills in English facilitate collaboration within diverse teams.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Full Stack .NET Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed full-stack applications utilizing **.NET Core**, **React**, and **TypeScript**, ensuring alignment with clean code principles and design patterns.\n- Leveraged **Python** for backend services, implementing modern architectures that facilitate scalability and maintainability.\n- Employed Agile methodologies throughout the project lifecycle, enhancing team collaboration and communication, resulting in a **30%** improvement in delivery timeframes.\n- Designed and implemented CI/CD pipelines with **Azure DevOps** and other **CI/CD tools**, achieving automated testing and deployment, leading to a **25%** reduction in deployment errors.\n- Created intuitive, responsive user interfaces using **React** (17–18) that enhance user engagement and satisfaction, evidenced by a **15%** boost in user retention rates.\n- Integrated **Azure AI** capabilities for data-driven decision-making, harnessing machine learning frameworks that support real-time data analytics and insights.\n- Collaborated with cross-functional teams to develop and deploy machine learning models, enhancing product features and functionality.\n- Built secure REST APIs with robust authentication to facilitate seamless communication between frontend and backend components.\n- Conducted code reviews and enforced development best practices, fostering an environment focused on continuous improvement and adherence to clean code principles.\n- Actively participated in technical discussions and solutions design, leveraging effective English communication skills to articulate complex ideas clearly."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed high-quality web applications using **.NET Core** and **.NET Framework**, ensuring adherence to clean code principles and design patterns to deliver maintainable and scalable codebases.\nUtilized **React** alongside **TypeScript** for building responsive user interfaces, achieving performance optimizations measured with load times reduced by **30%** while enhancing user experience.\nImplemented CI/CD pipelines using **Azure DevOps** and other CI/CD tools to streamline deployment processes, reducing the time to production by **50%** and achieving a deployment frequency increase to **bi-weekly** releases.\nParticipated in Agile methodologies, leading sprint reviews and fostering clear communication in English to ensure alignment within cross-functional teams, resulting in improved project delivery timelines by **20%**.\nDesigned and deployed cloud-based solutions on **MS Azure**, leveraging **Azure AI** for incorporating machine learning capabilities into applications.\nBuilt and integrated backend services with **Python** for ETL processes, ensuring seamless data ingestion from internal and third-party sources, while supporting both batch and real-time analytics.\nMaintained high-quality code standards and efficiency, critically analyzing and refactoring existing services to realize performance gains and adherence to modern architecture practices.\nContributed to the development of comprehensive documentation and technical specifications, promoting knowledge sharing within the team and onboarding for new members."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained high-performance web applications using **.NET Core** and **.NET Framework**, ensuring adherence to clean code principles and design patterns for maintainable software solutions.\nLeveraged **React** and **JavaScript** to create engaging user interfaces, enhancing user experience across multiple devices with a focus on mobile-first design and accessibility.\nImplemented CI/CD processes utilizing **Azure DevOps** to streamline deployments, reducing release cycles by **30%** and improving team collaboration.\nEngineered backend services with an emphasis on modern architecture, ensuring scalability and reliability through the use of **Python** and **Azure AI** capabilities for machine learning applications.\nCollaborated in Agile methodologies, participating in daily stand-ups and sprint planning to align team goals and foster effective English communication across diverse teams.\nDesigned and developed RESTful APIs, applying best practices in versioning and documentation for better integration with external services and streamlined developer experience.\nUtilized **MS Azure** services for hosting applications and databases, achieving availability metrics of **99.9%** uptime, aligning with enterprise-grade standards.\nCreated modular and reusable components using **TypeScript** to improve maintainability and enhance the functionality of front-end applications.\nIntegrated third-party tools with an emphasis on performance optimization, resulting in a reduction of load times by **25%** and enhancing user engagement.\nExecuted comprehensive testing protocols including unit, integration, and user acceptance testing to ensure high-quality deliverables in line with stakeholder requirements."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\t.NET Core, .NET Framework, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, S3; Azure: App Services, Azure AI\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, CI/CD tools\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Machine Learning, clean code principles, design patterns, modern architecture, Agile methodologies, English communication"
}