{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Flutter Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Flutter Engineer with 8 years of experience, I excel in cross-platform development utilizing **Flutter** and **Dart**, along with modern architecture patterns such as **BLoC**, **Cubit**, and **Clean Architecture**. I am proficient in developing responsive and user-friendly applications that leverage **RESTful APIs** for seamless data integration.\n\nMy background includes a strong understanding of **Atomic Design** principles and tools such as **GoRouter** and **Mocktail** for efficient UI management and testing. With excellent debugging skills and a commitment to quality, I ensure robust applications that meet high standards. \n\nIn addition to my Flutter expertise, I have extensive experience in software development methodologies, fostering effective communication and teamwork within agile environments. My prior roles also included building high-performance solutions in the healthcare and financial sectors, with a focus on compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Flutter Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed cross-platform mobile applications using **Flutter**, employing **Dart** and architectural patterns such as **BLoC** and **Cubit**, ensuring high performance and maintainability across iOS and Android platforms.\nImplemented clean, modular code following **Clean Architecture** principles to enhance application scalability and facilitate collaboration within the engineering team.\nUtilized tools like **GoRouter** for efficient routing and navigation within mobile applications, improving user experience and reducing app complexity.\nConducted thorough debugging for applications by using testing libraries such as **Mocktail** to ensure the highest code quality and reliability.\nCollaborated with cross-functional teams to deliver features efficiently, utilizing strong **communication** and **teamwork** skills while integrating **RESTful APIs** for seamless data interaction.\nLed the design and development of new features for mobile projects, allowing for rapid iterations based on user feedback, and achieved a **30%** reduction in feedback-to-delivery cycle time.\nParticipated in code reviews and pair programming sessions, fostering a culture of learning and knowledge sharing, which enhanced overall team productivity by **25%**.\nAdopted best practices for cross-platform development, enhancing code reusability and reducing platform-specific bugs by **40%**.\nMentored junior developers on **Flutter** and **Dart** principles, elevating team expertise and accelerating on-boarding time for new team members.\nAchieved successful delivery of several major releases within tight deadlines, contributing to a **50%** increase in project completion rates."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and developed high-performing, cross-platform applications using **Flutter** and **Dart**, implementing **Clean Architecture** principles and leveraging **BLoC** and **Cubit** patterns to enhance app structure and maintainability.\nCollaborated on the integration of **RESTful APIs** to ensure seamless communication between front-end applications and back-end services, thus improving user experience and data synchronization.\nUtilized **GoRouter** for effective route management and navigation in multi-screen applications, ensuring intuitive and responsive user interactions.\nEmployed **Mocktail** for comprehensive testing and debugging, enhancing code quality and reliability, ultimately leading to a reduction in bug reports by **30%**.\nLed a team of developers to adopt atomic design methodologies, which improved design consistency and efficiency, resulting in a **25%** faster development cycle.\nFostered open communication and teamwork within the department, contributing to high collaboration scores of **90%** in quarterly team assessments.\nMaintained version control and clean code practices using **Git**, ensuring continuous integration and deployment processes are smooth and efficient."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and implemented high-performance mobile applications using **Flutter** and **Dart**, adhering to **Clean Architecture** principles to ensure maintainability and scalability across various platforms.\nDeveloped responsive user interfaces utilizing **Atomic Design** methodology, leading to a more intuitive user experience and increased user engagement.\nEngineered smooth navigation through the application with **GoRouter**, providing seamless transition effects and enhancing overall usability.\nCollaborated with cross-functional teams to define and integrate robust **RESTful APIs**, ensuring efficient data exchange and communication within the application ecosystem.\nUtilized **BLoC** and **Cubit** for state management, enabling efficient and reactive management of application states to enhance performance and responsiveness.\nParticipated in thorough debugging and testing using **Mocktail**, significantly reducing the number of production bugs and improving application stability by **30%**.\nImplemented version control techniques using **Git**, ensuring organized code collaboration and enhancing workflow among team members.\nContributed to cross-platform development efforts that resulted in the successful deployment of applications on both Android and iOS, reaching **over 50,000** active users.\nFostered effective communication and teamwork among diverse project stakeholders, leading to improved project outcomes and timely delivery of features.\nMentored junior developers on **Flutter** best practices and techniques, enhancing team skillset and overall productivity by **20%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Dart\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Flutter, BLoC, Cubit, Clean Architecture, Atomic Design, GoRouter\n\n **API Technologies:**\n\tRESTful APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Git, Debugging, Cross-platform Development, Communication, Teamwork",
  "apply_company": "It's Prodigy"
}