{
  "name": "Rei Taro",
  "role_name": "Senior Backend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Results-driven Senior Backend Engineer with over 10 years of experience in building robust, event-driven systems and high-performing APIs. Proficient in **Node.js**, **TypeScript**, and **Java**, with deep expertise in **PostgreSQL** for database management. Proven ability to implement **clean architecture** and adopt **domain-driven design** practices, ensuring maintainable and scalable solutions. Skilled in developing and executing comprehensive **testing strategies** to enhance software quality. Excellent communication and mentoring skills, successfully guiding teams in top-tier organizations, including VISA, Sii Poland, and Reply Polska, while contributing to impactful financial platforms and AI/ML pipelines.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered event-driven systems using **Node.js** and **TypeScript** to enhance document automation, onboarding, and reporting workflows, impacting over **300** users monthly.\nDeveloped asynchronous processing solutions leveraging **React** and **PostgreSQL** for efficient handling of financial transaction requests, achieving a response time reduction of **25%**.\nDeployed high-performing microservices with **Java** on cloud platforms, ensuring seamless deployments and excellence in clean architecture practices.\nManaged comprehensive testing strategies, resulting in a **40%** decrease in production bugs and improved deployment confidence.\nDesigned and created data pipelines to enhance regulatory reporting mechanisms, ensuring accuracy and timeliness of data flow.\nMentored junior developers on best practices in domain-driven design and clean architecture, fostering a culture of collaborative learning and communication.\nSuccessfully communicated system integration challenges to cross-functional teams, ensuring compliance and on-time project delivery, leading to a **15%** increase in team efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed high-performance backend systems using **Node.js** and **TypeScript**, ensuring clean architecture and maintainability for scalable applications.\n• Designed event-driven systems to facilitate real-time data processing, enhancing user interactions and overall application responsiveness.\n• Engineered robust APIs in **Java** for seamless integration with front-end systems built with **React**, ensuring efficient data exchange and user experience.\n• Implemented PostgreSQL databases to manage and optimize data storage and retrieval, achieving a **25%** decrease in query response times.\n• Applied domain-driven design principles in structuring application architecture, fostering better collaboration among development teams.\n• Developed comprehensive testing strategies, including unit and integration tests, yielding a **40%** reduction in bugs pre-release.\n• Mentored junior developers by imparting essential coding practices and guiding them through complex project requirements, fostering a culture of continuous improvement.\n• Communicated effectively with cross-functional teams to guarantee successful project execution and alignment with business objectives."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed high-performance backend services for trade execution, portfolio management, and account tracking using **PostgreSQL** to enhance trading operations.\nEngineered event-driven systems with **Node.js** and **TypeScript** to support real-time price feeds, enabling efficient processing for **high-frequency transactions**.\nImplemented clean architecture principles in service development, ensuring maintainable and scalable solutions while delivering high-quality software.\nCollaborated effectively with frontend teams utilizing **React** to create robust REST APIs, facilitating smooth communication between user interfaces and backend systems.\nConducted comprehensive testing strategies using **PyTest** and mocking to ensure quality assurance and maintain data integrity, resulting in a **30% reduction** in bugs reported post-deployment.\nMentored junior developers in best practices for software development and domain-driven design to foster team growth and improve overall project quality.\nDesigned and developed job queuing and scheduling solutions using **Celery** and **RabbitMQ**, improving backend task execution efficiency by **50%**."
    }
  ],
  "skills": "**Programming Languages**\n\tNode.js, TypeScript, Python (3.8+), SQL, Bash, JavaScript, Java\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tReact\n\n**API Technologies**\n\tREST/gRPC APIs, event-driven systems\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, testing strategies\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Other**\n\tMicroservices, Kafka, PyTest, Git, clean architecture, domain-driven design, communication, mentoring"
}