{
  "name": "Tomasz Lee",
  "role_name": "Senior Fullstack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Fullstack Engineer with 9+ years of experience in designing and implementing complex applications. Proficient in **Go**, **Python**, and **TypeScript**, with a solid foundation in creating robust **APIs** and working within **Distributed Systems**. Demonstrated mastery of **React** for dynamic frontend development, as well as containerization technologies like **Docker** and **Kubernetes** for seamless deployment. Experienced with leading cloud service platforms including **GCP** and **AWS**. Proven success in optimizing software solutions and streamlining development processes while collaborating effectively with cross-functional teams. Recognized for the ability to deliver high-quality results in fast-paced environments.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **Go** to enhance system functionalities and optimize performance in a web-based application.\nDesigned and developed scalable applications using **TypeScript** and **React** for a dynamic user interface, ensuring a responsive design.\nImplemented and integrated **APIs** for seamless data communication between front-end and back-end systems, enhancing overall system efficacy.\nDeveloped a robust microservices architecture leveraging **Docker** and **Kubernetes** for efficient container orchestration and management.\nDeployed applications on cloud platforms such as **GCP** and **AWS**, ensuring high availability and disaster recovery solutions.\nSpearheaded the migration of legacy systems to modern architectures, resulting in a performance increase by **30%**.\nCollaborated on projects related to **Distributed Systems**, enhancing service scalability and resilience.\nUtilized advanced reporting tools and libraries for data analysis and visualization, generating reports with **D3.js** for interactive elements.\nLed a team in implementing innovative solutions for accounting software integrations to streamline operations.\nConducted code reviews and optimized application performance, achieving load time improvements by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed scalable applications using **Python**, **TypeScript**, and **React**, enhancing performance and functionality by 20%.\n• Designed and maintained **APIs** that facilitate robust integrations, reducing dependency on legacy systems by **50%**.\n• Implemented containerization strategies utilizing **Docker** and orchestration with **Kubernetes** for seamless deployment processes in environments across **GCP** and **AWS**.\n• Collaborated with product teams to design user-centric interfaces using **React**, which increased customer satisfaction ratings by **30%**.\n• Built distributed systems that improved operational resilience, achieving an uptime of **99.9%**.\n• Performed database management and optimization tasks using both **MSSQL** and **MySQL** for enhanced data retrieval, resulting in a **40%** faster query performance.\n• Led the integration of **Accounting Software** solutions within applications, streamlining financial reporting processes.\n• Conducted regular code reviews and provided mentorship to junior engineers, resulting in a 25% increase in overall code quality.\n• Implemented CI/CD best practices, utilizing automated deployment pipelines, which reduced deployment times by **60%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **TypeScript** and **React** to enhance the frontend of applications, increasing user engagement by **30%**.\nImplemented **Python** and **Go** for backend development, ensuring robust and scalable APIs that improved data processing speed by **25%**.\nManaged **Docker** containers for application deployment, streamlining environments and reducing deployment time by **40%**.\nDeveloped and maintained distributed systems architecture that effectively handled increased loads, improving system reliability and uptime by **15%**.\nCollaborated with AWS and GCP services for cloud solutions, optimizing resource usage and cutting operational costs by **20%**.\nCreated and integrated accounting software APIs to support accurate financial data exchanges, enhancing overall system interoperability.\nParticipated in code reviews and agile ceremonies to promote team collaboration and adherence to coding standards.\nDelivered comprehensive technical documentation, facilitating knowledge sharing and onboarding for new team members.\nImplemented microservices architecture using **Kubernetes**, improving system flexibility and scalability for high-traffic workloads."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, Go, TypeScript\n\n**Frontend Frameworks**\n\tReact, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL, APIs\n\n**Serverless and Cloud Functions**\n\tAWS, GCP\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tDocker, Kubernetes, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tUX/UI Design, Git, GitHub, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, Distributed Systems, Accounting Software",
  "apply_company": "Rho"
}