{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with 9+ years of experience in developing and implementing **microservices** and **distributed systems**. Proficient in **AWS** cloud services, **Kubernetes**, and **PostgreSQL**, ensuring scalable and highly available application architectures. Expertise in testing frameworks like **JUnit** and using **Testcontainers** for efficient and reliable software development. Strong focus on code review practices and mentoring junior developers, fostering a collaborative and innovative team environment. Demonstrated problem-solving skills with a proven track record of delivering robust backend solutions using technologies such as **Kotlin**, optimizing performance through efficient coding and architectural strategies.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Kotlin** and **AWS** to implement scalable microservices for a distributed system, enhancing overall application performance.\nConducted code reviews and provided mentorship to junior developers, fostering a collaborative team environment and improving code quality.\nDesigned and deployed microservices architecture on **Kubernetes**, ensuring high availability and reliability across applications.\nUtilized **PostgreSQL** for efficient data management, optimizing database performance with enhanced indexing strategies that led to a **20%** reduction in query execution time.\nImplemented comprehensive automated testing using **JUnit** and **Testcontainers**, improving code coverage and reducing bugs in production by **30%**.\nEmployed **Grafana** for monitoring system performance and health metrics, contributing to proactive issue identification and resolution.\nApplied strong problem-solving skills to troubleshoot distributed system challenges, leading to a **15%** decrease in system downtime.\nCollaborated effectively with cross-functional teams to deliver project milestones, ensuring alignment with business goals and user needs.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented and optimized **microservices** architecture and **distributed systems** solutions, leading to enhanced system scalability and performance.\nDeveloped and maintained RESTful APIs with **PostgreSQL** as the primary database, ensuring real-time data access for users.\nUtilized **Kubernetes** for container orchestration, resulting in improved deployment efficiency and resource management.\nConducted comprehensive code reviews and mentoring sessions for junior developers, fostering a collaborative team environment and enhancing overall productivity.\nIntegrated **AWS** services for cloud-based infrastructure, contributing to a 20% reduction in operational costs.\nEmployed **JUnit** and **Testcontainers** for robust automated testing, ensuring high-quality code and decreasing bug rates by 40%.\nUtilized **Grafana** for monitoring system performance, facilitating proactive issue resolution and maintaining system reliability.\nCollaborated with cross-functional teams and stakeholders to define system requirements, leading to successful project deliveries ahead of schedule.\nEngaged in problem-solving initiatives that improved application performance and user experience, driving a 15% increase in customer satisfaction."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed microservices architecture in **Kotlin** for scalable backend solutions, enhancing application modularity and team productivity.\n• Implemented **PostgreSQL** databases to handle complex queries and improve data retrieval times by over **30%**.\n• Led the migration of distributed systems to **AWS** using best practices, achieving a reduction in operational costs by **15%**.\n• Utilized **JUnit** and **Testcontainers** for comprehensive unit and integration testing, ensuring system reliability and minimizing production issues.\n• Collaborated with cross-functional teams through code reviews and mentorship, fostering a culture of continuous improvement and knowledge sharing.\n• Engaged in problem-solving sessions, contributing to innovative solutions for optimizing system performance in a **Kubernetes** environment.\n• Monitored application health and performance metrics using **Grafana**, leading to proactive system adjustments and enhanced user experiences.\n• Assessed and improved deployment pipelines in a CI/CD context, successfully reducing deployment times by **40%**.\n• Actively participated in team standups and sprint planning, ensuring alignment on project goals and timelines.\n• Authored and maintained technical documentation to support internal systems, facilitating easier onboarding and knowledge transfer among team members."
    }
  ],
  "skills": "****Programming Languages****\n\tKotlin, JavaScript, TypeScript, C#, Python\n\n****Backend Frameworks****\n\tNodeJS, ExpressJS, NestJS, .NET, Microservices\n\n****Frontend Frameworks****\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n****API Technologies****\n\tRESTful API, GraphQL\n\n****Serverless and Cloud Functions****\n\tAWS, Azure\n\n****Databases****\n\tPostgreSQL, MongoDB, DynamoDB, CosmosDB, MSSQL Server, MySQL\n\n****DevOps****\n\tCI/CD pipelines, Kubernetes\n\n****Cloud & Infrastructure****\n\tAWS\n\n****Other****\n\tUX/UI Design, Git, GitHub, Redis, Apache Kafka, RabbitMQ, NUnit, xUnit, JUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Solidity, Ether.js, Web3.js, Ethereum, Testcontainers, Grafana, code review, mentorship, problem-solving, collaboration",
  "apply_company": "Pleo"
}