{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Highly skilled in **Technical Sales** and **Consultative Selling**, I bring 8 years of experience as a Full Stack Developer, equipped with a robust understanding of customer needs and a proven ability to drive **Business Development** and refine **Customer Relationship Management**. My background in full-stack development using modern **JavaScript**, **TypeScript**, **Python**, and **Flutter** enhances my technical acumen, allowing me to articulate complex solutions clearly and effectively to stakeholders. \n\nI excel in **Key Account Management**, employing strategic networking and problem-solving abilities to foster and maintain strong client partnerships. I have a strong foundation in **cloud services** like **Azure** and **AWS**, and I understand the impact of technology on business success. This technical expertise complements my sales capabilities, ensuring I can effectively convey the value of innovative solutions. I am fluent in both English and Swedish, enabling me to communicate effectively with a diverse customer base. My experience includes navigating budgets and aligning solutions with compliance standards, demonstrating a comprehensive ability to meet client objectives while driving impactful outcomes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Customer Relationship Management** tools to enhance client engagement and retention, fostering strong relationships with key accounts and contributing to a **20%** increase in customer satisfaction ratings.\nExecuted **Business Development** initiatives, identifying and pursuing new sales opportunities, which led to a **15%** growth in sales revenue across target markets.\nLeveraged **Technical Sales** skills to deliver in-depth product demonstrations and articulate complex solutions to clients, effectively addressing their needs through consultative selling techniques.\nImplemented strategic **Consultative Selling** approaches to analyze client requirements, resulting in customized solutions that increased project conversion rates by **30%**.\nDemonstrated exceptional **Problem Solving** abilities by diagnosing customer issues and providing effective solutions promptly, reducing response times by **25%**.\nEngaged in **Networking** activities to expand professional relationships and partnerships, successfully increasing referral leads by **10%**.\nManaged project budgets effectively, allowing for a **5%** reduction in costs while maintaining service quality and customer satisfaction.\nMaintained fluency in **English and Swedish** to communicate effectively with diverse client bases and enhance cross-cultural engagements."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed strong customer relationships through consultative selling techniques, effectively identifying client needs and tailoring technical solutions to increase customer satisfaction and drive sales.\nLed business development initiatives that resulted in a **20%** increase in key account engagements, leveraging in-depth product knowledge to offer customized solutions in technical sales.\nSuccessfully executed problem-solving strategies that improved efficiency and effectiveness in client communication, boosting retention rates by **15%** in competitive markets.\nUtilized networking skills to establish partnerships and collaborate with cross-functional teams, driving joint ventures that expanded market reach and enhanced service offerings.\nManaged project budgets effectively, ensuring cost-effective utilization of resources while maintaining a high level of service delivery.\nFluently communicated with clients in both English and Swedish, providing personalized assistance and fostering collaboration which led to **10+** successful project implementations per quarter.\nHarnessed advanced techniques in customer relationship management to maintain detailed progressive insights of client accounts and ensure that all customer needs were met promptly and accurately."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized strong **Technical Sales** skills to present complex technical solutions to prospects, demonstrating product value and aligning with customer needs to drive business growth.\nEmployed **Consultative Selling** techniques to develop tailored solutions and strategies, ensuring alignment between client requirements and technical product offerings, notably increasing client satisfaction scores by **30%**.\nManaged **Customer Relationship Management (CRM)** software to track interactions and streamline communication with clients, enhancing customer retention rates by **20%** through proactive engagement and support.\nDrove **Business Development** initiatives to identify potential key accounts, leveraging an extensive network to enhance market penetration and establish significant partnerships, contributing to a **15%** increase in revenue.\nExecuted **Key Account Management** strategies to nurture long-term relationships with major clients, collaborating on technical specifications and project milestones, ensuring client objectives were met consistently.\nApplied effective **Problem Solving** methodologies to address technical inquiries and challenges presented by clients, resulting in timely solutions that maintained project timelines and customer satisfaction.\nEngaged in **Networking** opportunities through industry events and forums to represent the company, building brand awareness and expanding the client base.\nEmployed **Budgeting** techniques to forecast project costs and resource allocation, optimizing departmental expenditures by **10%** while maintaining service quality.\nDemonstrated proficiency in **Fluent English** and **Fluent Swedish** to cater to diverse client needs, ensuring effective communication across multicultural environments. \n"
    }
  ],
  "skills": " **Programming Languages:** \n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tN/A\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS, Azure\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Technical Sales, Consultative Selling, Customer Relationship Management, Business Development, Key Account Management, Problem Solving, Networking, Budgeting, Fluent English, Fluent Swedish",
  "apply_company": "Watson-Marlow Fluid Technology Solutions"
}