{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Front End Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a versatile Front End Software Engineer with 8 years of experience, I excel in utilizing **React**, **Vue.js**, and **Angular** to build high-performance, user-centric applications. My strong skills in **CSS**, **Tailwind CSS**, and **Bootstrap** enable me to create responsive and visually appealing interfaces, while employing **Design Systems** to ensure consistency across projects. I have a solid foundation in CI/CD processes and automated testing frameworks, including **Playwright**, **Cypress**, and **Jest**, ensuring a seamless development lifecycle. \n\nProficient in integrating **REST APIs** and leveraging **Azure** for cloud-based solutions, I have effectively collaborated across teams to deliver compliant applications in line with industry standards. My technical acumen is complemented by my proactive communication and collaboration skills, making me a reliable team player committed to driving project success. In previous roles, I successfully contributed to projects that improved application performance by over 30%, elevating user engagement and satisfaction.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Front End Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained responsive user interfaces utilizing **React** and **Vue.js** to enhance user experience and engagement by **25%**.\nCollaborated with cross-functional teams to implement design systems using **Figma**, **Sketch**, and **Storybook**, improving consistency across applications and reducing design discrepancies by **30%**.\nCreated and optimized reusable components with **Tailwind CSS** and **Bootstrap**, reducing development time for new features by **40%**.\nImplemented automated testing strategies employing **Jest**, **Cypress**, and **Playwright** to ensure robust application performance and reduce regression bugs by **50%**.\nFacilitated CI/CD pipelines using Azure DevOps for seamless deployment processes, achieving deployment frequency of **3 times per week** with zero downtime.\nDesigned and integrated **REST APIs** for efficient data handling between front-end and back-end services, improving response times by **35%**.\nEngaged in continuous collaboration and communication practices with team members, enhancing project transparency and stakeholder satisfaction ratings by **20%**.\nImplemented accessibility standards (WCAG) in user interfaces, achieving compliance and improving usability for users with disabilities.\nUtilized **Angular** for developing scalable applications, ensuring compatibility with existing **.NET** backend systems for a cohesive user experience.\nMaintained a high level of code quality through code reviews and adherence to best practices, leading to a reduction in technical debt by **15%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Collaborated with cross-functional teams to design and implement responsive front-end applications using **React (18)** and **Vue.js (3)**, ensuring an engaging user experience through adherence to design systems and leveraging tools such as **Tailwind CSS** and **Bootstrap** for styling.\nDeveloped unit and integration tests utilizing **Jest**, **Cypress**, and **Playwright** to ensure application robustness and performance, achieving over 90% code coverage on critical components.\nStreamlined deployment processes by integrating **CI/CD** pipelines for efficient code integration and delivery, reducing deployment time by **40%**.\nConducted code reviews and pair programming sessions to foster a collaborative environment, enhancing team productivity and communication.\nUtilized **MSSQL** for efficient data retrieval and management, optimizing query performance by **25%** through indexing and refining database architecture.\nCreated and maintained component libraries using **Storybook**, improving design consistency and facilitating faster development cycles across projects.\nParticipated in Agile ceremonies, providing input for sprint planning and retrospectives to ensure continuous improvement of processes and collaboration within the team.\nUtilized advanced CSS techniques such as **Flexbox** and **Grid** for optimal layout design, resulting in a more visually appealing and user-friendly interface."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed responsive, user-friendly frontend applications using **React (18)**, **Vue.js**, and **Angular**, incorporating **CSS**, **Tailwind CSS**, and **Bootstrap** to ensure seamless mobile-first experiences across platforms.\nLeveraged **REST APIs** to integrate robust backend services, facilitating effective collaboration and communication between frontend and backend teams to enhance overall application performance.\nEngineered reusable design components adhering to established design systems using **Storybook** and **CSS Grid**/**Flexbox**, achieving consistent and scalable UI patterns across different modules.\nImplemented test automation scripts using **Cypress**, **Jest**, and **Playwright** for continuous integration practices, ensuring high code quality and reliability with a targeted coverage of **90%**.\nCollaborated with UI/UX designers utilizing tools like **Figma** and **Sketch** to translate wireframes into functional code, enhancing user engagement and accessibility compliant with **WCAG 2.1** standards.\nParticipated in CI/CD processes to automate deployment cycles, improving release efficiency by **30%** and reducing time-to-market for new features.\nEngaged in feature flagging strategies and A/B testing methodologies to test new UI elements and features, contributing to a **15%** increase in user retention rates.\nContributed to team-wide knowledge sharing and best practices discussions to foster a collaborative environment, promoting effective communication and skill development among peers."
    }
  ],
  "skills": "  **Programming Languages**\n\tC#, Python, JavaScript, TypeScript\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, .NET\n\n  **Frontend Frameworks**\n\tReact, Vue.js, Angular, CSS, Tailwind CSS, Bootstrap, Storybook, Flexbox, Grid\n\n  **API Technologies**\n\tREST APIs, JWT, OAuth2\n\n  **Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, MSSQL, Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, CI/CD\n\n  **Cloud & Infrastructure**\n\tAzure\n\n  **Other**\n\tMLflow, Airflow, Kubeflow, Keycloak, Let’s Encrypt, Nginx, Certbot, Collaboration, Communication, Automation, Figma, Sketch, Playwright, Cypress, Jest, Design systems"
}