{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Full Stack Engineer with 13+ years of experience in delivering high-performance applications. Proficient in **JavaScript**, **TypeScript**, and **React**, with strong expertise in **Laravel**, **PHP**, **HTML5**, and **CSS**. Skilled in deploying applications using **Docker** and **Kubernetes**, with a focus on **CI/CD** practices and **TDD** to ensure robust and efficient development processes.\n\nAdept at both frontend and backend development, leveraging a diverse tech stack that includes **Node.js**, **FastAPI**, and **Django**. Experienced in building applications that meet compliance regulations, such as HIPAA and PCI DSS.\n\nStrong background in effective team leadership and mentoring, complemented by excellent critical thinking and communication skills, facilitating collaboration across cross-functional teams. Committed to continuous improvement and delivering innovative solutions tailored to meet client needs.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Led and mentored a team in designing and implementing full-stack applications utilizing **Laravel**, **React**, **JavaScript**, **TypeScript**, and **PHP** for optimal performance and maintainability.\n• Developed user interfaces with **HTML5** and **CSS** ensuring responsive design principles for enhanced user experience across various devices.\n• Managed database architectures leveraging **MySQL** to ensure data integrity and efficient access across applications.\n• Implemented CI/CD pipelines using **Docker** and **Kubernetes** to streamline deployment processes, achieving a reduction in deployment time by **30%**.\n• Conducted rigorous TDD practices using Jest and Cypress, enhancing application reliability and reducing bugs in production by **25%**.\n• Collaborated with cross-functional teams to communicate effectively, ensuring alignment on project objectives and timely delivery of features across the software development lifecycle.\n• Championed critical thinking within the team, analyzing system performance metrics and providing actionable insights, elevating application efficiency by **40%** through code optimization.\n• Defined best practices for integrating testing strategies across various project components, ensuring full test coverage and adherence to compliance standards.\n• Designed architecture schemas for new projects ensuring alignment with business goals, while mentoring junior developers on secure coding practices and efficient development strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React** (18), **JavaScript**, and **TypeScript** to create dynamic and responsive front-end applications, delivering excellent user experiences for financial tools and admin panels.\nDesigned and built RESTful APIs with **Laravel** and **PHP** to support seamless integration between front-end and back-end systems, improving data retrieval speeds by **30%**.\nImplemented **Kubernetes** for orchestration and **Docker** for containerization, achieving a **25%** reduction in deployment times and improved scalability of applications.\nAdopted Test-Driven Development (**TDD**) practices and set up **CI/CD** pipelines ensuring high code quality and faster release cycles by **40%**.\nLead a team of engineers through mentoring and technical guidance, fostering an environment of collaboration and innovation.\nEnhanced critical thinking and communication within the team, resolving project challenges effectively and maintaining project timelines.\nContributed to database management using **MySQL**, optimizing queries to reduce load times by **20%**, and ensuring data integrity across applications.\nApplied HTML5 and CSS knowledge to ensure cross-browser compatibility and a polished UI, improving user engagement by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Leveraged **Laravel** and **PHP** for backend development, ensuring robust and maintainable code for large-scale applications.\n• Developed responsive web applications using **React** and **JavaScript**, delivering high-performance user interfaces with version **18** for enhanced functionality.\n• Enhanced application features and styling with **TypeScript**, **HTML5**, and **CSS**, focusing on mobile-first design principles and accessibility compliance (WCAG 2.1).\n• Implemented microservices architecture with **Kubernetes** and **Docker**, enabling seamless deployments and efficient resource management in production environments.\n• Utilized **MySQL** for relational database management, ensuring data integrity and fast query performance across multiple user transactions.\n• Executed TDD (Test-Driven Development) practices, increasing code reliability and reducing the number of critical bugs by **30%** through effective coding strategies.\n• Led CI/CD processes to streamline deployment pipelines, reducing deployment times by **50%** and improving overall team productivity.\n• Provided team leadership and mentoring, fostering a collaborative environment that cultivated critical thinking and enhanced communication skills among team members.\n• Collaborated effectively with stakeholders to gather requirements and deliver innovative technology solutions, ensuring alignment with business objectives."
    }
  ],
  "skills": "**Programming Languages:**\n\tPHP, Python, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Laravel\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, TDD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, team leadership, mentoring, critical thinking, communication",
  "apply_company": "Workwize"
}