{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Ruby Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Experienced Senior Ruby Engineer with 8 years of expertise in full-stack development. Proficient in **AWS**, alongside strong capabilities in **Docker** and **Ruby**, ensuring robust application deployment and management. I specialize in developing high-performance healthcare and financial solutions using modern technologies such as **JavaScript**, while also being familiar with **Chef**, **SAS**, and **R**. My technical proficiency extends to leading enterprise-grade platforms, integrating AI/ML capabilities, and optimizing applications for scalability and performance.\n\nI leverage my deep understanding of cloud infrastructure, notably **AWS**, to implement continuous integration and delivery pipelines. My experience in microservices architecture and event-driven systems, paired with a focus on compliance standards like HIPAA and PCI DSS, ensures the security and reliability of applications. Additionally, I possess hands-on experience in developing machine learning workflows, supporting data-driven decision-making in production environments, and have an aptitude for leveraging tools such as MLflow and Airflow.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Ruby Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS** for scalable cloud solutions and managed CI/CD pipelines, ensuring continuous integration and deployment for software applications.\nDeveloped robust RESTful APIs and microservices architectures using **Ruby** and **Docker**, facilitating seamless interaction between various system components.\nLeveraged **JavaScript** and front-end frameworks for developing dynamic user interfaces, enhancing user experience and application performance.\nImplemented configuration management and automation using **Chef** to streamline development workflows and reduce manual overhead.\nApplied data analysis techniques using **SAS** and **R** for extracting insights from large datasets, improving decision-making processes.\nDesigned and maintained scalable, cloud-native applications while optimizing infrastructure for high availability and fault tolerance, aligning with industry standards.\nCollaborated with cross-functional teams to deliver projects on-time, implementing efficient software development practices and agile methodologies.\nEstablished best practices for testing and deployment, incorporating unit tests and continuous deployment strategies that improved application reliability by **30%**.\nDeveloped enterprise-level solutions to support business goals, utilizing industry-leading tools and technologies to enhance productivity and performance.\nMentored junior engineers, fostering an environment of continuous learning and teamwork, which led to a **20%** increase in team efficiency.\nLeveraged **MS 365** tools for documentation, project management, and team collaboration, ensuring streamlined communication throughout project life cycles."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **AWS** services to optimize cloud-based deployments, ensuring reliable and scalable application performance in financial systems.\nDeveloped and maintained **Ruby** applications focusing on code quality, efficiency, and scalability, contributing to a **30%** increase in performance metrics over **6 months**.\nImplemented containerization techniques using **Docker** to streamline the deployment process of microservices, resulting in a **25%** reduction in deployment times and enhanced development workflow.\nCollaborated closely with cross-functional teams to build and enhance JavaScript-based applications using frameworks such as React (18) and Vue 3, ensuring comprehensive front-end functionality and seamless user experiences.\nDesigned and implemented CI/CD pipelines leveraging **Chef** to automate deployment processes and infrastructure management, improving project delivery times by **20%**.\nConducted data analysis and reporting using **SAS** and **R**, driving data-driven decisions and enhancing operational efficiencies in financial services.\nIntegrated **MS 365** tools to facilitate collaboration and project management across teams, improving communication and productivity within the organization.\nMentored junior developers on best practices with **Ruby** and modern software development methodologies, fostering skill development and team cohesion."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **AWS** cloud services for deploying backend applications and managing infrastructure effectively, ensuring scalability and reliability for high-traffic e-commerce platforms.\nDeveloped and maintained microservices architecture using **Docker**, enhancing service isolation and simplifying deployment processes across various environments.\nImplemented responsive applications using **JavaScript**, integrating with frameworks like Ruby on Rails to enhance user experience and platform interactivity.\nLeveraged CI/CD pipelines using **Chef** for automating deployment processes and improving operational efficiency, reducing overall deployment time by **30%**.\nApplied SAS and R for data analysis and predictive modeling to inform strategic decisions, driving an increase in conversion rates by **15%** due to enhanced recommendation systems.\nCollaborated using **MS 365** tools to streamline project management and improve team communication, reducing project overhead and enhancing collaborative efforts by **25%**.\nEnsured high performance and scalability in backend services by using optimal Ruby practices, adhering to best coding standards and maintaining comprehensive unit tests.\nContributed to application performance profiling and optimization to reduce latency, achieving a **20%** improvement in response times across key transactions.\nEngaged in code reviews and mentoring junior engineers, fostering knowledge sharing and encouraging adherence to Ruby best practices and patterns.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, Ruby, R, SAS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Chef, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tKeycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, MS 365, Airflow, Kubeflow",
  "apply_company": "pharmtrace"
}