{
  "name": "Rei Taro",
  "role_name": "Senior Geotechnical Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Geotechnical Engineer with a robust background in Civil Engineering and over 10 years of experience in ground investigations and site designs. Proficient in problem-solving, teamwork, and effective communication to lead projects successfully. Skilled in conducting site visits and collaborating with cross-functional teams to ensure the best geotechnical practices. Experienced in utilizing cutting-edge technologies and frameworks to enhance project delivery, combining engineering principles with proven analytical skills. A results-driven professional with a history of impactful contributions in engineering roles.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Geotechnical Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Applied expertise in **Geotechnical** and **Civil Engineering** to conduct in-depth ground investigations, ensuring alignment with project specifications.\nExecuted meticulous site visits to gather critical data, assess site conditions, and provide informed design recommendations to enhance project deliverables.\nLeveraged strong problem-solving skills to troubleshoot site issues, resulting in a **25%** reduction in project delays through proactive risk management strategies.\nFostered effective communication and collaboration within cross-functional teams, facilitating smooth project execution and shared understanding of engineering principles.\nMaintained a valid driving license to facilitate travel to various project sites across **15+** locations, ensuring timely project assessments and updates.\nDemonstrated effective teamwork by mentoring junior engineers and contributing to a **30%** improvement in team productivity through targeted training initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Conducted **site visits** to assess site conditions and gather data for **geotechnical investigations**, ensuring compliance with **civil engineering** standards.\nUtilized problem-solving skills to address challenges in **ground investigations** and provide effective solutions throughout the design process.\nCollaborated with multidisciplinary teams to enhance communication and teamwork, driving project success in the completion of **geotechnical design** tasks.\nImplemented quality control measures during **design** stages, ensuring robust structures that meet safety and performance criteria.\nMaintained thorough records of investigations and design processes, contributing to transparent documentation for project stakeholders and regulatory compliance.\nEmployed advanced techniques and methods in **geotechnical engineering** to create innovative designs that significantly reduced project time by **20%**.\nAchieved a **95%** success rate in project deliverables through proactive planning and stakeholder engagement, reinforcing strong communication pathways throughout the project lifecycle."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Employed strong **problem-solving** skills to design and oversee **ground investigations** and geotechnical assessments, ensuring data accuracy and reliability.\nConducted **site visits** to gather critical data and assess site conditions, effectively communicating findings to stakeholders and team members.\nLeveraged **teamwork** and **communication** abilities to collaborate with civil engineering teams, facilitating smooth project progression and enhancing design integrity.\nUtilized a **driving license** for efficient site access and management, enabling timely project updates and adjustments based on field observations.\nManaged the **design** process for geotechnical solutions, adhering to regulatory standards and ensuring project compliance with industry guidelines.\nStreamlined workflows through the implementation of structured team meetings, leading to a **25%** increase in project delivery timelines.\nLed **ground investigations** utilizing advanced techniques and technologies, resulting in a **15%** reduction in site assessment times.\n"
    }
  ],
  "skills": " **Programming Languages** \n\t Python (3.8+), SQL, Bash, JavaScript \n\n **Backend Frameworks** \n\t FastAPI, Flask, Django, Celery \n\n **Frontend Frameworks** \n\t  \n\n **API Technologies** \n\t REST/gRPC APIs, Microservices \n\n **Serverless and Cloud Functions** \n\t AWS (EC2, S3, Lambda), Azure \n\n **Databases** \n\t PostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps** \n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git \n\n **Cloud & Infrastructure** \n\t  \n\n **Other** \n\t Geotechnical, Civil Engineering, Ground Investigations, Design, Site Visits, Problem Solving, Teamwork, Communication, Driving License",
  "apply_company": "Binnies"
}