{
  "name": "Tomasz Lee",
  "role_name": "Software Development Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-oriented Software Development Engineer with 9+ years of experience in developing high-performance applications utilizing **C#**, **Visual Studio**, and **Azure Pipelines**. Proficient in **unit testing** and **automated testing**, equipped with a strong foundation in design patterns and Agile methodologies. Skilled in leveraging **GitHub Actions** for continuous integration and deployment, with additional expertise in **Windows APIs**. Experienced in **microservices architecture** and distributed systems, with a solid background in **ReactJS**, **NextJS**, and backend technologies. Proven track record of delivering robust solutions, optimizing performance, and leading cross-functional teams to achieve project success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Development Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed high-quality software solutions in **C#** and **C++**, leveraging design patterns to create maintainable and efficient code.\n• Designed and executed unit tests to ensure software reliability and performance, leading to a **30%** decrease in post-deployment defects.\n• Collaborated in an **Agile** development environment, participating in sprint planning and reviews, enhancing team productivity by **15%**.\n• Utilized **Visual Studio** and **GitHub Actions** to streamline development processes and enable continuous integration and deployment.\n• Spearheaded the implementation of **Azure Pipelines** for automated testing and delivery, reducing release cycle time by **50%**.\n• Integrated Windows APIs to enhance application functionality, leading to increased user satisfaction and functionality.\n• Mentored junior developers on best practices in software design and automated testing, improving team skills and output.\n• Leveraged performance profiling tools to identify and resolve bottlenecks, achieving a **20%** improvement in application speed.\n• Collaborated with cross-functional teams to gather requirements and deliver software solutions that met business needs."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **C++** to develop high-performance components, implementing efficient **design patterns** to enhance maintainability and scalability of applications.\nConducted **unit testing** to ensure code quality and reliability, achieving a defect rate reduction by **20%**.\nParticipated actively in **Agile** development processes, contributing to sprint planning and retrospectives, leading to a **15%** improvement in delivery timelines.\nLeveraged **C#** with **Visual Studio** to create robust applications, ensuring seamless integration with **Windows APIs** for enhanced functionality.\nImplemented **GitHub Actions** for CI/CD pipelines, achieving a **30%** reduction in production deployment errors and increasing overall release efficiency.\nAdopted **Azure Pipelines** for automated testing processes, resulting in quicker feedback loops and improved code integration.\nCollaborated with cross-functional teams to gather requirements and deliver software solutions in line with business objectives, consistently meeting or exceeding project milestones.\nMentored junior developers in best practices, leading to a **25%** increase in team productivity and skill enhancement.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C++** and **C#** to develop and maintain high-performance software solutions, applying design patterns to enhance code quality.\nExecuted automated testing strategies to ensure software reliability and meet **unit testing** standards, resulting in a **30%** reduction in post-release defects.\nImplemented and optimized Agile methodologies for better project management, increasing team productivity by **25%**.\nConducted thorough code reviews with a focus on following established design patterns, ensuring adherence to best practices.\nLeveraged **Visual Studio** and **GitHub Actions** for streamlined development processes, enhancing version control and CI/CD pipelines.\nDeveloped applications using **Windows APIs**, improving system functionality and compatibility.\nCollaborated closely with cross-functional teams in an Agile environment to align development efforts with business objectives.\nParticipated in automated testing initiatives to boost testing coverage and effectiveness, contributing to a more robust codebase.\nEngaged in continuous integration and deployment using **Azure Pipelines**, facilitating faster delivery cycles and minimizing manual intervention.\nActively contributed to technical documentation, which improved knowledge sharing and onboarding processes within the team."
    }
  ],
  "skills": "**Programming Languages**\n\tC++, C#, Python, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tGit, GitHub, CI/CD pipelines, GitHub Actions, Azure Pipelines\n\n**Cloud & Infrastructure**\n\tAzure\n\n**Other**\n\tUnit Testing, Automated Testing, Design Patterns, Agile, UX/UI Design, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Microservices"
}