{
  "name": "Tomasz Lee",
  "role_name": "C++ Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "C++ Developer with 9+ years of experience in high-performance programming, specializing in **C++**, **STL**, **Boost**, and multithreading. Proficient in network programming and algorithms, with a strong knowledge of **PostgreSQL** and **MS SQL Server**, and operating systems including **Windows** and **Linux**. Additionally skilled in **C#** and **.NET**, bringing a comprehensive understanding of application development. Proven track record of delivering high-quality, efficient solutions and optimizing software performance while enhancing team collaboration and leadership in development projects.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "C++ Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **C++** for developing high-performance applications, ensuring efficient memory management and execution speed.\nImplemented multithreading techniques to enhance application responsiveness and performance in a multi-core environment, achieving a **50%** increase in processing speed.\nDeveloped algorithms for optimizing data processing tasks, improving operational efficiency by **30%**.\nWorked with **PostgreSQL** and **MS SQL Server** for database management, designing efficient schemas and queries to support application functionality.\nExecuted network programming strategies to enhance communication between distributed systems, leading to a **40%** improvement in data transfer rates.\nIntegrated **Boost** libraries to streamline development processes and enhance functionality across various modules.\nCollaborated with cross-functional teams to debug and optimize existing code, resulting in a **25%** reduction in application errors.\nConducted performance tuning of applications to utilize system resources effectively under both **Windows** and **Linux** environments, ensuring reliability and scalability.\nMaintained comprehensive documentation of software designs and architecture, ensuring seamless project transitions and knowledge sharing."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **C++** to optimize existing algorithms and enhance performance across various applications, resulting in a 20% increase in processing speed.\nDesigned efficient multithreading solutions to improve application responsiveness and resource management on both **Windows** and **Linux** environments.\nDeveloped robust network programming components to facilitate secure and efficient communication between distributed systems.\nWorked extensively with **PostgreSQL** and **MS SQL Server** databases, implementing complex queries and improving data retrieval times by 30%.\nApplied **Boost** libraries to streamline development processes and enhance application functionality with less code.\nCollaborated with cross-functional teams to identify and address system bottlenecks, leading to a 15% reduction in system downtime.\nConducted comprehensive code reviews focusing on STL best practices, contributing to the overall code quality and team knowledge enhancement.\nMentored junior developers on C++ standards and efficient code structuring, fostering professional growth and team cohesion.\nImplemented rigorous testing strategies to ensure high-quality deliverables and mitigate bugs in production environments.\nParticipated in Agile ceremonies, delivering work packages on average 10% ahead of schedule."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C++**, applying knowledge of **multithreading** and **network programming** to enhance system performance.  \nDeveloped and maintained applications using **C#** alongside **MS SQL Server** and **PostgreSQL**, ensuring data integrity and optimizing query performance by **30%**.  \nImplemented efficient algorithms to tackle complex problems, improving application runtimes by **15%**.  \nLeveraged **Boost** and **STL** libraries to create robust and reusable code components that streamlined development processes.  \nCollaborated on cross-platform applications between **Windows** and **Linux**, ensuring code portability and enhancing system compatibility.  \nParticipated in code reviews and technical discussions to uphold coding standards and best practices, increasing team productivity by **25%**.  \nContributed to the design of system architecture, focusing on scalable solutions that accommodate future growth.  \nDelivered comprehensive documentation for new features, facilitating better understanding and quicker onboarding for new team members."
    }
  ],
  "skills": "Programming Languages:\n\t**C++**, **C#**, **Python**, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\t**AWS**, **Azure**\n\n**Databases:**\n\t**PostgreSQL**, **MSSQL Server**, **MySQL**, **MongoDB**, **DynamoDB**, **CosmosDB**\n\n**DevOps:**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure:**\n\tWindows, Linux\n\n**Other:**\n\t**UX/UI Design**, Git, GitHub, **NUnit**, **xUnit**, **Selenium**, **Moq**, **Postman**, **Cypress**, **JMeter**, **Jest**, **Solidity**, **Ether.js**, **Web3.js**, **Ethereum**, **Apache Kafka**, **RabbitMQ**, **Redis**, **multithreading**, **network programming**, **algorithms**, Redux"
}