{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior Software Engineer with 13+ years of full-stack engineering experience, proficient in **Ruby on Rails**, **TypeScript**, **PostgreSQL**, **MySQL**, and **automated testing** frameworks. Adept at leveraging **Git**, **GitHub**, and **Docker** for version control and containerization, ensuring smooth deployment processes. Skilled in employing **GraphQL** and **JSON:API** for effective data interactions and utilizing **Tailwind CSS** for responsive design. \nExperienced in optimizing site performance through **technical SEO** strategies and continuously improving application efficiency. Demonstrated ability in leading collaboration efforts, providing mentorship, and fostering effective communication within teams. Additionally, I bring hands-on expertise in **AWS**, **Kubernetes**, **RabbitMQ**, and **Kafka**, enhancing the development of scalable systems in complex environments, with a proven track record of delivering high-performance applications across healthcare and financial sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and built full-stack applications leveraging **Ruby on Rails**, **PostgreSQL**, **MySQL**, and **GraphQL** to enhance site performance and maintainability.\n• Implemented automated testing strategies utilizing **unit testing** frameworks and tools such as **Jest**, **Cypress**, and **PyTest** to ensure high code quality and reliability.\n• Collaborated closely with cross-functional teams using **Git** and **GitHub** for version control, fostering effective communication and teamwork throughout the development process.\n• Developed responsive and visually appealing user interfaces employing **Stimulus**, **Turbo**, and **Tailwind CSS**, optimizing the overall site performance.\n• Created and managed CI/CD pipelines on **Docker** and **Kubernetes**, ensuring streamlined deployment processes and efficient orchestration of applications.\n• Enhanced data retrieval capabilities through the integration of **RabbitMQ** and **Kafka** for messaging and event streaming in a microservice architecture.\n• Conducted mentorship sessions for junior developers, sharing best practices in **full-stack engineering**, enabling skill development and knowledge transfer within the team.\n• Delivered customized features tailored to user needs leveraging **TypeScript** and JSON:API, ensuring clarity and maintainability of data exchanges.\n• Participated in code reviews and contributed to the advancement of the codebase's technical SEO strategies, promoting optimal search engine visibility.\n• Contributed to complex projects through effective collaboration and communication, solving problems efficiently and driving project success.\n• Successfully managed site performance optimization initiatives, achieving a **30%** reduction in load times and improved user satisfaction metrics.\n• Engaged in continuous professional development to stay updated on emerging technologies and industry trends, incorporating relevant advancements into existing projects."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Led full-stack engineering initiatives by architecting scalable web applications using **Ruby on Rails**, ensuring high performance and usability for users.\nUtilized **PostgreSQL** and **MySQL** to design and optimize database schemas, improving data retrieval speeds by **30%** and ensuring efficient data management.\nImplemented automated testing strategies, including unit testing and integration testing with tools such as **RSpec** and **Capybara**, enhancing code reliability and reducing bugs by **40%**.\nCollaborated with cross-functional teams to deliver projects on time, while mentoring junior developers and fostering a culture of knowledge sharing and collaboration.\nOptimized site performance through **technical SEO** techniques and **site performance optimization** best practices, resulting in a **25%** improvement in page load speeds.\nEmployed version control and code collaboration using **Git** and **GitHub** to streamline development processes and manage code revisions across projects, contributing to team efficiency.\nDeveloped and maintained responsive UI components using **Stimulus**, **Turbo**, and **Tailwind CSS**, delivering a seamless user experience across various devices.\nEstablished continuous integration and delivery pipelines leveraging **Docker** and **Kubernetes**, reducing deployment time by **50%** and increasing deployment frequency.\nEngaged in effective communication strategies to liaise with stakeholders and clarify project requirements, ensuring alignment and satisfaction throughout the software development lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed full-stack applications utilizing **Ruby on Rails** for backend and **Tailwind CSS** for frontend styling, ensuring high performance and user-friendly interfaces.\n• Collaborated effectively in cross-functional teams, promoting **Git** and **GitHub** for version control and facilitating smooth collaboration among team members.\n• Enhanced data management capabilities by integrating **PostgreSQL** and **MySQL** databases, optimizing queries that improved data retrieval speeds by **30%**.\n• Implemented automated and unit testing strategies, ensuring code quality and reliability, resulting in a **25%** reduction in production bugs.\n• Leveraged **Docker** and **Kubernetes** for containerization and orchestration, achieving consistent application deployment across different environments.\n• Demonstrated technical SEO principles to improve site performance, leading to a **40%** increase in organic search traffic.\n• Engineered real-time data features using **RabbitMQ** and **Kafka**, facilitating responsive user interactions and system communications.\n• Applied **TypeScript** and **Stimulus** to enhance client-side interactivity and performance, ensuring seamless user experiences with modern frameworks like **Turbo**.\n• Mentored junior developers, promoting best practices in coding and communication, fostering a culture of knowledge sharing and collaboration within the team.\n• Successfully led the implementation of APIs using **JSON:API** and **GraphQL**, streamlining data interactions and enhancing system efficiency.\n• Maintained high standards of security and compliance by executing effective role-based access control (RBAC) and implementing **AWS** cloud services for scalable solutions."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\tTypeScript\n\tRuby on Rails\n\n**Backend Frameworks:**\n\tRuby on Rails\n\n**Frontend Frameworks:**\n\tStimulus\n\tTurbo\n\tTailwind CSS\n\n**API Technologies:**\n\tJSON:API\n\tGraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tGit\n\n**Cloud & Infrastructure:**\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Other:**\n\tAutomated testing\n\tUnit testing\n\tRabbitMQ\n\tKafka\n\tTechnical SEO\n\tSite performance optimization\n\tCollaboration\n\tMentorship\n\tCommunication"
}