{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with 9+ years of experience specializing in **Node.js**, **JavaScript**, and **TypeScript** development for high-performance applications. Proficient in managing **APIs**, working with **Redis**, **MongoDB**, and **SQL** for efficient data management, and implementing robust testing methodologies including unit testing, integration testing, and load testing. Experience with cloud services such as **Google Cloud** and **Digital Ocean**, enhancing deployment and scalability. Strong background in **dev ops** practices, ensuring streamlined development and operational processes. Possesses excellent collaborative skills, leading cross-functional teams to deliver innovative solutions effectively while driving performance optimizations and ensuring high-quality standards.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Node.js** and **JavaScript** for backend development, significantly enhancing application performance.\nDesigned and developed scalable APIs, leveraging **TypeScript** for type safety and **MongoDB** for efficient data storage, improving access speed by **30%**.\nIntegrated **Redis** for caching solutions, resulting in a **35%** reduction in database load and improved response times.\nImplemented advanced testing strategies including unit testing, integration testing, and load testing to ensure high-quality software delivery.\nExecuted deployment pipelines using **Google Cloud** and **Digital Ocean**, enhancing deployment efficiency by **40%**.\nEngaged in dev ops practices, including CI/CD tools to streamline application updates and system reliability.\nCollaborated on implementing machine learning features for AI-driven analysis, utilizing modern tools and libraries.\nLed the migration of existing services to a microservices architecture, improving maintainability and scalability.\nWorked extensively with various databases, including **MongoDB** and **SQL**, ensuring optimal data retrieval and storage solutions.\nParticipated in performance tuning and optimization, achieving an average query execution time reduction of **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Node.js** and **JavaScript** to develop scalable applications, resulting in a **40%** enhancement in backend response times.\nDesigned and implemented robust **APIs** to support frontend components built in **TypeScript**, ensuring a seamless integration process.\nIntegrated **Redis** as a caching solution to optimize data retrieval speeds by up to **50%**, significantly improving overall system performance.\nManaged **MongoDB** as the primary database for handling large datasets, achieving a **30%** increase in data processing efficiency.\nConducted **unit testing**, **integration testing**, and **load testing** to ensure application reliability and performance metrics were consistently met across different environments.\nLeveraged **Google Cloud** and **Digital Ocean** for deploying scalable microservices, reducing downtime during updates by **20%**.\nOptimized SQL queries for both **MSSQL** and **MySQL** databases, leading to a **25%** improvement in data query efficiency.\nCollaborated with cross-functional teams to gather project requirements, ensuring stakeholders' expectations were consistently met.\nMentored junior developers in best practices for **dev ops**, improving their coding, and deployment skills over the course of **6** months.\nLed the successful transition of existing infrastructure to a **microservices architecture**, improving system resilience and reducing platform maintenance costs by **15%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Node.js** and **JavaScript** to develop scalable backend services, improving API response times by **30%**.\nImplemented **Redis** for caching customer session data, which led to a **40%** decrease in load times during high-traffic periods.\nDesigned and optimized **MongoDB** schema for efficient data storage, managing over **1 million** records while ensuring high performance.\nConducted comprehensive unit testing and integration testing to strengthen code quality and maintainability, achieving a **95%** code coverage.\nCollaborated with DevOps teams to orchestrate continuous integration and continuous deployment (CI/CD) on **Google Cloud** and **Digital Ocean**, reducing deployment times by **50%**.\nCreated and maintained RESTful APIs for seamless data interaction, enabling third-party integrations and accelerating feature rollout by **25%**.\nEngaged in load testing to ensure system reliability under heavy user load, contributing to a robust and scalable architecture.\nProvided mentorship and guidance on best practices in **TypeScript**, enhancing team productivity and code quality.\nContributed to the design and implementation of AI-driven solutions to improve user engagement and system intelligence.\nParticipated in daily Agile standups and sprint reviews to align development efforts with project goals and customer needs."
    }
  ],
  "skills": "  \n**Programming Languages**  \n\tJavaScript, TypeScript, Python  \n\n**Backend Frameworks**  \n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices  \n\n**Frontend Frameworks**  \n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS  \n\n**API Technologies**  \n\tRESTful API, GraphQL, APIs  \n\n**Serverless and Cloud Functions**  \n\tAWS, Azure, Google Cloud, Digital Ocean  \n\n**Databases**  \n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Redis, SQL  \n\n**DevOps**  \n\tCI/CD pipelines, dev ops, unit testing, integration testing, load testing  \n\n**Cloud & Infrastructure**  \n\tAWS, Azure, Google Cloud, Digital Ocean  \n\n**Other**  \n\tUX/UI Design, Git, GitHub, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Selenium, Moq, Postman, Cypress, JMeter, Jest, AI",
  "apply_company": "Noxx"
}