{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Entwickler für Teamcenter-Lösungen",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven **Entwickler für Teamcenter-Lösungen** with over 13 years of experience specializing in delivering high-performance solutions within healthcare and financial industries. Proficient in **Java**, **JavaScript**, **C**, **C++**, and skilled in Agile project methodologies and code versioning using effective issue tracking systems. Adept at developing enhancements and custom solutions within **Siemens Teamcenter** and **BMIDE** frameworks.\n\nLeverages a strong technical background in cloud-native architectures, having successfully deployed solutions on AWS and Azure, while also ensuring compliance with industry standards. Passionate about utilizing modern technologies to optimize workflows and create efficient **PLM-PDM** systems. Known for integrating innovative processes that enhance team collaboration and project execution.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Entwickler für Teamcenter-Lösungen",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and implemented **Siemens Teamcenter** solutions utilizing **Java**, **C** and **C++** to enhance product lifecycle management (PLM) and product data management (PDM) systems.\nExecuted Agile methodologies, adapting **Agile Projektmethoden** to drive project delivery, fostering iterative development and continuous improvement within the team environment.\nDesigned and maintained comprehensive documentation and version control processes through **Code-Visionierung** tools, ensuring seamless code management and collaboration across development teams.\nWorked collaboratively with cross-functional teams to leverage Issue Tracking Systeme for effective project management, tracking bugs, and enhancing overall development workflow efficiency.\nContributed to full-stack development incorporating **JavaScript** for dynamic front-end applications, ensuring user-friendly interfaces that align with Teamcenter solutions.\nParticipated in code reviews and shared knowledge of best practices in software development, ensuring high-quality code and adherence to coding standards.\nUtilized **Java** and **C++** to enhance existing functionalities in Teamcenter, resulting in improved system performance and user satisfaction metrics by **15%**.\nEmployed strategic planning and technical expertise to deliver project milestones on-time, leveraging team synergy and individual strengths to achieve **100%** project delivery rates within established timelines.\nImplemented unit testing and debugging processes, resulting in a **20%** reduction in post-deployment defects, ensuring robust application performance.\nCollaborated with stakeholders to gather requirements for enhancements and modifications in Teamcenter, aligning with business objectives and improving operational efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and optimized applications for **Siemens Teamcenter** using **Java** and **C++**, ensuring seamless integration with existing systems.\n- Collaborated in an **Agile** environment to deliver high-quality Teamcenter solutions, enhancing project efficiency by **15%** through iterative development and timely feedback.\n- Implemented version control strategies with **Git** for code management and collaboration, resulting in a **30%** reduction in deployment errors.\n- Assisted in the configuration and customization of **BMIDE** to facilitate effective Product Lifecycle Management (PLM) and Product Data Management (PDM) capabilities.\n- Utilized **JavaScript** for developing interactive user interfaces within Teamcenter, improving user engagement by **25%**.\n- Integrated **issue tracking systems** to streamline project workflows and enhance team collaboration, boosting productivity by **20%**.\n- Conducted code reviews and maintained code quality standards through continuous integration and testing practices, leading to a **40%** decrease in post-release defects."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and maintained applications for **Siemens Teamcenter**, utilizing **C**, **C++**, and **Java** to ensure robust operation and integration.\n- Collaborated on project management methodologies following **Agile** principles to drive timely and effective solution delivery.\n- Implemented **JavaScript** and **Java** frameworks for frontend interactivity, optimizing user experience in Teamcenter interfaces.\n- Utilized **BMIDE** to customize and extend functionality within Teamcenter, supporting improved product lifecycle management.\n- Managed version control using **Code-Versionierung** tools to ensure clean, traceable, and conflict-free code development.\n- Employed **Issue Tracking Systeme** to efficiently monitor and resolve development challenges, maintaining project momentum and quality standards.\n- Analyzed and optimized workflows within Teamcenter, improving efficiency and user satisfaction metrics by over **30%**.\n- Conducted code reviews and quality assurance testing to uphold coding standards and identify potential vulnerabilities, maintaining **100% compliance** with internal policies.\n- Trained team members on Teamcenter solutions and best practices, fostering a collaborative and informed development environment."
    }
  ],
  "skills": "  **Programming Languages:**\n\tC, C++, Java, JavaScript, Python, TypeScript\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n  **API Technologies:**\n\tOAuth2, JWT\n\n  **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n  **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n  **Other:**\n\tSiemens Teamcenter, BMIDE, PLM-PDM, Agile Projektmethoden, Code-Visionierung, Issue Tracking Systeme, Nginx, Let’s Encrypt, Certbot, MLflow, Airflow, Kubeflow"
}