{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic Senior Software Engineer with 13+ years of experience specializing in building scalable solutions using **Golang**, **SQL**, and **data warehousing**. Demonstrated expertise in integrating **Nats**, **Kafka**, and **blockchain** technologies, while designing and developing robust **APIs**. Adept in monitoring and optimizing applications utilizing **Prometheus** and **Grafana** within cloud environments such as **AWS**. Proven track record of employing agile methodologies to enhance productivity and ensure flexibility in team settings.\n\nOriginal strengths include delivering high-performance applications across healthcare and financial industries. Proficient in **JavaScript/TypeScript**, **Python**, and **Flutter** with hands-on experience in both frontend and backend technologies including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in developing AI/ML-powered platforms that leverage predictive analytics and automation, while adhering to compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Strong MLOps background, utilizing **MLflow**, **Airflow**, and **Kubeflow** for managing model lifecycle. Known for commitment to clean code practices, effective testing strategies, and exceptional communication and teamwork skills.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed backend services using **Golang** and **SQL** to create efficient APIs, ensuring clean code practices and high performance suitable for high-traffic applications.\n• Constructed robust data warehousing solutions that integrated with **Kafka** and **Nats** to handle large volumes of data for real-time processing and analytics.\n• Collaborated with cross-functional teams leveraging **agile** methodologies to deliver features on time, promoting strong **communication** and **teamwork** within project cycles.\n• Engineered smart contracts for blockchain applications utilizing **EVM** principles, ensuring secure transactions and compliance with **cryptography** standards.\n• Established monitoring systems using **Prometheus** and **Grafana** to maintain application reliability and performance, achieving a uptime rate of **99.9%**.\n• Integrated extensive testing frameworks for quality assurance, employing **testing** strategies across APIs and applications to ensure their functionality met and exceeded requirements.\n• Spearheaded the adoption of **Web3** technologies into existing platforms, enhancing system capabilities with decentralized solutions.\n• Implemented CI/CD pipelines that automated deployment processes across multiple environments, focusing on flexibility and organization in project management.\n• Maintained a self-motivated work ethic while managing project timelines, increasing team productivity by **25%** with streamlined workflows.\n• Promoted and enforced principles of clean code and organization in all programming practices, significantly reducing technical debt over a **6-month** period."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Golang** to develop scalable APIs, enhancing system integration and improving data workflows, achieving a 30% reduction in response time.\nImplemented **Kafka** for real-time data streaming and processing, facilitating a flexible architecture for high-volume transaction handling and reducing latency by **25%**.\nDesigned data warehousing solutions with **SQL** to optimize data storage and retrieval processes, improving data query performance by **40%**.\nCollaborated with cross-functional teams using Agile methodologies to deliver features on time, increasing team productivity and project delivery rates by **35%**.\nEmployed **Prometheus** and **Grafana** for monitoring and performance tuning of applications, leading to a **50%** decrease in downtime of critical systems.\nIntegrated **blockchain** technologies for enhanced data security and transparency in financial transactions, ensuring compliance with **EVM** standards.\nCreated and maintained clean and testable codebases, supporting continuous integration and deployment to enhance software quality and reduce defects by **20%**.\nExercised effective communication and teamwork skills to coordinate tasks efficiently and support organizational objectives, fostering a self-motivated and flexible work environment."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Golang** for backend service development, ensuring high performance and reliability in a fast-paced agile environment across various projects.\nDesigned and implemented data warehousing solutions using **SQL**, **PostgreSQL**, and **MongoDB**, achieving a **30%** increase in query efficiency for analytical reporting.\nEngineered a robust messaging architecture utilizing **Nats** and **Kafka** for asynchronous communication, enhancing service interaction and data processing speeds by **45%**.\nApplied advanced **API** design principles to create scalable, maintainable interfaces, increasing development speed by **25%** through clear documentation and automated testing practices.\nDeveloped monitoring and alerting systems using **Prometheus** and **Grafana**, which improved system uptime by identifying bottlenecks and reducing downtime to less than **5 hours per month**.\nImplemented blockchain technology principles and **EVM** compatibility for innovative feature development, enhancing security and transparency across transaction processes.\nCollaborated within cross-functional teams, maintaining strong communication, organization, and flexibility to adapt to changing project requirements while fostering a cohesive team environment.\nWrote clean, test-driven code to enhance software quality, incorporating unit and integration testing for all new features, achieving a **98%** passing rate in quality assurance testing.\nManaged secure data transactions with encryption protocols, applying standards from **cryptography** to ensure compliance with GDPR and protect sensitive customer information throughout the platform.\n"
    }
  ],
  "skills": "Programming Languages:\n\tGolang, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nats, Kafka, blockchain, EVM, Prometheus, Grafana, agile, clean code, testing, cryptography, Web3, communication, teamwork, flexibility, organization, self-motivated, Authentication & Security (Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot)",
  "apply_company": "Consensys"
}