{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior QA Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior QA Engineer with 10+ years of experience in ensuring high-quality software solutions within healthcare and finance sectors. Proven expertise in **API** testing, **test automation**, and **performance testing**, with a strong focus on **debugging** and maintaining data integrity in complex systems. Skilled in collaborating with development teams to assess and improve existing **backend** processes, ensuring robust **distributed systems** through effective problem-solving strategies. Experienced in both **batch** and **streaming data processing**, delivering real-world impact through efficient solutions. Proficient in utilizing CI/CD automation and embracing an autonomous work ethic for continuous improvement. Equipped with a comprehensive understanding of **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, and cloud environments including **Azure** and **AWS**, coupled with a passion for quality assurance and system performance.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and executed comprehensive **test automation** strategies for backend APIs, utilizing **QA** tools and methodologies to ensure data integrity and system performance.\n•\tConducted rigorous **performance testing** and **load testing** on distributed systems, ensuring robust response times and system reliability.\n•\tCollaborated with cross-functional teams to maintain high standards in **debugging** and **problem solving**, enhancing communication across development and testing environments.\n•\tDesigned and implemented automated test cases for scalable applications built with **Node.js**, **Python (FastAPI)**, and integrated with popular frameworks like **React** and **Next.js** to ensure seamless user interactions.\n•\tUtilized advanced **API** testing techniques to validate endpoints, covering data flow, functional behavior, and edge cases across at least **3 major projects**.\n•\tOversaw the integration of **streaming data processing** tools to facilitate real-time data validation and **batch data processing** for handling large data sets, ensuring optimal system performance under varied loads.\n•\tDeveloped customized dashboards to visualize testing metrics and enhance the tracking of project progress, utilizing tools like **Power BI Embedded** and **Chart.js**.\n•\tMaintained high standards in **test strategy development** using frameworks such as **Jest**, **Cypress**, and **Postman** to automate testing processes and ensure thorough coverage of both frontend and backend services.\n•\tEngaged in continuous improvement initiatives by applying **problem-solving** techniques and providing feedback on system architecture and performance to foster development best practices.\n•\tEnsured thorough documentation of the **test automation** process, facilitating knowledge sharing and redundancy reduction within the QA team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive **QA** practices for high-availability financial platforms, utilizing **API** testing methodologies to ensure system reliability and data integrity for transactions.\nExecuted **test automation** routines for backend services built on **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enabling faster deployment cycles and improved defect discovery rates by **30%**.\nPerformed rigorous **performance testing** and **load testing** on microservices, assessing the scalability and efficiency of high-volume transaction systems under simulated user loads exceeding **10,000 transactions** per minute.\nCollaborated with developers and product teams on debugging and problem-solving initiatives, effectively communicating issues and enhancements in a distributed systems environment.\nDesigned and maintained ETL pipelines utilizing **Apache Airflow** and **Azure Data Factory**, ensuring data quality and batch processing that handled **1TB** of financial data daily.\nEngaged in **streaming data processing** with **Kafka** and **RabbitMQ**, supporting real-time transaction analysis and alerts for over **50** different financial activities.\nDeveloped automated testing strategies integrating real-time operational features and analytics dashboards, enhancing the team’s autonomy and responsiveness to system changes while maintaining stringent data integrity standards."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Executed rigorous **QA** processes to ensure functionality and performance of backend services, employing testing strategies across distributed systems and cloud services.\nConducted thorough **API** testing for various services built on **FastAPI**, **Django**, **NestJS**, and **Express**, achieving a **95%** test coverage rate that enhanced reliability across the application.\nImplemented comprehensive **test automation** using tools like Selenium and Cypress, achieving a **30%** reduction in regression testing time while maintaining data integrity.\nDesigned and executed **performance testing** and **load testing** strategies to assess service reliability under peak loads, improving system throughput by **40%**.\nUtilized **streaming data processing** technologies such as **Kafka** and **RabbitMQ** in the development of real-time features, enabling accurate tracking of application performance metrics.\nCreated detailed documentation and reports highlighting testing outcomes, issues, and success metrics, fostering clear **communication** across cross-functional teams.\nDemonstrated strong **problem-solving** skills to quickly troubleshoot and debug issues in the development pipeline, leading to an improvement in deployment frequency by **50%**.\nExercised significant **autonomy** in prioritizing testing workflows and managing quality gates, successfully completing projects with minimal oversight.\nParticipated in collaborative team discussions to improve test strategies and methodologies, continuously enhancing the overall quality of the product delivered to end-users."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tQA, Test automation, Distributed systems, Streaming data processing, Batch data processing, Performance testing, Load testing, Data integrity, Debugging, Problem solving, Communication, Autonomy",
  "apply_company": "Square One Resources"
}