{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Quality Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a skilled Senior Quality Engineer with 8 years of experience, I have a strong command of **test automation** and **software testing** techniques, ensuring high-quality deliverables in automotive and healthcare applications. My technical proficiency includes **Python**, **Shell scripting**, and **Linux**, coupled with hands-on experience in using **Git** for version control. I am adept at utilizing **Pytest** and **Appium** for comprehensive testing strategies, including HIL testing and performance assessments.\n\nMy background in full stack development enables me to work effectively with technologies such as **React**, **Node.js**, and **FastAPI**, providing a unique perspective on application performance and robustness. I have successfully integrated testing frameworks in CI/CD pipelines to enhance product quality and deliverability. I possess a detail-oriented mindset and problem-solving skills that empower me to tackle complex testing scenarios independently while adhering to industry compliance standards. My experience using **QNX** for automotive applications further ensures that I bring a well-rounded approach to quality assurance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Quality Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented test automation strategies using **Appium** and **Pytest** to enhance software testing efficiency for both mobile applications on **Android** and web platforms.\n- Developed comprehensive software testing protocols for healthcare and financial applications, ensuring compliance with regulatory standards and high-quality deliverables.\n- Leveraged **Git** for version control in collaborative development environments, maintaining robust code management practices.\n- Performed rigorous HIL testing and validation on automotive systems utilizing **QNX**, ensuring system reliability and safety during deployment.\n- Executed Shell scripting tasks within **Linux** environments to optimize testing workflows and system performance.\n- Utilized problem-solving skills to identify and rectify software bugs, resulting in a **30% reduction** in critical issues during production.\n- Conducted independence in managing testing phases, from documentation to execution, ensuring smooth project deliveries under tight deadlines.\n- Designed and implemented testing frameworks that support regression and integration testing across multi-technology stacks and services.\n- Collaborated closely with software engineers and data scientists to drive quality improvements in machine learning and data-driven services.\n- Delivered detailed test reports and metrics tracking, improving project accountability and quality assurance processes by **25%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Implemented **test automation** frameworks using **Python** and **Pytest** to ensure software quality and reliability in automotive applications, enhancing testing efficiency by **30%**.\nExecuted **software testing** strategies for embedded systems, including **Android** and **QNX** platforms, improving bug detection rates by **25%**.\nUtilized **Shell scripting** for automating testing processes and report generation in a **Linux** environment, leading to a **40%** reduction in manual testing efforts.\nCollaborated with cross-functional teams to establish best practices for **Git** version control, ensuring a streamlined code review process and enhancing team productivity.\nConducted **HIL testing** for automotive systems over **CAN** and **Ethernet** protocols, successfully identifying critical system failures prior to deployment.\nDeveloped mobile application testing strategies using **Appium** for **Android** platforms, increasing test coverage and user satisfaction metrics.\nDemonstrated exceptional **problem-solving** skills while diagnosing and troubleshooting complex technical issues in real-time, often requiring independent research and innovative solutions.\nProduced comprehensive documentation for testing procedures and automated scripts, contributing to knowledge sharing within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Shell scripting** to develop and maintain test automation scripts, ensuring high standards of **software testing** across a variety of automotive applications, with a focus on **Android** and **QNX** environments.\nImplemented comprehensive test strategies using **Pytest** and **Appium**, successfully reducing testing time by **30%** and increasing defect detection rates by **20%** during cycles.\nManaged version control and collaborative code development through **Git**, fostering a seamless workflow within the testing team and promoting code reviews and best practices.\nConducted Hardware-in-the-Loop (**HIL**) testing setups and executed tests for **CAN** and **Ethernet** communication protocols, leading to robust product validations in real-world scenarios.\nEmployed **Linux** tools for efficient test environment setup and execution, enhancing test reliability and repeatability across **9+** devices.\nDemonstrated strong problem-solving skills by troubleshooting and resolving intricate testing issues independently, streamlining the testing processes to better meet project timelines.\nCollaborated with cross-functional teams, bringing independence and initiative to identify testing requirements and communicate critical feedback to improve software quality and performance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Shell scripting, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Ansible, Helm, Terraform, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\ttest automation, software testing, Git, Linux, Android, QNX, Android/ADB, Pytest, Appium, HIL testing, automotive, CAN, Ethernet, problem-solving, independence",
  "apply_company": "Unikie"
}