{
  "name": "Rei Taro",
  "role_name": "Senior Cloud Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Cloud Engineer with over 10 years of comprehensive experience in backend development and cloud infrastructure. Proficient in **Linux**, **Bash**, **PHP**, and **Python**, with expertise in creating high-performing systems and scalable cloud-native architectures leveraging **AWS** and **Azure**. Demonstrated ability in **Incident Management**, **Performance Tuning**, and **Software Security**, ensuring robust service delivery and efficient resource utilization. Skilled in technical documentation, networking, and database management, with a proven track record of delivering critical projects for leading organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Linux** and **Bash** scripting for automating cloud infrastructure management and system monitoring, leading to a reduction in manual intervention by **30%**.\nEngineered robust backend services in **Python** using **FastAPI** to optimize document automation, user onboarding, and reporting workflows, resulting in improved user satisfaction ratings by **25%**.\nDeveloped event-driven architectures with **Celery** and **Redis** for effective asynchronous processing, significantly improving the handling capacity of financial transaction requests by **40%**.\nDeployed scalable microservices on **Azure App Services** and utilized **Terraform** for infrastructure as code, enhancing deployment efficiency and reducing configuration errors by **15%**.\nCreated and maintained data pipelines for regulatory data exchange using **Apache Airflow** and **Azure Functions**, ensuring compliance with data regulations and facilitating timely data flow with a **99% uptime**.\nLed comprehensive security assessments, implementing **OAuth2** and **Azure AD B2C** to develop secure authentication systems, augmenting the overall software security framework.\nCollaborated effectively with cross-functional teams to address system integration challenges, ensuring compliance and overseeing release strategies with adherence to **SLA Management**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Leveraged **Python** and **FastAPI** to develop backend systems, automating document workflows and enhancing user onboarding processes for **9** clients.\n• Designed event-driven microservices utilizing **Celery** and **Redis**, improving the asynchronous processing of financial data and transaction requests by **30%**.\n• Managed the deployment of microservices on **Azure App Services**, implementing **Terraform** for infrastructure automation, leading to **99.9%** uptime across environments.\n• Engineered data pipelines ensuring secure exchange of regulatory data, utilizing **Apache Airflow** and **Azure Functions** to automate data workflows, increasing efficiency by **25%**.\n• Conducted security audits for compliance with industry standards, integrating **OAuth2** and **Azure AD B2C** to enhance authentication and secure access controls.\n• Collaborated with cross-functional teams to ensure system integration and regulatory compliance, successfully managing releases for **5** major updates."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed and maintained **cloud infrastructure** for trade execution, portfolio management, and account tracking utilizing **Python** and **PostgreSQL**, leading to a 30% increase in trading operation efficiency.\nImplemented and optimized server auditing tools within a **Linux** environment, enhancing system reliability and performance tuning by 25%.\nCreated **technical documentation** for all backend services, improving project transparency and onboarding processes for new team members by 40%.\nEngineered real-time price feed processors with **asyncio**, **WebSockets**, and **Redis**, ensuring delivery of trading data with a latency of less than **100ms** for high-frequency transactions.\nCollaborated with frontend teams to design and deliver REST APIs and WebSocket channels, improving user interaction and satisfaction ratings by 15%.\nEnsured compliance with industry regulations such as MiFID II and GDPR while adhering to strict internal **software security** protocols.\nImplemented comprehensive test suites using **PyTest**, **tox**, and mock servers, which streamlined QA processes and reduced bug reports by 20% across development cycles.\nIntroduced job queuing and scheduling solutions with **Celery** and **RabbitMQ**, resulting in a 35% improvement in backend task execution and process management efficiency."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, PHP, SQL, Bash\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure, Cloud Infrastructure\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Other**\n\tLinux, Networking, Server Auditing, Network Monitoring, Performance Tuning, Technical Documentation, Incident Management, SLA Management, Software Security, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow",
  "apply_company": "Jamf"
}