{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Sales Engineer with 9+ years of multifaceted experience in technical presentation and stakeholder management, leveraging strong skills in project management and customer orientation. Proven ability to articulate complex technical concepts to diverse audiences while aligning solutions with client needs. Adept in generating compelling proposals and managing the bidding process for electrotechnical systems. Skilled in collaborating with cross-functional teams to enhance client satisfaction and engineering excellence, with a solid background in **.NET**, **C#**, **ReactJS**, **NextJS**, and **cloud services**. Committed to delivering high-quality outcomes and driving successful project delivery.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Leveraged strong **Kundenorientierung** to deliver technical presentations, showcasing the benefits of customer management solutions to stakeholders.\n• Managed projects effectively, utilizing **Projektmanagement** skills to oversee the development and implementation of systems tailored to client needs.\n• Conducted detailed **Ausschreibung** processes for electrotechnical solutions, ensuring compliance with client specifications and enhancing sales opportunities.\n• Provided expert **Technisches Wissen** in electrotechnical systems, contributing to the design of innovative **Notbeleuchtungssysteme** that meet rigorous safety standards.\n• Engaged in **Stakeholder Management** to align technical developments with client expectations, facilitating smooth project execution and customer satisfaction.\n• Improved system scalability and maintainability through the design and development of a web-based platform using **.NET 7**, **ReactJS**, and **Next.js**, resulting in a **25%** increase in user satisfaction.\n• Built a microservices architecture with **.NET Core**, optimizing system performance and enabling future enhancements.\n• Enhanced system resilience by integrating **Apache Kafka** for real-time data streaming and **RabbitMQ** for task management, leading to significant throughput improvements.\n• Implemented **Redis** for effective caching, achieving a **35%** reduction in database load and enhanced response times.\n• Developed and integrated RESTful APIs using **.NET** connected to a **MongoDB** database for efficient data retrieval.\n• Streamlined deployment processes with CI/CD pipelines on **Azure DevOps**, leading to a **40%** reduction in deployment time.\n• Optimized **MSSQL** database query processing, reducing average execution times by **20%**.\n• Collaborated with UX/UI teams to refine the user interface, enhancing overall user experience.\n• Created a reporting engine utilizing **D3.js** and **Three.js** for engaging interactive data visualizations.\n• Ensured application security by implementing JWT-based authentication and authorization protocols."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Demonstrated **technical expertise** in electrotechnics and system design to effectively engage with clients and understand their requirements, enhancing **customer orientation**.\nExecuted project management strategies to oversee all stages of project development, ensuring alignment with client specifications and timely delivery.\nDelivered technical presentations to stakeholders, showcasing **lighting systems** and **facility systems**, leading to increased client interest and understanding of product solutions.\nManaged project documentation and **tender processes**, effectively communicating technical details to both technical and non-technical stakeholders, resulting in improved **stakeholder management**.\nUtilized in-depth **technical knowledge** to provide insights during the proposal phase, designing solutions that meet client needs and achieve project objectives.\nFostered a collaborative environment by engaging with cross-functional teams to streamline project execution, improving overall team productivity by **20%**.\nDeveloped custom solutions based on client feedback, leading to **30%** of clients reporting enhanced satisfaction with product offerings.\nConducted workshops and training sessions to educate clients on new products, effectively increasing engagement and ensuring successful project implementation.\nAnalyzed project performances and outcomes, using data-driven insights to refine strategies for future projects, contributing to a **15%** reduction in project overruns."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Demonstrated exceptional **Kundenorientierung** by effectively communicating technical product features to stakeholders and clients, leading to a satisfaction increase of **30%**.\nUtilized **Projektmanagement** methodologies to oversee the development process of electrotechnical proposals, ensuring adherence to client specifications and requirements.\nConducted technical presentations to diverse audiences, simplifying complex concepts related to **Notbeleuchtungssysteme** and enhancing stakeholder engagement.\nEngaged in **Stakeholder Management** to align project goals with customer expectations, successfully closing **5** significant product deals within a quarter.\nImplemented strategies for **Anlagensysteme**, enhancing system integration and functionality based on client feedback.\nCollaborated with cross-functional teams to streamline processes related to **Ausschreibung**, improving project turnaround times by **15%**.\nExercised in-depth **Technisches Wissen** to address and resolve client queries, leading to repeat business and referrals.\nDelivered impactful solutions by leveraging effective **Projektmanagement** techniques, resulting in project completion within budget and deadlines on **3** major initiatives.\nMaintained strong relationships with clients through constant follow-ups and support, boosting overall project success rates by **25%**."
    }
  ],
  "skills": "  **Programming Languages**\n\tJavaScript, TypeScript, C#, Python, Solidity\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tGit, GitHub\n\n  **Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, UX/UI Design, Electrotechnik, Notbeleuchtungssysteme, Ausschreibung, Anlagensysteme, Kundenorientierung, Technische Präsentation, Stakeholder Management, Projektmanagement, Technisches Wissen",
  "apply_company": "Eaton"
}