{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Frontend Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Frontend Developer with 13+ years of experience specializing in high-performance web applications in the healthcare and financial sectors. Proficient in **JavaScript**, **TypeScript**, **React**, **Vue**, and **AngularJS**, with a deep understanding of **REST APIs** and **JSON**. Experienced in optimizing frontend development using tools like **Webpack**, **Jest**, and performance best practices to enhance user experience.\nSkilled in version control with **Git** and proficient in native JavaScript concepts and libraries, ensuring code quality and performance. Committed to implementing secure code practices while maintaining compliance with industry standards. Strong analytical, mathematical, and problem-solving skills complement my capability to work both independently and collaboratively in team settings.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Frontend Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed interactive web applications using **JavaScript**, **TypeScript**, and **front-end frameworks** like **React (17-18)** and **Vue 3**, implementing best practices in **performance** and **security**.\n• Created responsive user interfaces with **HTML** and **JSON** ensuring seamless integration with **REST APIs** and **Websocket** communications.\n• Leveraged modern build tools like **Webpack** for efficient asset management and optimized load times, enhancing user experience.\n• Collaborated with back-end teams to design robust **REST APIs** and integrate with databases like **MySQL**, **MongoDB**, and **Redis** for dynamic data handling.\n• Engaged in CI/CD practices using **Git** and frameworks for efficient version control and deployment strategies.\n• Implemented testing strategies using **Jest** for unit testing and quality assurance, fostering a reliable product lifecycle.\n• Worked on performance enhancements through optimizations in **native JavaScript** and **three.js** for graphic-intensive applications.\n• Participated in agile project management and collaborative team efforts to produce high-quality deliverables under tight deadlines while maintaining strong **communication skills**.\n• Contributed to architectural discussions and design patterns for modular and maintainable codebases, emphasizing **object-oriented programming**.\n• Engaged in independent work to troubleshoot and resolve issues quickly, demonstrating strong **analytical skills** and a proactive approach in problem-solving."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed dynamic front-end applications leveraging **JavaScript**, **TypeScript**, **React (18)**, and **Vue 3** to ensure responsive user experiences across various financial tools and admin panels.\nUtilized **REST APIs** and **JSON** to effectively communicate with backend services, ensuring smooth data flow and integration.\nImplemented modular, reusable components through modern frameworks like **Next.js** and employing best practices in **HTML**, **CSS**, and **ECMAScript 6+**.\nCollaborated with product managers and designers, showcasing strong **communication skills** as a **team player**, to deliver intuitive and user-centered designs.\nConducted performance optimization techniques leading to a **30%** increase in loading times and enhanced overall user satisfaction.\nExecuted unit testing with **Jest** and regression tests, assuring code quality and reliability in production environments.\nParticipated in agile development processes, contributing ideas and enhancements that significantly improved code maintainability and project efficiency.\nMaintained version control using **Git** for efficient collaboration and deployment strategies, ensuring seamless integration with continuous deployment pipelines.\nDemonstrated independent work capabilities while managing multiple tasks and meeting tight deadlines, helping deliver projects on time and aligned with business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed dynamic single-page applications using **React (18)**, **Vue 3**, and **AngularJS**, ensuring responsive design and optimal user experience on web and mobile platforms.\nImplemented **REST APIs** for seamless integration between front-end and back-end services, facilitating efficient data exchange and enhancing overall application performance.\nUtilized **JavaScript** and **TypeScript** to create robust, scalable user interfaces, applying best practices in **object-oriented programming** and maintaining code quality with **Jest** testing framework.\nEnhanced application performance by leveraging **WebSockets** for real-time communication, improving responsiveness by **30%** in user interactions across core features.\nOptimized web applications for SEO and accessibility, adhering to **WCAG 2.1** compliance, ensuring that all users, including those with disabilities, can effectively navigate the e-commerce platform.\nCollaborated with cross-functional teams using **Git** for version control, maintaining **+50%** code efficiency through regular commits and collaborative code reviews.\nApplied **Docker** for containerization of development environments, streamlining the deployment process and reducing integration issues, which resulted in **40%** faster deployment cycles.\nLeveraged **MongoDB** and **MySQL** for efficient data retrieval and management, ensuring data consistency and high availability under **high traffic** conditions.\nImplemented secure transactions and payment workflows using **Stripe**, **PayPal**, and **Razorpay**, ensuring compliance with PCI standards and enhancing user trust and engagement.\nDemonstrated strong communication and analytical skills by collaborating as a team player and independently solving complex challenges in the development lifecycle."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, PHP, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Symfony\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, AngularJS, jQuery, Three.js\n\n**API Technologies:**\n\tREST APIs, JSON, web protocols\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tobject-oriented programming, performance, security, architecture, mathematics, geometry, 3D graphics, communication skills, analytical skills, team player, independent work"
}