{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in software development, specializing in designing and building AI-driven solutions and distributed systems. Proficient in **Python**, with hands-on expertise in developing applications using advanced technologies and frameworks, including **Go**, **C**, and **C++**. Adept at using **container runtimes** and **microVMs** for effective application deployment and sandboxing.\nExperienced in leveraging **JavaScript/TypeScript**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for developing high-performance applications in the healthcare and financial sectors. Skilled in implementing microservices, event-driven architectures, and CI/CD pipelines to enhance software delivery processes.\nStrong background in AI/ML, with a focus on predictive analytics and automation. Expertise in MLOps tools, including **MLflow** and **Airflow**, for model training and orchestration. Dedicated to compliance and quality, aligning development practices with HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and robust AI frameworks to develop intelligent features in applications, emphasizing distributed systems for enhanced performance in healthcare and fintech domains.\nEngineered full-stack platforms with solid knowledge of **Go**, **C**, and **C++**, integrating backend services with cutting-edge technologies and ensuring the systems meet high software development standards.\nDesigned and implemented microservices architectures, leveraging container runtimes such as **Docker** and orchestrating environments with **Kubernetes** for scalable and efficient deployments. \nDeveloped and maintained CI/CD pipelines utilizing **GitHub Actions** and **CircleCI**, ensuring automated testing and deployment across all environments, contributing to a **30%** reduction in time-to-market.\nCollaborated on the introduction of data-driven solutions using advanced analytics tools, ensuring real-time data processing capabilities and compliance with industry regulations.\nImplemented security best practices throughout the development process, maintaining high standards in software integrity and performance by integrating tools for sandboxing and monitoring.\nCreated advanced data visualization tools using **D3.js** and **Chart.js** to deliver actionable insights on financial activity and operational KPIs, enhancing decision-making processes.\nEngaged in continuous learning and adaptation of new programming paradigms and languages to keep pace with the evolving technology landscape in the software development industry.\nParticipated in rigorous testing protocols using **Jest** and **Cypress**, improving software reliability through comprehensive coverage, achieving an impressive **95%** code coverage on key components.\nWorked on the integration of search functionalities with **Azure Cognitive Search** and **Elasticsearch**, facilitating rapid querying across large datasets and enhancing user experience across applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed scalable microservices leveraging **Python**, supporting distributed systems and enhancing performance for high-volume transactional applications.\nImplemented container runtimes for deployment of applications, ensuring efficient resource utilization and smooth operations.\nLeveraged **Go** and **C/C++** for building performance-critical components, optimizing processing efficiency in software development.\nDesigned AI-driven features for predictive analytics, integrating machine learning techniques into financial services.\nModernized backend systems by utilizing event-driven architectures, enhancing responsiveness and reliability across transactions and compliance workflows.\nSpearheaded the transition to **microservices** architecture, resulting in a **30%** increase in system scalability and a **25%** reduction in downtime.\nFacilitated the successful deployment of ETL pipelines using **Python** and tools like **Apache Airflow**, ensuring efficient processing of financial data with a processing time decreased by **40%**.\nEmployed agile software development practices coupled with strong problem-solving skills to deliver high-quality software on time."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered robust backend services utilizing **Python** for high-performance applications, specific achievements include:\n- Designed and optimized services for a global e-commerce platform ensuring **99.9%** uptime across checkout, cart, and order fulfillment services.\n- Developed microservices architecture with a focus on **distributed systems**, achieving scalability and reducing latency by **30%**.\n\nImplemented AI-driven solutions to enhance e-commerce engagement through:\n- Leveraging machine learning models to personalize user experiences, yielding a **15%** increase in conversion rates.\n- Integrated AI capabilities using **TensorFlow** and **scikit-learn** to optimize product recommendations in real-time, processing over **100,000** user behaviors daily.\n\nEnhanced application performance and security implementing:\n- Role-based access control (RBAC) and **OAuth 2.0** to ensure full compliance with **GDPR** across all user interactions.\n- Secure payment processing workflows utilizing **Stripe** and **PayPal**, ensuring adherence to PCI compliance standards.\n\nUtilized cutting-edge technologies for efficient software development including:\n- Containerization with **Docker** for streamlined microservices development and deployment processes, reducing deployment times by **40%**.\n- Implemented real-time functionalities via **WebSockets** and event-driven architecture using **Kafka**, enabling instantaneous order updates and customer support functionalities.\n\nCreated high-quality front-end applications by applying:\n- Modern frameworks such as **React** (version **18**), **Vue 3**, and **Angular**, ensuring a mobile-first approach and responsive design for major e-commerce UIs.\n- Comprehensive SEO strategies and compliance with **WCAG 2.1** for enhanced accessibility and user engagement.\n\nConducted rigorous testing and deployment strategies:\n- Utilized feature flags via **LaunchDarkly** and conducted **blue-green deployments** to minimize downtime and ensure seamless updates in live environments, achieving a **95%** reduction in rollback incidents."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Go, C, C++, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tAI, distributed systems, container runtimes, microVMs, sandboxing, software development, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot",
  "apply_company": "poolside"
}