{
  "name": "Tomasz Lee",
  "role_name": "Senior DevOps Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior DevOps Engineer with 9+ years of experience leveraging advanced tools and practices, including **Kubernetes**, **Docker**, **AWS**, **Terraform**, and **Helm** to optimize and automate deployment processes. Proven expertise in cloud services, particularly **AWS** and **Azure**, ensuring secure and efficient operations. Deep understanding of **Continuous Delivery** and robust skills in **Git**, **ELK**, and **Grafana** for monitoring and performance analytics. Strong collaborative abilities that cultivate teamwork and lead projects to successful outcomes. Originally a .NET Full Stack Developer, skilled in **ReactJS**, **NextJS**, and **.NET** frameworks, bringing a comprehensive approach to the development lifecycle.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Implemented **Docker** containers and orchestration using **Kubernetes** for streamlined deployment and scalability of applications.\nLeveraged **AWS** services for cloud infrastructure management, ensuring high availability and resilience of services.\nConfigured and automated infrastructure provisioning with **Terraform**, leading to a 30% reduction in setup time for development environments.\nUtilized **Ansible** for configuration management and deployment automation, enhancing consistency across development, staging, and production environments.\nDeveloped CI/CD pipelines in **Azure DevOps**, achieving a **40%** reduction in lead time for deployments.\nMonitored application performance and logs with the **ELK** stack and **Grafana**, resulting in a **25%** improvement in response time identification and resolution.\nCollaborated effectively with product teams, enhancing team collaboration and project velocities by implementing iterative processes.\nConducted security analysis to identify and mitigate risks in cloud deployments, adhering to industry best practices.\nVersion-controlled project artifacts using **Git**, maintaining a clear history of changes for better team collaboration.\nCommunicated technical concepts in fluent English to cross-functional teams, facilitating better understanding and cooperation."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **AWS** and **Azure** services to deploy scalable applications, improving uptime by **20%**.\nImplemented **Docker** containers and **Kubernetes** orchestration for microservices, enhancing deployment consistency and managing traffic loads efficiently.\nAutomated infrastructure provisioning using **Terraform** and **Ansible**, reducing setup time by **40%**.\nEstablished CI/CD pipelines with **Git** and integrated **GitHub Actions**, achieving **30%** faster deployment cycles.\nConducted security analysis and implemented best practices in containerization to ensure compliance with industry standards.\nMonitored system performance using **Grafana** and logging with **ELK**, enabling proactive issue resolution and improved visibility.\nCollaborated with cross-functional teams to gather requirements and streamline DevOps practices, enhancing team collaboration by **15%**.\nFacilitated mentorship and training for junior engineers, fostering a culture of continuous learning and improvement within the team.\nLed efforts to implement robust backup and disaster recovery strategies, ensuring data integrity and minimizing downtime.\nEngaged in regular code reviews to improve quality and reduce vulnerabilities in the deployment process."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **AWS** and **Azure** for cloud services, enhancing system scalability and reliability, achieving a **30%** increase in uptime.\nImplemented **Docker** containers for application deployment, streamlining software delivery and reducing environment inconsistencies by **25%**.\nAutomated infrastructure management with **Terraform** and **Ansible**, resulting in consistent and repeatable deployments which decreased manual configuration errors by **40%**.\nEngaged in **Kubernetes** orchestration for container management, leading to more efficient resource utilization and improved application availability.\nDeveloped CI/CD pipelines with **Git** and **Helm**, accelerating release cycles and ensuring faster delivery of features by **50%**.\nMonitored application performance using **ELK** stack and **Grafana**, proactively identifying system bottlenecks and improving response times by **15%**.\nCollaborated with cross-functional teams to enhance team collaboration and communication, facilitating smoother project workflows.\nConducted security analysis and audits to strengthen system security measures against vulnerabilities, achieving compliance with industry standards.\nDelivered comprehensive technical documentation and facilitated knowledge sharing sessions in English, supporting team development and project onboarding."
    }
  ],
  "skills": "****Programming Languages****\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n****Backend Frameworks****\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n****Frontend Frameworks****\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n****API Technologies****\n\tRESTful API, GraphQL\n\n****Serverless and Cloud Functions****\n\tAWS, Azure, AWS Certification\n\n****Databases****\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n****DevOps****\n\tDocker, Kubernetes, Helm, Ansible, Terraform, CI/CD pipelines, Continuous Delivery, ELK, Grafana, Security Analysis, Team Collaboration\n\n****Cloud & Infrastructure****\n\tAWS, Azure\n\n****Other****\n\tUX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, English",
  "apply_company": "Deloitte"
}