{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Backend Engineer with over 10 years of experience in developing robust software solutions, focusing on back-end technologies and cloud-native applications. Proficient in **Python**, **Django**, **Flask**, **FastAPI**, and skilled in relational databases such as **PostgreSQL** and SQL. Expert in designing APIs, managing data migrations, and implementing schema design. Adept in **CI/CD** practices to ensure seamless integration and deployment of applications. Experienced in applying industry standards for secure and compliant solutions. Strong communication skills facilitate collaboration with cross-functional teams, enhancing project outcomes. Proven track record of leveraging modern frameworks and cloud services, including **AWS**, to create maintainable and efficient back-end systems.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Leveraged **Python** (FastAPI, Flask, Django) to design and implement robust backend services, ensuring high performance and maintainability in large-scale applications.\n• Developed and maintained **PostgreSQL** databases, focusing on efficient **schema design** and **data migrations**, enhancing data integrity and accessibility for critical business operations.\n• Implemented **CI/CD** pipelines using modern tools for automated testing and deployment, improving deployment frequency by **30%** and reducing lead time for changes.\n• Facilitated effective communication with cross-functional teams to define and document **APIs**, ensuring seamless integration between backend services and frontend applications.\n• Enhanced application security and performance by integrating caching strategies and optimizing database queries, resulting in a **25%** reduction in response times.\n• Collaborated with frontend teams to design scalable architecture, ensuring backend services supported rapid iteration and feature development.\n• Participated in code reviews to maintain high-quality coding standards and foster a culture of knowledge sharing across the engineering team.\n• Monitored and troubleshoot production systems, implementing best practices for reliability and uptime, achieving a service uptime of **99.9%**.\n• Maintained thorough documentation of backend services, leading to improved onboarding processes and knowledge transfer within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** with **FastAPI** and **Django** to develop robust back-end solutions, enhancing API responsiveness by **40%** and ensuring seamless data migrations and schema design.\nImplemented CI/CD pipelines to automate deployments, achieving **99%** uptime and reducing deployment time from several hours to **30 minutes** using tools such as **AWS**.\nDesigned and optimized PostgreSQL databases, leveraging **ORM** techniques to improve data retrieval speeds by **50%**, and enhancing overall system performance.\nCollaborated with cross-functional teams to define, document, and communicate API specifications, ensuring alignment with business and technical requirements.\nParticipated in code reviews and shared knowledge around best practices in back-end development, continuously improving code quality and system architecture.\nMaintained continuous communication with stakeholders to gather requirements and provide updates on project progress, fostering a transparent development environment.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** (including **FastAPI**, **Flask**, **Django**) to architect and optimize backend services for a global e-commerce platform, achieving **99.9%** uptime and scalable performance across critical modules like checkout and order fulfillment.\nDesigned and implemented robust **APIs**, ensuring seamless data migrations and efficient schema design, enhancing data retrieval speed by **30%** across various endpoints.\nExecuted CI/CD practices to streamline development workflows, enabling faster deployment cycles with **90%** reduction in time-to-production.\nCollaborated effectively with cross-functional teams to maintain clear communication channels, facilitating quicker decision-making processes and enabling real-time problem-solving.\nLeveraged **PostgreSQL** and **ORMs** for distributed data storage, ensuring reliable and fault-tolerant data access that supported **100,000** transactions per minute during peak loads.\nMonitored and optimized application performance, achieving a **50%** increase in application responsiveness through integration of caching strategies using Redis and optimized database queries.\nDesigned and executed back-end logic for data processing involving large datasets while ensuring adherence to data compliance standards such as GDPR.\nContributed to system design sessions focusing on enhancing system architecture and scalability solutions, leveraging best practices and industry standards."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS\n\n**Databases:**\n\tPostgreSQL, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Databases & Caching: MySQL (Healthcare), MongoDB (Gaming), Redis, data migrations, schema design, communication",
  "apply_company": "DualEntry"
}