{
  "name": "Tomasz Lee",
  "role_name": "Senior DFM Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior DFM Engineer with expertise in **manufacturing engineering**, **process optimization**, and **3D Printing**. Proven track record of successful collaboration across teams, emphasizing effective **communication** and **problem-solving** skills. Adaptable and committed to delivering innovative solutions that enhance efficiency in **sheet metal** design and production. Leveraging advanced skills in **SolidWorks** and GD&T to facilitate exceptional design processes and compliance with manufacturing standards, while focusing on maximizing productivity and quality in engineering projects.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior DFM Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Applied process optimization methodologies to enhance CNC and sheet metal fabrication processes, leading to a **15%** increase in productivity.\nCollaborated with cross-functional teams to address design challenges and improve manufacturing efficiency, fostering a collaborative environment that improved project outcomes by **20%**.\nUtilized **SolidWorks** for 3D modeling and design validation, ensuring adherence to GD&T standards and tight tolerances in product development.\nFacilitated communication between engineering and manufacturing teams to resolve production issues quickly, reducing rework time by **30%**.\nImplemented innovative 3D printing solutions for rapid prototyping, reducing lead times for new product introductions by **25%**.\nDeveloped documentation and training materials to improve team adaptability and problem-solving skills in manufacturing processes.\nConducted regular process reviews and simulations to identify areas for continuous improvement in manufacturing engineering practices."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **SolidWorks** to design and model CNC components and sheet metal parts, ensuring compliance with **GD&T** standards for high precision manufacturing.\nImplemented **3D Printing** techniques to prototype and validate designs quickly, resulting in a **20%** time reduction in the development cycle.\nOptimized manufacturing processes which led to a **15%** increase in production efficiency through continuous process optimization methodologies.\nFostered collaboration across cross-functional teams to identify and solve engineering challenges, enhancing project workflows.\nCommunicated effectively with stakeholders to define engineering requirements and project timelines, ensuring clarity and alignment.\nAdapted project strategies swiftly to address evolving project demands and technical challenges, demonstrating strong problem-solving skills.\nLed training sessions and workshops to develop team expertise in **manufacturing engineering**, improving overall team capabilities through knowledge sharing.\nConducted regular reviews of engineering processes to identify areas for improvement, resulting in a **10%** decline in production costs.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Utilized **SolidWorks** to design and optimize CNC and sheet metal components, enhancing manufacturability by **30%**.\n• Leveraged **GD&T** principles to ensure accuracy in manufacturing design specifications, reducing errors by **15%**.\n• Implemented process optimization strategies, resulting in a **25%** increase in production efficiency.\n• Collaborated with cross-functional teams to address design challenges, employing **problem-solving** skills to deliver innovative solutions.\n• Conducted thorough **3D Printing** evaluations to streamline prototyping processes, reducing lead times by **40%**.\n• Engaged in effective **communication** with manufacturing and engineering teams, ensuring alignment on project objectives and timelines.\n• Adapted to changing project requirements and priorities with agility, maintaining project momentum.\n• Developed comprehensive documentation for manufacturing processes and design changes, improving team collaboration and knowledge sharing.\n• Participated in regular design reviews and brainstorming sessions, fostering an environment of **collaboration** and continuous improvement."
    }
  ],
  "skills": "Programming Languages:\n\tCNC, Python\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tUX/UI Design, Git, GitHub, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, collaboration, problem-solving, communication, adaptability, manufacturing engineering, process optimization, sheet metal, 3D Printing, SolidWorks, GD&T",
  "apply_company": "Xometry"
}