{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cloud-Native Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Cloud-Native Engineer with 8 years of experience, I excel in **Kubernetes**, **Golang**, and **microservices architecture**, focusing on building robust and scalable cloud-native solutions. I am proficient in **containers** and have a strong grasp of **distributed systems**, ensuring high performance and reliability across applications. My expertise extends to **automation**, **testing**, and documentation, aligning with best practices and open-source methodologies to drive project success.\nAdditionally, I have extensive experience in the healthcare and financial sectors, leveraging technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**. I have led the development of enterprise-grade platforms with AI/ML capabilities, guiding teams in implementing **CI/CD** processes and utilizing cloud services including **Azure** and **AWS** to enhance operational efficiency. My commitment to team collaboration and customer engagement ensures that I deliver solutions that meet both technical and business requirements.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud-Native Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained **cloud-native** applications leveraging **Kubernetes** for orchestration and management of **microservices**, ensuring high availability and scalability.\n• Engineered scalable solutions using **containers** for rapid deployment across various environments, following **CNCF** best practices and open-source tools, fostering team collaboration and consistent documentation.\n• Implemented automation strategies to enhance development workflows, utilizing **Golang** for creating efficient backend services and improving system reliability across **distributed systems**.\n• Designed and executed comprehensive testing frameworks, covering unit, integration, and end-to-end tests, employing tools such as Jest and pytest, ensuring high-quality code and functionality.\n• Collaborated with cross-functional teams to enhance customer engagement and feedback loops, integrating user insights into developmental phases for improved product alignment.\n• Contributed to robust project documentation and technical guides, supporting team knowledge sharing and onboarding processes, ensuring the team follows best practices in **cloud-native** development.\n• Streamlined CI/CD processes using automation tools, reducing deployment times by **30%**, and minimizing downtime during updates through effective integration strategies.\n• Utilized advanced **developer tools** to monitor application performance, establishing proactive measures that improved system scalability by **25%**.\n• Spearheaded the migration of legacy systems to **microservices** architectures, achieving a **40%** reduction in maintenance costs and increasing modularity across the application stack.\n• Played a key role in team collaboration sessions, fostering an environment of innovation and continuous improvement towards achieving project objectives in alignment with customer needs."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Adopted **Cloud-native** technologies by leading the development of microservices-based financial platforms utilizing **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability and throughput for high-volume transaction systems with a throughput increase of **40%**.\nEngineered **Containers** and orchestrated application deployments within **Kubernetes** environments, ensuring seamless scalability and maintainability for multiple services across teams.\nDeveloped and maintained **distributed systems** to support real-time analytics, integrating **Kafka**, **RabbitMQ**, and **Azure Service Bus** for efficient event-driven communication.\nDesigned dynamic, user-focused applications utilizing **React** (18), **Vue 3**, and **Next.js** with a focus on hybrid cloud deployment, resulting in a **30%** reduction in user loading times.\nExecuted robust automation strategies for CI/CD pipelines using tools like **GitHub Actions** and **Jenkins**, successfully improving deployment frequency by **50%**.\nCollaborated effectively within cross-functional teams to enhance customer engagement and ensure the alignment of technology with business objectives, leading to a **25%** improvement in customer satisfaction scores.\nConducted comprehensive testing and documentation practices for all cloud-native applications and services to maintain high standards of quality and performance.\nChampioned open-source facilitation and contributions, fostering community engagement and collaboration in the development of external tools and libraries for financial applications."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Kubernetes** for managing containerized applications, facilitating seamless deployment and scaling of microservices within a cloud-native platform.\nDeveloped and maintained distributed systems architecture using **Golang**, enabling high performance and efficient state management for critical applications.\nOptimized automation processes for CI/CD pipelines using industry-standard developer tools, improving deployment speed by **30%** and reducing manual intervention significantly.\nCollaborated with cross-functional teams to enhance documentation practices, ensuring clarity in processes and fostering effective team collaboration for project success.\nImplemented comprehensive testing strategies, including unit, integration, and end-to-end tests, improving code quality and reducing bugs by **40%**.\nDesigned container strategies using **Docker** for application deployment, leading to a reduction in time-to-market by **25%** and enhanced scalability of cloud-native services.\nEngaged with the open-source community to contribute to and leverage CNCF projects, enhancing software quality and staying up-to-date with industry trends.\nFocused on customer engagement through tailored microservices, directly improving user satisfaction ratings by **15%** through responsive features and enhancements.\nContinuously monitored and fine-tuned cloud-native applications, ensuring optimal performance and reliability in alignment with established KPIs and SLAs."
    }
  ],
  "skills": "**Programming Languages:**\n\tGolang, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Microservices, Containers, Cloud-native, CNCF, Developer tools, Distributed systems, Open source, Automation, Testing, Documentation, Team collaboration, Customer engagement",
  "apply_company": "vCluster"
}