{
  "name": "Rei Taro",
  "role_name": "Senior Java Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Java Engineer with over 10 years of robust experience in designing and delivering scalable backend systems focused on microservices and event-driven architectures. Proficient in **Java**, **Spring**, and adept in **JavaScript** and **TypeScript**, leveraging **ReactJS** and **Redux** for frontend integration. Expertise in DevOps practices, including **CI/CD**, ensuring seamless deployment and integration across cloud environments. Demonstrated success in developing high-performing APIs and automation tools, with a strong foundation in cloud technologies. Proven track record of driving impactful projects across leading organizations, enhancing operational efficiency and delivering customer value.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Leveraged **Java** with **Spring** framework to engineer robust backend services, enhancing document automation, user onboarding, and reporting workflows.\nImplemented **event-driven** architectures using **Java** with **ReactJS** and **Typescript** for real-time user engagement in application interfaces.\nUtilized **CI/CD** practices to ensure streamlined deployment processes across **microservices** hosted on cloud environments, improving release cycles by **30%**.\nIntegrated **low-code** and **no-code** solutions for rapid application development, allowing faster iteration on project features without compromising quality.\nDeveloped RESTful APIs to facilitate smooth data exchange in financial transactions, processing over **9,000** transaction requests daily with minimal latency.\nCollaborated with cross-functional teams to tackle complex integration challenges, adhering to compliance standards and refining release strategies, leading to a **50%** reduction in system downtime.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "- Developed robust backend systems using **Java** and **Spring** to enhance application performance and optimize user journeys.\n- Engineered event-driven microservices architecture to enable seamless processing of transactions, utilizing industry best practices in scalable design.\n- Implemented CI/CD pipelines to automate build and deployment processes, ensuring rapid delivery while maintaining high quality standards.\n- Collaborated with cross-functional teams to incorporate **DevOps** practices, improving operational efficiency by **30%** through streamlined workflows.\n- Designed interactive user interfaces with **JavaScript**, **TypeScript**, and **ReactJS**, leading to improved user engagement by **25%**.\n- Employed **cloud** technologies to deploy applications, ensuring high availability and reliability, reducing downtime by **15%**.\n- Championed the integration of low-code/no-code solutions to accelerate development timelines, achieving project deliverables **2 months** ahead of schedule.\n- Leveraged **Redux** and **Context API** for state management in frontend applications, enhancing application responsiveness and user experience."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed robust **Java** applications utilizing **Spring** framework to enhance backend services for trade execution and portfolio management.\n• Engineered **microservices** architectures to boost scalability and performance of the platform by implementing **event-driven** system approaches.\n• Collaborated with frontend teams using **JavaScript**, **ReactJS**, and **Typescript** to design and integrate user-friendly interfaces, ensuring seamless data exchange through REST APIs.\n• Established CI/CD pipelines using **DevOps** practices to automate deployments and improve development cycles, achieving a deployment frequency of over **10 times** a month.\n• Implemented cloud solutions to facilitate deployment and scaling of applications, achieving an application uptime of **99.9%**.\n• Optimized business logic with **domain-driven** design practices, ensuring efficient task processing and high reliability.\n• Conducted regular code reviews and maintained documentation to uphold coding standards, enhancing team collaboration and project transparency.\n• Integrated real-time data feeds into the platform while ensuring compliance with regulations like MiFID II and GDPR, thereby mitigating risks.\n• Created and maintained comprehensive unit and integration tests, achieving over **80%** code coverage with tools like **JUnit** and **Mockito**."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, Python (3.8+), SQL, Bash, JavaScript, Typescript\n\n**Backend Frameworks**\n\tSpring, FastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tReactJS, Redux, Context API\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices, event-driven, domain-driven\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tcloud\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, low-code, no-code, Kafka, PyTest, Git",
  "apply_company": "AgileEngine"
}