{
  "name": "Damian Franciszek Pospiech",
  "role_name": "AI/ML Engineer – Agentic Systems",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "AI/ML Engineer with 13+ years of experience in developing production-grade **AI/ML systems** that enhance **agentic systems** and drive **LLM-powered automation**. Proficient in **Python** and experienced in creating robust **data pipelines** and scalable **APIs integration**. Skilled in deploying cloud solutions using **AWS** and managing infrastructure with **Terraform**. Expertise in implementing CI/CD pipelines with **GitLab CI** to ensure robust and compliant deployment processes. Proven ability to align development efforts with compliance standards, including HIPAA and PCI DSS, while focusing on feature roadmap development and achieving optimal scalability. Strong background in utilizing full-stack development technologies such as **React**, **Node.js**, and **Django**, with hands-on experience in building high-performance applications in healthcare and financial sectors, leveraging advanced **predictive analytics** and automation technologies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "AI/ML Engineer – Agentic Systems",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Displayed expertise in **Python** for developing production-grade AI/ML systems integrated with modern **APIs** to enhance operational efficiency.\nEngineered data pipelines ensuring **scalability** and **robustness** of services deployed on platforms like **AWS**.\nLeveraged **Terraform** to manage infrastructure provisioning, enhancing deployment consistency in cloud environments across **9** distinct projects.\nUtilized **GitLab CI** for streamlined continuous integration processes, boosting the deployment speed by **40%** and reducing errors in production.\nDesigned and implemented LLM-powered automation solutions that facilitated features roadmap development for client projects, improving functionality by **25%**.\nBuilt comprehensive monitoring solutions using advanced logging and alerting frameworks ensuring compliance with industry standards and regulations.\nOptimized existing systems in terms of performance and compliance, successfully migrating **5** large-scale on-premise applications to cloud-native architectures.\nCollaborated closely with cross-functional teams to integrate agentic systems into legacy applications, driving efficiency improvements and user engagement.\nEngaged in delivering data-driven decision-making tools using internal analytics dashboards, leading to an increase in actionable insights by **30%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to develop production-grade AI/ML systems for fraud detection, enabling proactive detection of suspicious activity based on user behavior and transaction patterns.\nDesigned and maintained **data pipelines** for ingesting financial data from internal and third-party sources using **Apache Airflow** and **Azure Data Factory**, ensuring both batch and real-time processing efficiency.\nIntegrated APIs across systems to deliver seamless support for **agentic systems**, enhancing operational capabilities and compliance with industry standards.\nImplemented **Terraform** for infrastructure as code (IaC) to streamline the deployment and management of machine learning environments, improving the scalability and robustness of deployed solutions.\nDeveloped and deployed **LLM-powered automation** solutions that align with financial feature roadmap development, ensuring systematic upgrades with a focus on compliance and performance.\nBuilt interactive front-end components with **React (18)** and **Next.js**, leveraging **TypeScript** and **Redux Toolkit** to enhance user experience in financial applications.\nExecuted analytics dashboards with **D3.js** and **Power BI Embedded**, enabling operations teams to quickly visualize and act on transaction anomalies, leading to a **30%** reduction in incident response times.\nDesigned an event-driven architecture using **Kafka**, ensuring asynchronous communication within workflows such as payments and alerts, which improved processing speed by **25%**.\nCollaborated with cross-functional teams to create a feature roadmap, guiding the development of machine learning models and infrastructure requirements, resulting in seamless project deliveries."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed **production-grade AI/ML systems** leveraging **Python** and advanced libraries, ensuring compliance with regulatory standards and robustness in deployments across **AWS** infrastructure.\n- Engineered scalable **data pipelines** integrated with various APIs to support **LLM-powered automation**, enhancing data processing efficiency by **30%**.\n- Collaborated in the development of feature roadmaps utilizing **GitLab CI** for continuous integration, improving deployment frequency by **50%**.\n- Designed resilient backend services optimized for resource allocation on **AWS**, providing high availability and low latency for a global user base.\n- Implemented agentic systems integrating real-time behavioral data to improve user experience and conversion rates, showcasing advanced analytic capabilities.\n- Conducted regular audits and updates of deployed systems to ensure **compliance** with **GDPR** and other data protection regulations, fostering trust and security for users.\n- Utilized **Terraform** for infrastructure as code (IaC) deployment in AWS, enabling repeatable and efficient provisioning of resources with a reduction in manual configuration errors by **40%**.\n- Collaborated on the integration of **APIs** to enhance system interoperability, ensuring smooth data flow and operational efficiency across applications.\n- Maintained robust version control and documentation practices to support agile development processes, resulting in enhanced team collaboration and delivery speeds."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tAPIs integration\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, LLM-powered automation, agentic systems, data pipelines, production-grade AI/ML systems, scalability, compliance, robustness, feature roadmap development"
}