{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior R&D Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior R&D Engineer with 8 years of experience, adept in developing advanced solutions utilizing **C++**, **C**, and **GIT**. Skilled in **STM32** development and **MFC** for creating robust applications in embedded systems, ensuring optimal performance through effective **electronics design**. Proven ability in problem-solving and communication within cross-functional teams to drive project success.\nIn addition to core technical skills, I leverage my background in full-stack development, including **JavaScript**, **TypeScript**, **Python**, and **Flutter**, contributing to solutions that integrate AI/ML capabilities for enhanced predictive analytics. My experience includes utilizing cloud platforms like **Azure** and **AWS**, implementing microservices architecture, and driving CI/CD automation for efficiency. Committed to maintaining compliance with industry standards such as HIPAA and PCI DSS while delivering high-quality, secure applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior R&D Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C++** and **C** programming languages to develop and enhance firmware for embedded systems, ensuring high reliability and performance in electronic designs.\nEmployed **GIT** for version control and collaboration, managing multiple branches and releases effectively across diverse development teams, ensuring smooth workflow and continuous integration.\nLeveraged **MFC** (Microsoft Foundation Classes) for designing user interfaces, creating responsive applications that enhance user interaction and accessibility.\nApplied strong communication skills to articulate complex technical concepts and collaborate with cross-functional teams, ensuring alignment on project objectives and outcomes.\nDemonstrated exceptional problem-solving abilities by addressing challenging design issues and implementing innovative solutions, reducing time-to-market by **20%**.\nDesigned and validated embedded system prototypes utilizing **STM32** microcontrollers, achieving functionality and performance metrics that meet industry standards.\nConducted rigorous testing and debugging processes to ensure all electronic designs meet specified requirements, leading to a **30%** reduction in post-deployment issues.\nActively attended and participated in engineering reviews, contributing expertise in electronics design and fostering a collaborative environment for project success.\nTrained junior engineers on best practices in embedded systems development, enhancing team skill sets and knowledge sharing across projects.\nInitiated and led projects focused on the optimization of existing electronic systems, resulting in a **15%** increase in overall system efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Applied advanced problem-solving skills in the design and development of innovative systems, utilizing **C++** and **C** programming languages to enhance product functionalities in the electronics domain.\nUtilized **GIT** for version control, managing code changes and collaboration effectively across **5** interdisciplinary teams to ensure seamless integration of new features and bug fixes.\nEngaged in electronics design practices, particularly focusing on **STM32** microcontrollers, leading to a **30%** reduction in development time for new prototypes through streamlined processes.\nFacilitated effective communication across various departments, ensuring that project milestones were met and stakeholder feedback was incorporated promptly, improving project turnaround times by **25%**.\nDeveloped and tested communication protocols for embedded systems, enhancing interoperability and reducing integration complexities in multi-platform environments.\nMaintained comprehensive documentation of design decisions, software architectures, and circuit schematics, ensuring high standards of clarity and maintainability for future engineers.\nLed problem-solving initiatives within R&D projects, fostering an innovative culture that generated **10+** new product ideas per quarter, directly contributing to the strategic growth of the organization."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **C++** and **C** programming languages for developing high-performance applications, optimizing resource allocation and memory management in embedded systems.\nUtilized **GIT** for version control, enabling robust collaboration and efficient tracking of project changes across multiple development teams, improving deployment time by **20%**.\nDesigned and implemented highly reliable communication protocols to interface with **STM32** microcontrollers, enhancing system stability in electronics design by reducing error rates by **15%**.\nEngaged in problem-solving methodologies to troubleshoot and resolve complex system issues, promoting innovation and enhancing product efficiency in R&D projects.\nConducted electronics design evaluations, ensuring all components meet specifications and compliance requirements while decreasing production costs by **10%**.\nCreated comprehensive documentation for projects and systems, enabling better knowledge transfer and streamlined onboarding processes for new team members, increasing team productivity by **25%**.\nCollaborated with cross-functional teams to implement changes and gather feedback, fostering a culture of continuous improvement and responsiveness to market demands.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tC++, C, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, Let’s Encrypt, Nginx, Certbot, electronics design, communication, problem solving",
  "apply_company": "Kingspan Light + Air"
}