{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Modern C++ Software Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Modern C++ Software Developer with 13+ years of experience in delivering high-performance applications, particularly within the healthcare and financial sectors. Expert in **C++ 20** and **Boost.Asio**, with a strong focus on **asynchronous programming**, **unit testing**, and **UML design**. Demonstrated proficiency in implementing **design patterns** and adhering to **object-oriented principles** to create robust software solutions.\nProficient in utilizing the **FIX protocol** and the **MetaTrader API** for financial applications, ensuring swift and effective communication in trading environments. Adept in **profiling** and advanced **problem-solving** techniques, coupled with a proven ability for **troubleshooting** complex issues.\nStrong interpersonal and communication skills enhance team collaboration, while a self-starter attitude drives project success. Additionally, experienced in building **AI/ML-powered platforms** and deploying cloud-native systems on **AWS** and **Azure**, leveraging skills in **microservices**, **event-driven architectures**, and CI/CD practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Modern C++ Software Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **C++ 20** and **Boost.Asio** to develop high-performance applications, focusing on **asynchronous programming** and effective **unit testing** practices to ensure code quality and reliability.\nUtilized **UML design** principles in the architecture of software components, applying **design patterns** and **object-oriented principles** for clean, maintainable code structures.\nImplemented the **FIX protocol** and integrated with the **MetaTrader API** to facilitate real-time trading solutions, achieving transaction speeds within **100 ms**.\nConducted rigorous **profiling** and performance optimization, resulting in a **20% reduction** in system resource usage and improved application response times.\nDemonstrated strong **problem-solving** and **troubleshooting** skills by swiftly resolving technical issues and debugging complex systems to enhance stability.\nEngaged in continuous communication and collaboration with cross-functional teams to gather requirements and provide updates, showcasing excellent **interpersonal skills**.\nFunctioned as a proactive self-starter, leading projects independently and driving innovation within the team to meet strategic objectives in the software development lifecycle."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **C++ 20** and **Boost.Asio** to develop high-performance financial applications that leverage asynchronous programming techniques, enhancing responsiveness and user experience in a multi-threaded environment.\nImplemented unit testing strategies to ensure reliability and stability across various modules, contributing to a **30%** reduction in post-deployment defects.\nApplied object-oriented principles and design patterns to architect scalable and maintainable solutions, leading to improved team collaboration and code quality across projects.\nEngaged in detailed problem-solving and troubleshooting to quickly address system issues, reducing downtime during peak trading hours by **25%**.\nEmployed UML design methodologies to create clear software documentation, facilitating better communication and understanding between cross-functional teams and stakeholders.\nIntegrated **FIX protocol** and **MetaTrader API** for seamless trading operations, enhancing system interoperability and transaction efficiency.\nConducted performance profiling to optimize application runtime and memory management, resulting in a **15%** increase in processing speed for financial transactions.\nDemonstrated strong interpersonal skills and self-starter attitude, contributing to a collaborative team environment that fosters innovation and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and implemented asynchronous programming solutions using **C++ 20** and **Boost.Asio**, ensuring efficient communication with external services and optimizing system responsiveness.\n- Conducted unit testing to validate code quality and functionality, utilizing best practices in software development to maintain high standards of reliability.\n- Designed robust UML diagrams for system architecture, enhancing team collaboration and understanding of project specifications across the development lifecycle.\n- Integrated **FIX protocol** and the **MetaTrader API** for financial data communication, enabling accurate trading operations and data analysis in compliance with industry standards.\n- Employed profiling techniques to identify performance bottlenecks in code, leading to performance improvements of up to **30%** in critical system components.\n- Applied object-oriented principles and design patterns to build scalable and maintainable software solutions, facilitating efficient code reusability and modular design.\n- Engaged in troubleshooting complex issues, employing strong problem-solving skills to rapidly identify and resolve software bugs and inefficiencies.\n- Maintained effective communication and interpersonal skills to collaborate with cross-functional teams, ensuring alignment with project goals and timely delivery of features.\n- Demonstrated self-starter ability by proactively identifying opportunities for process improvement and driving initiatives that enhance development efficiency."
    }
  ],
  "skills": "Programming Languages:\n\tC++ 20, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tFIX protocol, MetaTrader API\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, unit testing, asynchronous programming, UML design, object-oriented principles, design patterns, problem-solving, troubleshooting, communication, interpersonal skills, self-starter, profiling"
}