{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior DevOps Engineer with 8 years of experience in harnessing modern cloud technologies including **GCP**, **Kubernetes**, **Docker**, **Terraform**, and **Jenkins** to drive efficient and scalable infrastructure solutions. Proficient in scripting with **Bash** and leveraging data stores such as **Mongo**, **PostgreSQL**, and **Redis** to optimize performance in cloud environments. I am skilled in collaboration and incident management practices, ensuring high availability and reliability of services while aligning with best practices in **SRE**.\n\nAdditionally, I possess a strong foundation in **Python** development and have experience with Agile methodologies. My background includes utilizing **Grafana** and **Google Cloud Monitoring** for proactive monitoring and troubleshooting. I have led teams to implement CI/CD pipelines, enhancing deployment efficiency and reliability across various projects.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented enterprise-level DevOps practices using **Docker**, **Kubernetes**, and **Jenkins** to ensure scalable and reliable deployment across cloud environments, achieving a **95%** uptime.\nUtilized **Terraform** and **Bash** scripting for infrastructure as code (IaC) to automate cloud resource provisioning on **GCP**, facilitating faster deployments and resource management.\nDeveloped monitoring solutions with **Grafana** and **Google Cloud Monitoring** to maintain system health and performance analytics, reducing incident response time by **30%**.\nCollaborated effectively within an **Agile** framework to optimize team workflows and enhance project delivery timelines, increasing productivity by **25%**.\nLed incident management processes ensuring timely resolution and post-mortem analysis to drive continuous improvement in operational reliability.\nManaged databases such as **MongoDB**, **PostgreSQL**, and **Redis**, implementing automated backup strategies and optimizing query performance for large datasets, resulting in a **40%** increase in data retrieval efficiency.\nArchitected and developed scalable applications employing **Python** and integrated CI/CD pipelines using Jenkins for seamless code integration and deployment.\nFostered collaboration with cross-functional teams to enhance system architecture and security, ensuring compliance with industry standards.\nExecuted site reliability engineering (SRE) principles to ensure high availability and performance across production environments, actively contributing to system resilience and fault tolerance."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **GCP** and **Kubernetes** for deploying and managing scalable applications, ensuring high availability and performance for service delivery.\nImplemented **Docker** containers to streamline application deployment processes, reducing operational overhead by **40%**.\nAutomated infrastructure provisioning with **Terraform**, resulting in reduced setup time by **60%** and increased infrastructure consistency.\nDeveloped and maintained CI/CD pipelines using **Jenkins**, facilitating seamless integration and delivery of applications across different environments.\nUtilized **Bash** scripting to automate routine tasks and enhance system performance, improving efficiency by **25%**.\nManaged databases such as **MongoDB**, **PostgreSQL**, and **Redis**, ensuring data integrity and optimized access for high-demand applications.\nLed the migration of legacy systems to **cloud-based architectures**, enabling greater scalability and cost savings of up to **30%** per annum.\nCollaborated with cross-functional teams to streamline incident management processes, enhancing resolution times and team efficiency.\nImplemented monitoring solutions using **Grafana** and **Google Cloud Monitoring**, leading to improved system observability and quicker identification of performance bottlenecks.\nAdopted **Agile** methodologies to promote rapid development cycles and foster a culture of collaboration and continuous improvement among teams."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented and maintained **GCP** infrastructure, supporting **Kubernetes** orchestration for containerized applications, ensuring smooth deployment and scaling of services in a microservices architecture.\nDeveloped CI/CD pipelines using **Jenkins** to automate testing and deployment processes, improving code delivery efficiency by **30%**.\nUtilized **Docker** for containerization of backend services, facilitating consistent development and production environments across **Python** applications.\nCreated infrastructure as code using **Terraform**, enabling repeatable deployment of cloud resources and reducing setup time by **50%**.\nEmployed **Grafana** and **Google Cloud Monitoring** to maintain real-time fault detection and performance monitoring, leading to a **25%** reduction in incident response times.\nCollaborated with cross-functional teams in an **Agile** environment to align on project goals and enhance product delivery, improving team productivity by **15%**.\nManaged database solutions using **MongoDB**, **PostgreSQL**, and **Redis** to support high availability and data redundancy for critical services, ensuring zero downtime during migrations.\nConducted incident management and troubleshooting for system outages and performance issues, applying SRE principles to improve system reliability and uptime metrics by **99.9%**.\nDeveloped scripts using **Bash** for automation tasks and system monitoring, optimizing server resource utilization.\nEnsured collaboration across teams to deploy new features with minimal disruption, leveraging Agile practices to iterate rapidly and respond to customer feedback."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Bash\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure (App Services, Blob, SQL), Cloud, Google Cloud Monitoring\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Agile, Incident Management, SRE, Collaboration, Grafana",
  "apply_company": "Digital Science"
}