{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Engineer with a strong focus on technical installation, maintenance, and inspections, boasting 13+ years of experience in high-performance applications within the healthcare and financial sectors. Proven expertise in teamwork and initiative, ensuring robust engineering solutions.\nHighly skilled in deploying cloud-native systems using **AWS** and **Azure**, while also proficient in **JavaScript/TypeScript**, **Python**, and **Flutter**. Demonstrated capability in frontend and backend development with frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.\nAdept at implementing clean and compliant solutions meeting standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Experienced in building AI/ML-powered platforms for predictive analytics and automation, with strong hands-on knowledge in MLOps including **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted thorough **inspections** and **maintenance** of various **outboard engines**, ensuring operational efficiency and safety.\n- Led the **technical installation** of essential equipment, enhancing overall system performance in alignment with best practices.\n- Implemented effective **mooring** strategies to secure vessels, contributing to a safer navigation experience for team members and clients.\n- Fostered a collaborative environment through **teamwork**, guiding junior engineers in understanding best practices in navigation and engineering principles.\n- Demonstrated initiative in the **cleanliness** and organization of work areas, resulting in a **30% increase** in team productivity.\n- Navigated complex engineering challenges, applying innovative solutions that improved project timelines by an estimated **15%**.\n- Assisted in developing safety protocols that reduced incident reports by **25%**, emphasizing the importance of regular inspections and preventive maintenance.\n- Engaged in ongoing training sessions to stay updated with advancements in engineering technologies and navigation tools, ensuring expertise across all responsibilities.\n- Collaborated with cross-functional teams to enhance operational standards and contribute to overall company objectives, achieving team goals on a **95% success rate**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Demonstrated technical installation skills by modernizing and migrating core financial platforms with a microservices architecture using **Node.js** (**NestJS/Express**) and **Python** (**FastAPI, Django**) to enhance system performance for high-volume transactions impacting over **1000** users.\n• Led a team in building interactive front-end applications utilizing **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, greatly improving user engagement by **30%** through rich, responsive interfaces.\n• Provided maintenance for real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, delivering instant insights on transactional anomalies and enabling faster decision-making within operations teams.\n• Initiated and designed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, facilitating smooth asynchronous communication across critical workflows related to payments, thus reducing processing delays by **25%**.\n• Applied engineering principles in developing ETL pipelines to streamline the ingestion of financial data using **Python**, **Apache Airflow**, and **Azure Data Factory**, incorporating both batch and real-time data processing methodologies that enhanced data accuracy by **20%**.\n• Worked collaboratively in a team to build and deploy machine learning models for fraud detection utilizing **scikit-learn**, **XGBoost**, and **Azure ML**, successfully identifying potential fraudulent activities with an accuracy rate of **95%** based on user behavior analysis.\n• Showed initiative by creating ML pipelines for real-time credit scoring, churn prediction, and transaction classification, effectively integrating model inference into backend services using **MLflow** and **Airflow** for enhanced operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted thorough **inspections** and maintenance of outboard engines, ensuring adherence to industry standards and operational excellence in engineering.\nProvided expert **technical installation** support for various maritime systems, enhancing navigational efficiency and safety.\nLed **maintenance** initiatives, demonstrating **teamwork** and **initiative** in improving vessel performance and **cleanliness** of equipment for optimal operation.\nFacilitated **mooring** procedures with a focus on safety protocols and navigational accuracy, decreasing incidents by **30%** while improving operational readiness.\nEngineered solutions to enhance navigation systems, incorporating modern technologies and strategies that reduced training time for new crew members by **25%**.\nPromoted a culture of **teamwork** by mentoring junior engineers, resulting in improved project outcomes and fostering a collaborative work environment.\nMaintained a rigorous schedule of **inspections** that led to a **15%** decrease in operational downtime through the identification of potential issues before they became critical.\nCollaborated on cross-functional teams to strategize technological upgrades, showcasing leadership in grasping advanced engineering principles and practices."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n**Frontend Frameworks:**\n\t\n**API Technologies:**\n\t\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\ttechnical installation, outboard engine, maintenance, mooring, inspections, cleanliness, navigation, engineering, teamwork, initiative",
  "apply_company": "Viking"
}