{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Analyst Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Analyst Engineer, I leverage my extensive background in AI, Data Analytics, and Decision Intelligence to drive innovative solutions. With 8 years of experience in full-stack development, I excel in crafting high-performance applications using a robust tech stack that includes **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, **Django**, and deep cloud expertise in **Azure** and **AWS**. My ability to integrate AI and ML capabilities facilitates predictive analytics, intelligent automation, and real-time data processing.\nI possess in-depth knowledge of Analytics Engineering and AIDelta Engineering, along with hands-on experience in technical analysis and research writing. Additionally, I have a strong record of collaborating with cross-functional teams and enhancing client engagement through effective presentation skills. My passion for mentorship and promoting innovation supports a culture of continuous improvement and knowledge sharing.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Analyst Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged **AI** techniques to integrate smart financial dashboards and personalized health recommendations, enhancing user engagement and informed decision-making.\n- Collaborated with cross-functional teams to apply **Data Analytics** for real-time insights into transaction trends and operational KPIs, employing tools like **Power BI Embedded**.\n- Employed **Analytics Engineering** to design and maintain robust data architectures using **PostgreSQL**, **MongoDB**, and **Redis**, ensuring optimized storage and querying for large-scale datasets.\n- Implemented machine learning models utilizing **scikit-learn** and **TensorFlow** for use cases including patient risk prediction, and financial fraud detection, incorporating real-time inference services in the backend.\n- Developed and maintained visual analytics tools using **D3.js** and **Chart.js**, providing dashboards with real-time data visualizations for critical decision-making processes.\n- Led mentorship initiatives, empowering junior analysts through knowledge sharing in **Decision Intelligence** and best practices within analytics.\n- Executed innovative strategies to re-architect platforms into microservices ecosystems, utilizing **Docker** and **Kubernetes (EKS/AKS)** for enhanced scalability and fault tolerance.\n- Enhanced client engagement through data-driven presentations, employing **Graph Analytics** and modern visualization libraries to convey complex insights.\n- Championed collaboration efforts with data scientists, integrating **NLP models** using **spaCy** for efficient healthcare document parsing.\n- Established test strategies covering unit, integration, and E2E testing using **Jest**, **Cypress**, and **Postman** to ensure quality across all web and API services.\n- Spearheaded the automation of CI/CD pipelines with tools like **GitHub Actions** and **Azure DevOps**, leading to cohesive multi-environment deployments.\n- Utilized **Azure Cognitive Search** and **ElasticSearch** for implementing advanced search functionalities, enabling effective navigation through millions of healthcare and financial documents."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **AI** and **Data Analytics** to develop systems that analyze transaction patterns and user behavior, proactively flagging suspicious activities within banking systems.\nConducted extensive **Technical Analysis** to enhance financial data-led decision-making processes, optimizing transaction monitoring through analytics dashboards integrated with **Power BI Embedded**.\nEngaged in collaborative **Research Writing** and **Presentation Skills** to present findings on fraud detection systems built with **scikit-learn** and **XGBoost**, fostering innovation in financial operations.\nLed the modernization of financial platforms by implementing a microservices-based architecture using **Node.js** (**NestJS/Express**) and **Python** (**FastAPI**, **Django**), increasing scalability, maintainability, and throughput by **30%** on high-volume transaction systems.\nCreated dynamic front-end applications with **React (18)**, **Vue 3**, and **Next.js**, using **TypeScript**, which resulted in a **40%** improvement in user experience for financial dashboards.\nDeveloped real-time transaction monitoring dashboards employing **React** and **D3.js**, enabling operations teams to achieve **50%** faster anomaly detection.\nIntegrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to build a resilient event-driven architecture, facilitating responsive communication for transaction alerts with a processing increase by **25%**.\nEngineered ETL pipelines utilizing **Python**, **Apache Airflow**, and **Azure Data Factory**, optimizing batch and real-time data ingestion processes, achieving a **60%** reduction in data processing time from third-party sources.\nSpearheaded the creation of machine learning pipelines for credit scoring and transaction classification using **MLflow** and **Airflow**, enabling seamless integration of model inference in backend services for real-time decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Leveraged **AI** technologies, including scikit-learn and TensorFlow, to implement advanced analytics and data-driven decision intelligence, enhancing product recommendations and search relevance.\n- Conducted data analytics with **MongoDB** and **PostgreSQL**, providing insights that drive strategic decisions and innovations within the e-commerce platform, supporting high-traffic workflows.\n- Designed and optimized data pipelines for **Graph Analytics** and **LLMs**, ensuring efficient processing and visualization of complex datasets for real-time analytics.\n- Integrated **Analytics Engineering** practices to streamline data access and reporting processes, boosting team performance and operational efficiency.\n- Fostered a culture of mentorship and collaboration, enhancing team skills in **Agentic AI** and **AIDelta Engineering**, driving innovative solutions for client engagements.\n- Engaged with stakeholders through comprehensive research writing and presentations, translating technical analyses into actionable recommendations that align with business goals.\n- Facilitated technical analysis sessions, utilizing **Technical Analysis** methodologies to evaluate system performance, scalability, and architectural improvements.\n- Actively participated in innovation initiatives, brainstorming and implementing cutting-edge solutions to keep the platform competitive and relevant in the market.\n- Developed and executed strategic plans for analytics and machine learning capabilities, contributing to a **15%** increase in conversion rates and customer engagement.\n- Championed collaboration tools and techniques on projects, leading to a **30%** improvement in project delivery timelines by enhancing cross-functional teamwork."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tAI, Data Analytics, Decision Intelligence, Graph Analytics, LLMs, Agentic AI, Analytics Engineering, AI Delta Engineering, Technical Analysis, Research Writing, Presentation Skills, Client Engagement, Collaboration, Mentorship, Innovation, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Gartner"
}