{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior PHP Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior PHP Engineer with 8 years of experience in developing and maintaining high-performance web applications using **PHP**, **SQL**, and modern **JavaScript** frameworks. Proficient in applying **OOP**, **SOLID** principles, and **design patterns** to create maintainable clean architectures. Strong background in integrating **APIs**, with comprehensive knowledge in front-end technologies including **HTML** and **CSS**. Adept at implementing **TDD** and **DDD** methodologies to enhance software quality and ensure robust testing practices.\n\nDemonstrated ability to lead cross-functional teams, fostering collaboration and effective communication while maintaining a proactive attitude and good humor. Combine analytical and organizational skills to streamline processes and enhance project outcomes within agile environments. Committed to continuous learning and professional development, focusing on delivering exceptional technology solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust web applications utilizing **PHP**, **SQL**, and **JavaScript**, ensuring adherence to **SOLID** principles and **design patterns** for clean architecture.\n- Implemented RESTful **APIs** for seamless integration with front-end frameworks, enhancing user experience and bridging backend functionalities.\n- Collaborated with cross-functional teams to design comprehensive testing strategies leveraging TDD and DDD methodologies, ensuring high-quality output across all versions (e.g., **PHP 8.0**).\n- Leveraged version control practices with Git to manage code changes and facilitate teamwork in a multi-developer environment, enhancing organizational skills.\n- Enhanced existing WordPress sites through custom plugin development and theme modifications, utilizing **HTML**, **CSS**, and **JavaScript** for responsive design.\n- Developed and executed testing processes using tools such as Jest and Cypress for unit and integration tests, ensuring optimal performance and reliability of applications.\n- Fostered a proactive team environment, encouraging discussion on best practices and embracing a culture of good humor to improve collaboration and morale.\n- Analyzed and optimized application performance metrics, ensuring systems could handle user loads of up to **10,000** concurrent users without degradation.\n- Provided technical mentorship to junior developers, helping them understand OOP principles and best practices in PHP development, enhancing overall team capability."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained **PHP** applications adhering to **OOP**, **SOLID principles**, and design patterns to enhance code quality and system architecture.\n• Utilized **SQL** for efficient database management and retrieval, optimizing queries to improve performance significantly for applications handling large datasets.\n• Executed unit and integration testing using **TDD** and **DDD**, ensuring robust application performance and reliability, achieving a **99%** success rate in test coverage.\n• Designed and implemented RESTful **APIs** using **PHP** and **Laravel**, facilitating seamless integration with third-party services and enhancing application interoperability.\n• Built responsive and efficient front-end applications employing **HTML**, **CSS**, and **JavaScript**, focusing on user experience and ensuring compatibility across different devices and browsers.\n• Collaborated in a team environment, demonstrating strong teamwork and organizational skills, effectively managing projects with a focus on meeting deadlines and maintaining high-quality standards.\n• Applied manual and automated **Testing** methodologies to ensure code quality, successfully minimizing defects by **30%** through regular code reviews and integration testing.\n• Advocated for a proactive attitude within the team, fostering an environment of innovation and continuous improvement while maintaining a good sense of humor during high-pressure situations."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **PHP** to design and optimize backend services, adhering to **SOLID** principles and **OOP** concepts ensuring efficient code management across diverse applications.\nImplemented **SQL** databases, ensuring data integrity and performance, skilled in implementing complex queries and designing effective schemas for efficient data retrieval in high-traffic environments.\nDeveloped and maintained **WordPress** plugins and themes, utilizing **HTML**, **CSS**, and **JavaScript** to enhance user experience and drive engagement, achieving a **30%** increase in page load speed through optimization techniques.\nEngaged in **TDD** and **DDD**, employing **design patterns** for clean architecture to enhance maintainability of code, leading to a decrease in bug resolution time by **40%**.\nCollaborated on **APIs** integration ensuring seamless communication between systems and services, successfully managing **20+** API endpoints to support various functionalities in the platform.\nPracticed version control with **Git**, maintaining records of changes and facilitating team collaboration through effective branching strategies.\nDemonstrated strong analytical and organizational skills to enhance project workflow, demonstrating a proactive attitude and ability to meet deadlines consistently through effective teamwork.\nConducted comprehensive testing, leading to improved application reliability and performance through robust testing methodologies, promoting best practices in the team.\nPromoted a positive team culture with a good sense of humor, fostering collaboration and improving team morale during challenging project phases."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, PHP, SQL, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n**API Technologies:**\n\tAPIs, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n**Other:**\n\tOOP, SOLID, design patterns, version control, WordPress, TDD, DDD, clean architectures, Testing, analytical skills, organizational skills, teamwork, proactive attitude, good humor",
  "apply_company": "wecity"
}