{
  "name": "Tomasz Lee",
  "role_name": "Senior BigData Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Big Data Engineer with 9+ years of comprehensive experience in developing and implementing scalable data solutions. Proficient in **AWS**, **GCP**, **Terraform**, and managing data lakes using **Glue Data Catalog** and **Lake Formation**. Skilled in programming languages including **Java** and **Python**, and adept in SQL for effective database management. Experienced in streaming architectures utilizing **Kinesis** and familiar with handling data security using **IAM**. Proven track record in Agile methodologies, capable of leading cross-functional teams to drive innovative projects successfully while optimizing performance metrics. Strong background in leveraging technology stacks like **ReactJS**, **NextJS**, and **.NET** for comprehensive full stack development.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior BigData Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **AWS** services such as **S3** and **Kinesis** to enhance data storage and streaming capabilities in big data applications.\nDesigned and implemented robust ETL processes using **Glue Data Catalog** and **Lake Formation**, increasing data accessibility by **30%**.\nDeveloped data pipelines in **Python** and **Java** for efficient data processing and transformation tasks, boosting performance by **15%**.\nDeployed infrastructure as code using **Terraform** to streamline environment setups, reducing provisioning time by **50%**.\nCollaborated in an **Agile** environment to iterate on data projects effectively, ensuring timely delivery of high-quality solutions.\nImplemented **IAM** policies to secure data access and ensure compliance with data governance standards.\nCreated and managed **Helm Charts** for deploying data services in Kubernetes, improving application scalability and reliability.\nOptimized SQL queries for big data analytics, leading to a **25%** reduction in query execution times.\nEngaged in continuous integration/continuous deployment (CI/CD) processes to facilitate regular updates and improve deployment efficiency.\nProvided mentorship and guidance to junior engineers, fostering skill development in big data technologies."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **AWS** and **GCP** to enhance cloud infrastructure and manage data effectively for Big Data solutions, ensuring optimal performance and reliability.\nDeveloped and maintained **SQL** databases and utilized **AWS Glue Data Catalog** for data cataloging and management, improving data retrieval speed by **40%**.\nImplemented **Terraform** for infrastructure as code, streamlining the deployment process and reducing environment setup time by **50%**.\nApplied Agile methodologies to manage project timelines and deliverables, consistently meeting deadlines on over **10** major releases.\nDesigned and orchestrated data workflows with **Kinesis** and **Lake Formation**, enabling efficient streaming architecture and real-time data processing.\nCreated intricate data pipelines leveraging **Python** for data transformation, resulting in a **30%** reduction in processing time.\nLed efforts in data governance by configuring **IAM** policies for secure access to data across multiple environments, enhancing security posture.\nMonitored system performance and conducted optimization strategies resulting in a **20%** increase in query efficiency on large datasets.\nCollaborated with cross-functional teams to define project requirements, leading to the successful completion of at least **5** large-scale data projects.\nConducted training and mentorship sessions for junior engineers, fostering skill development and improving overall team productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **AWS** services and **GCP** to enhance data processing capabilities, contributing to a **30%** improvement in data pipeline performance.\nDeveloped and implemented **Terraform** scripts to automate infrastructure provisioning, resulting in a **40%** reduction in deployment time.\nUtilized **Python** and **Java** for data transformation and analysis, managing large datasets with **SQL** for optimized querying efficiency.\nDesigned and maintained a modern data architecture using **Glue Data Catalog** and **Lake Formation** for efficient data lake management.\nImplemented **IAM** for secure access control, ensuring regulatory compliance and data security across the platform.\nEmployed **S3** for scalable storage solutions and integrated **Kinesis** for real-time data streaming, enhancing data accessibility.\nCollaborated in an **Agile** environment, participating in sprints and planning meetings to ensure alignment with project objectives and timely deliverables.\nUtilized **Helm Charts** for deploying applications in a Kubernetes environment, streamlining the release process.\nContributed to team knowledge sharing through documentation of best practices and technical standards, fostering a collaborative work environment."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, Java\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, C#, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, GCP, Glue Data Catalog, Lake Formation, IAM, Kinesis, S3\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\n**DevOps**\n\tTerraform, CI/CD pipelines, Helm Charts, Agile\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tUX/UI Design, Git, GitHub, Redux, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "inhire.io"
}