{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior JavaScript Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior JavaScript Engineer with 13+ years of experience creating high-performance applications in the healthcare and financial industries. Proficient in **JavaScript**, **Node.js**, **REST**, and **SOAP**, with extensive knowledge of **SQL**, **SQLite**, and **PostgreSQL** for robust data management. Demonstrated ability in leading teams, ensuring clear communication, and maintaining a strong customer orientation. Experienced in cloud environments, particularly with **AWS** services like **AWS Lambda** and **API Gateway**, and implementing solutions using the **Serverless Framework**. Also skilled in delivering automated testing and B2B solutions while aligning with industry compliance standards. Strong expertise in building AI/ML-powered platforms using **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **FastAPI**, and **Django**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed dynamic web applications utilizing **JavaScript** and **Node.js**, ensuring robust REST APIs and seamless integrations with B2B systems.\nDesigned and implemented automated testing frameworks to ensure high-quality code, utilizing tools for **automated testing** and QA processes.\nLed cross-functional teams, demonstrating strong **team leadership** to coordinate project timelines and deliverables effectively by fostering **clear communication** within the team and with stakeholders.\nExecuted database management with **PostgreSQL** and developed efficient **SQL** queries to handle data storage and retrieval, ensuring optimal performance and reliability.\nImplemented serverless architectures using **AWS Lambda** and the **Serverless Framework**, streamlining application development while enhancing scalability and cost-effectiveness.\nCreated secure API gateways for microservices, maintaining compliance with industry standards and improving the performance of web services.\nEngaged in continuous feedback loops with customers to align development efforts with user needs, demonstrating a strong **customer orientation** in product development.\nOptimized application performance through code reviews and refactoring, significantly enhancing load times by up to **40%**.\nInitiated training sessions for team members on best practices in **JavaScript** development and automated testing methodologies, contributing to a knowledge-sharing environment.\nMaintained thorough documentation of processes and codebases, aiding in onboarding and knowledge transfer within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Leveraged **JavaScript** and **Node.js** to modernize core financial platforms by migrating to microservices architecture, enhancing scalability and performance of high-volume transactional systems.\n• Designed and implemented RESTful APIs and integrated with **SQL**, **PostgreSQL**, and **SQLite** databases to ensure seamless data access and operations.\n• Spearheaded the development of interactive front-end applications utilizing **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, creating responsive interfaces for financial tools and manager dashboards.\n• Orchestrated the delivery of real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, providing insights into over **500k transactions** daily, aiding in prompt decision-making.\n• Engineered a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus** to enable efficient asynchronous communication for critical workflows improved by **30%** in processing speed.\n• Developed ETL pipelines for ingesting financial data from internal and third-party sources through **Python**, **Apache Airflow**, and **Azure Data Factory**, optimizing processing tasks by over **70%**.\n• Built and deployed machine learning models for fraud detection utilizing **scikit-learn**, **XGBoost**, and **Azure ML**, achieving precision in fraud detection metrics of over **95%**.\n• Created **ML pipelines** for real-time credit scoring and transaction classification, effectively integrating model inference into backend services using **MLflow** and **Airflow**, resulting in improved loan processing efficiency by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and optimized backend services for a global e-commerce platform using **Node.js** (NestJS, Express) and **JavaScript**, ensuring high availability and scalability across key modules, with a focus on RESTful and SOAP APIs.\n- Engineered real-time features leveraging **AWS Lambda** and **API Gateway** for event-driven architectures, allowing dynamic inventory tracking and responsive order updates.\n- Implemented automated testing strategies to ensure the reliability and maintainability of code, enhancing application performance and user satisfaction.\n- Led a team of developers in optimizing SQL storage solutions with **PostgreSQL** and **SQLite**, achieving a 30% improvement in query response times and ensuring data integrity across e-commerce transactions.\n- Collaborated closely with cross-functional teams to improve customer orientation by integrating user feedback into the development lifecycle, enhancing user experience based on an 85% customer satisfaction score.\n- Communicated technical concepts clearly, supporting project alignment and stakeholder engagement, contributing to a 40% reduction in project delivery time.\n- Ensured compliance with security standards, implementing role-based access control (RBAC) and OAuth 2.0 to protect user data and adhere to GDPR regulations.\n- Built and maintained serverless applications using the **Serverless Framework**, streamlining deployment processes and reducing infrastructure costs by 25%.\n- Drove the use of B2B integrations to enhance partnership workflows, resulting in a 20% increase in operational efficiency.\n- Enhanced application performance through continuous integration and deployment best practices while maintaining clear communication across teams for smooth project execution."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, Python, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST, SOAP, API Gateway\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Serverless Framework\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQLite\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, S3, RDS; Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Terraform, Ansible, Helm, Docker Compose, B2B, Automated Testing, Team Leading, Customer Orientation, Clear Communication",
  "apply_company": "Memtime"
}