{
  "name": "Mariusz Jan Skobel",
  "role_name": "Full Stack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-118083397/",
  "profile_summary": "Results-driven Full Stack Engineer with 10+ years of experience in designing and implementing high-performance software solutions, proficient in **Go lang**, **React**, **Node.js**, **TypeScript**, and cloud services including **AWS**, **GCP**, and **Azure**. Extensive expertise in **microservices architecture**, **API design**, and deploying cloud-native applications, leveraging **Kubernetes**, **Docker**, and CI/CD best practices to ensure efficient development workflows and reliable production environments. Strong focus on cost optimization and cloud commitment management, with a demonstrated ability to design robust architectures that implement effective cloud billing models.\n\nSkilled in building secure, scalable systems, with hands-on experience in databases such as **BigQuery**, **ClickHouse**, and **Firestore**. Proven track record in implementing GitOps practices to streamline deployment processes. Exceptional communication and collaboration skills, dedicated to driving team success and delivering impactful software solutions that adhere to compliance standards and best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped scalable, full-stack solutions using **TypeScript**, **Node.js**, and **React**, ensuring high-quality code through best practices in CI/CD with **GitOps** and cloud services like **AWS** and **Azure**.\n•\tImplemented microservices architecture, utilizing **Docker** and **Kubernetes**, which resulted in a **40%** increase in deployment speed and a **30%** reduction in maintenance costs.\n•\tDesigned and developed robust APIs for seamless data exchange between front-end and back-end systems, improving integration efficiency by **25%**.\n•\tDeployed applications across cloud platforms, applying cost optimization strategies and managing cloud billing models on **GCP** and **AWS**.\n•\tCollaborated with cross-functional teams to ensure effective communication and collaboration, leading to timely project deliverables.\n•\tConstructed and maintained database solutions using **BigQuery**, **Firestore**, and **PostgreSQL** to support data-driven decisions and enhance performance metrics.\n•\tBuilt and managed CI/CD pipelines, enforcing linting, testing, and automated deployments to ensure software reliability and quality across multiple environments.\n•\tExecuted advanced monitoring and logging procedures in cloud environments, allowing for real-time performance tracking and operational insights.\n•\tFostered collaboration among teams to facilitate agile methodologies, ensuring continuous integration with project goals and timelines."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Go lang** to develop scalable services aligned with **microservices architecture** principles, enhancing system performance for high-demand applications.\nDesigned and implemented RESTful APIs in **Node.js**, facilitating seamless integrations and enhancing user experiences across platforms with strong attention to **API design** issues.\nLeveraged **React** (18) and **TypeScript** to build responsive web applications, improving user engagement metrics by **30%** through optimized UI/UX strategies.\nDeployed applications on **AWS** and **Azure**, leveraging cloud services for a cost-efficient infrastructure with proactive **cloud billing models** and **cost optimization** strategies, achieving a **20%** reduction in operational costs.\nConfigured and managed **Kubernetes** clusters to ensure reliable application deployment, utilizing **CI/CD** pipelines for efficient code integration and version control with **GitOps** methodologies.\nImplemented **Docker** for containerization of services, enabling smooth deployment processes and reducing environment inconsistencies.\nDesigned databases using **BigQuery**, **ClickHouse**, and **Firestore**, optimizing query performance and enhancing data retrieval speeds by **25%** for analytics workloads.\nFacilitated collaboration between cross-functional teams, strengthening communication skills and fostering a productive working environment focused on delivering high-quality engineering solutions.\nBuilt and maintained comprehensive unit and integration tests, ensuring code quality and reliability within the development lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed scalable microservices architecture using **Node.js** and **Go lang** to enhance system performance and maintainability across the platform.\n• Engineered and optimized RESTful APIs for seamless integration and communication between frontend and backend services, ensuring efficient data flow and resource utilization.\n• Collaborated on cloud infrastructure management using **AWS**, **GCP**, and **Azure**, focusing on cost optimization strategies and cloud billing models to improve overall operational efficiency.\n• Designed and automated CI/CD pipelines with **Docker** and **Kubernetes**, streamlining deployment processes and enabling rapid feature delivery across environments.\n• Utilized **React** and **TypeScript** to build interactive, responsive user interfaces for web applications, enhancing user engagement and experience.\n• Managed databases including **BigQuery**, **ClickHouse**, and **Firestore** to ensure high-performance data storage, retrieval, and processing for applications under high load.\n• Applied **GitOps** practices for version control and deployment consistency, improving team collaboration and workflow efficiency.\n• Implemented effective communication strategies within cross-functional teams, enhancing collaboration and project delivery timelines by **20%**.\n• Conducted performance testing and monitoring using metrics to identify bottlenecks, resulting in a **30%** increase in application performance across key modules.\n• Engaged in cost management initiatives, achieving a **15%** reduction in cloud service costs through resource optimization and commitment management."
    }
  ],
  "skills": "Programming Languages:\n\tGo lang, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI design, micoroservices architecture\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, BigQuery, ClickHouse, Firestore\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, GitOps\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose, cloud billing models, cost optimization, cloud commitment management\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, communication skills, collaboration skills"
}