{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Fullstack Engineer with 8 years of experience, I excel in architecting high-performance solutions utilizing **Python**, **FastAPI**, **TypeScript**, **Vue.js**, **React**, and SQL databases such as **PostgreSQL**. My comprehensive background in full-stack development allows me to create scalable applications that meet complex business needs while guiding teams in best practices through mentoring.\nI have a proven track record in building enterprise-grade platforms, with a focus on integrating LLM APIs and implementing effective prompt engineering strategies. My expertise includes developing and deploying applications that adhere to industry compliance standards, leveraging a robust microservices architecture and event-driven systems. Additionally, I possess hands-on experience in cloud environments such as Azure and AWS, ensuring seamless remote collaboration and robust CI/CD automation. I also contribute to machine learning initiatives by designing machine learning pipelines and utilizing MLOps tools effectively.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Architected and developed scalable solutions using **Python** and **TypeScript** in conjunction with **FastAPI** and modern front-end frameworks such as **React** and **Vue.js**.\nMentored junior developers by providing guidance on best practices in architecture and technology, fostering a strong remote work culture.\nDesigned and maintained data architectures utilizing **PostgreSQL** for efficient data storage and retrieval in compliance with regulatory standards.\nImplemented advanced prompt engineering techniques to optimize integration of **LLM APIs** within applications, enhancing user interactions and experiences.\nContributed to the development process by applying comprehensive software development methodologies, leading to successful project completions on time for **9** projects across diverse industries.\nCollaborated with cross-functional teams to ensure seamless communication and integration of features, following agile practices aimed at achieving high-quality outcomes.\nEvaluated existing solutions and proposed enhancements, resulting in a **30%** increase in system performance and reliability.\nUtilized version control systems effectively to manage code changes and deployment, ensuring smooth transitions and reduced downtime across deployments.\nSuccessfully architected cloud-native applications by leveraging cloud services for deployment, contributing to a **40%** reduction in operational costs.\nConducted regular code reviews and quality assurance processes which improved codebase maintainability and reduced defect rates by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Architected scalable solutions using **Python** (FastAPI, Django) and **TypeScript** to enhance the performance of financial applications, supporting over **5 million** transactions per month.\n- Developed modern web applications with **React** (18), **Vue.js** 3, and **Next.js** integrating advanced design techniques by utilizing responsive frameworks like **Tailwind CSS**, resulting in a **30%** increase in user satisfaction ratings.\n- Led the implementation of event-driven architectures employing **Kafka**, **RabbitMQ**, and **Azure Service Bus**, serving over **100,000** messages per minute for critical alert and transaction processing.\n- Designed and built real-time analytics dashboards with **D3.js** and **Power BI Embedded**, which enabled operations teams to efficiently monitor and analyze financial trends, reducing incident response times by **40%**.\n- Modeled ETL processes utilizing **Python**, **Apache Airflow**, and **Azure Data Factory**, achieving batch processing of **8 terabytes** of financial data quarterly from various sources.\n- Spearheaded the development of AI/ML fraud detection systems using **scikit-learn** and **XGBoost**, identifying anomalous transactions with over **95%** accuracy and safeguarding bank assets.\n- Created and managed ML pipelines for tasks like credit scoring and churn prediction using **MLflow** and **Airflow**, facilitating real-time decision-making that improved retention rates by **25%**.\n- Actively mentored junior engineers and promoted best practices in coding, ensuring high-quality deliverables and upholding standards for remote collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** (specifically **FastAPI**, **Django**) for backend service development, ensuring high availability and scalability within a global e-commerce platform, focusing on critical modules like checkout and order fulfillment.\nEngineered solutions leveraging **TypeScript** in frontend frameworks including **React** (v18) and **Vue.js** (v3), delivering fast, responsive applications optimized for both mobile and web environments.\nImplemented database solutions using **PostgreSQL** and collaborated on architectural design to support high-traffic e-commerce workflows, ensuring efficient data retrieval and storage efficiency for over **1 million** transactions monthly.\nArchitected AI/ML solutions with **LLM APIs** and integrated models like **TensorFlow** to enhance personalized product recommendations, improving conversion rates by **25%** through tailored user experiences.\nMentored junior developers, fostering a culture of learning and innovation while implementing effective coding practices within an agile environment, promoting teamwork in a **remote work** setting.\nImplemented role-based access control (RBAC) and **OAuth 2.0**, enhancing platform security to protect user data and comply with GDPR regulations.\nLeveraged modern architectural practices with **microservices**, ensuring streamlined deployment and management of services across the platform, reducing downtime during updates by **30%** through effective CI/CD strategies.\nDesigned user interfaces with a strong focus on accessibility, utilizing HTML5 and CSS3 to meet **WCAG 2.1** standards, resulting in improved user engagement and satisfaction.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue.js, Angular\n\n **API Technologies:**\n\tLLM APIs, prompt engineering\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob)\n\n **Other:**\n\tArchitecting solutions, Mentoring, Remote work, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Airflow, Kubeflow",
  "apply_company": "Braintrust"
}