{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior PHP Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior PHP Engineer with 13+ years of experience delivering scalable applications, focusing on robust backend solutions using **PHP** and **Symfony**. Well-versed in database management with expertise in **MySQL**, **PostgreSQL**, and **SQLite**. Demonstrated proficiency in agile methodologies including **Scrum** and **Kanban**, leveraging principles of **SOLID** and **Domain-Driven Design** to create sustainable and maintainable code.\n\nIn addition to PHP expertise, skilled in modern web technologies and frameworks, including **JavaScript/TypeScript**, **Python**, and **Flutter**. Extensive hands-on experience in building applications with **React**, **Next.js**, and **Vue**, ensuring high-performance frontend development. Successfully developed AI/ML-powered platforms supporting predictive analytics, automation, and real-time processing.\n\nExperienced in cloud-native deployments, utilizing **AWS** and **Azure**, along with building microservices and CI/CD pipelines for enhanced operational efficiency. Adept at ensuring compliance with industry standards, including HIPAA, FHIR, PCI DSS, and SOC 2, while maintaining a strong MLOps background utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained high-performance web applications using **PHP** and **Symfony**, ensuring adherence to SOLID principles and Domain-Driven Design for maintainable code.\nImplemented database solutions with **MySQL**, **PostgreSQL**, and **SQLite** to effectively manage data persistence and integrity, achieving optimized query performance with load times reduced by **30%**.\nCollaborated in Agile environments using **Scrum** and **Kanban** methodologies to deliver features in incremental sprints, enhancing productivity by **20%**.\nDesigned and executed search functionalities using **Elasticsearch**, enabling efficient retrieval of data across structured and unstructured datasets, resulting in an improved search response time of **40%**.\nIntegrated caching mechanisms with **Redis** to enhance application scalability and performance under high traffic loads, leading to a significant reduction in database load by **50%**.\nContributed to the establishment of robust DevOps practices, utilizing **Git** for version control and streamlined deployment processes across multiple environments, ensuring code quality and security checks are met in every release.\nLed efforts to improve system reliability and maintainability through code reviews and adhering to Agile best practices, fostering a culture of continuous improvement within the development team.\nParticipated in the design and development of RESTful APIs, ensuring smooth interaction between frontend and backend systems while focusing on scalability and performance based on user feedback and analytics.\nEnhanced system performance by continuously refactoring existing codebases in line with best practices and emerging technology trends, achieving an overall code quality improvement score maintained above **90%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **PHP** and **Symfony** to develop and maintain robust back-end systems, ensuring high performance and efficient data processing in financial applications.\nImplemented and optimized **MySQL**, **PostgreSQL**, and **SQLite** databases to manage financial records, achieving performance improvements of up to **30%** in query response times.\nEmployed **Redis** for caching mechanisms, resulting in reduced server load and improved application speed by **25%** for end-users.\nApplied principles of **SOLID** and **Domain-Driven Design** to architect scalable and maintainable code, leading to a **50%** reduction in technical debt.\nLed cross-functional teams using **Scrum** and **Kanban** methodologies to streamline development processes, enhancing project delivery timelines by **20%**.\nContributed to Agile best practices by participating in iterative development cycles, facilitating clear communication and collaborative problem-solving among teams.\nConducted thorough code reviews and provided mentorship to junior developers, improving code quality and team efficiency.\nIntegrated third-party APIs and microservices, ensuring seamless data exchange and synchronization between systems."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged strong expertise in **PHP** and **Symfony** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability.\nUtilized **MySQL**, **PostgreSQL**, and **SQLite** for structured data storage, managing over **1 million** user records while ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows.\nImplemented **Redis** caching strategies to enhance application responsiveness, resulting in a **30%** reduction in read pressure on databases and improved load times for over **500,000** daily transactions.\nCollaborated effectively within **Agile** frameworks such as **Scrum** and **Kanban** to deliver high-quality software in **2-week** sprints, prioritizing tasks to meet project deadlines and optimize team performance.\nAdhered to software design principles like **SOLID** and **Domain-Driven Design** to create maintainable and scalable codebases, facilitating future enhancements and feature additions across the platform.\nConducted regular code reviews and utilized **Git** for version control, maintaining project integrity and facilitating team collaboration during concurrent development efforts.\nIntegrated **Solar** and **ElasticSearch** for advanced search capabilities, significantly enhancing user experience and search result relevance for thousands of product listings.\nLed initiatives to apply agile methodologies to improve project workflows and team accountability, resulting in a **25%** increase in overall productivity and successful project delivery.\nPromoted continuous learning and adaptation of best practices in the development team, fostering an environment of innovation and technical excellence."
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP,\n\tPython,\n\tJavaScript/TypeScript\n\n **Backend Frameworks:**\n\tSymfony,\n\tFastAPI,\n\tFlask,\n\tDjango\n\n **Frontend Frameworks:**\n\tReact,\n\tVue,\n\tAngular\n\n **API Technologies:**\n\tNginx,\n\tKeycloak (OIDC, RBAC),\n\tOAuth2,\n\tJWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda,\n\tAzure: App Services\n\n **Databases:**\n\tPostgreSQL,\n\tMySQL,\n\tSQLite,\n\tMongoDB,\n\tRedis\n\n **DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS,\n\tAWS: RDS,\n\tS3,\n\tAzure: Blob Storage,\n\tSQL Database\n\n **Other:**\n\tMLflow,\n\tAirflow,\n\tKubeflow,\n\tSolar,\n\tElasticSearch,\n\tGit,\n\tSOLID,\n\tDomain-Driven Design,\n\tScrum,\n\tKanban,\n\tAgile",
  "apply_company": "HR Contact"
}