{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Detail-oriented Software Engineer with 13+ years of experience specializing in high-performance applications within the healthcare and financial sectors. Proficient in **React**, **Python**, **TypeScript**, **FastAPI**, and **SQL**, with strong capabilities in frontend and backend development. Experienced in leveraging **Jest** and **React Testing Library** for unit testing and employing **PyTest** to ensure code quality. Skilled in implementing **CI/CD** pipelines and adept in Agile methodologies, including **Scrum**, utilizing tools like **Jira** and **Confluence** for effective project management. Proven track record in supporting AI-assisted development tools to enhance productivity and output quality. Demonstrates exceptional communication skills and thrives in remote teamwork environments, ensuring seamless collaboration across diverse teams.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained robust application architectures utilizing **React (17–18)**, **Python (FastAPI)**, and **TypeScript**, ensuring quality and reliability through rigorous testing strategies including **Jest**, **React Testing Library**, and **PyTest**.\nImplemented CI/CD processes and Agile management utilizing **GitHub Enterprise** and **Jira**, maximizing team productivity and software delivery speed by 50%.\nCollaborated with cross-functional teams using **Confluence** to document workflows and decisions, enhancing communication skills and promoting effective remote teamwork.\nDesigned and executed efficient state management within applications using **Redux**, leading to a 30% increase in application performance and stability.\nTransitioned legacy systems to modern architectures, utilizing **SQL** databases to manage data efficiently, which improved data retrieval speeds by over 40%.\nSpearheaded the integration of AI-assisted development tools, streamlining coding practices and accelerating project timelines by 25%.\nParticipated actively in Scrum meetings, refining sprint plans and deliverables while ensuring alignment with project goals, facilitated by strong communication skills.\nEngaged in code reviews and pair programming sessions, promoting knowledge sharing and enhanced coding standards among team members."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed interactive front-end applications using **React (18)**, **TypeScript**, and **Redux** to enhance user experiences and streamline data interaction for financial tools and admin panels.\n• Engineered robust back-end systems with **Python**, **FastAPI**, and **Django**, applying best practices in **Agile Management** and **Scrum** to ensure timely delivery and continuous improvement.\n• Implemented automated testing processes using **Jest** and **React Testing Library** to increase code reliability and maintainability across projects.\n• Collaborated effectively in remote teams, leveraging tools such as **Jira**, **Confluence**, and **GitHub Enterprise** for project tracking and version control, achieving a project completion rate of 95% on time.\n• Migrated core financial platforms to a **microservices architecture**, enhancing scalability and performance for high-volume transactional systems by incorporating **CI/CD** practices.\n• Designed and built **ETL** pipelines with **Apache Airflow** and **Azure Data Factory**, successfully ingesting financial data from **5+** internal and third-party sources to support both batch and real-time processes.\n• Developed and deployed machine learning models for fraud detection utilizing **scikit-learn** and **XGBoost**, which improved detection rates by **30%** based on analysis of user behavior and transaction patterns.\n• Created real-time analytics dashboards with **D3.js** and **Power BI Embedded**, providing insights into transaction anomalies, thereby enabling operations teams to react within **seconds** of observing trends.\n• Established a solid event-driven architecture utilizing **Kafka**, **RabbitMQ**, and **Azure Service Bus** to facilitate asynchronous communication across critical workflows, such as payments and alerts."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **React** and **TypeScript** to develop dynamic user interfaces that enhance user experience, ensuring responsiveness across web and mobile platforms, delivering efficient applications for high-traffic e-commerce workflows.\nEmployed **Python** with **FastAPI** for developing robust backend services that support crucial operations such as checkout and order fulfillment, achieving high availability and low latency.\nImplemented **SQL** databases (PostgreSQL, MongoDB) for efficient data handling and retrieval, optimizing data access while ensuring scalability in e-commerce applications.\nDesigned and managed CI/CD pipelines using **GitHub Enterprise** and Agile methodologies, ensuring streamlined software delivery and improved collaborative coding practices among remote teams.\nConducted rigorous unit testing with **Jest** and **PyTest** to ensure code quality and reliability, leading to a **25%** reduction in bugs during production releases.\nFacilitated effective communication within the team using **Jira** and **Confluence** to manage project tasks and documentation, fostering a collaborative work environment crucial for successful project outcomes.\nIntegrated AI-assisted development tools to enhance productivity and streamline coding processes, contributing to effective remote teamwork and faster delivery times.\nAdopted Agile Management and **Scrum** practices, effectively participating in sprints and stand-ups to ensure timely completion of project milestones and objectives.\nLeveraged **Redux** for state management in applications, improving data handling efficiency and maintainability in complex applications.\nCreated automated tests using **React Testing Library** to validate UI components and maintain code integrity, resulting in improved overall application performance."
    }
  ],
  "skills": "Programming Languages:\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Redux, Jest, React Testing Library\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tSQL, PostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Agile Management, Scrum, Jira, Confluence, GitHub Enterprise, Git, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, AI-assisted development tools, Communication skills, Remote teamwork"
}