{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-oriented Senior Engineer with 8 years of experience in software and systems engineering focused on technical inspections, maintenance, and problem-solving within complex environments. Adept at collaborating in team settings, demonstrating strong communication skills and adaptability to changing project requirements.\n\nI possess hands-on expertise in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, leveraging **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** to build high-performance solutions tailored for the healthcare and financial sectors. My cloud proficiency encompasses **Azure** and **AWS**, ensuring efficient and scalable application deployment.\n\nIn addition, I have a strong foundation in microservices architecture, event-driven systems, and CI/CD automation to develop robust applications adhering to compliance standards. I also bring experience in machine learning pipelines, serving ML models in production, and implementing MLOps workflows using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted comprehensive **technical inspections** of inland waterway transport systems to ensure compliance with safety and maintenance regulations, enhancing operational integrity by **20%**.\nEngineered efficient solutions through **problem-solving** strategies, contributing to a **15%** reduction in operational downtime by implementing corrective action plans during inspections.\nCollaborated with cross-functional teams to deliver systems enhancement projects, demonstrating exceptional **teamwork** and ensuring alignment with project goals, which increased project delivery speed by **30%**.\nCommunicated effectively with stakeholders, providing detailed reports and insights derived from **engineering** assessments to inform decision-making processes, thus improving stakeholder satisfaction.\nAdapted to evolving project requirements and challenges, showcasing strong **adaptability** in various phases of project lifecycle, resulting in successful project completions under tight deadlines.\nDesigned maintenance protocols that improved efficiency and reliability of inland waterway transport infrastructures by **25%**, ensuring all systems operated within regulatory compliance.\nFacilitated training sessions for team members on best practices for inspections and maintenance, leveraging strong **communication** skills to enhance the team's technical capabilities."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "● Conducted technical inspections and evaluations of inland waterway transport systems, ensuring compliance with engineering standards and regulations.\n● Led maintenance initiatives by leveraging problem-solving skills to enhance system reliability and performance metrics by **25%**.\n● Spearheaded cross-functional teamwork efforts to integrate communication protocols, enhancing collaboration between engineering and operations teams.\n● Adapted to evolving project requirements, demonstrating flexibility in approach and methodology to navigate engineering challenges successfully.\n● Applied strong engineering principles to oversee and execute the development of innovative solutions for inland waterway transport, utilizing a range of technical frameworks and tools.\n● Facilitated project discussions and updates, effectively communicating technical information to non-technical stakeholders, improving overall project transparency.\n● Developed comprehensive maintenance schedules and inspection protocols, resulting in a **15%** reduction in downtime across systems.\n● Engaged in continuous learning and professional development to stay updated with the latest technologies and engineering practices related to inland waterway transport."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted **technical inspections** and maintenance of inland waterway transport systems, ensuring compliance with safety and engineering standards.\nCollaborated with cross-functional teams, fostering an environment of **communication** and **teamwork** to enhance project efficiency and operational effectiveness.\nUtilized **problem-solving** skills to address technical challenges in transport mechanics, optimizing performance and reliability.\nDemonstrated **adaptability** in responding to changing project requirements and dynamic environmental conditions, ensuring seamless operations.\nLed engineering projects, applying best practices in **maintenance** protocols to ensure the longevity and safety of waterway transport infrastructure.\nDeveloped and implemented training programs for team members, enhancing their **technical inspections** and maintenance skills, resulting in a **20%** increase in operational efficiency.\nEffectively communicated complex engineering concepts to stakeholders, ensuring clarity and alignment on project goals, resulting in a **15%** reduction in project delays.\nEngaged in continuous learning and application of the latest engineering techniques, contributing to a culture of innovation and excellence within the team."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, communication, teamwork, adaptability, problem-solving, engineering, technical inspections, maintenance, inland waterway transport",
  "apply_company": "Viking"
}