{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Fleet Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Results-oriented Senior Fleet Engineer with 8+ years of expertise in **Linux**, **Networking**, and **System Maintenance**. Proficient in **Bash** and **Python**, with hands-on experience in **Software Troubleshooting** and **Hardware Troubleshooting**. Skilled in monitoring and performance optimization using tools like **Grafana** and **Prometheus**. Strong background in maintaining high-performance systems and implementing effective solutions in dynamic environments. With a solid foundation in **Kubernetes** for container orchestration and experience in **HPC**, I excel in enhancing system reliability and efficiency, while leveraging my technical acumen to support complex operational needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Fleet Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Provided **Linux** system maintenance for cloud-native applications, ensuring optimal performance and reliability in various infrastructures.\n• Monitored application health and performance metrics using **Grafana** and **Prometheus**, achieving a **25%** reduction in downtime incidents through proactive troubleshooting.\n• Developed automated **Bash** and **PowerShell** scripts for system diagnostics, enhancing troubleshooting efficiency by **40%** and reducing time-to-resolution for issues.\n• Implemented and maintained container orchestration using **Kubernetes**, achieving a **99.9%** uptime by managing deployments and scaling operations across multiple environments.\n• Collaborated with cross-functional teams to resolve hardware and software troubleshooting issues, ensuring seamless functionality across all systems and reducing incident resolution time by **30%**.\n• Spearheaded the integration of monitoring solutions like **Grafana** with Kubernetes clusters, providing insights into system performance and resource utilization metrics.\n• Conducted regular system maintenance, performance tuning, and updates on existing hardware/software components, resulting in improved operational efficiencies.\n• Assisted in the development and deployment of High-Performance Computing (**HPC**) solutions, optimizing workloads and resource allocation to meet demanding processing requirements.\n• Led training sessions for junior engineers, enhancing their skills in **Linux** systems, software and hardware troubleshooting, and environment management."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Utilized **Linux** to manage and maintain the fleet management systems, ensuring optimal performance and uptime of **Python**-based applications.\n• Implemented **Bash** scripting for automated routine checks and system maintenance tasks, resulting in a **20%** reduction in manual intervention.\n• Diagnosed and resolved hardware and software troubleshooting issues, effectively contributing to a **95%** resolution rate within **24 hours**.\n• Developed monitoring solutions using **Prometheus** and **Grafana**, which improved system observability and reduced incident response times by **30%**.\n• Coordinated network configurations and optimizations to enhance connectivity for fleet management applications, ensuring robust performance across **multiple** sites.\n• Led system maintenance initiatives to upgrade and patch existing fleet management software, employing **Kubernetes** for efficient deployment and scaling of containerized applications.\n• Managed and deployed high-performance compute (HPC) resources for processing large volumes of data critical to fleet operations.\n• Automated deployment processes using CI/CD pipelines in **Azure DevOps** and **GitHub Actions**, improving deployment intervals by **40%**.\n• Conducted comprehensive fleet system health checks, utilizing monitoring tools to identify potential risks and proactively address system vulnerabilities.\n• Collaborated with cross-functional teams to ensure compliance with networking standards and implemented best practices in networking for fleet operations."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Executed system maintenance and performance monitoring using **Grafana** and **Prometheus** to ensure the health and efficiency of fleet systems.\nConducted hardware and software troubleshooting across fleet operations, diagnosing issues in real-time to minimize downtime and enhance performance.\nUtilized **Linux** environments for high-performance computing (HPC) solutions, administering fleet applications and ensuring optimal operation under peak loads.\nDeveloped and maintained automation scripts with **Bash** and **Powershell** to streamline system processes and improve operational efficiency.\nImplemented **Kubernetes** for container orchestration to improve deployment scalability and manage fleet resources effectively.\nOptimized networking protocols and configurations, ensuring smooth communication across fleet systems and minimizing latency issues.\nManaged system configurations and updates, ensuring software integrity and security compliance throughout the fleet management lifecycle.\nProvided training and support for fleet team members on best practices in system maintenance and troubleshooting methodologies.\nLeveraged data analytics and monitoring tools to proactively identify and address potential system bottlenecks, optimizing the fleet management process and increasing reliability.\nFostered collaboration between software and hardware teams to design and implement solutions that enhance fleet operations and effectiveness."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Grafana, Prometheus, Bash, Powershell, Linux, Networking, Hardware Troubleshooting, Software Troubleshooting, System Maintenance, HPC",
  "apply_company": "CoreWeave"
}