{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior AI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior AI Engineer with 8 years of experience, I bring a robust skill set in **Python**, **Docker**, **AWS**, **Azure**, and **GCP** to develop high-performance machine learning solutions. I have extensive hands-on experience in integrating **LLM** technologies, including **Langchain**, **LlamaIndex**, and **Generative AI**, into scalable applications. My proficiency in building applications with **Streamlit** and **Gradio** enables me to create user-friendly interfaces that enhance model interaction. \nI excel in implementing **CI/CD** practices and **Infrastructure as Code (IaC)**, ensuring rapid, reliable deployment and operation of AI solutions. My background in **Caching**, **Parallelism**, and **Decoupling** allows me to optimize application architecture for performance and maintainability. \nIn addition to my technical skills, I possess strong problem-solving and critical thinking abilities, complemented by effective communication skills that facilitate collaboration with cross-functional teams. I have successfully led projects that leverage advanced **Prompt Engineering** and **LLM Architecture** to address complex challenges in the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** for developing advanced applications in the healthcare and financial sectors, integrating libraries like **Langchain** and **LlamaIndex** for enhanced functionalities and data processing.\nDesigned and implemented CI/CD pipelines leveraging **Git** and **Docker**, ensuring rapid and reliable deployment processes, with an emphasis on automation and efficiency.\nArchitected scalable solutions adopting **AWS** and **Azure** services while employing **IaC** principles to guarantee repeatable deployment and infrastructure management across environments.\nExecuted machine learning model development leveraging frameworks such as **Streamlit** and **Gradio**, facilitating real-time applications for generative AI use cases, including patient risk assessments and financial analytics.\nEmployed **Caching** techniques and **Parallelism** strategies to optimize performance across systems, focusing on loading times and processing speeds to enhance overall user experience.\nImplemented effective routing and asynchrony frameworks, ensuring smooth interaction across distributed services and high availability of applications.\nParticipated in design reviews and architecture discussions, showcasing strong problem-solving and critical thinking skills to address complex challenges in AI-driven projects.\nCollaborated with cross-functional teams to communicate requirements, progress, and solutions, enhancing team productivity and project success.\nIntegrated advanced **LLM Architecture** and **Prompt Engineering** techniques into frameworks, improving the performance of generative AI applications.\nEstablished best practices for **decoupling** components, resulting in more maintainable codebases and faster development cycles."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and deployed AI-driven solutions leveraging **Python** and cloud platforms (**AWS**, **Azure**, **GCP**) to enhance financial services and model performance.\nImplemented **Docker** containers for application deployment, ensuring efficient development and scaling of AI applications across environments.\nEmployed techniques like **Caching**, **Parallelism**, and **Asynchrony** to improve system performance, achieving a performance boost of **35%** in real-time response times.\nDesigned and optimized **LLM Architecture**, integrating **Langchain** and **LlamaIndex** for enhanced data retrieval in financial analytics.\nUtilized **Streamlit** and **Gradio** to create interactive dashboards for showcasing AI models and insights, resulting in a **25%** increase in user engagement with analytics tools.\nEstablished CI/CD pipelines using **Git** to streamline development and deployment processes, reducing deployment time by **50%**.\nFostered strong communication and problem-solving skills while collaborating with cross-functional teams to drive innovative solutions in financial technology.\nConducted prompt engineering for Generative AI models, continuously iterating to optimize outputs for predictive analytics in transaction processing."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** alongside **Langchain** and **LlamaIndex** for developing generative AI solutions, ensuring seamless integration within existing architectures to enhance performance and user engagement.\nEngineered and optimized the backend services for LLM applications using **Docker** and **CI/CD** pipelines, allowing for efficient deployment and management of machine learning models in the cloud environments of **AWS**, **Azure**, and **GCP**.\nImplemented efficient caching strategies and utilized parallelism techniques to enhance application performance when serving AI-driven responses, significantly reducing latency by **30%**.\nDeveloped solutions leveraging **Streamlit** and **Gradio** for building interactive data applications, providing innovative interfaces for users to interact with AI functionalities such as text generation and data visualization.\nDesigned asynchronous workflows for real-time processing of AI requests using **Python**, ensuring scalability and responsiveness under high load, thereby improving user experience by **20%**.\nCollaborated with cross-functional teams to apply role-based access control (RBAC) and **OAuth 2.0**, ensuring secure access to AI resources and compliance with data protection regulations throughout all deployments.\nApplied **problem-solving** and **critical thinking** to analyze performance data and refine prompt engineering techniques, enhancing the accuracy and effectiveness of AI outputs.\nUtilized **Git** for version control in collaborative environments, ensuring code integrity and facilitating seamless team collaboration on complex AI projects.\nBuilt and maintained infrastructure as code (IaC) setups to enable repeatable deployment of services across multiple environments, reducing deployment time by **50%**.\nCommunicated effectively with stakeholders to explain complex AI concepts and gather requirements, leading to the development of tailored solutions that meet business objectives."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Caching, Parallelism, Routing, Asynchrony, Decoupling, LLM, Langchain, LlamaIndex, Streamlit, Gradio, Problem-solving, Critical Thinking, Communication, Generative AI",
  "apply_company": "dLocal"
}