{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior AI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior AI Engineer with 8 years of experience, I possess strong expertise in **Python**, MLOps, and cloud services, specifically with **AWS**. I am skilled in developing high-performance AI/ML solutions with frameworks like **LangChain**, **LangGraph**, and integrating with technologies such as **OpenAI** and **Anthropic**. My experience extends to utilizing tools like **CrewAI**, **Qdrant**, **Milvus**, **Pinecone**, and **pgvector** for scalable AI applications. \nIn my previous roles, I have effectively developed enterprise-grade platforms within the healthcare and financial sectors, focusing on predictive analytics and real-time data processing, while ensuring compliance with industry standards. I have a solid foundation in constructs such as microservices architecture, event-driven systems, and CI/CD automation, combined with a deep understanding of observability practices. My dedication to developing secure and robust applications positions me to drive innovation and enhance system performance within your organization.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented advanced solutions leveraging **Python** for healthcare and financial applications, integrating **MLOps** principles to ensure scalable and efficient model deployment.\nDeveloped and optimized AI models using libraries such as OpenAI, LangChain, and LangGraph to enhance application capabilities, including patient risk prediction and fraud detection.\nArchitected cloud-native systems and integrated observability tools to monitor system performance and BI dashboards across **AWS** and **Azure**, ensuring high availability and compliance with financial regulations.\nImplemented AI-driven features and tools that utilize advanced vector databases including **Milvus**, **Pinecone**, and **pgvector**, promoting real-time insights and recommendations for users.\nDeployed machine learning models with high precision, utilizing cutting-edge technologies in **AWS Bedrock** and **Anthropic** for improved accuracy and responsiveness, with model versioning ensuring continual development efficiency.\nCollaborated closely with cross-functional teams to drive financial and retail solution integration, utilizing **crewAI** and **Agno** to enhance overall system security and architecture.\nLed projects applying complex nested machine learning models, deploying them into production with a focus on performance metrics, utilizing **LangSmith** for comprehensive tracking and maintenance.\nEstablished rigorous testing frameworks with **PyTest** and **Cypress** for continuous delivery, ensuring the reliability of AI features and integrations.\nDesigned and executed CI/CD pipelines using **GitHub Actions** and **Azure DevOps**, focused on security scans and multi-environment staging for AI models and applications.\nIntegrated cutting-edge search technologies like **LangFuse** and **ElasticSearch** to empower users with advanced search functionalities across extensive datasets."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and implemented AI/ML-powered solutions utilizing **Python** and integrating advanced technologies such as **LangChain**, **LangGraph**, and **Agno** to enhance financial systems and retail operations.\n• Leveraged **OpenAI** and **Anthropic** models to create intelligent features, improving security and user engagement in financial applications.\n• Built and optimized data pipelines for machine learning applications using **AWS Bedrock**, **Qdrant**, and **Milvus**, handling over **100,000** transactions daily with high efficiency.\n• Established MLOps practices for continuous integration and deployment of machine learning models, ensuring real-time observability and performance monitoring.\n• Designed event-driven architectures with tools like **Kafka** and **RabbitMQ**, facilitating seamless data flow and communication for fraud detection and automated alerts across financial platforms.\n• Implemented observability tools to monitor and analyze ML model performance, providing insights that improved prediction accuracy by **15%** within the first month of deployment.\n• Collaborated on cross-functional teams to integrate AI solutions into existing systems, driving a **30%** increase in operational efficiency across business units.\n• Participated in architecture design discussions to modernize financial platforms, improving maintainability and scalability by adopting microservices principles with frameworks like **Django** and **FastAPI**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and advanced AI frameworks like **LangChain** and **LangGraph** to design and optimize backend services, enhancing platform capabilities and ensuring integration with machine learning technologies.\nDeveloped and integrated models using **OpenAI** and **Anthropic** for natural language processing, contributing to intelligent workflows and improved retail user experiences.\nEngineered and implemented MLOps pipelines utilizing **Qdrant**, **Milvus**, and **Pinecone** for efficient management and deployment of AI models, achieving a deployment time reduction of **30%**.\nImplemented observability practices by utilizing **AWS Bedrock** for monitoring AI solutions, ensuring high service availability, with an uptime target of **99.9%**.\nBuilt secure and efficient data storage solutions integrating **Pgvector** with **PostgreSQL** and **MongoDB** to support AI model data handling, ensuring compliance with security standards and fast data retrieval.\nDesigned and deployed responsive AI-driven UIs using **React** and **HTML5/CSS3**, ensuring optimal performance with a focus on mobile-first design.\nApplied role-based access control (RBAC) and OAuth 2.0 protocols for secure user authentication and data protection, ensuring adherence to security regulations, including GDPR compliance.\nCollaborated in cross-functional teams to define AI project requirements, enhancing understanding of customer needs and improving service offerings in the financial and retail sectors.\nRegularly enhanced AI model performance by incorporating feedback loops and real-time data analytics, driving incremental improvements in system recommendations by **15%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOpenAI, Anthropic, Gemini\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), AWS Bedrock, Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, pgvector\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tcloud, observability\n\n**Other:**\n\tLLM, LangChain, LangGraph, Agno, CrewAI, Qdrant, Milvus, Pinecone, LangFuse, LangSmith, MLOps, financial, retail, security",
  "apply_company": "Tymit"
}