{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in delivering high-performance applications, specifically in the development of robust solutions using **C++**, **Qt**, and **Linux** environments. Demonstrated proficiency in leveraging **DBus** for inter-process communication and utilizing **OpenTelemetry** for observability in microservices. Proven track record in project management and leading teams, showcasing strong collaboration and teamwork skills.\n\nAdditionally skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with extensive hands-on experience in frontend and backend development through frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms that support predictive analytics, automation, and real-time processing. Proficient in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, event-driven architectures, and CI/CD pipelines. Well-versed in compliance-driven development, ensuring alignment with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong background in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Linux** to develop and maintain robust software environments, ensuring seamless integration with existing tools and services.\nImplemented **C++** and **Qt** for building high-performance applications, improving execution speed by **30%** compared to legacy solutions.\nEmployed **Bash** scripting to automate repetitive tasks, resulting in operational efficiency gains of up to **25%**.\nManaged project timelines and deliverables using **Jira**, applying strong **Project Management** skills to deliver projects on time.\nCollaborated with cross-functional teams to enhance **Teamwork** dynamics, fostering a culture of collective problem-solving and innovation.\nLed a diverse group of engineers, demonstrating effective **Leadership** capabilities to inspire and achieve collective goals.\nDesigned and built full-stack platforms for healthcare and fintech, integrating technologies such as **Python (FastAPI)**, **TypeScript**, and **Node.js**, while ensuring compliance with regulations such as HIPAA and PCI DSS.\nDelivered mobile applications for iOS and Android using **Flutter** and **React Native**, implementing native modules for secure, real-time user interactions.\nCreated CI/CD pipelines utilizing tools like **Fastlane** and **App Center**, incorporating test automation and release workflows to reduce deployment times significantly.\nTransformed legacy systems into microservices architectures leveraging **Docker** and **Kubernetes (AKS/EKS)** for scalable deployments.\nBuilt and maintained data infrastructure using technologies like **PostgreSQL** and **MongoDB**, optimized for real-time analytics in the healthcare and finance sectors.\nDeployed ML models for risk scoring and fraud detection using frameworks such as **scikit-learn** and **TensorFlow**, ensuring efficient real-time inference.\nImplemented MLOps workflows to streamline model training and deployment, enhancing deployment efficiency across development and production environments.\nIntegrated advanced data visualization tools with **D3.js** and **Power BI Embedded**, facilitating real-time analysis of critical operational KPIs."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Demonstrated expertise in **Linux** systems, ensuring optimal performance and reliability of financial platforms.\n• Led project management initiatives using **Jira** to track progress and collaborate with cross-functional teams, fostering **teamwork** and effective communication.\n• Utilized **Bash** scripting for automating deployment processes, enhancing efficiency in software operations.\n• Showcased **leadership** by mentoring junior developers and guiding project teams in adopting best practices for code quality and performance.\n• Fostered a collaborative environment, implementing Agile methodologies to streamline development cycles and improve turnaround time by up to **30%**.\n• Managed project timelines effectively, ensuring delivery milestones were met consistently with **90%** adherence to deadlines.\n• Spearheaded the transition to **OpenTelemetry** for better observability, improving debugging and performance monitoring across applications.\n• Developed C++ modules in conjunction with **Qt** for high-performance user interfaces in financial applications, achieving enhancements in user experience with **50%** faster load times.\n• Integrated **DBus** for inter-process communication, facilitating modular design and enhancing system scalability."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Linux** and **Bash** to develop and maintain scalable backend services, ensuring secure and efficient deployment processes for a global e-commerce platform.\nEmployed project management methodologies and tools like **Jira** to manage workflows, coordinate tasks, and foster teamwork within the development team.\nDemonstrated leadership in cross-functional team environments, ensuring project goals are met on time, specifically driving initiatives for system optimizations that improved service uptime by **30%**.\nDesigned and implemented backend services using **C++** and **Qt** for performance-critical components, enhancing processing speed by **25%** and decreasing latency.\nIntegrated **OpenTelemetry** for distributed tracing and monitoring across microservices, improving incident response times by **40%**.\nSpearheaded feature enhancements using **Weston** and **DBus** for seamless interoperability between software components, ensuring a smooth user experience across diverse applications.\nDemonstrated strong analytical skills by leading the evaluation and adoption of new technologies that align with organizational goals, incorporating them into the existing tech stack to drive innovation."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\tC++\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tOpenTelemetry\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS\n\tAzure\n\n**Other:**\n\tLinux\n\tBash\n\tDBus\n\tJira\n\tProject Management\n\tTeamwork\n\tLeadership\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tMLflow\n\tAirflow\n\tKubeflow",
  "apply_company": "Brightstar Lottery"
}