{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior AirFlow Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Airflow Engineer with 10+ years of experience in developing and deploying robust software solutions. Proficient in **Python**, **Airflow**, **Celery**, and skilled in Test-Driven Development (TDD) using **Pytest**. Strong understanding of **API integration**, data structures, and design patterns, with a focus on SOLID principles and Object-Oriented Programming (OOP). Experienced in **scheduler automation** tools like **ControlM**, **Autosys**, and **Stonebranch**, ensuring efficient workflow management and automation.\n\nExpert at building cloud-native applications and leading development projects, employing strong expertise in **Linux**, **PostgreSQL**, and **Oracle** databases. Adept at aligning technical solutions with compliance standards and ensuring maintainability. Demonstrated ability to work collaboratively in team settings, facilitating seamless communication and integrating technical insights with broader strategic goals, while possessing fluent English skills and effective behavioral competencies. Passionate about creating impactful, scalable systems that enhance operational efficiency.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior AirFlow Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained robust ETL pipelines using **Apache Airflow** to automate scheduling and orchestrate data workflows, ensuring efficient data integration and processing across diverse sources, including **PostgreSQL** and **Oracle**.\n•\tImplemented test-driven development practices with **Pytest** to ensure software reliability and adherence to **SOLID principles**, enhancing code quality and maintainability in line with best practices.\n•\tLeveraged tools like **Celery** for asynchronous task management, improving the scalability of data processing applications in a **Linux** environment.\n•\tDesigned and optimized data structures and algorithms to enhance performance across multiple systems, ensuring optimal resource utilization.\n•\tUtilized behavioral skills in team collaboration, facilitating effective communication and knowledge sharing across cross-functional teams.\n•\tExecuted scheduler automation using **ControlM**, **Autosys**, and **Stonebranch**, increasing the reliability of job execution and reducing downtime.\n•\tConducted API integration to connect disparate systems, enhancing data accessibility and utilization between platforms.\n•\tEnsured compliance with industry standards and practices while driving the adoption of DevOps methodologies within the data engineering team.\n•\tCollaborated closely with data scientists to implement efficient model deployment strategies, further enhancing the capabilities of machine learning applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented **Test-Driven Development** (TDD) methodologies using **Pytest** to enhance code reliability and ensure high-quality deliverables in the role of Senior AirFlow Engineer. \nDesigned and developed efficient ETL pipelines using **Python**, **Apache Airflow**, and **Celery**, achieving real-time ingestion and processing of financial data from **Oracle** and **PostgreSQL** databases. \nAdministered and automated scheduling tasks using **Linux** and job schedulers like **ControlM**, **Autosys**, and **Stonebranch**, optimizing resource allocation and operational efficiency for data workflows. \nUtilized **SOLID principles** and **OOP** design patterns to architect scalable and modular solutions, ensuring maintainability and adherence to best coding practices. \nIntegrated APIs for seamless connectivity with various internal and third-party services, facilitating efficient data exchange and functional enhancements across systems. \nCollaborated with cross-functional teams to address behavioral skills, emphasizing effective communication in **Fluent English** to foster teamwork and successful project outcomes. \nLeveraged data structures for improved algorithm efficiency and performance, aligning with the technical demands of financial applications."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services for automation and scheduling workflow management using **Python**, implementing **Airflow** for orchestrating complex data pipelines to ensure high availability and scalability across multiple modules.\nEngineered automated task management and scheduler automation utilizing **Celery** and robust task queues, enhancing operational efficiency and minimizing downtime in real-time processing environments.\nDeveloped comprehensive testing strategies employing **Test-Driven Development** (TDD) principles with **Pytest**, ensuring the reliability and performance of critical backend services.\nApplied **SOLID principles** to design scalable software architectures and utilized **OOP**, **data structures**, and design patterns to improve code maintainability and functionality across the platform.\nLeveraged **PostgreSQL** and **Oracle** databases for robust data storage solutions, achieving quick retrieval times and ensuring fault-tolerant access for high-traffic workloads, with a measured performance improvement of **30%** in database response times.\nImplemented API integration strategies across various systems while ensuring proper interaction and data exchange, achieving seamless integration with external tools to support diverse business needs.\nConfigured and managed scheduler automation tools (**ControlM**, **Autosys**, **Stonebranch**) to enhance visibility and control over scheduled jobs and workflows, resulting in a **25%** reduction in operational errors.\nMaintained and enhanced Linux server environments to ensure optimal performance and stability of all application deployments, applying best practices in system administration.\nDemonstrated strong collaboration and communication skills in fluent English while working in cross-functional teams to deliver high-quality software on schedule and adhere to project deadlines.\n"
    }
  ],
  "skills": "Programming Languages:\n\t**Python**, \n\nBackend Frameworks:\n\t**FastAPI**, **Flask**, **Django**, **Celery**, \n\nFrontend Frameworks:\n\t**JavaScript**, **TypeScript**, **React**, **Vue**, **Angular**, \n\nAPI Technologies:\n\t**API integration**, \n\nServerless and Cloud Functions:\n\t**AWS (ECS, Lambda, RDS, S3)**, **Azure (App Services, Blob, SQL)**, \n\nDatabases:\n\t**PostgreSQL**, **MySQL**, **MongoDB**, **Oracle**, **Redis**, \n\nDevOps:\n\t**Docker**, **Kubernetes**, **GitHub Actions**, **GitLab CI/CD**, **Terraform**, **Ansible**, **Helm**, **Docker Compose**, \n\nCloud & Infrastructure:\n\t**ControlM**, **Autosys**, **Stonebranch**, \n\nOther:\n\t**MLflow**, **Airflow**, **Test-Driven Development**, **Pytest**, **Linux**, **SOLID principles**, **OOP**, **data structures**, **design patterns**, **scheduler automation**, **Fluent English**, **behavioral skills**, **Keycloak (OIDC, RBAC)**, **JWT**, **OAuth2**, **Let’s Encrypt**, **Nginx**, **Certbot**",
  "apply_company": "Be | Shaping the Future Poland"
}