{
  "name": "Tomasz Lee",
  "role_name": "Senior iOS Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled Senior iOS Developer with 9+ years of experience in mobile application development, specializing in **Swift**, **SwiftUI**, and **UIKit**. Expertise in building RESTful APIs and employing MVVM design patterns to ensure effective communication between components. Proficient in using **Xcode** for app development, implementing **Concurrency** for optimized performance, and adhering to **UI/UX Principles** and **Apple's Human Interface Guidelines**. Strong knowledge of **Core Data** and **Swift Data** for efficient data management. Experienced in utilizing **Git** and **Github Actions** for version control and CI/CD pipelines. Proven leader with a problem-solving mindset and excellent communication skills, capable of driving collaboration across teams while delivering high-quality mobile solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Swift** and **SwiftUI** to design and develop a high-performance iOS application, resulting in a 30% increase in user engagement.\nApplied **UIKit** for creating responsive and intuitive user interfaces, in line with **Apple's Human Interface Guidelines**, enhancing user experience by 20%.\nImplemented **RESTful APIs** to facilitate seamless data communication between the app and backend services.\nDeveloped MVVM architecture to promote code reusability and maintainability, ensuring an efficient development process.\nUtilized **Xcode** for building and debugging, optimizing workflow efficiency with **Git** for version control and collaboration.\nEstablished automated CI/CD pipelines with **Github Actions**, leading to a deployment time reduction of 35%.\nConducted comprehensive unit and UI testing to ensure application reliability, achieving a 98% pass rate in tests.\nEnhanced app performance by optimizing concurrency features in **Swift**, significantly improving resource utilization.\nFacilitated team collaboration and maintained clear communication lines to ensure project milestones were met on time and within budget.\nDemonstrated leadership by mentoring junior developers, fostering a culture of problem-solving and innovation within the team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and maintained high-quality **RESTful APIs** to ensure efficient data access and communication between iOS applications and back-end services.\nDesigned intuitive app interfaces adhering to **UI/UX Principles** and **Apple's Human Interface Guidelines**, enhancing user satisfaction by 30%.\nLed the implementation of **CI/CD** pipelines using **GitHub Actions**, streamlining the deployment process and reducing errors by 25%.\nImplemented **Swift**, **SwiftUI**, and **UIKit** to create robust iOS applications, ensuring seamless user experiences across different devices and iOS versions.\nUtilized **Concurrency** in **Swift** to enhance application performance and responsiveness, achieving a 20% reduction in load times.\nConducted **Unit Testing** and **UI Testing** to maintain high application standards and ensure reliability across multiple mobile versions, improving overall app stability by 15%.\nCollaborated effectively with cross-functional teams to understand requirements and develop project timelines, successfully delivering 5+ projects on schedule.\nMentored and guided junior developers through code reviews and knowledge sharing sessions, fostering a collaborative and productive work environment.\n\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and maintained high-quality iOS applications using **Swift** and **SwiftUI**, ensuring adherence to Apple's Human Interface Guidelines.\nImplemented **RESTful APIs** for efficient data retrieval and communication, enhancing app functionality and user experience.\nUtilized **Concurrency** handling to optimize app performance, resulting in a 30% reduction in load times across devices.\nDesigned UI components following **UI/UX principles**, achieving a 25% increase in user satisfaction ratings based on feedback.\nLed unit testing initiatives using **Xcode** to ensure robust application performance, achieving over 90% test coverage.\nCollaborated with cross-functional teams to integrate third-party **APIs**, successfully launching 3 major updates within a quarter.\nManaged source code in **Git** and ensured continuous integration through **Github Actions**, reducing deployment times by 40%.\nParticipated in CI/CD processes that streamlined app releases to production environments, improving overall team efficiency.\nMentored junior developers in applying **MVVM** architecture patterns, cultivating a culture of knowledge sharing and collaboration.\nFacilitated effective communication across teams, enhancing problem-solving capabilities and project alignment."
    }
  ],
  "skills": "**Programming Languages**\n\tSwift, JavaScript, TypeScript, Python, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, SwiftUI, UIKit, Flutter, Material UI, Three.js, D3.js, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful APIs, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Core Data\n\n**DevOps**\n\tCI/CD pipelines, Git, GitHub, Github Actions\n\n**Cloud & Infrastructure**\n\tMicroservices\n\n**Other**\n\tUI/UX Principles, Apple's Human Interface Guidelines, Concurrency, UI Testing, Unit Testing, Testing Tools (NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest), Communication, Problem-Solving, Leadership"
}