{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior SAP Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior SAP Engineer with 13+ years of experience in delivering high-performance solutions with a focus on configuration, troubleshooting, and root-cause analysis in the SAP environment. Highly proficient in providing technical support while leveraging strong analytical skills to solve complex problems effectively and enhance system performance.\nDemonstrated excellence in cross-functional collaboration and communication, facilitating seamless interactions with stakeholders and team members. Original strengths include an extensive tech stack encompassing **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.\nExpert in AI/ML-powered platform development for predictive analytics, with hands-on experience deploying cloud-native systems on **AWS** and **Azure** and implementing microservices and CI/CD pipelines. Committed to compliance-driven development, aligning solutions with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior SAP Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Provided **technical support** and **troubleshooting** for SAP applications, ensuring configurations met business requirements in UK Payroll systems, leading to a **30% reduction** in configuration errors.\n- Conducted **root-cause analysis** on payroll discrepancies, collaborating with cross-functional teams to implement solutions that improved processing time by **25%**.\n- Utilized **analytical skills** to analyze system performance data, creating reports that informed decision-making and increased operational efficiency by **15%**.\n- Communicated effectively with stakeholders to gather requirements and translate them into SAP solutions, fostering **collaboration** across departments.\n- Configured and customized SAP modules, ensuring alignment with the UK's payroll legislation and tax regulations, enhancing compliance and accuracy of payroll processing.\n- Led workshops and training sessions on SAP functionalities, enhancing team knowledge and ensuring smooth operation of payroll services.\n- Developed documentation and knowledge repositories for SAP configurations and troubleshooting processes, streamlining future support efforts.\n- Participated in system upgrade initiatives, providing insights based on previous experience, which resulted in an **85% success rate** in minimizing downtime during upgrades.\n- Engaged in continuous improvement activities, leveraging feedback from users to identify gaps in current SAP systems and propose actionable recommendations.\n- Fostered a culture of **problem-solving** within the team, encouraging innovative approaches to overcoming system challenges."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Provided **technical support** for SAP platforms, ensuring seamless configuration and troubleshooting for **UK Payroll** systems, leading to a **20% reduction** in processing errors.\nConducted **root-cause analysis** on system issues, improving incident resolution time by **30%** through effective documentation and problem-solving strategies.\nCollaborated cross-functionally with finance and IT teams, enhancing communication and project alignment to streamline SAP optimization efforts.\nDeveloped and executed training sessions for end-users, improving adoption of SAP solutions, resulting in a **15% increase** in user efficiency.\nUtilized **analytical skills** to interpret data and generate reports, delivering actionable insights that influenced project decisions.\nLed a project to enhance system performance through configuration adjustments, achieving a **25% speed improvement** in data processing.\nEngaged in continuous improvement initiatives, employing feedback mechanisms that foster cross-functional collaboration and resolve inter-departmental challenges."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Provided technical support and troubleshooting for SAP configurations, ensuring seamless integration with UK Payroll systems to enhance operational efficiency.\nConducted root-cause analysis for system discrepancies within SAP environments, employing analytical skills to diagnose and resolve complex issues, reducing resolution time by **30%**.\nCollaborated cross-functionally with finance and HR teams to configure SAP modules tailored specifically for payroll processing, achieving a **25%** reduction in processing errors.\nOptimized existing SAP configurations through detailed documentation and communication with stakeholders, resulting in improved user satisfaction scores reflected in a **15%** increase in positive feedback.\nDeveloped and implemented training materials to bolster understanding of SAP functionalities among users, enhancing overall team communication and productivity.\nIdentified and documented technical issues in SAP systems, leading to the creation of effective troubleshooting guides that improved operational efficiency for the support team.\nEngaged in problem-solving initiatives to streamline payroll processing cycles, leveraging SAP tools to automate manual processes and enhance data accuracy.\nActively participated in cross-functional meetings to share insights on SAP performance and configuration updates, ensuring alignment with organizational objectives and fostering a collaborative work environment.\nUtilized advanced analytical methods in SAP to track configurations and identify improvement areas, leading to data-driven decisions that support business goals."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tSAP, UK Payroll, configuration, troubleshooting, root-cause analysis, technical support, analytical skills, problem-solving, communication skills, cross-functional collaboration",
  "apply_company": "Support Revolution"
}