{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Software Engineer with 13+ years of experience specializing in data modeling, data quality assurance, and database environments. Proficient in **Oracle**, **PL/SQL**, and **Oracle 19c** with a strong focus on creating effective data access functions and enhancing test data extraction processes, including anonymization of test data.\nSkilled in cross-functional collaboration and fluent in both German and English, enabling seamless communication with diverse teams. Additionally, experienced in delivering applications within the healthcare and financial sectors, leveraging advanced technologies such as **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Well-versed in implementing cloud-native systems with **AWS** and **Azure** while adopting microservices and CI/CD strategies. Strong capabilities in compliance-driven development, ensuring alignment with standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Executed data modeling initiatives using **Oracle 19c** and **SAP PowerDesigner**, ensuring high-quality data structures to meet project specifications and standards.\nDeveloped and optimized **PL/SQL** procedures for efficient data access functions, enhancing performance by **30%** through code refactoring and best practices.\nConducted comprehensive data quality assurance, implementing automated validation checks that reduced data errors by **25%** across database environments.\nFacilitated the creation and management of anonymization of test data protocols to ensure compliance with data protection regulations, enhancing the security of sensitive information.\nCollaborated in a multilingual team environment, utilizing proficiency in **German** and **English** to communicate effectively with stakeholders and facilitate project deliverables.\nDesigned and executed test data extraction strategies, leading to a **40%** reduction in manual effort and improving overall testing efficiency in development cycles.\nStreamlined database environments through the implementation of best practices for Oracle management, optimizing storage and retrieval processes for improved application performance.\nPerformed detailed assessments and analyses to drive data quality improvements, ensuring reliable data usage for both operational and analytical purposes.\nParticipated in agile ceremonies, contributing to sprint planning, retrospectives, and daily stand-ups, empowering cross-functional collaboration and enhancing team productivity."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented data access functions using **PL/SQL** and **Oracle 19c** to efficiently manage and query financial data within the database environments.\nConducted data quality assurance processes to ensure the accuracy and reliability of data used in high-volume transactional systems, expediting error resolution by **35%**.\nDesigned and developed comprehensive data models in **SAP PowerDesigner**, contributing to improved data organization and accessibility, achieving a streamlined data retrieval process with **25%** increased efficiency.\nPerformed test data extraction and anonymization of test data, ensuring compliance with industry standards and regulations while facilitating secure testing environments for developers.\nCollaborated with cross-functional teams to optimize database queries and improve system performance by analyzing data patterns, resulting in a **20%** reduction in response times for critical applications.\nFluently communicated in both **German** and **English**, enhancing collaboration with international teams and stakeholders throughout software development life cycles."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Oracle 19c** and **PL/SQL** for efficient data modeling and design within backend services, enhancing data quality assurance and ensuring robust data access functions.\nExecuted test data extraction methodologies in diverse database environments, facilitating effective anonymization of test data to meet compliance and security requirements.\nCollaborated with teams to develop **SAP PowerDesigner** models for superior data visualization, contributing to a structured approach in data management and enhancing workflow efficiencies across the organization.\nDemonstrated bilingual proficiency in **German** and **English**, fostering effective communication and collaboration within multinational teams.\nEnsured adherence to best practices in data quality assurance, significantly improving data integrity and consistency across various applications.\nApplied advanced data modeling techniques to anticipate and meet business needs, achieving a 30% reduction in data retrieval times.\nImplemented enhancements in data access functions, leading to a 25% increase in operational efficiency during peak data load periods.\nConducted comprehensive testing procedures to validate data extraction processes, ensuring 100% compliance with data security standards."
    }
  ],
  "skills": "**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Oracle, PL/SQL, Oracle 19c\n\n**Frameworks & Technologies**\n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular\n\n**Other**\n\tSAP PowerDesigner, data modeling, data quality assurance, data access functions, test data extraction, anonymization of test data, database environments, German, English\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**DevOps & Cloud**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**CI/CD & Infrastructure as Code**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**API Technologies**\n\t\n\n**Serverless and Cloud Functions**\n\t\n\n**Frontend Frameworks**\n\t\n\n**Backend Frameworks**\n\t"
}