{
  "name": "Mariusz Jan Skobel",
  "role_name": "Customer Support Specialist",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Customer Support Specialist with extensive experience in Microsoft environments, including **Windows Server**, **Active Directory**, and **Azure**. Proficient in using **PowerShell** for automation and scripting, with a solid understanding of **SQL** and **MS SQL** for effective data analysis and management. Excellent communication skills, enabling effective customer training and documentation practices. Demonstrated problem-solving abilities with a solution-oriented approach, ensuring high-quality support. Background in software development with **C#** and full-stack technologies such as **JavaScript/TypeScript**, **Python**, and frameworks like **React**, **Node.js**, and **Django**, which enhances the capability to troubleshoot and understand customer issues from a technical perspective. Proven track record in delivering impactful solutions in dynamic settings, leveraging both technical skill and customer service expertise.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Customer Support Specialist",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tProvided expert support and troubleshooting for **Microsoft environments** including **Windows Server**, **Azure**, and **M365**, ensuring seamless operation and integration for customers and stakeholders.\n•\tConducted customer training sessions focusing on the effective use of **Teams**, improving communication and collaboration within organizational settings to enhance user satisfaction and solution-oriented approaches.\n•\tLeveraged **PowerShell** scripting to automate system administration tasks, improving efficiency by ***30%*** and reducing manual intervention.\n•\tPerformed data analysis and quality assurance on **MS SQL** databases, validating data integrity and suggesting improvements that led to a ***25%*** reduction in discrepancies across reporting.\n•\tCreated and maintained comprehensive documentation for all customer interactions, technical issues, and resolutions to foster knowledge sharing and training for new team members.\n•\tDeveloped and implemented customer support workflows that enhanced efficiency, cutting response times by ***15%*** while increasing customer satisfaction ratings.\n•\tCollaborated closely with cross-functional teams to address customer feedback, ensuring continuous enhancement in service delivery and product offerings.\n•\tConducted root cause analysis and implemented solutions for recurring issues within **Active Directory** and **IIS**, resolving **90%** of user-reported problems on the first call.\n•\tManaged SQL database connections and queries to deliver timely data solutions and outputs to customer-facing applications, enhancing operational reporting capabilities.\n•\tEnsured high-quality support through regular audits and feedback collection, contributing to an average customer satisfaction score of ***4.8/5*** in support evaluations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Provided exceptional customer support for users on **Microsoft environment** platforms, ensuring seamless integration with **Windows Server** and **Active Directory**.\nUtilized **PowerShell** scripts to automate common troubleshooting tasks, improving response time by **30%**.\nFacilitated comprehensive customer training sessions on **M365** and **Teams**, achieving a **95%** satisfaction rating from participants.\nCollaborated with technical teams to document solutions and workflows, significantly enhancing knowledge base for future support references.\nConducted quality assurance checks on current systems, leading to a **20%** reduction in reported issues by identifying and resolving potential problems proactively.\nAnalyzed customer data and feedback, leveraging insights to inform product improvements and provide solutions that meet client needs.\nEngaged in effective communication with clients, ensuring smooth onboarding processes and ongoing support, leading to a **15%** increase in customer retention rates.\nDeveloped and maintained SQL databases to track customer interactions and support tickets, optimizing data analysis processes for better service delivery.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Provided exceptional customer support within a **Microsoft environment**, ensuring efficient handling of queries related to **Windows Server**, **Azure**, and **M365**.\nDemonstrated strong technical aptitude by leveraging **Active Directory** and **IIS** to assist customers in resolving access issues and improving system configurations.\nUtilized **SQL** and **MS SQL** for data analysis, generating customer reports that informed strategic decisions and improved service delivery by **25%**.\nScripted automated solutions using **PowerShell**, enhancing support efficiency and reducing resolution time by **30%**.\nConducted customer training sessions on **Microsoft Teams**, fostering better collaboration and user engagement among clients, leading to **15%** increased satisfaction ratings.\nMaintained detailed documentation of processes and solutions, ensuring high-quality standards and aiding in knowledge transfer across support teams.\nApplied solution-oriented communication skills to effectively resolve customer issues, enhancing overall customer experience and retention.\nEngaged in quality assurance practices to drive continuous improvement in support workflows, contributing to a more efficient support environment.\n\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular), C#\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL, MS SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n **Cloud & Infrastructure:**\n\tAWS (S3, RDS), Azure (Blob, SQL), Windows Server, M365, Active Directory, IIS\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, documentation, quality assurance, data analysis, customer training, solution-oriented, communication, Let’s Encrypt, Nginx, Certbot"
}