{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior .NET Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior .NET Engineer with 13+ years of experience in developing high-performance applications, specializing in **.NET**, **C#**, and **SQL Server**. Expert in designing and implementing robust solutions using **.NET Core**, **WCF**, and **Visual Studio**, ensuring code quality through tools like **Sonar**. Proficient in ETL processes and equipped with a strong command of English for effective communication.\n\nAdditionally, I bring extensive experience in full-stack development, leveraging **JavaScript/TypeScript**, **Python**, and **Flutter**. My background includes building AI/ML-powered platforms with predictive analytics capabilities and deploying cloud-native systems on **AWS** and **Azure**. Familiar with compliance-driven development aligned with regulatory standards such as HIPAA and PCI DSS, while also being well-versed in MLOps practices including model training and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior .NET Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained enterprise-level applications using **.NET Core** and **C#**, ensuring high performance and scalability across multiple platforms.\n- Collaborated on database design and management using **SQL Server**, optimizing complex queries and improving data retrieval times by up to **50%**.\n- Utilized **Visual Studio** for debugging and enhancing application performance, leading to a reduction in error rates by **30%**.\n- Implemented and maintained RESTful services using **WCF**, ensuring efficient communication between microservices and legacy systems.\n- Designed and executed complex ETL processes using **Sonar** to streamline data integration and improve data quality metrics.\n- Led code reviews and established best practices, enhancing code quality and maintainability with tools like **Sonar** for continuous improvement.\n- Communicated effectively in English with cross-functional teams to gather requirements and provide tailored solutions based on stakeholder objectives.\n- Integrated third-party tools and libraries such as **Jquery** to enhance user interface functionality and responsiveness, improving user experience by **40%**.\n- Conducted comprehensive testing strategies that resulted in a **20%** overall reduction in time to deploy while maintaining high code coverage rates.\n- Participated in maintaining and enhancing system security protocols, ensuring compliance with industry standards and safeguarding sensitive data."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented backend solutions utilizing **.NET** and **C#** to modernize core financial systems, improving system efficiency and reducing downtime by **30%**.\nDesigned and maintained databases using **SQL Server**, ensuring robust data integrity and performance optimization, resulting in a **25%** increase in query speed.\nDeveloped and supported ETL processes for financial data ingestion using **ETL** tools, enabling streamlined data transformation and loading while maintaining compliance with data governance standards.\nCollaborated with cross-functional teams to create a seamless integration with existing systems, employing **WCF** for communication, thereby achieving a cohesive architecture.\nUtilized **Visual Studio** for efficient development and debugging, resulting in quicker turnaround times and enhanced code quality with the integration of **Sonar** for continuous code quality checks.\nEmployed **JQuery** for improving UI functionalities, enhancing user experience on financial applications, achieving a **40%** increase in user engagement.\nConducted code reviews and provided mentorship to junior developers, fostering a collaborative and knowledge-sharing environment that led to an overall productivity boost of **15%** across the team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust applications using **.NET Core**, **C#**, and **SQL Server**, ensuring high-performance and scalable solutions for critical business functions.\n- Implemented ETL processes for efficient data management and migration, utilizing **Visual Studio** as the primary development environment to streamline workflows.\n- Fostered code quality and maintainability through the use of **Sonar** for continuous inspection, ensuring adherence to best practices and standards.\n- Collaborated in a team environment, utilizing **WCF** for service-oriented architecture, driving effective communication between distributed applications.\n- Enhanced user experiences by integrating **jQuery** to facilitate dynamic front-end functionalities, significantly improving interactivity across applications.\n- Engaged with stakeholders to gather requirements, deliver technical documentation, and provide updates in fluent **English**, ensuring all project objectives were met efficiently.\n- Actively monitored application performance, addressing identified bottlenecks to maintain an average response time of **<200ms** under peak loads.\n- Conducted training and mentorship for junior developers, contributing to team skill development and fostering a culture of excellence across projects.\n- Implemented version control practices using Git, tracking changes over **50+** projects and supporting team collaboratives effectively.\n- Spearheaded the integration of third-party tools and frameworks, improving development efficiency and capacity for larger scale applications."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, .NET, .NET Core, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, WCF\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, jQuery\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL Server\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Sonar\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, ETL, English, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot",
  "apply_company": "KAIROS DIGITAL SOLUTIONS"
}