{
  "name": "Tomasz Lee",
  "role_name": "Senior Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Engineer with 9+ years of experience in designing and implementing complex applications, specializing in **distributed systems** and **containerization**. Proficient in **Cloud services (AWS, Cloudflare)** and experienced with **Infrastructure as Code (Terraform, Ansible, Puppet)** to ensure robust cloud management and automation. Strong background in **PostgreSQL** and adept at scripting with **Bash**. Familiar with **Linux**, **Debian**, **Go**, and **Python** to enhance system performance and security best practices. Proven ability to lead development projects, streamline processes, and foster effective communication across teams, while delivering high-quality solutions using technologies like **ReactJS**, **NextJS**, **.NET**, **C#**, and messaging systems such as **Apache Kafka** and **RabbitMQ**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **AWS** cloud services to deploy a web-based customer management platform, enhancing infrastructure scalability and resilience.\nImplemented Infrastructure as Code (IaC) using **Terraform** for automated deployment and management of cloud resources, reducing manual intervention by 60%.\nDesigned and developed distributed systems architecture using **Docker** for containerization, increasing deployment efficiency by 30%.\nUtilized **PostgreSQL** for database management, optimizing performance with advanced indexing and query optimization, achieving a **20%** reduction in average query execution time.\nAutomated system provisioning and configuration management with **Ansible**, leading to improved compliance with security best practices.\nImplemented robust networking strategies to secure cloud infrastructure, adhering to **Linux** best practices for secure server management.\nSuccessfully developed automation scripts in **Python** and **Bash**, reducing manual tasks by **40%**.\nCollaborated effectively with cross-functional teams to meet project milestones, enhancing overall communication and project delivery timelines.\nMaintained detailed documentation of architecture and processes, ensuring continuity and knowledge sharing across teams."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **Infrastructure as Code** using **Terraform** and **Ansible** to automate deployment processes, achieving a 35% reduction in deployment times.\nManaged **Cloud** resources on **AWS** and **Cloudflare**, ensuring 99.9% uptime and improving security compliance by 20%.\nDesigned and optimized **PostgreSQL** databases for streamlined data access and storage, decreasing query response times by 30%.\nDeveloped distributed systems architecture utilizing **Go** and **Python** for backend services, enhancing scalability and resilience of applications.\nConfigured and maintained Linux-based systems, ensuring effective networking and security best practices to minimize vulnerabilities.\nConducted automated tests and utilized **Bash** scripts for routine tasks, increasing operational efficiency by 40%.\nLed the implementation of containerization solutions using **Docker**, improving deployment consistency across environments by 50%.\nCollaborated with cross-functional teams to define system requirements and enhance communication, resulting in a 25% increase in project delivery speed.\nMentored junior engineers and promoted knowledge sharing sessions, improving team collaboration and skills development.\nUtilized documentation tools and best practices to maintain clear communications and project status updates, enhancing stakeholder engagement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **AWS** and **Cloudflare** for scalable cloud solutions, enhancing infrastructure reliability by **30%**.\nImplemented Infrastructure as Code using **Terraform** and **Ansible** to automate environment setup, reducing deployment time by **50%**.\nDeveloped and maintained distributed systems with a focus on security best practices, resulting in a **40%** improvement in system security posture.\nLeveraged **PostgreSQL** for database management, optimizing query performance and ensuring efficient data handling.\nCreated containerized applications using **Docker** to streamline development processes and maintain consistent environments.\nUtilized **Linux** systems for server administration and maintenance, ensuring high availability and performance.\nScripting with **Bash** enhanced automation tasks, saving the team **25%** in manual operational efforts.\nCollaborated on networking solutions to support application connectivity and data flow across services.\nEmployed **Go** and **Python** for scripting and application development, boosting team productivity by developing internal tools.\nEngaged in effective communication with cross-functional teams to align development efforts with project goals.\nParticipated in code reviews and provided mentorship to junior engineers, enhancing team knowledge and code quality."
    }
  ],
  "skills": "**Programming Languages**\n\tGo, Python, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Cloudflare\n\n**Databases**\n\tPostgreSQL, MSSQL Server, MySQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Cloud (AWS, Cloudflare), Infrastructure as Code (Terraform, Ansible, Puppet), Containerization, Automation\n\n**Cloud & Infrastructure**\n\tLinux, Debian, Networking, Security best practices\n\n**Other**\n\tUX/UI Design, Git, GitHub, Messaging & Caching (Apache Kafka, RabbitMQ, Redis), Testing Tools (NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest), Communication, Distributed systems"
}