{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Senior Engineer with 8 years of expertise in full-stack development, proficient in **React**, **TypeScript**, **Next.js**, **Python**, and experienced in building scalable solutions leveraging **AWS** services. Adept in implementing and optimizing **CI/CD** pipelines using **GitHub Actions** to ensure smooth deployment processes. Skilled in developing APIs utilizing **REST** and **GraphQL** standards, enhancing system interoperability and efficiency. \n\nMy background includes significant contributions to high-performance applications across healthcare and financial sectors, demonstrating a strong commitment to quality through thorough **Code Reviews** and attention to **Continuous Improvement**. An advocate for collaboration, I foster effective communication within teams, ensuring streamlined workflows and project success. Additionally, I have developed enterprise-grade platforms integrating advanced technologies such as machine learning, showcasing my ability to deliver innovative solutions while adhering to industry compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed scalable applications using **React** (17-18), **TypeScript**, and **Next.js**, while ensuring compliance with industry standards, enhancing user interfaces and experiences for healthcare and financial platforms.\n- Integrated **REST** and **GraphQL** APIs for efficient data communication, ensuring seamless data flow across diverse applications.\n- Implemented robust **CI/CD** pipelines with **GitHub Actions** for automated testing and deployment, increasing efficiency by **30%** in release cycles.\n- Leveraged **Python** (FastAPI) to build backend services, optimizing application performance and responsiveness for high-traffic environments.\n- Executed real-time performance debugging and troubleshooting, improving application speed by **25%** and reducing response times significantly.\n- Championed cross-functional collaboration, driving initiatives that improved team workflows and increased productivity by facilitating code reviews and feedback sessions.\n- Researched and applied continuous improvement strategies to technologies and processes, aiming to elevate project quality and team impact.\n- Crafted user interfaces using **SCSS**, ensuring stylistic consistency and linked them to back-end services efficiently.\n- Delivered client-facing products that improved user engagement and satisfaction through innovative solutions and personalized features.\n- Drove overall project success by maintaining regular communication with stakeholders, aligning technical efforts with business goals for impactful results."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)** and **TypeScript** to build dynamic, user-focused front-end applications, enhancing user experience for financial dashboards and admin portals, achieving a **40%** increase in performance metrics.\nImplemented **Next.js** and **SCSS** for responsive design and optimized page rendering, resulting in a **25%** reduction in load times across platforms.\nDeveloped backend services with **Python**, ensuring RESTful APIs and integration with modern frameworks, supporting over **1,000** concurrent transactions.\nLed debugging and code review sessions, fostering a culture of **collaboration** and **continuous improvement** within the team, improving code quality and reducing bugs by **30%**.\nManaged CI/CD pipelines using **GitHub Actions**, automating deployment processes and increasing deployment frequency by **50%**.\nEngaged in cross-functional teamwork with product and design teams to ensure alignment on financial platform goals, promoting best practices in software development and delivery.\nContributed to knowledge sharing and technical documentation providing clarity on design decisions and implementations."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **React** and **TypeScript** to build and maintain responsive user interfaces, ensuring optimal performance on both web and mobile platforms.\nImplemented **Next.js** for server-side rendering and SEO-friendly routes, enhancing user engagement and discoverability of e-commerce content.\nDesigned and optimized RESTful and **GraphQL** APIs for seamless data interactions, allowing scalability and flexibility in service architecture.\nApplied **AWS** services for cloud deployment and resource management, contributing to a **40%** reduction in operational costs through efficient resource allocation and monitoring.\nEngaged in robust debugging practices and code reviews, fostering a culture of **continuous improvement** and technical excellence among team members.\nManaged CI/CD pipelines using **GitHub Actions** to automate testing and deployment processes, leading to a **30%** reduction in deployment times and improved integration efficiency.\nCollaborated with cross-functional teams to align project goals, timelines, and quality expectations through effective communication and team synergy.\nEmployed agile methodologies to continuously iterate on product features, ensuring rapid delivery cycles and alignment with user feedback and requirements.\nLeveraged collaborative tools to promote idea sharing and best practices, contributing to overall team effectiveness and project success."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Next.js, SCSS\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tREST, GraphQL\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Debugging, Collaboration, Code Reviews, Continuous Improvement"
}