{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Quality Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior Quality Engineer with 10+ years of experience focused on **Automation Testing**, **CI/CD**, and **Process Improvement**. Demonstrated expertise in **QA Methodologies** and leveraging **AI-driven Testing Tools** to enhance testing efficiency and accuracy. Proficient in **C#** for developing and implementing automated testing frameworks, and experienced in low-code testing environments that accelerate delivery timelines.  Proven ability to improve processes and deliver collaborative support across cross-functional teams.\n\nAdditionally, brings strong background in **Full Stack Development** with hands-on skills in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, and a deep understanding of full stack technologies such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in cloud-native application deployment on **Azure** and **AWS** and skilled in **microservices architecture**. Committed to building secure, maintainable, and compliant solutions while driving real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Quality Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and executed automation testing strategies, ensuring quality through **C#**, leveraging automated frameworks that align with organizational **QA methodologies**.\n• Applied **CI/CD** practices to streamline deployment processes, enhancing efficiency and reliability across multiple environments.\n• Contributed to process improvement initiatives by analyzing testing workflows, implementing enhancements that reduced testing time by **30%**.\n• Collaborated with cross-functional teams to provide collaborative support, ensuring effective communication and integration of quality standards within the development lifecycle.\n• Integrated AI-driven testing tools to enhance test coverage, utilizing innovative solutions that improved defect detection rates by **40%**.\n• Designed and executed low-code testing frameworks, enabling rapid automation for various application components, including both web and backend services.\n• Focused on continuous improvement in testing methodologies, conducting regular reviews and updates to keep pace with emerging technologies and trends.\n• Mentored junior team members on automation techniques and best practices, fostering a culture of quality within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented and optimized **CI/CD** pipelines to streamline the software development process, enhancing deployment frequency by **30%** and reducing the lead time for changes by **50%**.\nConducted comprehensive **QA methodologies** and **automation testing** procedures, leading to a **25%** increase in defect detection rates and improved product quality.\nUtilized **AI-driven testing tools** to enhance test coverage and efficiency, resulting in a **20%** reduction in manual testing efforts while maintaining accuracy.\nCollaborated with cross-functional teams, providing **collaborative support** in identifying process improvements that increased team productivity by **15%**.\nDeveloped automated test scripts and frameworks using **C#**, ensuring reduced runtime errors and faster feedback cycles for development teams.\nIntegrated **low-code testing** solutions to speed up testing processes, facilitating faster validation of deployed applications.\nRegularly analyzed testing processes and proposed enhancements, successfully decreasing testing cycle times by **40%** while ensuring adherence to standards."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Conducted **Automation Testing** on cloud-based applications, utilizing **C#** for scripting and automation frameworks to enhance testing efficiency and accuracy.\n• Developed and maintained **CI/CD** pipelines to streamline deployment processes, ensuring high-quality releases and fast feedback loops in the software development lifecycle.\n• Implemented **QA Methodologies** across various project stages, leading to a **30%** reduction in defect rates and improving product quality.\n• Delivered innovative solutions through low-code testing platforms, reducing manual testing efforts by **50%**, thereby accelerating the testing phase of the SDLC.\n• Leveraged **AI-driven Testing Tools** to enhance testing capabilities, achieving increased test coverage and predictive analytics for better decision-making.\n• Collaborated with cross-functional teams to facilitate **Process Improvement**, driving initiatives that resulted in a **40%** decrease in testing turnaround time.\n• Provided **Collaborative Support** during sprint planning and retrospectives, ensuring alignment on quality objectives and fostering a culture of continuous improvement.\n• Assisted in designing automated tests for complex business logic scenarios, resulting in improved coverage and detection of issues before production.\n• Mentored junior QA engineers on best practices and efficient use of testing tools, enhancing team performance and knowledge sharing.\n• Created comprehensive test documentation and reports to provide stakeholders with visibility into quality metrics and testing outcomes."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, C#\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Low-code Testing, Automation Testing, QA Methodologies, AI-driven Testing Tools, Process Improvement, Collaborative Support",
  "apply_company": "LexisNexis Legal & Professional"
}