{
  "name": "Mariusz Jan Skobel",
  "role_name": "Sr. Incident Response Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Results-driven Sr. Incident Response Engineer with over 10 years of experience in delivering comprehensive incident response solutions. Specialized in incident management and security protocols, with proficiency in **Microsoft Windows Server**, **Microsoft Exchange**, **Microsoft SQL Server**, **Active Directory**, **SCCM**, **VMware**, and **Microsoft Hyper-V**. Deep knowledge of **backup and disaster recovery solutions**, **VPN**, and **Citrix**, ensuring system integrity and rapid recovery in critical situations.\n\nExpert in utilizing **Azure** and **AWS** services to bolster infrastructure reliability and security, while ensuring compliance with industry regulations. Proven track record in project planning and delivery, with a focus on implementing effective **security solutions**, including **MFA** and **endpoint protection**. Adept at navigating complex networking concepts, including **IPsec tunnels** and **Dynamic VPN**, to enhance organizational resilience.\n\nBrings a holistic approach to IT security, blending technical expertise with strategic thinking to address real-world challenges and drive impact across various sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Sr. Incident Response Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tPerformed incident response and mitigation strategies, ensuring compliance with security solutions on **AWS** and **Azure**, leveraging skills in **Active Directory** and **Microsoft Exchange** to secure and manage user access.\n•\tConfigured and managed **Microsoft SQL Server** for critical database storage and retrieval, ensuring optimal performance and advanced security measures to protect sensitive data.\n•\tConducted thorough investigations and implemented effective **disaster recovery solutions**, utilizing **Microsoft Windows Server** and **VMware** for system restoration and backup verification.\n•\tManaged **SCCM** and **MDT** for deploying and updating software across multiple sites, enhancing operational efficiency and minimizing downtime during project delivery.\n•\tDesigned and implemented **Dynamic VPN** and **IPsec tunnels** solutions to secure remote access for users, ensuring secure connectivity and endpoint protection against potential threats.\n•\tDeveloped project planning and management strategies for enhancing incident response workflows, delivering on-time results through **ServiceNow** ticketing and tracking.\n•\tIntegrated **Citrix** environments for remote desktop access, improving accessibility and user experience in a secure manner for various applications.\n•\tExecuted network monitoring and optimization tasks using **Cisco CCNA** and **CCNP** skill sets, maintaining network integrity and performance across critical environments.\n•\tImplemented multi-factor authentication (MFA) across systems to enhance security posture, protecting against unauthorized access and data breaches.\n•\tUtilized **NetApp** storage solutions to ensure high availability and efficient data management across the organization, addressing storage area network (SAN) needs effectively.\n•\tConducted training sessions on **Microsoft SharePoint** usage and best practices, improving collaboration among teams in incident response protocols."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented comprehensive **incident response** strategies to quickly address security breaches within cloud environments, ensuring minimal downtime and effective recovery measures.\nManaged and maintained **Microsoft Windows Server** environments, ensuring optimal performance and security compliance for over **500** users.\nAdministered **Microsoft SQL Server**, performing database management tasks to support data recovery needs and facilitate real-time analytics.\nConfigured and supported **Active Directory** and **Microsoft Exchange** to optimize user access and email management for a **200+** employee base.\nDesigned and enforced **security solutions** including **MFA** and **endpoint protection** systems, resulting in a **30%** reduction in successful phishing attacks.\nDeveloped and executed **backup and disaster recovery solutions**, ensuring critical data integrity and availability.\nDeployed and managed **VPN** solutions including **dynamic VPN** and **IPsec tunnels** to enhance secure remote access for staff.\nCrafted and delivered training on **networking concepts** and security protocols, improving incident response time by **25%**.\nUtilized **ServiceNow** for tracking incidents and managing project deliveries and resource allocation, enhancing operational efficiencies.\nTrained team members on **VMware** and **Microsoft Hyper-V** methodologies, promoting seamless virtualization of infrastructure for more flexible deployments.\nLed project planning and delivery initiatives related to cloud migrations and enhanced infrastructure support, employing **AWS** and **Azure** resources effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented incident response strategies to enhance the security posture of a global e-commerce platform.\nOptimized IT operations using **Microsoft Windows Server** and **Microsoft SQL Server** to support backend services ensuring high availability and scalability.\nManaged **Active Directory** for role-based access control, facilitating secure customer and admin access across the platform while maintaining compliance with GDPR.\nExecuted backup and disaster recovery solutions to safeguard critical data across cloud services like **AWS** and **Azure**, ensuring minimal downtime and rapid recovery.\nConfigured **VPN** and **IPsec tunnels** to secure data transmissions and enhance remote desktop access for operational teams, improving incident response times.\nUtilized **ServiceNow** for efficient project planning and delivery of incident response initiatives, streamlining workflows and incident tracking to enhance project outcomes.\nDeveloped and maintained **Microsoft SharePoint** for documentation management and team collaboration in incident scenarios, ensuring information is accessible and organized.\nLeveraged **VMware** and **Microsoft Hyper-V** for virtualization to support application deployment and reduce infrastructure costs, enabling dynamic resource allocation during incidents.\nEnsured endpoint protection through **MFA** and modern security solutions, strengthening the overall cybersecurity framework.\nDesigned and conducted training on networking concepts to improve incident response readiness across teams, fostering a culture of proactive security awareness."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\t\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Incident Response, Microsoft Windows Server, Microsoft Exchange, Microsoft SQL Server, Microsoft SharePoint, Active Directory, SCCM, MDT, VMware, Microsoft Hyper-V, Backup and disaster recovery solutions, VPN, Remote Desktop, Citrix, Networking concepts, Security solutions, MFA, Endpoint protection, Cisco CCNA, Cisco CCNP, Storage Area Networks, Dynamic VPN, IPsec tunnels, NetApp, ServiceNow, Project planning, Project delivery"
}