{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Python Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Python Engineer with 13+ years of experience in developing high-performance applications, specializing in **Python**, **FastAPI**, and **Pydantic**. Expert in deploying cloud-native solutions with **AWS** and **Azure**, implementing CI/CD pipelines, and maintaining compliance with industry standards through rigorous **unit testing**, **integration testing**, and **end-to-end testing**. Proficient in utilizing **Git** for version control, conducting **code reviews**, and managing **pull requests** in an agile environment. Demonstrated ability to foster **communication** and **collaboration** across teams to deliver robust applications.\n\nProven track record in both frontend and backend development using **JavaScript/TypeScript**, **React**, **Next.js**, **Vue**, **Node.js**, and **Django**. Experienced in building AI/ML-powered platforms emphasizing predictive analytics and real-time processing. Strong background in MLOps, including model training and orchestration with **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **FastAPI** to design and develop efficient full-stack applications, ensuring high-quality code through rigorous **unit testing**, **integration testing**, and **end-to-end testing** practices.\nImplemented CI/CD pipelines using **Git** for seamless code integration and deployment, adhering to agile methodologies and facilitating regular **pull requests** and **code reviews**.\nLeveraged **Pydantic** for data validation and serialization in API endpoints, enhancing the reliability and robustness of data handling during application interactions.\nCollaborated with cross-functional teams to achieve project milestones, improving communication and coordination, resulting in a **30%** increase in project delivery efficiency.\nConducted thorough **code reviews** and provided constructive feedback, promoting best practices in code quality and development standards across the team.\nDesigned and maintained resilient data storage solutions using **databases** such as PostgreSQL and **cloud** services for optimal data management and retrieval.\nMaximized system efficiency by integrating automated testing frameworks, contributing to a **40%** reduction in bugs reported post-deployment.\nFacilitated team workshops to enhance skills in Agile practices, improving team collaboration and project adaptability, contributing to a **20%** improvement in team throughput.\nDeveloped and documented APIs using standardized approaches, allowing for better integration with third-party services and enhanced communication with stakeholders."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop scalable microservices, improving system performance and enabling rapid deployment for high-volume transactional applications.\nImplemented comprehensive **unit testing**, **integration testing**, and **end to end testing** strategies to ensure seamless functionality and robust quality assurance across the codebase.\nLeveraged **Git** for version control, conducted thorough **code reviews**, and participated in **pull requests** to enhance collaboration and maintain high code quality within the agile development team.\nDesigned and managed databases to support functionality and data integrity, ensuring efficient access to financial datasets.\nExecuted continuous integration (CI) and continuous deployment (CD) practices to streamline deployment processes, achieving a 30% reduction in deployment time.\nFostered effective **communication** and **collaboration** with cross-functional teams, ensuring alignment on project goals and delivering solutions on time.\nParticipated in agile ceremonies, contributing to sprint planning and retrospectives to drive continuous improvement within the team.\nContributed to the documentation of processes and technical specifications, promoting knowledge sharing among team members."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** with **FastAPI** and **Pydantic** to design and optimize backend services for a global e-commerce platform, achieving **99.9%** uptime and **low latency** in processing over **100,000 orders** daily across key modules like checkout, cart, and order fulfillment.\nEngineered real-time features using WebSockets and an event-driven architecture powered by **Kafka** and **RabbitMQ**, improving order update responsiveness by **50%** and facilitating dynamic inventory tracking.\nConducted **unit testing**, **integration testing**, and **end-to-end testing** to ensure performance and reliability across applications, achieving a **zero-bug** release for **v2.0** deployment.\nManaged version control and collaboration utilizing **Git** through systematic **pull requests** and **code reviews**, promoting best practices and enhancing team productivity in an **agile** environment.\nOversaw the integration of **databases** such as **MongoDB**, **PostgreSQL**, and **Redis** to ensure robust, fault-tolerant data retrieval, reducing average data access time by **30%**.\nImplemented Continuous Integration (CI) and Continuous Deployment (CD) pipelines to streamline development processes, enabling faster feature delivery and deployment within **1 week** of planning.\nFacilitated effective communication and collaboration among cross-functional teams to ensure alignment with project goals and timelines, driving successful project completions under strict deadlines.\nEngaged in securing application workflows and integration with payment platforms like **Stripe**, **PayPal**, and **Razorpay**, ensuring compliance with security standards and reducing transaction failure rates by **25%**.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, unit testing, integration testing, end to end testing, CI, CD, authentication and security (Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot), agile, pull requests, code reviews, communication, collaboration",
  "apply_company": "Nearform"
}