{
  "name": "Tomasz Lee",
  "role_name": "Security System Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled in **AWS**, **Linux**, **Windows**, and **VMware**, I am a seasoned Security System Engineer with 9+ years of experience. Proficient in implementing security protocols such as **Active Directory**, **SSO**, and **PKI**, I leverage tools like **Ansible** and **Terraform** to automate and enhance system security. I possess a solid background in continuous integration and deployment using **GitLab**. My original strengths include a proven ability for **problem-solving**, effective **teamwork**, and strong **communication** skills to collaborate across diverse teams and lead projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Security System Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Ensured the security and performance of information systems across **Linux** and **Windows** environments, leveraging **VMware** for optimized virtualization.\nImplemented configuration management using **Ansible** and **Terraform**, streamlining system deployments by 30%.\nManaged user access and security protocols through **Active Directory** and **SSO**, increasing user authentication efficiency by 25%.\nConfigured and maintained **NGINX** as a reverse proxy, enhancing web application performance and security.\nDeveloped automation scripts to improve system monitoring and incident response, reducing downtime by 15%.\nContributed to the migration of applications to **AWS**, lowering infrastructure costs by 20% through effective resource management.\nCollaborated with cross-functional teams to resolve security vulnerabilities, ensuring compliance and data integrity.\nApplied effective problem-solving techniques to troubleshoot and enhance system performance, achieving a resolution rate of 90% on first contact.\nUtilized **GitLab** for version control, improving collaboration among team members across multiple projects.\nEngaged in continuous communication with team members to foster teamwork and project alignment, achieving milestones ahead of deadlines by 10%.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented security solutions within Linux and Windows environments, ensuring compliance with industry standards and enhancing system reliability.\nConfigured and maintained **NGINX** as a reverse proxy server to improve traffic management and security, resulting in a **20%** reduction in downtime.\nUtilized **VMware** to create virtualized environments for testing and deployment, leading to a **40%** increase in resource utilization efficiency.\nManaged **AWS** infrastructure, including the setup of secure access controls and monitoring, which improved incident response time by **30%**.\nDeveloped automated workflows using **Ansible** and **Terraform** for consistent provisioning and configuration management, reducing setup time to **50%**.\nImplemented **Single Sign-On (SSO)** and **Public Key Infrastructure (PKI)** solutions to enhance user authentication across the enterprise, leading to increased security and user satisfaction.\nCoordinated with cross-functional teams to address security vulnerabilities, showcasing strong teamwork and communication skills throughout the process.\nMonitored and analyzed system logs for unusual activities using **GitLab** for version control, contributing to proactive threat detection and mitigation.\nConducted training sessions for staff on security best practices, fostering a culture of awareness and problem-solving within the organization."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **AWS** for cloud service management and deployment, enhancing operational efficiency across platforms.\nImplemented **Linux** and **Windows** environments to support robust system architecture and facilitate secure access protocols.\nManaged **Active Directory** and implemented **SSO** strategies to streamline user authentication processes and improve security measures.\nConfigured and maintained **NGINX** for load balancing and efficient web server management, achieving a 30% increase in resource utilization.\nAutomated infrastructure deployment using **Ansible** and **Terraform**, reducing setup time by 40% and ensuring consistent environments.\nLeveraged **VMware** for virtualization needs, optimizing resource allocation and system performance.\nCollaborated with cross-functional teams to troubleshoot issues, enhancing overall problem-solving capabilities and teamwork.\nEngaged in daily communication and standup meetings to ensure alignment with project objectives and boost collaborative efficiency.\nDeveloped comprehensive documentation related to system setups and security protocols, improving communication across teams and knowledge transfer.\nParticipated in code reviews, enforcing coding standards and enhancing system reliability, contributing to a 15% reduction in post-deployment issues."
    }
  ],
  "skills": " \n**Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Ansible, Terraform, GitLab\n\n**Cloud & Infrastructure**\n\tLinux, Windows, VMware, NGINX, Active Directory, SSO, PKI\n\n**Other**\n\tGit, GitHub, problem-solving, teamwork, communication, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Microservices, UX/UI Design, Blockchain: Ether.js, Web3.js, Ethereum"
}