{
  "name": "Tomasz Lee",
  "role_name": "Field Service Equipment Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Proficient in **Project Management**, **Problem Solving**, and **Troubleshooting**, with 9+ years as a .NET Full Stack Developer specializing in robust application development. Expertise in **Automation** and **Mechanical/Electrical Engineering** principles, leveraging **microservices architecture** for streamlined processes. Strong background in backend technologies such as **.NET**, **C#**, and **cloud services**, paired with frontend capabilities in **ReactJS** and **NextJS**. Demonstrated ability to enhance operational efficiency, deliver impactful solutions, and effectively communicate across teams to ensure project success. Skilled in time management and fostering strong interpersonal relationships.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Field Service Equipment Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **problem solving** and **troubleshooting** skills to diagnose and resolve complex mechanical and electrical issues efficiently, reducing downtime by **30%**.\nExecuted **project management** strategies to oversee the maintenance and optimization of field service equipment, ensuring projects were delivered on time and within budget.\nConducted in-depth **fault finding** on PLC systems and automated solutions to enhance equipment reliability, resulting in a **20%** increase in operational efficiency.\nCollaborated effectively with cross-functional teams, leveraging **communication skills** and **interpersonal skills** to foster collaborative relationships and successful outcomes.\nImplemented automation solutions that streamlined processes and increased productivity across various projects.\nMaintained accurate documentation of service reports and equipment status using advanced **computer literacy** and software tools.\nDemonstrated exceptional **time management** by prioritizing tasks and managing multiple service requests simultaneously, achieving a customer satisfaction rate of **95%**.\n\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Project Management** skills to lead cross-functional teams in troubleshooting and resolving equipment issues in the field, ensuring timely service delivery and high customer satisfaction.\nApplied **Problem Solving** techniques to diagnose and rectify PLC faults, achieving a **95%** success rate in first-time fixes.\nManaged multiple projects simultaneously, demonstrating strong **Time Management** by completing projects within deadlines **95%** of the time.\nCommunicated effectively with clients and stakeholders, ensuring clear understanding of project requirements and updates, leading to **30%** improvement in client feedback ratings.\nLeveraged **Computer Literacy** to utilize various diagnostic tools, enhancing the efficiency of fault finding and repair processes.\nImplemented **Automation** solutions across equipment using programming languages, improving operational efficiency by **20%**.\nEngaged in continuous improvement efforts, utilizing **Interpersonal Skills** to foster collaboration among team members and stakeholders.\nConducted **troubleshooting** procedures on complex electrical and mechanical systems, ensuring minimal downtime and maximum productivity.\nDocumented engineering processes and solutions, creating a resource library for use in future projects, thereby increasing knowledge transfer by **40%**.\nProvided training and support to junior engineers, enhancing the team’s technical competencies and encouraging a culture of learning and development."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Managed the installation and troubleshooting of mechanical and electrical equipment, ensuring optimal workflow in the field, enhancing project efficiency by **15%**.\n• Executed PLC fault finding and automation protocols, successfully reducing operational downtime by **25%**.\n• Collaborated with cross-functional teams to identify and resolve engineering challenges, utilizing effective problem-solving and communication skills to enhance project outcomes.\n• Oversaw project management duties, including planning and scheduling, leading to timely project completions within budget by maintaining a **95%** on-time delivery rate.\n• Conducted detailed time management assessments to allocate resources efficiently across multiple projects.\n• Developed and implemented troubleshooting processes that improved issue resolution times by **30%**.\n• Provided training and documentation for equipment operation to improve user competence and reduce on-site errors.\n• Maintained computer literacy in various engineering software and tools to enhance data analysis and reporting capabilities.\n• Engaged in proactive communication with clients to ensure clear understanding of services and resolutions, bolstering client satisfaction ratings.\n• Strengthened interpersonal relationships within the team to foster collaboration and innovation in problem-solving."
    }
  ],
  "skills": "Programming Languages:\n\tPython\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Mechanical Engineering, Electrical Engineering, PLC Fault Finding, Automation, Project Management, Problem Solving, Troubleshooting, Time Management, Communication Skills, Interpersonal Skills, Computer Literacy"
}