{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Full Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Full Stack Engineer with 8 years of experience, I bring a proven track record of delivering high-performance solutions, particularly in AI-driven applications. My technical expertise includes **Node.js**, **Vue.js**, **JavaScript**, **TypeScript**, and hands-on experience with modern web technologies like **HTML**, **CSS**, **PostCSS**, **SASS**, **Git**, **Webpack**, and **npm**. I excel in building enterprise-grade platforms leveraging microservices architecture and event-driven systems to support scalability and responsiveness.\n\nI have substantial experience in Test-Driven Development (TDD) employing frameworks such as **Mocha** and **Jest** to ensure code quality. Additionally, I’m proficient in PHP and **Symfony**, further augmenting my versatility in full stack development. My background includes integrating predictive analytics and intelligent automation, while leading projects that adhere to compliance standards such as HIPAA and PCI DSS.\n\nI am passionate about delivering secure applications and possess deep cloud proficiency on **Azure** and **AWS**. I actively employ CI/CD automation techniques, coupled with a strong foundation in developing and deploying machine learning models, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable full-stack applications leveraging **Node.js**, **JavaScript**, **TypeScript**, and modern frameworks like **VueJS**, focusing on user experience and responsiveness across all platforms.\nDesigned microservices architectures to facilitate development velocity and scalability, optimizing system performance through **Docker** and orchestration with **Kubernetes**.\nImplemented Test-Driven Development (TDD) practices utilizing tools such as **Jest** and **Mocha**, ensuring robust unit and integration test coverage and lowering bug rates by **30%**.\nCollaborated in agile teams, delivering features within **2-week sprints**, actively participating in code reviews and design discussions to enhance code quality and maintainability.\nLed integration of diverse technologies like **HTML**, **CSS**, **SASS**, and **PostCSS** for scalable front-end architectures, enhancing application performance metrics by **25%**.\nUtilized **Git** for version control and managed projects efficiently through branching strategies, improving team collaboration on multiple features simultaneously.\nConducted application performance monitoring and optimizations, achieving load times improvement from over **2 seconds** to under **1 second** for critical features.\nEngaged in continuous learning of advanced methodologies such as microservices and cloud-based architectures to streamline development processes and deploy applications seamlessly across environments.\nEstablished comprehensive CI/CD pipelines using **GitHub Actions** for automated testing and multi-environment deployments, reducing deployment time by **50%**.\nMentored junior developers in best practices for writing maintainable code and participated in team workshops on new technologies and frameworks, boosting team productivity."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** and microservices architecture to lead the development of scalable financial platforms, achieving a **30%** increase in throughput for high-volume transaction systems.\nDeveloped user-friendly front-end applications using **VueJS** and **TypeScript** (**3**) for dynamic financial dashboards, resulting in improved user engagement and a **25%** reduction in loading times.\nImplemented Test-Driven Development (TDD) practices using **Jest** and **Mocha**, ensuring **95%** code coverage and enhancing overall code quality.\nCollaborated with cross-functional teams to integrate **AI** tools and analytics, enabling automated monitoring of transaction activities and anomaly detection, thereby improving operational efficiency.\nOrchestrated sophisticated ETL pipelines with **Python**, enhancing the batch and real-time ingestion of financial data from internal systems and third-party sources using **Apache Airflow** and **Azure Data Factory**.\nAdopted **Git** for version control to streamline project management processes and maintain integrity across software versions, contributing to the successful delivery of projects on time.\nEngaged in code reviews and mentoring of junior developers, fostering a culture of collaboration and continuous learning within the team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized scalable microservices for a global e-commerce platform using **Node.js** (NestJS, Express) and ensured high performance and availability across key modules by utilizing best practices in **Test-Driven Development**.\nEngineered real-time features leveraging **JavaScript** and **WebSockets** for responsive order updates, dynamic inventory tracking, and enhanced customer support experiences.\nCreated dynamic frontend applications utilizing **VueJS** (Vue 3, Vuex) alongside **TypeScript** to deliver seamless user experiences, adhering to modern web standards like **HTML5/CSS3** and accessibility compliance (WCAG 2.1).\nImplemented efficient workflows with version control through **Git**, and built optimized, production-ready bundles using **Webpack** and deployment automation with **npm**.\nIncorporated AI strategies for personalizing user experiences through pre-built machine learning libraries, enhancing product recommendations based on real-time interactions and user behavior.\nDeveloped robust, responsive UIs while ensuring mobile engagement standards were met and layout adaptability using modern CSS methodologies, including **SASS** and **PostCSS**.\nUtilized **Mocha** and **Jest** for unit and integration tests to enhance code quality and reliability while adhering to project timelines and delivery schedules.\nContinuously improved coding standards and practices, aligning with team goals through feedback loops and pair programming sessions, driving a culture of innovation and teamwork.\nEstablished secure workflows adhering to compliance standards while ensuring efficient access management mechanisms supported by role-based access control (RBAC)."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, PHP\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js, Symfony\n\n **Frontend Frameworks:**\n\tReact, Vue, VueJS, Angular, HTML, CSS, PostCSS, SASS\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot, Test-Driven Development, Mocha, Jest, Webpack, npm, microservices, Git",
  "apply_company": "Skipso"
}