{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Golang Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a skilled Senior Golang Engineer with expertise in **Golang**, I possess 8 years of full-stack development experience, with a strong focus on building high-performance applications. My technical proficiencies include **Kubernetes**, **Microservices**, **API** design, and integrating **event-driven** architectures. I have a solid foundation in **Continuous Integration** practices and **Version Control**, ensuring high-quality code and efficient collaboration within teams.\nIn addition to my primary focus on **Golang**, I bring experience in **JavaScript/TypeScript**, **Python**, and **Flutter**, which enhances my versatility across various projects. My background includes leading the development of enterprise-grade platforms, particularly in the healthcare and financial sectors, with an emphasis on compliance standards like HIPAA and PCI DSS. I have effectively utilized tools such as **MLflow**, **Airflow**, and **Kubeflow** for machine learning pipelines and MLOps workflows, demonstrating my capability in building robust, data-driven solutions. I thrive in startup environments, leveraging a collaborative approach to task decomposition and problem solving.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Golang Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained API services in **Golang**, ensuring high performance and scalability for microservices architecture.\n- Architected event-driven systems utilizing **Kubernetes** for orchestration, enhancing deployment efficiency while supporting containerized applications.\n- Implemented continuous integration pipelines with an emphasis on **testing** and version control, ensuring code quality and rapid deployment cycles.\n- Collaborated with cross-functional teams to decompose tasks effectively, promoting a **startup mindset** that encourages innovation and agility in project management.\n- Established and enforced best practices in **open source** code contributions, enhancing team collaboration and project visibility.\n- Drove the adoption of **Kubernetes** (v1.22) for microservices orchestration, improving application reliability and resource management.\n- Delivered comprehensive unit, integration, and E2E testing strategies across services, significantly reducing downtime and deployment errors by up to **30%**.\n- Actively participated in code reviews and knowledge-sharing sessions, fostering a collaborative and high-performing team environment focused on **version control** best practices.\n- Spearheaded the migration of applications to a service-oriented architecture using **Kubernetes**, yielding increased deployment speed of **40%** over previous methodologies.\n- Developed documentation and guides to streamline the onboarding of new developers, ensuring continued collaboration and effective task decomposition."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and developed microservices-based architectures using **Golang** that enhance scalability and maintainability of high-volume transaction systems, achieving a throughput improvement of **25%**.\nCollaborated with cross-functional teams to implement robust RESTful **API** services, ensuring seamless integration between front-end applications and back-end systems, with a focus on quality and performance.\nLed the implementation of **Kubernetes** for container orchestration, automating deployment processes by **40%**, which significantly reduced downtime and improved deployment frequency.\nDeveloped thorough testing strategies for microservices, ensuring code quality and reliability with a coverage rate of **90%** across all critical components.\nIntegrated an event-driven architecture using message brokers like Kafka and RabbitMQ to establish real-time data processing workflows, resulting in a **30%** reduction in latency for transaction processing.\nEmployed version control best practices using Git, maintaining clean and organized project repositories and enabling faster collaboration among team members.\nChampioned continuous integration and delivery pipelines, utilizing tools such as Jenkins, to streamline deployment processes and improve development efficiency by **50%**.\nFostered a collaborative work environment emphasizing open-source methodologies and contributions, mentoring junior developers to encourage skill development within the team.\nExecuted task decomposition effectively, allowing the team to manage project deliverables more efficiently in a startup-like environment that encourages innovation and agility."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and optimized microservices using **Golang**, ensuring robust API design and high performance while implementing scalable architectures.\n- Utilized **Kubernetes** for orchestration and automated deployment, achieving a **30%** improvement in deployment speed across services.\n- Collaborated with cross-functional teams to decompose complex tasks into manageable components, promoting a startup mindset for rapid iteration and innovation.\n- Integrated event-driven architecture using tools such as **Kafka** and **RabbitMQ**, allowing seamless communication between services and enhancing system reliability.\n- Employed **Continuous Integration** practices to streamline code quality with automated testing frameworks, significantly reducing integration issues by **40%**.\n- Managed version control through **Git**, ensuring codebase integrity and facilitating smooth collaboration across multiple teams.\n- Contributed to the open-source community by improving various libraries, thereby promoting collaboration and knowledge sharing.\n- Developed unit and integration tests for services, enhancing overall code reliability and reducing bug counts by **25%** within the first three releases.\n- Leveraged API gateways to manage service interactions efficiently, improving response times across various client applications.\n- Fostered collaboration within agile teams to streamline production workflows, leading to faster release cycles and delivering features ahead of schedule."
    }
  ],
  "skills": " **Programming Languages:**\n\tGolang, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tDocker, Kubernetes\n\n**Other:**\n\tMCP, Microservices, Event-driven, Testing, Version Control, Continuous Integration, Open Source, Collaboration, Task Decomposition, Startup Mindset, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Stacklok"
}