{
  "name": "Tomasz Lee",
  "role_name": "Senior BIM Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Accomplished Senior BIM Engineer with 9+ years of experience in using BIM technologies and tools such as **Bentley ProjectWise**, **Trimble Connect**, **Autodesk ACC**, and **Dalux**. Proficient in developing collaborative environments for Building Information Modeling (BIM) with a strong focus on Constructive Digital Environments (CDE). Skilled in leveraging **API** integrations to enhance project workflows and data exchange. Experienced in data visualization with **Power BI** and developing automation through **Grasshopper** and **Dynamo**. Exceptional communication skills with a proven track record of delivering successful projects by working effectively across multidisciplinary teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior BIM Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **BIM** methodologies to enhance project workflows and collaboration, achieving a 30% increase in project efficiency.\nLeveraged **CDE** tools to create a centralized information repository, ensuring all team members had real-time access to project data.\nIntegrated **Bentley ProjectWise** for document management and workflow automation, streamlining project delivery processes by 25%.\nEmployed **Trimble Connect** for collaborative project coordination, improving team communication and reducing miscommunication errors by 40%.\nUtilized **Autodesk ACC** for cloud-based design and construction management, enhancing project visibility and accountability.\nApplied **Dalux** for effective site management and quality control, leading to safer construction practices and a 15% reduction in on-site incidents.\nDeveloped visual representations using **Grasshopper** and **Dynamo** to automate design processes and aid in decision-making.\nCreated dynamic reports and dashboards using **Power BI**, providing stakeholders with actionable insights and enhancing data-driven decision-making.\nDesigned and integrated **API** services to facilitate seamless data exchange between various building tools and applications.\nDemonstrated exceptional **communication** skills by liaising between cross-functional teams and clients, ensuring alignment on project goals and timelines."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **BIM** methodologies to create a cloud-based project management tool that improved team collaboration efficiency by **15%**.\nUtilized **Bentley ProjectWise** and **Trimble Connect** for effective project data management, ensuring streamlined workflows and communication among stakeholders.\nDeveloped APIs for integration with **Autodesk ACC** and **Dalux**, enabling seamless data exchange and enhancing project delivery timelines.\nApplied **Power BI** for creating dynamic visual reports, leading to enhanced project status tracking and decision-making processes.\nEmployed **Grasshopper** and **Dynamo** for design automation, increasing project efficiency and reducing manual errors by **25%**.\nDesigned custom dashboards in **Power BI** that improved communication of project metrics across teams, achieving a **30%** reduction in meeting times.\nFostered collaboration among team members through regular communication, ensuring alignment on project goals and improving team morale.\nConducted training sessions on **BIM** best practices for junior engineers, contributing to a more knowledgeable and capable team.\nIntegrated various data management tools such as **API** services to enhance user engagement, resulting in a **25%** improvement on platform interaction.\nContinuously evaluated and implemented improvements to enhance overall project workflow and efficiency, promoting a culture of innovation."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Utilized **BIM** methodologies to enhance project collaboration and efficiency, ensuring adherence to standards across all stages of the project lifecycle.\n• Engaged with **CDE** systems to streamline data management and improve accessibility for project stakeholders, leading to a 30% reduction in information retrieval time.\n• Implemented **Trimble Connect** and **Bentley ProjectWise** to unify project data and improve team communication, fostering a more coordinated effort among all teams involved.\n• Developed advanced modeling techniques using **Grasshopper** and **Dynamo**, increasing design precision and reducing errors by 25% in project outputs.\n• Produced analytical reports using **Power BI**, providing insights that improved decision-making processes on project designs by 15%.\n• Integrated various **API** solutions to facilitate seamless communication between systems, enhancing operational workflows.\n• Actively participated in project meetings to ensure effective **communication** between engineering teams, resulting in a smoother execution of project milestones.\n• Delivered comprehensive documentation and training materials for new technologies and processes implemented, improving team onboarding efficiency by 40%.\n• Ensured quality control throughout project development phases by conducting regular reviews and assessments with project teams, guaranteeing standards compliance.\n• Led workshops to promote best practices in BIM implementation, educating team members on advanced tools and techniques for improved project delivery."
    }
  ],
  "skills": "  **API Technologies**\n\tAPI, RESTful API, GraphQL\n\n  **Other**\n\tBIM, CDE, Bentley ProjectWise, Trimble Connect, Autodesk ACC, Dalux, Grasshopper, Dynamo, Power BI, communication\n\n  **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **Cloud & Infrastructure**\n\tAWS, Azure\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Testing Tools**\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\n  **Blockchain**\n\tSolidity, Ether.js, Web3.js, Ethereum\n\n  **Other Skills**\n\tUX/UI Design, Git, GitHub, Python, Redux",
  "apply_company": "Sweco"
}