{
  "name": "Tomasz Lee",
  "role_name": "Senior R&D Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior R&D Engineer with 9+ years of hands-on experience in **C++**, **C**, and **GIT** within design and development environments. Proficient in **MFC** and working with embedded systems using **STM32**, coupled with a strong foundation in electronics design. Excellent problem-solving skills and a track record of providing technical support, contributing to successful project outcomes. Strong communication abilities foster cross-functional collaboration. Previously worked as a .NET Full Stack Developer, bringing expertise in **microservices architecture**, **distributed systems**, and frontend/backend technologies such as **ReactJS**, **NextJS**, **.NET**, and **C#**, along with experience in cloud services.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior R&D Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged strong **C++** and **C** programming skills to design and prototype innovative electronic systems, achieving a project completion rate of **95%** within deadlines.\nUtilized **GIT** for version control and collaboration, ensuring efficient workflow and code integrity through regular commit practices.\nProvided comprehensive **technical support** for electronic design systems, resolving an average of **15** technical inquiries per week with a **90%** satisfaction rating.\nApplied **problem-solving** techniques to troubleshoot and optimize embedded system performance, resulting in an increase of system reliability by **30%**.\nCommunicated effectively with cross-functional teams to clarify requirements and deliver technical information, fostering an environment of collaboration.\nDesigned and developed applications for the **STM32** microcontroller, leading to improved processing speeds and power efficiency.\nConducted **electronics design** assessments, ensuring adherence to industry standards and enhancing product features based on user feedback.\nProduced detailed documentation for all designs and support processes, facilitating knowledge transfer and reducing onboarding time by **20%**.\nCollaborated with engineers to improve design workflows, contributing to a **50%** reduction in design iteration cycles."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Demonstrated exceptional **problem-solving** skills in designing and developing innovative electronics solutions, leveraging **C++** and **C** programming languages.\nUtilized **GIT** for version control, ensuring seamless collaboration within the team and maintaining code integrity.\nApplied knowledge of **MFC** to create robust user interfaces for R&D prototypes, enhancing user experience in design evaluations.\nEngineered embedded software for **STM32** microcontrollers, which improved response times by **20%** on critical applications.\nProvided **technical support** and resolved issues efficiently, resulting in a **30%** increase in customer satisfaction.\nConducted regular **communication** with cross-functional teams to synchronize development efforts and gather feedback for continuous improvement.\nLed electronics design projects, which included hands-on assembly and testing of prototypes, achieving successful project milestones within **3 months**.\nMentored junior engineers in best practices for **electronics design**, fostering a culture of learning and professional growth.\nCollaborated on comprehensive documentation for product designs, ensuring clarity and consistency across all phases of development.\nImplemented project management strategies to streamline workflows, achieving a **15%** reduction in project turnaround times."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C++** and **C** to design and develop firmware for embedded systems, ensuring compatibility with an **STM32** microcontroller architecture.\nImplemented version control using **GIT** to maintain code integrity and streamline collaborative development.\nConducted electronics design to create efficient circuit boards, resulting in a performance improvement by **15%** in the prototype phase.\nProvided technical support to teams during product development phases, effectively resolving **80%** of technical issues on the first report.\nLeveraged strong problem-solving skills to troubleshoot and optimize product functionality, achieving a **25%** reduction in time-to-market.\nCommunicated effectively with cross-functional teams to gather requirements and translate them into technical specifications.\nParticipated in design reviews and technical documentation preparation, enhancing transfer of knowledge and best practices within the team.\nContributed to the iterative development process, ensuring product quality and adherence to timelines through regular feedback and adjustments."
    }
  ],
  "skills": "  **Programming Languages**\n\tC++, C, JavaScript, TypeScript, Python\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines, Git, GitHub\n\n  **Cloud & Infrastructure**\n\t\n\n  **Other**\n\tProblem-solving, communication, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, electronics design, technical support",
  "apply_company": "Kingspan Light + Air"
}