{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Security Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Security Engineer with 13+ years of experience in building high-performance applications and securing environments in the healthcare and financial sectors. Expert in **Python**, with strong capabilities in implementing security protocols aligned with ISO 27001, SOC2, and NIST standards. Proficient in leveraging **Microsoft Defender**, **Microsoft Sentinel**, and **Microsoft Purview** to enhance security posture. Experienced in utilizing **PowerShell** for automation and scripting, and possessing extensive knowledge of SIEM, EDR technologies, and security frameworks such as **MITRE ATT&CK**. Proven track record in developing cloud-native solutions on **Azure** while ensuring compliance with industry regulations. Additionally, I have a strong foundation in building AI/ML-powered platforms and have hands-on expertise in frameworks like **FastAPI** and **Django**, along with deploying CI/CD pipelines and microservices architectures.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** to implement security solutions, integrating with tools such as **Microsoft Defender**, **Microsoft Sentinel**, and **Microsoft Purview** for robust monitoring and threat detection.\nDeveloped and executed security protocols in compliance with **ISO 27001**, **SOC2**, and **NIST** standards, ensuring the protection of sensitive data across systems.\nManaged security incidents through **SIEM** and **EDR** technologies, enhancing reactive and proactive security measures by analyzing data from **MITRE ATT&CK** framework.\nAutomated compliance reporting and security configurations using **PowerShell** scripts, maintaining up-to-date logs and documentation for audits at least **4 times a year**.\nLed the implementation of security enhancements in cloud environments, specifically under **Azure**, ensuring all deployments met industry best practices for security and governance.\nParticipated in regular security assessments and vulnerability scans, achieving a **95% success rate** in remediating identified risks within designated timelines.\nProvided comprehensive security training to **50+ staff members**, fostering a culture of security awareness across the organization.\nCollaborated with cross-functional teams to integrate security into the development lifecycle, placing emphasis on secure coding practices and regular code reviews.\nMonitored and analyzed security incidents, reducing response time by **30%** through the adoption of automated alerts and workflows within security platforms.\nDeveloped and maintained a framework for conducting security drills and penetration tests, enhancing the organization’s readiness by **20%** over the previous year."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented security measures across financial platforms by integrating **Microsoft Defender** and **Microsoft Sentinel** to enhance threat detection and compliance with **ISO 27001** and **SOC2** standards.\nUtilized **PowerShell** scripting to automate security monitoring and incident response processes, ensuring alignment with **NIST** and **MITRE ATT&CK** frameworks.\nConducted vulnerability assessments and developed remediation strategies leveraging **EDR** and **SIEM** tools to protect high-volume transactional systems, improving security posture by **70%**.\nOrchestrated data governance and compliance initiatives using **Microsoft Purview**, ensuring sensitive financial data is managed securely and meets regulatory requirements.\nCollaborated closely with cross-functional teams to design and implement secure cloud solutions on **Azure**, focusing on creating secure architectures that comply with industry standards.\nPerformed regular security audits and provided insights into the effectiveness of security protocols, achieving **100%** compliance during assessments.\nTrained team members on security best practices and incident response procedures, leading to improved awareness and reduction in security incidents by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Microsoft Sentinel** for security monitoring and incident response, ensuring adherence to **ISO 27001** and **SOC2** compliance across all deployments.\nImplemented security governance frameworks using **Microsoft Purview** to enforce data protection and risk management policies within the organization, successfully passing **ISO 27001** audits for 3 consecutive years.\nDesigned and executed automated security scripts utilizing **PowerShell**, enhancing defense against vulnerabilities by reducing incident response time by 30%.\nIntegrated threat detection capabilities leveraging **EDR** and **SIEM** solutions, applying the **MITRE ATT&CK** framework to improve the organization's threat hunting processes and incident response.\nConducted regular security assessments and audits aligned with **NIST** standards, consistently identifying and remediating critical security gaps, leading to a 40% decrease in security incidents.\nDeveloped and maintained security protocols for cloud environments utilizing **Azure**, ensuring compliance with GDPR and best practices for data protection.\nCollaborated with cross-functional teams to ensure secure software development practices are followed, employing continuous security integration and deployment methodologies.\nEducated staff on security best practices and conducted training sessions, achieving a **90%** compliance rate in security policies organization-wide."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript\n\tReact\n\tVue\n\tAngular\n\n **API Technologies:**\n\tOAuth2\n\tJWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure\n\n **Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS\n\tAWS: RDS\n\tAzure: App Services\n\tAzure: Blob Storage\n\tAzure: SQL Database\n\n **Other:**\n\tMicrosoft Defender\n\tMicrosoft Sentinel\n\tMicrosoft Purview\n\tPowerShell\n\tISO 27001\n\tSOC2\n\tSIEM\n\tEDR\n\tNIST\n\tMITRE ATT&CK\n\tKeycloak (OIDC, RBAC)\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tMLflow\n\tAirflow\n\tKubeflow\n\tRedis\n",
  "apply_company": "Netrix Global"
}