{
  "name": "Andrzej Ito",
  "role_name": "QA Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a QA Engineer with over 9 years of experience in software testing and quality assurance, I specialize in designing and implementing effective testing strategies to ensure product excellence. My strong skills in **automated testing frameworks** such as **Selenium** and **JUnit**, along with proficiency in **API testing** and **performance testing**, enable me to deliver high-quality software solutions. I have a proven track record of collaborating with cross-functional teams to enhance product reliability and user satisfaction, while mentoring and guiding junior QA engineers. I am dedicated to driving continuous improvement and ensuring technical excellence across all projects.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": " Develop and implement QA strategies for **Java** based cloud applications, ensuring effective testing of Microservices and REST APIs.\n Collaborate with development teams to enhance application performance and stability through rigorous testing practices.\n Design and execute test cases for Hybrid-single Page Application developed using **Java**, **Spring Boot**, **React 17**, and **Redux 4.2.1**.\n Utilize **Node.js** and **MongoDB** for backend testing, ensuring seamless integration with front-end technologies.\n Validate user interface functionality and responsiveness on **Angular 14**, **HTML5**, **CSS**, and **Bootstrap**, confirming user-friendly interactions.\n Leverage **Jenkins** and **Ansible** for CI/CD processes, optimizing automation in deployment cycles for both dev and production environments.\n Monitor performance and stability of deployed applications, aiming for version control that ensures updates reflect a minimum of 99% uptime.\n Execute thorough regression and performance testing to maintain **multithreading** and **concurrency** efficiencies across applications.\n Collaborate with cross-functional teams to ensure adherence to best coding practices and quality standards, contributing to a 20% reduction in bug reports."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Conducted thorough testing of web applications developed with **Spring MVC**, **React 12**, **Angular 12**, and **jQuery** to ensure quality and functionality.\n• Developed automated test scripts to enhance testing efficiency and coverage for the user interface, focusing on responsiveness across **HTML5**, **CSS3**, and **JavaScript** technologies.\n• Collaborated with developers on the integration of testing frameworks within **Spring Boot Microservices** architecture, ensuring robust backend REST APIs accessibility.\n• Participated in requirement gathering and design reviews to identify areas to enhance user experience across diverse browsers and devices.\n• Actively contributed to improving application performance by testing and optimizing **AJAX** calls and real-time functionality with **Web Sockets**.\n• Analyzed test results and reports to identify bugs and work closely with the development team for timely resolutions, ensuring the application meets established **quality standards**.\n• Tracked and reported on software quality metrics, including bug counts and test coverage, leveraging tools used for **continuous integration** and testing.\n• Engaged in regular training sessions to stay updated on new testing methodologies relevant to **JavaScript frameworks** and **front-end libraries**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Conducted extensive testing on web applications developed using **Spring MVC**, **jQuery**, **HTML**, **JavaScript**, **CSS**, **Material UI**, and **Tailwind CSS**, ensuring high-quality deliverables for **9** projects.\n• Utilized **jQuery** for implementing client-side validation and enhancing user interface controls with a focus on performance improvement, reducing load time by **30%**.\n• Collaborated with design teams to convert designs from Photoshop and Figma into responsive, table-less semantic XHTML and CSS, maintaining adherence to **W3C** standards across **10** applications.\n• Developed and integrated CORS solutions using **Node.js**, along with RESTful services using **Node** and **Express**, achieving an API response time improvement of **25%**.\n• Designed and implemented SSIS packages for efficient data transfer from flat file sources to **MS SQL Server**, streamlining data processing workflows.\n• Gained proficiency in essential web technologies and tools including **Bower**, **NPM**, **Git**, as well as cloud services such as **AWS**, **Azure**, **GCP**, and **Heroku**, contributing to the advancement of deployment processes across **15** team projects."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, C++, C#, Python, SQL, PLSQL, Kotlin\n\n**Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA, Node.js\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tSOAP, REST APIs\n\n**Databases**\n\tMS SQL Server, Oracle, MongoDB, PostgreSQL, Redis\n\n**Other**\n\tSOLID, DRY, LINQ, Microservices, Rabbit MQ"
}