{
  "name": "Tomasz Lee",
  "role_name": "Sr. Incident Response Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Sr. Incident Response Engineer with over 9 years of experience in implementing and managing critical IT infrastructure solutions including **Microsoft Windows Server**, **Active Directory**, **VMware**, **Microsoft Hyper-V**, and **SQL Server**. Proficient in deploying secure networking solutions such as **VPN**, **Remote Desktop**, **Citrix**, and **Firewall Technologies**. Expertise in backup and disaster recovery solutions, along with strong competencies in **Cloud Infrastructure** (specifically **Azure** and **AWS**). Demonstrated success in leading incident response initiatives, optimizing performance, and enhancing security protocols through **MFA** and **Endpoint Protection**. Proven capability in collaborating across teams and utilizing tools like **ServiceNow** to streamline change management processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Sr. Incident Response Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Implemented and managed **Microsoft Windows Server** environments to ensure optimal availability and security of services.\nConducted user authentication and authorization through **Active Directory**, simplifying user management and access control across systems.\nUtilized **VMware** and **Microsoft Hyper-V** technologies for creating and managing virtual machines, improving resource allocation by 30%.\nConfigured and maintained **SQL Server** databases, enhancing data integrity and reliability with a 99.9% uptime.\nManaged email services through **Exchange**, ensuring secure and reliable email communication for 500+ users.\nAdministered **SharePoint** for collaboration across teams, improving project workflow efficiency by 20%.\nSet up and maintained **SCCM** for streamlined software updates and compliance across all company devices, reducing support overhead by 25%.\nExecuted **MDT** deployments for operating system installation and configuration, achieving a deployment time reduction of 50%.\nEstablished and managed **VPN** connections to provide secure remote access for users, enhancing productivity for remote teams by 40%.\nUtilized **Remote Desktop** and **Citrix** for user desktop management and support, improving response time from support requests by 30%.\nDeveloped and maintained backup and disaster recovery solutions, ensuring data safety and recovery capabilities in case of failure events.\nConfigured **Firewall Technologies** to secure the network perimeter and protect against unauthorized access, enhancing security posture significantly.\nLeveraged **Cloud Infrastructure (Azure, AWS)** to optimize resource usage and scalability for applications, achieving resource cost reductions of 20%.\nAchieved Cisco networking certifications (**CCNA** and **CCNP**) to ensure high-level network architecture and troubleshooting skills.\nImplemented **Security Enhancements (MFA, Endpoint Protection)** to elevate security protocols and safeguard sensitive data effectively.\nLed the **Change Management Process** to assess and implement changes smoothly, reducing incidents by 15%.\nUtilized **ServiceNow** for incident tracking and resolution, improving response times to service disruptions by 25%."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Managed and implemented **Microsoft Windows Server** solutions to enhance system reliability and performance, ensuring 99.9% uptime across environments.\n• Developed and maintained **Active Directory** protocols for secure user authentication and authorization across **Microsoft Hyper-V** virtualized environments, improving security response times by 30%.\n• Utilized **VMware** to optimize resource allocation and improve operational efficiency by 20% across various virtual machines.\n• Configured and managed **SQL Server** databases, leading to a 40% reduction in query response times through performance tuning and optimization.\n• Oversaw **Exchange** migration projects with a success rate of 100% while minimizing user downtime.\n• Leveraged **SharePoint** for collaboration, enhancing document management and project tracking functionalities by 25%.\n• Implemented and monitored **SCCM** for software distribution and updates, reducing compliance issues by 15%.\n• Designed and executed **Backup Solutions** and **Disaster Recovery Solutions** strategies, ensuring data integrity and availability with a recovery time objective (RTO) of less than 1 hour.\n• Configured secure **VPN** connections and **Remote Desktop** services for remote users, increasing remote workforce productivity by 35%.\n• Managed **Citrix** environments to provide virtual desktop infrastructure, achieving a user satisfaction rating of over 90%.\n• Conducted security assessments and implemented **Firewall Technologies** with advanced threat protections to increase incident response times.\n• Developed and maintained **Cloud Infrastructure** solutions on **Azure** and **AWS** to ensure scalable and resilient IT environments.\n• Attained **Cisco CCNA** and **Cisco CCNP** certifications, using expertise to enhance network reliability and security.\n• Executed **Security Enhancements** like MFA and **Endpoint Protection**, reducing security breaches by 40%.\n• Streamlined **Change Management Process** within the IT service delivery model, increasing efficiency in service updates.\n• Utilized **ServiceNow** for IT service management, achieving a 20% increase in incident resolution efficiency."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Managed and optimized **Microsoft Windows Server** environments to ensure high availability and performance for critical applications.\n• Configured and maintained **Active Directory** for user authentication, access control, and group policy enforcement, enhancing security protocols.\n• Utilized **VMware** and **Microsoft Hyper-V** to manage virtualized environments, improving resource allocation by **30%**.\n• Administered **SQL Server** databases, significantly improving query response times and data retrieval efficiency by **25%**.\n• Implemented backup solutions and disaster recovery strategies, ensuring data integrity and uptime, achieving a restore time objective (RTO) of under **4 hours** during incidents.\n• Integrated **Exchange** and **SharePoint** for centralized communication and collaboration, streamlining workflow processes across teams.\n• Leveraged **SCCM** and **MDT** for automated system deployments, reducing manual errors and deployment time by **40%**.\n• Configured and managed secure **VPN** connections for remote access, allowing operational continuity for remote teams.\n• Monitored system performance using **Citrix** and **Remote Desktop** applications, enhancing remote support capabilities.\n• Conducted regular security assessments to implement security enhancements such as **MFA** and **Endpoint Protection**, mitigating potential threats.\n• Followed a structured **Change Management Process** to ensure seamless updates and upgrades with minimal operational impact.\n• Utilize **ServiceNow** for incident tracking and resolution, improving response times and customer satisfaction rates by **15%**."
    }
  ],
  "skills": "**Backend Frameworks:**\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Programming Languages:**\tJavaScript, TypeScript, Python, Solidity\n\n**Frontend Frameworks:**\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\tRESTful API, GraphQL\n\n**Databases:**\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL Server\n\n**Cloud & Infrastructure:**\tAWS, Azure, Cloud Infrastructure (Azure, AWS), Microsoft Windows Server, VMware, Microsoft Hyper-V, Security Enhancements (MFA, Endpoint Protection)\n\n**DevOps:**\tCI/CD pipelines\n\n**Other:**\tUX/UI Design, Git, GitHub, Redux, Apache Kafka, RabbitMQ, Redis, Testing Tools (NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest), Exchange, SharePoint, SCCM, MDT, VPN, Remote Desktop, Citrix, Backup Solutions, Disaster Recovery Solutions, Firewall Technologies, Change Management Process, ServiceNow\n"
}