{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Python Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Python Engineer with 10+ years of experience delivering high-performance software solutions in healthcare and finance. Proficient in **Python**, **Django**, **SQL**, **AWS**, and **Kubernetes**, with a solid foundation in developing scalable REST and GraphQL APIs. Expertise in **CI/CD** processes using **Git**, combined with hands-on experience in managing database migrations and leveraging ORMs effectively. Committed to maintaining best practices in software development lifecycle (SDLC), emphasizing SOLID, DRY, and KISS principles, alongside effective technical debt management. Experienced in conducting code reviews and implementing test automation strategies to ensure high-quality deliverables.\n\nIn addition to technical skills, I bring strong communication abilities and a passion for mentoring junior developers, fostering a collaborative environment conducive to knowledge sharing. My experience includes building cloud-native applications on **AWS**, and designing microservices architecture that supports event-driven systems, ensuring secure and compliant solutions aligned with standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tUtilized **Python** with **Django** to develop scalable, full-stack solutions, ensuring adherence to industry standards and effective **database migrations** for optimized data management.\n•\tImplemented **REST**ful APIs using **GraphQL**, enhancing data retrieval processes and allowing seamless integration across platforms.\n•\tBuilt and deployed cloud services on **AWS**, utilizing **Kubernetes** for container orchestration to maintain high availability and efficient resource management.\n•\tDesigned and executed CI/CD pipelines with **Git** and **test automation** tools, facilitating smoother deployment processes across **9** environments and improving overall software quality.\n•\tCollaborated with cross-functional teams to establish best practices for **code reviews** and maintain **technical debt management**, ensuring clean and efficient codebases.\n•\tEmployed the **SOLID** principles and **Design Patterns** in software architecture, leading to maintainable and scalable code across projects.\n•\tLed the implementation of **ORMs** for efficient interaction with databases, enhancing data access and reducing application complexity.\n•\tMentored junior developers through effective **communication** strategies, fostering a collaborative environment focused on continuous improvement.\n•\tExecuted comprehensive **test automation** strategies using tools like Jest and Cypress, achieving **80%** test coverage in both front-end and back-end services.\n•\tConducted detailed analysis of the **SDLC** to identify areas for improvement and streamline project workflows, significantly reducing release time by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Django** to lead the development of scalable financial platforms, enhancing performance through a microservices architecture that supports over **100,000** transactions per day.\nEmployed **CI/CD** methodologies to streamline deployment processes, reducing release cycle time by **30%**, while ensuring high code quality through automated **code reviews** and **test automation** practices.\nImplemented **SQL** for efficient data retrieval, allowing for rapid analytics on large financial datasets, and executed **database migrations** that improved data integrity and performance across **10+** environments.\nManaged application deployment using **AWS** and **Kubernetes**, improving availability with a **99.9%** uptime in production environments.\nContributed to API design using **REST** and **GraphQL**, facilitating seamless microservice interactions and reducing API response times by **25%**.\nPromoted **SOLID**, **DRY**, and **KISS** principles during the software development life cycle (SDLC) to enhance code maintainability and reduce technical debt.\nProvided mentorship and guidance to junior developers, enhancing team skills in **ORMs** and design patterns, thus increasing team throughput by **40%**.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "- Developed and optimized backend services for a global e-commerce platform using **Python** with frameworks such as **Django** and **FastAPI**, ensuring high availability and scalability, particularly in key modules like checkout and order fulfillment.\n- Employed SQL databases and ORM techniques for seamless data operations, ensuring efficient **Database Migrations** and optimized performance for high-traffic applications.\n- Implemented CI/CD pipelines to streamline deployment processes, utilizing **Kubernetes** for container orchestration and ensuring rapid deployment cycles.\n- Conducted thorough **Code Reviews** to maintain high-quality standards and foster team collaboration, enhancing code maintainability and reducing technical debt.\n- Introduced robust design patterns and best practices (e.g., **SOLID**, **DRY**, **KISS**) into the codebase, improving code quality and team adherence to effective software development principles.\n- Collaborated on implementing GraphQL and RESTful APIs, ensuring efficient data retrieval and enhanced application performance across all endpoints.\n- Supported the Software Development Life Cycle (SDLC) by driving discussion around architecture and design considerations, and by providing mentorship to junior developers in the team.\n- Championed test automation efforts to enhance product reliability, significantly reducing bugs in production by **30%** through systematic testing strategies and integration practices.\n- Leveraged **AWS** cloud services to enhance system capacity and performance, ensuring infrastructure remained robust under peak loads, achieving **99.9%** uptime for critical services.\n- Fostered effective communication within the team, promoting an open culture to address challenges and implement innovative solutions."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tDjango, FastAPI, Flask\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tGraphQL, REST\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose, Git\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, ORMS, Database Migrations, Code Reviews, Test Automation, SDLC, SOLID, DRY, KISS, IoC, Design Patterns, Technical Debt Management, Communication, Mentoring",
  "apply_company": "Portside, Inc."
}