{
  "name": "Rei Taro",
  "role_name": "Senior IT Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior IT Engineer with over 10 years of experience in implementing robust backend solutions, with a strong emphasis on **AWS**, **Linux**, and **troubleshooting**. Demonstrated ability to leverage technologies such as **Grafana**, **ElasticSearch**, **Splunk**, and **OpenVPN** to optimize system performance and reliability. Proven expertise in problem-solving and team leadership, effectively collaborating with cross-functional teams to deliver high-quality IT services. Notable experience in managing complex environments, including **Proxmox**, **ESXI**, and various network security protocols like **IPSec** and **WireGuard**. A skilled communicator, committed to enhancing operational efficiency in top-tier organizations.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior IT Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **AWS** cloud services to enhance infrastructure and support rapid deployment for IT solutions.\nImplemented **ITIL** best practices to optimize service management, ensuring high availability and performance metrics of **99.9%** uptime.\nSupported systems with **Proxmox** and **ESXI** for virtualization, facilitating a scalable and robust server environment for diverse applications.\nAdministered **Linux** and **BSD** server environments, reinforcing security protocols while improving system performance.\nMonitored system health and performance using **Grafana** and **ElasticSearch**, achieving improved response times by **40%**.\nDeveloped logging and monitoring solutions with **Splunk** to deliver actionable insights and faster troubleshooting capabilities.\nConfigured and managed secure VPN solutions using **OpenVPN**, **IPSec**, and **WireGuard** to protect sensitive data.\nImplemented firewall solutions with **pfSense** to enhance network security and prevent unauthorized access.\nLed a cross-functional team to resolve complex IT challenges, promoting effective **communication** and ensuring project milestones were met on time.\nApplied strong **troubleshooting** and **problem-solving** skills to address system issues, driving resolutions to exceed customer expectations."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **AWS** for cloud infrastructure management, ensuring reliable and scalable deployments of IT solutions.\nExecuted problem-solving strategies to troubleshoot complex system issues, resulting in a **30%** reduction in downtime.\nLed team initiatives focused on adopting **Linux** environments, boosting operational efficiency by implementing best practices across **12** projects.\nManaged IT operations using **ITIL** framework, improving incident resolution times by **25%** and enhancing service delivery.\nImplemented network security measures using **OpenVPN**, **IPSec**, and **WireGuard** to secure data in transit and safeguard sensitive information.\nCreated real-time monitoring solutions utilizing **Grafana** and **ElasticSearch**, achieving a **99%** uptime across all services monitored.\nExecuted comprehensive audits and maintenance protocols on **Proxmox** and **ESXI** servers to optimize performance and support user scalability goals.\nFostered effective communication within cross-functional teams, ensuring project milestones were achieved smoothly and within set deadlines."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented and managed cloud solutions using **AWS** to ensure high availability and scalability of backend services.\nLeveraged **Linux** and **BSD** expertise for optimal system performance and security in trade execution and account tracking environments.\nUtilized problem-solving skills to troubleshoot and resolve issues within the infrastructure, maintaining a **99.9%** uptime and stability for all trading operations.\nLed a team of engineers in the deployment and integration of monitoring tools like **Grafana**, **ElasticSearch**, and **Splunk** for enhanced visibility into system performance and user engagement.\nEnsured robust data protection measures were in place, including the implementation of **OpenVPN**, **IPSec**, and **WireGuard** for secure communications and compliance with regulatory mandates.\nConducted training sessions to enhance team leadership and communication, improving team performance metrics by **30%**.\nExecuted ITIL processes for streamlined delivery and support, ensuring adherence to best practices and optimizing IT service management.\nDeveloped scripts for automating routine tasks and monitoring systems, enhancing operational efficiency by **25%**."
    }
  ],
  "skills": "• **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n• **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n• **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n• **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda)\n\n• **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n• **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps\n\n• **Cloud & Infrastructure**\n\tAzure, Grafana, ElasticSearch, Proxmox, ESXI, Linux, BSD\n\n• **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, CI/CD, PyTest, Git, troubleshooting, problem-solving, team leadership, communication, OpenVPN, IPSec, WireGuard, pfSense, Splunk",
  "apply_company": "Social Discovery Group"
}