{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of comprehensive experience in developing innovative software solutions. Proficient in **JavaScript**, **TypeScript**, **Node.js**, **React**, **Express**, **MongoDB**, and **PostgreSQL**, with extensive expertise in **Redis** for caching and **Docker** for containerization. Demonstrated capability in implementing **DevOps** practices, including **Automated Testing**, **Continuous Integration**, and **Version Control**. Familiar with **Google Cloud Platform** and its services, including **Google Kubernetes Engine**. Strong background in utilizing **Prometheus** for monitoring and performance optimization. Proven track record of successfully leading cross-functional teams to deliver high-quality applications on time. Committed to enhancing development processes and ensuring thorough documentation.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **React** for developing user-friendly interfaces, leading to a **25%** increase in user satisfaction.\nImplemented **Node.js** and **Express** for server-side logic in a web-based customer management platform, ensuring high performance and scalability.\nDesigned and executed a microservices architecture using **Docker** for containerization, facilitating modularity and ease of deployment.\nIntegrated **MongoDB** for efficient data storage and retrieval, ensuring seamless data access for various services.\nOptimized caching strategies with **Redis**, resulting in a **35%** improvement in response times by reducing database load.\nEmployed **Prometheus** for monitoring system performance, enhancing reliability and uptime.\nImplemented CI/CD pipelines on **Google Cloud Platform** with **Google Kubernetes Engine**, achieving a **40%** reduction in deployment time.\nDeveloped automated testing strategies to ensure quality and performance across all modules, contributing to robust software delivery.\nCollaborated closely with UX/UI designers to enhance user interface designs, improving overall user experience.\nUtilized **PostgreSQL** for structured data storage, optimizing queries to reduce average execution time by **20%**.\nLed documentation efforts to maintain clarity and accessibility of the codebase, ensuring smooth onboarding for new team members."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed dynamic web applications utilizing **React** and **Node.js**, optimizing user interfaces that contributed to a **25%** improvement in user engagement.\nImplemented server-side logic using **Express** and managed **MongoDB** databases for efficient data handling and retrieval, ensuring **99.9%** system uptime.\nDesigned and integrated RESTful APIs with **PostgreSQL**, enabling real-time data access that improved application responsiveness.\nUtilized **Docker** for containerization, enhancing deployment consistency across different environments, and streamlined staging and production processes.\nEstablished CI/CD workflows using **GitHub Actions**, achieving a **30%** reduction in deployment errors and improving overall team efficiency.\nCollaborated with cross-functional teams to define project requirements, ensuring timely delivery within estimated **project timelines** of 3 to 6 months.\nExecuted automated testing frameworks to ensure code quality and reliability, significantly reducing bugs in production.\nConducted mentorship sessions and code reviews for junior developers, fostering a culture of continuous learning and improving team productivity by **15%**.\nMaintained accurate project documentation, aligning with best practices for **Version Control**.\nUtilized **Linux** environments for application development and deployment, ensuring robust system integration and performance monitoring with tools such as **Prometheus**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Node.js** and **Express** for building scalable backend services, enhancing application performance and reliability.\nDeveloped frontend applications with **React** and **TypeScript**, contributing to a **15%** increase in user engagement through improved UI/UX.\nEmployed **Docker** for containerization, streamlining the deployment process and reducing environment inconsistencies across staging and production.\nImplemented **MongoDB** as the primary database, achieving a **30%** improvement in data retrieval times through optimized queries.\nWorked in a **Linux** environment to manage infrastructure and application deployment, ensuring system stability and uptime.\nIntegrated **Redis** for caching, resulting in a **25%** decrease in load times for frequently accessed data.\nCollaborated with the DevOps team to establish **Continuous Integration** and **Automated Testing** pipelines, enhancing code quality and delivery speed.\nLed documentation efforts to create clear and concise technical guides, improving team onboarding and knowledge-sharing by **40%**.\nUtilized **Google Cloud Platform** and **Google Kubernetes Engine** for efficient cloud service management, ensuring scalable and cost-effective solutions.\nParticipated in Agile ceremonies, including daily standups and code reviews, to maintain alignment with project goals and coding standards."
    }
  ],
  "skills": " **Programming Languages** \n\t JavaScript, TypeScript, Python \n\n **Backend Frameworks** \n\t Node.js, Express, NestJS, .NET \n\n **Frontend Frameworks** \n\t React, ReactJS, NextJS, VueJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL \n\n **Serverless and Cloud Functions** \n\t AWS, Azure, Google Cloud Platform, Google Kubernetes Engine \n\n **Databases** \n\t MongoDB, PostgreSQL, MSSQL Server, MySQL, DynamoDB, CosmosDB \n\n **DevOps** \n\t Docker, Linux, DevOps, CI/CD pipelines, Continuous Integration, Automated Testing, Prometheus \n\n **Cloud & Infrastructure** \n\t Google Cloud Platform, AWS, Azure \n\n **Other** \n\t UX/UI Design, Git, GitHub, Redis, RabbitMQ, Apache Kafka, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Microservices, Documentation",
  "apply_company": "Digital Science"
}