{
  "name": "Rei Taro",
  "role_name": "Senior FullStack Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior FullStack Engineer with over 10 years of experience specializing in building high-performance applications using **.NET**, **C#**, and **React**. Proficient in designing and implementing robust **APIs** and **Microservices** architectures, ensuring scalability and efficiency. Skilled in leveraging **Docker** and **Kubernetes** for containerization and orchestration. Expertise in both SQL and NoSQL databases, demonstrating a strong command over data management. Experienced in Asynchronous Communication and System Design, alongside employing Observability Tools to monitor application performance. Proven ability to collaborate effectively across teams and contribute to diverse projects, including financial platforms and advanced AI tools, with a successful track record at renowned organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Developed and maintained scalable APIs and microservices using **.NET** and **C#**, ensuring high performance and responsiveness.\n• Designed and implemented microfrontend architectures with **React** to enhance user interaction and overall application experience.\n• Employed **Docker** and **Kubernetes** for container orchestration and deployment, ensuring consistent environments across development and production.\n• Collaborated with cross-functional teams to understand and address system integration challenges, leveraging effective communication for efficient code reviews and project alignment.\n• Engineered asynchronous communication solutions with **AWS** and **Redis**, improving event-driven data processing by up to **50%**.\n• Enabled system observability by integrating observation tools to monitor application performance metrics, leading to a **30%** reduction in downtime incidents.\n• Assisted in system design and architecture reviews, contributing to high-level discussions that influenced **5+** projects.\n• Utilized both SQL and NoSQL databases to manage data effectively, optimizing query performance by over **20%** through effective indexing strategies.\n• Championed the use of AI tools to streamline development processes, enhancing productivity by implementing intelligent automation strategies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed **APIs** and microservices architecture using **.NET**, ensuring high scalability and maintainability of systems.\n• Designed and implemented **React** microfrontends, enabling a modular and efficient front-end experience for users.\n• Engineered containerized applications using **Docker** and orchestrated deployments with **Kubernetes**, achieving a **30% reduction** in deployment time.\n• Leveraged **SQL** and **NoSQL** databases for efficient data storage and retrieval, optimizing performance by **25%** in critical applications.\n• Implemented asynchronous communication patterns within systems to enhance performance and responsiveness, utilizing **Azure** and **AWS** services.\n• Conducted code reviews and applied best practices in **System Design**, improving code quality and project maintainability by **40%**.\n• Collaborated with cross-functional teams to ensure seamless integration of services, achieving successful releases with a **95%** on-time delivery rate.\n• Employed observability tools to monitor and enhance system performance, resulting in improved uptime and user satisfaction scores by **15%**.\n• Integrated advanced **AI Tools** for workflow automation, reducing manual processes and errors significantly."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Designed and developed robust **Microservices** architecture using **.NET**, ensuring seamless integration and high scalability across applications.\n• Built responsive user interfaces with **React**, enhancing user experience through consistent and dynamic interactions.\n• Created and managed **APIs** to facilitate data exchange between frontend and backend systems, utilizing best practices in **System Design**.\n• Leveraged **Docker** for containerization of applications, and managed orchestration using **Kubernetes** for efficient deployment and scaling processes.\n• Implemented cloud solutions on **AWS** to optimize infrastructure performance and reliability, resulting in a 30% increase in deployment speed.\n• Utilized both **SQL** and **NoSQL** databases, incorporating engineering strategies that improved data retrieval efficiency by 25%.\n• Employed **Asynchronous Communication** for backend services, enhancing responsiveness and throughput for high-volume transactions.\n• Collaborated with multi-functional teams to conduct thorough **Code Reviews**, ensuring adherence to coding standards and best practices.\n• Integrated **Observability Tools** for monitoring application performance and debugging, leading to a reduction in incident response time by 40%.\n• Advocated for and implemented **AI Tools** for predictive analytics and automated testing processes, improving development efficiency by 20%.\n• Led workshops on **Collaboration** techniques, fostering a culture of teamwork and knowledge sharing among engineers."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, C#\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery, .NET\n\n**Frontend Frameworks**\n\tReact\n\n**API Technologies**\n\tREST/gRPC APIs, APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, NoSQL\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS\n\n**Other**\n\tMicroservices, Microfrontends, Kafka, Asynchronous Communication, System Design, Observability Tools, Code Review, AI/ML Tools, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Collaboration, PyTest, Git",
  "apply_company": "DraftKings Inc."
}