{
  "name": "Tomasz Lee",
  "role_name": "Senior Data Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Data Engineer with 9+ years of experience in **Data Integration**, **Data Architecture**, and **ETL** processes. Proficient in leveraging **Snowflake** and cloud platforms such as **Azure** and **AWS** for advanced data solutions. Strong knowledge in **SQL** and best practices for **Data Governance** and **Data Strategy**. Adept at employing **Artificial Intelligence** and **Advanced Analytics** to enhance data-driven decision-making. Demonstrated success in collaborating with cross-functional teams to deliver innovative solutions and optimize data performance. Additionally skilled in **microservices architecture** and utilizing **ReactJS**, **NextJS**, and **.NET** for full-stack development, ensuring robust application design and implementation.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Designed and implemented **ETL** processes for seamless **Data Integration** across various platforms, improving data accessibility and efficiency by **30%**.\n• Developed data architecture strategies utilizing **Azure** and **AWS**, enhancing cloud infrastructure scalability and performance by **25%**.\n• Spearheaded **Data Governance** initiatives, ensuring compliance and integrity of data across systems, increasing reliability by **15%**.\n• Collaborated with cross-functional teams to drive **Data Strategy** and **Advanced Analytics** projects, increasing predictive accuracy by **20%**.\n• Managed and optimized **SQL** databases to facilitate high-performance data operations, achieving a **40%** reduction in data retrieval times.\n• Utilized **Artificial Intelligence** techniques for data processing and analysis, leading to innovative solutions and insights that enhanced client outcomes.\n• Fostered a culture of **Team Collaboration** by implementing agile methodologies, resulting in improved project delivery timelines by **35%**.\n• Engaged with stakeholders to drive **Client Orientation**, tailoring solutions that met specific business needs and increased customer satisfaction by **30%**.\n• Championed innovation in data architecture, developing robust and efficient systems that supported current and future operational needs."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and maintained **Azure**-based data pipelines, enabling seamless **ETL** processes and enhancing data integration across systems for improved **Data Architecture**.\nConducted data governance initiatives ensuring compliance with organizational policies and practices, significantly contributing to overall data strategy effectiveness.\nImplemented advanced analytics solutions utilizing **AWS** services to drive insights and support data-driven decision-making, leading to a 30% rise in analytical capabilities.\nDesigned and executed **SQL** queries for data retrieval, optimized for performance which improved data processing times by **25%**.\nCollaborated in cross-functional teams to enhance team collaboration, facilitating project success and timely delivery of data projects by engaging with stakeholders.\nUtilized **Snowflake** for data warehousing solutions, ensuring high availability and scalability of analytical data, supporting business intelligence operations.\nIncorporated artificial intelligence elements into data workflows, pushing innovation within data processing methodologies.\nFostered client orientation by addressing specific data needs and customizing processes to enhance the overall experience.\nMentored junior data engineers, promoting knowledge sharing which contributed to improved team productivity by **20%**.\nDeveloped comprehensive data integration strategies that effectively combined various data sources, improving data quality and accessibility."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed robust **ETL** processes for data integration using **Azure** and **Snowflake**, ensuring efficient data movement across platforms, which enhanced data accessibility by **30%**.\n• Designed data architecture solutions that adhere to **Data Governance** best practices, optimizing data quality and compliance.\n• Collaborated with cross-functional teams to define and execute a **Data Strategy** aligned with business goals, leading to a **25%** increase in analytics productivity.\n• Implemented **AWS** services for data storage and processing, successfully managing over **1TB** of structured and unstructured data.\n• Conducted advanced analytics using **Artificial Intelligence** techniques to generate business insights, contributing to informed decision-making.\n• Enhanced data integration capabilities by architecting solutions that enable seamless data flow between systems, improving operational efficiency.\n• Participated in team collaboration activities and client orientations to ensure alignment with project objectives and stakeholder requirements.\n• Provided input on innovations within data processes and systems, fostering a culture of continuous improvement within the team.\n• Delivered technical documentation and compliance reports for data initiatives, resulting in a **15%** reduction in onboarding time for new team members."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tSnowflake, ETL, Data Governance, Data Strategy, Data Integration, Data Architecture\n\n**Other**\n\tGit, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Python, Redux, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Artificial Intelligence, Advanced Analytics, Team Collaboration, Client Orientation, Innovation, UX/UI Design",
  "apply_company": "Logicalis Spain"
}