{
  "name": "Damian Franciszek Pospiech",
  "role_name": "C++ Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "C++ Developer with 13+ years of experience in delivering high-performance applications in complex environments, skilled in **C++**, **STL**, and **Boost** for developing robust multithreaded applications. Proficient in designing algorithms and utilizing **PostgreSQL** and **MS SQL Server** for efficient data management.\nExperienced in both **Windows** and **Linux** operating systems, with a strong understanding of network programming and **WinAPI** for system-level development. Excellent English proficiency enabling effective communication and collaboration within diverse teams.\nAdditionally, adept at leveraging AI/ML technologies, with a background in full-stack development using **JavaScript/TypeScript**, **Python**, and **Flutter**. Knowledge in cloud deployment on **AWS** and **Azure** and experience with microservices architecture further enhance my ability to deliver scalable solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "C++ Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C++** and **STL** to develop efficient multithreaded applications for health and finance sectors, enhancing performance by **30%** compared to legacy systems.\nImplemented robust algorithms to enhance data processing capabilities and optimize operations in both Windows and Linux environments.\nDesigned network programming solutions with **WinAPI**, facilitating seamless integration of applications across diverse platforms.\nMaintained and optimized databases using **PostgreSQL** and **MS SQL Server**, ensuring high availability and quick retrieval of critical financial and health data.\nCollaborated in cross-functional teams, adhering to Agile methodologies to deliver projects on time with a focus on quality and performance metrics.\nDeveloped comprehensive documentation and provided English proficiency support to ensure clarity and continuity across teams and stakeholders.\nPerformed testing and debugging of applications to uphold coding standards and reduce error rates by **25%** during development cycles.\nParticipated in code reviews to introduce improvements, share knowledge, and foster a culture of continuous learning and optimization among team members."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **C++** and **STL** to develop high-performance, multithreaded applications for financial transaction processing, achieving a processing speed increase of **30%**.\nDesigned and implemented database solutions using **PostgreSQL** and **MS SQL Server**, ensuring data integrity and optimizing queries for financial applications, contributing to a **25%** reduction in response times.\nLeveraged **C#** for the development of desktop applications on **Windows** and **Linux** platforms, enhancing user experience and system compatibility.\nEmployed **Boost** libraries to enhance application functionality and improve efficiency in computational tasks related to financial algorithms.\nImplemented network programming strategies to facilitate secure data transmission and communication between distributed systems, reducing latency by **15%**.\nCollaborated with cross-functional teams to ensure seamless integration of C++ components with backend systems, increasing the overall project efficiency.\nProvided extensive documentation and support for code base operations, improving team knowledge and reducing onboarding time for new developers by **40%**.\nMaintained proficiency in English to communicate effectively with stakeholders and participate actively in agile development processes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized multithreaded applications using **C++** with **Boost** libraries to enhance performance and efficiency in processing large data sets.\nImplemented complex algorithms in C++ to solve real-world problems, ensuring optimal performance and resource management.\nUtilized **PostgreSQL** and **MS SQL Server** for robust data storage solutions, applying advanced query optimization techniques to improve database performance by at least **30%**.\nDesigned Windows applications utilizing **WinAPI** and ensured compatibility across **Windows** and **Linux** environments to provide seamless user experiences.\nEngaged in network programming to establish secure protocols and improve application performance in distributed systems, resulting in reduced latency by approximately **20%**.\nMaintained clear communication in English, collaborating with cross-functional teams to successfully deliver projects on schedule and within budget.\nEmployed rigorous testing methodologies to validate application performance, achieving a bug-free release rate of **95%** across developed applications."
    }
  ],
  "skills": " **Programming Languages:**\n\tC++, C#, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, MS SQL Server\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, multithreaded applications, algorithms, Windows, Linux, Boost, network programming, English proficiency"
}