{
  "name": "Damian Franciszek Pospiech",
  "role_name": "QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "QA Engineer with over 13 years of experience in Quality Assurance methodologies, specializing in API testing, functional testing, regression testing, integration testing, load testing, and stress testing. Adept in utilizing automation tools and defect tracking tools to enhance product reliability and performance. Skilled in both **Golang** and **Python**, alongside strong experience in **JavaScript** and **TypeScript** for effective test automation and scripting.\n\nProficient in implementing SCRUM and Agile practices to deliver high-quality software solutions efficiently. Recognized for collaborating closely with development teams to ensure that applications meet industry compliance standards while optimizing testing processes. Proven ability in employing CLI tools and logging tools to streamline debugging and improve system reliability. Background includes hands-on development in modern frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, and backend systems with **FastAPI** and **Django**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Applied **Quality Assurance methodologies** to ensure high-quality software delivery in healthcare and fintech environments.\nConducted thorough **API testing** using tools such as Postman and automated testing frameworks like Jest and Cypress, achieving a **95% reduction in critical defects** before deployment.\nUtilized **Automation tools** to create test scripts, enhancing the efficiency of testing processes while maintaining thorough coverage across various applications.\nEmployed **Defect tracking tools** to manage and monitor issues, leading to a **30% faster resolution rate** of defects throughout the development lifecycle.\nEngaged in **Functional testing** to validate application functionalities, ensuring alignment with specified requirements across different platforms, contributing to a **25% increase in user satisfaction** metrics.\nPerformed **Regression testing** to verify that updates and bug fixes did not adversely affect existing functionalities, achieving a **100% pass rate** on critical test cases during bi-weekly releases.\nExecuted **Integration testing** to confirm seamless interactions between system components and APIs, leveraging **Python** and **JavaScript** for test automation.\nConducted **Load testing** and **Stress testing** to evaluate system performance under varying conditions, providing insights that improved the scalability of applications by **40%**.\nUtilized **CLI tools** and **logging tools** to monitor application performance and facilitate debugging in real-time.\nParticipated in **SCRUM** and **Agile** methodologies, contributing to team sprints and enhancing communication and delivery times by **20%**.\nLeveraged **Golang** and additional programming languages in collaboration with development teams to enhance test coverage and optimize test environments.\nLed and coordinated testing efforts on mobile platforms using **React Native** and **Flutter**, ensuring comprehensive testing to support deployment of applications on iOS and Android platforms."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **Quality Assurance** methodologies to ensure high-quality software delivery across financial platforms by employing thorough **automated testing** and **API testing** strategies for enhanced reliability and performance.\nConducted **functional testing**, **regression testing**, and **integration testing** of systems built using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), significantly reducing defect rates by **30%**.\nUtilized **defect tracking tools** to log, prioritize, and resolve issues discovered during testing, enabling a **20%** faster turnaround on bug fixes and enhancements.\nDesigned and executed load and stress tests using tools like **JMeter** and **Gatling**, achieving system performance metrics under peak loads exceeding **1000 transactions per second**.\nCollaborated in **SCRUM** and **Agile** environments to enhance team communication and project delivery, resulting in an **improved sprint velocity** of **15%**.\nDeveloped testing automation frameworks using **Golang**, **JavaScript**, and **TypeScript**, streamlining the testing process and integrating it with continuous integration pipelines.\nMonitored system logs and performance metrics through **CLI tools** and **logging tools**, ensuring robustness in high-load scenarios and compliance with operational requirements for financial applications.\nFostered clear documentation and test reporting practices, contributing to knowledge sharing and improved testing processes within the team, ultimately resulting in greater product quality and reduced time to market."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted functional testing and regression testing on backend services and APIs built with **Python** and **Golang**, ensuring adherence to quality assurance methodologies throughout the development lifecycle.\nUtilized automation tools for efficient API testing, stress testing, and load testing, resulting in a **30%** decrease in release cycle time and improved defect identification rates.\nEngaged in defect tracking using modern tools, facilitating enhanced communication among teams and leading to a **25%** reduction in unresolved defects prior to release.\nParticipated in Agile and SCRUM practices, fostering collaboration across development and QA teams, and contributed to sprint planning sessions impacting **15** projects simultaneously.\nDeveloped and maintained CLI tools for automated testing processes, decreasing manual testing efforts by **40%**, thereby ensuring timely feedback on software quality.\nImplemented logging tools to capture and analyze test outputs, identifying critical bugs and ensuring robust system performance across high-traffic modules.\nCollaborated with software engineers to improve testing methodologies in **JavaScript**, **TypeScript**, and various frameworks to enhance reliability and scalability of applications.\nOptimized integration testing processes, achieving significant time savings in QA workflows while maintaining a focus on functional and regression testing.\nCreated standardized testing documentation and reports, improving processes and ensuring compliance with established quality benchmarks.\nContributed to the development of testing strategies that align with continuous integration and continuous deployment (CI/CD) practices, enabling smoother transitions from development to production."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript, Golang\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tAPI testing\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**Testing & Quality Assurance:**\n\tQuality Assurance methodologies, Functional testing, Regression testing, Integration testing, Load testing, Stress testing, Automation tools, Defect tracking tools\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tSCRUM, Agile, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Logging tools, CLI tools"
}