{
  "name": "Rei Taro",
  "role_name": "Senior Strategy Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Strategy Engineer with over 10 years of experience in the payments industry, specializing in the design and delivery of backend systems for financial platforms. Proficient in data analysis and performance tracking, leveraging strong skills in **Python** (FastAPI, Django, Flask) and **SQL** to develop high-performing APIs and scalable services. Expertise in project management and collaboration, ensuring successful execution of impactful projects. Hands-on experience with cloud platforms such as **AWS** and **Azure**, and a robust foundation in merchant acquiring, delivering innovative solutions that drive business success.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Strategy Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** for data analysis to optimize workflows and improve performance tracking across various projects.\nEngineered backend services in **Python** using **FastAPI** to streamline document automation, user onboarding, and reporting workflows, enhancing project management.\nDeveloped event-driven solutions with **Celery** and **Redis** to manage asynchronous processing for financial transaction requests, improving system efficiency by **30%**.\nDeployed microservices on **Azure App Services** and utilized **Terraform** to manage infrastructure as code, ensuring seamless cloud operations and reducing deployment time by **25%**.\nCreated and maintained data pipelines for regulatory data exchange with **Apache Airflow** and **Azure Functions**, ensuring timely and accurate data flow, achieving **99.9%** compliance rate.\nLed security assessments and integrated **OAuth2** and **Azure AD B2C** for secure, scalable authentication systems, enhancing data protection measures.\nCollaborated with cross-functional teams to address system integration challenges, ensuring compliance with industry standards and overseeing release strategies effectively in the **payments industry**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **SQL** for data analysis to derive insights from complex datasets, contributing to informed strategic decisions in the payments industry.\nEmployed **Python** and **FastAPI** to design and develop robust backend systems for automating document workflows and enhancing the user onboarding process, leading to a **25% reduction** in onboarding time.\nImplemented **event-driven microservices** using **Celery** and **Redis** for asynchronous processing of financial data, improving transaction handling efficiency by **40%**.\nOversaw the deployment of microservices on **Azure App Services**, employing **Terraform (v0.14)** for infrastructure automation, resulting in consistent and scalable environments across **3 different regions**.\nEngineered secure data pipelines for regulatory compliance, leveraging **Apache Airflow** and **Azure Functions** to automate and optimize the data exchange process, thus increasing performance tracking accuracy by **30%**.\nConducted thorough security audits to ensure compliance with industry standards, integrating **OAuth2** and **Azure AD B2C** for enhanced authentication and secure access controls.\nCollaborated effectively with cross-functional teams, improving project management and fostering problem-solving initiatives, which contributed to the successful integration and release management of new features."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Executed data analysis and performance tracking initiatives utilizing **SQL**, **Python** and **PostgreSQL** to ensure optimal trade execution and portfolio management.\n• Developed sophisticated backend services with **Flask** to support merchant acquiring processes in the payments industry.\n• Collaborated with cross-functional teams to streamline project management and enhance system functionality, ensuring seamless integration with frontend solutions via REST APIs and WebSocket channels.\n• Resolved complex problems in real-time price feed processing using **asyncio** and **Redis**, catering to high-frequency trading requirements, with a focus on delivering updates every **10 milliseconds**.\n• Ensured compliance with regulatory standards including MiFID II and GDPR while maximizing data security protocols to safeguard sensitive transaction information.\n• Created robust testing frameworks utilizing **PyTest** and various mock servers, reducing QA time by **30%** and enhancing CI processes for rapid feature deployment.\n• Integrated job queuing and scheduling systems with **Celery** and **RabbitMQ**, improving backend task execution efficiency, reducing response times by **25%**."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython (3.8+), SQL, R\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\t\n\n  **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n  **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n  **Cloud & Infrastructure**\n\t\n\n  **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, problem-solving, collaboration, data analysis, project management, performance tracking, payments industry, merchant acquiring",
  "apply_company": "Revolut"
}