{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Full-Stack Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a results-driven Senior Full-Stack Engineer with 8+ years in software engineering, I excel in developing scalable applications using **Java Spring Boot**, **React**, and **TypeScript**. My experience includes implementing **CI/CD** pipelines with tools such as **GitHub**, **GitHub Actions**, and **Jenkins**, as well as maintaining code quality through **SonarQube**. I have a strong foundation in **Microservices** architecture and adhere to **Agile** methodologies to ensure rapid and efficient delivery. Skilled in front-end technologies such as **HTML**, **CSS**, and **Responsive Design**, I focus on writing **Clean Code** and applying **Design Patterns** for maintainable projects. Additionally, I possess solid expertise in **Unit Testing** to guarantee the reliability of software solutions. My background includes developing secure and efficient applications tailored to the e-commerce, financial, and healthcare sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Full-Stack Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed scalable, cloud-native **Java Spring Boot** microservices to deliver secure and efficient applications, leveraging Agile methodologies for continuous improvement.\n- Designed and implemented responsive user interfaces using **React** and **TypeScript**, ensuring compatibility across devices and enhancing user experience with clean code practices.\n- Utilized modern web technologies including **HTML** and **CSS** to create engaging, user-friendly front-end layouts while adhering to responsive design principles.\n- Created CI/CD pipelines utilizing **GitHub Actions** and **Jenkins** to automate testing and deployment processes, resulting in a 30% reduction in release times.\n- Conducted unit testing with **SonarQube** and implemented design patterns that improved code maintainability and reliability across various services.\n- Led the transition to a microservices architecture for existing applications, collaborating with cross-functional teams to achieve project milestones and enhance system scalability.\n- Spearheaded code reviews and mentoring for junior developers, promoting adherence to clean code principles and design patterns within the team's coding practices.\n- Streamlined front-end and back-end integrations by applying best practices in API development and maintenance, ensuring seamless communication between **Java Spring Boot** services and **React** applications.\n- Coordinated with stakeholders to define project requirements and deliver solutions that align with business needs while maintaining high-quality standards.\n- Ensured best practices in software development through Agile methodologies, enhancing team collaboration and project adaptability throughout the software lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Led the development of microservices using **Java Spring Boot**, ensuring effective scalability, maintainability, and high performance in line with industry standards.\n- Designed and implemented RESTful APIs for seamless integration with **React** and **TypeScript** frontends, ensuring smooth communication and real-time updates for users.\n- Streamlined CI/CD processes using **GitHub Actions** and **Jenkins**, achieving a deployment frequency of **3 times per week** and reducing release time by **25%**.\n- Developed responsive and user-centric web applications utilizing **HTML**, **CSS**, and **React**, implementing best practices for **Responsive Design** and **Clean Code** principles.\n- Applied **Design Patterns** effectively to enhance code organization and maintainability within the full-stack architecture.\n- Implemented comprehensive unit testing frameworks, leveraging **Jenkins** and **SonarQube** for continuous quality assurance, achieving a unit test coverage of **85%**.\n- Collaborated in an **Agile** environment, participating in sprint planning and retrospectives, which improved team efficiency by **30%**.\n- Managed code repositories using **GitHub**, ensuring version control and collaboration across the development team.\n- Championed microservices architecture, optimizing service interconnectivity and allowing for independent deployment of components.\n- Fostered team standards for code reviews and best practices, emphasizing the importance of **Clean Code** and maintainable solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and maintained scalable microservices using **Java Spring Boot**, enhancing performance and user experience across multiple modules in an e-commerce application.\nUtilized **React** and **TypeScript** to create dynamic, responsive frontends, applying modern state management techniques for a seamless user interface.\nImplemented CI/CD pipelines with **GitHub Actions**, **Jenkins**, and **SonarQube** to automate builds, testing, and deployments, ensuring consistent delivery of high-quality features.\nEmployed Agile methodologies to iterate on product features, resulting in a **20%** reduction in development time for new functionalities, and improved team collaboration.\nAdopted **HTML**, **CSS**, and responsive design principles to ensure cross-device compatibility and accessibility of web applications, achieving a **95%** mobile optimization score in audits.\nConducted unit testing with a focus on clean code and design patterns, achieving a **100%** test coverage on critical business logic components.\nCollaborated on the re-architecture of legacy systems into microservices, ensuring they meet modern performance standards while facilitating ongoing maintenance and evolution.\nEnhanced website security by implementing robust authentication mechanisms, ensuring adherence to best practices for secure coding and data protection.\nParticipated in code reviews and paired programming sessions, fostering a culture of clean code and shared knowledge within the engineering team.\nLed the integration of third-party APIs for payment processing and other services, successfully reducing transaction failure rates by **15%** through improved error handling and user feedback mechanisms."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, Java Spring Boot\n\n **Frontend Frameworks:**\n\tReact, Angular (1–16), Next.js, Vue.js (2/3), Blazor, HTML, CSS\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Jenkins, SonarQube\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Nginx, Certbot\n\n **Other:**\n\tPydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Agile, Microservices, Responsive Design, Clean Code, Design Patterns, Unit Testing"
}