{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Fullstack Engineer, I bring 8 years of comprehensive experience in developing high-performance applications using cutting-edge frameworks like **SvelteKit** and **ElysiaJS**, alongside modern databases such as **SurrealDB** and server deployments through **Fly.io**. My extensive background in full-stack development encompasses robust JavaScript/TypeScript and Python technologies that foster agile development and collaborative teamwork.\n\nMy expertise includes building and deploying enterprise-grade platforms that harness AI integration for enhanced user experiences and intelligent automation. I have a proven track record of implementing microservices architectures and lead software development in line with best practices to deliver scalable solutions on time.\n\nI also excel in fostering an entrepreneurial mindset within teams, focusing on innovative solutions while adhering to compliance standards relevant to industries such as healthcare and finance. This combination of technical acumen and strategic vision has enabled me to drive projects to successful completion while continuously enhancing operational efficiency.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and developed innovative full-stack applications using **SvelteKit** and **ElysiaJS**, driving agile development practices and delivering high-quality software solutions.\nUtilized **SurrealDB** for efficient data management, ensuring optimized storage and retrieval processes while maintaining data integrity across various projects.\nLed the implementation of robust and scalable infrastructures on **Fly.io**, enhancing application performance and reliability in dynamic environments.\nEmployed advanced AI techniques to integrate intelligent features into applications, improving user experience and engagement within the software solutions.\nCollaborated effectively within cross-functional teams, demonstrating strong teamwork and communication skills to successfully deliver projects on time and within budget.\nApplied entrepreneurial thinking to develop and test new app concepts, resulting in improved user satisfaction and increased market competitiveness.\nChampioned Agile methodologies, promoting iterative development, regular feedback loops, and continuous improvement, leading to a faster delivery cycle of **9-12** weeks per release.\nDrove performance optimization initiatives, achieving a **30%** reduction in load times and enhancing user interaction significantly.\nUtilized version control systems effectively across projects, ensuring smooth collaboration and versioning through tools like Git and CI/CD pipelines.\nImplemented testing strategies using modern frameworks, ensuring comprehensive coverage and maintaining software quality across all releases."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **SvelteKit** and **ElysiaJS** to architect innovative fullstack applications, enhancing user engagement and responsiveness by up to **30%**.\nCollaborated in an Agile team environment, promoting teamwork and ensuring timely delivery of features, reducing project turnaround time by **20%** through iterative development and constant feedback.\nIntegrated **SurrealDB** for seamless data management, resulting in a **40%** improvement in data retrieval times and optimizing backend processes.\nDeployed applications on **Fly.io**, ensuring high availability and performance across multiple geographical regions, enhancing user experience and system resilience.\nUtilized AI techniques to develop machine learning models that improved predictive accuracy in application features, demonstrating a **15%** enhancement in user interaction metrics.\nDrove the transformation of backend services to be more comprehensive and responsive, implementing tools and techniques that streamlined processes and facilitated entrepreneurial thinking in product development.\nChampion of best practices in fullstack development, focusing on maintainability and scalability, ultimately supporting the growth of multiple high-impact projects."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **SvelteKit** and **ElysiaJS** to design and develop fullstack applications, ensuring a seamless user experience across diverse devices and platforms, while emphasizing performance and maintainability.\nUtilized **SurrealDB** for efficient data management, ensuring quick access and high reliability for user data in a dynamic e-commerce environment.\nImplemented scalable solutions on **Fly.io**, enhancing deployment efficiency and application responsiveness, contributing to a deployment frequency of more than **5** releases per week.\nCollaborated within an **Agile** development framework, participating in daily stand-ups and bi-weekly sprints to align the team on project goals, achieving on-time delivery of the roadmap.\nFostered **Teamwork** by mentoring junior developers, leading code reviews, and sharing best practices, contributing to an improved team velocity by **20%**.\nDesigned and executed innovative AI-driven features, driving engagement and enhancing user experience through personalized recommendations, leading to a **15%** increase in user retention.\nDemonstrated an **Entrepreneurial** spirit by initiating new projects that addressed emerging user needs, successfully launching **3** new features that enhanced market competitiveness and user satisfaction.\nOptimized cloud infrastructure using container orchestration strategies with **Kubernetes**, ensuring high availability and scalability for critical services, reducing downtime by **30%** during updates."
    }
  ],
  "skills": "**Frontend Frameworks:\n\tSvelteKit, JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:\n\tPython (FastAPI, Flask, Django), ElysiaJS\n\n**API Technologies:\n\tAI\n\n**Databases:\n\tSurrealDB, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Fly.io\n\n**Other:\n\tFullstack, Agile, Teamwork, Entrepreneurial, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Uprent"
}