{
  "name": "Rei Taro",
  "role_name": "Senior Java Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Java Engineer with over 10 years of experience specializing in **Java**, **JVM**, **Concurrency**, and **Distributed Systems**. Proficient in **Performance Engineering** and adept in optimizing **Multi-threaded Systems** and efficient **Garbage Collection** techniques. Skilled in **Caching**, **Indexing**, and enhancing **I/O Behavior** to build scalable and high-performance backend systems. Experienced with **Observability Tools** including **JFR** and **Async-profiler** to ensure system reliability. Proven track record of impactful contributions at prominent organizations such as VISA, Sii Poland, and Reply Polska. Also well-versed in **cloud-native architectures** and familiar with **Python** (FastAPI, Django, Flask) and **cloud platforms** like **AWS** and **Azure**, which enhances the development of complex backend solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered high-performance applications in **Java** utilizing **JVM** optimizations and **Concurrency** strategies for robust backend service functionality.\nDeveloped and implemented **Distributed Systems** to streamline document automation and user onboarding processes, enhancing performance metrics by **30%**.\nLed **Performance Engineering** initiatives focusing on critical **Garbage Collection** techniques to reduce latency in multi-threaded environments by **25%**.\nManaged **Caching** strategies and improved **I/O Behavior** for financial transaction requests, resulting in a **40%** increase in efficiency.\nUtilized observability tools such as **JFR** and **Async-profiler** to enhance system monitoring and diagnose performance bottlenecks effectively.\nContributed to **open-source contributions** promoting collaborative development and improved community resources for Java developers.\nCollaborated with cross-functional teams to address system integration challenges and ensure efficient release strategies, delivering projects on time and within budget."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Designed and developed high-performance backend systems utilizing **Java** with a focus on **Concurrency** and **Distributed Systems** methodologies to achieve scalability and efficiency in document workflows and user onboarding processes.\nImplemented multi-threaded systems to optimize backend processes and enhance system performance, demonstrating expertise in **Performance Engineering** and effective **Garbage Collection** strategies.\nDeveloped and maintained caching mechanisms and indexing strategies to improve data retrieval times by up to **75%**, leveraging a deep understanding of **Storage Internals**.\nCreated observability metrics using tools like **JFR** and **Async-profiler** to analyze and improve I/O behavior and system performance metrics, enhancing overall system reliability.\nDrove the integration of open-source contributions to further enhance system capabilities and foster community engagement, reflecting commitment to innovative solutions.\nCollaborated with cross-functional teams to ensure seamless integration of applications and adherence to industry standards, facilitating successful release management within a **6-week** cycle."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Leveraged **Java** and **JVM** to develop high-performance backend services focusing on concurrency and distributed systems for trade execution and account tracking.\nUtilized performance engineering techniques to enhance the efficiency of multi-threaded systems and I/O behavior in applications processing large datasets.\nEngineered caching and indexing strategies to optimize data retrieval, resulting in a **30%** performance improvement in data access times.\nImplemented observability tools such as **JFR** and **Async-profiler** to monitor application performance and diagnostics, improving overall system visibility by **25%**.\nCollaborated effectively with cross-functional teams to ensure smooth integration of backend services with frontend interfaces through REST APIs, facilitating real-time data updates.\nConducted thorough testing and optimization of codebase, focusing on garbage collection and performance metrics to maintain an uptime of **99.9%** in production environments.\nParticipated in open-source contributions to enhance community tools and libraries used within the organization, promoting knowledge sharing and best practices among development teams."
    }
  ],
  "skills": "  **Programming Languages**\n\t Java, Python (3.8+), SQL, Bash, JavaScript\n\n  **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\t \n\n  **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n  **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n  **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n  **Cloud & Infrastructure**\n\t \n\n  **Other**\n\t JVM, Concurrency, Distributed Systems, Performance Engineering, Garbage Collection, Multi-threaded Systems, Storage Internals, Caching, Indexing, I/O Behavior, Observability Tools, JFR, Async-profiler, Open-source Contributions, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka",
  "apply_company": "Hazelcast"
}