{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior ML Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior ML Engineer with 10+ years of experience specializing in **Natural Language Processing**, **Machine Learning**, and **Deep Learning** solutions. Proficient in leveraging **Python**, **PyTorch**, and **Hugging Face Transformers** to develop advanced algorithms and data pipelines capable of real-time inference. Adept at building and deploying sophisticated models, managing production workflows, and ensuring robust data processing using tools like **MLflow** and **Airflow**. Extensive background in designing and implementing **AI/ML** capabilities across enterprise-level applications, with a strong emphasis on compliance and security standards such as HIPAA and PCI DSS.\n Experienced full stack developer with hands-on expertise in a variety of technologies including **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Successful track record in cloud-native application deployment on **Azure** and **AWS** and proficient in microservices architecture and CI/CD automation. Committed to building impactful systems that deliver real-world results.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented machine learning models for healthcare applications, focusing on use cases such as patient risk prediction and financial fraud detection using **Python**, **PyTorch**, and **Hugging Face Transformers**.\n• Developed data pipelines and inference engines to facilitate real-time model serving and integration for applications, ensuring efficient processing and deployment.\n• Led the integration of Natural Language Processing (NLP) models, utilizing **spaCy** and **Hugging Face Transformers** for healthcare document parsing and financial anomaly detection across systems.\n• Built and maintained robust ML pipelines using MLflow for model versioning and continuous training, ensuring high-quality model outputs and streamlined workflows across environments.\n• Collaborated with cross-functional teams to integrate AI-driven features into products, such as smart analytics dashboards and predictive alerts, harnessing the capabilities of advanced **deep learning** algorithms and tools.\n• Worked extensively with Linux environments to deploy machine learning models, ensuring high-performance and reliable operations at scale.\n• Optimized existing algorithms and models to enhance performance, achieving improvements of up to **25%** in prediction accuracy and reducing inference time by **15%**.\n• Assisted in establishing best practices for maintaining code quality and model performance, promoting the adoption of efficient coding standards and technologies across the team.\n• Conducted thorough testing and evaluation of models and libraries using frameworks such as **PyTest** and integrated them with RESTful APIs to ensure seamless application functionality.\n• Continuously researched and implemented the latest advancements in machine learning and deep learning, staying updated with trends that influence the field."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed and deployed Machine Learning models leveraging **Python** and **PyTorch** for tasks in Natural Language Processing, enhancing processing efficiency by **30%** over traditional methods.\n• Created robust Data Pipelines using **Apache Airflow** and **Linux** environments to automate the data flow, ensuring data integrity and minimizing latency in machine learning processes, achieving a **40%** increase in data processing speed.\n• Designed and implemented inference engines for real-time predictions, integrating algorithms that drove improvements in accuracy by **15%** across various ML applications.\n• Leveraged **Hugging Face Transformers** for advanced NLP tasks, optimizing model performance for text classification and sentiment analysis while significantly reducing processing time by **25%**.\n• Collaborated in a cross-functional team to create scalable ML solutions, focusing on code quality, version control practices, and efficient deployment strategies.\n• Conducted thorough evaluations of deep learning models, employing techniques to refine algorithms and improve results before production rollout, ultimately enhancing the user experience.\n• Developed comprehensive documentation and training materials for team members on ML strategies and best practices, fostering knowledge sharing and professional development."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and implemented advanced **Natural Language Processing** (NLP) algorithms using **Python** with **PyTorch** and **Hugging Face Transformers**, driving improvements in text understanding and data analysis across projects.\nEngineered scalable and efficient **Machine Learning** pipelines, handling datasets over **100GB** in size and optimizing model inference times by over **30%** through careful tuning and data preprocessing.\nCreated and maintained robust data pipelines integrated with cloud services, ensuring automated data collection and feature extraction, enabling real-time analytics for system improvements.\nDesigned and executed deep learning models for various applications, achieving accuracy rates over **95%** on validation datasets through continuous model updates and hyperparameter tuning.\nCollaborated closely with cross-functional teams to integrate **Machine Learning** solutions into existing systems, enhancing overall product functionality and user experience.\nUtilized **Linux** environments for model deployment, ensuring high-performance computing resources and managing dependencies effectively, reducing downtime to **minimal levels**.\nResearched and implemented new algorithms and models to improve prediction accuracy and processing efficiency, staying up-to-date with the latest industry trends and advancements in **Machine Learning**.\nLed training workshops and presentations on **Machine Learning** techniques and best practices, fostering a culture of innovation and continuous learning within the team."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMachine Learning, Deep Learning, Natural Language Processing, PyTorch, Hugging Face Transformers, Data Pipelines, Inference Engines, Algorithms, Linux",
  "apply_company": "Accuris"
}