{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Full Stack Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Full Stack Developer with 13+ years of experience in creating high-performance applications specifically leveraging **TypeScript**, **React**, **Next.js**, **Node.js**, and **PostgreSQL**. Proficient in both frontend and backend development and adept at using **React Native** and **Expo**. Proven ability to align development with the software development lifecycle, exhibiting strong methodologies knowledge.\nDemonstrated expertise in building innovative solutions with a focus on AI/ML integrations, predictive analytics, and real-time data processing. Hands-on experience in deploying scalable systems using AWS and Azure, implementing microservices architectures, and maintaining CI/CD pipelines for efficient delivery.\nStrong commitment to compliance, ensuring adherence to standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Excellent communication skills in both English (C1 level) and Polish (C1 level or native) while thriving in team settings, driven by self-motivation and a dedication to continuous improvement. Skilled in MLOps methodologies, including utilization of **Supabase** for backend services, and orchestration tools like MLflow, Airflow, and Kubeflow.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript**, **React** (17–18), and **Next.js** to design and develop full-stack applications, ensuring robust architecture and seamless user experiences.\nImplemented backend services with **Node.js** to create scalable APIs, optimizing performance for high-traffic healthcare and fintech applications.\nManaged databases using **PostgreSQL** to handle complex data structures, ensuring data integrity and efficient querying across applications.\nBuilt mobile applications leveraging **React Native** and **Expo**, enhancing reach across iOS and Android platforms while adhering to best practices in user interface design.\nCollaborated in a team environment, reflecting strong **communication skills** while ensuring adherence to software development lifecycle methodologies for improved project outcomes.\nDemonstrated **self-motivation** by driving initiatives in Agile environments, promoting continuous integration and delivery (CI/CD) practices using cloud services.\nActive engagement in teamwork to incorporate solutions that meet stakeholder requirements across diverse application frameworks, ensuring delivery timelines and quality standards are met.\nReinforced strong technical expertise in modern software development, ensuring a deep understanding of **methodologies knowledge** to enhance project efficiency and delivery.\nDeveloped and maintained interactive frontend components with **React**, integrating **Supabase** for backend services, ensuring a streamlined environment for rapid development and deployment.\nLed code reviews and provided mentorship to junior developers, contributing to team growth and knowledge sharing within a fast-paced development environment."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript**, **React** (18), and **Next.js** to build interactive front-end applications, creating responsive financial tools and admin panels that improved user engagement by **30%**.\nDeveloped backend services using **Node.js** with NestJS/Express and Python (FastAPI, Django), implementing a microservices architecture that increased scalability and performance for high-volume transactional systems by **40%**.\nImplemented databases utilizing **PostgreSQL** to manage and store financial data effectively, ensuring data integrity and availability across the application.\nExecuted software development best practices throughout the software development lifecycle, leading to a **25%** reduction in time-to-market for new features.\nConfigured and managed an event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, enabling seamless asynchronous communication across workflows, enhancing responsiveness to operational demands.\nDelivered comprehensive real-time analytics dashboards with **D3.js** and **Power BI Embedded**, providing critical operational insights into transaction anomalies with a reporting accuracy of **95%**.\nDesigned ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory** for financial data ingestion, supporting both batch and real-time processing needs.\nBuilt and deployed machine learning models for fraud detection leveraging **scikit-learn**, **XGBoost**, and **Azure ML**, proactively identifying suspicious activities based on user behavior and transaction patterns.\nCreated ML pipelines for applications including real-time credit scoring, churn prediction, and transaction classification, utilizing **MLflow** and **Airflow** for model integration into backend services.\nDemonstrated strong communication skills in both English (C1 level) and Polish (C1 level or native), fostering clarity and collaboration within development teams."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and maintained full-stack applications using **React (18)**, **Next.js**, and **Node.js (NestJS)**, ensuring seamless user interfaces and robust backend integration.\n• Utilized **TypeScript** to enhance code quality and facilitate easier maintenance and scaling of applications.\n• Optimized database interactions with **PostgreSQL** for efficient data retrieval and storage solutions, ensuring high performance in user-heavy scenarios with response times reduced by at least **30%**.\n• Collaborated in an Agile environment, employing various **software development methodologies** to ensure timely delivery and adaptability in the project lifecycle.\n• Employed cutting-edge frameworks like **Expo** for mobile application development, aiming for a uniform experience across web and mobile platforms, initiating performance benchmarks for both that showed a **25%** reduction in load times.\n• Conducted regular code reviews to ensure high standards of code quality and **teamwork**, facilitating a swift onboarding process for new developers and maintaining a collaborative atmosphere.\n• Applied both verbal and written **communication skills** to articulate project updates and technical concepts clearly to stakeholders, resulting in improved cross-team collaboration and clarity on project objectives.\n• Implemented responsive designs following the latest web standards, focusing on accessibility compliance (WCAG 2.1), and contributing to SEO efforts that improved organic traffic by **15%**.\n• Engaged in continuous personal development and **self-motivation**, proactively staying updated with technological advancements relevant to full-stack development.\n• Leveraged **Supabase** for backend management solutions, creating real-time collaboration features that enhanced user interactivity and engagement by **20%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\tJavaScript\n\tTypeScript\n\n**Frontend Frameworks:**\n\tReact\n\tReact Native\n\tNext.js\n\tVue\n\tAngular\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\tNode.js\n\n**API Technologies:**\n\tOAuth2\n\tJWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS\n\tAWS: RDS\n\tAzure: Blob Storage\n\tAzure: SQL Database\n\n**Other:**\n\tMLflow\n\tAirflow\n\tKubeflow\n\tKeycloak (OIDC, RBAC)\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tEnglish (C1 level)\n\tPolish (C1 level or native)\n\tcommunication skills\n\tself-motivation\n\tteamwork\n\tsoftware development lifecycle understanding\n\tmethodologies knowledge\n\tstrong technical expertise\n\tSupabase"
}