{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Frontend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Detail-oriented Senior Frontend Engineer with over 10 years of experience in crafting high-performance web applications using **React**, **Next.js**, **JavaScript**, and **TypeScript**. Proven expertise in developing responsive user interfaces that prioritize accessibility and usability, ensuring a seamless product experience. Adept at working with APIs and proficient in utilizing tools such as **Postman** for testing and integration. Recognized for strong product thinking and meticulous attention to design details, driving impactful solutions that align with user needs.\nPossesses a solid foundation in full stack development, having implemented applications with **Flutter**, **Node.js**, **FastAPI**, and **Django**. Demonstrated capability in cloud application deployment on **Azure** and **AWS**, and experience with microservices architecture and event-driven systems. Committed to continuous improvement and innovation, leveraging CI/CD automation techniques to enhance development workflows.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped responsive user interfaces utilizing **React** (17–18) and **Next.js**, ensuring web applications are accessible and provide an optimal user experience across various devices.\n•\tCollaborated on designing and implementing APIs to facilitate seamless communication between frontend applications and backend services, leveraging **TypeScript** and **JavaScript** for enhanced type safety and maintainability.\n•\tConducted comprehensive usability testing and analysis using **Postman**, resulting in improved application accessibility and user satisfaction scores.\n•\tApplied product thinking principles to influence the design details of user interfaces, ensuring alignment with project goals and user needs.\n•\tImplemented best practices in responsive UI design, enhancing mobile compatibility and adherence to modern standards.\n•\tLed initiatives to enhance the overall usability of applications, contributing to a 30% increase in user engagement metrics over **6 months**.\n•\tSpearheaded efforts for optimizing performance across all responsive interfaces, achieving load time reductions of up to **50%**.\n•\tEngaged in cross-department collaboration, aiding in responsive UI designs that meet business objectives while focusing on user satisfaction.\n•\tReviewed and refined code for consistency with UI best practices and accessibility standards, fostering a commitment to quality within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused front-end applications utilizing **React (18)** and **Next.js**, ensuring high standards of **accessibility** and **usability** in UI design for financial dashboards and admin portals.\n• Employed **JavaScript** and **TypeScript** for building responsive interfaces, resulting in a 30% increase in application performance and user engagement.\n• Integrated RESTful **APIs** to streamline communication between front-end applications and back-end services, enhancing data flow and user experience.\n• Led the implementation of product thinking principles in the design details of user interfaces, achieving a **40% reduction** in user-reported issues and improving overall product satisfaction.\n• Utilized **Postman** for efficient API testing, ensuring reliable connections and enhancing development workflow.\n• Focused on creating responsive UI components that are optimized for various devices, increasing mobile user adoption by **25%**.\n• Collaborated across teams to maintain a well-documented design system, enhancing code reusability and reducing development time by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and maintained responsive user interfaces using **React (18)** and **Next.js**, ensuring compliance with usability and accessibility standards (WCAG 2.1) for high-quality user engagement.\nOptimized web applications through the integration of **TypeScript**, enhancing code quality and maintainability while delivering a seamless experience across devices.\nCollaborated with backend teams to design robust APIs facilitating smooth data exchange, leveraging tools like **Postman** for efficient API testing and documentation.\nImplemented responsive designs that adapt to various screen sizes, ensuring a mobile-first approach to UI/UX.\nCreated and executed user-centered design strategies, focusing on product thinking and design details to enhance overall usability and user satisfaction.\nConducted thorough testing and quality assurance on UI components, resulting in a **40%** reduction in reported user interface issues.\nParticipated in cross-functional teams to align development efforts with business goals, pushing iterative improvements based on user feedback, resulting in a **15%** increase in user engagement metrics over **6 months**.\nMaintained awareness of industry trends and best practices to continuously improve the development process and technology stack used in the frontend development.\n"
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Next.js\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**API Technologies:**\n\tAPI, HTTP, Postman\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, responsive UI, accessibility, usability, product thinking, design details",
  "apply_company": "DualEntry"
}