{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Frontend Engineer leveraging my 8 years of experience, I possess a comprehensive skill set in **React**, **Next.js**, **TypeScript**, **JavaScript**, **HTML**, **CSS**, **Sass**, and **CSS Modules**. I am adept at creating high-performance, user-centric applications and have a strong proficiency in modern front-end frameworks, ensuring designs are responsive and visually appealing. My background also includes familiarity with tools like **Shopify**, **Shopify Liquid**, **Remix**, **Oxygen**, **Vercel**, and **Cloudflare**, enhancing my capability to develop dynamic web solutions. In my career, I've prioritized communication and collaboration, utilizing platforms such as **Jira**, **Notion**, and **Loom** to drive projects forward effectively.\n\nAdditionally, I bring a robust foundation in building solutions for sectors such as healthcare and finance, underpinned by an understanding of compliance standards like HIPAA and PCI DSS. My approach integrates thoughtful design awareness while aligning technical execution with business goals, ensuring that every application I build not only meets user needs but also achieves strategic objectives.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed engaging user interfaces for healthcare and financial platforms using **React** (17-18), **Next.js**, and **TypeScript**, ensuring high performance and responsiveness.\n• Utilized modern styling solutions such as **CSS Modules**, **Sass**, and **Stitches** to create visually appealing and accessible designs.\n• Collaborated with cross-functional teams through **Jira**, **Notion**, and **Loom** to ensure clear communication and efficient project management throughout the development lifecycle.\n• Integrated with APIs and third-party services such as **Shopify**, employing **Shopify Liquid** for e-commerce functionalities and enhancing user experience on platform.\n• Focused on design-awareness principles, creating intuitive and user-friendly interfaces that prioritize user experience and accessibility standards.\n• Contributed to the implementation of CI/CD pipelines using **Vercel** and **Cloudflare**, optimizing deployment processes and monitoring application performance.\n• Engaged in regular code reviews and pair programming sessions to enhance code quality and foster a culture of learning and improvement among team members.\n• Led initiatives to optimize web applications for scalability and performance, leveraging strategies such as lazy loading and code splitting.\n• Generated responsive layouts and interactive components adhering to W3C standards, ensuring compatibility across diverse devices and browsers.\n• Implemented best practices in communication with stakeholders, successfully translating technical requirements into actionable development tasks."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed highly dynamic and user-centric front-end applications utilizing **React (18)**, **Next.js**, and **TypeScript** to enhance the user experience for financial platforms.\nImplemented responsive and efficient user interfaces by applying **CSS**, **Sass**, and **CSS Modules**, focusing on design-awareness and performance optimization.\nCollaborated effectively using tools like **Jira** and **Notion** to ensure seamless communication and project tracking within an agile environment.\nUtilized **Vanilla extract** and **Tailwind CSS** to build modular and maintainable styles, improving overall application aesthetics and usability.\nCreated and maintained interactive dashboards with **D3.js** and integrated visualizations using **Power BI Embedded**, streamlining data presentation for stakeholders.\nWorked closely with product teams to align front-end deliverables with business goals, enhancing the literacy of users regarding financial data.\nLed code reviews and shared best practices, improving team efficiency and promoting a culture of knowledge-sharing.\nLeveraged **Cloudflare** and **Oxygen** for enhancing site performance and security, ensuring optimal load times and user satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized dynamic user interfaces for a global e-commerce platform using **React (18)** and **Next.js**, ensuring high performance and responsiveness in alignment with industry best practices.\nUtilized **TypeScript**, **JavaScript**, **HTML5**, and **CSS3** to create modular components, enhancing maintainability and code quality across multiple projects.\nImplemented modern styling techniques using **Sass**, **CSS Modules**, and **Stitches** to elevate the user experience and ensure consistent design throughout the application.\nCollaborated with cross-functional teams leveraging **Jira** and **Notion** for project management, fostering clear communication and enhancing team's design-awareness in frontend development.\nIntegrated third-party tools such as **Cloudflare** for improved load times and **Vercel** for streamlined deployment processes, achieving deployment speeds reduced by **30%**.\nCreated and maintained high-quality documentation using **Loom** to facilitate onboarding and knowledge sharing within the team, improving team efficiency by **25%**.\nIncorporated design systems and accessibility standards (WCAG 2.1) into frontend architecture, ensuring a seamless and inclusive user experience for diverse audiences.\nEngaged with the product team to implement AI/ML-driven features with tools like **ChatGPT**, elevating user interaction and engagement on the platform.\nConducted A/B testing and feature iteration processes with controlled rollouts using platforms like **Shopify** and **Shopify Liquid**, enabling data-driven development that resulted in a **15%** increase in conversion rates."
    }
  ],
  "skills": " **Frontend Frameworks:**\n\tReact, Next.js, JavaScript, TypeScript, HTML, CSS, Sass, CSS Modules, Stitches, Vanilla extract, Remix, Oxygen, Vercel, Cloudflare\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Jira, Notion, Loom, Design-awareness, Communication",
  "apply_company": "Commerce-UI"
}