{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 8 years of experience in full-stack development specializing in **Angular**, **React**, **JavaScript**, and **TypeScript**. Proficient in cloud services including **AWS** and container orchestration using **Kubernetes**. Experienced in Agile methodologies and DevOps practices, leveraging CI/CD pipelines such as **GitLab CI** for seamless software delivery. Strong focus on developing microservices and event-driven architectures, ensuring robust and scalable solutions.\n\nI have a proven track record in building compliant applications adhering to standards such as HIPAA and PCI DSS. Additionally, I possess solid communication and collaboration skills, enabling me to work effectively within cross-functional teams. My background in building enterprise-grade solutions and integrating advanced technologies ensures that I can deliver high-performance applications that meet business objectives.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** and **Angular** frameworks to architect and develop responsive user interfaces for scalable applications, ensuring high performance across environments.\nLeveraged **TypeScript** and **JavaScript** for type-safe coding practices, improving maintainability and reducing runtime errors in frontend applications.\nCollaborated in an **Agile** environment, participating in daily stand-ups, sprint planning, and retrospectives to drive project efficiency and stakeholder communication.\nImplemented **DevOps** practices utilizing **GitLab CI** to automate testing, deployment, and monitoring processes, achieving a **30%** reduction in release times.\nAdopted **microservices** architecture principles to facilitate seamless integration between frontend and backend services, enhancing application scalability and resilience.\nIntegrated advanced search features using **Elasticsearch** to enhance data retrieval across various datasets, improving query performance by **50%**.\nDesigned and enforced **SOLID** principles in application architecture, promoting best practices in software design and maintainability for future development teams.\nConducted thorough documentation and communication of technical specifications to ensure alignment across teams, fostering effective collaboration.\nParticipated in code reviews and mentoring junior developers, enhancing team skill sets and improving overall code quality by maintaining a **95%** code coverage rate.\nUtilized **Kubernetes** for orchestrating containerized applications, ensuring high availability and load balancing across cloud environments.\nEngaged in event-driven architecture implementations to enhance application responsiveness and modularity, reducing coupling in application components.\nContributed to multi-environment deployments using CI/CD methodologies, streamlining the release process and minimizing downtime during production updates.\nDelivered high-quality, interactive components tailored for user needs, leveraging effective collaboration with designers and product owners to align with business goals."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed dynamic, user-focused front-end applications leveraging **React (18)**, **Angular**, and **TypeScript**, applying modern libraries such as **Redux Toolkit** and **Tailwind CSS** to create responsive and performant user interfaces for financial dashboards and admin portals, improving user experience by **30%**.\n- Spearheaded the implementation of a **microservices** architecture for financial platforms utilizing **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, which enhanced scalability and throughput for high-volume transaction systems by **50%**.\n- Collaborated in the design and creation of real-time transaction monitoring dashboards using **D3.js**, significantly reducing operational anomalies by **40%** and boosting response time for alert generation.\n- Integrated an **event-driven** architecture employing **Kafka**, **RabbitMQ**, and **Azure Service Bus** to facilitate asynchronous communication and real-time event processing, enhancing transaction reliability.\n- Built and orchestrated **ETL** pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory**, optimizing batch and real-time ingestion of financial data from internal APIs and third-party sources.\n- Implemented **AI/ML-powered** fraud detection models using **scikit-learn**, and **XGBoost**, increasing fraud detection rate by **25%** while analyzing transaction patterns for proactive risk management.\n- Developed **ML pipelines** for credit scoring and churn prediction utilizing **MLflow** and **Airflow**, seamlessly integrating model inference into backend services for efficient real-time decision-making.\n- Championed **Agile** methodologies and **DevOps** practices within the team, ensuring continuous integration and delivery which resulted in a **20%** decrease in deployment times."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed highly interactive frontend applications using **React (18)**, **Angular**, and **TypeScript**, ensuring optimal performance and seamless user experience across diverse web platforms.\nCollaborated within an **Agile** environment to implement micro-frontend architectures, enhancing team productivity and ensuring consistent application scaling and maintenance.\nUtilized version control with **GitLab CI** to streamline deployment processes and facilitate collaboration among cross-functional teams.\nDesigned user interfaces compliant with WCAG 2.1 for accessibility, integrating modern technologies like **HTML5/CSS3** and responsive designs for mobile-first engagement.\nEngaged in effective communication and collaboration with backend teams to create cohesive, high-performance applications based on a microservices architecture utilizing technologies like **Spring Boot** and **Kubernetes**.\nIntegrated with various cloud services, including **AWS**, to leverage scalable solutions for application deployment and management.\nImplemented best practices adhering to the **SOLID** principles to maintain code quality and facilitate future growth and changes in backend systems.\nHarnessed event-driven architecture concepts using tools like **Kafka** to create dynamic integrations, improving application responsiveness and real-time interactions.\nContributed to system design discussions to optimize service performance within a distributed system context, incorporating **MongoDB** and other databases for efficient data handling.\nDeveloped modular components using **microservices** for improved code reusability and scalability of applications, ensuring faster delivery cycles and enhanced user satisfaction."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, JavaScript, TypeScript, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular, React\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Oracle, DynamoDB\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, S3), Azure (App Services, Blob)\n\n**Other:**\n\tAgile, SOLID, microservices, event-driven, micro-frontend, Elasticsearch, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, communication, collaboration",
  "apply_company": "Ticketmaster"
}