{
  "name": "Andrzej Ito",
  "role_name": "Senior Software Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Software Engineer with over 9 years of experience, I specialize in **.NET**, **IBM OpenText Capture**, **Kofax Capture**, **ABBYY FlexiCapture**, **Agile**, **DevOps**, and **CI/CD**. I excel in process optimization and document processing, having successfully led cross-functional teams to deliver impactful projects. My strong analytical skills and effective communication enhance collaboration while enabling me to mentor junior engineers and prioritize user experience, performance, and innovation. I am committed to driving technical excellence and enhancing accessibility in every project.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2022",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Collaborated in an **Agile** environment to enhance software development processes and deliver high-quality solutions.\n• Implemented **CI/CD** pipelines for efficient integration and deployment, ensuring streamlined updates across **.NET** applications.\n• Designed and optimized document processing workflows using **IBM OpenText Capture**, **Kofax Capture**, and **ABBYY FlexiCapture** for effective input management.\n• Led automation initiatives for previous versions of document processing solutions to achieve a **30%** increase in productivity and reduce processing time by **25%**.\n• Conducted thorough analysis and optimization of existing processes, resulting in an overall **15%** reduction in operational costs.\n• Maintained clear communication across teams, demonstrating strong communication skills essential for successful project execution.\n• Utilized **DevOps** practices to monitor application performance and enhance system reliability across various stages of development.\n• Applied advanced **analytical skills** to troubleshoot and resolve complex issues in software delivery and performance.\n• Engaged with stakeholders to understand requirements, translating them into actionable development tasks that adhered to project timelines."
    },
    {
      "role": "Software Engineer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2022",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed and optimized document processing solutions using **IBM OpenText Capture**, **Kofax Capture**, and **ABBYY FlexiCapture**, resulting in a **30%** reduction in processing time.\n• Implemented CI/CD practices to streamline deployment processes, achieving a **40%** improvement in release times.\n• Led Agile methodology in project management, facilitating efficient communication and collaboration within cross-functional teams.\n• Designed and executed input management strategies to enhance data accuracy and processing efficiency by **25%**.\n• Applied strong analytical skills to troubleshoot and resolve technical issues, improving system reliability across document processing workflows.\n• Engaged in process optimization initiatives, leading to reduced operational costs and improved productivity.\n• Collaborated effectively with team members, leveraging strong communication abilities to convey complex technical concepts to non-technical stakeholders.\n• Employed DevOps best practices to enhance system scalability and performance, deploying solutions across various environments."
    },
    {
      "role": "Software Engineer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed and optimized web applications using **.NET** technologies to facilitate **Process Optimization** and improve **Document Processing** efficiency.\n• Collaborated with cross-functional teams within an **Agile** framework to ensure timely delivery of projects, employing **CI/CD** practices for streamlined deployments.\n• Leveraged **IBM OpenText Capture** and **Kofax Capture** for effective **Input Management**, enhancing document workflows and accuracy by **30%**.\n• Utilized **ABBYY FlexiCapture** to automate data extraction from various input formats, reducing manual effort by **50%** and improving data quality.\n• Communicated technical information effectively to stakeholders, ensuring alignment with business objectives and fostering transparent cross-team collaboration.\n• Analyzed process workflows to identify areas for improvement, implementing solutions that led to a **25%** reduction in processing time.\n• Applied **DevOps** methodologies to enhance development efficiency and reliability, resulting in a **15%** improvement in deployment frequency.\n• Maintained proficiency in various tools and technologies such as **Bower**, **NPM**, **Git**, and cloud platforms including **AWS**, **Azure**, and **GCP**."
    }
  ],
  "skills": " **Programming Languages** \n\t Java, C++, C#, Python, SQL, PLSQL, Kotlin \n\n **Backend Frameworks** \n\t Spring, Spring Boot, Hibernate, Struts, JPA, .NET \n\n **Frontend Frameworks** \n\t React, Vue, Angular \n\n **API Technologies** \n\t SOAP, REST APIs, Microservices \n\n **Serverless and Cloud Functions** \n\t  \n\n **Databases** \n\t MS SQL Server, Oracle, MongoDB, PostgreSQL, Redis \n\n **DevOps** \n\t DevOps, CI/CD, Agile \n\n **Cloud & Infrastructure** \n\t  \n\n **Other** \n\t Rabbit MQ, Process Optimization, Document Processing, Input Management, Communication, Analytical Skills, SOLID, DRY, LINQ",
  "apply_company": "LITIT"
}