{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior GTM Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior GTM Engineer with 13+ years of experience in delivering high-performance applications, specializing in data-driven solutions and process improvement across healthcare and financial industries. Adept at leveraging **Python**, **JavaScript**, and APIs to build robust applications, with proven problem-solving skills and experience in integrating with critical tools like **Salesforce**, **HubSpot**, and **Common Room**.\n\nSkilled in using **Make** for workflow automation and proficient in database management with **SQL** to analyze and derive actionable insights. Background in developing and deploying cloud-native systems on **AWS** and **Azure**, implementing microservices architectures, and optimizing operations through CI/CD pipelines. \n\nAlso experienced in building AI/ML-powered platforms utilizing tools such as **MLflow**, **Airflow**, and **Kubeflow** for model training and deployment, ensuring compliance with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior GTM Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **JavaScript** to develop and optimize go-to-market (GTM) strategies, leveraging modern web technologies and **APIs** for seamless integration across platforms.\nExecuted process improvement initiatives that enhanced data-driven decision-making, resulting in a **25%** increase in conversion rates.\nEnhanced customer relationship management by integrating **Salesforce** and **HubSpot**, streamlining workflows and tracking interactions to improve client engagement by **30%**.\nAnalyzed market trends and customer feedback using **SQL** and data visualization tools, driving strategic adjustments and improvements to GTM campaigns.\nImplemented solutions for automating outreach processes using **Lemlist** and **Instantly**, which improved lead response times by **40%**.\nCollaborated with cross-functional teams to design and execute GTM initiatives that align with product launches, utilizing **Common Room** for community insights and engagement.\nConducted regular performance assessments and applied problem-solving techniques to resolve bottlenecks and optimize campaigns for better efficacy.\nFacilitated training sessions and workshops to build data competency within teams, ensuring adoption of analytical tools and methodologies for ongoing process improvement.\nDeveloped and maintained documentation and reporting templates to support continuous improvement in GTM operations, promoting transparency and accountability across teams.\nLeveraged **Clay** to optimize lead generation strategies, resulting in a **15%** uplift in qualified leads through advanced targeting and personalization tactics."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **APIs** and **Python** to develop data-driven solutions that enhance **GTM** strategies, ensuring streamlined processes and improved user experience.\nImplemented **SQL** databases to manage and analyze transactional data, delivering insights that foster process improvement and problem-solving initiatives.\nIntegrated tools like **Salesforce**, **HubSpot**, and **Common Room** into existing workflows to optimize customer engagement and track user interactions with an accuracy improvement of **20%**.\nCollaborated with cross-functional teams to deploy solutions minimizing time to market by **30%**, enhancing the **GTM** operational efficacy.\nLeveraged **JavaScript** frameworks (Node.js, React, Vue) to create interactive applications that elevate customer experience and drive higher conversion rates.\nExecuted automated outreach campaigns using **Lemlist** and **Instantly**, improving lead conversion rates by **15%** through targeted marketing efforts.\nDesigned and led data pipeline projects using **Clay** and **Make**, improving data accessibility and reporting speed by **40%** for active projects.\nEngaged in continuous process improvement to refine customer insights and analytics strategies, which contributed to a **25%** uplift in overall team performance."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** for backend services and **JavaScript** for frontend development to enhance data-driven decision making and process improvement in various e-commerce modules.\nDeveloped and maintained integrations with CRM tools like **Salesforce** and **HubSpot**, ensuring smooth data flow and contact management, contributing to improved sales processes by **30%**.\nImplemented and optimized **APIs** for seamless connectivity with third-party platforms such as **Clay** and **Common Room**, enhancing user engagement and collaboration, achieving a **25%** increase in active user interactions.\nEngineered analytical dashboards using tools like **Make** to visualize key data insights, facilitating problem-solving discussions that led to a **15%** increase in operational efficiency.\nSpearheaded data-driven strategies for product listings and sales funnels, employing SQL for querying and analyzing user behavior, ultimately boosting conversion rates by **20%**.\nEnhanced processes through problem-solving techniques, successfully reducing bottlenecks in workflow and improving transaction times by implementing best practices and new technologies.\nLeveraged tools like **GTM** and **Lemlist** to automate marketing efforts and improve lead generation outcomes, resulting in a **40%** increase in MQLs.\nCollaborated cross-functionally with departments to ensure alignment on goals, utilizing strong communication and analytical skills to drive project success.\nConducted regular training sessions for new tools and processes, enabling the team to adapt quickly and embrace data-driven growth methodologies."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tGTM, Clay, Salesforce, HubSpot, Common Room, Lemlist, Instantly, MLflow, Airflow, Kubeflow, data-driven, problem-solving, process improvement, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Weflow"
}