{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior QA Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior QA Engineer with 10+ years of experience in manual and automation testing. Proficient in **functional testing**, **UI testing**, **regression testing**, **cross-browser testing**, and **cross-platform testing**, utilizing tools such as **Selenium**, **Cypress**, and **Playwright**. Skilled in **Agile methodologies** and experienced in leveraging **Jira** for effective project management and tracking. Strong analytical skills complemented by excellent communication and attention to detail, driving QA process improvement and ensuring the delivery of high-quality software solutions in healthcare and finance. Additionally, brings expertise in **JavaScript/TypeScript**, **Python**, and hands-on experience building cloud-native applications on **Azure** and **AWS**, with a deep understanding of enterprise platforms and secure software development best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tConducted thorough **manual testing** and **automated testing** using **Cypress** and **Selenium** to ensure cross-browser compatibility and high-quality deliverables for healthcare and finance applications.\n•\tPerformed extensive **functional testing** and **regression testing** on full-stack solutions designed in **TypeScript** and **Python (FastAPI)**, ensuring adherence to regulatory standards and overall application performance.\n•\tExecuted **UI testing** and **cross-platform testing** for mobile apps built with **Flutter** and **React Native**, delivering reliable user experiences on iOS and Android systems.\n•\tDesigned and executed exploratory test plans using **Jira** for tracking defects and managing project workflows, leading to enhanced QA process improvements.\n•\tCollaborated with cross-functional teams in an **Agile** environment to implement best practices for QA, including reviewing project requirements and delivering actionable reports.\n•\tUtilized **Playwright** for automating tests across various browsers, ensuring application reliability and performance benchmarks in deployments.\n•\tLed knowledge-sharing sessions with team members to enhance **communication** and **analytical skills** within the QA team, focusing on **attention to detail** in testing methodologies.\n•\tReviewed and improved the QA process, leading to a **20%** reduction in bug rates in staging environments and improved product quality for healthcare and fintech applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive **manual**, **functional**, **UI**, and **regression testing** to ensure the integrity and performance of financial applications.\nExecuted **cross-browser** and **cross-platform testing** strategies to validate user interface consistency across different devices and platforms, enhancing user experience and satisfaction.\nCollaborated within **Agile** teams using **Jira** to track test progress and manage tasks effectively, fostering a transparent and productive work environment.\nDeveloped and maintained automated test scripts using **Cypress**, **Selenium**, and **Playwright**, significantly reducing the testing cycle time by **30%** and improving overall testing efficiency.\nPerformed detailed **exploratory testing**, identifying potential risks and defects in the application, leading to a **40%** increase in the defect detection rate compared to previous sprint cycles.\nLed QA process improvement initiatives by leveraging **Python** and **TypeScript** for automated testing frameworks, enhancing testing coverage and accuracy by **25%**.\nProvided clear communication of test results, metrics, and recommendations to stakeholders, facilitating informed decision-making on software quality.\nApplied strong **analytical skills** and **attention to detail** to develop comprehensive test scenarios and validate software against defined user requirements, ensuring high-quality deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Executed comprehensive **manual testing** strategies and meticulous **functional testing** of backend services developed in **Python** to ensure robust performance and meet **QA process improvement** objectives, achieving a defect detection rate of **95%**.\nConducted **UI testing** and **regression testing** across various e-commerce modules, enhancing system reliability and user engagement metrics by **30%** through targeted insights and bug identification.\nOrchestrated **cross-browser testing** and **cross-platform testing** to validate application behavior on multiple devices, leading to an increase in mobile satisfaction scores by **20%**.\nUtilized **Jira** for efficient tracking and management of testing activities, streamlining workflows under Agile methodologies and improving team communication.\nEngaged in **exploratory testing** to uncover critical usability issues, enhancing user experience and decreasing overall error rates by applying strong **analytical skills** and **attention to detail**.\nDeveloped and implemented **automation testing** frameworks using **Playwright**, **Cypress**, and **Selenium**, increasing testing coverage and reducing manual workload by **50%**.\nCollaborated with development teams to integrate feedback post-release using strong **communication** skills, ensuring iterative improvements based on user behavioral data.\nAssisted in utilizing **TypeScript** alongside existing frameworks to refine test scripts and optimize testing efficiency, enhancing the reliability of automated test cases.\nParticipated in Agile ceremonies to drive quality discussions and further improve processes, thereby influencing actionable changes within the QA team and overall product quality."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\t\n\n **Other:**\n\tmanual testing, functional testing, UI testing, regression testing, cross-browser testing, cross-platform testing, Agile, Jira, exploratory testing, QA process improvement, automation testing, Playwright, Cypress, Selenium, communication, analytical skills, attention to detail",
  "apply_company": "Interactivated Solutions Europe"
}