{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience in developing high-performance applications, particularly within the healthcare and financial sectors. Proficient in **Node.js**, **TypeScript**, and **AWS**, with intensive hands-on experience in building **RESTful** services and implementing **CI/CD** pipelines. Adept at leveraging **Git** for version control and employing **DevOps** practices to ensure efficient deployment and operational excellence. Experienced in utilizing **PostgreSQL** for database management and aligning with **Serverless** architectures to optimize system performance.\n\nDemonstrates strong capabilities in AI and ML technologies, with a proven record of creating applications that facilitate predictive analytics and automation through **Machine Learning** models. Moreover, possesses a solid understanding of **Agile** and **Scrum** methodologies, fostering effective team collaboration. Known for strong analytical skills and effective communication, ensuring alignment of technical solutions with business objectives.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained robust back-end systems using **Node.js** and **TypeScript**, ensuring seamless integration with RESTful APIs for efficient data exchange.\n• Implemented serverless architectures on **AWS**, leveraging services such as Lambda for scalable applications that adapt to variable workloads and reduce costs by up to **30%**.\n• Designed and executed CI/CD pipelines utilizing **Git** for version control, enabling automated testing and deployment workflows, increasing release frequency by **25%**.\n• Managed data storage and retrieval using relational database management systems, particularly **PostgreSQL**, optimizing queries for a **50%** improvement in response time for high-traffic applications.\n• Collaborated in an **Agile** and **Scrum** environment, facilitating effective communication within cross-functional teams to ensure alignment on project deliverables and timelines.\n• Employed **ZOD** for data validation in API endpoints, enhancing the accuracy and reliability of incoming and outgoing data by reducing errors by **20%**.\n• Utilized machine learning frameworks for analytical insights and predictive modeling, contributing to AI-driven feature enhancements across applications.\n• Spearheaded the use of **DevOps** practices, increasing operational efficiency through automation and strategic resource allocation, including incident response and system monitoring for uptime improvement to **99.9%**.\n• Engaged in continuous learning and the application of new technologies, staying current on the latest advancements in programming and cloud service trends to ensure best practices in backend development."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** and **TypeScript** for developing microservices architecture, achieving a 30% improvement in scalability and a 25% increase in performance for high-volume transactional systems.\nImplemented **AWS** cloud services and **Serverless** architecture to streamline deployment processes, resulting in a 40% reduction in operational costs and efficient resource management.\nDesigned RESTful APIs for seamless integration of various financial tools, employing **PostgreSQL** for robust data storage and retrieval, which improved data access speeds by 50%.\nCollaborated with cross-functional teams using **Agile** methodologies and **Scrum** practices, enhancing team productivity by delivering features in 2-week sprints, with an average of **3 major releases** per quarter.\nIntegrated **DevOps** practices, including **CI/CD** pipelines using **Git**, ensuring a smooth transition from development to production with a **99% success rate** in deployments.\nAnalyzed financial data for insights using **AI** and **ML** technologies, contributing to strategic decision-making processes and improving overall service reliability.\nMaintained high standards of communication and analytical skills within diverse teams to foster a collaborative and innovative work environment."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed robust backend services leveraging **Node.js** (NestJS, Express) and **TypeScript**, following **RESTful** principles to ensure efficient communication across services, leading to a 30% improvement in response times.\n• Implemented scalable serverless architecture on **AWS** for high-traffic applications, achieving over **99.9%** uptime through optimized resource allocation and management.\n• Engineered CI/CD pipelines, utilizing **Git**, and **DevOps** practices, which reduced deployment times by **40%** and increased team collaboration.\n• Collaborated with cross-functional teams in an **Agile** and **Scrum** environment, enhancing project transparency and stakeholder communication, resulting in a **15%** increase in project delivery speed.\n• Supported AI and ML integration into backend services, enhancing user experience through personalized content recommendations and utilizing analytical tools for performance tracking, influencing a **20%** improvement in conversion rates.\n• Integrated **PostgreSQL** as a primary data storage solution, ensuring efficient and fault-tolerant access with a focus on **ZOD** principles to enforce data integrity.\n• Engaged in analytical problem-solving to identify bottlenecks in application workflows, leading to a significant reduction in latency and enhancing user satisfaction scores by **25%**.\n• Fostered strong communication channels within development teams and external stakeholders, improving project outcomes through regular updates and feedback loops, crucial for successful project execution."
    }
  ],
  "skills": " **Programming Languages:** \n\tJavaScript/TypeScript, Python\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django, Node.js\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tRESTful\n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, Serverless\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, ZOD, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Agile, Scrum, AI, ML, Analytical, Communication",
  "apply_company": "Vita Health"
}