{
  "name": "Mariusz Jan Skobel",
  "role_name": ".NET Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Results-oriented .NET Engineer with 10+ years of experience in delivering high-performance software solutions. Expertise in **.NET**, **AWS**, and **Azure DevOps** for building robust applications and implementing **REST APIs** to ensure seamless communication between systems. Proficient in **CI/CD** practices, leveraging **Terraform** for infrastructure automation and **automated testing** to maintain code quality and reliability. Strong analytical and problem-solving skills allow for the effective resolution of complex technical challenges.\n\nSkilled in modern programming technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**, with extensive hands-on experience across the full stack using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Extensive background in microservices architecture and event-driven systems, along with a commitment to secure and maintainable solutions that adhere to compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Experienced in MLOps with a focus on real-world impact, adept in managing ML pipelines using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": ".NET Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and optimized scalable .NET applications with adherence to architectural best practices and regulatory standards, utilizing **AWS** and **Azure DevOps** for CI/CD pipelines to ensure consistent delivery across environments.\n•\tImplemented REST APIs for seamless integration between frontend and backend services, focusing on scalability, security, and maintainability to support high-load applications.\n•\tEngineered CI/CD processes incorporating **Terraform**, significantly reducing deployment times by **30%** and enhancing operational efficiency.\n•\tApplied automated testing frameworks, improving code reliability and reducing bug counts by **40%** prior to releases through thorough integration and unit tests.\n•\tContributed to problem-solving initiatives through collaborative efforts, facilitating discussions in English to effectively address technical challenges during project phases.\n•\tLed the migration of legacy systems to .NET Core (version **6.0**) enhancing performance and maintainability in financial applications.\n•\tDesigned and developed microservices architecture using containerization technologies such as Docker and orchestration with Kubernetes, ensuring high availability and scalability for applications handling up to **1 million** daily transactions.\n•\tIntegrated **AWS Lambda** functions, allowing real-time data processing and reducing latency by **25%** for financial transaction verification.\n•\tCollaborated with cross-functional teams to define system requirements and refine workflows, resulting in improved application functionalities and user experiences.\n•\tMentored junior developers on best practices in .NET development and automated testing strategies, fostering a culture of continuous learning and improvement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **.NET** framework and **Azure DevOps** to implement CI/CD pipelines, ensuring efficient and automated deployment processes with a **95%** reduction in deployment times.\nDeveloped and maintained robust **REST APIs** for financial applications, achieving a **99.9%** uptime by implementing comprehensive automated testing strategies.\nMigrated legacy systems to **AWS** cloud services, resulting in enhanced scalability and a reduction in operational costs by **20%**.\nCollaborated with multidisciplinary teams to identify and solve complex problems in application development, enhancing overall system performance and reliability.\nParticipated in code reviews and mentoring sessions, fostering an environment of continuous improvement and knowledge sharing within the team.\nConducted performance tuning and monitoring of applications using profiling tools, enabling proactive identification of bottlenecks and system enhancements.\nDocumented architectural decisions and best practices for future reference, promoting maintainability and coherence across projects."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and maintained REST APIs utilizing **.NET** frameworks to support seamless integration of backend services within the application ecosystem, ensuring high standards for scalability and performance.\nDesigned and implemented CI/CD pipelines using **Azure DevOps** and **Terraform** to automate deployment processes, reducing deployment time by **30%** and minimizing manual errors.\nParticipated in automated testing strategies, enhancing code reliability and lowering regression defects by **25%**, while maintaining a strong focus on quality assurance.\nLeveraged **AWS** cloud services to optimize application hosting and data storage, achieving cost-efficient scaling for high-traffic environments, and establishing a resilient infrastructure.\nEmployed problem-solving techniques to troubleshoot and resolve complex software issues, enhancing overall functionality and user experience on critical projects.\nCollaborated with cross-functional teams using English for effective communication of technical concepts, project updates, and troubleshooting strategies, contributing to smoother project workflows.\nUtilized Agile methodologies in project management, participating in daily stand-ups and sprint retrospectives to continuously improve development processes and team collaboration."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST APIs\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, automated testing, problem-solving, English"
}