{
  "name": "Tomasz Lee",
  "role_name": "Senior BackEnd Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior BackEnd Engineer with over 9 years of experience in designing and implementing solutions using **Node.js**, **TypeScript**, and **Java**. Proficient in **React** for frontend solutions while maintaining strong backend capabilities with **PostgreSQL** and a solid understanding of event-driven architecture and clean architecture principles. Expertise in developing secure applications adhering to security best practices and compliance standards. Demonstrated success in applying testing strategies and domain-driven design to optimize application performance. Capable of leading and collaborating effectively across teams to deliver innovative and robust solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior BackEnd Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and maintained scalable backend solutions utilizing **Node.js** and **TypeScript**, ensuring adherence to **clean architecture** principles.\n• Implemented event-driven systems to enhance application responsiveness and performance.\n• Designed and integrated TypeScript-based RESTful APIs with **PostgreSQL** for efficient data management and access.\n• Leveraged **React** for frontend components to create cohesive user experiences in collaboration with UX/UI designers.\n• Ensured compliance with security best practices, incorporating JWT-based authentication and authorization mechanisms to protect user data.\n• Developed automated testing strategies to enhance code quality and reliability.\n• Created data models following **domain-driven design** principles, optimizing system organization and functionality.\n• Collaborated with cross-functional teams to refine event-driven architecture, leading to a 25% increase in system performance.\n• Conducted performance testing and optimization efforts, reducing average query execution times by 20% on **PostgreSQL**.\n• Implemented CI/CD pipelines on **Azure DevOps**, decreasing deployment time by 40%, enhancing overall operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and optimized backend services using **Node.js** and **Java**, adhering to **clean architecture** and **domain-driven design** principles, leading to a 20% reduction in code complexity.\n• Designed RESTful APIs and integrated them with **PostgreSQL**, ensuring efficient data retrieval and real-time access.\n• Created and maintained scalable web applications using **React** and **TypeScript**, improving user experience and engagement by 30%.\n• Implemented **event-driven** architecture using RabbitMQ and Apache Kafka, enabling seamless communication between microservices and enhancing system efficiency.\n• Led the development of security measures and **compliance** protocols following industry standards to safeguard application data.\n• Established robust **testing strategies** to improve code quality, reducing bugs by 40% in the production environment.\n• Collaborated with cross-functional teams to define project requirements and timelines, ensuring successful project delivery within **2 weeks** of the deadline.\n• Enhanced system performance by integrating **Redis** as a caching solution, achieving a **25%** reduction in API response times.\n• Conducted thorough code reviews and provided mentorship to junior developers, fostering a culture of continuous improvement and learning.\n• Employed CI/CD practices to streamline deployments, decreasing rollout times by **30%** and production errors by **15%**.\n• Developed custom reporting tools using D3.js for real-time tracking of project metrics, leading to insightful status updates and data visualization."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **TypeScript** and **Node.js** to develop scalable backend solutions, ensuring adherence to **clean architecture** principles.\nImplemented **event-driven** architecture for responsive system interactions, enhancing application performance by **30%**.\nDesigned and developed RESTful APIs using **Java** and integrated with **PostgreSQL**, achieving an average data retrieval speed improvement of **40%**.\nEmployed effective **security best practices** and **testing strategies** to maintain high standards in code quality and compliance with industry regulations.\nCollaborated with cross-functional teams to define software requirements and deliver robust backend functionalities aligned with business objectives.\nOptimized database performance through advanced querying techniques in **PostgreSQL**, resulting in decreased latency by **25%**.\nSpearheaded multiple code reviews, ensuring adherence to **domain-driven design** principles and fostering a culture of quality and collaboration.\nCreated thorough technical documentation for backend processes, facilitating easier onboarding and knowledge transfer across teams.\nEngaged actively in daily standups to maintain alignment with project timelines and objectives, promoting agile development practices."
    }
  ],
  "skills": " **Programming Languages**\n\t Java, TypeScript, Python\n\n **Backend Frameworks**\n\t Node.js, ExpressJS, NestJS, .NET\n\n **Frontend Frameworks**\n\t React, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t AWS, Azure\n\n **Databases**\n\t PostgreSQL, MSSQL Server, MySQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\t CI/CD pipelines\n\n **Cloud & Infrastructure**\n\t Microservices\n\n **Other**\n\t UX/UI Design, Git, GitHub, testing strategies, security best practices, compliance, event-driven, domain-driven design, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis",
  "apply_company": "Qualifyze"
}