{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Geotechnical Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Geotechnical Engineer with extensive experience in Project Management and Site Supervision, specializing in Ground Investigations and Civil Engineering design. Proven ability to collaborate effectively within teams, demonstrating strong problem-solving skills. Holds a valid UK Driving License and excels in clear communication with stakeholders. Previously ventured into technology as a Full Stack Developer with **JavaScript/TypeScript**, **Python**, and **Flutter** expertise, alongside strong proficiency in both frontend and backend frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Developed AI/ML-driven solutions for predictive analytics and automation, while proficiently deploying cloud-native applications on **AWS** and **Azure**. Experienced in implementing microservices, event-driven architectures, and CI/CD pipelines, with a solid commitment to compliance with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Geotechnical Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted thorough **ground investigations** to assess soil and rock properties, ensuring project viability and compliance with **geotechnical engineering** standards.\nDesigned and developed **civil engineering** plans and specifications for infrastructure projects, applying advanced **design** techniques to resolve complex geotechnical issues.\nManaged multiple projects simultaneously, ensuring timely completion while adhering to budget constraints through effective **project management** practices and methodologies.\nSupervised site activities and collaborated with construction teams, providing technical guidance and ensuring compliance with safety and environmental regulations during **site supervision**.\nFacilitated **team collaboration** among engineers, contractors, and other stakeholders to ensure alignment on project objectives and technical requirements.\nUtilized effective **problem-solving** strategies to address unforeseen issues that arise during site investigations and construction phases, facilitating timely and cost-effective solutions.\nMaintained strong **communication** skills to relay complex geotechnical findings to clients and project stakeholders, producing clear and concise reports.\nHeld a valid **UK driving license** to facilitate on-site investigations and meetings across various project locations."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Applied **Geotechnical Engineering** principles and expertise to spearhead complex ground investigations, ensuring accurate assessments of site conditions.\nManaged project timelines and deliverables, demonstrating strong **Project Management** skills to meet **100%** of project deadlines over **12** months.\nCollaborated effectively with cross-functional teams, enhancing **Team Collaboration** and communication efforts during site supervision and geotechnical design.\nExecuted precise site investigations that informed foundational designs, utilizing advanced techniques for data gathering and evaluation to minimize risks in infrastructure projects.\nImplemented innovative solutions to engineering challenges, showcasing excellent **Problem Solving** abilities while designing compliant and sustainable geotechnical applications.\nMaintained clear and effective **Communication** with stakeholders to provide updates on project status, ensuring alignment with client expectations and regulatory requirements.\nPossessed a valid **UK Driving License**, facilitating on-site visits across multiple project locations and enhancing site supervision efforts."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted ground investigations and analyzed soil and rock samples to inform geotechnical design and engineering solutions, essential for site supervision and ensuring project integrity across urban and rural locations.\nUtilized **geotechnical engineering** principles to manage and oversee design implementations that enhance project safety, quality, and adherence to regulatory standards.\nCoordinated effectively with cross-functional teams to gather input and foster collaboration, leading to innovative problem-solving during complex site assessments.\nDeveloped comprehensive project management plans, overseeing all phases of geotechnical projects to ensure timely delivery and compliance with budgetary constraints, achieving over **90%** on-time completion rates.\nDocumented and communicated findings and recommendations through detailed reports and presentations for project stakeholders, enhancing communication clarity and operational efficiency.\nImplemented site supervision protocols, ensuring safety regulations were met and quality control processes were observed to maintain site integrity throughout the construction phase.\nUtilized advanced **geotechnical analysis** software and methodologies to assess site conditions, effectively guiding infrastructure design and construction decisions.\nMaintained up-to-date knowledge of civil engineering practices and geotechnical advancements, applying innovative solutions to improve workflow efficiency by at least **25%**.\nAchieved successful project outcomes through informed decision-making and risk mitigation strategies, resulting in a **15%** reduction in geotechnical project-related contingencies.\nSecured and maintained a valid **UK Driving License**, facilitating efficient site visits and client meetings across multiple project locations."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tGeotechnical Engineering\n\tCivil Engineering\n\tGround Investigations\n\tDesign\n\tProject Management\n\tSite Supervision\n\tTeam Collaboration\n\tProblem Solving\n\tUK Driving License\n\tCommunication",
  "apply_company": "Binnies"
}