{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior AI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior AI Engineer with 8 years of comprehensive experience, I excel in **Python**, **Machine Learning**, and **MLOps**, utilizing an extensive tech stack that includes **NumPy**, **Pandas**, **Scikit-Learn**, **PyTorch**, **Transformers**, **LangChain**, and **Streamlit**. My background enables me to build and deploy sophisticated models, particularly leveraging large language models and statistical modeling techniques to drive innovation across healthcare and financial sectors.\nI possess profound knowledge of cloud platforms, specifically **AWS** and **Azure**, incorporating services like **SageMaker**, **Lambda**, **Fargate**, and **Glue** to optimize and scale machine learning workflows. Additionally, I have a solid foundation in **CI/CD** practices, employing tools such as **MLflow** and **GitHub Actions** for seamless application lifecycle management.\nMy strengths lie in developing enterprise-grade platforms enriched with AI/ML capabilities for predictive analytics and intelligent automation. Moreover, I am adept at real-time data processing and have experience adhering to compliance standards such as HIPAA and PCI DSS, ensuring that all solutions are robust and secure.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and its libraries such as **NumPy**, **Pandas**, **Scikit-Learn**, **PyTorch**, and **Transformers** to architect and develop machine learning models, ensuring robust performance for applications like patient risk prediction and financial fraud detection.\nDeveloped and deployed MLOps pipelines leveraging **MLflow**, **Streamlit**, and **GitHub Actions** for continuous training, validation, and versioning of models, enabling deployment across **AWS** and **Azure** environments like **SageMaker** and **Lambda**.\nDesigned and implemented CI/CD processes using **GitHub Actions** and **MLflow** for seamless integration and delivery of machine learning applications, streamlining updates with automation and version management across **3** key environments.\nCollaborated with stakeholders to integrate large language models and AI features into client-facing applications, enhancing functionality like smart dashboards and personalized recommendations, backed by advanced statistical modeling techniques.\nCreated efficient data processing frameworks using **Pandas** and **NumPy** for handling and analyzing large datasets in healthcare and financial domains, optimizing storage solutions.\nConducted thorough communication with cross-functional teams to ensure alignment on project objectives and deliverables, driving innovation and quality in projects involving **MLOps** and machine learning.\nImplemented advanced machine learning techniques by utilizing tools like **Hugging Face Transformers** and **LangChain**, pushing the boundaries of application capabilities with smart data predictions.\nEngineered solutions around unstructured and structured data leveraging **AWS Glue** and enhancing data ingestion processes for maximum performance and reliability in applications within healthcare and finance sectors.\nEnsured compliance with industry regulations while maintaining high standards for model accuracy and performance in production workflows, employing **MLflow**, **AWS**, and **Azure** technologies effectively for enterprise solutions.\nConducted performance evaluations and optimizations of machine learning models, ensuring they meet or exceed business objectives, contributing to successful project delivery across **3** major releases."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and frameworks like **Scikit-Learn** and **PyTorch** to develop and implement machine learning models, enhancing predictive analytics for financial fraud detection by **30%**.\nConstructed robust ML pipelines leveraging **MLflow** for model versioning and deployment, integrating them into applications to ensure seamless real-time predictions and scoring.\nEngaged in Agile methodologies while collaborating closely with cross-functional teams to deliver solutions that improve communication and align with business objectives.\nIncorporated data manipulation libraries like **NumPy** and **Pandas** to process financial datasets effectively, optimizing ETL processes and improving data accuracy by **25%**.\nImplemented CI/CD practices using **GitHub Actions**, streamlining the deployment cycles and enhancing code reliability.\nHarnessed cloud services like **AWS** and **Azure**, specifically utilizing **SageMaker** and **Azure ML**, achieving a **40%** reduction in model training time and resource consumption.\nDeveloped interactive dashboards using **Streamlit** and integrated with **Power BI** to provide stakeholders with actionable insights derived from real-time data analytics.\nLeveraged **Transformers** and **LangChain** libraries for natural language processing tasks, improving customer engagement insights through enhanced data interpretation.\nEngaged in statistical modeling to quantify risks and forecast trends, thereby facilitating strategic decision-making across the financial platform."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Leveraged **Python** with frameworks like **FastAPI** and **Django** to develop robust machine learning services, ensuring high availability and scalability for AI-driven applications.\n- Designed and implemented machine learning models using **NumPy**, **Pandas**, **Scikit-Learn**, and **PyTorch**, enhancing the platform's AI capabilities and delivering real-time predictive analytics.\n- Deployed models operationalized through **MLflow** and managed CI/CD pipelines using **GitHub Actions**, which streamlined the transition from development to production, with a rollback time of under **5 minutes**.\n- Utilized cloud services such as **AWS** and **Azure** to ensure a **99.9% uptime**, employing tools like **SageMaker** for model training and **Lambda** for serverless execution, optimizing resource utilization.\n- Integrated large language models using **Transformers** and **LangChain** to enhance application responses, improving user engagement metrics by over **30%**.\n- Fostered collaboration among data scientists and engineers through effective communication, ensuring alignment on project goals and timelines, leading to a reduction in delivery time by **20%**.\n- Implemented MLOps best practices, including monitoring and logging with **Glue** and **Fargate**, to ensure seamless model deployment and performance tracking.\n- Developed statistical models that informed strategic decision-making and improved report generation accuracy by **15%**.\n- Engaged in constant learning of emerging AI technologies, staying updated with trends to keep the tech stack competitive and relevant in the evolving AI landscape."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tMLflow, OIDC, RBAC, JWT, OAuth2\n\n**Serverless and Cloud Functions**\n\tAWS (Lambda, ECS), Azure (App Services, SQL), SageMaker, Glue, Bedrock, Fargate\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS (RDS, S3), Azure (Blob)\n\n**Other**\n\tMachine Learning, Large Language Models, NumPy, Pandas, Scikit-Learn, PyTorch, Streamlit, Transformers, LangChain, MLOps, Statistical Modeling, Communication",
  "apply_company": "PIB Group"
}