{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Frontend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Frontend Engineer with 10+ years of experience specializing in high-performance software solutions, particularly with expertise in **React**. Adept at developing user-centric interfaces, while fostering effective **teamwork** and **communication** skills to lead collaborative projects. Proficient in modern technologies including **JavaScript/TypeScript**, with a solid foundation in **Java** and **Kotlin** to support diverse development needs. Experienced in the full development lifecycle, having contributed significantly to projects that utilize **message brokers**, ensuring efficient message handling and scalability.\nPossesses a strong technical background with hands-on expertise in **Python**, **Flutter**, **Node.js**, **FastAPI**, and **Django**. Committed to building secure, maintainable systems that adhere to compliance standards such as HIPAA and PCI DSS, while showing passion for developing applications that leverage **AI/ML capabilities** for enhanced analytics and decision-making. Proven ability to deliver through innovative cloud-native deployments on **Azure** and **AWS**, with a focus on agile development practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and developed responsive user interfaces utilizing **React** for healthcare applications, enhancing user experience and accessibility.  \n• Collaborated effectively with cross-functional teams to gather requirements and deliver projects on time, leveraging strong **communication** and **teamwork** skills.  \n• Developed backend integration solutions using **Java** and **Kotlin**, ensuring reliable messaging through **Message Broker** systems for data synchronization across services.  \n• Implemented state management and lifecycle methods in **React**, improving application performance and maintainability across versions **17-18**.  \n• Led code reviews and mentored junior developers, fostering a culture of continuous learning and improvement within the engineering team.  \n• Optimized application components to achieve **30%** improved loading times and performance metrics, ensuring scalability and responsiveness.  \n• Engaged in Agile/Scrum methodologies to streamline project workflows and ensure the timely delivery of high-quality software solutions.  \n• Integrated RESTful APIs to fetch and manipulate data, achieving a **15%** increase in data retrieval efficiency.  \n• Designed and executed test plans to assure the quality of features developed using **Jest** and **Cypress**, facilitating smoother deployments and reducing errors by **40%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Designed and developed user-centric front-end applications utilizing **React (18)**, ensuring seamless user experiences and high performance.\nCollaborated effectively with cross-functional teams to ensure clear communication and alignment on project goals, enhancing teamwork and collaboration.\nImplemented **Message Broker** solutions, improving application scalability and efficiency in data handling.\nApplied best practices in software development within a **Java** and **Kotlin** environment to create maintainable and efficient codebases.\nEnhanced application responsiveness with **Redux Toolkit** and **Tailwind CSS**, achieving a **40%** improvement in load times for financial dashboards and admin portals.\nConducted code reviews and facilitated knowledge-sharing sessions to foster a culture of continuous improvement and teamwork within the engineering team.\nLeveraged real-time data visualization techniques using **D3.js** to display critical financial metrics, allowing stakeholders to make informed decisions swiftly.\nAchieved project milestones consistently, with **90%** on-time delivery across multiple development cycles."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **React** (18) to develop dynamic frontend applications, ensuring seamless user experiences and robust performance on both web and mobile platforms.\nCollaborated within multi-disciplinary agile teams to enhance product features, contributing to effective **teamwork** and fostering open **communication** among stakeholders.\nImplemented real-time messaging and updates through **Message Broker** systems for enhanced interactivity in user interfaces, aligning frontend functionalities with backend services.\nSupported mobile-first design and accessibility compliance while engineering user interfaces using tools like **HTML5/CSS3**, contributing to improved engagement metrics by **30%** year-over-year.\nConducted code reviews and performance optimization efforts, achieving a **50%** reduction in load times across key user journey components, enhancing overall customer satisfaction.\nIntegrated user feedback to iterate on UI designs, driving feature updates that led to a **25%** increase in user retention rates.\nWorked cross-functionally to troubleshoot and resolve issues, ensuring that project timelines are met while maintaining high-quality standards in frontend deliverables.\nLeveraged agile methodologies to coordinate workflow and ensure consistent communication within the team, enhancing project delivery efficiency by **40%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, Kotlin, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tMessage Broker\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD Tools, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tTeamwork, Communication, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Square One Resources"
}