{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Integration Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Integration Engineer with 13+ years of experience specializing in seamless integration within healthcare systems. Proficient in **Mirth**, **HL7**, **XML**, **Python**, **JavaScript**, and database management using **MS-SQL**. Skilled in cloud-based solutions and data migration strategies, ensuring efficient data integration and API development utilizing **JSON**. Extensive experience in deploying integrations that enhance interoperability and data flow within healthcare applications.\nSuccessfully developed high-performance applications in both healthcare and financial sectors, with deep knowledge of both frontend and backend technologies, including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven track record in building AI/ML-powered platforms focused on predictive analytics and real-time processing, along with a commitment to compliance-driven development adhering to HIPAA and other industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Integration Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust integration solutions leveraging **Mirth** and **HL7** standards for seamless data exchange between healthcare applications, ensuring compliance and interoperability.\n- Utilized **Python** and **JavaScript** to create APIs that facilitate efficient data migration and system integration, supporting real-time data processing and access.\n- Designed and implemented XML and JSON-based interfaces for various applications, enhancing data communication across platforms while maintaining high performance.\n- Conducted thorough validations and transformations of MS-SQL databases to ensure data integrity during migration processes, achieving a 99.9% data accuracy rate.\n- Led integration projects involving multiple cloud services, optimizing resource allocation and minimizing latency through strategic deployments on **AWS** and **Azure**.\n- Collaborated with cross-functional teams to define and implement best practices for API design and data integration, reducing development time by **30%**.\n- Provided technical support and expertise in troubleshooting integration challenges, achieving a resolution rate of **95%** on first attempts.\n- Conducted training sessions for team members on using integration tools and methodologies, enhancing team proficiency by **40%** within the first quarter.\n- Managed updates and enhancements to existing integration workflows, resulting in improved performance metrics and reduced downtime of integrated systems.\n- Evaluated and integrated third-party APIs as part of data migration strategies, ensuring smooth transitions and continued service availability for end-users."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Integrated and modernized healthcare data systems by leveraging **HL7** standards and **XML** for data exchange, ensuring compliance with industry protocols.\nDeveloped scalable APIs using **Python** and **JavaScript** to facilitate seamless interactions between various healthcare applications, enhancing interoperability.\nExecuted data migration strategies to transition legacy system data into modern cloud-based platforms with high accuracy and efficiency, utilizing **MS-SQL** and cloud services for storage.\nImplemented robust integration solutions capable of handling high-volume transactions in real-time, ensuring quick responses to healthcare providers' queries, thereby improving patient care.\nDesigned data workflows that involved transforming and processing complex datasets into structured formats, utilizing **JSON** for data interchange to maintain high data integrity.\nBuilt and maintained comprehensive documentation of integration processes, ensuring clarity and consistency for both technical and non-technical stakeholders.\nCollaborated with cross-functional teams to identify and resolve integration challenges, resulting in a 30% reduction in system downtime related to API communication failures.\nMonitored system performance and integration efficiency, achieving a 25% improvement in data processing times through optimized coding practices and database management."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered and optimized integration solutions to enhance data interoperability, leveraging **Python** and **JavaScript** to streamline workflows and improve system connectivity with **HL7**, **XML**, and **JSON** as data interchange formats.\nImplemented and maintained APIs to facilitate real-time data exchange, ensuring seamless integration with third-party systems and cloud services while adhering to industry standards and best practices.\nManaged data migration processes across multiple platforms, ensuring accuracy and integrity of transferred data while optimizing performance using **MS-SQL**.\nDeveloped and deployed applications on cloud environments, utilizing a mix of **Python**, **JavaScript**, and **API** integrations to provide scalable solutions tailored to client needs.\nUtilized integration technologies such as **Mirth** for healthcare data exchanges, ensuring compliance with relevant regulations and enhancing interoperability among different healthcare systems.\nCollaborated across teams to identify integration challenges and automate workflows, resulting in a **25%** reduction in operational costs over **6 months**.\nDesigned robust data pipelines that efficiently handled and transformed diverse datasets, achieving a processing speed increase of **30%** through the use of optimized algorithms and data structures.\nConstructed and documented integration protocols and procedures, improving onboarding time for new integrations by **40%** through clear guidelines and reusable templates."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tMirth, HL7, JSON, API\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, MS-SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tData Migration, Integration, XML, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Diagnexia"
}