{
  "name": "Tomasz Lee",
  "role_name": "Senior Fullstack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Fullstack Engineer with 9+ years of experience, proficient in **Python**, **JavaScript**, and **TypeScript**, delivering innovative software solutions through strong AI integration and advanced algorithms. Demonstrated expertise in software engineering best practices, ensuring high-quality code and efficient project execution. Adept at utilizing business intelligence to enhance decision-making processes. Proven ability to communicate effectively and collaborate with cross-functional teams to drive project success. Previous roles focused on full-stack development and complex applications using technologies including **ReactJS**, **NextJS**, and **.NET**, with a strong foundation in microservices architecture leveraging **Apache Kafka**, **RabbitMQ**, and **Redis**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python**, **JavaScript**, and **TypeScript** to enhance the web-based customer management platform, driving a 25% increase in user satisfaction.\nImplemented software engineering best practices within a microservices architecture using **.NET 7**, optimizing for scalability and maintainability, reducing system complexity.\nDesigned and executed algorithms for real-time data processing, integrating **Apache Kafka** for data streaming and **RabbitMQ** for task queuing, leading to enhanced system resilience.\nDeveloped efficient scripts leveraging **Redis** for caching solutions, decreasing database load and improving response times by **35%**.\nConstructed RESTful APIs in conjunction with **.NET** and a **MongoDB** database to facilitate seamless data interoperability for diverse services, contributing to a more robust architecture.\nEstablished CI/CD pipelines using **Azure DevOps**, which led to a **40%** reduction in deployment time, streamlining the development lifecycle.\nOptimized **MSSQL** database queries and indexing strategies, achieving a **20%** reduction in average query execution time, thereby enhancing performance.\nCollaborated effectively with UX/UI designers to refine the platform’s interface, resulting in a significant boost to user experience and engagement metrics.\nCreated an interactive reporting engine utilizing **D3.js** and **Three.js** for advanced data visualizations, enhancing business intelligence capabilities.\nImplemented **JWT-based** authentication and authorization to safeguard application access, ensuring secure user interactions."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** and **JavaScript** to design and develop high-quality software solutions in line with software engineering best practices, resulting in a 20% reduction in development time.\nImplemented efficient algorithms in **TypeScript** for enhanced processing capabilities in various applications, leading to improved system responsiveness.\nLeveraged **AI** techniques to enhance data analysis features for better business intelligence reporting, increasing actionable insights by **30%**.\nDeveloped a cloud-based project management tool with **Angular** and **.NET Core**, achieving a **15%** increase in team collaboration efficiency.\nArchitected a microservices infrastructure utilizing **RabbitMQ** for task orchestration and **Apache Kafka** for event-driven data management, which improved system scalability.\nIntegrated **Redis** as a caching layer to diminish latency in frequent API calls, resulting in a **25%** boost in overall system performance.\nBuilt and maintained user-friendly interfaces with **ReactJS** and **Tailwind CSS**, contributing to a **25%** enhancement in user engagement on the platform.\nEstablished CI/CD pipelines with **GitHub Actions**, enabling a **30%** reduction in production deployment errors.\nManaged and optimized **MSSQL** and **MySQL** databases for efficient data storage and retrieval, improving query performance substantially.\nCollaborated effectively with stakeholders to articulate and prioritize system requirements, ensuring on-time project deliverables.\nCreated dynamic charts and graphs with **D3.js** for interactive project status tracking and detailed reporting.\nConducted thorough code reviews and provided mentorship to junior developers, effectively elevating team productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **Python** to develop scalable and efficient web applications, enhancing overall system performance by **30%**.\nImplemented software engineering best practices by collaborating on code reviews and maintaining high-quality standards across multiple projects.\nDesigned and developed algorithms for data processing, leveraging AI techniques to extract business intelligence insights, resulting in a **15%** increase in decision-making efficiency.\nEngaged in scripting for automation tasks, optimizing workflows and reducing manual effort by **25%**.\nConducted thorough communication efforts with cross-functional teams to ensure project alignment and stakeholder satisfaction.\nManaged the integration of various third-party APIs to facilitate data exchange and enrich application functionality.\nProvided mentorship to junior developers on scripting techniques and software engineering best practices, fostering professional growth within the team.\nEngaged actively in Agile methodologies by participating in daily standups and retrospective sessions to refine processes and deliverables.\nDelivered concise technical documentation for projects and systems, promoting clarity and aiding in knowledge transfer across departments."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tGit, GitHub\n\n**Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis; Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest; Blockchain: Solidity, Ether.js, Web3.js, Ethereum; UX/UI Design; AI; Scripting; Algorithms; Software Engineering Best Practices; Business Intelligence; Communication",
  "apply_company": "Turing"
}