{
  "name": "Tomasz Lee",
  "role_name": "Backend Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Backend Software Engineer with 9+ years of experience specializing in **Java**, **Spring Framework**, and **Spring Boot**. Proficient in building applications utilizing **Maven**, **JUnit**, and implementing Test-Driven Development (TDD) methodologies. Extensive knowledge in **NoSQL databases** such as **MongoDB** and **DynamoDB**, along with in-memory data stores like **Redis**. Demonstrated expertise in utilizing **Docker** and managing **CI/CD pipelines** within **GCP** environments. Strong understanding of algorithms and software architecture, coupled with proven collaboration and communication skills. Known for delivering high-quality, scalable solutions and enhancing development efficiency across cross-functional teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Backend Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Java** and **Spring Boot** to design and develop scalable backend services, enhancing system performance and reliability by 30%.\nImplemented **Test-Driven Development** (TDD) practices with **JUnit**, ensuring robust and maintainable code with over 80% test coverage.\nDeveloped microservices utilizing **Spring Framework** to streamline application components, improving deployment efficiency by 25%.\nIntegrated **Docker** to containerize applications, facilitating consistent environments across development, testing, and production stages, thus reducing deployment issues by 40%.\nConfigured **CI/CD pipelines** on **GCP**, automating deployment processes which decreased manual errors.\nDesigned and optimized database schemas for **MongoDB** and **DynamoDB**, resulting in enhanced data retrieval speeds by 50%.\nLeveraged **Redis** for caching, improving application performance and reducing average response time by 35%.\nCollaborated with cross-functional teams to deliver features that enhanced the overall user experience through effective **communication** and teamwork.\nConducted code reviews and provided mentorship to junior developers, fostering a culture of knowledge sharing within the team.\nExecuted algorithms for efficient data processing and retrieval, improving application responsiveness by leveraging modern computing strategies."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "- Developed and maintained scalable backend services using **Java** and **Spring Framework**, adhering to best practices in **Test-Driven Development**.\n- Designed microservices architecture that facilitated seamless integration with **NoSQL databases** like **MongoDB** and **DynamoDB**, enhancing data handling capabilities by **30%**.\n- Implemented **Docker** for containerization, simplifying deployment processes and ensuring consistent runtime environments across all environments.\n- Established and optimized **CI/CD pipelines** using **Maven** and **JUnit**, reducing production deployment errors by **25%** and increasing release frequency.\n- Developed reliable and efficient RESTful APIs, ensuring secure data access and manipulation, which improved overall application responsiveness by **20%**.\n- Integrated **in-memory Data Stores** using **Redis** to accelerate data retrieval, leading to a **15%** increase in application performance during peak loads.\n- Collaborated with cross-functional teams to define system requirements and development timelines, ensuring effective communication and timely project delivery.\n- Performed regular code reviews and provided mentorship to junior developers, significantly improving team productivity and code quality.\n- Conducted regular assessments of software architecture to ensure optimal scalability and performance issues were addressed proactively.\n- Engaged in algorithm optimization discussions to enhance the efficiency of various backend processes and improve user experience."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Java** and **Spring Framework** to design and implement backend services, ensuring code quality through **Test-Driven Development** (TDD) methodology which enhanced reliability by 30%.\nDeveloped RESTful APIs using **Spring Boot**, optimizing performance for various microservices with an average response time reduction of **150ms**.\nIntegrated with **NoSQL databases** such as **MongoDB** and **DynamoDB** to efficiently handle large datasets, achieving a **40%** increase in retrieval speeds compared to traditional SQL.\nImplemented **Docker** containers for application deployment, leading to a **25%** decrease in environment setup time.\nEstablished **CI/CD pipelines** in **GCP**, enabling automated testing and deployment processes that reduced release times by **50%.**\nLeveraged in-memory data stores like **Redis** to dramatically accelerate data access for critical functionalities, decreasing latency by **70%**.\nCollaborated closely with cross-functional teams to gather requirements and deliver features that align with user needs through effective communication and **collaboration** practices.\nDesigned algorithms and software architecture frameworks that improved system scalability to handle future growth projections by **200%**.\nConducted thorough unit and integration testing using **JUnit** with a coverage rate of over **85%** to ensure reliability and minimize bugs at launch.\nCreated comprehensive documentation for all backend systems, facilitating smoother handovers and onboarding processes for team members."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, Python, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tSpring Framework, Spring Boot, NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, GCP\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, NoSQL databases, Vector DBs, Qdrant, FAISS, Pinecone\n\n**DevOps**\n\tDocker, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tAWS, Azure, GCP\n\n**Other**\n\tTest-Driven Development, NUnit, JUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Redis, Apache Kafka, RabbitMQ, collaboration, communication, algorithms, software architecture"
}