{
  "name": "Rei Taro",
  "role_name": "Senior QA Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Detail-oriented Senior QA Engineer with over 10 years of experience in ensuring the quality and performance of backend systems and APIs. Proficient in **Web Testing**, **Mobile Testing**, and **API** testing methodologies to deliver robust and reliable applications. Skilled in using **TestRail**, **Jira**, and **Git** for test management and bug reporting, with an in-depth understanding of **SDLC** and **STLC** processes. Experienced in implementing **A/B Testing**, alongside leveraging **SQL** for data validation and analysis. A solid background in automation testing and a strong commitment to quality assurance, having successfully contributed to significant projects in esteemed organizations like VISA, Sii Poland, and Reply Polska, utilizing a tech stack that includes **Python** and **Cloud Services (AWS, Azure)**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Executed comprehensive **Web Testing** and **Mobile Testing** strategies to ensure the robustness and reliability of applications across multiple platforms.\nUtilized **TestRail** for effective test case management, enabling systematic tracking and reporting of testing progress and outcomes.\nImplemented **Jira** for agile project management, facilitating sprint planning and bug tracking, resulting in a **25%** increase in issue resolution speed.\nEngaged in the entire **SDLC** and **STLC** processes, ensuring alignment with business requirements and quality standards throughout the software development lifecycle.\nConducted detailed **Bug Reporting** and documentation, ensuring transparent communication of defects and adherence to quality benchmarks.\nDesigned and executed **A/B Testing** scenarios to evaluate feature effectiveness and drive data-driven decision-making for product enhancements.\nLeveraged **Git** for version control and collaboration, managing code changes with precision and facilitating team workflows.\nExecuted SQL queries for data validation, ensuring the integrity of backend systems and accurate data reporting.\nIntegrated and tested various **API** services to ensure seamless interaction between applications, contributing to a more cohesive user experience.\nAutomated testing processes to improve efficiency, utilizing cutting-edge frameworks and tools to streamline the QA workflow."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Conducted rigorous Web Testing and Mobile Testing to ensure software quality and functionality across **versions 1.0** and above of all applications.\nUtilized **TestRail** and **Jira** for effective Bug Reporting and tracking throughout the Software Development Life Cycle (**SDLC**) and Software Testing Life Cycle (**STLC**), enhancing collaboration and communication with development teams by **30%**.\nImplemented Automation strategies in testing processes, resulting in a **25%** reduction in overall testing time and elevating efficiency in A/B Testing scenarios.\nManaged and maintained version control using **Git**, facilitating seamless integration and deployments of various testing frameworks and required tools.\nExecuted SQL queries to validate and analyze data integrity, ensuring that database updates comply with business requirements.\nDeveloped and improved testing APIs to enhance integration testing capabilities, resulting in better debugging processes and reliability of applications.\nCollaborated closely with product and engineering teams to review software specifications and develop comprehensive testing plans aligned with business objectives."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented automated testing strategies for REST APIs and WebSocket channels ensuring high-quality performance and compliance with SDLC and STLC methodologies.\nConducted rigorous **Web Testing** and **Mobile Testing** for the trading platform using **TestRail** and **Jira** to effectively track and report bugs, achieving a **95%** bug resolution rate within the first **48 hours** of discovery.\nCollaborated with development teams to ensure effective integration of automated tests into the CI pipeline, utilizing **Git** for version control, enhancing team productivity by **30%**.\nDesigned and executed comprehensive A/B tests on user interactions, utilizing insights to guide product enhancements and improve user experience by **25%**.\nDeveloped and maintained SQL queries and database test cases to validate data integrity and compliance, achieving a **100%** success rate in data validation for critical financial reports.\nUtilized **Automation** frameworks and tools to speed up testing cycles, reducing overall testing time by **40%** through streamlined QA processes.\nParticipated in backlog grooming sessions, providing insights into potential testing issues and feature enhancements based on **Bug Reporting** metrics and team observations."
    }
  ],
  "skills": "****Programming Languages****\n\tPython (3.8+), SQL, JavaScript\n\n****Backend Frameworks****\n\tFastAPI, Flask, Django, Celery\n\n****Frontend Frameworks****\n\t\n\n****API Technologies****\n\tREST/gRPC APIs, API\n\n****Serverless and Cloud Functions****\n\tAWS (EC2, S3, Lambda), Azure\n\n****Databases****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps****\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps\n\n****Cloud & Infrastructure****\n\t\n\n****Other****\n\tWeb Testing, Mobile Testing, TestRail, Jira, SDLC, STLC, Bug Reporting, A/B Testing, Automation, CI/CD, PyTest, Git, Kafka, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow",
  "apply_company": "OBRIO"
}