{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior PHP Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior PHP Engineer with 10+ years of experience in delivering high-performance software solutions, specializing in **PHP**, **Laravel**, and **MySQL**. Adept at developing robust **RESTful APIs** and proficient in **JavaScript**, **HTML5**, and **CSS3**. Strong background in **Agile** methodologies, **CI/CD** practices, and code review processes, ensuring high-quality outputs through effective communication and teamwork. Skilled in problem-solving and driving collaboration across teams to achieve technical objectives. Experienced in leveraging modern technologies, including **JavaScript/TypeScript**, **Flutter**, and cloud services such as **Azure** and **AWS**, while maintaining a security-focused approach compliant with standards like HIPAA and PCI DSS. Passionate about creating solutions that forge significant real-world impacts.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained scalable web applications using **PHP** and **Laravel**, ensuring efficient data handling with **MySQL** and adherence to **RESTful API** principles.\n•\tCollaborated with cross-functional teams in an **Agile** environment, leveraging strong **communication** and **teamwork** skills to deliver high-quality solutions on time.\n•\tImplemented robust CI/CD pipelines using **Git** for version control, enhancing code management and facilitating regular **code reviews** to ensure code quality across projects, resulting in a **30% reduction** in deployment issues.\n•\tDesigned dynamic user interfaces with **JavaScript**, **HTML5**, and **CSS3**, optimizing for speed and responsiveness while ensuring cross-browser compatibility.\n•\tProactively identified and solved complex technical problems, employing critical **problem-solving** techniques that improved system performance by up to **25%**.\n•\tEngaged in comprehensive testing strategies, utilizing tools and libraries to ensure high reliability in both front-end and back-end services.\n•\tMentored junior developers in best practices for software development, fostering a collaborative learning environment and enhancing team productivity by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Designed and implemented RESTful APIs in **PHP (Laravel)**, ensuring seamless integration with front-end applications and optimizing performance for high-volume web interactions.\nUtilized **MySQL** for robust database management and query optimization, significantly enhancing data retrieval times by **25%**.\nCollaborated with cross-functional teams in an **Agile** environment, driving project timelines and fostering effective communication to achieve **95%** on-time delivery rate.\nConducted code reviews and implemented best practices for **Git** version control, promoting a culture of quality and accountability among team members.\nDeveloped interactive user interfaces using **JavaScript, HTML5, and CSS3**, delivering a responsive design that improved user engagement rates by **30%**.\nImplemented CI/CD pipelines to streamline deployment processes, reducing release times by **40%** and enhancing overall system reliability.\nDemonstrated strong problem-solving skills by proactively identifying and resolving technical issues, ensuring minimal disruption to business operations.\nEncouraged teamwork through mentorship and knowledge sharing, contributing to an uplift in team productivity metrics by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and maintained full-fledged web applications using **PHP** and **Laravel**, delivering robust and scalable solutions tailored for diverse business needs.\nEngineered RESTful APIs that securely connect front-end interfaces to back-end systems, optimizing data retrieval and interactions for a seamless user experience.\nManaged database design and optimization with **MySQL**, ensuring high performance and reliability in handling large datasets and transactions.\nUtilized **Git** for version control, enabling efficient collaboration, code reviews, and maintenance of the codebase in a team-centric environment.\nApplied Agile methodologies to streamline project workflows, fostering effective communication and teamwork across cross-functional teams, resulting in a 30% improvement in project delivery times.\nImplemented CI/CD pipelines for automated testing and deployment, reducing time-to-market for new features by **25%** while maintaining high software quality.\nLeveraged **JavaScript**, **HTML5**, and **CSS3** to create responsive and interactive user interfaces that enhance user engagement and accessibility.\nProvided thorough code reviews and mentorship for junior developers, enhancing team skills and promoting best practices in coding standards and design principles.\nUtilized strong problem-solving skills to troubleshoot and resolve critical issues, maintaining application uptime and performance metrics above **99.9%**.\n"
    }
  ],
  "skills": "Programming Languages:\n\tPython, PHP, JavaScript, TypeScript\n\nBackend Frameworks:\n\tFastAPI, Flask, Django, Laravel\n\nFrontend Frameworks:\n\tReact, Vue, Angular, HTML5, CSS3\n\nAPI Technologies:\n\tRESTful API\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\nDatabases:\n\tPostgreSQL, MySQL, MongoDB, Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\tGit\n\nOther:\n\tAgile, code review, problem-solving, communication, teamwork, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow",
  "apply_company": "Imploy"
}