{
  "name": "Tomasz Lee",
  "role_name": "Senior Data Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Senior Data Engineer with 9+ years of experience in software troubleshooting, user support, and problem-solving. Excellent interpersonal and communication skills, facilitating effective team collaboration. Proven track record in delivering robust data solutions and optimizing application performance using programming expertise. Technically proficient in **.NET**, **C#**, and proficient in utilizing data pipeline tools. Strong analytical abilities to derive insights from complex data sets while maintaining user-friendly interactions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized advanced **Excel** functionalities for data analysis and reporting, enhancing the overall data-driven decision making process.\nImplemented software troubleshooting techniques to identify and resolve issues in data pipelines, improving system reliability by **30%**.\nProvided user support for analytics tools, ensuring seamless access to data and insights for teams across the organization.\nCollaborated effectively with cross-functional teams, leveraging interpersonal and communication skills to ensure alignment on project goals and requirements.\nDeveloped and maintained optimal data flows, applying problem-solving strategies to enhance data quality and accessibility.\nDemonstrated team collaboration in deploying data solutions, ensuring adherence to the highest standards of data governance.\nAnalyzed macroeconomic trends to support data-driven strategies, informing key business decisions.\nDesigned and implemented **CI/CD pipelines** on Azure DevOps, contributing to a **40%** reduction in deployment time for data solutions.\nOptimized SQL database queries, achieving a **20%** improvement in average query execution time, thereby enhancing data retrieval speed and efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Utilized **Excel** for data analysis and reporting to support project metrics, enhancing decision-making processes.\n• Leveraged strong **interpersonal skills** to ensure clear **communication** with cross-functional teams, promoting effective **team collaboration**.\n• Applied **problem-solving** skills to troubleshoot software issues and enhance user support solutions, ultimately improving user satisfaction by 20%.\n• Designed and developed a cloud-based project management tool using **Angular** and **.NET Core**, leading to a **15% increase** in team collaboration efficiency.\n• Created a microservices architecture with **RabbitMQ** for task orchestration and **Apache Kafka** for handling event-driven data streams, enhancing system scalability.\n• Integrated **Redis** as a caching layer to reduce latency in frequent API calls, resulting in a **25% boost** in system performance.\n• Developed **RESTful APIs** with **.NET Core** and integrated with a **PostgreSQL** database for real-time data access.\n• Built and maintained **ReactJS** and **Tailwind CSS** components, resulting in a **25% improvement** in user engagement on the platform.\n• Led the effort to implement **CI/CD pipelines** using **GitHub Actions**, reducing production deployment errors by **30%**.\n• Managed **MSSQL** and **MySQL** databases for data storage and retrieval, optimizing queries for better performance.\n• Collaborated closely with stakeholders to define system requirements and development timelines, ensuring timely project delivery.\n• Created custom charts and graphs using **D3.js** for interactive project status tracking and reporting.\n• Conducted code reviews and mentorship sessions with junior developers, improving team productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and implemented software troubleshooting strategies to improve the internal CRM system using **.NET Framework** and **Angular**, leading to a **20%** boost in sales team productivity.\n• Provided user support to cross-functional teams by integrating a responsive feedback loop with automated solutions.\n• Enhanced team collaboration by creating a set of reusable **Angular** and **C#** components, accelerating future project timelines by **30%**.\n• Leveraged **SQL Server** to manage customer data effectively, optimizing query performance by **25%**.\n• Played a key role in migrating legacy systems from **ASP.NET WebForms** to **.NET Core**, achieving a **15%** improvement in system performance and maintainability.\n• Collaborated with the DevOps team to establish automated builds and releases in **Azure**, which reduced deployment times by **40%**.\n• Utilized effective interpersonal and communication skills to support integration with third-party APIs, enhancing system interoperability.\n• Improved user experience on the client-side dashboard through frontend enhancements using **Vue.js**.\n• Engaged in regular standups and code reviews to promote teamwork and ensure adherence to coding standards.\n• Delivered comprehensive technical documentation and user guides, facilitating improved knowledge transfer among teams."
    }
  ],
  "skills": "Programming Languages:\n\tPython\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tGit, GitHub, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design\n\n**Interpersonal Skills:**\n\tExcel, Macroeconomic, Software Troubleshooting, User Support, Communication Skills, Team Collaboration, Problem-Solving",
  "apply_company": "Experis Ireland"
}