{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of comprehensive experience in building high-performance applications, leveraging strong expertise in **Python**, **Docker**, **CI/CD**, and **GitLab CI**. Proficient in implementing automation and virtualization strategies, utilizing tools like **Jenkins**, **Grafana**, and **Kibana** to enhance system performance and monitoring. Demonstrated problem-solving skills and effective communication abilities for collaborating with cross-functional teams.\nAdditionally skilled in hands-on frontend and backend development using **JavaScript/TypeScript**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Expert in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and event-driven architectures. Extensive experience in compliance-driven development aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong background in MLOps and AI/ML-powered platforms, showcasing expert capabilities in model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** in the development of full-stack applications, enhancing system functionality and performance.\nImplemented **CI/CD** pipelines using tools like **Jenkins** and **GitLab CI**, streamlining the integration and deployment processes, ensuring rapid delivery to production environments.\nAutomated workflows through scripting in **Bash** and optimized infrastructure utilizing **Docker** for containerization and orchestration in **Linux** environments.\nLed problem-solving initiatives across development teams by applying innovative solutions and ensuring effective communication to resolve technical challenges.\nDeveloped and maintained efficient, automated testing strategies with **Allure** and integrated monitoring solutions using **Grafana** and **Kibana**, leading to a 20% increase in deployment success rates.\nManaged virtualization environments with **KVM**, improving resource allocation and system performance by 30%.\nDefined reliable networking strategies to ensure secure communication within distributed applications, facilitating seamless data exchange.\nFostered collaboration across departments for shared automation goals, optimizing project timelines and enhancing product delivery features.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** for developing scalable back-end services, ensuring efficient data processing and integration with various platforms.\nEmployed **Linux** for deploying and managing applications in a production environment, enhancing performance and reliability of software solutions.\nImplemented **Docker** to containerize applications, allowing for seamless integration and continuous deployment, reducing deployment times by **50%**.\nLeveraged **CI/CD** practices with **Jenkins** and **GitLab CI** to automate testing and deployment processes, improving software delivery timelines by **40%**.\nUtilized **Git** for version control, maintaining code integrity while collaborating effectively with team members.\nAutomated deployment processes using **Bash** scripts, increasing operational efficiency and minimizing manual errors by implementing best practices.\nApplied **KVM** virtualization technology to optimize server resources, ensuring high availability and scalability for applications.\nDeveloped troubleshooting skills to address complex networking issues, facilitating smooth communication between microservices in a distributed environment.\nUtilized monitoring tools such as **Grafana** and **Kibana** for performance analysis and logging, identifying opportunities for system enhancements.\nDemonstrated strong problem-solving skills in addressing application bugs and performance bottlenecks, resulting in improved user experiences and stakeholder satisfaction across projects."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Linux** for backend service design and optimization, ensuring robust functionality and deployment within a global e-commerce platform.\nEmployed **Docker** for containerization of applications, improving deployment efficiency and streamlining CI/CD processes with **Jenkins** and **GitLab CI** for a seamless development life cycle.\nAutomated testing and monitoring strategies using **Allure**, **Grafana**, and **Kibana** to maintain high-quality standards and visibility across service health, achieving a **99.9%** uptime across all applications.\nDemonstrated strong problem-solving skills by addressing high-priority issues quickly, resulting in a **30%** reduction in incident response time across the platform.\nImplemented virtualization best practices with **KVM**, enhancing resource utilization and system efficiency for application environments.\nConducted efficient brainstorming and communication sessions with cross-functional teams to articulate concepts and workflows for APIs interfacing with key services.\nAutomated troubleshooting processes using **Bash** scripts, reducing manual intervention in handling recurring issues by up to **25%**.\nManaged code versioning and collaboration using **GIT**, ensuring streamlined workflows for all development teams involved in ongoing projects.\nEnhanced networking capabilities for all deployed services, contributing to improved system performance and data handling for the e-commerce platform.\nFostered a culture of clean code practices and documentation, promoting team collaboration and knowledge sharing.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS; Azure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database\n\n **Other:**\n\tLinux, KVM, CI/CD, Allure, Grafana, Kibana, GIT, Bash, Networking, Virtualization, Automation, Problem-solving, Communication",
  "apply_company": "NVIDIA"
}