{
  "name": "Tomasz Lee",
  "role_name": "Senior Android Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled Senior Android Engineer with extensive experience in developing and implementing applications using **Android**, **Kotlin**, **Java**, and **Jetpack Compose**. Proficient in building robust Web Services and integrating APIs. Demonstrated expertise in **RxJava**, **Realm**, **Room**, and **Coroutines** to enhance mobile application efficiency and performance. Strong understanding of internationalization (i18n), localization (l10n), and accessibility standards. Adept at leveraging **Agile** methodologies to streamline development processes. With 9+ years in software development, I bring a solid record of delivering high-quality solutions and leading projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Android Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Led the development of Android applications utilizing **Kotlin** and **Java**, enhancing application performance and user experience.\nDesigned and implemented **Web Services** for seamless integration with backend systems and third-party APIs.\nUtilized **Jetpack Compose** for building responsive UI components, improving development efficiency by **30%**.\nIncorporated **RxJava** for asynchronous programming to streamline data flow within the application, enhancing responsiveness.\nImplemented **Coroutines** for efficient background processing, resulting in a **25%** increase in app performance.\nEnsured database integration through **Realm** and **Room**, providing efficient data management and synchronization.\nExecuted internationalization (i18n) and localization (l10n) practices using **XLIFF**, reaching a broader audience with **30%** increase in global users.\nAdopted Agile methodologies to ensure timely delivery of features, improving team productivity by **20%**.\nConducted accessibility audits to ensure compliance with standards, enhancing usability for all users.\nDeveloped and maintained documentation for API endpoints and services, ensuring clear communication with cross-functional teams."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and maintained Android applications using **Kotlin** and **Java**, ensuring best practices to enhance app performance and user experience.\nDesigned and implemented user interfaces with **Jetpack Compose**, resulting in a more modern look and feel, improving user engagement by 20%.\nBuilt robust **Web Services** and integrated various APIs for seamless data exchange, achieving a **30% reduction in response time**.\nUtilized **RxJava**, **Coroutines**, and **Realm** for efficient data handling and asynchronous programming, enhancing app responsiveness.\nExecuted localization and internationalization strategies using **i18n** and **XLIFF**, leading to a **15% increase in user retention** across diverse markets.\nFocused on accessibility standards to improve overall accessibility, contributing to a more inclusive application environment.\nEmployed Agile methodologies to streamline development processes, improving project turnaround time by **25%**.\nCollaborated with cross-functional teams to gather project requirements and deliver high-quality software on schedule.\nConducted regular code reviews and provided mentorship to junior developers, fostering a culture of continuous improvement and skill development.\nOptimized database interactions through the implementation of **Room** for data persistence, enhancing query performance and reducing load times by **20%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed applications using **Android**, **Kotlin**, and **Java**, ensuring high-performance and user-friendly solutions.\nUtilized **Jetpack Compose** to create modern UI components, improving user engagement by 30% with an intuitive design.\nImplemented **Web Services** and **APIs** for seamless integration with back-end systems, enhancing data retrieval speeds by 25%.\nLeveraged **RxJava** and **Coroutines** for asynchronous programming, resulting in smoother app navigation and reduced latency.\nIncorporated **Room** and **Realm** for efficient local data storage, achieving a 40% reduction in read/write times for user data.\nApplied **i18n** and **l10n** strategies to localize applications, expanding market reach to 5 new countries.\nMaintained high standards of **Accessibility** in app development, ensuring compliance with WCAG 2.1 guidelines.\nContributed to Agile practices through participation in sprint planning, daily standups, and retrospectives, fostering a collaborative team environment.\nDelivered documentation and user guides for all developments, enhancing team knowledge and onboarding processes by 20%."
    }
  ],
  "skills": "Frontend Frameworks:\n\t**HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS**\n\nBackend Frameworks:\n\t**NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices**\n\nAPI Technologies:\n\t**RESTful API, GraphQL, Web Services, API**\n\nDatabases:\n\t**MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Realm, Room**\n\nProgramming Languages:\n\t**Python, Kotlin, Java, Solidity**\n\nServerless and Cloud Functions:\n\t**Cloud, AWS, Azure**\n\nDevOps:\n\t**CI/CD pipelines**\n\nCloud & Infrastructure:\n\t**Cloud**\n\nOther:\n\t**UX/UI Design, Git, GitHub, Agile, RxJava, Coroutines, i18n, l10n, XLIFF, Accessibility, Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest**",
  "apply_company": "GlobalLogic"
}