{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Consultant",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a versatile **Full Stack Developer** with 8 years of experience, I excel in delivering high-performance solutions in decentralized systems leveraging my extensive knowledge of **Solidity**, **EVM chains**, and **Smart contract architecture**. My technical expertise includes **cryptography**, consensus mechanisms, and vulnerability hunting, reinforced by hands-on experience with tools such as **MythX**, **Slither**, **Hardhat**, and **Foundry**.\n\nI have a proven track record in implementing and consulting on protocols related to **DeFi**, **tokenomics**, and cross-chain bridging, ensuring robust and secure applications that align with compliance standards. My background in cloud services spans **AWS**, **Azure**, and **GCP**, enabling seamless API integration and upgradability.\n\nIn addition to my technical skills, I’m committed to continuous learning and effective client communication, equipped to conduct risk assessments and contribute to the growth of decentralized applications through well-planned multi-chain deployments. I also bring extensive knowledge of **CI/CD automation**, microservices architecture, and machine learning integrations, enabling me to drive innovation and efficiency in all projects.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Consultant",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Provided technical consulting on **solidity** and **EVM chains** for clients initiating **smart contract architecture** for blockchain applications, ensuring compliance with industry standards \n- Conducted vulnerability assessments and risk analysis leveraging tools like **MythX** and **Slither**, identifying potential security weaknesses in smart contracts \n- Designed and implemented decentralized systems by architecting smart contracts with **cryptography** principles ensuring data integrity and secure transactions \n- Collaborated with stakeholders to integrate APIs effectively into the blockchain solutions, achieving seamless communication and functionality across platforms \n- Developed multi-chain deployment strategies overseeing projects that utilized **cross-chain bridging** techniques to enhance interoperability \n- Executed formal verification processes for smart contracts to ensure accuracy and minimize deployment errors, leading to a **100% compliance** rate in audits \n- Employed **Hardhat**, **Foundry**, and **Truffle** frameworks for building, testing, and deploying smart contracts while streamlining development workflows \n- Facilitated continuous learning and client communication, providing in-depth training sessions on **tokenomics** and **DeFi protocols** to enhance client understanding of blockchain ecosystems \n- Spearheaded the use of **zero-knowledge proofs** to enhance transaction privacy, significantly improving client confidence in data sharing across decentralized applications \n- Managed large-scale migrations to **GCP**, **AWS**, and **Azure**, resulting in a **30% improvement** in application performance and reduced latency \n- Implemented strategies for governance and upgradability of smart contracts, ensuring clients can adapt to evolving market demands without disrupting operations \n- Contributed to technical specifications for projects involving **The Graph**, optimizing data retrieval and query performance across decentralized networks."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided **technical consulting** on the development of decentralized financial platforms, leveraging core **skills** such as **Solidity**, **EVM chains**, and **smart contract architecture** to ensure high-quality deliverables.\nConducted **risk assessment** and **vulnerability hunting** through tools like **MythX**, **Slither**, and **formal verification**, enhancing system security for **DeFi protocols**.\nArchitected **multi-chain deployment** strategies and implemented **cross-chain bridging** solutions, promoting seamless interoperability for financial applications across various blockchains.\nDesigned and developed smart contracts on **Hardhat** and **Foundry**, adhering to best practices for **upgradability** and **tokenomics**, effectively enhancing project sustainability and scalability.\nIntegrated decentralized systems with existing financial infrastructures, focusing on **API integration** to enable smooth communication between traditional and blockchain-based platforms.\nEngaged in **client communication** ensuring continuous feedback and alignment with project objectives, facilitating a smooth consulting experience and fostering long-term relationships.\nExecuted implementation of **zero-knowledge proofs** for enhanced privacy in transactions, employing the latest cryptographic techniques to build trust and security in financial solutions.\nMaintained a culture of **continuous learning**, staying updated on the latest trends and technologies within the blockchain sector, ensuring competitive consulting practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Provided **technical consulting** on **Smart contract architecture** and **API Integration** strategies for blockchain solutions, ensuring alignment with industry best practices and client requirements.\nEngaged in **vulnerability hunting** and auditing of smart contracts using tools such as **MythX**, **Slither**, and **Remix**, identifying and mitigating risks to enhance security and compliance with **GDPR** standards.\nConducted **risk assessment** workshops for clients, applying **cryptography** principles and evaluating **decentralized systems** to build robust project frameworks addressing **Tokenomics** and *upgradability* concerns.\nUtilized **Hardhat, Foundry**, and **Truffle** for developing and testing smart contracts, ensuring reliability and performance under various conditions through frameworks like **EVM chains**.\nImplemented cross-chain bridging strategies, leveraging **The Graph** for efficient data retrieval and management, facilitating seamless interactions between different blockchain networks.\nEmployed cloud services such as **GCP**, **AWS**, and **Azure** for deploying and managing decentralized applications (dApps), ensuring scalability and availability across multiple environments.\nFacilitated continuous learning sessions with clients on **zero-knowledge proofs** and **DeFi protocols**, enhancing their understanding of innovative blockchain technologies and consensus mechanisms.\nOptimized smart contract workflows and ensured **multi-chain deployment** strategies were executed correctly to reduce transaction costs by up to **30%**, improving overall efficiency in contract execution.\nMaintained strong **client communication** throughout project phases, focusing on timely project delivery and aligning client expectations with project milestones using an Agile approach."
    }
  ],
  "skills": "Programming Languages:\n\tSolidity, Python(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tNone\n\n**Frontend Frameworks:**\n\tNone\n\n**API Technologies:**\n\tAPI Integration\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\tCryptography, Consensus, Decentralized systems, Vulnerability hunting, MythX, Slither, Formal verification, Hardhat, Foundry, Truffle, Remix, The Graph, Technical consulting, Tokenomics, Upgradability, Risk assessment, Continuous learning, Client communication, Zero-knowledge proofs, DeFi protocols, Cross-chain bridging, Multi-chain deployment"
}