{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Applications Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Applications Engineer, I bring 8 years of experience in the machinery and manufacturing sectors, leveraging my skills in **CNC** programming, **Zerspanungsprozesse** optimization, and **Werkzeugsysteme** development to deliver high-performance applications. I have a proven track record of applying **MS Office** and **SAP** tools to streamline processes and enhance customer service capabilities. My expertise extends to developing user-friendly applications to improve after-sales support. I excel in technical communication, fluently handling English to facilitate effective collaboration in diverse teams. My strong analytical and problem-solving skills enable me to implement innovative solutions that align with industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Applications Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged **CNC** technology to optimize **machining processes** for high-precision applications, ensuring adherence to the highest standards of engineering excellence in **machine construction**.\n- Developed and implemented **tool systems** that enhanced workflow efficiency, utilizing **SAP** for comprehensive project tracking and resource management, leading to a **20%** reduction in production costs.\n- Conducted rigorous after-sales service and customer support to troubleshoot and resolve issues, achieving a **95%** customer satisfaction rate.\n- Created impactful presentations using **MS Office** and **PowerPoint** to communicate project status and technical specifications to stakeholders, ensuring clarity and alignment.\n- Utilized fluency in **English** to collaborate effectively with diverse teams and provide technical guidance, enhancing team performance in multinational environments.\n- Streamlined customer service processes by integrating feedback mechanisms that resulted in a **30%** increase in service efficiency and response times.\n- Delivered **training sessions** for clients on the effective use of **machinery** and **work systems**, enhancing user competency and satisfaction.\n- Collaborated with engineering teams to design and refine mechanical systems, ensuring compliance with **Zerspanungsprozesse** to enhance production capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Focused on optimizing and enhancing CNC and Zerspanungsprozesse through effective applications and tools, utilizing data analysis to improve performance and efficiency.\nCollaborated with cross-functional teams to design and implement Werkzeugsysteme, ensuring smooth integration with existing machinery, which resulted in a **15%** increase in operational efficiency.\nProvided exceptional Customer Service as a Senior Applications Engineer, assisting clients with troubleshooting and providing solutions, contributing to a **25%** reduction in after-sales support requests.\nConducted technical training sessions using **MS Office** and **PowerPoint** to educate customers on the functionality of machinery and applications, increasing user adoption and satisfaction levels by **30%**.\nUtilized **SAP** to manage project timelines, resources, and documentation, resulting in improved project delivery efficiency by **20%**.\nDeveloped a comprehensive strategy for after-sales support, enhancing customer relationships and driving repeat business, achieving a **40%** increase in customer retention rates in the past year.\nMaintained a high level of proficiency in English to communicate technical information effectively to a diverse clientele, enhancing international collaboration and understanding."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Leveraged expertise in **MS Office** and **PowerPoint** to create detailed presentations and reports, enhancing communication across teams and showcasing project progress effectively.\n- Applied practical knowledge of **CNC** and **Zerspanungsprozesse** in the design and optimization of applications, ensuring precision in manufacturing processes and improved engineering workflows.\n- Utilized **SAP** for efficient project tracking and resource management, leading to a **20%** reduction in project turnaround time.\n- Engaged in **Customer Service** and **After-Sales** support, ensuring client satisfaction and addressing technical inquiries, thereby achieving a **95%** customer satisfaction rate.\n- Collaborated with cross-functional teams to understand client needs and develop tailored applications that streamline manufacturing operations.\n- Assisted in the maintenance and upgrading of tools and systems, contributing to continuous improvement initiatives that align with modern engineering standards.\n- Conducted training sessions on new applications and tools for engineering staff, boosting overall team productivity by an estimated **15%**.\n- Developed process documentation and operational manuals to ensure knowledge transfer and consistency in team practices, reducing onboarding time by **30%**."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tNone\n\n **Serverless and Cloud Functions:** \n\tAWS Lambda\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CNC, Zerspanungsprozesse, Werkzeugsysteme, Maschinenbau, MS Office, SAP, PowerPoint, English, Customer Service, After-Sales",
  "apply_company": "Kennametal"
}