{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Software Engineer with 8 years of experience specializing in **Python**, **FastAPI**, **PostgreSQL**, **Docker**, **Kubernetes**, and **AWS**. I have a proven track record of building and deploying high-performance, reliable, and reproducible applications in compliance with industry standards. My focus on **CI/CD**, **unit testing**, **automated quality assurance**, and **integration testing** ensures the delivery of robust solutions that meet strict reliability metrics.\nI bring a comprehensive background in full-stack development, leveraging **JavaScript**, **TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** to create scalable and secure applications. My deep cloud experience with **AWS** and **Azure** supports the development of enterprise-grade platforms. Additionally, I have expertise in designing microservices architectures and deploying machine learning models, incorporating frameworks like **MLflow**, **Airflow**, and **Kubeflow** for MLOps workflows. I excel at integrating advanced technologies, such as AI/ML capabilities, to drive predictive analytics and intelligent automation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained scalable applications using **Python** and **FastAPI**, ensuring high reliability and reproducibility in deployment and operations.\n- Designed and optimized data storage solutions with **PostgreSQL** and **Redis**, adhering to best practices for data integrity and performance.\n- Implemented containerization and orchestration strategies utilizing **Docker** and **Kubernetes**, increasing application scalability and deployment efficiency.\n- Established robust CI/CD pipelines integrating automated quality assurance practices, enabling rapid and reliable delivery of features across various environments.\n- Executed comprehensive unit testing, integration testing, and reliability testing strategies, ensuring high code quality and software robustness.\n- Led initiatives to ensure compliance with industry standards, enhancing system reliability and performance metrics.\n- Collaborated in Agile teams, delivering projects on time while maintaining high coding standards and architecture integrity.\n- Participated in extensive code reviews and mentoring of junior developers, fostering a culture of continuous improvement and knowledge sharing.\n- Drove the migration of legacy systems to microservices, improving system resilience and modularity for future development.\n- Coordinated with cross-functional teams to integrate user feedback into product development, resulting in improved user satisfaction and engagement."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** (with **FastAPI**) and **PostgreSQL** for back-end development, ensuring high reliability and reproducibility in financial applications.\nImplemented containerization using **Docker** and orchestration with **Kubernetes** to enhance deployment processes and streamline CI/CD workflows, achieving deployment times reduced by **30%**.\nPerformed rigorous **unit testing**, **integration testing**, and automated quality assurance to maintain code standards and reliability in financial systems, resulting in a **15%** decrease in production bugs.\nIntegrated **Redis** for caching solutions, accelerating data retrieval times and significantly improving application performance by **25%**.\nCollaborated on the development of high-volume transaction systems with dynamic front-end applications using cutting-edge technologies such as React (18), Vue 3, and Next.js, applying best practices to create user-friendly interfaces.\nDesigned and maintained financial dashboards utilizing **D3.js** and **Power BI Embedded**, enabling real-time monitoring and alerting for financial activities while driving actionable insights for operational teams.\nDeveloped and orchestrated complex ETL pipelines leveraging **Python**, **Apache Airflow**, and **Azure Data Factory** to facilitate seamless data ingestion from various sources, concurrently managing both batch and real-time processes.\nExecuted AI/ML enhancements for fraud detection systems, employing libraries like **scikit-learn** and **XGBoost**, thus proactively addressing suspicious activities in transactions to enhance banking security."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** with **FastAPI** for developing high-performance backend services, ensuring reliability and reproducibility across core e-commerce functionalities like checkout, cart, and order fulfillment.\nLeveraged **PostgreSQL** and **Redis** for distributed data storage and caching mechanisms, enhancing application scalability and performance by reducing response times by up to **40%** during high traffic events.\nImplemented containerization with **Docker** and orchestrated deployments using **Kubernetes**, ensuring seamless CI/CD practices for rapid feature delivery and rollbacks.\nExecuted automated quality assurance processes, including unit testing and integration testing methodologies, guaranteeing up to **99.9%** functional reliability in production environments.\nEngaged in performance optimization strategies leading to reduced latency by **30%** using advanced caching techniques and event-driven architectures.\nCollaborated on designing cloud infrastructure components on **AWS** to ensure high availability and disaster recovery capabilities for mission-critical services.\nEnhanced system security with role-based access control (RBAC) and **OAuth 2.0**, ensuring compliance with GDPR and protecting user data across the platform.\nFostered reproducibility in development through comprehensive documentation and code review practices, aiming to improve team productivity and knowledge sharing."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI\n\n **Databases:**\n\tPostgreSQL\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\n **Cloud & Infrastructure:**\n\tAWS\n\n **Other:**\n\tCI/CD\n\tunit testing\n\tautomated quality assurance\n\tintegration testing\n\treliability\n\treproducibility\n\n**Frameworks & Technologies:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **Artificial Intelligence & Machine Learning:**\n\tMLflow, Airflow, Kubeflow\n\n **Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Databases & Caching:**\n\tMySQL (Healthcare), MongoDB (Gaming), Redis\n\n **CI/CD & Infrastructure as Code:**\n\tGitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose",
  "apply_company": "blackshark.ai"
}