{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Backend Engineer with 10+ years of experience specializing in **Node.js**, **TypeScript**, and **PostgreSQL**. Proficient in designing and implementing **event-driven systems** and **clean architectures** that enhance application performance and maintainability. Strong expertise in testing strategies and domain-driven design, ensuring high-quality deliverables while adhering to best practices.\nDemonstrated ability to collaborate effectively across teams, mentoring junior developers and fostering a positive team environment. Brings a proven track record of building secure applications that meet stringent compliance standards, with hands-on experience in **JavaScript**, **Python**, and **cloud-native technologies** on **Azure** and **AWS**. A dedicated professional with a passion for driving impactful solutions in complex environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDemonstrated **backend expertise** by designing and implementing scalable, full-stack solutions for healthcare and finance utilizing **TypeScript**, **Node.js**, and modern architectures ensuring regulatory compliance.\n•\tUtilized **PostgreSQL** for developing cloud-native data architecture optimized for large-scale data processing and querying, achieving efficient performance in healthcare and financial applications.\n•\tApplied **clean architectures** principles to lead the re-architecture of monolithic applications into microservices-based ecosystems, leveraging **Docker** and **Kubernetes (AKS/EKS)** for improved maintainability and deployability.\n•\tEstablished comprehensive **testing strategies** across front-end and backend services, effectively using Jest, Cypress, PyTest, and Postman to achieve 100% unit and integration test coverage.\n•\tCollaborated with cross-functional teams effectively, enhancing **collaboration** and **communication** across development and operations, contributing to a cohesive development environment.\n•\tMentored junior team members in best practices of **domain-driven design**, aiding in their professional growth and aligning team efforts to project goals.\n•\tDeveloped advanced event-driven systems using industry-standard frameworks, ensuring prompt and reliable system interactions in various applications.\n•\tFacilitated the deployment of enterprise-level **DevOps** pipelines using **GitHub Actions** and **Azure DevOps**, achieving continuous integration and delivery cycles of less than **2 hours**.\n•\tImplemented cutting-edge functionalities by integrating AI-based features into applications, leveraging data science tools and frameworks to achieve exceptional user experiences.\n•\tDelivered insights through complex financial data visualization tools utilizing **D3.js**, achieving real-time insights into transaction trends and reducing fraud detection times by **30%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Demonstrated **Backend expertise** through the development of scalable financial platforms leveraging a microservices-based architecture with **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, resulting in a **30% increase** in transaction throughput.\n• Utilized **TypeScript** in conjunction with **React (18)**, **Vue 3**, and **Next.js** to build user-focused front-end applications, enhancing user experience by **25%** on financial dashboards and admin portals.\n• Championed the implementation of **Event-driven systems** using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, significantly improving asynchronous communication and real-time event processing for **over 1 million transactions** daily.\n• Applied **PostgreSQL** in the development of robust data solutions to store and manage financial data, ensuring a **99.9% uptime** and reliability for critical operations.\n• Executed **Clean architectures** and established **Testing strategies** to maintain high code quality across applications, with unit and integration tests achieving **85%** coverage.\n• Implemented **Domain-driven design** to foster collaboration and streamline project workflows, facilitating effective communication among cross-functional teams.\n• Provided **Mentorship** to junior developers, promoting best practices in coding and system design, leading to a **40% improvement** in their development speed and output quality."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Leveraged **Node.js** (NestJS, Express) and **TypeScript** to design and optimize backend services, ensuring high availability, low latency, and scalability for a global e-commerce platform with over **100,000** daily transactions.\n• Engineered robust event-driven systems using **Kafka** and **RabbitMQ**, enabling real-time order updates and customer support, which resulted in a **30%** increase in customer satisfaction rates.\n• Developed and maintained clean architectures to facilitate high-quality code and improve overall system performance across various backend services.\n• Collaborated with cross-functional teams to implement testing strategies, enhancing software reliability and reducing bug reports by **25%**.\n• Integrated **PostgreSQL** alongside **MongoDB**, **Redis**, and **Cassandra** for efficient distributed data management, successfully handling spikes in traffic during peak sales events, and achieving **99.9%** uptime.\n• Conducted mentorship sessions for junior developers, fostering a collaborative work environment and promoting best practices in backend development and design.\n• Actively participated in regular communication with stakeholders to align backend development efforts with business objectives and ensure timely delivery of features.\n• Practiced domain-driven design principles to elevate the overall architecture quality, which led to a **40%** reduction in development time for new features.\n"
    }
  ],
  "skills": "**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django), Node.js\n\n**Programming Languages:**\n\tJavaScript/TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Event-driven systems, Clean architectures, Testing strategies, Domain-driven design, Collaboration, Communication, Mentorship"
}