{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Sales Engineer with 13+ years of experience in delivering high-performance applications, adept in fostering client relationships and enhancing sales processes. Exceptional communication skills in both English and Italian, partnered with strong teamwork and autonomy capabilities to drive performance and collaboration. Proven ability to manage and utilize tools such as **SAP** and **MS Office** for effective sales strategies. \n\nOriginal strengths include expertise in **JavaScript/TypeScript**, **Python**, and **Flutter** for software development, along with robust experience in frontend and backend technologies including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I possess a solid understanding of deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and CI/CD pipelines. My background in building AI/ML-powered platforms supports innovative solutions that align with healthcare and financial industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Demonstrated exceptional **communication** skills by effectively conveying technical concepts to both technical and non-technical stakeholders, ensuring alignment on project objectives and sales strategies.\n• Collaborated with cross-functional teams to foster **teamwork**, contributing to successful sales presentations and client engagements.\n• Leveraged **MS Office** tools for preparing compelling presentations and reports, highlighting sales performance and product features.\n• Exercised autonomy by managing the sales pipeline independently, identifying potential clients and driving the sales process to closure.\n• Facilitated discussions in both **Italian** and **English**, enhancing client relations and expanding market reach.\n• Provided technical support during sales calls, showcasing deep understanding of products and conducting live demonstrations of software solutions.\n• Acted as a liaison between engineering and sales teams, translating client feedback into actionable recommendations for product improvements.\n• Trained new sales team members on product offerings and effective sales techniques, promoting knowledge-sharing and continuous improvement.\n• Conducted market research and competitor analysis to inform sales strategies and identify emerging opportunities within the industry."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed strong communication and teamwork skills by collaborating with cross-functional teams to create customized financial solutions that meet client needs.\n- Maintained high levels of autonomy while managing multiple sales processes, demonstrating a robust understanding of sales strategies and client engagement.\n- Utilized advanced skills in *MS Office* to prepare compelling sales presentations and reports, contributing to a **20%** increase in client engagement.\n- Demonstrated proficiency in managing projects that incorporated *SAP* for financial process optimization, leading to a **15%** improvement in operational efficiency.\n- Independently managed client relationships and presented complex technical solutions in *Italian* and *English*, fostering trust and long-term partnerships with **30+** clients.\n- Employed strong negotiation skills to drive sales initiatives and close deals, resulting in a **25%** increase in annual revenue.\n- Delivered product demonstrations and technical support, ensuring prospective clients understand the full capabilities of the offered solutions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **SAP** for managing sales processes and optimizing inventory workflows, ensuring efficient backend operations directly correlated with sales performance.\nDemonstrated strong **communication** skills while liaising with clients, providing technical insights and support to enhance customer satisfaction and retention rates.\nFostered **teamwork** by collaborating with cross-functional teams to align technical solutions with sales strategies, contributing to a **20% increase** in overall sales metrics over **12 months**.\nExercised **autonomy** in identifying sales opportunities and developing tailored proposals using **MS Office** tools, resulting in a **15% improvement** in proposal conversion rates.\nConducted product demonstrations and training sessions in both **Italian** and **English**, enhancing client engagement and understanding of the solutions offered.\nCreated detailed reports and presentations using **MS Office**, showcasing sales forecasts and strategies to stakeholders, improving decision-making processes.\nManaged sales pipeline and forecasts, utilizing analytical thinking to strategize market approaches that led to **30% year-over-year growth** in targeted sectors.\nImplemented efficient follow-up processes, ensuring effective communication with potential customers and maintaining a **95% customer satisfaction** rating according to feedback surveys."
    }
  ],
  "skills": "**Other**\n\tvacuum, sales, SAP, MS Office, communication, teamwork, autonomy, Italian, English\n\n**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**\n\tTerraform, Ansible, Helm, Docker Compose",
  "apply_company": "Leybold"
}