{
  "name": "Tomasz Lee",
  "role_name": ".NET Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven .NET Developer with 9+ years of experience specializing in **.NET CORE**, **C#**, and **SQL Server** for designing and developing scalable software solutions. Proficient in modern frontend frameworks including **React** and **Angular**, as well as backend technologies like **Node.js**. Demonstrated expertise in implementing MVC architectures (**MVC2** and **MVC5**) and leveraging **AWS** for cloud-based applications. Committed to continuous improvement and optimizing development processes while ensuring high-quality deliverables. A strong team player with excellent communication skills and a focus on results, capable of working autonomously and taking responsibility for project outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": ".NET Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed highly efficient applications using **.NET CORE**, delivering robust solutions aligned with business requirements.\n• Collaborated effectively within a team environment, leveraging **C#** for application development and enhancing code quality through peer reviews.\n• Designed SQL queries and optimized database performance using **SQL Server**, achieving a **20%** reduction in query execution time.\n• Created dynamic user interfaces with **React** and integrated them with server-side functionalities for improved user experience.\n• Implemented best practices for continuous integration and deployment on **AWS**, achieving a **40%** reduction in deployment time through CI/CD pipelines.\n• Played a key role in transforming workflows through continuous improvement practices, focusing on delivering results that exceeded expectations.\n• Conducted thorough testing and debugging of applications, ensuring high-quality software delivery and maintaining responsibility for project outcomes.\n• Utilized **Angular** and **Node.js** for developing interactive web applications within tight deadlines, showcasing strong autonomy and initiative.\n• Engaged in collaborative design sessions to enhance application performance and user satisfaction, reflecting results orientation in all activities.\n• Written technical documentation in **English** to facilitate team onboarding and knowledge sharing, demonstrating commitment to teamwork and communication."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **.NET Core** to design and develop a cloud-based project management tool, achieving a **15%** increase in team collaboration efficiency.\nEmployed **C#** for backend development, ensuring robust application performance and security.\nImplemented **React** for front-end development, contributing to a **25%** improvement in user engagement on the platform.\nIntegrated **SQL Server** for storing and retrieving data, optimizing queries to enhance performance and reliability.\nCreated a microservices architecture with **RabbitMQ** for task orchestration and **Apache Kafka** for event-driven data handling, boosting system scalability.\nIncorporated **Redis** as a caching layer for API calls, which led to a **25%** increase in system response time.\nDeveloped RESTful APIs using **.NET Core**, connecting with a **PostgreSQL** database for efficient real-time data access.\nLed the implementation of CI/CD pipelines with **GitHub Actions**, reducing production deployment errors by **30%**.\nManaged **MSSQL** and **MySQL** databases, ensuring optimal data storage and retrieval processes.\nCollaborated with stakeholders to define precise system requirements and timelines, ensuring projects remained on track for timely delivery.\nCreated interactive charts and graphs with **D3.js** for enhanced project status tracking and reporting.\nConducted code reviews and mentoring sessions with junior developers, leading to significant improvements in team productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **.NET CORE** and **C#** to develop an internal CRM system, achieving a 20% increase in sales team productivity.\nImplemented **RabbitMQ** for asynchronous message queue management, reducing system load by 30% during peak usage.\nDesigned and developed 15+ reusable components using **Angular** to enhance future project efficiency.\nOptimized customer information retrieval and management by working extensively with **SQL Server**, resulting in a 25% improvement in query performance.\nAssisted in migrating legacy systems from ASP.NET WebForms to **.NET CORE**, significantly enhancing performance and maintainability.\nCollaborated with the DevOps team to establish automated build and release pipelines in **Azure**, reducing deployment times by 40%.\nIntegrated the platform with third-party APIs, facilitating seamless data sharing and reducing integration errors by 15%.\nEnhanced frontend experience on client-side dashboards using **Vue.js**, improving user satisfaction scores by 10%.\nEngaged in daily standups and conducted code reviews to maintain project alignment and ensure adherence to coding standards.\nDelivered comprehensive technical documentation and user guides, fostering knowledge transfer and improving team onboarding efficiency."
    }
  ],
  "skills": " **Programming Languages**\n\t C#, SQL Server, JavaScript, TypeScript, Python\n\n **Backend Frameworks**\n\t .NET, .NET CORE, NodeJS, ExpressJS, NestJS, Microservices, MVC2, MVC5\n\n **Frontend Frameworks**\n\t React, Angular, VueJS, NextJS, NuxtJS, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t AWS, Azure\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\t CI/CD pipelines\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t UX/UI Design, Git, GitHub, Apache Kafka, RabbitMQ, Redis, Testing Tools (NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest), Blockchain (Solidity, Ether.js, Web3.js, Ethereum), English, Teamwork, Results Orientation, Continuous Improvement, Autonomy, Responsibility"
}