{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of comprehensive experience in **TypeScript**, delivering high-performance cross-platform mobile applications using **ReactNative**. Proficient in developing user-centric solutions in the fintech sector, ensuring secure authentication and compliance with industry standards. Adept at collaboration and documentation to drive UX-focused development. Skilled in both frontend and backend development, with expertise in **JavaScript**, **Flutter**, **React**, **Next.js**, and **Node.js**. Hands-on experience in building AI/ML-powered platforms, supporting predictive analytics, automation, and real-time processing. Experienced in deploying cloud-native systems using **AWS** and **Azure**, and implementing microservices and CI/CD pipelines. Strong background in compliance-driven development aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed cross-platform mobile applications using **TypeScript**, **ReactNative**, and **Flutter**, focusing on delivering a seamless user experience in fintech environments.\n- Implemented secure authentication mechanisms utilizing **WebAuthn** and other best practices to ensure data protection and secure user interactions.\n- Collaborated with UX designers to create user-friendly interfaces and documentation that enhance user engagement and satisfaction.\n- Led discussions and planning sessions, promoting effective collaboration across teams to ensure alignment on project objectives and timelines.\n- Ensured mobile application compatibility and performance across **iOS** and **Android**, managing deployments to achieve a rating of at least **4.5 stars** on app stores.\n- Delivered projects on time by applying agile methodologies, resulting in a **20% increase** in release frequency.\n- Conducted documentation updates, ensuring all technical documentation is clear, concise, and adheres to project standards.\n- Trained and mentored junior developers on best practices in mobile development and secure coding techniques, improving overall team performance by **30%** in project delivery.\n- Gathered and analyzed user feedback to iterate on designs, resulting in a **15% increase** in user retention rates.\n- Participated in code reviews and contributed to maintaining quality standards across the codebase, using tools like **Jest** and **Cypress** for testing."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed interactive front-end applications with **React (18)** and **TypeScript**, focusing on user experience (UX) to create sleek, responsive interfaces for fintech tools and admin panels.\n• Implemented cross-platform solutions using **ReactNative** to extend application reach and engagement across multiple devices.\n• Collaborated with other teams to ensure secure authentication practices by integrating **WebAuthn** for enhanced security in user logins and transactions.\n• Modernized documentation processes to improve collaboration within the development team, ensuring all code adheres to best practices and standards.\n• Delivered real-time analytics dashboards with **D3.js** and **Power BI Embedded**, providing instant insights into financial transactions and anomalies for enhanced decision-making.\n• Built and deployed **ETL** pipelines using **Python** and **Azure Data Factory** for financial data processing, handling batch and real-time ingesting of over **10,000** data points per day.\n• Designed and executed an event-driven architecture utilizing **Kafka** and **RabbitMQ** for asynchronous communications across workflows, handling more than **200** concurrent message transactions.\n• Developed machine learning models using **scikit-learn** and **XGBoost** for proactive fraud detection, analyzing user behavior and classifying transactions with an accuracy rate of over **95%**.\n• Created and optimized ML pipelines for credit scoring and churn prediction using **MLflow** and **Airflow**, successfully integrating model inference into backend services to enhance operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Demonstrated expertise in **TypeScript** to develop scalable and maintainable cross-platform applications utilizing **ReactNative**, enhancing the user experience on mobile devices for a global audience.\nCollaborated effectively with design and backend teams to deliver smooth and responsive mobile interfaces, employing best UX practices to ensure high levels of user satisfaction and engagement.\nImplemented secure authentication protocols, including **WebAuthn**, across frontend applications, ensuring user data protection and compliance with contemporary security standards in the fintech sector.\nProduced comprehensive documentation for all developed features and functionalities, supporting efficient onboarding of new team members and ensuring smooth project handover.\nEngaged in collaborative agile practices with cross-functional teams to ensure timely delivery of high-quality software, resulted in a **25%** improvement in project turnaround time.\nOptimized mobile performance by **30%** through code splitting and lazy loading techniques, significantly enhancing the application load time and user retention rates.\nLed documentation efforts that improved clarity and accessibility of project deliverables, fostering better understanding and communication within the team.\nEnsured the development of cross-platform mobile experiences with **ReactNative**, targeting a **50%** increase in user engagement metrics compared to previous deployments.\nParticipated actively in code reviews and team meetings, fostering a culture of continuous improvement, collaboration, and knowledge sharing among team members."
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tPython\n\t•\tJavaScript/TypeScript\n\n **Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\t•\tReactNative\n\n **Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\n **API Technologies:**\n\t•\tOAuth2\n\t•\tJWT\n\t•\tWebAuthn\n\n **Serverless and Cloud Functions:**\n\t•\tAWS: Lambda\n\t•\tAzure: App Services\n\n **Databases:**\n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\t•\tRedis\n\n **DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\n **Cloud & Infrastructure:**\n\t•\tAWS: ECS, RDS, S3\n\t•\tAzure: Blob Storage, SQL Database\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\n **Other:**\n\t•\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\t•\tCollaboration\n\t•\tDocumentation\n\t•\tUX\n\t•\tMobile\n\t•\tCross-platform\n\t•\tSecure Authentication\n\t•\tAuthentication & Security: Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot\n",
  "apply_company": "Career Renew"
}