{
  "name": "Tomasz Lee",
  "role_name": "Senior AI Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior AI Engineer with 9+ years of full stack development experience, adept at leveraging skills in **APIs**, **system design**, and **automation** to deliver innovative AI solutions. Proven expertise in **collaboration tools** such as **ClickUp**, **Notion**, and **Zapier** enhances client communication and project management efficiencies. Strong technical background in **microservices architecture**, utilizing technologies like **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, **.NET**, and **C#**. Track record of implementing robust, scalable applications and optimizing performance through strategic design. Experienced in fostering cross-team collaboration to drive projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Spearheaded the design and development of an AI-driven web-based customer management platform utilizing **.NET 7**, **ReactJS**, and **Next.js**, enhancing client communication and user satisfaction by **25%**.\nImplemented automation strategies and integrated **APIs** to streamline system workflows and improve operational efficiency.\nDesigned a robust microservices architecture using **.NET Core** to modularize the system for scalability and maintainability, reflecting advanced system design capabilities.\nIntegrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, which resulted in enhanced system resilience and throughput.\nUtilized **Redis** for caching frequently accessed data, resulting in a **35%** reduction in database load and improved response times.\nDeveloped RESTful **APIs** with **.NET**, integrating with a **MongoDB** database for seamless data access across various services, enhancing automation processes.\nImplemented CI/CD pipelines on **Azure DevOps**, reducing deployment time by **40%** and streamlining the development lifecycle.\nOptimized **MSSQL** database queries and indexing, leading to a **20%** decrease in average query execution time.\nCollaborated with UX/UI designers to enhance the platform’s user interface, improving overall user experience and demonstrating strong entrepreneurship spirit.\nDeveloped an interactive reporting engine using **D3.js** and **Three.js** for advanced data visualizations, leveraging skills in client communication and project management tools such as **ClickUp**, **Notion**, and **Sheets**.\nExecuted JWT-based authentication and authorization mechanisms for securing the application against unauthorized access."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Implemented advanced **AI** solutions and automation strategies to enhance project management tools, increasing efficiency by 15%.\n• Designed and architected systems using best practices in **system design** to ensure scalability and maintainability.\n• Developed and integrated **APIs** for seamless interaction between various components of the project management tool, facilitating real-time data access and responsiveness.\n• Utilized **ClickUp** and **Notion** for task management and documentation, improving team collaboration.\n• Automated workflows using **Zapier** and integrated with external tools, optimizing operational processes.\n• Fostered effective **client communication** to gather requirements and provide updates, promoting transparency and collaboration.\n• Explored and applied **Langchain** techniques for enhancing AI-driven functionalities within applications.\n• Developed custom dashboards in **Sheets** for data visualization and reporting, enabling stakeholders to track project progress easily.\n• Established a culture of **entrepreneurship** within the team, encouraging innovative solutions and ownership of projects.\n• Conducted mentorship programs for junior developers, fostering growth and improving productivity by 20%."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **AI** technologies to enhance system design, optimizing operations by **30%** through intelligent automation strategies.\nImplemented robust APIs to facilitate integrations, ensuring seamless communication between systems and boosting data transfer efficiency by **15%**.\nLeveraged **ClickUp** and **Notion** for project management, organizing tasks and improving team collaboration, ultimately increasing delivery timelines by **25%**.\nDesigned and developed automation workflows using **Zapier** that reduced manual processes, streamlining team operations.\nGuided client communications with clear documentation and updates, ensuring transparency and satisfaction throughout project cycles.\nStrategized system design principles to align with business goals, promoting entrepreneurship and innovative solutions.\nEngaged with cross-functional teams for system improvements and feature enhancements, fostering a collaborative working environment.\nParticipated in regular updates and brainstorming sessions to assess project developments and align technical solutions with business needs.\nDocumented technical specifications and user manuals, aiding in team onboarding and knowledge transfer on complex systems.\nProvided insights on utilizing tools like **AgentOps** and **Langchain** for automating client interactions and enhancing overall system capabilities."
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n\t**Backend Frameworks**\n\t\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n\t**API Technologies**\n\t\tRESTful API, GraphQL, APIs\n\n\t**Database Systems**\n\t\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n\t**Cloud & Infrastructure**\n\t\tAWS, Azure, CI/CD pipelines\n\n\t**DevOps**\n\t\tN/A\n\n\t**Other**\n\t\tGit, GitHub, UX/UI Design, Python, Redux, AI, automation, system design, ClickUp, Notion, Sheets, AgentOps, Langchain, Zapier, client communication, entrepreneurship, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Vids Agency"
}