{
  "name": "Tomasz Lee",
  "role_name": "Front-End Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled Front-End Software Engineer with 9+ years of experience in Agile development and expertise in **JavaScript**, **TypeScript**, and **React**. Proficient in front-end testing frameworks, including **Jest**, **React Testing Library**, and **Cypress**. Adept at utilizing **Git** for version control and ensuring code quality through effective testing practices. Demonstrated ability to work independently in distributed teams, articulate technical concepts clearly, and enhance observability through **Synthetic Monitoring** strategies. Previous experience includes full stack development, with proficiency in **Django** and **Go**, enabling efficient collaboration across teams and successful project delivery.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Front-End Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **React** to develop responsive and user-friendly front-end components in alignment with Agile development practices, enhancing user satisfaction by **25%**.\nImplemented front-end testing frameworks such as **Jest** and **React Testing Library**, ensuring high test coverage and reliability in production.\nCollaborated effectively with distributed teams, employing strong communication skills to facilitate project understanding and execution.\nIntegrated CI/CD workflows using **Git** for version control, increasing deployment efficiency by **40%**.\nParticipated in regular sprint planning and retrospectives, contributing to an Agile environment that promotes continuous improvement.\nDesigned user-centric interfaces with feedback from UX/UI teams, contributing to enhanced platform usability.\nConducted synthetic monitoring and observability tasks to identify and resolve performance bottlenecks, improving application response times by **35%**.\nAssisted in documentation and knowledge sharing within the team, fostering an independent work culture.\nContributed to reusable component libraries, improving development speed and consistency across projects.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "- Developed interactive user interfaces using **React** and **TypeScript**, enhancing user experience and engagement by **25%**.\n- Implemented front-end testing frameworks such as **Jest** and **React Testing Library**, increasing code reliability and reducing bugs.\n- Collaborated within an **Agile development** environment, ensuring timely delivery of project milestones and adapting quickly to evolving requirements.\n- Utilized version control with **Git**, managing code repositories and streamlining code collaboration across distributed teams.\n- Enhanced observability through the implementation of **Synthetic Monitoring**, yielding better performance insights for end-users.\n- Demonstrated strong communication skills while interacting with stakeholders to gather system requirements and provide feedback.\n- Conducted code reviews and provided mentorship to junior developers, cultivating an independent and proactive team culture.\n- Integrated **Cypress** for end-to-end testing, ensuring high-quality deployments and user satisfaction.\n- Led initiatives to refine the development process, resulting in a **30%** reduction in production deployment errors.\n- Participated in knowledge-sharing sessions, driving team independence and confidence in project execution."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "- Development of responsive web applications using **React**, enhancing user engagement and improving front-end performance by 30%.\n- Utilized **JavaScript**, **TypeScript**, and various front-end testing frameworks like **Jest** and **Cypress** to ensure code quality and minimize bugs during deployments.\n- Implemented version control practices using **Git**, facilitating smoother collaboration within the team of **9** developers and maintaining project integrity.\n- Collaborated in an Agile development environment, contributing to sprint planning and execution, which accelerated project delivery timelines by **25%**.\n- Drove the creation of dynamic user interfaces, focusing on usability and accessibility by adhering to industry best practices.\n- Enhanced system observability and implemented synthetic monitoring to proactively identify and resolve production issues, reducing downtime by **15%**.\n- Communicated effectively with both technical and non-technical teams to align project goals and gather requirements, improving stakeholder satisfaction.\n- Actively participated in code reviews, providing constructive feedback to peers while upholding coding standards and best practices.\n- Engaged in continuous learning and independent work within distributed teams to stay updated with emerging technologies and industry trends."
    }
  ],
  "skills": " \n**Programming Languages**\n\tJavaScript, TypeScript, Python, Go\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, React, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Django, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Testing Tools**\n\tJest, NUnit, xUnit, Selenium, Moq, Postman, Cypress, React Testing Library, JMeter\n\n**Cloud & Infrastructure**\n\tAWS, Azure, CI/CD pipelines\n\n**DevOps**\n\tGit, GitHub, Version control\n\n**Other**\n\tUX/UI Design, Agile development, Synthetic Monitoring, Observability, Communication skills, Independence in distributed teams, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Blockchain: Solidity, Ether.js, Web3.js, Ethereum"
}