{
  "name": "Rei Taro",
  "role_name": "Senior Customer Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Detail-oriented Senior Customer Engineer with over 10 years of extensive experience in technical troubleshooting and project management, ensuring high standards in customer support and service management. Proficient in **C**, **C++**, and **Java**, leveraging strong communication skills to collaborate effectively within cross-functional teams. Proven expertise in developing tailored solutions that enhance user experience and drive operational efficiency. Recognized for my ability to deliver impactful projects at leading organizations, utilizing my background in backend systems, automation tools, and cloud-native architectures.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Java**, **C++**, and **C** to develop robust backend services that enhance document automation, facilitate user onboarding, and optimize reporting workflows, achieving efficiency improvements of up to **30%**.\nImplemented technical troubleshooting methodologies for resolving critical issues in the software lifecycle, ensuring optimal performance and system reliability.\nManaged and supported customer needs through effective communication and project management, successfully leading **5** high-impact projects to completion on time and within budget.\nDesigned and executed security strategies to safeguard user data and applications leveraging **Cyber Security** best practices, enhancing overall user trust by **20%**.\nCollaborated with cross-functional teams to provide service management solutions that address customer queries and system integration, resulting in a **15%** increase in customer satisfaction scores.\nProvided exceptional customer support by leveraging deep technical knowledge in **Android Studio** and **XCode**, assisting clients in troubleshooting **iOS** and **Android** applications efficiently."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Collaborated with cross-functional teams to ensure smooth system integration and successful release management, leveraging **Project Management** skills to coordinate efforts effectively across teams.\n• Utilized **Technical Troubleshooting** abilities to identify and resolve issues related to customer support and services, ensuring top-notch performance of systems.\n• Enhanced customer experience through effective **Communication**, providing updates and responding to inquiries regarding technical aspects and project statuses.\n• Implemented security audits and service management strategies to uphold high standards of **Cyber Security**, protecting customer data and ensuring compliance with industry regulations.\n• Developed intuitive solutions using **C** and **C++** to meet specific customer requirements, demonstrating flexibility and proficiency in multiple programming languages.\n• Spearheaded customer support initiatives by integrating robust **Java** applications, leading to a **20%** increase in response efficiency.\n• Conducted training sessions for teams in **Android** and **iOS** environments, resulting in a **15%** improvement in project execution speed.\n• Streamlined project workflows and service management, executing **10+** successful product launches in a year."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Leveraged strong **technical troubleshooting** skills to provide high-level support for **C**, **C++**, **Java**, and mobile platforms like **Android** and **iOS** to ensure seamless customer experiences.\nUtilized **project management** expertise to oversee the deployment of customer solutions, meeting timelines and service standards across multiple platforms, including **Android Studio** and **XCode**.\nImplemented **cyber security** measures, enhancing data protection for customer systems and ensuring compliance with industry standards, positively impacting customer satisfaction by **25%**.\nFacilitated communication between engineering and customer support teams, resolving issues rapidly and promoting a collaborative environment, resulting in a **30%** reduction in customer support cases.\nDeveloped tailored service management strategies that improved system uptime from **95%** to **99%**, significantly boosting user trust and system reliability.\nConducted technical training sessions for internal teams and customers to enhance understanding of complex technologies, improving overall service quality.\n"
    }
  ],
  "skills": " **Programming Languages**\n\tC, C++, Java, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tAndroid, Android Studio, iOS, XCode\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Cyber Security, Technical Troubleshooting, Communication, Project Management, Service Management, Customer Support, Kafka, PyTest, Git",
  "apply_company": "Zimperium"
}