{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I excel in AI solutions and distributed systems, leveraging my strong background in **Python** to deliver high-performance applications. My technical proficiency includes working with **Go**, **C**, and **C++**, alongside modern development practices in container runtimes and microVMs. I have hands-on experience implementing sandboxing techniques to enhance the security of applications. \n\nMy comprehensive expertise extends to full-stack development utilizing frameworks and libraries such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, complemented by a robust cloud experience with **Azure** and **AWS**. I have successfully led enterprise-grade platform development that integrates AI/ML capabilities, focusing on predictive analytics, intelligent automation, and real-time data processing. With a solid foundation in microservices architecture, event-driven systems, and CI/CD automation, I ensure the creation of secure applications compliant with standards like HIPAA, FHIR, PCI DSS, and SOC 2. My experience includes developing machine learning pipelines and implementing MLOps workflows using tools such as **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged expertise in **Python** to design and implement AI-driven features for client-facing applications, enhancing user experiences through personalized recommendations and predictive analytics.\nArchitected scalable, distributed systems while implementing **container runtimes** and **microVMs** to ensure high reliability and efficient resource utilization.\nDeveloped robust **Go** applications that interfaced seamlessly with existing financial systems, ensuring compliance with industry standards in performance and security.\nUtilized **C** and **C++** for optimizing performance-critical components in financial data processing, achieving a **30% reduction** in processing time.\nImplemented sandboxing techniques to enhance system security and isolate potential threats while maintaining system performance.\nContributed to the development of backend services using **Python** and integrated **AI** models to automate document classification and fraud detection tasks, improving accuracy by **25%**.\nCollaborated on the architecture of microservices-based solutions, enhancing system scalability while reducing downtime to less than **1%** monthly.\nDesigned and maintained cloud infrastructure utilizing **Kubernetes**, enabling easy deployment and management of services in various environments.\nEngaged in continuous testing and evaluation of distributed systems to optimize for performance and scalability, successfully handling traffic spikes of up to **100,000** concurrent users.\nParticipated in code reviews and agile development practices, fostering a culture of continuous improvement and innovation within the engineering team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Demonstrated expertise in **Python** for building and optimizing solutions in **distributed systems**, enhancing system reliability and performance.\nApplied advanced knowledge of **AI** to develop and integrate intelligent systems, contributing to automated processes and enhanced data insights.\nLed the adoption of **microservices** architecture in the financial platform modernization initiative, resulting in a **30%** improvement in system scalability and maintainability.\nEngineered robust containerized solutions utilizing **Go** and **C++**, facilitating efficient deployment and operation within **container runtimes**.\nImplemented sandboxing techniques for enhanced security measures in the financial applications, effectively reducing vulnerability risks by **25%**.\nOptimized existing processes to incorporate **Python**-based machine learning frameworks, boosting data processing speeds by **40%**.\nCollaborated with cross-functional teams to leverage **AI** for predictive analytics, driving a **15%** increase in successful fraud detection rates.\nMaintained high-quality codebases adhering to industry standards across various programming languages, including **C** and **C++**, contributing to a decrease in system downtime by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Utilized **Python** and **Go** for developing and optimizing backend services in scalable, distributed systems, enhancing reliability and performance on critical platform components.\n• Designed and implemented containerized solutions using **microVMs** and container runtimes for agile deployment and orchestration across multi-cloud environments.\n• Engineered server-side solutions focused on AI integration, contributing to the development of intelligent features and workflows that enhance user experience and operational efficiency.\n• Collaborated in multi-functional teams to manage distributed systems, ensuring high availability and resilience while effectively utilizing resources.\n• Applied advanced programming techniques in **C** and **C++** for performance-critical modules, ensuring efficient resource management and reduced latency.\n• Proactively engaged in sandboxing efforts for secure code execution and minimizing potential vulnerabilities across the application stack.\n• Enhanced system robustness by implementing best practices in security and compliance, particularly in areas such as data handling and access control.\n• Participated in code reviews and agile development processes, yielding a 30% reduction in time-to-market for new features through collaborative efforts and a focus on quality coding standards.\n• Developed comprehensive documentation and training materials, maintaining an **80%** satisfaction rate in developer onboarding processes."
    }
  ],
  "skills": "Programming Languages:\n\tGo, C, C++, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript, React, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, distributed systems, container runtimes, microVMs, sandboxing, MLflow, Airflow, Kubeflow, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "poolside"
}