{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience delivering high-performance applications, specializing in **Python**, **Django**, **AWS**, **Google Cloud Platform**, **PostgreSQL**, **Docker**, and **Kubernetes**. Extensive knowledge in building scalable backend solutions using **REST**ful APIs, as well as deploying and managing cloud-native systems with infrastructure as code through **Terraform**.\nProficient in **Git** and **GitHub** for version control, emphasizing collaboration in **Agile** and **Kanban** workflows. Demonstrated strength in integrating reliable database solutions and microservices architectures, while implementing CI/CD practices to streamline development and deployment processes.\nAdditionally, experienced in frontend technologies including **JavaScript**, **HTML**, and **CSS**, providing a well-rounded approach to application development. Adept at aligning solutions with compliance standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed backend solutions using **Python** and **Django** to support robust application functionality, ensuring seamless integration with front-end components and APIs.\nCollaborated on deploying applications in cloud environments such as **Google Cloud Platform** and **AWS**, enabling efficient resource management and scalable infrastructure.\nUtilized containers with **Docker** and orchestrated deployments and scaling using **Kubernetes**, enhancing the development workflow and application reliability.\nImplemented RESTful APIs for interaction between the backend and client-side applications, ensuring data is served efficiently and securely.\nMaintained relational databases, particularly **PostgreSQL**, optimizing for performance and effective data storage solutions across projects.\nAdopted CI/CD methodologies using **Git** and **GitHub** for version control and collaborative development, ensuring code quality and streamlining advancement through build and deployment phases.\nEngaged in Agile methodologies, specifically **Kanban**, to promote flexibility and responsiveness in project management, leading to enhanced team productivity and project deliverables.\nConducted effective data modeling practices, integrating necessary frameworks and technologies to ensure high availability and consistency across various systems.\nEnhanced application performance metrics by implementing logging, monitoring, and testing tools, thereby ensuring a resilient and maintainable codebase.\nTransformed legacy systems using modern architectural designs while applying best practices in software development to achieve technical excellence and improved efficiencies.\nFacilitated regular code reviews and knowledge-sharing sessions to promote industry standards and team skill development, fostering a culture of continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Django** to develop and maintain microservices architecture, enhancing application responsiveness and scalability for high-load back-end systems.\nImplemented CI/CD practices using **Git**, **GitHub**, and **Docker**, ensuring seamless deployment and version control across services and applications.\nDesigned and developed RESTful APIs adhering to industry standards for efficient data exchange, promoting interoperability between various **cloud platforms (AWS, Google Cloud Platform)**.\nCollaborated in an **Agile** (Kanban) environment to constantly improve product performance, deploying over **5** successful releases per month while meeting strict deadlines.\nManaged databases using **PostgreSQL** with a focus on data integrity, capable of processing transactions for over **1 million** users seamlessly.\nAutomated infrastructure setups with **Terraform**, facilitating efficient environment provisioning and configuration management across cloud services.\nIntegrated various front-end technologies including **HTML**, **CSS**, and **JavaScript** to support user interface requirements and work closely with UI/UX teams.\nLed efforts in container orchestration using **Kubernetes**, achieving a **30%** reduction in downtime through effective resource management and scaling strategies."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** with **Django** for backend development, ensuring high-performance, scalable applications within a microservices architecture across **Google Cloud Platform** and **AWS** environments.\nEmployed **PostgreSQL** for relational database management, optimizing database queries to enhance application performance and reduce response times by up to **30%**.\nImplemented RESTful API services following best practices, improving integration between frontend and backend teams, and enhancing the user experience through faster data retrieval.\nManaged code versioning and collaboration through **Git** and **GitHub**, maintaining high code quality and facilitating a smooth deployment process in an **Agile** environment.\nLeveraged containerization with **Docker** and orchestration through **Kubernetes**, enabling seamless application deployment and scaling in development and production phases.\nUtilized **Terraform** for infrastructure as code, ensuring environment consistency and minimizing deployment issues across different stages.\nDeveloped interactive interfaces utilizing **HTML**, **CSS**, and **JavaScript**, focusing on responsive design to achieve a mobile-first customer-centric approach.\nApplied **Agile** methodologies including **Kanban** for project management, ensuring timely delivery of product features while reducing bottlenecks in development cycles.\nCollaborated with cross-functional teams to drive improvements in application security and performance, enhancing overall user satisfaction metrics by **25%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tDjango, FastAPI, Flask\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n**API Technologies:**\n\tREST\n\n**Serverless and Cloud Functions:**\n\tAWS, Google Cloud Platform, Lambda, ECS\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose, Azure\n\n**Other:**\n\tAgile, Kanban, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Mozilla"
}