{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Driven Senior Field Engineer with 13+ years of experience specializing in **automation**, **troubleshooting**, and **customer support** within complex systems. Adept at enhancing efficiency through **robotics** and **electro-opto-mechanical** integration, leveraging superior **communication** and **teamwork** skills to collaborate across multidisciplinary teams. Proficient in deploying **Salesforce** solutions for streamlined operations. Strong background in full stack development utilizing **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms for predictive analytics and real-time processing. Skilled in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices and event-driven architectures with a focus on compliance with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized strong troubleshooting skills to diagnose and resolve complex automation systems issues, ensuring efficient operation of **electro-opto-mechanical** components.\nCollaborated effectively with team members to enhance project outcomes through robust teamwork and communication practices, focusing on client requirements and specifications.\nProvided exceptional customer support by training clients on the use of **Salesforce** for streamlined interactions and data management, significantly improving user satisfaction metrics by **30%**.\nDelivered technical support and maintenance for automation solutions, achieving an average response time of less than **2 hours** for critical troubleshooting cases.\nConducted detailed assessments of automation processes, identifying areas of improvement that led to a **15%** increase in system efficiency.\nDesigned and implemented custom solutions for clients, utilizing **Salesforce** integrations that enhanced operational workflows and reduced processing time by **25%**.\nDeveloped training materials and conducted workshops for end-users, resulting in a **40%** reduction in support tickets within the first month of implementation.\nMaintained up-to-date knowledge of industry trends and advancements in automation technology, applying this knowledge to enhance system performance and functionality.\nActively participated in cross-departmental meetings to help bridge gaps between technical and non-technical staff, fostering a collaborative work environment.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged strong **communication** skills to effectively collaborate with cross-functional teams, ensuring seamless integration of **automation** processes in electro-opto-mechanical systems.\nUtilized **troubleshooting** expertise to diagnose and resolve technical issues for customers, achieving a resolution rate of **95%** on first contact.\nWorked closely with clients to understand their needs, providing exceptional **customer support** and fostering long-term **teamwork** across departments to enhance service delivery.\nImplemented and optimized **automation** strategies in field operations, reducing manual labor by **40%** and improving efficiency in system deployment.\nSupported field engineers with **robotics** solutions, facilitating the installation and maintenance of complex systems, which led to a **30%** increase in operational uptime.\nDeveloped training materials and conducted workshops to enhance team knowledge on **Salesforce**, fostering better project management and customer relationship practices across the board.\nActed as a liaison between technical and non-technical stakeholders, enhancing **communication** across project phases and ensuring alignment with client expectations."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed automation solutions to improve the efficiency of electro-opto-mechanical systems, ensuring optimized performance and reliability across field operations.\nEngineered troubleshooting strategies to identify and resolve technical issues in real-time, enhancing customer support and minimizing downtime during critical project phases.\nUtilized **Salesforce** for tracking customer interactions, optimizing communication channels, and ensuring seamless customer support experience, leading to a **20%** increase in client satisfaction rates.\nCollaborated within cross-functional teams to implement actionable improvements based on feedback, fostering a culture of teamwork and continuous improvement in project execution.\nConducted regular maintenance and operational testing of robotic systems, achieving a **15%** reduction in equipment failures through proactive monitoring and adjustments.\nManaged customer relationships effectively, ensuring timely communication and resolution of inquiries, resulting in improved loyalty and engagement with our service offerings.\nDelivered technical training and support to customer teams, utilizing concise communication to enhance understanding and operational efficiency of complex systems.\nAnalyzed field data to develop innovative solutions for operational challenges, aiming for a **25%** improvement in overall process efficiency.\nMaintained meticulous documentation of field operations and technical interventions, facilitating knowledge sharing and continuous learning within the engineering team."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Terraform, Ansible, Helm, Docker Compose, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tautomation, robotics, electro-opto-mechanical, Salesforce, troubleshooting, communication, customer support, teamwork, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Unchained Labs"
}