{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a dynamic Senior Sales Engineer, I excel at leveraging advanced sales strategies and effective communication skills to establish strong relationships and drive revenue growth. With a proven track record in creating structured work processes, I am highly adept at employing **SAP** for optimal customer engagement and management. My proficiency in **MS Office** enhances my capability to present compelling proposals and analyses that resonate with clients.\nAdditionally, I bring original strengths in adaptability and teamwork, fostering a collaborative environment while working autonomously to meet project goals. My experience in the tech industry allows me to understand the intricacies of vacuum technology, ensuring I can translate complex technical concepts into approachable solutions for clients.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Employed **MS Office** to create strategic sales presentations and reports, contributing to a **15%** increase in quarterly sales performance.\n- Leveraged strong **communication** skills to build relationships with clients, resulting in a **30%** improvement in customer satisfaction ratings.\n- Collaborated effectively with cross-functional teams, utilizing **teamwork** to optimize sales processes and achieve a **20%** higher conversion rate.\n- Demonstrated **autonomy** by independently managing key accounts, leading to a **25%** growth in territory sales.\n- Developed and executed effective **sales strategies** that integrated analytics and market insights, driving a **10%** increase in market penetration.\n- Maintained **structured work** within the sales pipeline, ensuring timely follow-ups and nurturing leads into long-term partnerships.\n- Utilized **SAP** to track sales metrics, analyze performance, and forecast sales trends efficiently, improving data accuracy by **40%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **MS Office** for creating detailed reports and presentations, effectively communicating complex technical information to clients and stakeholders, enhancing understanding and engagement with **vacuum technology** solutions.\nImplemented **sales strategies** tailored to the unique needs of various clients, achieving a **35%** increase in quarterly sales performance.\nCollaborated cross-functionally with engineering and product teams, demonstrating effective **teamwork** and **communication** skills to refine product offerings and align them with market demands.\nConducted product demonstrations and technical workshops, showcasing the benefits of **SAP** integrated solutions, increasing customer satisfaction scores by **20%**.\nMaintained a structured work approach while managing multiple client accounts autonomously, ensuring timely follow-ups that led to a **15%** reduction in client response times.\nLeveraged both technical and sales expertise to offer comprehensive support for clients, establishing long-term relationships that encouraged repeat business and referrals."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized advanced **MS Office** tools to create detailed sales presentations and reports, contributing to a **20%** increase in client engagement and maintaining comprehensive documentation of client interactions.\nExecuted effective **sales strategies** that resulted in achieving **150%** of quarterly targets by identifying customer needs and providing tailored solutions.\nCollaborated with cross-functional teams, demonstrating exceptional **teamwork** and **communication** skills to ensure a consistent message and approach across all sales channels.\nIndependently managed client accounts with a high degree of **autonomy**, leading to a **30%** growth in key accounts through strategic relationship building and ongoing support.\nUtilized **SAP** for tracking sales metrics and inventory management, ensuring efficient workflow processes and accurate forecasting of product needs.\nImplemented structured work processes that enhanced productivity, allowing for quicker response times to client inquiries and leading to a **15%** reduction in sales cycle duration.\nEngaged clients through effective communication techniques, tailoring presentations based on customer requirements and demonstrating strong product knowledge to drive sales success.\nAchieved recognition for exceptional problem-solving skills, providing innovative solutions to complex client challenges, resulting in enhanced customer satisfaction ratings.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\t\n\n **Other:**\n\tMS Office, communication, teamwork, autonomy, structured work, sales strategies, SAP, vacuum technology",
  "apply_company": "Leybold"
}