{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Graphics Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Graphics Engineer with over 13 years of experience in delivering high-performance applications optimized for real-time rendering and cross-platform compatibility. Proficient in **C++**, **Vulkan**, **Metal**, and **Unity**, with a strong focus on GPU performance and optimization strategies. Expertise in debugging and profiling to enhance rendering efficiency and reduce compute load using advanced techniques such as LOD, anti-aliasing, and illumination strategies.\n\nDemonstrated ability in building complex systems, with hands-on experience in **JavaScript/TypeScript**, **Python**, and **Flutter** for frontend and backend development. Adept at implementing microservices and CI/CD pipelines, leveraging cloud services on **AWS** and **Azure**. Engaged in compliance-driven development tailored to meet industry standards, including HIPAA and PCI DSS. Solid grounding in AI/ML-powered solutions incorporating predictive analytics and real-time processes.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Graphics Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and optimized high-performance graphics applications leveraging **C++**, ensuring real-time rendering capabilities and cross-platform functionality.\n• Utilized **Vulkan** and **Metal** graphics APIs for advanced rendering techniques, implementing **anti-aliasing** and **illumination** strategies to enhance visual quality.\n• Designed efficient shader programs to optimize rendering performance, focusing on complexities like **LOD** (Level of Detail) for dynamic scene management.\n• Implemented GPU profiling and performance analysis tools, leading to a **30%** increase in rendering efficiency across several projects.\n• Conducted in-depth debugging sessions to identify and resolve performance bottlenecks, ensuring robust application stability through iterative profiling.\n• Created rendering techniques that efficiently utilize CPU and GPU resources, achieving optimum performance across **multiple platforms** with high graphical fidelity.\n• Enhanced user experience in graphics applications through real-time performance tuning and optimization strategies tailored for diverse hardware.\n• Collaborated with cross-disciplinary teams to integrate advanced graphical features like **tiling** and compute shaders into existing frameworks, expanding capabilities.\n• Led knowledge-sharing sessions on new rendering technologies and performance optimization best practices, contributing to team skill advancement.\n• Achieved significant performance improvements through advanced **GPU** computing techniques and automated profiling tools, resulting in a **25%** reduced render time on key assets."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **C++** and **Vulkan** for developing high-performance rendering engines, optimizing graphics performance for real-time applications, and ensuring seamless cross-platform compatibility.\nImplemented advanced rendering techniques, including **Shader** programming and **Anti-aliasing**, enhancing visual fidelity and user experience across multiple platforms.\nConducted thorough **Profiling** and **Optimization** of graphics algorithms, achieving a performance increase of **25%** in rendering speeds, thus improving overall application efficiency.\nDesigned and integrated **LOD (Level of Detail)** techniques for scalable rendering in expansive environments, optimizing GPU resource utilization during rendering tasks.\nCollaborated with cross-functional teams to debug and resolve graphics-related issues, reducing average issue resolution time by **30%** through effective debugging strategies.\nDeveloped and maintained real-time graphics systems using **Unity** and **Metal**, ensuring rich graphical content and immersive user experiences in games and simulations.\nExecuted compute-intensive rendering tasks to enhance illumination effects and achieve realistic lighting across various environments, resulting in a **15%** increase in frame rates.\nImplemented tiling and other optimization techniques to ensure efficient resource management, leading to reduced memory footprint and improved performance on lower-end devices."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C++** to design and implement high-performance graphics rendering systems, ensuring real-time optimization and efficient performance across cross-platform applications.\nImplemented advanced rendering techniques using **Vulkan** and **Metal** for graphics pipelines, enabling superior visual fidelity and reduced latency in graphics processing.\nOptimized GPU workloads to enhance computing performance, utilizing effective profiling techniques to identify and rectify rendering bottlenecks, leading to a **40%** improvement in frame rates across platforms.\nDeveloped shaders and graphic effects to improve anti-aliasing and illumination, ensuring high-quality visual output in challenging environments using **Unity**.\nEngineered tiling and Level of Detail (LOD) strategies to improve rendering performance based on scene complexity, resulting in a **30%** reduction in resource consumption during peak rendering tasks.\nConducted in-depth debugging of rendering code to troubleshoot and optimize performance issues, ensuring a smooth user experience and high frame rates in graphic-intensive applications.\nCollaborated on cross-platform graphics solutions to ensure compatibility and performance consistency across diverse devices and operating systems.\nEmployed real-time graphics optimizations and performance enhancements that significantly improved rendering speeds and user engagement, showcasing adaptability to evolving graphical standards."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, C++, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, Vulkan, Metal, Unity, Shader, GPU, Rendering, Real-time, Performance, Optimization, Profiling, Compute, Tiling, LOD, Anti-aliasing, Illumination, Cross-platform, Debugging",
  "apply_company": "Scopely"
}