{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Drainage Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Drainage Engineer with 13+ years of experience in delivering high-performance applications across critical environments, utilizing a strong focus on **health and safety** compliance and communication. Skilled in implementing systems that ensure the efficient use of **high-pressure water jetting** techniques and **drainage** solutions, while consistently adhering to industry standards such as **CSCS** and **Shea Water** requirements. Proven track record of leveraging advanced technologies, including cloud-native systems, and frameworks like **Node.js** and **AWS** to enhance operational efficiency. \n\nAdditionally, possesses expertise in **AI/ML** to support predictive analytics, with hands-on experience in **FastAPI**, **Django**, and CI/CD pipelines, reinforcing the ability to produce innovative solutions in the field. Strong ability to align projects with compliance-driven development, ensuring adherence to standards like **HIPAA**, **PCI DSS**, and **SOC 2**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Drainage Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Led high-pressure water jetting operations, ensuring effective drainage solutions while adhering to health and safety standards.\nCommunicated project requirements and updates clearly to stakeholders, fostering teamwork and collaboration across departments.\nManaged the execution of drainage projects, overseeing teams and ensuring successful adherence to timelines and quality standards.\nDeveloped comprehensive health and safety protocols specific to drainage engineering, mitigating risks during high-pressure water jetting procedures.\nEnsured compliance with **CSCS** (Construction Skills Certification Scheme) regulations among team members, facilitating a safe working environment.\nImplemented effective communication strategies to convey technical concepts to non-technical stakeholders, enhancing project understanding and support.\nUtilized **Shea Water** technologies in drainage solutions, improving efficiency and reducing environmental impact during operations.\nConducted regular training sessions focused on health and safety best practices, leading to a decrease in workplace incidents by **30%**.\nAnalyzed project data to identify trends and improve drainage techniques, resulting in an **improvement of 25%** in service delivery efficiency.\nSupervised the integration of advanced drainage technologies, leading to innovative solutions that significantly enhanced project outcomes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Ensured the highest standards of **health and safety** in all drainage projects, implementing rigorous protocols to protect personnel and the environment.\nUtilized **high-pressure water jetting** techniques to effectively clear blockages and maintain optimal drainage conditions, enhancing system performance and reliability.\nCommunicated effectively with team members and stakeholders to provide updates and coordinate activities, ensuring seamless project execution and clarity in objectives.\nDemonstrated proficiency with **drainage** systems design and maintenance, applying innovative solutions to complex drainage challenges.\nConducted thorough inspections of drainage assets, documenting findings and recommending actions to address any deficiencies found during assessments.\nOversaw compliance with **CSCS** guidelines, ensuring that all personnel received the necessary training and certifications to operate safely and efficiently on site.\nLed a team of engineers in implementing a structured approach to **Shea Water** protocols, resulting in a **25%** reduction in project completion times and enhanced service delivery.\nStreamlined communication processes, integrating digital tools to improve reporting accuracy and foster a culture of collaboration across teams."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Ensured adherence to **health and safety** protocols while designing drainage systems that meet critical performance standards, significantly improving site safety metrics by **30%**.\nExecuted **high-pressure water jetting** techniques for optimal clearance and maintenance of drainage systems, achieving efficiency improvements in waste removal by **25%**.\nFacilitated effective **communication** with clients and project stakeholders, leading to a **15%** increase in customer satisfaction ratings through enhanced project delivery transparency.\nObtained and maintained **CSCS** certification to ensure compliance with health and safety regulations on all project sites, contributing to zero-accident records over **12** consecutive months.\nCollaborated with teams in the deployment of **Shea Water** solutions for draining various wastewater projects, optimizing resource allocation and project timelines with a reduction of **10%** in overall costs.\nConducted thorough site assessments to evaluate drainage requirements, leading to the successful execution of **5** major drainage projects under commercial contracts in the past year.\nDeveloped detailed reports and documentation of drainage operations, enhancing operational efficiency and facilitating regulatory compliance checks by **20%** through precise record-keeping."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code:\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\tCommunication, Health and Safety, CSCS, drainage, high-pressure water jetting, Shea Water",
  "apply_company": "Dyno-Rod"
}