{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer - Product Engineering",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Senior Software Engineer specialized in **full-stack development**, I bring over 8 years of software engineering experience and a strong focus on **product management** and **agile methodologies**. Proficient in **Python** with frameworks like **FastAPI**, **Django**, and **Flask**, I create responsive web applications that cater to business needs. I leverage **frontend technologies** including **Angular**, **Vue**, **React**, and **Next.js**, ensuring seamless user experiences. My technical toolkit includes **SQL** for database management, using systems like **PostgreSQL**, **MySQL**, and **MongoDB** for optimized performance. I excel in **wireframing** and **design**, automating processes like **interview scheduling**, enhancing **customer communication**, and fostering **collaboration** within teams. I am adept at navigating **technical ambiguity**, employing strong **problem-solving** skills while driving **automation** and **abstraction** in software solutions, ensuring high-quality deliverables that align with industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer - Product Engineering",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized full-stack development skills to architect and implement a scalable, cloud-native Healthcare Experience Platform using **Python** (**FastAPI**, **Django**, **Flask**), enhancing real-time patient engagement and ensuring compliance with HIPAA, FHIR, and GDPR.\nImplemented SQL database solutions, optimizing data storage and querying with **PostgreSQL**, **Azure SQL**, **Cosmos DB**, **MongoDB**, and **Redis**, applying indexing and partitioning for efficient management of large datasets.\nLed product management initiatives by integrating user feedback into system design, improving customer communication and collaboration with stakeholders through rigorous interview scheduling automation processes.\nApplied design methodologies and wireframing techniques to create user-focused interfaces, ensuring responsive web app development across multiple platforms, utilizing **Angular**, **React** (17–18), **Next.js**, and **Vue** (3.x).\nStreamlined operations by implementing automation strategies for healthcare workflows, including patient scheduling and claims adjudication, integrating Python services with **Azure Functions** and **Logic Apps**.\nFostered collaboration and agile methodologies by mentoring a cross-functional team of 10+ engineers in Python, cloud-native patterns, and DevOps practices, promoting problem-solving and technical ambiguity management across the team.\nEnhanced secure API development using **OAuth 2.0** and **OpenID Connect**, enabling robust communication with external healthcare providers and third-party platforms.\nChampioned DevOps automation, implementing CI/CD pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI**, reducing deployment times by 30% and ensuring reliable deliverables.\nDesigned observability features within the systems using **Prometheus**, **Grafana**, **OpenTelemetry**, and the **ELK stack**, facilitating proactive issue resolution and performance monitoring.\nAchieved a **95%** reduction in query times across healthcare records by integrating search services with **ElasticSearch** and **Azure Cognitive Search**.\nIntegrated AWS services (**Lambda**, **RDS**, **S3**) with Azure workloads to create hybrid cloud solutions, optimizing costs and enhancing scale.\nDeveloped and executed effective test strategies using **PyTest**, **unittest**, and **Selenium**, ensuring dependable and scalable deliveries with automated performance testing through **Apache JMeter** and **k6**.\nEnsured compliance with **SOC 2**, **ISO 27001**, **HIPAA**, and **PCI DSS** by embedding security best practices throughout Python microservices and cloud workflows.\nUtilized abstraction techniques and clear communication styles to convey complex technical concepts, ensuring alignment between engineering teams and stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained full-stack applications with a focus on back-end services using **Python (FastAPI, Django, Flask)**, enhancing product functionalities that align with customer needs.\n• Designed and implemented **SQL** databases (SQL Server, PostgreSQL, MongoDB) for responsive data management, ensuring high performance and data integrity.\n• Collaborated with cross-functional teams to gather requirements and streamline **product management**, resulting in a **25%** increase in feature delivery efficiency.\n• Employed **agile methodologies** to manage projects, facilitating clear communication and collaboration among stakeholders, leading to timely feature releases.\n• Automated repetitive tasks and workflows through integration with tools like **MuleSoft**, improving overall team productivity by **30%**.\n• Created user-friendly wireframes and adaptable responsive web applications using frameworks like **Angular, Vue, React, and Next.js** to enhance user experiences.\n• Conducted regular interviews and customer feedback sessions to improve product design, successfully resolving **85%** of user-reported issues.\n• Utilized problem-solving skills to address technical ambiguities in project requirements, ensuring clarity and direction for development teams.\n• Managed project timelines and schedules effectively, employing **technical ambiguity management** to keep projects on track.\n• Integrated CI/CD pipelines using **Azure DevOps, GitHub Actions, and TFS**, enhancing the continuous delivery process and reducing deployment times by **40%**.\n• Developed and executed automated tests with **PyTest** and **Selenium**, ensuring the reliability of backend services and high-quality product outcomes.\n• Leveraged strong communication skills to share technical concepts with non-technical stakeholders, fostering better understanding and project alignment."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Led full-stack development efforts for e-commerce platforms using **Python** (FastAPI, Django, Flask) and modern frontend technologies (**React, Next.js, Angular, Vue**), enhancing customer experience and increasing user engagement by **30%**.\n• Managed SQL databases including **PostgreSQL**, **SQL Server**, and **MySQL**, improving query performance and reducing latency by over **50%** through efficient database design and optimization strategies.\n• Designed responsive web applications by leveraging **HTML5**, **CSS3**, and **JavaScript**, ensuring cross-device compatibility and a seamless user interface across **3** key devices.\n• Collaborated with product management teams using agile methodologies, conducting user interviews and utilizing wireframing tools to translate customer needs into functional features, resulting in a **20%** increase in user satisfaction ratings.\n• Automated interview scheduling and customer communication processes, reducing administrative overhead by **40%** and enhancing team collaboration across departments.\n• Implemented CI/CD pipelines with **GitHub Actions**, ensuring reliable feature delivery and reducing deployment times by **60%**.\n• Developed and maintained robust RESTful APIs to manage high-volume transactions, ensuring real-time performance during peak loads, achieving **99.9%** uptime.\n• Leveraged caching strategies with **Redis** to significantly lower database loads, improving response times for frequently accessed resources by **70%**.\n• Conducted technical problem-solving to manage ambiguity, leading cross-functional teams to achieve project objectives without compromising quality.\n• Utilized tools like **JMeter** and **Locust** for performance testing, identifying and resolving bottlenecks to ensure application reliability under stress scenarios.\n• Enhanced security measures by implementing RBAC and **OAuth 2.0** within Python services, improving compliance with security standards for customer data protection.\n• Collaborated closely with designers to create wireframes that guided the development of intuitive user interfaces, improving onboarding processes and increasing retention rates.\n• Demonstrated clear communication skills in technical documentation and team presentations, fostering an environment of collaboration and shared understanding within the development team."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython (FastAPI, Django, Flask)\n\n**Backend Frameworks:**\n\tSpring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda)\n\n**Databases:**\n\tSQL, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tfull-stack development, product management, design, wireframing, responsive web app development, interview scheduling automation, customer communication, collaboration, agile methodologies, problem-solving, technical ambiguity management, automation, abstraction, clear communication"
}