{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Software Engineer with a robust background in building efficient and scalable solutions. Proficient in **Go**, **Linux**, **Postgres**, and familiar with **Java**, **C#**, and **C++** programming languages, I excel in developing high-quality software solutions that meet stringent performance and reliability standards. With 8 years of experience, I have a proven track record in automation, data processing, and asynchronous programming. My experience encompasses full lifecycle software development, encompassing microservices, event-driven architecture, and distributed systems.\nAdditionally, I bring expertise in building applications that comply with various protocols and RFCs, coupled with hands-on experience in VM management and malware analysis. With a commitment to leveraging technology for optimal performance, I am well-prepared to contribute to innovative projects and lead initiatives aligned with organizational goals.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed automation and distribution solutions for complex applications using **Go** and **Java**, ensuring high efficiency and effective resource utilization.\n- Leveraged **Linux** environments to design, build, and maintain robust server-side applications, implementing asynchronous processing for improved performance.\n- Managed relational database systems with **Postgres**, optimizing data processing and storage solutions for high-availability applications.\n- Employed **QEMU** for virtualization tasks, contributing to efficient VM management and resource allocation.\n- Conducted malware analysis and security assessments to ensure compliance with industry standards and protocols, enhancing system reliability.\n- Collaborated on the documentation and development of RFCs to establish clear communication and understanding of protocols and methodologies.\n- Leveraged C#, C++, and Java for backend service development, focusing on adapting solutions to complex client requirements and application architectures.\n- Streamlined data processing workflows, improving the efficiency of application interactions through automation techniques.\n- Provided mentorship and guidance to junior engineers, fostering a culture of knowledge-sharing and best practices in engineering methodologies.\n- Participated in code reviews and implementation of testing frameworks, ensuring code quality and adherence to requirements throughout the development lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Go** and **Postgres** to develop and modernize financial platforms, enhancing data processing and system distribution capabilities for efficient, high-volume transaction handling.\nImplemented automation strategies on **Linux** systems to streamline deployment and operational workflows, ensuring robust performance and reliability in production environments.\nDesigned and developed asynchronous communication protocols leveraging **C++** and **Java** to support real-time event processing for transactions and compliance workflows.\nContributed to the creation of malware analysis and prevention systems, ensuring data integrity and security in finance applications through distributed architectural principles.\nProficiently managed virtual machines (VMs) and utilized **QEMU** for environment simulations, resulting in a 30% improvement in testing efficiency and faster iteration cycles.\nCoordinated data processing pipelines with a focus on efficient batch and real-time ingestion, enhancing overall data reliability and accuracy for financial applications.\nImplemented RFCs to ensure all processes comply with industry standards, optimizing communication efficiencies within teams and external stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged expertise in **Go** and **Java** to design and develop high-performance backend services, optimizing for scalability and efficiency.\nImplemented **Data Processing** strategies to handle large datasets and ensure seamless integration with **Postgres** for reliable data storage and retrieval.\nUtilized **Automation** tools and techniques to streamline deployment processes across a **Linux** environment, incorporating continuous integration and deployment practices.\nArchitected asynchronous communication protocols to enhance system responsiveness and enable efficient resource distribution across various microservices.\nConducted **Malware Analysis** and implemented security protocols to protect applications from threats, ensuring compliance with industry standards.\nCollaborated with cross-functional teams to define and document **RFCs** for new features and enhancements, driving clarity and alignment in project objectives.\nEngineered distributed systems leveraging **QEMU** for virtualization, allowing for effective scaling and management of services across multiple **VMs**.\nCrafted unit and integration tests to maintain software quality and performance benchmarks, achieving a code coverage of over **90%**.\nParticipated in code reviews and mentoring junior developers, fostering a culture of excellence and continuous learning within the team."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Go, Java, C#, C++, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tLinux, VMs, Automation, Distribution, Asynchronous\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, QEMU, MalwareAnalysis, RFCs, Protocols, DataProcessing",
  "apply_company": "Recorded Future"
}