{
  "name": "Patryk Zaslawski",
  "role_name": "Senior PowerBI Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior PowerBI Engineer, I bring expertise in **data management**, **data transformation**, and **report testing** to deliver impactful business intelligence solutions. With a strong foundation in **technical documentation** and adherence to **Microsoft best practices**, I ensure high-quality reports that meet **web accessibility guidelines**. I excel in optimizing **data models** and managing **user permissions** while efficiently handling the **data refresh cycle**. Previously, as a Senior Python Full Stack Developer with 8+ years of experience, I specialized in developing high-performance applications using **Python** frameworks (FastAPI, Django, Flask) and modern frontend technologies (**Angular**, **Vue**, **React**, **Next.js**). My expertise extends to cloud platforms like **AWS** and **Azure**, alongside database optimization with **PostgreSQL**, **MySQL**, and **MongoDB**. Adept in implementing **microservices architecture** and developing **REST/gRPC APIs**, I align solutions with industry best practices to ensure robust and scalable systems.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior PowerBI Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and implemented data models in **Power BI** to enhance data visualization and reporting, ensuring alignment with Microsoft best practices.\n- Managed data transformation processes to support the **data refresh cycle**, optimizing performance and accuracy.\n- Created technical documentation for Power BI dashboards, facilitating knowledge transfer and adherence to **web accessibility guidelines**.\n- Conducted comprehensive report testing to verify data integrity and consistency across various reports, using **Power BI** features.\n- Collaborated with cross-functional teams utilizing **MS Teams** for efficient communication and project management during data management initiatives.\n- Defined user permissions and access levels within **Power BI**, ensuring data security and compliance with organizational standards.\n- Leveraged analytical insights from reports to drive business decisions, presenting findings to stakeholders in an intuitive manner.\n- Streamlined data processes by implementing best practices in data management and transformation, following industry standards.\n- Mentored team members on best practices within **Power BI**, enhancing overall team skills and production quality."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained dynamic dashboards in **Power BI** to deliver actionable insights, improving decision-making for stakeholders by **25%**.\nConducted data management and transformation processes to ensure accurate, timely, and insightful reporting, streamlining the data refresh cycle by **40%**.\nCollaborated with cross-functional teams using **MS Teams** to gather technical documentation and user requirements, ensuring alignment with **Microsoft best practices** and web accessibility guidelines.\nCreated and maintained robust data models in **Power BI**, enhancing data visualization and reporting accuracy while adhering to user permissions and security protocols for sensitive data access.\nLed report testing initiatives to validate data integrity and reliability, achieving a **99% accuracy rate** in report outputs.\nDesigned and executed comprehensive training sessions for end-users on how to utilize **Power BI** reports effectively, increasing user adoption by **50%**.\nFacilitated interactions between departments to ensure technical documentation is appropriately maintained and updated, allowing for smoother transitions and onboarding processes.\nOptimized existing reports in **Power BI** through effective data transformation strategies, resulting in improved performance and load times by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Leveraged **PowerBI** to design and develop intuitive, interactive reports and dashboards, ensuring compliance with **web accessibility guidelines** and **Microsoft best practices** for enhanced user experience.\nManaged and transformed datasets effectively by adhering to a structured **data management** framework, improving reporting accuracy and decision-making with **data transformation** processes.\nConducted meticulous **data model** design and optimization, enabling seamless integration of various data sources and enhancing report performance by **25%**.\nPerformed **report testing** to validate the functionality and accuracy of reports, ensuring data integrity and quality in stakeholder deliverables.\nDocumented technical specifications and report workflows for clarity and continuity, contributing to the robustness of **technical documentation** practices across teams.\nCollaborated with cross-functional teams via **MS Teams** to gather requirements and align reporting solutions with business objectives, enhancing communications and project efficiency by **30%**.\nImplemented user permissions and security protocols to manage roles effectively and protect sensitive information, achieving compliance with organizational data governance regulations.\nOptimized the **data refresh cycle**, reducing update times by **15%**, to ensure stakeholders have access to timely and relevant data insights.\nTrained users on Power BI best practices, improving the utilization of dashboards and fostering independence in data analysis for over **50** team members.\nIntegrated Power BI reports with existing systems, improving accessibility and functionality, while ensuring reports are responsive across devices and platforms."
    }
  ],
  "skills": " **Programming Languages** \n\tPython\n\n **Backend Frameworks** \n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks** \n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies** \n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions** \n\tAWS (Lambda), Azure (App Services)\n\n **Databases** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Cloud & Infrastructure** \n\tAWS, Azure\n\n **Other** \n\tPowerBI, data management, data transformation, web accessibility guidelines, Microsoft best practices, data model, report testing, technical documentation, MS Teams, user permissions, data refresh cycle, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "eir evo talent"
}