{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior AI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior AI Engineer with 8 years of experience in building high-performance solutions, specializing in **Python**, **C++**, **PyTorch**, and **ONNX** frameworks. I have a profound understanding of **machine learning**, **neural networks**, and **high-performance computing** with a proven track record in developing and deploying cutting-edge AI solutions. Skilled in designing cloud architectures across **Azure** and **AWS**, I adeptly manage data processing frameworks and optimize performance tuning to deliver efficient outcomes.\n \nMy expertise includes leading the development of AI systems for the healthcare and financial sectors, integrating **AI frameworks** for predictive analytics and real-time data processing. I possess hands-on experience in utilizing tools like MLflow and Airflow to streamline machine learning workflows, ensuring robust and scalable implementations. Strong problem-solving capabilities and a commitment to compliance standards enhance my effectiveness in creating secure applications and driving project success.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed high-performance machine learning models leveraging **Python** and **PyTorch** for various applications, including patient risk prediction and financial fraud detection.\n- Designed and implemented cloud architectures utilizing **AWS Lambda** and **Azure Functions** to ensure scalable and reliable deployment of AI solutions, enhancing availability and fault tolerance.\n- Employed **C++** and **ONNX** for optimizing neural networks, pushing the boundaries of model performance and execution speed.\n- Utilized data processing frameworks and performance tuning strategies to enhance the efficiency of AI algorithms, ensuring rapid data processing and analysis.\n- Applied advanced problem-solving skills to integrate AI frameworks in real-time client applications, providing personalized recommendations and predictive insights powered by machine learning models.\n- Collaborated with teams to structure and automate high-performance computing environments, enabling seamless experimentation and model training.\n- Integrated and optimized existing algorithms into production environments, resulting in a **30%** improvement in processing times across machine learning pipelines.\n- Conducted analysis and troubleshooting of AI model performance, implementing supplier-level solutions to mitigate identified issues and enhance overall system integrity.\n- Facilitated the establishment of continuous integration/continuous deployment (CI/CD) pipelines tailored specifically for machine learning applications, leveraging tools such as **MLflow** and **Apache Airflow**.\n- Delivered comprehensive documentation on AI frameworks and methodologies, supporting knowledge sharing and promoting best practices within teams."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **AI frameworks** to develop and implement machine learning models to enhance system capabilities and performance tuning across various financial applications, driving high-performance computing solutions.\nDesigned and executed deep learning solutions using **PyTorch** to analyze transaction patterns and detect anomalies, ensuring proactive fraud detection and compliance workflows.\nIntegrated **neural networks** into AI solutions to improve credit scoring and churn prediction, optimizing user interactions and engagement across financial platforms.\nDeveloped robust data processing frameworks leveraging **high-performance computing** strategies to handle and analyze transaction data from multiple sources, enabling real-time insights and reporting.\nApplied problem-solving techniques to troubleshoot and optimize machine learning pipelines, ensuring efficient data processing and model performance in compliance with financial regulations.\nCollaborated with cross-functional teams to leverage **cloud architectures** for scalable deployment of AI models, significantly improving the accessibility and functionality of the financial services offered.\nUtilized **ONNX** for model interoperability, facilitating seamless integration of diverse AI solutions into existing architectures, enhancing flexibility and adaptability for future developments.\nExecuted complex algorithms using **C++** for performance-critical components, achieving up to a **30% reduction** in processing time for various machine learning tasks."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **C++** for developing high-performance computing solutions that enhance the efficiency of AI-driven applications.\nApplied **machine learning** techniques using AI frameworks such as **PyTorch** and **scikit-learn** to solve complex problems and improve model accuracy, achieving up to **95%** in prediction accuracy.\nDeveloped neural network architectures and implemented them in **ONNX**, optimizing performance and cross-platform compatibility for AI workloads.\nEngineered cloud architectures utilizing **Kubernetes** for scalable deployment of machine learning models, facilitating deployments in under **10 minutes**.\nUtilized data processing frameworks to enable real-time data analytics and insights, enhancing decision-making capabilities and reducing processing times by **40%**.\nPerformed performance tuning on existing algorithms, achieving a **30%** reduction in model inference time while maintaining accuracy.\nDesigned and implemented robust solutions to ensure GDPR compliance, focusing on user data protection throughout AI model lifecycle management.\nDemonstrated problem-solving skills by addressing and resolving complex technical challenges in AI model deployment and performance, ensuring reliable system operations.\nCollaborated with cross-functional teams to integrate AI solutions that met company objectives and client needs, driving innovation and business growth."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C++\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tcloud architectures\n\n**Other:**\n\tAI frameworks, MLflow, Airflow, Kubeflow, PyTorch, llama.cpp, ONNX, high-performance computing, machine learning, neural networks, data processing frameworks, performance tuning, problem-solving",
  "apply_company": "Ampere"
}