{
  "name": "Mariusz Jan Skobel",
  "role_name": "Python Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-118083397/",
  "profile_summary": "Python Developer with 10+ years of experience specializing in **Python** and **Machine Learning** to deliver impactful software solutions in the healthcare and finance sectors. Proficient in **cloud technologies** with hands-on expertise in **AWS**, **Azure**, and **GCP** for deploying cloud-native applications. Skilled in **AI automation** and incorporating machine learning capabilities into applications for real-time analytics and intelligent decision-making. Demonstrated ability in **Backend Development** and building secure, maintainable solutions aligned with compliance standards such as HIPAA and PCI DSS. Detail-oriented, organized self-starter with a growth mindset, passionate about continuous learning and contributing to open-source projects. Additionally, possesses knowledge about nursing homes and the German language, enhancing communication and collaboration in diverse environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Python Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and developed robust backend solutions utilizing **Python** for healthcare and finance, ensuring scalability and high performance to manage extensive data requirements.\n• Leveraged **AWS**, **Azure**, and **GCP** for cloud technologies to implement serverless architectures, ensuring high availability and fault tolerance for web applications.\n• Created and maintained machine learning models for various applications, including patient risk prediction and financial fraud detection, using **scikit-learn**, **TensorFlow**, and **PyTorch**, ensuring actionable insights.\n• Implemented AI automation features in applications to enhance user experience, integrating advanced predictive analytics tools powered by **Azure ML** and **AWS Sagemaker**.\n• Employed **Docker**, **Kubernetes (EKS/AKS)**, and Microservices architecture to re-architect existing applications, resulting in improved system performance and reduced deployment times by **30%**.\n• Collaborated with cross-functional teams to ensure seamless integration of frontend technologies such as **React (17-18)** and **Next.js** with backend services, achieving reduced load times by **15%**.\n• Established a well-organized DevOps pipeline using **GitHub Actions** and **Azure DevOps**, enabling automated testing, security scans, and multi-environment deployments that led to a **40%** decrease in release times.\n• Developed detailed financial data visualization tools using **D3.js** and **Power BI**, allowing users to access real-time insights and aiding in the decision-making process, which improved operational KPIs.\n• Conducted in-depth testing strategies employing **Jest**, **Cypress**, and **Postman**, ensuring both backend and frontend deliver high-quality performance under load conditions, achieving a test coverage of **90%**.\n• Integrated advanced search functionalities using **Azure Cognitive Search** and **ElasticSearch**, improving query response times and user experience across extensive health records and financial documents.\n• Engaged in continuous learning and open-source contributions to enhance personal and team skill sets, remaining up-to-date with industry trends and technological advancements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Developed and maintained scalable backend solutions using **Python** with frameworks such as **FastAPI** and **Django**, enhancing the performance of high-volume transaction systems.\n- Leveraged **Cloud Technologies** such as **Azure** for deploying applications, contributing to seamless scalability and efficient resource management in a multi-cloud environment.\n- Implemented **Machine Learning** algorithms using libraries like **scikit-learn** and **XGBoost** for fraud detection, improving system security and reducing suspicious transaction rates by up to **25%**.\n- Engineered efficient ETL pipelines employing **Apache Airflow** and **Azure Data Factory**, facilitating smooth ingestion of data from **3** internal and external sources, minimizing data processing times by **40%**.\n- Participated in **AI Automation** initiatives, enhancing operational efficiencies and automating alert systems, which decreased manual intervention by **50%**.\n- Cultivated a **Detail-oriented** and **Organized Self-starter** approach to software development, ensuring high-quality code through systematic testing and documentation.\n- Embraced a **Growth Mindset** and displayed a **Passion for Continuous Learning** by staying updated with industry trends and exploring **open-source contributions**, fostering community collaboration.\n- Utilized **GCP** and **AWS** for various cloud services in integration projects, contributing to a smoother transition of workloads and enhancing operational availability.\n- Provided support in German, leveraging **German Language Skills** to communicate effectively with stakeholders in multilingual environments."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Engineered robust backend services utilizing **Python** (FastAPI, Django) aimed at enhancing scalability and availability for a global e-commerce platform, achieving over **99% uptime** across critical modules like checkout and order fulfillment.\n• Optimized cloud architectures on **GCP**, **AWS**, and **Azure** for seamless deployment and maintenance, ensuring efficient resource allocation and cost management with reduced operational overhead by **30%**.\n• Designed and integrated **Machine Learning** models using **scikit-learn**, **LightGBM**, and **TensorFlow** to create intelligent recommendation systems, resulting in a **25% increase** in conversion rates through personalized user experiences.\n• Actively contributed to open-source projects and communities, fostering collaboration and sharing of knowledge that aligns with industry best practices in **Backend Development**.\n• Developed secure, compliant applications by implementing role-based access control (RBAC) and **OAuth 2.0**, safeguarding user data and ensuring adherence to **GDPR** regulations.\n• Demonstrated a detail-oriented and organized approach to development, laid out clearly and documented system architecture and workflows for enhanced team understanding and project clarity.\n• Embraced a growth mindset, consistently pursuing continuous learning and improvement in **AI Automation** and emerging technologies relevant to backend development, leading to the adoption of cutting-edge solutions in projects.\n• Leveraged existing languages and frameworks effectively to build scalable solutions, while maintaining a responsive, user-friendly interface using modern tech stacks such as **React** (18), **Vue 3**, and **Angular** integrated with **TypeScript** and **Tailwind CSS**.\n• Implemented advanced caching strategies using **Redis** and **PostgreSQL** for high-throughput systems, achieving a **40% decrease** in average response times under peak load conditions.\n• Ensured mobile-first design principles were adhered to while creating SEO-friendly UIs, improving site visibility by **50%** in search rankings, contributing to increased traffic.\n"
    }
  ],
  "skills": "**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tNginx, JWT, OAuth2, Keycloak (OIDC, RBAC), Let’s Encrypt, Certbot\n\n**Machine Learning:**\n\tMLflow, Airflow, Kubeflow\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tBackend Development, Cloud Technologies, AI Automation, Detail-oriented, Organized Self-starter, Growth Mindset, Passion for Continuous Learning, Open-source Contributions, German Language Skills, Knowledge about Nursing Homes"
}