{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior HubSpot Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "Dynamic and detail-oriented Senior HubSpot Engineer with 8 years of comprehensive experience in utilizing **HubSpot**, **API**, and **workflow automation** to optimize CRM solutions. Proficient in **JavaScript**, **HTML**, **CSS**, and **SQL**, I excel at integrating third-party tools such as **Zapier** and **Workato** to enhance operational efficiency. My strong problem-solving skills and effective communication abilities enable me to effectively collaborate with cross-functional teams to deliver high-impact solutions.\n\nWith a solid background in full-stack development, I leverage technologies like **React**, **Node.js**, and **Python** for custom application development while ensuring compliance with industry standards. I am also experienced in implementing large-scale automation strategies that drive process improvements across healthcare and financial sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior HubSpot Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and integrated APIs within **HubSpot** to automate workflows, enhancing CRM functionalities and improving user interactions.\n- Created customizable workflows using **HubL**, **HTML**, **CSS**, and **JavaScript**, ensuring responsive designs and seamless user experiences.\n- Implemented data management strategies using **SQL** for efficient storage and retrieval of client interaction data, leading to a **30%** increase in operational efficiency.\n- Utilized automation tools such as **Zapier** and **Workato** to enhance marketing and sales processes, improving lead conversion rates by **25%**.\n- Collaborated cross-functionally to troubleshoot and resolve issues, leveraging strong **communication** and **problem-solving** skills.\n- Designed training materials for team members on the implementation of HubSpot features and best practices, resulting in a **50%** reduction in onboarding time.\n- Monitored and analyzed performance metrics to continuously optimize HubSpot integrations, contributing to strategic decision-making processes.\n- Maintained comprehensive documentation of workflows, API integrations, and automation processes to facilitate knowledge sharing across teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Designed and implemented **API** integrations with **HubSpot**, optimizing **CRM** workflows and enhancing automation to improve customer engagement by **30%**.\nDeveloped custom **HubL** templates and modules using **HTML**, **CSS**, and **JavaScript**, resulting in a more intuitive user experience and a **25%** increase in user interaction on landing pages.\nAutomated marketing tasks and analytics reporting through **Zapier** and **Workato**, reducing manual effort by **40%** and increasing efficiency in lead management processes.\nCollaborated with cross-functional teams to gather requirements and deliver targeted solutions while addressing complex communication challenges, ensuring projects remained on schedule and within budget.\nLeveraged **SQL** for data analysis to identify trends and insights, supporting data-driven decision-making to enhance campaign performance by analyzing user behavior.\nCreated effective **workflow** structures within **HubSpot**, facilitating seamless communication between teams and ensuring timely follow-ups in the sales process.\nDevised rapid-prototyping strategies that addressed client problems effectively, demonstrating strong problem-solving skills and improving client satisfaction scores by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Leveraged **HubSpot** APIs to design and implement automated workflows, enhancing CRM capabilities and streamlining marketing processes for increased operational efficiency.\nOptimized data management practices using **SQL** to ensure seamless integration of customer data within HubSpot, improving data accessibility and reporting accuracy by **25%**.\nDeveloped and maintained user-friendly web interfaces employing **HTML**, **CSS**, and **JavaScript** to create engaging and responsive designs that comply with accessibility standards and enhance user experience.\nAutomated business processes using third-party tools like **Zapier** and **Workato**, achieving a reduction in manual tasks by **40%** and accelerating project timelines.\nCreated custom templates with **HubL** to deliver dynamic content tailored to customer needs, boosting engagement metrics by **15%**.\nEstablished effective communication strategies to troubleshoot and resolve issues, contributing to a **95%** customer satisfaction rate throughout project lifecycles.\nUtilized analytical skills to identify and solve complex problems, leading to the development of innovative solutions within the HubSpot ecosystem.\nManaged multiple projects and priorities in a fast-paced environment, ensuring timely delivery of high-quality outcomes that meet client expectations."
    }
  ],
  "skills": "**API Technologies**:\n\tAPI\n\n**Programming Languages**:\n\tHTML, CSS, JavaScript, Python, TypeScript\n\n**Frontend Frameworks**:\n\tReact, Vue, Angular\n\n**Backend Frameworks**:\n\tFastAPI, Flask, Django\n\n**Databases**:\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other**:\n\tHubSpot, CRM, Workflow, Automation, HubL, Zapier, Workato, Communication, Problem-solving, Artificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Authentication & Security (Keycloak, JWT, OAuth2), Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Somewhere"
}