{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Solutions Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Solutions Engineer with 8 years of experience, I excel in developing innovative solutions using **JavaScript**, **Python**, and **Docker** technologies. My expertise includes designing and implementing **APIs** for Speech to Text (STT), Text to Speech (TTS), and Voice Assistant (VA) systems, supporting high-performance applications in the healthcare and financial sectors. I have a robust understanding of cloud services including **AWS** and **Azure**, and I utilize tools like **Kubernetes** and **Helm** for container orchestration. \n\nMy strong foundation in problem-solving and communication skills enables me to effectively collaborate with cross-functional teams to deliver scalable software solutions. With a solid background in microservices architecture and CI/CD automation, I ensure robust, secure applications while adhering to Data Privacy regulations. I am also skilled in developing AI/ML capabilities, serving models in production, and utilizing MLOps workflows.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust and scalable APIs using **JavaScript** and **Python** (FastAPI) for effective communication and data exchange between systems, ensuring adherence to data privacy regulations including HIPAA and GDPR.\n- Applied **Docker** and **Kubernetes** for containerization and orchestration of applications, enhancing service deployment and management across cloud environments.\n- Engaged in problem-solving by re-architecting legacy systems into microservices-based architectures, improving system reliability and maintainability, with significant boosts in deployment efficiency of up to **75%**.\n- Collaborated effectively with cross-functional teams to design and integrate **cloud**-based solutions, utilizing services like **Azure** and **AWS**, maintaining high standards of communication to ensure project objectives are met.\n- Implemented data privacy measures and security scanning processes within DevOps pipelines using **GitHub Actions** and **CircleCI**, achieving a **50%** reduction in deployment times while maintaining security compliance.\n- Conducted thorough testing strategies using tools such as **Jest**, **Cypress**, and **Postman** across all layers of the application, improving code quality and reducing the number of post-deployment bugs by **30%**.\n- Designed and optimized cloud-native data storage solutions using **PostgreSQL** and **MongoDB**, providing scalable architectures capable of handling up to **1 million** transactions per day.\n- Utilized Helm for managing Kubernetes applications, streamlining release processes and enhancing deployment reliability, contributing to a consistent uptime of over **99%**.\n- Incorporated state-of-the-art technologies like **AI** for smart analytics and decision-making tools, enhancing user engagement and improving financial predictions.\n- Delivered comprehensive training sessions for teams on using **Cloud** services and container orchestration, enhancing team capabilities to leverage modern development practices effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Designed and implemented robust **APIs** for seamless integration with various financial platforms using **JavaScript** and **Python**, enhancing data accessibility and service interoperability.\n• Utilized **Docker** and **Kubernetes** for containerization and orchestration of microservices, ensuring high availability and scalability in the deployment of applications that support financial transactions.\n• Collaborated effectively with cross-functional teams to enhance communication and streamline development processes, leading to a **30%** improvement in project delivery timelines.\n• Conducted thorough data privacy assessments, ensuring compliance with regulatory standards and building trust with stakeholders through transparent practices.\n• Leveraged **Cloud** technologies to build scalable applications that effectively handle a **50%** increase in user demand during peak transaction periods.\n• Guided teams in implementing effective problem-solving techniques within complex project environments, reducing incident resolution times by **40%**.\n• Developed dynamic, user-focused front-end applications using **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, applying **Redux Toolkit** and **Tailwind CSS** for responsive user interfaces tailored for financial dashboards and admin portals.\n• Led the creation of real-time transaction monitoring dashboards utilizing **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with actionable insights and enhancing overall financial oversight.\n• Integrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to establish an event-driven architecture for efficient asynchronous communication and real-time event processing for transactions.\n• Orchestrated ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory**, enabling batch and real-time data ingestion from diverse sources, fueling analytics efforts.\n• Implemented **AI/ML** fraud detection systems with **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, analyzing patterns to proactively flag anomalies in banking transactions.\n• Developed ML pipelines for various financial predictions such as credit scoring and transaction classification using **MLflow** and **Airflow**, directly integrating model insights into backend services for real-time decision support."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and integrated **APIs** for seamless communication between various platform components, ensuring efficient data exchange for high-performance applications.\n- Utilized **Python** and **JavaScript** frameworks for building scalable solutions, improving system performance and increasing operational efficiency by **30%**.\n- Managed cloud-based deployments using **Docker**, **Kubernetes**, and **Helm**, achieving a **40%** reduction in deployment time and improving system resilience.\n- Enhanced user experience through **DataPrivacy** practices, implementing secure data handling processes that contributed to a **25%** decrease in compliance-related issues.\n- Collaborated with cross-functional teams to address complex technical challenges, employing strong **communication** and **problem-solving** skills to deliver solutions on time and within budget.\n- Created custom **voice assistants** and **text-to-speech** applications, improving customer interaction by leveraging **AI** technologies, including **TTS** and **STT**, to support over **100,000** users.\n- Executed strategic initiatives for service reliability and scalability across cloud infrastructures, utilizing containerization techniques and orchestration tools to support dynamic workload management.\n- Implemented performance optimizations leading to enhanced speed and responsiveness, with application response times improved by up to **50%**.\n- Conducted regular audits and updates to ensure ongoing compliance with **DataPrivacy** regulations, effectively safeguarding user information throughout ever-evolving tech landscapes."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCloud\n\n**Other:**\n\tSTT, TTS, VA, DataPrivacy, Communication, ProblemSolving, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow",
  "apply_company": "Deepgram"
}