{
  "name": "Rei Taro",
  "role_name": "Senior Solutions Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Solutions Engineer with over 10 years of experience in delivering high-performing solutions in cutting-edge technologies such as **JavaScript**, **TypeScript**, **Node.js**, and **React**. Proficient in utilizing blockchain technologies, **Web3**, and **SmartContracts** to develop innovative financial platforms. Expertise in backend system design, database management with **SQL**, and caching solutions using **Redis**. Exceptional at transforming concepts into reality through scalable services and APIs in modern architectures. Known for strong technical teaching abilities and effective communication skills. Previous successful engagements with leading firms like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed full-stack solutions integrating **JavaScript**, **TypeScript**, **Node.js**, and **React** to enhance user experience and engagement in blockchain applications.\nEngineered smart contract interactions using **Web3** technologies, ensuring secure and efficient transaction management.\nImplemented robust database solutions with **SQL** and integrated caching with **Redis** to optimize application performance and data retrieval.\nUtilized modern UI frameworks like **Next.js** and **TailwindCSS** to build responsive user interfaces, increasing application speed by **30%**.\nProvided technical teaching and mentorship to junior developers, fostering a collaborative and innovative team environment.\nCommunicated effectively with stakeholders to gather requirements, ensuring alignment between technical solutions and business objectives.\nLed projects involving blockchain technology to explore decentralized applications, contributing to a clear strategic roadmap for innovation."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed backend systems in **Python** and **FastAPI** to automate document workflows, streamline user onboarding, and handle complex reporting processes.\n• Created event-driven microservices using **Celery** and **Redis** (version 5.0), enabling asynchronous processing of financial data and transaction requests.\n• Managed the deployment of microservices on **Azure App Services** (version 2.0), leveraging **Terraform** for infrastructure automation to maintain consistent and scalable environments.\n• Engineered data pipelines for the secure exchange of regulatory data, using **Apache Airflow** (version 2.1) and **Azure Functions** to automate and streamline the data flow.\n• Performed security audits, ensuring compliance with industry standards, and integrated **OAuth2** and **Azure AD B2C** (version 1.0) to manage authentication and secure access controls.\n• Collaborated with cross-functional teams to ensure smooth system integration, regulatory compliance, and successful release management.\n• Engaged in technical teaching and communication to support team members in understanding blockchain technology, **Web3**, and **SmartContracts**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** for building scalable full-stack applications, enhancing team productivity and overall code quality.\nImplemented **Node.js** for developing RESTful APIs, ensuring seamless communication between frontend and backend components.\nDesigned and enforced best practices in **SQL** for database management, focusing on data integrity and performance across various applications.\nLeveraged **Redis** for session management and caching mechanisms, significantly improving application response times by **30%**.\nDeveloped user interfaces using **React** and **Next.js**, contributing to a user satisfaction rating of over **90%** through effective UI/UX design.\nConducted technical teaching sessions, improving team knowledge on **Web3**, **SmartContracts**, and **Blockchain** technologies, enabling application of cutting-edge innovations.\nFostered effective communication within teams to ensure adherence to project timelines, with an average project completion rate of **95%** on schedule.\nApplied TailwindCSS for styling applications, reducing styling time by **25%** and enhancing overall visual consistency across multiple platforms."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, Python (3.8+), SQL, TypeScript\n\n**Backend Frameworks**\n\tDjango, FastAPI, Flask, Node.js\n\n**Frontend Frameworks**\n\tNext.js, React, TailwindCSS\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, GitHub Actions, Azure DevOps, Kubernetes, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tBlockchain, Web3, SmartContracts, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, TechnicalTeaching, Communication, PyTest, Git, Kafka, FullStack",
  "apply_company": "Sui Foundation"
}