{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Field Engineer with 8 years of experience, specializing in fault finding, repairs, and customer service to deliver exceptional solutions in the field. Proficient in leveraging **Salesforce** for customer relationship management and project tracking, alongside a solid foundation in problem-solving and technical troubleshooting. My background in electrical, electronic, and mechanical systems enhances my capability to effectively diagnose issues and implement corrective actions, ensuring optimal equipment performance. I bring strong interpersonal skills and a commitment to providing excellent service to clients, consistently fostering positive relationships. Additionally, my proven ability to work independently and drive results allows me to contribute successfully to team objectives.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided exceptional **customer service** by effectively diagnosing and resolving **electrical**, **electronic**, and **mechanical** issues for field engineering clients, ensuring rapid response and customer satisfaction in over **95%** of service calls.\nUtilized strong **fault finding** skills to identify troubleshooting solutions, performing **repairs** on critical systems in the field, reducing downtime by **30%** on average.\nApplied **problem-solving** abilities to develop and implement innovative solutions for complex engineering challenges, successfully increasing operational efficiency by **25%**.\nCollaborated with cross-functional teams to promote the use of **Salesforce** for project management and client interactions, improving communication and project tracking.\nMaintained thorough knowledge of **PPE** protocols and safety standards while performing fieldwork, ensuring compliance and minimizing risk during operations.\nDemonstrated **driving** skills by efficiently navigating various locations to provide on-site support, achieving an average service completion time of **2 hours** from arrival to resolution.\nConducted routine checks and maintenance on complex electrical and mechanical systems, ensuring optimal performance and uptime throughout service longevity.\nLeveraged technical expertise to facilitate customer training sessions on equipment usage and maintenance, enhancing customer proficiency and satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized advanced **problem-solving** skills to troubleshoot and perform **fault finding** on complex electrical and electronic systems, ensuring optimal operational efficiency for various field engineering projects.\nProvided exceptional **customer service** by addressing client needs and delivering tailored solutions, resulting in a **15% improvement in customer satisfaction** ratings.\nImplemented and maintained **Salesforce** for tracking customer interactions and project statuses, achieving **20% faster response times** to client queries.\nLed the mechanical and electrical repairs of field equipment, ensuring compliance with safety standards and protocols while minimizing equipment downtime by **30%**.\nConducted thorough inspections and maintenance on various mechanical systems, providing **detailed reports** and recommendations for improvements based on findings.\nDrove company vehicles to various job sites, ensuring timely arrival and project execution, while adhering to all safety regulations and procedures.\nUtilized personal protective equipment (**PPE**) to maintain safety standards during job execution, contributing to a **zero-incident safety record** throughout the year."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted thorough fault finding and repairs for electrical, electronic, and mechanical systems, ensuring timely resolution of issues and minimal downtime for customers.\nUtilized strong problem-solving skills to diagnose and resolve complex technical problems in the field, enhancing overall customer satisfaction and service quality.\nDelivered exceptional customer service during on-site visits, building rapport and trust while effectively communicating technical information to clients.\nCollaborated with cross-functional teams to implement effective solutions and improvements, streamlining operations and increasing efficiency in service delivery.\nDocumented all repairs and service interactions in **Salesforce**, ensuring accurate records of customer engagements and service history for future reference.\nEmployed **PPE** (Personal Protective Equipment) protocols to maintain safety standards during field operations, ensuring compliance with health and safety regulations.\nDemonstrated safe driving practices while transporting equipment and tools to various job sites, adhering to all traffic regulations and company policies.\nDrove customer engagement by providing knowledgeable insights and recommendations based on thorough assessments of their equipment and needs."
    }
  ],
  "skills": "Programming Languages:\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\telectrical, electronic, mechanical, fault finding, repairs, problem-solving, customer service, Salesforce, PPE, driving, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Diversey"
}