{
  "name": "Rei Taro",
  "role_name": "Analytics Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Results-driven Analytics Engineer with 10+ years of experience in leveraging data transformation and visualization techniques. Proficient in **SQL**, **dbt**, **Data Vault**, and **dimensional modeling** to enhance data integrity and streamline the ELT process. Adept in **Git** for version control and collaborative project management within agile environments. Experienced in designing impactful dashboards and reports with tools like **Looker**, **Tableau Software**, **Qlik**, and **Power BI**. Familiar with **Snowflake** for data warehousing solutions. A self-starter and collaborative team player with excellent communication skills, fluent in French and English. Previously designed and delivered backend systems for top-tier organizations, showcasing strengths in API creation, automation tools, and scalable services using **Python** frameworks (FastAPI, Django, Flask) and cloud platforms such as **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Analytics Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Developed and optimized data workflows using **SQL** and **dbt** to enhance data accessibility and visualization for analytical processes.\n• Implemented **Data Vault** techniques and **dimensional modelling** to structure data in a way that supports scalable analytics and reporting.\n• Automated the **ELT process** to streamline data ingestion and transformation, ensuring faster availability for analytics.\n• Utilized version control with **Git** to manage and track changes in data models and scripts efficiently.\n• Created interactive dashboards and reports using **Tableau Software**, **Power BI**, and **Looker** to provide insights and drive business decisions.\n• Conducted data analysis and visualization in the **Snowflake** environment to enable comprehensive reporting and analytics capabilities.\n• Collaborated with business stakeholders in a **self-starter** and **collaborative team player** manner to address evolving analytics needs and challenges.\n• Ensured effective communication and collaboration in an **agile environment**, contributing to project success and timely delivery of analytics solutions.\n• Provided bi-lingual support (fluent in French and English) to communicate complex data insights to diverse stakeholders."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "- Optimized data extraction and transformation by utilizing **SQL** and **dbt**, facilitating the ELT process to ensure accurate data reporting across platforms.\n- Designed and implemented dimensional modelling strategies, enhancing data usability in reporting tools such as **Looker**, **Tableau Software**, and **Power BI** for visual analytics.\n- Developed comprehensive data pipelines and storage solutions using **Snowflake**, ensuring timely and reliable access to data for end-users.\n- Collaborated in an agile environment to deliver regular updates and enhancements, acting as a self-starter and a collaborative team player, achieving a **15%** reduction in delivery times.\n- Established robust communication channels in both French and English, resulting in improved teamwork and understanding of project requirements, thereby enhancing productivity by **25%**.\n- Contributed to maintaining and improving data governance protocols, utilizing techniques from the Data Vault methodology to ensure data integrity and compliance."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed analytical models and optimized **SQL** queries to enhance the efficiency of portfolio management and account tracking, resulting in a **20%** improvement in query performance.\n• Designed and implemented **dimensional modeling** strategies alongside **dbt** for improved data transformation processes, ensuring a robust ELT process within the environment.\n• Collaborated with cross-functional teams to create dynamic data visualizations using **Tableau Software**, **Looker**, and **Power BI** that provided actionable insights for stakeholders.\n• Streamlined data workflows on the **Snowflake** data platform, improving data accessibility and processing speed by **30%** in reporting tasks.\n• Maintained version control effectively using **Git**, fostering a collaborative and efficient environment in an **agile system**.\n• Spearheaded the integration of data from various sources into **Data Vault** structures, ensuring reliability and traceability of data sets.\n• Communicated complex technical concepts effectively in both French and English, ensuring clear collaboration across diverse teams.\n• Contributed as a **self-starter** and **collaborative team player**, taking initiative in problem-solving and enhancing team productivity."
    }
  ],
  "skills": " **Programming Languages** \n\tPython (3.8+), SQL, JavaScript\n\n **Backend Frameworks** \n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks** \n\t\n\n **API Technologies** \n\tREST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions** \n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases** \n\tPostgreSQL, MySQL, MongoDB, Redis, Snowflake\n\n **DevOps** \n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n **Cloud & Infrastructure** \n\t\n\n **Other** \n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, dbt, Data Vault, dimensional modelling, ELT process, Looker, Tableau Software, Qlik, Power BI, fluent in French and English, excellent communication skills, agile environment, self-starter, collaborative team player"
}