{
  "name": "Tomasz Lee",
  "role_name": "Senior Gameplay Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Senior Gameplay Engineer with 9+ years of experience in software development, specializing in **C#** and gameplay design. Proficient in **Unity** and **ECS**, focused on performance optimization and debugging to create high-quality gaming experiences. Comfortable with documentation processes for efficient team collaboration. Strong background in delivering robust applications and proven ability to lead projects effectively. Known for proactive problem-solving skills and fostering teamwork to achieve project goals.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Gameplay Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Unity** and **C#** to build scalable and optimized gameplay features, enhancing player engagement by **30%**.\nImplemented **Entity Component System (ECS)** design patterns, improving game performance metrics by **40%**.\nCollaborated with cross-functional teams utilizing effective **team collaboration** skills, ensuring alignment on gameplay objectives and design vision.\nOptimized game performance through **performance optimization** techniques, achieving **60 FPS** consistently across devices.\nConducted thorough **debugging** to resolve critical gameplay issues, maintaining a bug-free experience for users.\nDeveloped and maintained comprehensive documentation for gameplay systems, facilitating knowledge sharing and onboarding.\nDemonstrated **proactivity** in identifying gameplay bottlenecks, proposing and executing timely enhancements.\nEngaged in **gameplay design** discussions to innovate player experiences, leading to the successful launch of new features for **5** game titles.\nManaged source control using **Git**, organizing and maintaining code repositories effectively.\nProvided mentorship to junior developers in gameplay programming best practices, enhancing team skillset."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Unity** and **C#** to design and implement gameplay features, enhancing user experience and player engagement by **3%**.\nOptimized game performance through profiling and debugging techniques, resulting in a **20%** reduction in runtime issues and improved frame rates.\nCreated comprehensive documentation for gameplay mechanics and design processes, aiding in onboarding new team members and ensuring consistent communication.\nFostered team collaboration by spearheading regular meetings and brainstorming sessions, leading to a **40%** increase in project milestone achievements.\nApplied the **ECS (Entity Component System)** architecture for improved scalability and maintainability of gameplay systems.\nProactively identified and resolved gameplay bugs through rigorous testing and debugging practices, improving overall product stability.\nCoordinated with cross-functional teams to align on gameplay design and feature priorities, ensuring alignment with project timelines and budget constraints.\nLed initiatives for gameplay balancing and tuning based on player feedback, directly increasing user satisfaction scores by **15%**.\nDeveloped performance optimization strategies that reduced loading times from **8 seconds** to **3 seconds**, greatly enhancing the player's experience.\nMentored junior developers on best practices for gameplay design and optimization techniques, leading to an uplift in team skill set and output quality."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C#** and **Unity** to design and implement gameplay features, enhancing game mechanics and user engagement by **30%**.\nEmployed **ECS (Entity Component System)** to optimize game performance, achieving a **25% reduction** in processing time and enhancing frame rate.\nConducted thorough **debugging** sessions to identify and resolve critical gameplay issues, ensuring a seamless user experience.\nCreated comprehensive **documentation** for technical specifications and gameplay mechanics, facilitating better understanding among team members and stakeholders.\nCollaborated effectively with cross-functional teams to ensure alignment on project objectives and timelines, demonstrating strong **team collaboration** skills.\nProactively identified and implemented performance optimizations, resulting in a **15% enhancement** in overall game responsiveness.\nDesigned and executed gameplay testing strategies, providing feedback that directly influenced gameplay design decisions.\nParticipated in regular project meetings to discuss progress and challenges, showcasing excellent **proactivity** in problem-solving and project management.\nDelivered technical support and mentorship to junior team members, fostering a collaborative learning environment."
    }
  ],
  "skills": "  **Programming Languages**\n\tC#, Python\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS\n\n  **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\t\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, Team Collaboration, Proactivity, Debugging, Documentation, Performance Optimization, Gameplay Design, Unity, ECS",
  "apply_company": "Fortis Games"
}