{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DevSecOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior DevSecOps Engineer with 8 years of experience specializing in cloud solutions and automation for the healthcare and finance industries. Proficient in **AWS**, **Kubernetes**, **CI/CD**, and **Infrastructure-as-Code**, ensuring robust security automation aligned with compliance standards such as PCI DSS and GDPR. Skilled in programming languages including **Python**, **TypeScript**, and **Kotlin**, I leverage my knowledge to build secure, high-performance applications while collaborating effectively with cross-functional teams. My background includes developing full-stack solutions using **React**, **Next.js**, and **Node.js**, coupled with expertise in **FastAPI** and **Django** for backend services. Additionally, I have hands-on experience with microservices architecture and MLOps workflows, utilizing tools like **MLflow** and **Airflow** to deliver intelligent automation and predictive analytics solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevSecOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented enterprise-level CI/CD pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI**, ensuring security automation and compliance with **PCI DSS**, **GDPR**, and **PSD2** standards.\nArchitected and managed scalable cloud infrastructure with **AWS** and **Kubernetes** (v1.22), deploying applications using **Infrastructure-as-Code** principles to enhance operational efficiency and security.\nCollaborated with cross-functional teams, including data scientists and developers, to improve problem-solving capabilities and communication for project success.\nDeveloped robust applications using **Python** (v3.9), **TypeScript** (v4.3), and **Kotlin**, focusing on secure coding practices and vulnerability management.\nConducted security audits and automated security testing to identify and mitigate risks using advanced techniques and tools.\nOptimized infrastructure performance through monitoring and analysis, utilizing tools such as **Prometheus**, **Grafana**, and **ELK Stack** to provide actionable insights.\nDesigned workflows for automated deployments and infrastructure scaling to maintain seamless operation and high availability, ensuring readiness for production environments.\nEngaged in continuous security assessments and adjustments to the existing codebase, promoting secure coding principles across all development cycles.\nLed initiatives to promote best practices for **DevSecOps**, fostering a culture of security awareness within the software development lifecycle.\nEnhanced collaboration among teams through agile methodologies, using tools for tracking progress and managing workload effectively, improving overall project delivery timelines."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **Infrastructure-as-Code** practices to streamline deployment processes, ensuring secure and compliant financial systems aligned with **PCI DSS**, **PSD2**, and **GDPR** regulations.\nLed the design and execution of **CI/CD** pipelines to automate application deployments, improving release efficiency by over **75%**.\nCollaborated effectively with cross-functional teams, enhancing project development through clear communication and problem-solving, resulting in a **30%** reduction in project cycle time.\nManaged cloud infrastructure on **AWS**, optimizing resource utilization and reducing operational costs by **20%**.\nDeveloped and maintained secure configurations in **Kubernetes** to enhance system scalability and reliability while minimizing vulnerabilities.\nUtilized **Python** and **Kotlin** for automating security checks and compliance verification processes, streamlining the security audit procedure and enhancing system security ratings.\nEnhanced security automation strategies, reducing manual intervention and minimizing risks associated with deployment and operation.\nConducted thorough assessments of existing security architectures and policies, resulting in improved preventive measures and incident response protocols.\nMentored junior engineers on best practices in security automation and DevSecOps, contributing to an overall enhancement in team performance."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **AWS** and **Kubernetes** to build and maintain a highly available infrastructure, implementing **Infrastructure-as-Code** using tools like Terraform and CloudFormation for efficient resource management and deployment.\nFocused on **CI/CD** pipelines to facilitate rapid deployment cycles while ensuring robust security automation practices, which improved deployment speeds by **30%**.\nDesigned and implemented secure applications using **Python** and **Kotlin**, ensuring compliance with **PCI DSS** and **PSD2** regulations to protect sensitive data throughout the application lifecycle.\nApplied **GDPR** requirements within the development lifecycle, utilizing best practices in data protection and privacy.\nCollaborated with cross-functional teams to tackle complex problems and enhance workflow efficiency, resulting in an overall productivity increase of **25%**.\nImplemented automated security testing frameworks to proactively identify vulnerabilities, reducing incident response times by **40%**.\nUtilized **TypeScript** to develop secure and scalable client-side applications, enhancing code maintainability and runtime performance.\nEngaged in proactive communication and teamwork initiatives, fostering a collaborative environment for successful project delivery on schedule while meeting **99%** uptime goals."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript, Kotlin, Golang, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL), Infrastructure-as-Code\n\n**Other:**\n\tKeycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Security automation, PCI DSS, PSD2, GDPR, collaboration, problem-solving, communication",
  "apply_company": "Pleo"
}