{
  "name": "Rei Taro",
  "role_name": "Senior AWS Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior AWS Engineer with over 10 years of specialized experience in cloud-native architectures and backend systems. Expert in **AWS** services, including **ECS**, **EKS**, **IAM**, and advanced solutions like **Data Lake** and **Cloud Consulting**. Proficient in utilizing **Terraform** and **CDK** for infrastructure as code, ensuring automation and streamlined cloud deployments. Demonstrated success in developing scalable services and high-performing APIs, leveraging technologies such as **Python (FastAPI, Django, Flask)**. Recognized for delivering impactful projects at prestigious organizations including VISA and Reply Polska, with strong skills in **SAP** technologies such as **SAP HANA**, **SAP S/4HANA**, and **NetWeaver**. A strong team player with a focus on customer orientation, compliance, and transformation initiatives.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior AWS Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Leveraged **AWS** services, particularly **ECS** and **EKS**, to architect and deploy containerized applications ensuring high availability and disaster recovery (HA/DR) practices.\nImplemented **Terraform** for infrastructure provisioning and management, enhancing project deployment speed by **30%**.\nDesigned scalable solutions utilizing **Data Lake** architecture and integrated **SAP HANA** with **S/4HANA** to improve data analytics and reporting capabilities.\nConducted assessments to ensure compliance with industry standards and guidelines, enhancing overall customer orientation and project transparency.\nCollaborated with cross-functional teams to transform cloud strategies and implement **Landing Zones**, improving team workflows and reducing onboarding time by **50%**.\nUtilized **CDK** for defining cloud infrastructure in code, facilitating consistent environments across all stages of development.\nEmphasized a customer-oriented approach while delivering solutions that meet organizational goals and enhance team efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "- Developed backend systems in **Python** and **FastAPI** while leveraging **AWS** services, ensuring a robust infrastructure for automated document workflows.\n- Created event-driven microservices utilizing **AWS ECS** and **AWS EKS**, enabling asynchronous processing of financial data for over **1 million** transactions per month.\n- Managed the deployment of microservices on **AWS**, employing **Terraform** for infrastructure automation, leading to a **30%** increase in deployment efficiency and maintaining scalable environments.\n- Engineered data pipelines for secure regulatory data exchange using **Apache Airflow** integrated with **AWS Lambda**, automating data flow and reducing processing time by **40%**.\n- Performed comprehensive security audits and ensured compliance with industry standards by implementing **AWS IAM** policies and integrated **OAuth2** and **Azure AD B2C** for secure access controls.\n- Collaborated with cross-functional teams to ensure smooth system integration and regulatory compliance, resulting in a **100%** success rate in release management for **3 major releases** annually."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **AWS** to design and deploy cloud infrastructure for robust backend services, ensuring high availability and disaster recovery solutions in line with client requirements.\nEngineered **ECS** and **EKS** environments to facilitate effective container orchestration and management for trade execution and portfolio management applications.\nDeveloped secure and scalable data handling processes utilizing **Terraform** and **CDK** for infrastructure as code, elevating deployment efficiency by **40%**.\nCollaborated with cross-functional teams to implement comprehensive data storage solutions in **Data Lakes**, optimizing analytics capabilities for strategic trading insights.\nExecuted IAM policies to enhance security and compliance, meeting standards such as MiFID II and GDPR while ensuring best practices in cloud security.\nImplemented solutions for job queuing and scheduling using **Celery** and **RabbitMQ**, improving task execution times by **30%** across backend services.\nConducted data analytics initiatives to drive performance improvements across trading operations, utilizing tools in **AWS** ecosystem, resulting in increased operational efficiency by **25%**.\nConducted in-depth cloud consulting and transformation projects to assist clients in their migration strategies, with a focus on SAP and **SAP HANA** integration."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Terraform, CDK, ECS, EKS\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, SAP HANA, S/4HANA\n\n**Cloud & Infrastructure**\n\tData Lake, Analytics, IAM, Storage, HA/DR, MAP, CAF, Landing Zones\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Other**\n\tCloud Consulting, Transformation, Compliance, Customer Orientation, Team Work",
  "apply_company": "tecRacer"
}