{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in backend development and building scalable architectures that support AI-driven solutions. Proficient in developing distributed systems and APIs using **Elixir** alongside my extensive experience in **JavaScript/TypeScript**, **Python**, and **Flutter**. Skilled in creating SaaS applications and integrating chatbot functionalities, leveraging technologies such as **React**, **Node.js**, and **FastAPI**. \n\nHands-on expertise in deploying cloud-native systems on **AWS** and **Azure**, and implementing CI/CD pipelines and DevOps strategies to enhance software delivery life cycles. Demonstrated ability to mentor teams and foster collaboration, with a strong focus on problem-solving and effective communication. Adept at aligning technical solutions with compliance standards, ensuring adherence to regulations while powering AI/ML platforms for advanced analytics.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained **APIs** and **backend** systems for scalable architectures in healthcare and fintech projects, utilizing **Python (FastAPI)**, **TypeScript**, and **Node.js**.\nLed the implementation of **DevOps** practices in CI/CD pipelines with tools like **GitHub Actions** and **Azure DevOps**, ensuring automated testing and deployments across **9** environments.\nEngineered distributed systems using **Docker** and **Kubernetes (EKS/AKS)** to enable scalable and fault-tolerant deployments, resulting in a **30%** reduction in downtime.\nCollaborated effectively with cross-functional teams to enhance product features and performance, particularly in executing **AI** driven solutions for risk scoring and fraud detection.\nDirected the mentorship process for junior team members, sharing knowledge on **Elixir** applications and facilitating improved team performance.\nDesigned robust, secure **SaaS** solutions capable of handling high traffic and complex data, ensuring compliance with industry standards.\nIntegrated and optimized intelligent features such as chatbots, using **LangGraph** and **NLP models**, to enhance user experience and engagement metrics.\nFacilitated communication across remote teams to address and resolve technical challenges, promoting a collaborative work environment.\nDeveloped and deployed advanced analytical tools leveraging **D3.js** and **Power BI** for real-time data visualization, improving decision-making processes.\nSuccessfully led initiatives to implement **AI** capabilities into applications with use of **scikit-learn**, **PyTorch**, and **TensorFlow**, improving predictive accuracy by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Designed and built scalable architectures for financial platforms by modernizing core systems, leveraging **Node.js (NestJS/Express)** and **Python (FastAPI, Django)** to optimize backend performance for high-volume transactions.\n• Streamlined API development using best practices to ensure responsiveness and reliability, enhancing communication and collaboration across distributed systems.\n• Implemented robust AI functionalities by deploying machine learning models for fraud detection using **scikit-learn** and **XGBoost**, improving transaction security by up to **25%**.\n• Oversaw the architecture of event-driven systems utilizing **Kafka**, **RabbitMQ**, and **Azure Service Bus**, supporting asynchronous workflows with a focus on scalability and efficiency.\n• Developed ETL pipelines for data ingestion from various sources with **Python**, **Apache Airflow**, and **Azure Data Factory**, achieving processing speeds of up to **50%** faster than previous methods.\n• Collaborated effectively with cross-functional teams, employing strong mentorship and communication skills to foster problem-solving in technical and non-technical contexts.\n• Led the development of real-time analytics dashboards using **React** and **Power BI Embedded**, allowing for instant insights and analytics that improved operational responses to anomalies.\n• Cultivated a culture of continuous improvement by integrating CI/CD practices, utilizing **DevOps** principles to enhance deployment pipelines and reduce time-to-market for new features.\n• Engaged in collaborative code reviews and mentorship, supporting the growth of junior developers and promoting adherence to best practices in software development."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered scalable architectures for global e-commerce platforms, focusing on high performance and reliability in backend systems using **Python (FastAPI, Django)** and **Node.js (NestJS, Express)**.\nDesigned and implemented robust APIs and **Elixir** services to facilitate seamless integrations across distributed systems, improving system interoperability by **30%**.\nDeveloped and deployed AI-powered solutions for innovative chatbot features, utilizing frameworks such as **LangGraph** to enhance customer interaction and support.\nArchitected and optimized real-time updates with **event-driven architecture** powered by **Kafka** and **RabbitMQ**, achieving **20%** improvements in response times for order tracking and customer inquiries.\nIntegrated advanced technologies for **DevOps** practices, deploying CI/CD pipelines for continuous integration and improvements, reducing deployment times by **40%**.\nLed mentorship initiatives to foster collaboration and effective communication within development teams, enhancing overall productivity through shared problem-solving strategies.\nOptimized distributed data storage with **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra**, aiming for fault tolerance and fast data access under high traffic conditions, improving database response rates by **25%**.\nImplemented feature flags and blue-green deployments using **Kubernetes** namespaces, ensuring safe rollouts and robust testing environments for new features and updates.\nMaintained comprehensive understanding of cloud services to support scalable SaaS applications, elevating uptime metrics significantly.\n"
    }
  ],
  "skills": " **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Programming Languages:**\n\tPython, JavaScript/TypeScript, Elixir\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, S3; Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: RDS; Azure: Blob Storage, SQL Database\n\n **Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow; scalable architectures, distributed systems, chatbot, SaaS, mentorship, communication, collaboration, problem-solving, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, LangGraph",
  "apply_company": "PagerDuty"
}