{
  "name": "Rei Taro",
  "role_name": "Modern C++ Software Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Detail-oriented Modern C++ Software Developer with over 10 years of experience in backend system design and delivery, specializing in high-performance applications and financial platforms. Proficient in **C++ 20**, **Boost.Asio**, and **asynchronous programming**, with a strong foundation in **object-oriented programming** and **design patterns**. Skilled in **unit testing** and UML design to ensure the reliability and maintainability of software solutions. Adept at integrating various APIs including **MetaTrader API** and **FIX protocol**. Strong problem-solving capabilities complemented by excellent communication and interpersonal skills. Proven ability to collaborate effectively within cross-functional teams to deliver impactful projects at leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Modern C++ Software Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Leveraged **C++ 20** and **Boost.Asio** to develop high-performance backend services focused on document automation and user onboarding.\nImplemented robust **unit testing** strategies to ensure code reliability and adherence to **UML design** principles while enhancing software quality.\nDesigned asynchronous solutions utilizing **asynchronous programming** techniques for efficient processing of financial transaction requests.\nIntegrated **FIX protocol** for real-time trading communication and interaction with **MetaTrader API** for trading platform enhancements.\nApplied **design patterns** to address software architecture challenges, fostering maintainability and scalability in project development.\nDemonstrated strong **problem-solving** capabilities while optimizing existing workflows, resulting in a **20%** improvement in process efficiency.\nFacilitated clear and effective communication channels among cross-functional teams, ensuring project alignment and compliance during release cycles.\nExhibited excellent **interpersonal skills** to collaborate in a dynamic environment, contributing to team success and effective project execution."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **C++ 20** and **Boost.Asio** for developing efficient asynchronous systems, enhancing performance and responsiveness in software applications to handle up to **9,000 transactions** per second.\nEmployed unit testing methodologies to ensure code quality and reliability, aiming for a test coverage of at least **85%**.\nLeveraged **UML design** techniques to articulate system architecture and improve collaborative design efforts within cross-functional teams.\nImplemented the **FIX protocol** for financial data exchange, facilitating communication with trading platforms and external APIs, improving transaction speed by **40%**.\nIntegrated **MetaTrader API** within the trading applications, enhancing the user experience and providing real-time data processing.\nApplied advanced **design patterns** to solve complex programming problems efficiently, improving code maintainability and scalability.\nDemonstrated strong problem-solving abilities and interpersonal skills to collaborate effectively, ensuring smooth project execution and communication across teams.\nMaintained proficiency in **English** for technical documentation and stakeholder communication, ensuring clarity and understanding of project goals and timelines."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **C++ 20** to develop high-performance backend services, ensuring efficient trade execution, portfolio management, and account tracking for trading operations.\nEmployed **Boost.Asio** for implementing real-time price feed processors, achieving latencies of less than **5 milliseconds** for high-frequency trading transactions.\nDesigned and executed unit tests leveraging **unit testing** frameworks to enhance code reliability and streamline development processes, achieving **95% code coverage** in core modules.\nApplied asynchronous programming techniques to improve processing efficiency, successfully handling over **10,000 transactions** per second.\nCollaborated with cross-functional teams, enhancing communication skills to effectively deliver data through REST APIs and WebSocket channels.\nLed efforts in UML design to document system architectures, improving project clarity and stakeholder understanding.\nContributed to the integration of **FIX protocol** for standardized financial messaging, facilitating improved communication across trading platforms.\nImplemented design patterns to solve complex software challenges, significantly reducing development time by **30%**.\nDemonstrated strong problem-solving capabilities and interpersonal skills, fostering a collaborative work environment while meeting project deadlines.\nMaintained a focus on code quality through **MetaTrader API** integration and comprehensive documentation practices for future reference, enhancing team efficiency."
    }
  ],
  "skills": " **Programming Languages** \n\t C++ 20, Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks** \n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks** \n\t \n\n **API Technologies** \n\t REST/gRPC APIs, MetaTrader API, FIX protocol\n\n **Serverless and Cloud Functions** \n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases** \n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps** \n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure** \n\t \n\n **Other** \n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, asynchronous programming, unit testing, object-oriented programming, design patterns, problem-solving, communication skills, interpersonal skills, English proficiency, UML design"
}