{
  "name": "Rei Taro",
  "role_name": "Senior Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with a robust skill set in **JavaScript**, **HTML**, and **CSS**, complemented by expertise in **React** and **Redux**. Demonstrated proficiency in **A/B Testing**, **Unit Testing**, and **Application Performance Management** to optimize user experiences and application efficiency. Strong analytical and problem-solving abilities with a collaborative mindset to drive projects forward effectively. With over 10 years of experience in backend systems, including financial platforms and cloud-native architectures, I bring a holistic perspective to development, leveraging skills from my past roles, including knowledge of **Python** (FastAPI, Django, Flask) and cloud solutions like **AWS** and **Azure**, to create seamless and high-quality user interfaces.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript**, **HTML**, and **CSS** to build responsive and visually appealing user interfaces, ensuring seamless user experience across 100% of platforms.\nImplemented **React** and **Redux** for state management in single-page applications resulting in a 40% improvement in load times and user engagement.\nConducted A/B testing to validate design changes and optimize user interactions, leading to a 25% increase in conversion rates.\nExecuted rigorous unit testing and code analysis to enhance application performance and reduce bugs by 30% pre-deployment.\nCollaborated with cross-functional teams to drive problem-solving initiatives, addressing integration issues and ensuring alignment with business objectives.\nApplied application performance management strategies to monitor and improve software efficiency, achieving a 15% decrease in load times across major releases."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented responsive web applications using **JavaScript**, **HTML**, and **CSS**, ensuring cross-browser compatibility and adherence to best practices in frontend development.\nDesigned and developed user interfaces with **React** and **Redux**, improving user experience and application performance across **5** different platforms.\nConducted **A/B Testing** to optimize features, resulting in a **15%** increase in user engagement.\nDeveloped and executed **Unit Testing** strategies to ensure code quality, achieving over **90%** test coverage in critical application components.\nUtilized **Application Performance Management** tools to monitor system performance and identify bottlenecks, leading to improved load times by up to **25%**.\nPerformed thorough **Code Analysis** to identify potential issues and enhance code maintainability, collaborating with peers to promote code review practices.\nFostered a collaborative environment by engaging in regular brainstorming sessions and cross-functional team meetings to address challenges and drive innovation."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Collaborated with backend teams to integrate **REST APIs** and ensure seamless communication between the frontend and backend systems, enhancing overall platform performance.\n• Implemented **A/B Testing** strategies to evaluate user interface modifications and optimize user experience, resulting in a 25% increase in user engagement.\n• Developed responsive and interactive web applications using **JavaScript**, **HTML**, **CSS**, and **React** with a focus on performance management and scalability.\n• Employed **Redux** for effective state management, reducing data fetching issues by 30% and ensuring a smooth user interaction experience.\n• Conducted **Unit Testing** with frameworks to ensure high code quality and reduce bugs by 40% before deployment.\n• Utilized **Application Performance Management** tools to monitor application performance and troubleshoot problems proactively, maintaining an uptime of 99.9%.\n• Engaged in regular **Code Analysis** practices and peer reviews, promoting high-quality coding standards and improving codebase maintainability by 20%.\n• Demonstrated strong **Problem Solving** capabilities by addressing and resolving complex frontend development challenges in collaboration with cross-functional teams."
    }
  ],
  "skills": "**Programming Languages**\n\tJavaScript, Python (3.8+), SQL, Bash\n\n**Frontend Frameworks**\n\tHTML, CSS, React, Redux\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Other**\n\tA/B Testing, Unit Testing, Application Performance Management, Code Analysis, Problem Solving, Collaboration, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git, Kafka",
  "apply_company": "PandaDoc"
}