{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Operations Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Operations Engineer with 13+ years of experience in cloud services, proficient in **Azure**, **Linux**, **Kubernetes**, and **Docker**. Highly skilled in maintaining high service level agreements (SLAs) and documentation processes while driving collaborative problem-solving initiatives within cross-functional teams. Experienced in developing high-performance applications across the healthcare and financial industries, with technical expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**. Proficient in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven track record in building AI/ML-powered platforms for predictive analytics and automation, leveraging **AWS** and implementing microservices architectures alongside CI/CD pipelines. Strong background in compliance-driven development aligning with HIPAA, FHIR, PCI DSS, and SOC 2 standards, coupled with solid MLOps experience using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Operations Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Focused on **Cloud Services**, implementing and optimizing solutions on **Azure** and **Linux** environments for healthcare and fintech applications.\n- Collaborated with cross-functional teams to design and build microservices architectures using **Docker** and **Kubernetes** (version AKS/EKS), facilitating scalable and fault-tolerant deployments.\n- Developed and maintained comprehensive documentation for operational workflows and system configurations, ensuring clear guidelines for team collaboration and knowledge sharing.\n- Led initiatives to enhance service level agreements (SLA), addressing uptime commitments and performance metrics, resulting in a **99.9%** operational uptime rate.\n- Employed problem-solving skills to troubleshoot and resolve system bottlenecks, enhancing operational efficiency through process improvements.\n- Implemented IIoT solutions to facilitate real-time data monitoring across devices, significantly improving operational responsiveness and decision-making processes.\n- Coordinated with DevOps teams to streamline CI/CD processes, ensuring rapid deployment and consistent integration across multiple environments.\n- Fostered a culture of collaboration through regular team meetings, workshops, and training sessions to share knowledge of best practices and technologies.\n- Oversaw the transition of legacy systems to modern containerized solutions, contributing to a **40%** reduction in deployment times and increased system reliability.\n- Engaged in ongoing monitoring and optimization of cloud resources to minimize costs while maintaining high performance and security standards."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented cloud services and solutions as a **Senior Operations Engineer** to ensure optimal performance and reliability across various platforms, including:\n- Migrating core financial platforms to a microservices architecture utilizing **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, enhancing scalability and performance for high-volume transactional systems, achieving a **30% improvement** in processing speed.\n- Designing and deploying container orchestration solutions with **Docker** and **Kubernetes**, streamlining deployment cycles and improving overall system uptime by **15%**.\n- Collaborating with teams to build interactive front-end applications using **React (18)**, **Vue 3**, and **Next.js**, while integrating **TypeScript** and **Redux Toolkit** for developing responsive financial tool interfaces.\n- Creating and maintaining detailed documentation for operational processes and architecture, ensuring clarity and continuity within teams, thus reducing onboarding time by **25%**.\n- Implementing real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, facilitating immediate insights into transactions and anomalies for operations teams.\n- Designing an event-driven architecture utilizing **Kafka**, **RabbitMQ**, and **Azure Service Bus** to allow seamless asynchronous communication across workflows, crucial for payments and compliance notifications.\n- Developing ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory** for efficient ingestion of financial data from both internal and third-party sources, supporting batch and real-time processing requirements.\n- Creating and deploying machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling early identification of suspicious activity based on behavioral analysis.\n- Implementing ML pipelines for functions like real-time credit scoring and transaction classification using **MLflow** and **Airflow**, integrating machine learning inference into core backend services, optimizing response times by **40%**.\n- Engaging in troubleshooting and problem-solving procedures, developing strategies to mitigate and rectify operational issues in a Linux environment, enhancing overall system reliability."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Azure** cloud services to ensure high availability and scalability of backend operations for a global e-commerce platform, meeting Service Level Agreements (SLA) for performance and reliability.\nImplemented **Kubernetes** for container orchestration, enhancing deployment strategies and enabling seamless updates, rollbacks, and scaling of application components.\nLeveraged **Docker** to create containerized applications, facilitating consistent development and production environments while streamlining collaboration among teams.\nEngineered robust operations on **Linux** environments, ensuring system stability and performance, and employing best practices in documentation for maintenance and troubleshooting.\nExhibited strong problem-solving skills by diagnosing and addressing issues within infrastructure and application performance, optimizing workflows to minimize downtime.\nCollaborated with cross-functional teams to design and implement solutions for real-time features, contributing to enhanced customer experiences across checkout and order fulfillment modules.\nManaged continuous integration and deployment (CI/CD) pipelines, integrating tools for automated testing and deployment to production, ensuring zero downtime for end-users.\nContributed to the development of operational strategies and frameworks to support Industrial Internet of Things (IIoT) systems in the e-commerce domain, enhancing data-driven decision-making.\nParticipated in the documentation of system configurations, deployment processes, and operational best practices, ensuring clarity and accessibility for current and future team members.\nEmphasized collaboration in team settings to foster knowledge sharing, continuous learning, and skill development across the engineering organization."
    }
  ],
  "skills": "**Cloud & Infrastructure:**\n\tAzure, AWS: ECS, Lambda, RDS, S3, Linux\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Programming Languages:**\n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, IIoT, SLA, Documentation, Problem Solving, Collaboration",
  "apply_company": "ifm"
}