{
  "name": "Mariusz Jan Skobel",
  "role_name": "Audio Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Detail-oriented Audio Engineer with a strong focus on delivering high-quality audio products. Proficient in **audio mastering and mixing**, **equalization (EQ)**, **dynamic range control**, and **loudness normalization**. Experienced in working with piano-vocal and acoustic music, ensuring a natural and warm sound in all projects. Adept at **delivering streaming-ready and radio-ready masters** that meet industry standards. \nWith 10+ years of software development experience, I have a solid background in leveraging **JavaScript/TypeScript**, **Python**, and **Flutter** to create tools that enhance audio processing capabilities. Skilled in utilizing **React**, **Next.js**, **Vue**, and **Node.js** for robust front-end solutions, and **FastAPI** and **Django** for back-end integration. My expertise also extends to deploying applications on **Azure** and **AWS**, ensuring high-performance and reliable audio solutions. \nCommitting to excellence, I pay meticulous attention to detail in every audio project, coupling technical proficiency with a passion for creating impactful sound experiences.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Audio Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tApplied attention to detail in audio mastering and mixing, ensuring a natural and warm sound for various projects, resulting in high-quality deliverables ready for streaming and radio broadcast.\n•\tUtilized equalization (EQ) techniques and dynamic range control to enhance audio clarity and balance, improving the overall listening experience of recordings.\n•\tMaintained consistent loudness normalization across projects, adhering to industry standards and delivering streaming-ready masters that meet technical specifications.\n•\tCollaborated with artists and producers to tailor mixes for piano-vocal and acoustic music styles, preserving the integrity and emotion of each performance, leading to **9+** successful album releases.\n•\tLeveraged advanced audio editing tools and software, mastering audio tracks in formats compatible with various distribution platforms.\n•\tConducted detailed reviews of audio mixes, implementing feedback for continual improvement, yielding **100%** client satisfaction on final master approvals.\n•\tEmployed critical listening skills to identify and correct unbalanced tonalities and inconsistencies in tracks, ensuring a polished final product that resonates with intended audiences.\n•\tDelivered consistent masters that are optimized for different playback formats, demonstrating proficiency in audio techniques that enhance the listener's experience."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Focused on delivering high-quality audio outputs by mastering and mixing tracks, ensuring natural and warm sound quality for various music genres, including piano-vocal and acoustic.\nApplied meticulous attention to detail in the equalization (EQ) process to enhance dynamic range control and achieve the optimal loudness normalization for streaming-ready and radio-ready masters.\nLeveraged sophisticated audio production techniques to create a polished final product that meets industry standards while exceeding client expectations in sound clarity and fidelity.\nCollaborated with artists and producers in a dynamic environment to understand creative visions, ultimately delivering tracks that resonate with audiences through compelling audio engineering practices.\nMaintained up-to-date knowledge of the latest audio technologies and tools to continuously refine the mastering process, ensuring exceptional sound quality across all platforms."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **dynamic range control** and **equalization (EQ)** techniques to enhance audio quality for music projects, ensuring a **natural and warm sound** that meets industry standards.\nCarefully crafted and delivered **streaming-ready masters** and **radio-ready masters** by applying **loudness normalization** processes to optimize playback quality across various platforms.\nEmployed meticulous **attention to detail** while mixing and mastering audio tracks, with a focus on **piano-vocal** and **acoustic music** genres, ensuring that each element is balanced and polished.\nAnalyzed audio tracks to achieve high fidelity and clarity, utilizing technical knowledge of sound engineering principles and best practices.\nCollaborated with artists and producers to understand project requirements, facilitating improved communication and project alignment for successful outcomes.\nProduced audio mixes that consistently meet specified client requirements, with a proven track record of delivering over **100** projects successfully within tight deadlines.\nConducted regular quality checks post-production to ensure all audio files are fit for release and adhere to the highest quality standards."
    }
  ],
  "skills": "**Other**\n\tAudio mastering and mixing, Equalization (EQ), Dynamic range control, Loudness normalization, Experience with piano-vocal or acoustic music, Attention to detail, Natural and warm sound, Delivering streaming-ready masters, Delivering radio-ready masters\n\n**Programming Languages**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks**\n\n**Frontend Frameworks**\n\n**API Technologies**\n\n**Serverless and Cloud Functions**\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}