{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Data Science and Machine Learning Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Data Science and Machine Learning Engineer with 8 years of experience in the healthcare sector, focusing on machine learning and data-driven solutions. Proficient in **Python**, **scikit-learn**, **TensorFlow**, and **PyTorch**, I excel in data preprocessing, feature engineering, model validation, and data visualization. My deep knowledge of statistical methods, compliance with medical device regulations such as **MDR** and **ISO 13485**, ensures that my systems adhere to necessary industry standards.\nI have a strong track record of utilizing **version control systems** like **Git** for efficient project management and collaboration. Additionally, I bring hands-on experience in deploying machine learning models in production environments, supported by my understanding of virtual machines and CI/CD automation. My comprehensive background in data science is complemented by a commitment to developing high-performance and compliant solutions in the financial and healthcare sectors.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Data Science and Machine Learning Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and deployed scalable **machine learning** solutions tailored for healthcare applications, focusing on patient risk prediction and compliance with **medical device regulations** (MDR) and **ISO 13485** standards.\nUtilized **Python** alongside libraries such as **scikit-learn**, **TensorFlow**, and **PyTorch** for tasks like **data preprocessing**, **feature engineering**, and **model validation**, ensuring high model performance and accuracy.\nDeveloped visual data representation tools using **data visualization** libraries, facilitating real-time insights and analytics for healthcare data.\nLeverage **Git** for **version control systems**, managing **machine learning** code alongside CI/CD best practices, ensuring reproducibility and managing project workflows effectively.\nCollaborated with cross-functional teams to integrate machine learning models into production environments, adhering to healthcare compliance guidelines.\nPerformed comprehensive statistical analyses to validate machine learning outcomes, ensuring that results align with intended regulatory standards.\nImplemented CI/CD pipelines for **machine learning** model versions using tools like MLflow, facilitating continuous integration and deployment.\nEmployed advanced **data visualization** techniques for effectively communicating complex data findings to stakeholders, enhancing understanding and decision-making processes.\nFostered adherence to healthcare data compliance measures, ensuring models and applications align with regulations throughout the development lifecycle."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** for data preprocessing and feature engineering in machine learning projects to enhance model accuracy and performance, contributing to a **15%** improvement in prediction reliability.\nImplemented machine learning algorithms, such as **scikit-learn** and **TensorFlow**, to conduct model validation and statistical analysis for data-driven decision-making, resulting in a reduction of processing time by **20%**.\nDeveloped and maintained version control systems using **Git**, ensuring efficient collaboration among team members and version tracking of ML models and codebase across **5+** projects.\nCreated and visualized data analytics reports incorporating statistical methods to derive insights from complex datasets, enhancing data-driven strategies for client engagement by **30%**.\nLeveraged cloud services, including **Azure Machine Learning**, to build and deploy AI-powered models for compliance with healthcare regulations, ensuring models adhere to standards such as **MDR** and **ISO 13485**.\nDesigned and executed real-time data validation frameworks to ensure model compliance and regulatory adherence for incoming medical device data and analytical outputs.\nContributed to the development of virtual machines and containerized environments for scalable machine learning applications, streamlining operations in development and production settings.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Leveraged **Python** and **scikit-learn** to design and implement machine learning models for predictive analytics and data-driven decision making, ensuring model validation and performance optimization.\n- Developed data preprocessing pipelines using **TensorFlow** and **PyTorch**, focusing on feature engineering and statistical methods for effective analysis of diverse datasets, including healthcare data.\n- Applied **data visualization** techniques to interpret complex datasets and present insights to stakeholders, enhancing decision-making processes across the organization.\n- Utilized version control systems such as **Git** for managing code versions, collaborating on project milestones, and ensuring compliance with medical device regulations like **ISO 13485** and **MDR**.\n- Employed virtual machines for the deployment of scalable machine learning services while adhering to best practices for **data privacy** and **GDPR compliance**.\n- Analyzed large datasets (over **1 million** records) to extract meaningful patterns and trends, driving significant business improvements and identifying new opportunities.\n- Collaborated cross-functionally with teams to integrate machine learning-driven features into existing applications, boosting functional performance by over **30%**.\n- Developed comprehensive documentation and reports on machine learning methodologies and compliance standards for internal review and external auditing processes."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (Function Apps)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, scikit-learn, TensorFlow, PyTorch, data preprocessing, feature engineering, model validation, data visualization, version control systems, Git, virtual machines, statistical methods, compliance with medical device regulations, MDR, ISO 13485, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}