{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Security Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Security Engineer with 13+ years of experience in high-performance application development and systems security across the healthcare and financial industries. Proficient in cloud services, particularly with **AWS**, and skilled in deploying solutions using **Docker**, **Kubernetes**, and **Terraform**. Experienced in implementing security protocols and automation using **Ansible**, ensuring compliance with regulations such as HIPAA and PCI DSS.\n\nAdept in managing infrastructure with **Linux**, and proficient in using **VMware** and **NGINX** for optimal system performance. Strong background in version control with **GitLab** and familiarity with identity management in environments utilizing **Active Directory** and **SSO**. Recognized for excellent problem-solving abilities, collaboration skills, and effective communication, I bridge the gap between development and security to create robust and compliant systems.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented security protocols across multiple platforms ensuring compliance with industry standards for security and privacy including **AWS**, **GitLab**, and **Docker**.\n- Managed and optimized the infrastructure on **Linux** and **VMware**, enhancing the security posture and performance of applications in a hybrid environment.\n- Developed automated deployment solutions using **Ansible** and **Terraform**, reducing manual configuration time by **40%** and enabling rapid scaling of services across **Kubernetes** clusters.\n- Led the integration of **NGINX** for reverse proxy configurations, achieved load balancing, and enhanced application security through efficient traffic management.\n- Enforced security policies and procedures for identity management using **Active Directory** and **Single Sign-On (SSO)**, resulting in a **30%** decrease in unauthorized access incidents.\n- Implemented **Public Key Infrastructure (PKI)** solutions for secure data transmission and authentication, supporting multiple applications in a seamless manner.\n- Collaborated with cross-functional teams to identify security vulnerabilities, providing problem-solving expertise that improved the overall security architecture by **25%**.\n- Developed and maintained robust documentation for security configurations and compliance protocols, facilitating clear communication and collaboration across teams.\n- Engaged in regular security audits and assessments to identify and mitigate risks associated with third-party tools and services, ensuring alignment with industry best practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented robust security protocols across **Linux** environments, utilizing **Ansible** and **Terraform** for configuration management and infrastructure as code.\nConfigured and maintained **NGINX** for secure web application delivery, ensuring optimal performance and reliability.\nManaged identity and access management through **Active Directory** and **SSO** solutions, enhancing organizational security and user experience.\nDeveloped automated security monitoring solutions using **PowerShell** scripts, improving incident response times by **30%**.\nExecuted compliance and risk assessments to safeguard sensitive data, collaborating cross-functionally with development and operations teams to drive solutions for identified vulnerabilities.\nDeployed containerized applications using **Docker** and **Kubernetes**, simplifying application deployment and scaling while ensuring security best practices were adhered to.\nOptimized the use of **AWS** services, including implementing security groups and cloud-native security measures, contributing to a **25%** decrease in security incidents year-over-year.\nLed collaborative workshops focused on reducing threat vectors, enhancing communication across teams to foster a proactive security culture.\nFacilitated the adoption of **GitLab** for version control, promoting collaboration and efficiency in development workflows while maintaining security for code repositories.\nUtilized problem-solving skills to address unexpected security issues swiftly, enhancing system resilience against potential attacks."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented security measures and monitoring solutions within **AWS** and **Kubernetes** environments, enhancing platform integrity and reliability.\nUtilized **VMware** and **Docker** for creating secure virtualized environments, promoting isolation and containment of critical applications.\nConfigured and maintained **NGINX** as a reverse proxy and load balancer, ensuring robust traffic management and security efficacy.\nDeveloped automation scripts using **Ansible** and **Terraform** to streamline infrastructure deployment and improve security compliance across instances.\nEnforced **Active Directory** and **SSO** protocols for secure user authentication, enhancing access control and improving user experience across services while maintaining **GDPR** compliance.\nDesigned and managed **PKI** systems to facilitate secure certificate management and ensure data integrity in workflows, addressing security concerns proactively.\nLeveraged **GitLab** for code repository management and integrated CI/CD pipelines, ensuring secure code delivery and facilitating collaboration among teams.\nUtilized **PowerShell** for automating system administration tasks, which reduced manual oversight and improved operational efficiency by **30%**.\nProactively solved security incidents through detailed communication and collaboration with cross-functional teams, mitigating risks and improving response times by **20%**.\nConducted thorough security audits and assessments, identifying vulnerabilities and implementing corrective measures that led to a **50%** reduction in potential security breaches."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tAnsible\n\tTerraform\n\n**Cloud & Infrastructure:**\n\tAWS\n\tAzure: App Services, Blob Storage, SQL Database\n\tVMware\n\n**Other:**\n\tLinux\n\tNGINX\n\tActive Directory\n\tSSO\n\tPKI\n\tPowerShell\n\tProblem-solving\n\tCollaboration\n\tCommunication",
  "apply_company": "SolarEdge"
}