{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer (Back End)",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven Software Engineer with 13+ years of experience specializing in **TypeScript**, **JavaScript**, **Microservices**, and **RabbitMQ**. Proven track record in building and managing robust backend systems that leverage **distributed systems** and **message brokers** for enhanced performance. Adept at infrastructure management with a solid understanding of observability and monitoring to ensure system reliability and efficiency.\nStrong problem-solving abilities paired with a collaborative team-oriented approach, enhancing cross-functional synergy and innovation. Additionally, experienced in high-performance application delivery within the healthcare and financial domains, utilizing frameworks and technologies such as **Node.js**, **FastAPI**, **Django**, and **CI/CD** practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer (Back End)",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** and **JavaScript** to develop back-end microservices, ensuring smooth integration with existing systems and adherence to industry standards.\nImplemented message broker solutions using **RabbitMQ** to enhance communication between distributed services, resulting in improved system resilience and scalability.\nApplied observability and monitoring best practices to maintain high system uptime and performance across the microservices architecture, successfully achieving a **99.9%** operational availability.\nCollaborated cross-functionally with front-end teams to design RESTful APIs that efficiently handle requests and data exchange, ensuring seamless user experiences.\nManaged infrastructure using cloud platforms with an emphasis on distributed systems, enhancing deployment efficiency and resource utilization.\nDrove problem-solving initiatives to troubleshoot and resolve complex back-end issues, leading to a **30%** reduction in time-to-resolution for critical incidents.\nParticipated in code reviews and collaborative development, fostering a culture of continuous improvement and knowledge sharing across teams.\n\nLeveraged CI/CD practices to deploy applications and maintain consistency between development and production environments using tools such as GitHub Actions and Azure DevOps.\nIncorporated security best practices within microservices to protect sensitive health and financial data, enhancing compliance and risk mitigation strategies.\nMaintained robust documentation for APIs and services to facilitate team collaboration and onboarding of new developers."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Implemented **microservices** architecture using Node.js and Python, enhancing system scalability and performance for high-volume transactional systems.\n• Collaborated with cross-functional teams to ensure observability and monitoring of applications, improving operational efficiency and reducing downtime.\n• Developed and managed message brokers using **RabbitMQ** to facilitate asynchronous communication and optimize workflow processes.\n• Designed and deployed distributed systems that streamlined infrastructure management, boosting transaction reliability and system resilience.\n• Utilized **TypeScript** and **JavaScript** for building interactive applications, ensuring high-quality, maintainable code in both client and server-side development.\n• Leveraged advanced **problem-solving** skills to troubleshoot complex system issues and implement effective solutions promptly.\n• Delivered real-time analytics dashboards using **React** and **D3.js**, equipped with features that provide instant operational insights into transactions across **3** major teams.\n• Created scalable ETL pipelines using **Python**, supporting both batch and real-time processing of financial data to enhance reporting accuracy and speed.\n• Engineered machine learning models for fraud detection with **scikit-learn** and **XGBoost**, achieving a **20%** reduction in false positives in transaction monitoring.\n• Developed ML pipelines for real-time credit scoring and churn prediction utilizing **MLflow**, integrating model inference seamlessly into existing backend services.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained **Microservices** architecture for a backend system, improving deployment strategies and system scalability to support **high traffic** transactions across key modules like checkout and order fulfillment.\nImplemented message queuing systems with **RabbitMQ** to enable efficient communication between services, enhancing **observability** and **monitoring** for real-time performance insights.\nUtilized **TypeScript** for building robust applications, ensuring type safety and improving collaboration among development teams by enforcing clear interfaces and promoting code quality.\nCollaborated with cross-functional teams to troubleshoot and resolve complex problems, enhancing system reliability in a **distributed systems** environment.\nEngineered real-time features with strong **problem-solving** skills, ensuring fast order processing and inventory management using asynchronous communication.\nIntegrated observability tools to monitor system performance and logging, maintaining uptime goals and improving service level agreements (SLAs) by **20%**.\nLed infrastructure management initiatives to automate deployments and improve CI/CD pipelines, decreasing deployment times by **30%**.\nFacilitated daily standups and participated in code reviews, fostering a culture of continuous improvement and collaboration.\nDrove the transition from monolithic architecture to **Microservices**, increasing the modularity and flexibility of the system, enabling teams to deploy independently.\nEngaged in technical discussions and shared knowledge on **JavaScript** frameworks and best practices, empowering peers and enhancing overall team performance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript, PHP, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob Storage, SQL Database)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Microservices, RabbitMQ, Observability, Monitoring, Message brokers, Infrastructure management, Distributed systems, Problem-solving, Collaboration, Keycloak, Nginx, Let’s Encrypt, Certbot"
}