{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Data Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Data Engineer with 8 years of experience, I excel in database administration, ETL processes, and data warehousing, leveraging my expertise in **SQL Server**, **SQL Server Integrated Services**, and **Cloud Data Warehousing** to deliver high-quality data solutions. Proficient in **Microsoft Fabric** and **Power BI**, I focus on relational database design and ensuring high availability and disaster recovery for critical systems. My proficiency in **Python** enables me to implement robust data pipelines and perform efficient data manipulation.\nAlongside my technical skills, I have a solid background in communication and problem-solving, fostering collaboration in teams and refining my attention to detail in complex projects. My versatile experience also includes building high-performance applications in the healthcare and financial sectors, utilizing cutting-edge technologies such as **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**. I have a strong foundation in microservices architecture and CI/CD automation, ensuring that solutions comply with standards of security and data integrity.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Microsoft Fabric** and **SQL Server** for effective database administration and relational database design, ensuring high availability and disaster recovery across platforms.\nImplemented ETL processes for data ingestion and transformation, optimizing data warehousing strategies leveraging **SQL Server Integrated Services** and **Cloud Data Warehousing** solutions.\nDesigned and maintained complex data models to support analytical needs, ensuring scalability and performance for healthcare and financial platforms.\nDeveloped automated data pipelines in **Python** for data extraction, transformation, and loading, resulting in a **30%** improvement in data processing efficiency.\nCreated and managed data visualization reports and dashboards using **Power BI**, providing real-time insights to stakeholders and enabling data-driven decision-making.\nCollaborated with cross-functional teams to troubleshoot and resolve data discrepancies and performance issues, enhancing overall system reliability and efficiency by **25%**.\nExecuted data quality checks and implemented monitoring solutions to maintain integrity and accuracy of high-volume datasets, ensuring compliance with industry regulations.\nLed communications with stakeholders to gather requirements and articulate technical concepts clearly, facilitating seamless collaboration and project success.\nDemonstrated problem-solving skills by identifying bottlenecks in data workflows and implementing solutions that increased data accessibility and usability.\nMaintained attention to detail in all development processes, resulting in a reduction of data errors by **40%**, further improving reliability for end-users.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Implemented comprehensive **Data Warehousing** strategies utilizing **Microsoft Fabric** and **SQL Server**, enhancing data retrieval performance by **30%**.\n• Developed robust **ETL** processes with **SQL Server Integrated Services** and **Python**, successfully ingesting and transforming data from **20+** sources, resulting in streamlined data analytics.\n• Conducted extensive **Database Administration**, ensuring high availability and disaster recovery strategies that improved system uptime to **99.9%**.\n• Designed and optimized **Relational Database Design** to support efficient data storage and retrieval, significantly reducing query times by **40%**.\n• Devised and created **Power BI** dashboards, providing insightful reports that facilitated better decision-making for stakeholders, and improved business intelligence operations.\n• Applied problem-solving and attention to detail in diagnosing and troubleshooting database issues, leading to a **25%** reduction in downtime incidents.\n• Collaborated effectively with cross-functional teams, enhancing communication and driving projects forward successfully under stringent deadlines while maintaining high quality standards.\n• Utilized **Cloud Data Warehousing** techniques, incorporating **high availability** and backup solutions for improved data reliability and access speeds.\n• Leveraged **R** and **Python** for advanced data analysis, supporting business objectives through in-depth statistical evaluations and actionable insights."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented ETL processes and data integration workflows utilizing **SQL Server Integrated Services (SSIS)** and **Python**, ensuring efficient data ingestion from various sources into the cloud data warehouse with an emphasis on high availability and disaster recovery strategies.\nDesigned and optimized relational database structures with a focus on **SQL** Server, employing best practices for performance tuning, ensuring data integrity and accessibility across the organization.\nDeveloped user-friendly dashboards and reports in **Power BI**, empowering stakeholders with real-time data insights to support decision-making, achieving a reduction in report generation time by **30%**.\nExecuted data warehousing solutions, resulting in a consolidated view of critical data entities, which enhanced data retrieval speeds and simplified analytics for business intelligence purposes across multiple departments.\nCollaborated with cross-functional teams to improve data communication and problem-solving efforts, ensuring complete alignment with business requirements and enhancing overall project delivery efficiency.\nConducted regular database monitoring and maintenance activities, reducing incidences of downtime by **25%** and optimizing system performance through proactive measures.\nEstablished and enforced data governance policies, ensuring compliance with GDPR and other regulations by applying best practices in data security and user access management, particularly focusing on role-based access control (RBAC).\nUtilized **Microsoft Fabric** for seamless data orchestration and management, ensuring a robust and scalable framework for data processing operations.\nApplied attention to detail in all aspects of database administration and design, which facilitated significant improvements in data quality and reliability, reducing data discrepancies by **40%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, R\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL, SQL Server, SQL Server Integrated Services, Database Administration, Relational Database Design\n\n**Cloud & Infrastructure:**\n\tMicrosoft Fabric, Cloud Data Warehousing, High Availability, Disaster Recovery\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Power BI, ETL, Data Warehousing, Communication, Problem Solving, Attention to Detail, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "IPRS Health"
}