{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Analytics Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As an Analytics Engineer with 8 years of full-stack development experience, I possess a robust skill set that includes SQL, dbt, dimensional modeling, Data Vault, and a strong understanding of the ELT process. My technical expertise is complemented by hands-on proficiency in **Looker**, **Tableau Software**, **Qlik**, **Power BI**, and **Snowflake**, enabling me to develop insightful analytics solutions.\nIn addition to my analytics capabilities, I have a strong foundation in **JavaScript/TypeScript**, **Python**, and **Flutter**, and I've worked extensively with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I am well-versed in cloud technologies with deep experience in **Azure** and **AWS**, having built enterprise-grade platforms that effectively integrate AI/ML capabilities for enhanced decision-making.\nI excel in microservices architecture, event-driven systems, and CI/CD automation, ensuring the delivery of robust applications that meet compliance standards, including HIPAA and PCI DSS. I am also fluent in both French and English, contributing to effective communication in distributed team environments. With a self-starter attitude and adaptability in agile settings, I am committed to driving impactful data solutions for business growth.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Analytics Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **SQL** and **Snowflake** for data extraction and transformation, creating reliable and efficient ELT processes for large-scale data analytics.\nCreated and maintained **dbt** models for dimensional modelling and Data Vault strategies, enhancing data accuracy and accessibility for stakeholders.\nDeveloped interactive dashboards and data visualization tools using **Looker**, **Tableau Software**, and **Power BI**, delivering insights into key performance indicators and operational trends, leading to a **20% improvement** in decision-making speed.\nImplemented robust version control practices using **Git**, facilitating collaboration and code management in a **distributed team** environment.\nCommunicated complex data findings effectively in both **fluent French** and **English**, ensuring alignment among diverse teams and stakeholders.\nParticipated in agile ceremonies, contributing to iterative development and continuous improvement of analytics processes, resulting in **15% increase in productivity** across projects.\nDemonstrated self-starter qualities in driving analytics initiatives, leading to the development of new reporting frameworks and enhancing data accessibility for over **100** users.\nCollaborated closely with cross-functional teams to identify business requirements and translate them into functional analytics solutions, prioritizing communication and teamwork.\nDelivered training sessions on best practices for **Qlik** and **Power BI** to empower team members, increasing analytics literacy across the organization.\nOptimized existing reports and dashboards for efficiency, reducing load times by **30%** and improving user experience significantly.\nExplored new data sources and technologies to facilitate advanced analytics initiatives, including enhancing predictive analytics capabilities."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** and **dbt** for robust data transformation and analysis, ensuring efficient handling of large datasets and timely reporting.\nApplied **dimensional modeling** and **Data Vault** methodologies for structuring data warehouses, improving data accessibility and analytical performance in financial systems.\nExecuted **ELT processes** to streamline data ingestion and transformation workflows, enhancing data accuracy and usage speed for downstream analytics.\nDeveloped interactive dashboards and reports using **Looker**, **Tableau Software**, **Qlik**, and **Power BI** to present key financial metrics and insights to stakeholders, enabling data-driven decision-making.\nCollaborated in a **distributed team** by leveraging **Git** for version control and maintaining high coding standards in an **agile environment**, promoting efficient workflows and collaboration.\nDemonstrated excellent **communication skills** by articulating complex data concepts effectively in both **French** and **English**, fostering clear understanding among team members.\nActed as a **self-starter**, championing innovative data strategies and encouraging a culture of continuous improvement across analytics processes."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **SQL** for querying and managing data to support analytical projects, ensuring accuracy and efficiency in data retrieval.\nEmployed **dbt** to transform and model data effectively, focusing on building reliable pipelines for analytics and reporting.\nImplemented **dimensional modelling** and **Data Vault** strategies to enhance data organization and analytics capabilities, facilitating improved decision-making across the organization.\nExecuted the **ELT process** for data integration, ensuring that data flows seamlessly from operational systems to the analytics platform in **Snowflake**.\nLeveraged version control tools like **Git** to manage code changes, enabling collaboration in a distributed team environment by tracking updates in the project lifecycle.\nCreated visually compelling reports and dashboards using **Looker**, **Tableau Software**, **Qlik**, and **Power BI**, resulting in actionable insights for business stakeholders.\nCommunicated complex analytical findings effectively in both **French** and **English**, ensuring clarity and understanding amongst diverse team members.\nCollaborated in an **agile environment**, contributing as a **self-starter** to project goals and timelines while fostering communication within the team.\nAnalyzed and optimized data models in **Snowflake**, ensuring faster query capabilities and efficient data management strategies to support business intelligence needs.\nWorked on data lifecycle management and actively participated in sprint reviews, showcasing analytical projects and updates to stakeholders."
    }
  ],
  "skills": "****API Technologies:****\n\tSQL, dbt, Looker, Tableau Software, Qlik, Power BI, Snowflake\n\n****Backend Frameworks:****\n\tPython(FastAPI, Flask, Django)\n\n****Databases:****\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n****DevOps:****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n****Cloud & Infrastructure:****\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n****Other:****\n\tMLflow, Airflow, Kubeflow, Git, dimensional modelling, Data Vault, ELT process, fluent in French, fluent in English, communication skills, working in a distributed team, agile environment, self-starter\n\n****Frontend Frameworks:****\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n****Authentication & Security:****\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}