{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Software Engineer with 8 years of experience specializing in full stack development, focusing on modern technologies including **React**, **TypeScript**, **Next.js**, **Node.js**, and **PostgreSQL**. Proven expertise in building scalable and secure SaaS applications, leveraging cloud services such as **AWS** and adhering to Agile methodologies. Skilled in implementing CI/CD pipelines and applying software design patterns effectively to optimize development processes.\n\nDemonstrated ability to lead projects with a strong foundation in distributed computing and DevOps practices. Experienced in architecting microservices and event-driven systems to support high-performance solutions in the healthcare and finance sectors. Additionally, I possess a solid background in developing machine learning pipelines and MLOps workflows, integrating them seamlessly for predictive analytics and automation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** (17-18) and **TypeScript** to architect and develop scalable full-stack healthcare and financial platforms, ensuring compliance with HIPAA, FHIR, GDPR, and PCI DSS standards while leveraging modern frameworks such as **Next.js** and **Node.js**.\nImplemented robust **DevOps** practices using **CI/CD** pipelines with tools such as GitHub Actions and Azure DevOps, enhancing automation for efficient software delivery.\nDesigned and maintained high-performance databases using **PostgreSQL** for large-scale data management, optimizing storage and querying processes to support healthcare and financial applications.\nEmployed distributed computing principles to re-architect monolithic applications into microservices, utilizing tools like Docker and Kubernetes (AKS/EKS) to ensure high availability and fault tolerance.\nLed the integration of Agile methodologies throughout the software development lifecycle, ensuring rapid and iterative development processes.\nDeveloped cross-platform mobile applications with **React Native** and **Flutter**, enhancing user experience on both iOS and Android platforms with efficient state management techniques.\nExecuted enterprise-level software design patterns to improve maintainability and scalability of complex applications.\nDelivered production-ready financial data visualization tools using **D3.js** and **Power BI** Embedded to enable real-time insights into transaction trends, achieving a 30% increase in operational efficiency.\nImplemented automated testing and coverage strategies using Jest, Cypress, and Pytest, ensuring reliability across both front-end and backend services.\nIntegrated advanced search capabilities using **Azure Cognitive Search** and **ElasticSearch** across millions of health records, providing quick access to critical information.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and modernized applications using **React (18)**, **Typescript**, and **Next.js**, enhancing user experience and performance for financial services.\n• Designed microservices architecture with **Node.js** to improve scalability and maintainability, achieving a throughput increase of over **30%** in transaction processing.\n• Collaborated in an Agile environment to ensure timely delivery of software features, resulting in a **25%** reduction in time-to-market for new releases.\n• Implemented continuous integration and continuous deployment (CI/CD) pipelines, utilizing **AWS tools**, streamlining the deployment process, and reducing deployment errors by **40%**.\n• Leveraged **PostgreSQL** for efficient data storage and retrieval, enhancing overall system responsiveness and ensuring data integrity during high-volume transactions.\n• Applied Software Design Patterns to create reusable and efficient code structures, leading to a **20%** reduction in code redundancy across the project.\n• Engineered distributed computing solutions to handle real-time data processing and analytics, significantly improving operational capabilities in transaction monitoring.\n• Contributed to DevOps practices to foster better collaboration between development and operations teams, enhancing software reliability and performance.\n• Participated in the development of a SaaS product offering, providing scalable solutions for clients and improving user engagement by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Demonstrated proficiency in **React (18)** and **TypeScript** by developing frontend applications that deliver fast, responsive user experiences on both web and mobile platforms.\n- Utilized **Next.js** for creating responsive, SEO-friendly e-commerce UIs optimized for mobile-first engagement and accessibility compliance (WCAG 2.1).\n- Engineered backend services using **Node.js (NestJS, Express)** to ensure high availability, low latency, and scalability for key e-commerce modules like checkout, cart, and order fulfillment.\n- Managed data storage with **PostgreSQL** and implemented distributed computing to ensure fast, fault-tolerant data access for high-traffic e-commerce workflows.\n- Leveraged **AWS** for cloud-based deployments, ensuring scalable and reliable infrastructure for backend services and applications.\n- Adopted Agile methodologies to drive project delivery in 2-week sprints, improving team collaboration and project visibility.\n- Implemented CI/CD pipelines using **DevOps** practices to automate testing and deployment, resulting in a 30% faster time-to-production.\n- Applied software design patterns to improve code maintainability and scalability, supporting the addition of new features with minimal rework.\n- Contributed to the development of **SaaS** solutions by integrating AI/ML-based recommendation engines using **scikit-learn**, improving conversion rates by **25%**.\n- Managed feature flags and blue-green deployments using **Kubernetes** for controlled rollouts, enabling A/B testing and risk mitigation during major platform updates.\n- Enhanced real-time responsiveness through WebSockets and event-driven architecture powered by **Kafka** and **RabbitMQ**, facilitating real-time order updates and customer support.\n- Built secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI-compliance and the handling of sensitive data using tokenization.\n- Implemented role-based access control (RBAC) and **OAuth 2.0** to ensure GDPR compliance and secure customer administration access throughout the platform."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, Next.js, TypeScript, JavaScript\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django), Node.js\n\n**API Technologies:**\n\t\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Agile, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Other:**\n\tSoftware Design Patterns, Distributed Computing, SaaS, MLflow, Airflow, Kubeflow",
  "apply_company": "Weflow"
}