{
  "name": "Rei Taro",
  "role_name": "Senior ML Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior ML Engineer with over 10 years of experience in Machine Learning, AI, Data Science, and MLOps, delivering efficient model deployment and monitoring solutions in cloud-native architectures. Skilled in **Python** (FastAPI, Django, Flask) and proficient in **Cloud Computing** on platforms such as **AWS** and **Azure**. Proven expertise in testing, documentation, and governance practices that ensure high-quality deliverables. A collaborative problem solver with a strong track record at leading organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Developed and deployed scalable **Machine Learning** models using **Python** and ensured robust **Model Deployment** techniques.\n• Engineered automated pipelines for **Data Science** workflows, integrating **MLOps** practices for continuous monitoring and governance of ML models.\n• Leveraged **Cloud Computing** platforms, specifically **Azure** services, to optimize model performance and scalability, resulting in enhanced processing speeds by up to **25%**.\n• Collaborated with data scientists to document systematic approaches and best practices, enhancing **Documentation** processes by **30%**.\n• Conducted rigorous **Testing** and validation of ML models to identify and solve integration issues, leading to a **15%** reduction in deployment errors.\n• Facilitated cross-functional cooperation to strategize solutions for complex problems, increasing team efficiency through structured **Collaboration** efforts.\n• Created and managed project documentation and technical specifications, ensuring high standards and compliance with project requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Applied **Cloud Computing** strategies and frameworks to deploy scalable machine learning models on Azure while ensuring robust governance and monitoring.\nDeveloped and optimized Python-based applications to automate processes, enhancing **AI** and **Machine Learning** workflows, and utilizing best practices in **MLOps** for model deployment.\nEngineered data pipelines to manage and monitor data flows using **Apache Airflow** and **Azure Functions**, with a focus on security for regulatory compliance, ensuring a **99%** uptime rate in data processing.\nCollaborated effectively across teams to troubleshoot complex problems, driving solutions that improved model accuracy by **15%** through documentation and comprehensive testing methodologies.\nEmployed advanced **Data Science** techniques to analyze and report on model performance, delivering insights that guided strategic decisions for data governance initiatives.\nLed the implementation of **testing** protocols and security audits, ensuring alignment with industry standards and incorporating feedback from cross-functional stakeholders to foster innovation."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented **Machine Learning** models for data-driven decision making, enhancing predictive capabilities in trading operations by **20%**.\nDeveloped **AI** algorithms using **Python** to automate portfolio management processes, reducing operational time by **30%**.\nEngineered model deployment solutions utilizing **Cloud Computing** services to ensure scalable and efficient execution of **Machine Learning** applications.\nCollaborated with cross-functional teams to optimize **Data Science** practices and maintain consistent documentation for all processes, enhancing clarity and reducing onboarding time by **15%**.\nMonitored advanced **AI** models for performance and reliability, utilizing tools for ongoing **Monitoring** to ensure alignment with regulatory **Governance** requirements such as MiFID II and GDPR.\nDesigned and executed testing protocols with frameworks such as PyTest to validate model performance, achieving an **85%** accuracy rate in predictions.\nFostered a strong collaborative environment for **MLOps**, effectively streamlining the integration of new features into existing platforms and improving overall system performance.\nProblem-solved complex issues related to data processing using **Python**, enhancing the execution of backend services for trade execution and real-time data delivery."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices, Kafka\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Other**\n\tMachine Learning, AI, Data Science, MLOps, Cloud Computing, Model Deployment, Monitoring, Governance, Documentation, Testing, Collaboration, Problem Solving, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest",
  "apply_company": "Ageas UK"
}