{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Fullstack Engineer with 13+ years of experience in delivering high-performance applications, specifically in the healthcare and financial sectors. Expertise in **Node.js**, **React**, and **TypeScript**, with a strong background in both frontend and backend development, utilizing **Express.js**, **PostgreSQL**, and **MySQL**. Proficient in deploying cloud-native solutions on **Azure** and implementing **CI/CD** pipelines, **DevOps** practices, and containerization with **Docker**.\n\nSkilled in leveraging **OAuth2** and **JWT** for secure authentication, alongside version control using **Git**. Specialized in building and maintaining microservices and event-driven architectures. Demonstrated ability in achieving compliance with industry standards such as HIPAA, PCI DSS, and SOC 2. Additionally, possess hands-on experience in MLOps with tools like MLflow and Airflow, enhancing predictive analytics and automation capabilities.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed full-stack applications with a focus on **Node.js**, **React** (17–18), and **TypeScript**, ensuring adherence to security protocols such as OAuth2 and JWT for user authentication.\n• Engineered RESTful APIs using **Express.js** to facilitate seamless data interaction with front-end components, while utilizing **PostgreSQL** for robust database management and storage solutions.\n• Designed CI/CD pipelines leveraging **Docker** and Git-based workflows for streamlined DevOps integration, enhancing deployment efficiency by **30%** across multiple environments.\n• Implemented comprehensive testing frameworks using **Jest** to ensure code reliability, leading to a reduction in production bugs by **25%**.\n• Managed Linux-based server configurations to optimize performance and security of application deployments, contributing to improved uptime by **15%**.\n• Facilitated continuous improvements in development processes through Agile methodologies, ensuring timely project deliveries and enhanced team collaboration.\n• Mentored junior developers in the stack including **Node.js**, **React**, and foundational DevOps practices, fostering a culture of knowledge sharing and professional growth within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and maintained scalable applications using **Node.js** (particularly **Express.js**) for backend services, ensuring robust performance and seamless user experience.\n• Created dynamic and interactive front-end applications utilizing **React** (version **18**) and **TypeScript**, integrating state management via Redux Toolkit to maintain application efficiency.\n• Implemented efficient database solutions using **PostgreSQL** and **MySQL**, optimizing data storage and retrieval for high-volume transaction systems.\n• Ensured security in application development by implementing **OAuth2** and **JWT** for user authentication and authorization, fostering a secure environment for users.\n• Leveraged **Azure** cloud services for deployment and management of applications, enhancing scalability and reliability while reducing infrastructure costs.\n• Streamlined development processes through the use of **Git** for version control and **Docker** for containerization, promoting consistency across development environments.\n• Established continuous integration and delivery (CI/CD) pipelines that accelerated deployment cycles through automation.\n• Utilized **Linux** environments for deploying and managing applications, ensuring high availability and responsiveness.\n• Applied **Jest** for unit testing, ensuring code quality and functionality prior to production releases."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Node.js** (NestJS, **Express.js**) for building highly scalable backend services, enhancing system performance for e-commerce modules, achieving **99.9%** uptime across checkout, cart, and order fulfillment functionalities.\nDeveloped robust frontend applications using **React** (18) and **TypeScript**, ensuring a responsive user experience with load times reduced to under **2 seconds** on both web and mobile platforms.\nExecuted CI/CD pipelines through **Git** and **Docker**, optimizing deployment processes with a **30%** reduction in release cycles, thereby increasing development efficiency and team productivity.\nUtilized **PostgreSQL** for managing distributed data storage, achieving **15%** faster data retrieval in high-traffic scenarios by implementing advanced indexing strategies.\nImplemented secure authentication protocols with **OAuth2** and **JWT**, achieving compliance with GDPR standards, enhancing data security for over **10,000** users.\nExecuted end-to-end testing and integration tests utilizing **Jest**, ensuring feature reliability and minimizing regression issues in production.\nEngaged in collaborative DevOps practices within a **Linux** environment, driving continuous improvement in application performance and operational efficiency by leveraging monitoring tools to maintain system health and utilize resources effectively.\nDesigned and integrated APIs utilizing **Node.js**, enhancing functionality with third-party services and implementing caching strategies that improved application speed by **40%**.\nApplied **CI/CD** practices that streamlined deployments and reduced downtime, resulting in increased productivity across development teams.\nFostered a culture of collaboration using tools like Azure for project management and team communication, ensuring alignment across functionalities and timely feature rollouts."
    }
  ],
  "skills": " **Programming Languages:**\n\tNode.js, Python, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Express.js\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Linux, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Jest",
  "apply_company": "inhire.io"
}