{
  "name": "Patryk Zaslawski",
  "role_name": "AI Research Engineer (Fine-tuning)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a dedicated AI Research Engineer with expertise in **large language models**, **fine-tuning optimization**, and **algorithmic improvements**, I am committed to advancing AI technology. My proficiency in **PyTorch** and **Hugging Face** enables me to effectively work with **transformer architectures** to enhance model performance. I have a strong background in **data curation** and developing robust **evaluation frameworks**, which are critical for comprehensive model assessment and improvement. With 8+ years of software engineering experience as a Senior Python Full Stack Developer, I also bring valuable skills in **Python** (FastAPI, Django, Flask), **frontend frameworks** (Angular, Vue, React, Next.js), and cloud services (**AWS**, **Azure**) to support a well-rounded technical foundation. I excel in **cross-functional collaboration** and have strong **communication skills** to foster teamwork and drive projects to success.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "AI Research Engineer (Fine-tuning)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed fine-tuning optimization techniques using **PyTorch** and **Hugging Face** for large language models, focusing on enhancing performance and accuracy.\n- Collaborated cross-functionally with teams to leverage **transformer architectures** in AI applications, fostering effective communication and teamwork for successful project execution.\n- Curated comprehensive datasets for training and testing, ensuring high-quality data for model evaluation and improvement, leading to a measurable increase in model robustness by **25%**.\n- Implemented algorithmic improvements with demonstrable effects on inference speed, reducing latency in model response times by at least **15%**.\n- Created evaluation frameworks to assess model performance, enabling rigorous testing and validation processes that contributed to a **20%** improvement in predictive accuracy.\n- Spearheaded workshops and sessions to enhance cross-disciplinary communication skills among the team, fostering a collaborative environment conducive to innovation and knowledge sharing.\n- Conducted detailed analysis of model outputs and user feedback for continuous improvement, leading to a better alignment of AI solutions with user needs.\n- Championed best practices in documentation and reporting, ensuring transparency in workflow processes and easier onboarding for new team members.\n- Monitored developments in AI and machine learning, integrating current findings into ongoing projects for sustained competitive advantage in the field."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Collaborated cross-functionally to implement **large language models** using **PyTorch** and **Hugging Face**, focusing on fine-tuning optimization that improved model performance by **20%**.\n- Developed and optimized **transformer architectures** for language processing tasks, achieving a reduction in processing time by **15%**.\n- Led efforts in **data curation**, ensuring high-quality datasets for training purposes, which contributed to a **35%** improvement in the accuracy of predictive models.\n- Applied **evaluation frameworks** to assess model performance, leading to iterative algorithmic improvements and enhancements in deployment efficiency.\n- Communicated effectively with stakeholders to align AI research projects with business goals, ensuring transparency and generating collaborative insights.\n- Used advanced techniques in model fine-tuning and resolution of complex algorithmic challenges, consistently meeting project deadlines with high-quality outputs.\n- Participated in the development of comprehensive documentation and training materials to facilitate cross-training among team members in AI methodologies.\n- Conducted regular presentations on research progress and findings, demonstrating strong communication skills and fostering knowledge sharing within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Employed advanced techniques for **fine-tuning optimization** of large language models using **PyTorch** and **Hugging Face**, enhancing model performance and accuracy across various tasks.\nConducted **data curation** to ensure high-quality training datasets, improving the effectiveness of model training by at least **20%**.\nCollaborated cross-functionally with teams to communicate project requirements and share insights on **algorithmic improvements**, demonstrating strong **communication skills**.\nImplemented **evaluation frameworks** to systematically assess model outputs, ensuring that enhancements met predefined benchmarks, achieving accuracy improvements of up to **15%**.\nDesigned and developed models based on **transformer architectures**, deploying innovations that led to significant processing speed enhancements for processing large datasets.\nStreamlined the **fine-tuning** process by developing methods that reduced computational overhead, allowing faster iteration cycles and quicker deployments.\nUtilized feedback loops from cross-functional teams to fine-tune models further, ensuring alignment with business objectives and user needs.\nConducted systematic performance evaluations of fine-tuned models using statistical methodologies, contributing to the overall improvement of AI research reliability.\nManaged and processed large-scale datasets effectively, demonstrating strong analytical skills and attention to detail in data handling.\nEngaged in continuous learning and skill enhancement for emerging AI techniques, maintaining up-to-date knowledge in the rapidly evolving AI landscape."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Cloud & Infrastructure:**\n\tNginx, Certbot, Let’s Encrypt\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, PyTorch, Hugging Face, large language models, fine-tuning optimization, transformer architectures, data curation, algorithmic improvements, evaluation frameworks, cross-functional collaboration, communication skills"
}