{
  "name": "Tomasz Lee",
  "role_name": "AI Product Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic AI Product Engineer with 9+ years of experience in developing and optimizing production systems and data management strategies. Proven expertise in implementing machine learning techniques and ensuring clean data acquisition for robust AI solutions. Adept at utilizing **.NET**, **C#**, **ReactJS**, **NextJS**, **Apache Kafka**, **RabbitMQ**, **Redis**, and cloud services to support innovative product development. Strong problem-solving skills and a collaborative team player, dedicated to enhancing efficiency and driving project success through initiative and technical excellence.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "AI Product Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Utilized **machine learning** techniques to enhance the data management strategy of the web-based customer management platform, ensuring effective clean data acquisition.\n• Spearheaded the design and development of a web-based customer management platform using **.NET 7**, **ReactJS**, and **Next.js**, improving user satisfaction by **25%**.\n• Implemented **AI** algorithms to analyze user behavior and improve system efficiency in production systems.\n• Designed and implemented a microservices architecture using **.NET Core** to modularize the system for scalability and maintainability.\n• Integrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, resulting in improved system resilience and throughput.\n• Utilized **Redis** for caching frequently accessed data, reducing database load and improving response times by **35%**.\n• Developed **RESTful APIs** with **.NET**, integrated with a **MongoDB** database to provide seamless data access for various services.\n• Implemented **CI/CD** pipelines on **Azure DevOps**, reducing deployment time by **40%**.\n• Optimized **MSSQL** database queries and indexing, reducing average query execution time by **20%**.\n• Collaborated with UX/UI designers to enhance the platform’s user interface, leading to an improved user experience through effective team collaboration.\n• Developed a reporting engine using **D3.js** and **Three.js** for interactive data visualizations, demonstrating initiative in utilizing modern framework capabilities.\n• Implemented **JWT**-based authentication and authorization for securing the application, enhancing problem-solving approaches to security challenges."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **machine learning** techniques to enhance product functionality, improving data analysis accuracy by **20%**.\nImplemented efficient **data management** strategies to ensure **clean data acquisition**, resulting in a **30%** decrease in data processing times.\nUtilized **AI** frameworks to develop predictive models for user behavior, increasing **team collaboration** effectiveness by **15%**.\nDesigned scalable **production systems** that utilized **cloud-based technologies**, leading to improved system reliability and performance.\nProactively solved complex problems in dynamic environments, demonstrating initiative in optimizing product features.\nEnhanced user experience through improved engagement metrics leveraging **ReactJS** and **Tailwind CSS**, increasing user interaction by **25%**.\nFacilitated effective communication in English with cross-functional teams to gather requirements and deliver projects on time, improving stakeholder satisfaction.\nConducted regular code reviews and offered mentorship to junior developers, fostering a collaborative team culture and improving overall productivity.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Applied **data management** techniques to enhance internal CRM system efficiency, contributing to a **20%** increase in sales team productivity.\n• Utilized **AI** strategies to improve decision-making processes within production systems.\n• Employed **problem-solving** skills to implement **RabbitMQ** for asynchronous processing of customer notifications, leading to a reduction in system load during peak usage.\n• Developed reusable components in **C#** and **Angular**, allowing for accelerated future project development that meets **efficiency** metrics.\n• Optimized SQL Server databases for effective customer data retrieval, increasing query speed by **30%**.\n• Led migration of legacy systems from **ASP.NET WebForms** to **.NET Core**, resulting in enhanced performance and maintainability, achieving a performance boost of **25%**.\n• Collaborated with DevOps teams using **Azure** for automated builds and releases, improving deployment frequency by **15%**.\n• Integrated third-party APIs to facilitate clean data acquisition, promoting seamless inter-system data sharing.\n• Enhanced user interface on client dashboards through **Vue.js**, improving user satisfaction by conducting direct user feedback sessions.\n• Actively participated in team collaboration through daily standups and code reviews, ensuring project goals are met and maintained.\n• Produced comprehensive technical documentation and user guides that streamlined knowledge transfer among teams, ultimately enhancing team collaboration."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, TypeScript, C#, .NET, Python\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS\n\n **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\tAWS, Azure\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tCI/CD pipelines\n\n **Cloud & Infrastructure**\n\tMicroservices\n\n **Other**\n\tUX/UI Design, Git, GitHub, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, AI, data management, machine learning, clean data acquisition, production systems, problem-solving, English proficiency, team collaboration, initiative, efficiency"
}