{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior HTML Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior HTML Engineer, I bring a strong proficiency in **HTML**, **CSS**, **SCSS**, **UI/UX design**, and **Responsive Design** with 8 years of experience in delivering high-quality web applications. My background includes ensuring **Cross-Browser Compatibility**, maintaining **Accessibility Standards**, and leveraging modern tools like **Figma**, **Sketch**, **Photoshop**, **Sass**, and frameworks like **Bootstrap**, **Tailwind**, and **Angular** to create user-focused designs. I excel in enhancing web performance optimization and implementing seamless CSS/JS animations, utilizing automation tools such as **Gulp** and **Webpack**. \n\nIn addition to my front-end expertise, I have a solid foundation in full-stack development using **JavaScript**, **TypeScript**, **Python**, and **Flutter**, with hands-on experience in using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have successfully led the development of enterprise-grade platforms and integrated AI/ML capabilities into applications, bringing depth of experience in machine learning pipelines and MLOps workflows with tools like **MLflow**, **Airflow**, and **Kubeflow**. I thrive in collaborative environments and prioritize attention to detail, ensuring robust, scalable solutions adhere to best practices and compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior HTML Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed high-quality, responsive web applications using **HTML**, **CSS**, **SCSS**, and modern frameworks such as **Bootstrap** and **Tailwind** to ensure cross-browser compatibility and meet **accessibility standards**.\n- Collaborated with UI/UX designers to create visually appealing interfaces, utilizing tools like **Figma**, **Sketch**, and **Photoshop** to maintain a strong focus on user experience and attention to detail.\n- Implemented performance optimization strategies, leveraging techniques such as **Gulp**, **Webpack**, and efficient asset delivery to enhance load times by up to **30%**.\n- Created CSS and JS animations to improve user engagement using libraries like **GSAP** and **ThreeJS**, resulting in an **improved user metrics** of over **25%** interaction rates.\n- Applied responsive design principles to ensure seamless experiences on various devices, positively impacting mobile user retention by **15%**.\n- Managed version control and collaboration through **Git**, maintaining code integrity and facilitating team contributions.\n- Developed user interface components using template engines like **Pug** and **Handlebars**, ensuring code efficiency and maintainability.\n- Engaged in continuous learning and implementation of best practices in web development focusing on collaboration and maintaining high coding standards.\n- Conducted thorough testing and debugging to ensure cross-platform functionality and adherence to quality assurance practices."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **HTML**, **CSS**, and **JavaScript** to develop responsive, user-focused web applications that enhanced user experience and adhered to accessibility standards.\nImplemented **SCSS** and **Tailwind CSS** for styling and responsive design, ensuring optimal viewing across devices and browsers with an emphasis on cross-browser compatibility.\nCollaborated with design teams using tools like **Figma** and **Sketch** to translate UI/UX concepts into functional web pages, applying attention to detail in the execution of designs and animations.\nOptimized web performance through advanced techniques, including **Gulp**, **Webpack**, and **Bootstrap**, achieving a **30%** increase in page load speeds and user engagement.\nEmployed **JavaScript** libraries for animations such as **GSAP** and **ThreeJS** to enhance interactivity and visual appeal in projects, increasing user retention by **20%**.\nMaintained code quality and version control using **Git**, facilitating collaboration across an agile development environment.\nDeveloped interactive features and dynamic content using advanced frameworks like **React** and **Angular**, increasing the functionality and usability of web applications.\nCreated and iterated on design systems and components to ensure cohesiveness across pages and applications, integrating feedback from cross-functional teams for continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed responsive and SEO-friendly user interfaces using **HTML5**, **CSS3**, and **JavaScript**, ensuring a seamless user experience across various devices and browsers, optimizing for both performance and accessibility standards (WCAG 2.1).\n• Employed modern design tools such as **Figma** and **Photoshop** to create visually appealing UI/UX designs, focusing on user engagement and interaction, while adhering to best practices in **Responsive Design** and **Cross-Browser Compatibility**.\n• Enhanced web performance through techniques including **CSS/JS Animations** and **Web Performance Optimization**, achieving a **30%** reduction in load times across key pages.\n• Collaborated with cross-functional teams to maintain an efficient workflow and ensure high code quality using **Git**, promoting best practices in version control and collaborative development.\n• Integrated **Tailwind CSS** and **Bootstrap** to streamline the development process and maintain a consistent design language across the platform, leading to faster implementation of UI components.\n• Utilized **Gulp** and **Webpack** for task automation and module bundling, improving build times by **25%** and enhancing overall development efficiency.\n• Conducted thorough testing and debugging to ensure cross-browser compatibility and adherence to **Accessibility Standards**, enabling an inclusive experience for all users.\n• Fostered a culture of collaboration and attention to detail within the team, leading to improved product quality and timely delivery of features in line with organizational goals."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n **Frontend Frameworks:**\n\tHTML, CSS, SCSS, UI/UX, Responsive Design, Cross-Browser Compatibility, CSS/JS Animations, Figma, Sketch, Photoshop, Sass, Less, Bootstrap, Tailwind, Pug, Handlebars, Canvas API, WebGL, ThreeJS, GSAP\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tCollaboration, Attention to Detail, Web Performance Optimization, Accessibility Standards, Gulp, Webpack",
  "apply_company": "BrainRocket"
}