{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Software Engineer with 13+ years of experience in full-stack development, leveraging expertise in **JavaScript**, **TypeScript**, **React**, and **Next.js** to deliver high-performance applications. Proficient in implementing **CI/CD** practices, ensuring adherence to software development standards and code quality. Adept at deploying scalable solutions on **AWS**, fostering collaborative communication and product architecture design.\nDemonstrated ability in integrating advanced technologies within healthcare and financial sectors, specializing in AI/ML platforms that facilitate predictive analytics and real-time processing. Versatile skill set includes frontend and backend development with frameworks such as **Flutter**, **Vue**, **Node.js**, and backend technologies like **FastAPI** and **Django**. Strong focus on compliance-driven solutions, aligning with HIPAA, FHIR, PCI DSS, and SOC 2 standards, complemented by a solid foundation in MLOps using tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, **React (17–18)**, and **Next.js** to design and build full-stack platforms for healthcare and fintech, ensuring high standards of code quality and adherence to software development practices.\nImplemented and maintained robust CI/CD pipelines with tools such as **Fastlane**, **App Center**, **GitHub Actions**, and **CircleCI** to automate deployment workflows and enhance development efficiency.\nApplied modern software development practices, focusing on collaborative communication with cross-functional teams to deliver high-quality products, fostering an agile and responsive work environment.\nDeveloped modular architectures using **React** to create responsive user interfaces that promote seamless user experiences in both healthcare and finance applications.\nEmployed **AWS** services for deploying scalable and fault-tolerant solutions, leveraging cloud infrastructure to support microservice architectures and high-availability applications.\nAdhered to structured testing strategies, utilizing frameworks such as **Jest**, **Cypress**, and **Postman** to ensure comprehensive coverage, conducting over **100** unit and integration tests to maintain code integrity.\nExecuted code quality checks, enabling continuous integration and delivery cycles that significantly reduced deployment times by approximately **30%**.\nWorked collaboratively with teams to establish a strong product architecture focused on delivering user-centric solutions, emphasizing rapid iteration and feedback loops.\nMonitored and resolved issues in production environments, ensuring application reliability and performance metrics consistently met targets across user load.\nContributed to knowledge-sharing sessions and technical documentation, improving team communication and understanding of project goals, which led to a **15%** increase in overall project delivery speed."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Javascript** frameworks like React (18) and Next.js to build interactive front-end applications, focusing on code quality and software development practices for financial tools and admin panels.\nImplemented **Typescript** for enhanced type-checking and maintainability in projects, driving a better development process through collaborative communication.\nEngineered CI/CD pipelines to streamline deployment processes for various applications, ensuring rapid and reliable updates using cloud services such as **AWS**.\nModernized financial systems by integrating **microservices architecture** with **Node.js** and Python frameworks, optimizing scalability and performance in handling over **10,000 transactions/min**.\nDelivered real-time analytics dashboards employing React and D3.js, equipping operations teams with immediate insights on **100%** transaction queries and anomalies.\nDesigned an event-driven architecture using **Kafka** and **RabbitMQ** for asynchronous communication between workflows, accomplishing seamless transitions in payment and alert systems across high-volume transactions.\nDeveloped ETL pipelines with **Python** and **Apache Airflow** to ingest large sets of financial data, managing both batch processing of over **5TB/month** and real-time analytics.\nCreated machine learning models for fraud detection, utilizing tools like **scikit-learn** and **XGBoost**, achieving a fraud detection rate improvement of **30%** based on transactional behavior analysis.\nEstablished ML pipelines for real-time functionalities such as credit scoring and churn prediction, integrating with backend services to elevate user experience."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented robust software development practices utilizing **JavaScript**, **React (18)**, and **TypeScript** to enhance code quality and maintainability across multiple components of the e-commerce platform.\nDesigned and developed responsive UI components with **Next.js** for improved performance and SEO, achieving a loading time reduction of **30%** compared to previous versions.\nCollaborated with cross-functional teams to define product architecture, ensuring scalability and alignment with user requirements, leading to feature rollouts that met deadlines **90%** of the time.\nStreamlined CI/CD processes leveraging AWS services, resulting in a **40%** decrease in deployment times and minimizing operational risks.\nEngaged in collaborative communication to gather requirements and technical insights, fostering an environment that supported innovative solutions and addressed client needs timely.\nParticipated in the integration of monitoring tools, improving code quality checks, which led to a **25%** reduction in production issues.\nMaintained high standards of software quality through diligent testing and peer reviews, ensuring the reliability of key system components."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3; Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Terraform, Ansible, Helm, Docker Compose, Nginx, Let’s Encrypt, Certbot, CI/CD, Software Development Practices, Code Quality, Product Architecture, Collaborative Communication"
}