{
  "name": "Patryk Zaslawski",
  "role_name": "Senior C++ Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior C++ Engineer with 8+ years of experience in software engineering, I excel in building and optimizing high-performance applications with a focus on **C++**, leveraging **CMake** for efficient project management and **Google Test** for rigorous quality assurance. My experience includes developing robust solutions in Unix/Linux environments, where I employ advanced **Concurrency** techniques and **State Machines** to enhance system functionality. I am passionate about problem-solving and bringing creativity to technical challenges, ensuring scalable and reliable software design. My background also encompasses modern development practices, allowing me to integrate seamlessly with teams and deliver exceptional results.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior C++ Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed and optimized C++ applications ensuring high performance and efficiency by leveraging **C++**, **CMake**, and **Google Test** for testing.\n• Applied problem-solving skills to debug and enhance existing systems while implementing **Protocol Buffers** for efficient serialization across services.\n• Collaborated on concurrent programming projects, utilizing concepts of concurrency and state machines to create responsive multi-threaded applications in **Linux** and **Unix** environments.\n• Proactively identified performance bottlenecks and designed solutions to enhance system throughput, achieving up to a **30% increase** in process efficiency.\n• Led efforts in integrating complex algorithms and state machines into C++ applications, showcasing creativity in solving technical challenges.\n• Mentored junior engineers on best practices in **C++ programming**, enhancing team capabilities in software design and implementation.\n• Conducted code reviews and quality assurance, ensuring adherence to coding standards and fostering a culture of continuous improvement.\n• Implemented automated testing solutions using **Google Test** to ensure software robustness and reliability, achieving **95% test coverage** on critical code paths.\n• Designed and implemented features with an agile mindset, iteratively improving product functionality based on stakeholder feedback.\n• Collaborated with cross-functional teams to deliver synchronized solutions, focusing on communication and collaboration to enhance project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Implemented advanced algorithms in **C++** to optimize performance and ensure efficient execution in concurrent environments, leveraging **Cmake** for build management.\nDesigned and built robust systems incorporating **Protocol Buffers** for efficient data serialization, improving data interchange between different system components.\nDeveloped and maintained high-quality unit tests using **Google Test**, enhancing code reliability and supporting efficient debugging processes.\nApplied problem-solving skills to troubleshoot complex software issues within **Unix** and **Linux** systems, ensuring consistent system performance and stability.\nLeveraged state machines to design complex workflows, improving the responsiveness and flexibility of systems.\nCollaborated with cross-functional teams to create innovative features, demonstrating creativity and vision in software design and user experience.\nOptimized multi-threading and concurrency within applications, enhancing scalability and application performance by reducing execution time.\nContributed to the architectural design of scalable systems that process large volumes of data, ensuring high availability and responsiveness under peak loads.\nImplemented continuous integration tools to automate quality assurance, leading to improved deployment frequency and reduced defect escape rates."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **C++** to develop high-performance backend services, ensuring low latency and efficient resource management across multiple modules.\nImplemented **Protocol Buffers** for data serialization, improving communication efficiency between microservices, with effective data handling for large datasets in versions up to **3.17**.\nEngaged in **Concurrency** programming to enhance multi-threaded applications, successfully managing simultaneous operations and reducing processing time on Linux environments.\nDesigned and maintained build systems using **CMake**, streamlining compilation processes and ensuring consistent builds across diversified environments with a focus on reducing build times by **25%**.\nPerformed unit testing and integration testing using **Google Test**, achieving a code coverage of **92%** through effective test cases, ensuring high reliability and maintainability of the codebase.\nApplied creativity and problem-solving skills to resolve complex technical challenges, optimizing algorithms for performance and improving efficiency in software solutions.\nDeveloped state machines to manage application workflows, significantly reducing complexity and enhancing the clarity of software logic in critical modules.\nCollaborated with cross-functional teams to identify system requirements, communicate design changes, and integrate new features, ensuring alignment with business goals.\nConducted performance analysis and debugging in Unix/Linux systems, identifying bottlenecks and implementing solutions that boosted performance metrics by **30%**. \nTrained and mentored junior developers in **C++** best practices and design patterns, fostering a collaborative environment focused on continuous improvement and knowledge sharing."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, C++ \n\n**Backend Frameworks:** \n\tFastAPI, Django, Flask, Spring Boot \n\n**Frontend Frameworks:** \n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor \n\n**API Technologies:** \n\tREST APIs, gRPC APIs, Protocol Buffers \n\n**Serverless and Cloud Functions:** \n\tAWS (Lambda), Azure (App Services) \n\n**Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis, SQLAlchemy \n\n**DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD \n\n**Cloud & Infrastructure:** \n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot \n\n**Other:** \n\tPydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Unix, Linux, Concurrency, State Machines, Problem-solving, Creativity, Let’s Encrypt, ",
  "apply_company": "Tietoevry"
}