{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior QA Engineer with 13+ years of experience in automation and performance testing across the healthcare and financial sectors. Proficient in UI Testing and API Testing using **Selenium** and **JUnit**, alongside strong skills in **JavaScript**, **Golang**, **Java**, **C#**, **CSS**, **HTML**, **DOM**, and **Git** to ensure high-quality software delivery. Experienced in Agile methodologies and Test-Driven Development (TDD) to enhance coding efficiency and maintainability.\n\nSpecialized in automating testing processes and developing comprehensive testing frameworks, leveraging strong communication and accountability skills to collaborate effectively with cross-functional teams. Additionally, I bring a wealth of knowledge in developing high-performance applications with **React**, **Next.js**, **Node.js**, and **Python**, emphasizing seamless integration and compliance-driven development, including HIPAA and PCI DSS standards. My background in creating AI/ML-powered platforms adds a unique perspective to testing methodologies, ensuring robust and scalable solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Implemented **Automation** frameworks for comprehensive testing across applications using **Selenium**, **JUnit**, and **Golang**, ensuring high-quality releases through continuous integration.\n• Developed rigorous **UI Testing** strategies to validate user interactions and interface elements, utilizing **JavaScript**, **CSS**, and **HTML** to maintain robust frontend performance.\n• Executed **API Testing** to verify backend functionalities and service integrations, employing **Postman** and custom scripts built in **Java** and **C#** to ensure reliability.\n• Led initiatives to integrate **Test-Driven Development** practices across teams, fostering a culture of **Agile** methodologies and accountability in the testing process.\n• Maintained version control and source code management using **Git**, ensuring all team members adhere to best practices for efficient collaboration.\n• Collaboratively defined and enforced testing strategies encompassing unit, integration, and end-to-end tests, optimizing coverage and defect detection rates by **30%**.\n• Championed test automation initiatives that reduced manual testing time by **40%**, enhancing the pace of product release cycles.\n• Conducted code reviews and provided mentorship on **JavaScript** frameworks, fostering knowledge sharing and improving overall code quality across the product.\n• Communicated testing outcomes and system performance metrics to stakeholders, ensuring clear understanding and accountability for software quality."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted rigorous **Automation** testing strategies utilizing **JUnit**, **Selenium**, and **API Testing** frameworks to ensure software quality and reliability across all projects.\nCollaborated with development teams using **Agile** methodologies to implement **Test-Driven Development** practices, fostering a culture of accountability and open communication.\nDesigned comprehensive UI Test cases for web applications developed with **Java**, **JavaScript**, **HTML**, and **CSS**, enhancing user experience and interface reliability.\nUtilized **Git** for version control management, facilitating coordinated teamwork and code management processes.\nEngaged in cross-platform testing strategies, validating web applications across various browsers and devices, achieving an average test coverage of **90%**.\nPerformed detailed **API Testing** on services developed in **Golang** and **C#**, ensuring adherence to specifications and performance benchmarks with response times under **200ms**.\nImplemented continuous integration and delivery pipelines, reducing deployment times by **30%** and improving workflow efficiency.\nLead performance testing of applications, identifying bottlenecks and ensuring throughput meets enterprise standards, achieving a load tolerance of concurrent user sessions reaching **10,000+**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Automated complex testing processes for web applications, employing **JUnit** and **Selenium** to ensure robust UI and API testing covering over **90%** of critical paths.\n- Conducted comprehensive API testing with **Postman** and **Swagger**, enhancing automated test coverage and improving release cycle efficiency by **30%**.\n- Developed and maintained CI/CD pipelines utilizing **Git** and **Jenkins**, facilitating seamless integration and deployment practices aligned with Agile methodologies.\n- Collaborated cross-functionally in an Agile environment, communicating test insights and findings effectively, demonstrating strong accountability in project management and delivery timelines.\n- Implemented Test-Driven Development (TDD) practices across teams, fostering a culture of quality and accountability to ensure sustainable software development.\n- Engaged in regular code reviews and pair programming sessions, influencing coding standards and best practices among engineering teams.\n- Utilized **Golang** and **JavaScript** to create automated scripts, reducing manual testing efforts by **40%** and improving time efficiency in release cycles.\n- Provided thorough documentation and training on testing processes, improving knowledge sharing and enhancing team productivity.\n- Acted as a mentor to junior QA engineers, fostering a collaborative environment focused on improved testing strategies and methodologies."
    }
  ],
  "skills": " **Programming Languages:**\n\tGolang, Java, C#, JavaScript, Python, HTML, CSS, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI Testing, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n **Other:**\n\tAutomation, UI Testing, Selenium, JUnit, Agile, Test-Driven Development, Communication, Accountability",
  "apply_company": "Consensus"
}