{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Backend Engineer with 13+ years of experience specializing in **Java**, **Spring Boot**, **AWS**, **Kubernetes**, and **Terraform** for building robust backend solutions. Proven expertise in deploying cloud-native architectures and implementing **Microservices**, **RESTful APIs**, and **CI/CD** pipelines to drive efficiency and scalability. Demonstrated ability in **Infrastructure-as-Code** practices and Agile methodologies, including **Scrum** and **Kanban**, to enhance team collaboration and project delivery.\n\nProficient in leveraging data modeling and problem-solving skills to create innovative solutions in complex environments. A team player with a strong foundation in healthcare and financial applications, aligning development efforts with compliance standards. Experienced in AI/ML applications, integrating predictive analytics, automation, and real-time processing to enhance functionality.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and built robust **Microservices** architectures utilizing **Spring Boot** and **Kotlin** to enhance system scalability and maintainability for high-traffic applications.\nImplemented **API** strategies and efficient data modeling across applications to streamline data interactions and improve performance, adhering to Agile methodologies like **Scrum** and **Kanban**.\nLed initiatives for **CI/CD** pipeline integrations with **AWS** services, employing **Terraform** and **CloudFormation** for **Infrastructure-as-Code**, resulting in a 30% reduction in deployment times across multiple projects.\nOptimized system performance and reliability by integrating **Kubernetes** for container orchestration, establishing fault-tolerant deployments and ensuring zero downtime during software updates.\nCollaborated extensively with cross-functional teams to facilitate the integration of **RESTful APIs**, making systems more interoperable and efficient, significantly improving team productivity by 25%.\nDeveloped and maintained comprehensive testing strategies leveraging frameworks like **JUnit** and **Mockito** to ensure high-quality code delivery while reducing bug rates by 40%.\nUtilized **AWS** services to enhance application security, including the deployment of scalable microservices that ensured compliance with industry standards while handling sensitive data securely.\nEngaged in continuous problem-solving, addressing complex software issues and demonstrating a strong commitment to delivering high-quality backend solutions as part of a dedicated **Team Player** environment.\nFostered a proactive Agile culture by participating in sprint planning and regular product demos to ensure alignment with stakeholders, thus enhancing project visibility and acceptance by 50%."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and developed scalable **Microservices** architecture using **Spring Boot**, **Kotlin**, and **Java**, leading to a **40%** improvement in application performance and responsiveness.\nImplemented **RESTful APIs** for financial applications, ensuring robust and efficient data exchange, which facilitated a **25%** increase in system integration and interactivity.\nUtilized **AWS** for deploying cloud solutions, ensuring high availability and scalability, reducing downtime by **15%** through optimal infrastructure management with **Terraform** and **CloudFormation**.\nLed Agile development processes, including **Scrum** and **Kanban**, to enhance team collaboration and deliver project milestones on time, achieving an **80%** sprint completion rate.\nIntegrated **CI/CD** pipelines to streamline code deployment processes, reducing deployment times by **50%** and increasing release frequency through automated testing and validation.\nApplied strong **Data Modeling** techniques for effectively structuring databases and optimizing queries, improving data retrieval speeds by **30%**.\nFostered a team-oriented work environment, collaborating closely with cross-functional teams to solve complex problems and deliver high-quality backend solutions, contributing to numerous successful project completions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable microservices architecture using **Spring Boot** and **Kotlin**, ensuring robust and efficient backend services that support a global e-commerce platform.\nDesigned, optimized, and implemented RESTful APIs, adhering to best practices for efficient data exchange and integration, leveraging **AWS** cloud services for deployment and resource management.\nImplemented Infrastructure-as-Code using **Terraform** and **CloudFormation** to automate deployment processes, reducing setup time by **40%** and ensuring consistency across environments.\nEngineered CI/CD pipelines to streamline development workflows, achieving deployment frequency of **10 times** per week and reducing the overall lead time for changes by **30%**.\nSpearheaded agile methodologies including **Scrum** and **Kanban**, improving team collaboration and productivity, leading to timely project deliveries within **2 weeks** sprints.\nConducted data modeling and problem-solving sessions, translating complex requirements into clear architectural designs that align with business objectives and user needs.\nCollaborated with cross-functional teams as a dedicated team player, fostering a culture of shared knowledge and continuous improvement while delivering impactful features.\nDeployed **Kubernetes** for container orchestration, enhancing the platform's scalability and reliability, enabling the management of **50+** microservices in production environments.\nUtilized advanced techniques in Agile development to continuously iterate on features based on user feedback, improving end-user satisfaction ratings by **25%**.\nEnsured high standards of code quality through thorough code reviews and unit testing, reducing the bug rate in production by **15%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Kotlin, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tSpring Boot, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs, API\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, Kubernetes, Terraform, CloudFormation, Infrastructure-as-Code\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, CI/CD, GitHub Actions, GitLab CI/CD, Helm, Ansible, Infrastructure as Code\n\n **Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Microservices, Agile, Scrum, Kanban, Data Modeling, Problem-Solving, Team Player, Authentication & Security: Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Breuninger"
}