{
  "name": "Damian Franciszek Pospiech",
  "role_name": "FullStack Developer .NET Core/Angular",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Full Stack Developer with 13+ years of experience specializing in **.NET Core**, **Angular**, **JavaScript**, and **TypeScript** to deliver high-performance applications in the healthcare and financial sectors. Demonstrated proficiency in **Clean Architecture**, **Microservices**, and **API Rest** design, ensuring robust, maintainable solutions. Strong skills in **RabbitMQ** for messaging, **Unit Testing** for delivering quality code, and **TailwindCSS** for modern UI design.\nExperienced in frontend and backend development leveraging additional frameworks such as **React**, **Next.js**, and **Vue**, as well as backend technologies like **Node.js**, **FastAPI**, and **Django**. Proven track record in building AI/ML-powered platforms emphasizing predictive analytics and real-time data processing. Proficient in cloud deployments using **AWS** and **Azure**, implementing CI/CD pipelines, and adopting event-driven architectures.\nCommitted to compliance-driven development with a strong focus on standards like HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, possess a solid background in MLOps utilizing **MLflow**, **Airflow**, and **Kubeflow** for model management.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "FullStack Developer .NET Core/Angular",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed full-stack applications using **.NET Core**, **C#** and **Angular**, ensuring adherence to Clean Architecture principles for scalable and maintainable code.\n- Implemented robust **API Rest** services facilitating seamless communication between services and clients, enhancing application performance.\n- Conducted thorough **Unit Testing** across applications to ensure high-quality code and maintain functionality, employing frameworks like **XUnit** and **MSTest**.\n- Designed and deployed microservices architectures with containers utilizing **RabbitMQ** for efficient inter-service messaging, achieving reduced latency and improved scalability.\n- Enhanced user interfaces with responsive designs utilizing **TailwindCSS**, ensuring superior usability across devices.\n- Collaborated with cross-functional teams to define and implement new features and integrations, significantly improving user engagement metrics by **30%**.\n- Led the integration of real-time data processing solutions within applications to support dynamic user interactions, leveraging **WebSockets**.\n- Developed and maintained comprehensive documentation for APIs and architectural decisions, improving onboarding efficiency for new team members by **50%**.\n- Optimized application performance by analyzing and fine-tuning database interactions, resulting in a **40%** reduction in response times for high-volume transactions.\n- Utilized **jQuery** to enhance frontend functionality for legacy system support while transitioning to modern frameworks, ensuring minimal disruption and improved user experience."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **.NET Core** and **C#** to build scalable web applications, ensuring robust back-end services that align with industry best practices in Clean Architecture.\nDeveloped rich front-end interfaces using **Angular** (latest version), enhancing user experience and accessibility in financial applications.\nImplemented unit testing strategies to ensure software reliability and maintainability, significantly reducing bug frequency by over **30%**.\nCreated responsive and visually appealing web pages employing **TailwindCSS** and **JavaScript**, improving customer engagement through intuitive design.\nOrchestrated exceptional system communication with **RabbitMQ**, allowing efficient message queuing and handling within a microservices architecture for diverse backend operations.\nDesigned and integrated RESTful APIs, providing seamless connectivity between the client-side applications and server-side components, achieving a performance boost of **20%** in data retrieval.\nUtilized dependency injection techniques to increase the modularity and testability of the applications, leading to an agile development environment that speeds up deployment cycles by **25%**.\nEngaged with cross-functional teams to gather requirements and translate them into technical specifications, fostering better communication and collaboration throughout the software development life cycle.\nEnhanced legacy systems by refactoring them into microservices, ensuring improved scalability to handle a surge in transaction volume effectively."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable web applications leveraging **.NET Core** and **Angular**, ensuring adherence to **Clean Architecture** principles for high-quality code structures.\nUtilized **Unit Testing** frameworks to ensure robust application functionality and reliability across features, resulting in a **25%** reduction in production issues post-deployment.\nDesigned and implemented **Microservices** architectures to enhance interoperability and modularity in application systems, facilitating independent deployments and scalability.\nOptimized frontend experiences using **TypeScript**, **JavaScript**, and **TailwindCSS**, delivering responsive and visually appealing user interfaces that comply with accessibility standards (WCAG 2.1).\nCoordinated the integration of messaging services such as **RabbitMQ** to handle asynchronous workflows effectively, leading to improved system responsiveness and event-driven communication.\nCreated and consumed RESTful APIs, ensuring meticulous adherence to best practices in API design, enabling seamless data interchange between frontend and backend systems.\nConducted thorough code reviews and implemented **Inyección de dependencias** for better maintainability and testability of code.\nEnhanced legacy systems through incremental improvements using **jQuery**, providing ongoing support and updates to existing functionalities while maintaining backward compatibility.\nLed the development of user-centric features, resulting in a **30%** increase in user engagement and satisfaction scores.\nImplemented responsive web designs to ensure a seamless experience on various devices, significantly improving mobile traffic by over **40%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\t.NET Core, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tAngular, React, Vue, jQuery, TailwindCSS\n\n **API Technologies:**\n\tAPI Rest, RabbitMQ\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tAuthentication & Security: Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, MLflow, Airflow, Kubeflow, Unit Testing, Clean Architecture, Microservicios, Inyección de dependencias"
}