{
  "name": "Rei Taro",
  "role_name": "Senior Golang Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Golang Engineer with over 10 years of expertise in backend system design and delivery, specializing in **Go**, **AWS**, **Azure**, **GCP**, **Kubernetes**, and **Terraform**. Proficient in creating high-performing APIs and automation tools, ensuring robust CI/CD pipelines and implementing GitOps principles. Skilled in **Linux** environments and employing infrastructure as code for seamless deployments while prioritizing security and observability. Demonstrated capability in collaborating with cross-functional teams to tackle complex problems, alongside effective communication and testing strategies. Proven contributor to significant projects at leading organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Golang Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Go** for developing robust backend services, ensuring high performance and scalability in system architectures.\nEmployed **Kubernetes** for orchestrating containerized applications, enhancing deployment efficiency by **25%**.\nImplemented **CI/CD** pipelines using **Git** and **Terraform**, leading to a reduction in deployment time by **40%** while managing infrastructure as code.\nDesigned and executed security measures, addressing vulnerabilities and integrating best practices to enhance overall application security.\nEnhanced observability across systems by utilizing **monitoring** tools, leading to improved troubleshooting and reduced mean time to recovery by **15%**.\nCollaborated effectively within cross-functional teams to resolve complex integration challenges and streamline workflows, demonstrating strong problem-solving and communication skills.\nMentored junior engineers on **DevOps** practices and application security, promoting a collaborative and learning-oriented environment."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed backend systems in **Go** with a focus on building robust applications to automate document workflows, improve user onboarding, and manage complex reporting processes.\n• Created and maintained **Kubernetes**-based microservices architecture for seamless deployment and scaling of applications, ensuring high availability.\n• Implemented CI/CD pipelines using **Terraform** and **GitOps** methodologies for consistent and reliable deployment of infrastructure as code, managing over **50** deployments per month.\n• Managed deployment processes on **AWS**, **Azure**, and **GCP**, orchestrating containerized applications and improving operational efficiency by **30%**.\n• Engineered data pipelines utilizing **Apache Airflow** and **Azure Functions** to automate the secure exchange of regulatory data, achieving a reduction in data processing time by **40%**.\n• Conducted security audits and integrated protocols, such as **OAuth2** and **Azure AD B2C**, to ensure compliance with industry standards and secure access, resulting in zero security breaches reported in the past year.\n• Collaborated effectively with cross-functional teams to ensure system integration, regulatory compliance, and successful release management, enhancing communication efficiency and project delivery timelines."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Designed and implemented scalable backend services for trade execution and portfolio management using **Go** to enhance trading operations.\nLeveraged **AWS**, **Azure**, and **GCP** cloud services to facilitate robust and secure deployment strategies in a multi-cloud environment.\nUtilized **Kubernetes** for container orchestration to manage service scalability and reliability for high-frequency transactions.\nDeveloped and maintained CI/CD pipelines using **Terraform**, enabling infrastructure as code practices for efficient environment management.\nEnsured compliance with industry regulations, including security standards and data protection, contributing to overall platform integrity.\nCollaborated effectively with cross-functional teams, demonstrating strong communication and teamwork skills to deliver features through REST APIs.\nImplemented testing frameworks and practices focusing on security, observability, and efficient development cycles with tools like **Git** and **Linux**.\nIntroduced solutions for monitoring and logging, enhancing problem-solving capabilities and response times during incident management."
    }
  ],
  "skills": "**Programming Languages**\n\tGo, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, GCP\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, GitOps, infrastructure as code, security, testing, observability, problem-solving, collaboration, communication\n\n**Cloud & Infrastructure**\n\tAWS, Azure, GCP, Terraform, Linux\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, PyTest, Git",
  "apply_company": "Elastic"
}