{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Solutions Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Solutions Engineer with 13+ years of extensive experience in **AI**, **automation**, and **cloud computing**. Adept at deploying robust solutions on **AWS**, **Azure**, and **GoogleCloud**, and proficient in integrating **B2B** and **SaaS** applications, including CRM platforms like **Salesforce** and **HubSpot**. Strong command over **REST** and **GraphQL** APIs, ensuring seamless communication between applications and effective data exchanges.\n\nSpecialized in developing **Conversational AI** and RPA solutions, enhancing automation and user experience. Proven ability to build intelligent systems that leverage machine learning for real-time processing and predictive analytics. Excellent relationship-building and presentation skills, facilitating effective collaboration with stakeholders across diverse teams.\n\nTechnically skilled in **JavaScript/TypeScript**, **Python**, **Flutter**, as well as frontend and backend frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in MLOps practices for model training and orchestration utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**. Committed to compliance-driven development, aligning solutions with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed AI-driven solutions for B2B applications, ensuring seamless integration with **Salesforce**, **HubSpot**, and other SaaS platforms, enhancing client relationship management and automation capabilities.\n• Designed and built RESTful and GraphQL APIs to facilitate efficient data exchange and real-time interactions across various applications, supporting robust cloud deployment in **AWS** and **Azure** environments.\n• Leveraged **NLP** technologies to enhance conversational AI features within applications, improving user experience and client engagement metrics by **15%**.\n• Automated workflows and processes using **RPA** techniques, resulting in a **30%** increase in operational efficiency within cross-functional teams.\n• Delivered presentations and training sessions on new automation tools, fostering strong communication and relationship-building skills within the organization.\n• Collaborated closely with product teams to define and deliver tailored solutions that meet unique customer requirements while addressing market demands. \n• Implemented cloud infrastructure strategies leveraging **GoogleCloud**, ensuring scalability and reliability in service delivery, with a focus on cost-efficiency leading to a **20%** reduction in operational expenses.\n• Provided ongoing support and integration of AI features, such as customer insights tools powered by advanced machine learning algorithms, enhancing the overall product offering.\n• Consistently monitored system performance and user feedback, facilitating rapid testing and iteration to achieve increased user satisfaction scores by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **cloud** services such as **Azure** and **AWS** to design and deploy scalable solutions in a **B2B** environment, streamlining financial processes and enhancing system performance.\nImplemented **automation** strategies using **RPA** tools to improve efficiency and reduce manual workloads, achieving a time savings of **30%** in data processing tasks.\nIntegrated **AI** algorithms for fraud detection within financial transactions, utilizing frameworks like scikit-learn and XGBoost, resulting in a **25%** decrease in fraudulent activities.\nDeveloped conversational interfaces employing **NLP** capabilities to enhance user experience for financial clients, resulting in a **15%** increase in user engagement.\nBuilt and maintained a modern SaaS platform utilizing **Node.js (NestJS/Express)** and **Python (FastAPI, Django)** that improved system scalability to handle **1M+** transactions per day.\nCreated impactful presentation materials and conducted training to enhance client relationships and onboarding processes, fostering strong ties with stakeholders through effective communication.\nLeveraged **REST** and **GraphQL** APIs to facilitate seamless data interchange between systems and external services like **Salesforce** and **HubSpot**, improving integration efficiency by **40%**.\nDesigned interactive dashboards using **Power BI** and data visualization tools like **D3.js**, providing operations teams with crucial insights and reducing anomaly detection time by **50%**.\nImplemented an event-driven architecture with **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring reliable asynchronous communication across systems, aiding in compliance and payment processing workflows."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Designed and optimized solutions for scalable **cloud** applications in **AWS**, **Azure**, and **GoogleCloud**, enhancing performance and reliability in a **B2B** e-commerce environment.\n- Developed **AI** and **NLP** driven automation tools for personalized customer interactions and improved service efficiency, ensuring seamless integration with **Salesforce** and **HubSpot**.\n- Engineered automated workflows leveraging **RPA** for streamlining operational processes, reducing manual tasks and boosting productivity by **30%**.\n- Collaborated with cross-functional teams to create and implement **REST** and **GraphQL** APIs, improving data communication and service integration by **25%**.\n- Implemented robust customer relationship strategies, enhancing relationship-building initiatives, and increasing customer retention rates by **15%**.\n- Created comprehensive documentation and delivered presentations to stakeholders, showcasing solutions and improving communication across teams.\n- Managed project timelines and deliverables, utilizing agile methodologies to ensure timely and efficient project execution.\n- Fostered a collaborative team environment, actively participating in brainstorming sessions and contributing to the continuous improvement of services offered.\n- Spearheaded cloud migration initiatives that resulted in a **40%** reduction in operational costs while maintaining high service levels."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\t\n\n **Frontend Frameworks:**\n\t\n\n **API Technologies:**\n\tREST\n\tGraphQL\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure\n\tGoogleCloud\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tAI\n\tautomation\n\tConversationalAI\n\tB2B\n\tSaaS\n\tCRM\n\tRPA\n\tNLP\n\tSalesforce\n\tHubSpot\n\tcommunication\n\tpresentation\n\trelationshipBuilding\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot",
  "apply_company": "Enterprise Bot"
}