{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Senior Backend Engineer with 8 years of extensive experience in developing robust solutions using **TypeScript**, **Node.js**, and **React**. Proficient in event-driven systems and **PostgreSQL**, I excel in leveraging clean architectures and domain-driven design principles to build scalable applications. Adept at implementing security and compliance best practices, I ensure adherence to industry standards while maintaining high code quality through effective testing strategies.\nIn my previous roles, I led cross-functional teams and mentored junior developers, fostering a collaborative environment. My strong communication skills enable me to articulate complex technical concepts clearly, contributing to successful project outcomes. I also possess a comprehensive understanding of full-stack development leveraging **Java** and cloud technologies, enriched by experience in the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** and **Node.js** to architect and develop robust backend services for complex applications, ensuring adherence to **security and compliance best practices** in line with industry standards such as HIPAA and PCI DSS.\nImplemented **PostgreSQL** for efficient data storage and retrieval, focusing on optimizing performance for applications with over **1 million** users.\nDesigned and developed clean, scalable architectures, emphasizing **domain-driven design** principles to facilitate long-term maintainability of systems.\nIntegrated advanced testing strategies using frameworks like Jest and PyTest, achieving **95%** test coverage and enhancing the reliability of deployed services.\nLed the development of event-driven systems, enabling seamless communication between microservices and improving system responsiveness by **30%**.\nMentored junior engineers, fostering an environment of continuous learning and collaboration, resulting in improved team productivity and morale.\nCollaborated with frontend teams utilizing **React** to ensure efficient data handling and integration between the backend and user interfaces.\nEngaged in effective communication with cross-functional teams to align on project requirements and deliver solutions tailored to user needs, improving stakeholder satisfaction ratings by **20%**.\nEnhanced application performance utilizing clean architecture principles which resulted in a **40%** reduction in load times for end-users.\n\nThese responsibilities reflect a commitment to leveraging key technologies and methodologies required for a Senior Backend Engineer role while emphasizing collaboration, mentorship, and adherence to industry standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **TypeScript** and **Node.js** to develop robust backend services, applying **clean architectures** and **event-driven systems** principles to ensure maintainability and scalability in complex financial platforms.\nLed the integration of **PostgreSQL** for database management, ensuring optimal performance and adherence to **security and compliance best practices** across applications handling sensitive financial data.\nApplied comprehensive **testing strategies** to backend code to enhance reliability, reducing bug rates by over **30%** and improving deployment confidence for systems supporting high-volume transactions.\nMentored junior developers in **domain-driven design** and **effective communication** techniques, fostering a collaborative team environment focused on delivering high-quality software solutions.\nEnhanced system performance and efficiency in processing transactions by adopting **Java** alongside modern frameworks to address specific operational requirements and improve throughput.\nConducted code reviews and provided constructive feedback, maintaining alignment with best practices and promoting a culture of continuous improvement in software development processes.\nLeveraged existing knowledge of industry regulations and guidelines to ensure software architecture not only meets functionality but also complies with extensive financial industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** to implement clean architectures and testing strategies, ensuring robust software design and maintainability across various backend systems.\nDeveloped reliable backend services using **Node.js** integrated with event-driven systems, contributing to enhanced application performance and user experience in a high-traffic environment.\nDesigned and maintained microservices using **PostgreSQL** for distributed data storage, focusing on scalability and data integrity while serving over 10k simultaneous users.\nCollaborated with cross-functional teams to produce effective communication paths and foster knowledge sharing, mentoring junior engineers in best practices and emerging technologies.\nEmployed cutting-edge security and compliance best practices, including applying **OAuth 2.0** protocols, to safeguard user information and secure sensitive transaction data.\nImplemented domain-driven design principles to facilitate seamless collaboration between technical and non-technical stakeholders, aligning project objectives with business needs.\nIntegrated rapid response features via event-driven architecture, achieving **50%** reduction in order processing time and improving customer satisfaction metrics significantly.\nDrove enhancements in system performance, achieving a **30%** decrease in latency during peak load times through optimized database queries and caching strategies.\nConducted thorough code reviews to uphold quality standards and introduce effective testing strategies, ensuring high code coverage above **90%** across critical modules."
    }
  ],
  "skills": " \n**Programming Languages:**\n\tPython, Java, TypeScript, JavaScript\n\n**Frontend Frameworks:**\n\tReact, Angular, Vue\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Nginx, Certbot\n\n**Other:**\n\tevent-driven systems, clean architectures, testing strategies, domain-driven design, security and compliance best practices, effective communication, mentoring"
}