{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior DevOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic Senior DevOps Engineer with 13+ years of comprehensive expertise in **DevOps**, **automated deployment**, **CI/CD**, and **cloud** environments, leveraging strong skills in **microservices** architecture. Proficient in deploying scalable applications using **Kubernetes**, and adept at managing infrastructure with **Terraform**, **Ansible**, and **Helm**, ensuring robust and efficient operations.\nSolid programming foundations in **JavaScript**, **Python**, and **Java**, with hands-on experience in **Go** and **C#** support the agile development of transformative solutions.\nDemonstrated success in building and deploying cloud-native systems on **AWS** and **Azure**, while implementing **Software as a Service (SaaS)** models and adhering to compliance standards. A forward-thinking technologist with a strong commitment to enhancing operational efficiency through skilled **GitOps** practices and fostering innovative solutions within open-source ecosystems.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implement robust **DevOps** practices and **automated deployment** strategies across projects, ensuring high availability and efficiency in software delivery.\nArchitect and maintain **microservices** environments using **Kubernetes** (1.21) for enhanced scalability, manageability, and fault tolerance in cloud applications.\nDevelop and manage CI/CD pipelines with tools such as **GitHub Actions**, **CircleCI**, and **Terraform**, streamlining workflows and reducing deployment times by up to **30%**.\nUtilize **Helm** for seamless application deployment and management on Kubernetes clusters, ensuring consistency across different environments.\nIncorporate **Ansible** for configuration management, automating repetitive tasks and enhancing system configuration quality across multiple servers.\nCollaborate with development teams to implement **Software as a Service** models, improving delivery efficiency and user access to applications.\nDrive agile methodologies within teams, fostering a culture of continuous improvement and delivery, with sprint cycles averaging **2 weeks**.\nExecute secure cloud infrastructure setups on platforms like AWS and Azure, optimizing resource usage and minimizing operational costs by **20%**.\nLeverage scripting languages such as **Python** and **shell scripts** to automate system maintenance and monitoring tasks, improving operational efficiency.\nIntegrate monitoring and alerting tools to proactively manage system health, resulting in reduced downtime of critical services by **40%**.\nFoster an open-source contribution environment, encouraging team members to engage with and utilize community-driven tools and techniques for better performance.\nEngage in continual learning and application of **cloud** technologies and trends to keep infrastructure modernized and secure, aligning with industry best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **DevOps** practices through automated deployment strategies with **Terraform** and **Ansible**, enhancing deployment efficiency by **70%** and ensuring high availability.\nEngineered microservices-based applications using **Node.js** and **Python**, improving system scalability and reducing downtime by **50%** in critical operations.\nManaged and orchestrated containerized applications in **Kubernetes**, facilitating seamless deployment and scalability of services across various environments.\nEstablished CI/CD pipelines using **GitOps** concepts, enabling rapid and reliable software delivery while supporting agile methodologies in cross-functional teams.\nDeveloped and deployed **cloud** solutions leveraging **Azure** services, optimizing resource utilization and reducing operational costs by **30%**.\nCollaborated on **Software as a Service** (SaaS) solutions incorporating **JavaScript**, **Python**, and **Go**, addressing diverse client needs with a focus on high-performance standards.\nUtilized **Helm** for managing Kubernetes applications, streamlining the deployment processes of services across development and production environments.\nEmployed shell scripts for automating system monitoring and log management, significantly improving incident response times by **40%**.\nParticipated in open source projects related to **DevOps** tools, contributing improvements and advocating for best practices among developer communities."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **DevOps** methodologies to streamline development workflows and optimize deployment processes for production environments, ensuring a robust Software as a Service (SaaS) platform.\nImplemented **Kubernetes** for orchestrating microservices, facilitating automated deployment strategies, and managing containerized applications with **Helm** and **Terraform** for infrastructure as code (IaC).\nDeveloped CI/CD pipelines using **GitOps** principles to automate testing and deployment processes, improving deployment frequency by **30%** and reducing lead time for changes.\nApplied **Ansible** for configuration management and rapid environment setup, enhancing operational efficiency and consistency across development, staging, and production environments.\nUtilized **cloud** services to host applications and streamline resource management, ensuring infrastructure scalability to handle peak loads during critical e-commerce events, achieving uptime of **99.9%**.\nDesigned and optimized backend services with **Python (Django, FastAPI)** and **Node.js (Express, NestJS)**, focusing on microservices architecture to enhance application modularity and maintainability.\nIntegrated event-driven architecture using **Kafka** and **RabbitMQ** for real-time data processing, achieving response times reduced by **15%** during high-traffic scenarios.\nEmployed **automated deployment** techniques to facilitate seamless software releases, reducing deployment errors and speeding up recovery time.\nFostered an agile work environment, promoting collaboration across cross-functional teams to align project goals with business needs and enhance product delivery.\nEngaged in open source contributions to enhance software robustness and community collaboration, ensuring best practices in coding and deployment techniques.\n"
    }
  ],
  "skills": "****Programming Languages:****\n\tPython, Java, JavaScript, TypeScript, Go, C#, shell scripts\n\n****Backend Frameworks:****\n\tFastAPI, Flask, Django\n\n****Frontend Frameworks:****\n\tReact, Vue, Angular\n\n****API Technologies:****\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n****Serverless and Cloud Functions:****\n\tAWS: Lambda, ECS\n\n****Databases:****\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n****DevOps:****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, GitOps, automated deployment, Helm, Ansible, Terraform\n\n****Cloud & Infrastructure:****\n\tAWS: RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n****Other:****\n\tmicroservices, Software as a Service, agile, open source, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Hypertegrity AG"
}