{
  "name": "Rei Taro",
  "role_name": "Senior PHP Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior PHP Engineer with over 10 years of extensive experience in backend development, focusing on crafting high-performing APIs and utilizing best practices in software design. Proficient with **PHP**, **SQL**, and strong fundamentals in **OOP**, **SOLID principles**, and **design patterns**. Skilled in leveraging **version control** systems, implementing **TDD** and **DDD**, and promoting **clean architectures** for scalable applications. Solid experience with **WordPress** and web technologies including **HTML**, **CSS**, and **JavaScript**. Recognized for analytical skills and a proactive attitude towards problem-solving in team environments. Proven ability to learn new technologies and methodologies quickly, contributing to successful projects in diverse settings.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered scalable APIs using **PHP** to enhance document automation, user onboarding, and reporting workflows, achieving a reduction in processing time by **30%**.\nDeveloped OOP-based backend architectures adhering to **SOLID** principles and design patterns to improve code maintainability and performance.\nUtilized **SQL** for robust database management and optimized queries, successfully handling data retrieval that improved response times by **50%**.\nImplemented version control using **Git**, enabling efficient collaboration within the team and maintaining code integrity across **5 major releases**.\nIntegrated **HTML**, **CSS**, and **JavaScript** for developing responsive web interfaces, improving user interaction and engagement metrics.\nAdapted **WordPress** with custom plugins to extend functionality, resulting in improved user experience and decreased page load times by **25%**.\nEmployed TDD and DDD methodologies to ensure high code quality and comprehensive testing, reducing bugs in production by **40%**.\nDemonstrated strong analytical skills and a proactive attitude towards problem-solving while collaborating with cross-functional teams for system integration and release strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented backend solutions using **PHP** for robust document management workflows, enhancing user onboarding processes by **30%**.\nUtilized design patterns and **OOP** principles to create maintainable and scalable codebases, ensuring adherence to **SOLID** principles and promoting efficient collaboration within the team.\nEmployed **SQL** databases for data storage and retrieval, optimizing query performance by over **20%** through effective indexing strategies.\nDeveloped and integrated **APIs** for seamless communication between systems and enhancing functionality for end-users, resulting in a **15%** increase in application responsiveness.\nApplied **TDD** and **DDD** methodologies to ensure high code quality, facilitating a structured development process and reducing the bug rate by **25%**.\nEngaged in version control using **Git**, enabling efficient tracking of code changes and collaborative development efforts to minimize conflicts.\nCreated responsive front-end elements using **HTML**, **CSS**, and **JavaScript** to augment user experience, leading to improved user satisfaction metrics.\nFostered a proactive and humorous team environment, encouraging continuous learning and knowledge sharing among peers to overcome challenges effectively."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **PHP** to develop and maintain dynamic web applications, ensuring adherence to **OOP** principles and **SOLID** design patterns for scalable code architecture.\nImplemented and optimized **SQL** database interactions, enhancing data retrieval and manipulation processes for high-performance applications.\nDesigned robust **REST APIs** for seamless integration between backend services and frontend frameworks, improving data access and user experience.\nConducted thorough testing through **TDD**, utilizing tools such as PHPUnit and Behat, to ensure high-quality code and reliability of applications.\nEmployed clean architecture principles and **DDD** (Domain-Driven Design) strategies to refine application structure and maintainability.\nCollaborated effectively within cross-functional teams, exhibiting strong **organizational** skills and a **proactive attitude** to ensure project milestones were met on time.\nMaintained version control using **Git**, adhering to best practices for collaborative development and code management.\nDemonstrated **analytical skills** by troubleshooting and resolving issues quickly, reducing downtime by **30%** during critical deployments.\nFostered a positive team environment through humor and a **desire to learn**, facilitating knowledge sharing and continuous development among team members."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, PHP, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tHTML, CSS\n\n**API Technologies**\n\tREST/gRPC APIs, APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, version control\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tOOP, SOLID, design patterns, TDD, DDD, clean architectures, Testing, analytical skills, proactive attitude, organizational skills, teamwork, humor, desire to learn, MLflow, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, Kafka, CI/CD, PyTest, Git",
  "apply_company": "wecity"
}