{
  "name": "Andrzej Ito",
  "role_name": "Senior Android Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Android Engineer with over 9 years of experience, I excel in delivering high-quality software solutions using **Kotlin** and **ReactNative**. My expertise includes unit testing, integration testing, and debugging, ensuring robust and reliable software performance. I am skilled in validating code and comprehensive documentation practices, which enhance collaboration and maintainability. With a strong problem-solving mindset, I effectively communicate complex technical concepts to cross-functional teams while mentoring junior engineers. I am dedicated to creating an accessible user experience and driving technical excellence in all projects.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Android Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Implemented debugging, testing, and validation processes to ensure code quality and reliability, contributing to a robust application development lifecycle.\n• Led integration and unit testing initiatives to enhance application stability and performance metrics by **15%**, resulting in fewer bugs detected post-deployment.\n• Enhanced communication strategies within the development team, ensuring smooth collaboration and efficient problem-solving during project cycles.\n• Developed and maintained core functionalities of Android applications using Kotlin, integrating extensive documentation practices to streamline knowledge transfer.\n• Designed and optimized mobile applications with React Native, focusing on performance improvements, accomplishing load times reduced by **20%**.\n• Directed efforts in troubleshooting and resolving issues in real-time, ensuring user satisfaction and system reliability.\n• Applied advanced problem-solving methods to address complex integration challenges, effectively improving application responsiveness.\n• Collaborated with cross-functional teams to deliver high-quality applications, utilizing tools and frameworks that support **Kotlin** and **ReactNative** development."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Conducted unit testing and integration testing for applications, ensuring high-quality code and functionality with a test coverage of **90%**.\n• Utilized problem-solving skills to troubleshoot complex issues, reducing debugging time by **30%**.\n• Created comprehensive documentation for APIs, increasing team communication efficiency and project onboarding time by **25%**.\n• Collaborated with cross-functional teams for seamless integration of **Kotlin** and **ReactNative**, resulting in a 20% improvement in application performance.\n• Developed and optimized features for Android applications to enhance user experience with **ReactNative**, utilizing best practices in debugging and testing.\n• Contributed to the development of scalable and maintainable codebase, improving overall application stability by utilizing modular design patterns.\n• Participated in code reviews to maintain code quality and ensure adherence to development standards, leading to a **15%** reduction in post-deployment bugs.\n• Engaged in validation processes to ensure products meet client expectations and requirements.\n• Leveraged strong communication skills to facilitate discussions and updates with stakeholders, enhancing project transparency."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed robust and high-performance mobile applications using **ReactNative** aligned with **Kotlin** best practices.\n• Conducted thorough debugging and testing to ensure optimal functionality and user experience across mobile platforms.\n• Collaborated with cross-functional teams to facilitate integration testing and document the development processes, enhancing communication and team efficiency.\n• Implemented validation techniques to enhance data handling and ensure application reliability and integrity.\n• Utilized agile methodologies to identify and solve complex problems, delivering efficient solutions on time, with a proven track record of meeting project deadlines.\n• Led the execution of unit testing frameworks to ensure code quality and reduce defects by up to **30%**.\n• Regularly performed code reviews and contributed documentation to foster knowledge sharing within the team, enhancing collective expertise and project outcomes."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, C++, C#, Python, SQL, PLSQL, Kotlin\n\n**Frontend Frameworks**\n\tReact, Vue, Angular, ReactNative\n\n**Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA, Node.js\n\n**API Technologies**\n\tSOAP, REST APIs, Microservices\n\n**Databases**\n\tMS SQL Server, Oracle, MongoDB, PostgreSQL, Redis\n\n**DevOps**\n\tRabbit MQ\n\n**Other**\n\tdocumentation, debugging, testing, validation, integrationTesting, unitTesting, problemSolving, communication",
  "apply_company": "Mercor"
}