{
  "name": "Andrzej Ito",
  "role_name": "Link Building Team lead Assistant",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Link Building Team Lead Assistant, I possess extensive expertise in **SEO**, **link building**, and **outreach**, combined with proficient use of tools like **Ahrefs** and **Google Sheets** to drive effective campaigns. My exceptional organizational, communication, and reporting skills ensure that projects are executed with precision and attention to detail. With over 9 years of experience as a Senior Software Engineer, I excel in leading cross-functional teams and mentoring junior staff, while consistently delivering impactful projects that prioritize user experience and innovation.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Link Building Team lead Assistant",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Demonstrate exceptional **organizational skills** to manage link building efforts effectively, ensuring timely outreach and follow-up with potential partners.\n• Showcase strong **communication skills** while collaborating with team members and external stakeholders to enhance relationships and build backlinks.\n• Utilize **Google Sheets** for meticulous tracking of outreach campaigns, link placements, and performance metrics, contributing to comprehensive reporting on progress.\n• Apply **SEO** techniques and strategies to identify high-value opportunities for link acquisition, increasing website authority and search rankings.\n• Generate insights based on data analytics tools such as **Ahrefs** to report on link health and campaign effectiveness, making data-driven recommendations for optimization.\n• Exhibit a **detail-oriented** approach when reviewing and curating content for outreach to ensure alignment with brand standards and target audience.\n• Conduct outreach efforts that result in a measurable increase in domain authority by **up to 30%** over a campaign period.\n• Lead monthly reports outlining **link building initiatives** and their SEO impact, enabling stakeholders to understand the value added to the company's digital presence."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed and implemented outreach strategies to boost link building efforts, enhancing SEO performance by over **30%** in **6** months.\n• Conducted detailed reports utilizing **Google Sheets** to track progress and results of SEO initiatives, ensuring effective communication within the team.\n• Collaborated with team members to create organized workflows that improved efficiency by **20%**, utilizing strong organizational skills.\n• Ensured meticulous attention to detail when vetting potential link building opportunities, leading to higher-quality backlinks and improved site authority.\n• Engaged with various outreach platforms, analyzing metrics with **Ahrefs** to optimize link building strategies.\n• Delivered regular updates and reports to management, utilizing excellent communication skills to explain complex SEO concepts.\n• Implemented effective link building tactics while maintaining a focus on long-term SEO goals, leveraging advanced reporting skills to assess overall impact."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2024",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "- Conducted effective outreach campaigns to improve link building strategies and enhance overall SEO performance.\n- Utilized **Ahrefs** for comprehensive site audits and competitor analysis to inform link building efforts.\n- Developed and maintained organized reporting structures using **Google Sheets** to track link acquisition and outreach success.\n- Demonstrated strong organizational skills by managing multiple link building projects simultaneously, ensuring all deadlines were met.\n- Fostered effective communication within the team and with external partners to optimize collaboration and link building initiatives.\n- Ensured that all outreach communications were detail-oriented and tailored, improving response rates and link placements.\n- Engaged in post-campaign reporting to analyze results and refine future outreach strategies.\n- Maintained consistency in the measurement of outreach effectiveness by tracking metrics on link performance, reaching a **15%** increase in acquisition rates over **6 months**.\n- Led a team that successfully built links for over **150** unique domains, enhancing website authority significantly."
    }
  ],
  "skills": " **Programming Languages** \n\tJava, C++, C#, Python, SQL, PLSQL, Kotlin\n\n **Backend Frameworks** \n\tSpring, Spring Boot, Hibernate, Struts, JPA, Node.js\n\n **Frontend Frameworks** \n\tReact, Vue, Angular\n\n **API Technologies** \n\tSOAP, REST APIs, Microservices\n\n **Databases** \n\tMS SQL Server, Oracle, MongoDB, PostgreSQL, Redis\n\n **Other** \n\tSEO, link building, outreach, Ahrefs, Google Sheets, organizational skills, communication skills, reporting skills, detail-oriented"
}