{
  "name": "Marcin Karol Kotlinski",
  "role_name": "AI/ML Engineer – Agentic Systems",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven AI/ML Engineer with 8 years of experience specializing in **Python**, **AWS**, **Terraform**, and **GitLab CI** for creating production-grade AI/ML systems. Skilled in developing robust APIs integration and data pipelines that drive intelligent automation and LLM-powered workflows. I possess extensive knowledge of agentic systems, with a strong foundation in microservices architecture and CI/CD automation, ensuring seamless deployment and compliance with standards such as HIPAA and PCI DSS. Proficient in building high-performance solutions tailored for the healthcare and financial sectors, leveraging a tech stack that includes **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My experience extends to integrating ML workflows with tools like **MLflow**, **Airflow**, and **Kubeflow**, aiming for efficient management of AI/ML models in production and enhancing predictive analytics capabilities.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "AI/ML Engineer – Agentic Systems",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and integrated **APIs** for seamless communication between **production-grade AI/ML systems** and user interfaces to enhance performance and drive intelligent applications.\nDesigned and implemented data pipelines leveraging **AWS** technologies, ensuring robust and efficient data ingestion and processing for **agentic systems**.\nArchitected scalable solutions using **Python** and integrated **Terraform** for infrastructure as code, facilitating the deployment of AI solutions in various environments.\nCollaborated with cross-functional teams to establish and refine **RAG workflows**, ensuring AI models are effectively utilized in operational processes.\nCreated **GitLab CI** pipelines to automate testing and deployment of machine learning models, resulting in a **30%** reduction in deployment times.\nEngineered LLM-powered automation solutions to enhance predictive capabilities and streamline healthcare and financial operations, yielding a **25%** increase in prediction accuracy.\nImplemented comprehensive testing strategies using tools like Jest and PyTest, covering various testing types to maintain high-quality standards in AI/ML applications.\nEnsured adherence to best practices for integrating AI functionalities into existing systems, improving user engagement and system agility by **40%**.\nBuilt and maintained cloud-native infrastructures that support machine learning workloads, utilizing **AWS** resources to optimize compute efficiency and control costs.\nFostered collaboration with data scientists to iterate on algorithms, ensuring alignment with evolving business needs and technology advances."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained **production-grade AI/ML systems** using **Python**, implementing frameworks such as scikit-learn and XGBoost, enhancing predictive capabilities in fraud detection and financial analytics.\nDesigned and integrated **data pipelines** with tools like **Apache Airflow** and **Azure Data Factory**, ensuring efficient real-time and batch processing of financial data from diverse sources.\nImplemented **APIs integration** for seamless connectivity between systems, leveraging cloud services such as **AWS** for scalable infrastructure and data access.\nUtilized **GitLab CI** for continuous integration and deployment workflows to maintain high-quality software standards and reduce deployment times by **30%**.\nDeveloped and deployed **agentic systems** that utilize **LLM-powered automation** for improved operational efficiency, enabling intelligent decision-making processes in financial applications.\nCollaborated on **RAG workflows** to track and manage project deliverables, enhancing team productivity and communication across financial development projects.\nAutomated workflows and systems using **Terraform** for infrastructure as code and streamlined provisioning of resources, resulting in a **40%** reduction in configuration errors.\nParticipated in the modernization of the financial platforms by adopting scalable architecture strategies and technologies, resulting in improved transaction throughput by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and integrated **APIs** for agentic systems with production-grade **AI/ML** solutions, leveraging **Python** and enhancing workflows involving **LLM-powered automation** and **RAG workflows**.\nEngineered **data pipelines** to ensure seamless data flow and processing, optimizing performance and scalability while maintaining compliance with data privacy standards like **GDPR**.\nUtilized **AWS** services for deployment and management of AI/ML applications, employing **Terraform** for infrastructure as code, ensuring efficient provisioning and resource management across environments.\nImplemented CI/CD processes using **GitLab CI** for automated testing and deployment, enabling rapid iteration and release of AI models and features.\nDesigned and optimized advanced AI/ML systems employing libraries such as **scikit-learn** and **TensorFlow**, achieving a **15%** increase in predictive accuracy through iterative model training.\nCollaborated closely with cross-functional teams to gather requirements and establish best practices for integrating AI-driven features into existing platforms, enhancing user experience by **20%**.\nConducted performance tuning on AI algorithms, reducing processing time by **30%** while handling large datasets effectively, speeding up response times for end users.\nIntegrated advanced monitoring and logging systems to track the performance of deployed models in real-time, ensuring robust performance and quick issue resolution.\nUtilized version control for collaborative development on machine learning projects, ensuring consistent model tracking and reproducibility of experiments.\nPresented findings and project outcomes to stakeholders, highlighting the impact of AI/ML features on business objectives and future enhancements."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tAPIs integration\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, agentic systems, LLM-powered automation, RAG workflows, data pipelines, production-grade AI/ML systems, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}