{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Python Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a dedicated Python Engineer with 8 years of experience, I possess extensive proficiency in **Python**, **Django**, **AWS**, **SQL**, and cloud technologies, including **Kubernetes** for container orchestration. My solid experience in developing **REST APIs** and applying **GraphQL** aligns seamlessly with the requirements of this role. I am well-versed in **CI/CD** practices and have implemented **DevOps** strategies to enhance deployment cycles, ensuring robust and scalable applications.\nI excel in maintaining code quality through **Code Reviews**, implementing **Automated Testing** frameworks, and adhering to best practices in **Refactoring** and **Design Patterns**. My strong background in database management ensures that I create efficient and reliable data architectures while supporting **Test Strategy** initiatives. My effective communication skills facilitate collaboration in cross-functional teams, driving project success with a focus on delivering high-performance solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Python Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed scalable back-end systems using **Python** and **Django**, implementing efficient **REST API** services and adhering to best practices in **Database Management**.\n- Engineered CI/CD pipelines leveraging **AWS** and **Kubernetes** for automated deployments, facilitating streamlined **DevOps** processes.\n- Conducted code reviews and provided mentorship to ensure high-quality standards and effective **Refactoring** practices within the team.\n- Designed and maintained robust SQL-based databases for seamless data retrieval and management, optimizing performance and reliability.\n- Collaborated with cross-functional teams, ensuring clear **Communication** throughout project cycles to align development with business requirements.\n- Established comprehensive **Test Strategy** using automated testing frameworks to ensure quality and reliability across applications.\n- Implemented and maintained design patterns to enhance software architecture, promoting scalability and maintainability of the systems.\n- Analyzed and refactored existing codebases to improve performance and adhere to modern coding standards, leading to a **30%** enhancement in efficiency.\n- Spearheaded the integration of cloud-based solutions on **AWS**, enabling dynamic scaling and improved application performance.\n- Authored clear documentation for all processes and systems developed to foster knowledge sharing and facilitate future refactoring efforts."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Leveraged **Python** and **Django** to build scalable backend systems, improving response times by **30%** across various financial applications.\n- Designed and implemented **REST API** and **GraphQL** interfaces to enhance data retrieval processes, reducing data fetch time by **25%**.\n- Developed and maintained **SQL** databases, ensuring efficient data management and retrieval while refining database queries to enhance performance by **15%**.\n- Participated in **CI/CD** practices by using **Git** for version control, improving deployment frequency by **40%** through automation best practices.\n- Engaged in regular **Code Reviews** and implemented **Automated Testing** strategies, leading to a **20%** reduction in production bugs over **6 months**.\n- Adopted **DevOps** principles for application deployment in **AWS** environments, optimizing resource use and decreasing server costs by **20%**.\n- Advocated for **Refactoring** practices to improve code quality and maintainability, contributing to smoother development cycles and enhanced team productivity.\n- Combined effective **Communication** with technical teams to facilitate seamless collaboration on projects, improving project timelines by aligning on goals and deliverables.\n- Embedded design patterns in code to solve recurring problems, enhancing code efficiency and reducing maintenance time by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable backend services using **Python** (Django) for a high-traffic e-commerce platform, enhancing performance and reliability with a focus on **SQL** databases.\nImplemented CI/CD pipelines and DevOps practices to streamline deployment processes, resulting in a **20%** reduction in deployment times and improved code quality through rigorous **code reviews** and **automated testing** strategies.\nEngineered comprehensive REST APIs and **GraphQL** endpoints to facilitate seamless data integration between frontend applications and backend services, reducing data retrieval times by **15%**.\nCollaborated in a **Kubernetes**-orchestrated environment to manage microservices architecture, ensuring high availability and resilience of applications serving millions of users.\nApplied best practices in **design patterns** and **refactoring** to improve code maintainability and reduce technical debt by **30%**.\nParticipated in the creation and execution of effective **test strategies**, ensuring high-quality deliverables through continuous integration and comprehensive testing frameworks.\nCommunicated effectively with cross-functional teams to gather requirements and provide solutions that align with business objectives, fostering a culture of collaboration.\nEngaged in **AWS** cloud services for deploying applications and supporting infrastructure scalability, further enhancing the platform's overall performance and flexibility.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tDjango\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tGraphQL, REST API\n\n **Serverless and Cloud Functions:**\n\tAWS\n\n **Databases:**\n\tSQL, PostgreSQL, MySQL, MongoDB\n\n **DevOps:**\n\tCI/CD, Docker, Kubernetes, Git, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tCode Reviews, Automated Testing, Refactoring, Design Patterns, Database Management, Test Strategy, Communication, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Redis, Terraform, Ansible, Helm, Docker Compose"
}