{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior JavaScript Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior JavaScript Engineer with 13+ years of experience delivering high-performance applications, specializing in **JavaScript**, **TypeScript**, and framework-rich environments, including **React** and **Vue.js**. Adept in HTML5, CSS3, and modern web practices, including asynchronous requests and cross-browser compatibility, ensuring seamless user experience across platforms.\nProficient in leveraging **Node.js** for backend development and utilizing tools such as **Gulp** and **Webpack** for efficient project builds. Experienced in implementing microservice architecture and promoting collaborative development with **Git**, helping to streamline code integration and version management.\nAdept in building robust applications with a deep understanding of DOM manipulation and web browser internals. My strengths extend to developing AI/ML-powered platforms, deploying cloud-native systems on **AWS** and **Azure**, and ensuring compliance with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to develop high-performance applications, ensuring optimal code quality and structure.\nImplemented front-end solutions using **React (17–18)** and **Vue.js** to create interactive and responsive user interfaces, adhering to web standards and best practices.\nApplied **HTML5** and **CSS3** techniques to build visually compelling layouts and styles, maintaining **cross-browser compatibility** for diverse user environments.\nDeveloped and optimized asynchronous requests to enhance application performance and responsiveness across various devices and browsers.\nExecuted microservice architecture strategies for seamless integration and scalability, enhancing system reliability and maintainability.\nUtilized **Node.js** to create backend services and APIs that support front-end functionality, ensuring efficient data exchange and processing.\nEmployed tooling such as **Webpack** and **Gulp** to streamline build processes, improving development efficiency and enabling comprehensive source management.\nDesigned and implemented testing strategies leveraging Behavior-Driven Development (BDD) principles with tools like **Playwright** to ensure high quality and performance of web applications.\nCollaborated with team members using **Git** for version control and code management, ensuring smooth collaboration and integration of code changes in a multi-developer environment.\nMaintained documentation and ensured best practices for code quality, contributing to a well-organized and efficient development workflow."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed interactive front-end applications leveraging **JavaScript**, **React (18)**, **Vue 3**, and **TypeScript**, enhancing user experience and interface responsiveness for financial tools.\n• Utilized **Git** for source control management, ensuring efficient code versioning and collaboration across a team of ***9*** engineers.\n• Implemented advanced **asynchronous requests** to improve application performance and responsiveness, facilitating cross-browser compatibility.\n• Created responsive user interfaces using **HTML5**, **CSS3**, and **Tailwind CSS**, adhering to modern design principles and industry best practices.\n• Migrated legacy systems to a scalable **microservices architecture** with **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, resulting in a ***30%*** improvement in scalability and system performance.\n• Designed ETL pipelines employing **Python**, **Apache Airflow**, and **Azure Data Factory** for processing financial data, achieving real-time data ingestion rates of up to ***1000*** records per second.\n• Delivered real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, providing key insights into transaction patterns and anomalies to operations teams.\n• Built and deployed **machine learning models** for fraud detection utilizing **scikit-learn** and **XGBoost**, enhancing fraud detection accuracy by ***25%*** through advanced behavioral analytics.\n• Established comprehensive ML pipelines for tasks such as credit scoring and transaction classification, utilizing **MLflow** and **Airflow**, integrating predictive analytics into backend services for enhanced decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed interactive, responsive web applications utilizing **React (18)**, **Vue 3**, and **HTML5/CSS3** to enhance user experience while ensuring cross-browser compatibility and adherence to UX best practices.\n• Implemented modern JavaScript features and frameworks, emphasizing **ES6** syntax and enhancing performance with **TypeScript** and **Gulp** for task automation and build optimization.\n• Optimized web assets and resources using **Webpack** for efficient loading and improved application performance, achieving load times under **2 seconds** for critical pages.\n• Utilized **Node.js** and microservice architecture to build scalable backend services, facilitating asynchronous handling of requests while maintaining responsiveness even under high traffic.\n• Conducted extensive code reviews and applied **Behavior-Driven Development** principles to ensure high code quality and foster collaboration among team members.\n• Created automated testing suites using **Playwright** to ensure functionality and cross-browser compatibility, reducing reported bugs by **25%** during deployment phases.\n• Maintained version control and collaboration through **Git**, ensuring effective management of revisions and consistent integration practices.\n• Integrated CSS pre-processing techniques to streamline styling and enhance maintainability of the UI components, improving development speed by **15%**.\n• Enhanced application architecture by utilizing asynchronous requests to improve performance and user experience across platforms.\n• Collaborated closely with UX/UI designers to ensure the feasibility of design concepts and address DOM-based performance issues, resulting in a **20%** increase in user engagement."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS3, ECMAScript 5, ECMAScript 6, Gulp, Webpack\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **API Technologies:**\n\t(asynchronous requests, cross-browser compatibility, DOM)\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, microservice architecture, Behavior-Driven Development, Playwright",
  "apply_company": "Aylo"
}