{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven Sales Engineer with a strong background in technical sales and business development, leveraging 13+ years of full stack development experience to bridge the gap between technology and client needs. Proficient in **JavaScript/TypeScript**, **Python**, and **Flutter**, complemented by hands-on expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in communicating complex technical concepts in **Polish** and **English**, fostering strong customer relationships through effective communication skills and organizational expertise.\n\nKnowledgeable in **monitoring systems**, **wastewater technology**, and **water treatment equipment**, enabling the delivery of solutions that resonate with clients' operational requirements. Proven strategic planner with a knack for aligning technology solutions with business objectives, ensuring compliance with industry regulations. Adept at collaborating in team environments to drive project success and adaptability.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted technical sales presentations to showcase **wastewater technology** and **water treatment equipment**, emphasizing benefits to clients in the **biology** and **chemistry** sectors.\n- Developed and maintained strong **customer relationship management** strategies to effectively engage clients and ensure satisfaction, enhancing **business development** efforts by **30%**.\n- Collaborated with cross-functional teams to deliver tailored solutions that meet customer needs, demonstrating exceptional **communication skills** and **teamwork**.\n- Utilized analytical skills to monitor systems and identify opportunities for strategic planning in projects related to wastewater technology.\n- Produced detailed reports and presentations using **MS Office**, effectively communicating complex ideas and technical concepts to non-technical stakeholders.\n- Fostered partnerships with stakeholders to enhance service delivery in water treatment initiatives, achieving a **15%** growth in service contracts.\n- Delivered training sessions on new products and technologies, leveraging **monitoring systems** to optimize product use and customer satisfaction.\n- Engaged with clients in both **Polish** and **English** to provide tailored support and address inquiries regarding chemistry and biology applications in wastewater treatment solutions.\n- Implemented innovative solutions that prioritize efficiency and sustainability in water treatment projects, aligning with best practices in the industry.\n- Assisted in developing strategic marketing plans for new product launches and technologies in wastewater treatment, integrating feedback from clients and industry trends."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized strong **communication skills** to engage clients and understand their wastewater technology needs, providing tailored solutions for effective water treatment.\nLeveraged **organizational skills** to manage multiple projects and client relationships simultaneously, ensuring timely follow-ups and support throughout the sales process.\nDeveloped and implemented **strategic planning** initiatives to identify new business development opportunities, increasing market penetration by **25%** within **12 months**.\nCollaborated with technical teams to relay customer feedback on monitoring systems and wastewater technology, enhancing product offerings and customer satisfaction.\nFacilitated training sessions for clients on the operation of **water treatment equipment** and **monitoring systems**, improving user competency and system efficiency.\nMaintained proficiency in both **Polish** and **English languages** for effective communication with diverse client bases, resulting in improved customer relations and support.\nConducted technical presentations and demonstrations of products and solutions to potential clients, utilizing **MS Office** to create engaging materials that highlight key features and benefits.\nAssisted in the development of new marketing strategies for promoting wastewater technology products, leading to a **30%** increase in leads over a **6-month** period.\nFostered **teamwork** among cross-functional teams to achieve sales targets and enhance customer satisfaction, contributing to a better collaborative work environment."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engaged in **business development** and **customer relationship management** to provide tailored technical solutions in wastewater technology, ensuring alignment with client needs and industry standards.\nConducted in-depth presentations and demonstrations of **water treatment equipment** and related **monitoring systems**, showcasing expertise in **chemistry** and **biology** to enhance customer understanding and engagement.\nUtilized strong **communication skills** to build and maintain relationships with clients, effectively conveying complex technical concepts and solutions to diverse audiences.\nDeveloped strategic sales plans incorporating market analysis and competitor insights, contributing to a **30% increase** in quarterly sales through targeted outreach and **strategic planning**.\nCollaborated closely with cross-functional teams, demonstrating exceptional **teamwork** and organizational skills to align technical solutions with sales strategies and client expectations.\nProvided technical support and training for internal teams and clients, ensuring effective use of products and services post-purchase, leading to a **20% improvement** in customer satisfaction ratings.\nPerformed market research and gathered feedback to continuously improve product offerings, leveraging insights to drive further **business development** efforts.\nMaintained proficient use of **MS Office** tools in creating sales reports and presentations, ensuring clear communication of progress and strategies to stakeholders.\nFluent in **Polish** and **English**, facilitating effective communication with Polish-speaking clients and partners, thus broadening market reach across different demographics."
    }
  ],
  "skills": " \n**Programming Languages:** \n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular \n\n**Backend Frameworks:** \n\t \n\n**Frontend Frameworks:** \n\t\n\n**API Technologies:** \n\t\n\n**Serverless and Cloud Functions:** \n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database \n\n**Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis \n\n**DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n\n**Cloud & Infrastructure:** \n\t \n\n**Other:** \n\ttechnical sales, chemistry, wastewater technology, biology, monitoring systems, water treatment equipment, business development, customer relationship management, communication skills, strategic planning, MS Office, Polish language, English language, organizational skills, teamwork"
}