{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Javascript Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior JavaScript Engineer with 8 years of experience specializing in **JavaScript**, **Node.js**, and **Express**. I have a proven track record in developing scalable applications leveraging **AWS Lambda** and **Azure Functions** within agile environments. My proficiency in **MongoDB** enables me to build high-performance back-end solutions effectively. I excel at problem-solving and thrive in team-oriented settings, ensuring effective communication across all project stages.\nIn addition to my core skills, I bring extensive full-stack development knowledge, having successfully built enterprise applications in diverse sectors like healthcare and finance using **React**, **Next.js**, **Vue**, and **FastAPI**. I am well-versed in cloud technologies with hands-on experience in **AWS** and **Azure**, and I contribute to the architectural design with insights from microservices and event-driven systems.\nMy commitment to crafting secure and compliant applications is complemented by my experience adhering to standards such as HIPAA and PCI DSS, alongside expertise in CI/CD practices. I have also developed machine learning pipelines and MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**, integrating innovative AI/ML capabilities into my projects.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Javascript Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Focused on utilizing **JavaScript**, **Node.js**, and **Express** for developing high-performance applications:\n- Architected and developed scalable, full-stack platforms, ensuring compliance with industry standards while employing **MongoDB** for efficient data management.\n- Leveraged **AWS Lambda** and **Azure Functions** for implementing serverless architectures, enhancing application scalability and reducing operational costs.\n- Collaborated effectively with cross-functional teams, promoting a team-oriented environment that drives problem-solving and innovative thinking.\n- Communicated complex technical concepts clearly to stakeholders, ensuring alignment and understanding of project goals and advances.\n- Developed and deployed cross-platform mobile applications using **React Native**, delivering user-friendly experiences across iOS and Android platforms.\n- Implemented CI/CD pipelines for mobile applications using **Fastlane** and **App Center**, achieving streamlined releases and minimized downtime, with an aim to improve deployment frequency by 30%.\n- Led the transition of monolithic applications into microservices ecosystems using **Docker** and **Kubernetes (AKS/EKS)**, increasing system resilience and efficiency by 40%.\n- Designed and maintained cloud-native data architecture with **PostgreSQL** and **MongoDB**, optimizing for large-scale data ingestion and storage, ultimately improving data retrieval speed by 50%.\n- Built MLOps pipelines with **MLflow** and **Apache Airflow** for versioning and deployment of machine learning models, reducing model deployment time from weeks to days.\n- Integrated advanced search capabilities using **Azure Cognitive Search** and **ElasticSearch**, improving access to unstructured and structured health records leading to a 20% increase in operational efficiency.\n- Established testing frameworks using **Jest** and **Cypress**, achieving 99% test coverage for front-end services and 95% for backend services, ensuring high software quality.\n- Delivered dynamic financial data visualization tools using **D3.js** and **Chart.js**, providing stakeholders with actionable insights into transaction trends and operational KPIs."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **Node.js** (Express) to develop and modernize financial platforms, implementing a microservices-based architecture that improved scalability and throughput for high-volume transaction systems.\nEmployed effective **problem-solving** skills to build dynamic front-end applications using **React** (18), ensuring user engagement through responsive design in financial dashboards and admin portals.\nCommunicated effectively with cross-functional teams to develop real-time transaction monitoring dashboards using **React**, **D3.js**, and **Power BI Embedded**, providing analytics that enabled operations teams to track financial activity and detect anomalies in the system.\nIntegrated **AWS Lambda** and **Azure Functions** with messaging tools like **Kafka** and **RabbitMQ**, establishing a robust event-driven architecture for real-time transaction processing and compliance workflows.\nLed the design and orchestration of ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory**, achieving batch and real-time ingestion of financial data from various sources, supporting a data throughput of over **5TB/month**.\nAdvanced fraud detection efforts by implementing AI/ML models with **scikit-learn** and **XGBoost** on **Azure Machine Learning**, successfully reducing fraudulent transactions by **30%** through proactive detection of suspicious activities.\nCreated ML pipelines utilizing **MLflow** and **Airflow** for tasks such as credit scoring and churn prediction, incorporating model inference seamlessly into backend services for real-time decision-making, enhancing business insights.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed dynamic web applications using **JavaScript**, **NodeJS**, and **Express**, ensuring high performance and scalability for end-user functionalities in an e-commerce environment.\n• Collaborated as a team player to solve complex backend challenges through innovative use of **MongoDB** for efficient data management, supporting up to **9 million** monthly active users.\n• Optimized serverless functions with **AWS Lambda** and **Azure Functions**, significantly reducing operational costs by **30%** while improving deployment speed to under **5 minutes**.\n• Leveraged solid problem-solving skills to troubleshoot and enhance application performance, resulting in a **25%** decrease in response times across various services.\n• Maintained effective communication within cross-functional teams, ensuring project objectives were met within timelines by aligning team efforts in the development cycle.\n• Implemented data caching strategies using **MongoDB**, achieving a **60%** reduction in database load and ensuring consistent user experience during peak traffic times.\n• Actively participated in code reviews and knowledge sharing sessions, promoting a collaborative environment and continuous learning among peers, leading to an **improvement** in team velocity by **15%**."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, NodeJS, Express\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAWS Lambda, Azure Functions\n\n**Serverless and Cloud Functions:**\n\t\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Mongo\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tProblem Solving, Team Player, Effective Communication, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Redis",
  "apply_company": "Lumenalta"
}