{
  "name": "Tomasz Lee",
  "role_name": "Senior Fullstack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Accomplished Senior Fullstack Engineer with over 9 years of experience in developing and optimizing full-stack applications using a robust tech stack that includes **React**, **TypeScript**, **Redux**, **Node.js**, **Express**, **REST**, **GraphQL**, **PostgreSQL**, and **MongoDB**. Proficient in designing responsive user interfaces with **CSS** and **HTML**, while ensuring seamless integration of backend services. Proven expertise in implementing CI/CD practices to enhance development workflows and utilizing **AWS** and **Firebase** for cloud solutions. Strong analytical skills complemented by a track record of leading teams in delivering high-quality, scalable applications on time. Excels in collaboration, consistently driving project success while adhering to best practices in software development.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **React**, **TypeScript**, and **Redux** to build dynamic user interfaces, enhancing user engagement metrics by 25%.\nDeveloped and maintained RESTful APIs using **Node.js** and **Express**, connecting seamlessly with **MongoDB** and **PostgreSQL** databases for data retrieval, ensuring a 35% improvement in response times.\nImplemented **GraphQL** to streamline data querying processes, enabling efficient data management across multiple services.\nDesigned and executed CI/CD pipelines using best practices, significantly reducing deployment time by 40%.\nUtilized **AWS** for cloud deployments, ensuring high availability and scalability of applications, with a response time reduction of up to 20%.\nConducted detailed performance testing using tools like **Lighthouse** and **Axe**, achieving optimal accessibility and performance scores.\nCreated comprehensive documentation and conducted code reviews to maintain code quality and foster collaboration in agile environments.\nEmployed cutting-edge front-end technologies like **CSS** and **HTML** to ensure responsive and accessible web layouts.\nIntegrated various third-party APIs and tools to expand functionality and improve user experience.\nWorked closely with cross-functional teams to drive project success and meet tight deadlines while balancing multiple projects."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed responsive web applications using **React**, **TypeScript**, and **Redux**, enhancing user interaction and increasing overall engagement by **25%**.\nDesigned and maintained RESTful APIs while integrating with a **PostgreSQL** database for efficient real-time data access, ensuring minimal data latency and improved performance.\nImplemented **Node.js** and **Express** for server-side logic and APIs, fostering a robust, scalable environment for project development.\nCreated seamless client-side experiences employing **HTML** and **CSS**, focusing on mobile-first design and usability.\nEngineered CI/CD pipelines utilizing **AWS** and **GitHub Actions**, significantly reducing production deployment errors by **30%**.\nLeveraged **Firebase** for backend support, enhancing application performance and reliability.\nConducted comprehensive code reviews and mentoring sessions with junior developers, leading to improved team productivity and collaboration.\nUtilized performance testing tools such as **Lighthouse** and **Axe** to identify areas for optimization, contributing to a **15%** boost in application efficiency.\nPlayed a key role in the architecture design of projects by collaborating with stakeholders to establish clear system requirements and project timelines.\nEmployed best practices in software development by utilizing agile methodologies for project management and implementation."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **React**, **TypeScript**, and **Redux** to develop highly interactive web applications, enhancing user experience and interface performance by **30%**.\nDesigned and implemented RESTful APIs and **GraphQL** endpoints using **Node.js** and **Express**, ensuring efficient data retrieval and seamless integration with frontend components.\nCollaborated with cross-functional teams to create responsive layouts using **CSS** and **HTML**, achieving a mobile-first design that increased accessibility.\nManaged databases with **PostgreSQL** and **MongoDB**, optimizing queries to improve data retrieval times by **25%**.\nDeveloped and maintained CI/CD pipelines to streamline the deployment process, reducing deployment times from hours to **minutes**.\nEmployed **AWS** and **Firebase** for cloud services, contributing to the scalability and reliability of applications.\nConducted code reviews and mentoring sessions to uphold high coding standards and best practices across the team.\nPerformed performance audits with **Lighthouse** and accessibility checks using **Axe**, improving web app scores by **20%** over baseline values.\nDelivered comprehensive technical documentation and user guides, enhancing onboarding processes and knowledge share across departments.\nParticipated in Agile ceremonies, including daily standups and sprint retrospectives, to ensure project alignment and continuous improvement."
    }
  ],
  "skills": " **Programming Languages** \n\t Python, TypeScript, JavaScript \n\n **Frontend Frameworks** \n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, TailwindCSS, Three.js, D3.js, React Native, Flutter, Chakra UI, CSS, HTML \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices \n\n **API Technologies** \n\t RESTful API, GraphQL, REST \n\n **Databases** \n\t PostgreSQL, MongoDB, DynamoDB, CosmosDB, MSSQL Server, MySQL \n\n **Cloud & Infrastructure** \n\t AWS, Azure, Firebase \n\n **DevOps** \n\t CI/CD pipelines \n\n **Messaging & Caching** \n\t Apache Kafka, RabbitMQ, Redis \n\n **Testing Tools** \n\t NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest \n\n **Blockchain** \n\t Solidity, Ether.js, Web3.js, Ethereum \n\n **Other** \n\t UX/UI Design, Git, GitHub, Redux, Lighthouse, Axe",
  "apply_company": "AccessiWay"
}