{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software / Application Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a proficient Software/Application Developer with 8 years of experience, I excel in building scalable solutions utilizing **C#**, **.NET**, and **PowerShell** within Agile development frameworks. My technical expertise extends to creating **RESTful APIs** and integrating **Power Apps** and **Power Automate** to enhance productivity and streamline workflows. I have a strong foundation in cloud technologies, particularly **Microsoft Azure**, and database management with **SQL**.\n\nAdditionally, I leverage modern development approaches and practices to deliver high-quality applications. My original strengths include building applications with **JavaScript/TypeScript**, **Python**, and **Flutter**, while also spearheading enterprise-grade platforms with AI/ML integration for analytics and automation. My experience in microservices architecture, CI/CD automation, and compliance standards includes working on healthcare and financial sector applications, ensuring that they align with regulations such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software / Application Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed robust and scalable applications using **C#** and **.NET** frameworks to ensure high-performance and maintainability of software solutions.\nDesigned and implemented **RESTful APIs** to facilitate seamless data exchange between diverse systems while adhering to optimal architectural practices.\nLeveraged **Microsoft Azure** cloud services for deploying applications, ensuring reliability and scalability in cloud-based environments, optimizing for costs and performance metrics by up to **30%**.\nUtilized **SQL** to design and query relational databases, ensuring efficient data retrieval and storage with minimized latency, achieving response times under **200ms**.\nAutomated workflows using **Power Automate** and **Power Apps** to enhance productivity and streamline processes, resulting in a **20%** increase in operational efficiency.\nEmployed **Agile development** methodologies to drive the software development lifecycle, ensuring timely delivery of features through iterative development and frequent feedback.\nIntegrated security best practices in all development phases to comply with industry standards, reinforcing data protection and system integrity against potential vulnerabilities.\nCollaborated with cross-functional teams to gather requirements and translate them into technical specifications, enhancing stakeholder engagement and satisfaction.\nParticipated in code reviews and established coding standards to maintain code quality and collective code ownership, leading to a **15%** reduction in bugs across production releases."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **C#**, **.NET**, and **SQL** to develop robust applications that enhance functionality and performance for end-users in financial systems.\nEmployed **RESTful APIs** to facilitate seamless integration with third-party services and internal components, increasing system interoperability and efficiency.\nLeveraged **Microsoft Azure** services to deploy applications, ensuring high availability and scalability for mission-critical financial operations, with successful deployment in Azure environments.\nImplemented automation scripts using **PowerShell** to streamline deployment processes and reduce downtime by **30%**.\nCreated user-friendly applications using **Power Apps** to digitize manual processes and boost operational productivity by **25%**.\nAutomated workflows with **Power Automate**, enhancing efficiency and reducing manual intervention in repetitive tasks by **40%**.\nEmployed Agile development practices to ensure timely delivery of projects, facilitating iterative progress and adaptability to changing requirements in a fast-paced environment.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed RESTful APIs using **C#** and **.NET** to enhance application performance and facilitate seamless communication between backend and frontend services, improving response times by **30%**.\n• Utilized **PowerShell** for automated deployment and management of Azure resources, reducing manual workload by **40%** and deploying updates with minimal downtime.\n• Created custom applications within the **Power Apps** environment, enabling users to quickly adapt workflows to changing business needs and enhancing overall team productivity by **25%**.\n• Implemented **Power Automate** workflows for process automation, improving efficiency in business operations and reducing task completion times by **15%**.\n• Conducted thorough database management and query optimization using **SQL**, ensuring reliable and efficient data storage and retrieval, which bolstered application performance significantly.\n• Engaged in Agile development methodologies, participating in sprints and daily stand-ups to facilitate collaboration, enhance delivery speed, and adapt to changing requirements dynamically.\n• Designed and maintained cloud services using **Microsoft Azure**, leveraging its capabilities for deploying scalable applications that meet evolving user demands.\n• Collaborated with cross-functional teams to ensure alignment on functional requirements and project timelines, fostering a collaborative environment that drives innovation.\n• Optimized existing backend services for improved scalability and resilience, contributing to a **99.9% uptime** record, critical for user satisfaction and retention.\n• Enhanced user experience by integrating responsive design principles and best practices, achieving higher user engagement and retention rates."
    }
  ],
  "skills": "Programming Languages:\n\tC#, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\t.NET, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tMicrosoft Azure, AWS\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile development, PowerShell, Power Apps, Power Automate"
}