{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Full Stack Engineer with 13+ years of experience developing high-performance applications across healthcare and financial sectors. Proficient in **Java**, **Go**, **JavaScript**, **TypeScript**, and **Angular**, with hands-on expertise in both frontend and backend development utilizing **React**, **Node.js**, and **npm**. Skilled in **Docker** and **Kubernetes** for containerization and orchestration, ensuring streamlined deployment and scalability. Experienced in building compliance-driven solutions aligned with HIPAA and PCI DSS standards.\nDemonstrated ability in software design, planning, and concept creation, with a strong focus on delivering robust architectural solutions. Proven track record in performance testing using **JMeter** and managing databases with **Oracle**, **SQL**, and **PL/SQL**. Adept at integrating **JBoss** and **Wildfly** for application hosting, while applying effective networking strategies for optimized system performance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained full-stack applications using **Java** and **Go**, ensuring seamless interaction with backend systems and APIs.\n- Designed microservices-based architectures employing **Docker** and **Kubernetes** for improved scalability and reliability across deployments.\n- Wrote high-quality, performant code in **Java** and **Typescript** while adhering to established software design principles and patterns.\n- Leveraged **Oracle** and **SQL** databases for efficient data management and retrieval, implementing **PL/SQL** procedures for complex business logic.\n- Collaborated closely with cross-functional teams to plan and create innovative solutions, contributing to project roadmaps and concept creation.\n- Utilized **JMeter** for performance testing, ensuring robustness and reliability under load while enhancing application performance.\n- Integrated **Angular** and **JavaScript** frameworks for dynamic front-end development, delivering a responsive and user-friendly interface.\n- Streamlined development workflows with **npm** for package management and dependency resolution across projects.\n- Conducted thorough code reviews and testing using best practices to maintain high standards of software quality across the tech stack.\n- Drove the implementation of networking solutions and architecture, enhancing the overall efficiency and security of application communication."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Go** frameworks to enhance backend services, ensuring high performance and scalability by implementing effective software design principles.\nLeveraged **Kubernetes** and **Docker** to orchestrate and containerize applications, drastically improving deployment efficiency by up to **30%**.\nApplied **Jakarta** EE for developing RESTful APIs, optimizing data handling with **Oracle** and **SQL** to facilitate robust interactions with relational databases.\nImplemented **Angular** and **JavaScript**/ **TypeScript** in building dynamic and responsive web applications, streamlining user experience in financial tools and integrated admin panels.\nExecuted load testing and performance optimization using **JMeter**, resulting in a **25%** increase in application throughput.\nConducted meticulous planning and concept creation workshops for cross-functional teams, ensuring alignment on project objectives and delivery timelines that reduced project backlog by **15%**.\nEnhanced networking solutions by optimizing protocols, which improved data transfer speed by measuring up to **200 Mbps** in high transaction environments.\nFacilitated seamless CI/CD processes, contributing to a **40%** reduction in deployment times through efficient use of tools like **npm** and version control workflows."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Go** for developing microservices architecture, ensuring robust and scalable backend systems tailored for high-demand environments in line with **Kubernetes** and **Docker** orchestration, achieving a **99.9%** uptime across production services.\nDesigned and implemented RESTful APIs with **Spring Boot** and **Wildfly**, enhancing service communication and maintaining data consistency across systems while ensuring a response time of under **200ms** during peak loads.\nEmployed **Angular** and **TypeScript (latest version)** to craft dynamic and responsive user interfaces, resulting in a **30%** increase in user engagement and experience metrics across multiple consumer touchpoints.\nConducted extensive performance testing using **JMeter**, identifying bottlenecks and optimizing code, leading to a performance improvement of **40%** in critical workflows.\nCollaborated with cross-functional teams for effective planning and concept creation, yielding a successful launch of **5** major features within tight deadlines through agile methodologies.\nImplemented effective networking and cloud strategies to streamline deployment processes, leveraging **Oracle** and SQL databases, ensuring transactional integrity and data security throughout the lifecycle.\nIntegrated complex software design principles to enhance system architecture, allowing for faster development cycles and easier maintenance, which reduced the overall defect rate by **25%**.\nUtilized **npm** for efficient package management across the front-end technology stack, ensuring smooth updates and version control of dependencies.\nContributed to the overall improvement of project documentation and technical specifications for future reference and onboarding, enhancing overall team efficiency."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, Go, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Jakarta, JBoss, Wildfly\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, RDS, S3\n\n**Databases:**\n\tPostgreSQL, MySQL, Oracle, SQL, PL/SQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, JMeter, Networking, Software Design, planning, concept creation, npm",
  "apply_company": "Dedalus"
}