{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Sales Engineer with a robust background in business development and technical sales, leveraging 9+ years of experience in the technology sector to provide innovative solutions in water treatment processes. Proficient in delivering effective strategies for filtration, softening, reverse osmosis, dewatering, and wastewater treatment solutions. Expertise in customer relationship management (CRM) and proposal management, coupled with strong communication and collaboration skills. Demonstrated ability to manage projects effectively while adhering to EMEA regulations and sustainability practices. Notable proficiency with Microsoft Office tools to support proposal and project documentation. Skilled in utilizing technical insights to enhance customer engagement and drive sales performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged strong **technical sales** acumen to devise tailored proposals and solutions for clients in the water treatment sector, resulting in a **25%** increase in customer satisfaction.\nEngaged in **business development** initiatives by identifying new market opportunities in **water treatment**, specifically in areas such as **filtration**, **softening**, and **reverse osmosis**.\nUtilized comprehensive knowledge of **wastewater treatment** processes and products to enhance **customer relationship management** (CRM) strategies, achieving a **40%** increase in lead conversion rates.\nImplemented effective **project management** practices to oversee project delivery timelines and ensure compliance with **EMEA regulations**, improving project success rates by **30%**.\nUtilized **Microsoft Office** Suite to create and manage proposals and presentations, facilitating seamless communication and collaboration with stakeholders.\nCollaborated with cross-functional teams to optimize filtration and dewatering solutions, enhancing operational efficiency.\nDesigned and presented training materials for clients on sustainability practices and product usage, which increased **customer retention** by **15%**.\nEngaged with customers post-sale to understand product performance and gather feedback for continuous improvement and innovation.\nManaged proposals for large-scale contracts, ensuring alignment with customer specifications and project goals."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged technical expertise in **water treatment** and **filtration** to develop solution proposals that directly contributed to a **15% increase** in sales productivity.\nCultivated strong business relationships through effective **communication** and **collaboration**, resulting in a **30% improvement** in customer satisfaction.\nManaged the sales process from proposal development to delivery, utilizing **CRM** systems to track leads and optimize workflows for better performance.\nDeveloped comprehensive knowledge of **reverse osmosis** technologies, enabling the creation of tailored solutions for complex customer needs.\nExecuted project management to ensure timely delivery of proposals, aligning with **EMEA regulations** and customer requirements to uphold sustainability standards.\nConducted informative product demonstrations and technical sales presentations, educating clients on **softening** and **wastewater treatment** technologies, boosting conversion rates.\nUtilized **Microsoft Office** tools for data analysis and client presentations, improving the clarity and professionalism of communication.\nFostered collaboration within the team to achieve sales targets, enhancing overall performance and driving a **25% increase** in sales figures.\nMentored junior sales engineers and provided training on proposal management strategies, fostering a culture of knowledge-sharing and efficiency."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Leveraged technical knowledge in **CRM** systems to enhance client interaction and drive customer relationship management strategies, contributing to a 20% increase in sales team productivity.\n• Developed business proposals utilizing **Microsoft Office**, ensuring alignment with customer needs and **EMEA regulations** during the sales process.\n• Collaborated with cross-functional teams to manage projects effectively, utilizing strong communication and collaboration skills.\n• Implemented effective water treatment solution strategies including **filtration**, **softening**, and **reverse osmosis**, driving successful project outcomes.\n• Engaged in the effective management of customer relationships, ensuring high satisfaction levels resulting in improved repeat business metrics.\n• Utilized industry knowledge of **dewatering** and **wastewater treatment** technologies to provide tailored solutions to clients, increasing the proposal win rate by 30%.\n• Developed and maintained comprehensive project management practices, streamlining workflows and resource allocation.\n• Provided technical sales support to the engineering team, demonstrating strong understanding of filtration technologies and sustainability practices.\n• Conducted market analysis to identify potential business development opportunities, contributing to a **25%** increase in leads.\n• Delivered impactful presentations and product demonstrations that effectively communicated complex technical concepts to diverse audiences."
    }
  ],
  "skills": "**Programming Languages**\n\tJavaScript, TypeScript, C#, .NET, Python, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**DevOps**\n\tCI/CD pipelines\n\n**Other**\n\tUX/UI Design, Git, GitHub, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis\n\n**Job-Related Skills**\n\ttechnical sales, business development, water treatment, filtration, softening, reverse osmosis, dewatering, wastewater treatment, CRM, Microsoft Office, proposal management, customer relationship management, sustainability, EMEA regulations, project management, communication, collaboration",
  "apply_company": "Nijhuis Saur Industries"
}