{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior ML Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-oriented Senior ML Engineer with 8 years of extensive experience in **Python**, **AWS**, **Azure**, and **GCP**, adept at developing advanced machine learning solutions. Proficient in utilizing cloud services such as **Docker**, **Kubernetes**, and **Terraform** to architect robust infrastructures, and leveraging SQL for efficient data management. Skilled in implementing ML techniques, including **NLP**, **GenAI**, and **LLM**, with a focus on real-time monitoring and observability. \n\nMy career includes leading enterprise projects that integrate cutting-edge AI/ML capabilities for enhanced predictive analytics and intelligent automation. I excel in developing efficient MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**. My strong background in **microservices architecture**, CI/CD automation, and compliance with security standards ensures that the applications I build are both performant and secure, complying with regulations like HIPAA and PCI DSS. I bring a collaborative approach to team projects, working closely with cross-functional teams to deliver high-quality solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** to design and deploy machine learning models for predictive analytics in finance and healthcare, focusing on patient risk prediction and financial fraud detection.\nLeveraged **AWS** and **Azure** cloud services to implement scalable ML solutions and integrate real-time inference services into existing backend systems, ensuring high availability and performance.\nDeveloped and maintained containerized applications using **Docker** and orchestrated microservices with **Kubernetes**, enabling efficient resource management and deployment of ML models in production.\nCollaborated with cross-functional teams to adopt **Terraform** for infrastructure as code, ensuring consistent and repeatable cloud deployments across **GCP**, **AWS**, and **Azure** environments.\nImplemented advanced monitoring and observability practices using **Elastic Stack** to provide insights on model performance and operational metrics across platforms.\nUtilized **SQL** and NoSQL databases for data management, facilitating efficient ingestion and retrieval of large datasets relevant to ML applications in the healthcare and financial sectors.\nEmployed state-of-the-art **NLP** techniques for enhancing client-facing functionalities such as document parsing and financial anomaly detection within cross-platform applications.\nEstablished robust testing frameworks and security measures within CI/CD pipelines to ensure high standards of quality and security for all deployed ML solutions.\nDelivered presentations and reports to stakeholders on project progress, demonstrating strong collaboration and effective communication throughout the software development lifecycle.\nAchieved a deployment consistency of **95%** across cloud environments by optimizing deployment processes and reducing time-to-market for ML features."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to develop ML models for detecting fraud, employing **scikit-learn** and **XGBoost**, enhancing anomaly detection capabilities by **30%**.\nLeveraged **Azure** and **Docker** to implement scalable ML pipelines for real-time decision-making, resulting in a **25%** increase in processing efficiency.\nIntegrated **Terraform** to manage infrastructure as code, facilitating deployment across **AWS** and **GCP** environments with high availability and resilience.\nEmployed **Kubernetes** for container orchestration, ensuring seamless scalability of machine learning applications that handled up to **10,000** concurrent users.\nDesigned and maintained a robust monitoring and observability strategy using the **Elastic Stack**, resulting in a **40%** improvement in troubleshooting and incident response times.\nCollaborated with cross-functional teams to implement scalable AI solutions, leveraging NLP and Generative AI frameworks to enhance user experiences and business insights.\nCrafted SQL queries to analyze model performance data, optimizing existing pipelines for improved predictive accuracy in financial forecasting and risk assessment.\nLed workshops on ML security best practices, enhancing collaboration across teams to address potential vulnerabilities in AI models and deployment strategies."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** along with **AWS**, **GCP**, and **Azure** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules to enhance user experience and business operations.\nImplemented robust **ML** models leveraging **NLP** techniques to personalize product recommendations, optimize search relevance, and significantly improve conversion rates based on real-time behavioral data. \nEngineered real-time processing features using Docker and **Kubernetes** for container orchestration and scalable microservices architecture, promoting resilient data workflows with a focus on monitoring and observability.\nDeveloped SQL-based reporting and data analysis tools to enhance insights on user behavior, applying **Terraform** for infrastructure as code, facilitating seamless deployment processes across environments.\nCreated secure, efficient ML pipelines and integrated models within the e-commerce platform, maintaining compliance with security best practices and improving application resiliency through experimental A/B testing with **CDK**.\nLeveraged **Elastic Stack** for logging and monitoring to ensure visibility into application performance, analyzing data for continuous improvement and prompt issue resolution.\nFostered team collaboration through effective communication and agile methodologies, conducting code reviews designed to enhance system performance and maintain best coding practices.\nApplied role-based access control (RBAC) and OAuth 2.0 to maintain secure user authentication across the platform while achieving GDPR compliance for data protection.\nDesigned and built a monitoring dashboard for infrastructure visibility using **Prometheus** and **Grafana**, successfully reducing incident response time by **30%** through enhanced alerting mechanisms."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, ML, NLP, GenAI, LLM, Elastic Stack, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Security, Observability, Monitoring, Collaboration",
  "apply_company": "sevdesk"
}