{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Ruby Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior Ruby Engineer with 8 years of full-stack development experience, specializing in building scalable and secure applications using **Ruby**, **Ruby on Rails**, and modern development practices. Proficient in implementing **TDD**, **continuous integration**, and **continuous delivery** to enhance software quality and delivery speed. Experienced in working with databases such as **PostgreSQL** and developing **RESTful APIs** while ensuring compliance with secure coding standards.\n\nSkilled in using **Git**, **GitHub**, and **GitLab** for version control and collaboration within **agile** teams, leveraging **DevOps** practices and **infrastructure-as-code** for efficient deployment. My background also includes expertise in **React**, **TypeScript**, and cloud services such as **AWS**, delivering AI/ML-enabled functionalities and automated workflows.\n\nI am committed to clean code principles, automated testing (unit, integration, system testing), and code documentation, which have contributed to the development of enterprise solutions in fast-paced and remote work environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Ruby Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained secure, scalable applications using **Ruby** on **Ruby on Rails**, integrating **PostgreSQL** for efficient data storage and management in compliance with industry standards.\n• Implemented Test-Driven Development (TDD) practices, ensuring high code quality through rigorous **unit testing**, **integration testing**, and **system testing**.\n• Designed and built RESTful APIs for seamless communication between services, enhancing application performance and reliability.\n• Utilized **Git**, **GitHub**, and **GitLab** for robust version control and collaborative code management within agile teams.\n• Employed **continuous integration** techniques to automate testing and deployment pipelines, reducing release cycle times by **30%**.\n• Leveraged **DevOps** best practices, including infrastructure-as-code, to streamline deployment and ensure system scalability.\n• Collaborated effectively in a remote work environment, fostering communication and productivity among cross-functional teams.\n• Ensured code documentation is comprehensive and adheres to clean coding standards, facilitating knowledge transfer and onboarding of new team members.\n• Integrated automated solutions to improve workflows and reduce manual effort, enhancing overall team efficiency by **25%**.\n• Provided mentorship on secure coding practices to junior engineers, promoting a culture of security-first development.\n• Actively participated in design and code reviews to uphold the software development lifecycle best practices and encourage healthy collaboration.\n• Enhanced existing applications by incorporating **React** for building dynamic user interfaces, ensuring a modern and responsive front-end experience."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Ruby on Rails** to develop and maintain RESTful APIs, ensuring adherence to **TDD** and **secure coding** guidelines while producing clean, efficient code.\nImplemented **PostgreSQL** database solutions to enhance application performance and conducted **unit testing**, **integration testing**, and **system testing** to validate application reliability and functionality.\nManaged version control systems using **Git**, contributing to projects on **GitHub** and **GitLab** to streamline collaborative efforts and maintain code consistency across teams.\nLed the transition to **AWS** cloud services, employing **DevOps** principles and **infrastructure-as-code** for efficient deployment and scaling of applications.\nDeveloped user-centric applications employing **React** and **TypeScript**, enhancing user engagement and application responsiveness while leveraging test-driven development practices.\nFacilitated agile methodologies and implemented continuous integration and delivery workflows, enabling a faster release cycle and higher quality deliverables.\nContributed to team collaboration in a remote work environment, emphasizing automation and clean coding practices to foster shared knowledge and skills among peers."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed robust and scalable backend services utilizing **Ruby on Rails** with a focus on **RESTful APIs**, ensuring high performance and maintainability across applications for an e-commerce platform.\nImplemented Test-Driven Development (TDD) and automated unit testing protocols to enhance code reliability and meet quality benchmarks, achieving a reduction in bugs by **30%** during deployment.\nLed continuous integration and delivery (CI/CD) practices using **Git**, **GitHub**, and **GitLab** for managing code workflows and ensuring rapid iterations with minimal downtime.\nCollaborated on agile teams to design and implement features, utilizing **PostgreSQL** for efficient data management and ensuring scalability for **1M+** transactions daily.\nDesigned clean, maintainable code using **TypeScript** with integrated unit and system testing, leading to a **25%** increase in feature delivery speed.\nEnhanced application security through secure coding practices, including **OAuth 2.0** for authentication and role-based access control (RBAC), ensuring **GDPR compliance** for sensitive user data.\nFostered documentation standards for code repositories and APIs, enhancing team collaboration and onboarding processes in a remote work environment.\nApplied DevOps practices with **AWS** and infrastructure-as-code strategies to automate deployment processes, resulting in reduced deployment times from **4 hours** to **1 hour**.\nEngaged in code reviews and mentoring, promoting collaboration and adherence to clean code principles within the team, leading to improved team performance and delivery outcomes.\n"
    }
  ],
  "skills": " **Programming Languages:** \n\tRuby, Python, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\tRuby on Rails, FastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tRESTful APIs\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, CI/CD\n\n **Cloud & Infrastructure:** \n\tAWS, Azure, Docker Compose, infrastructure-as-code\n\n **Other:** \n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, TDD, continuous integration, secure coding, code documentation, unit testing, integration testing, system testing, Git, collaboration, remote work, clean code, automation, continuous delivery",
  "apply_company": "Oyster®"
}