{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Engineer with 13+ years of experience, specializing in building high-performance applications and proficient in **React**, **TypeScript**, **Next.js**, **Python**, and **AWS**. A strong advocate of CI/CD practices, experienced in implementing **GitHub Actions** to enhance collaborative workflows and continuous improvement processes. Skilled in developing REST and GraphQL APIs, and expertise in styling with **SCSS**. Demonstrated ability in debugging complex issues and providing effective problem-solving solutions. Additionally, adept at full stack development with a solid foundation in both frontend and backend technologies including **FastAPI** and **Django**. Well-versed in compliance-driven environments, aligning solutions with industry standards such as HIPAA and PCI DSS, while also bringing a robust understanding of AI/ML applications through MLOps methodologies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed high-performance front-end applications using **React** (17–18) and **TypeScript**, ensuring seamless user experience and responsive design.\n• Created and maintained robust REST and **GraphQL** APIs for efficient data interactions across various services and applications.\n• Implemented **CI/CD** processes using **GitHub Actions** to ensure rapid deployment cycles, achieving a deployment frequency of up to **10** releases per week.\n• Designed and built secure applications utilizing **Python** with a focus on problem-solving and debugging to enhance software reliability.\n• Collaborated with cross-functional teams to facilitate continuous improvement in application performance and feature set, leveraging agile methodologies.\n• Integrated style management through **SCSS** to ensure consistency and maintainability across multiple projects.\n• Actively contributed to code reviews and knowledge-sharing sessions, fostering a culture of collaboration and high-quality standards.\n• Developed automated testing strategies, utilizing Jest and Cypress, which improved code coverage by **30%** across projects.\n• Engaged in complex problem-solving scenarios to troubleshoot and enhance functionality, resulting in a **25%** reduction in bug reports.\n• Successfully optimized existing codebases, leading to a **40%** improvement in application load times and overall user satisfaction."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React** (18), **TypeScript**, and **Next.js** to build interactive front-end applications, creating sleek, responsive interfaces for financial tools and admin panels, enhancing user engagement.\nEmployed **Python** for developing robust server-side logic and integrations, enhancing overall application performance and reliability.\nDesigned and implemented RESTful APIs and **GraphQL** services to support dynamic data requests, improving data retrieval efficiency by **20%**.\nImplemented **Continuous Integration/Continuous Deployment (CI/CD)** practices using **GitHub Actions**, ensuring rapid iteration and deployment with **99%** success rate.\nApplied collaborative skills to work with cross-functional teams, driving continuous improvement initiatives and addressing challenges through effective problem-solving.\nEngaged in debugging processes to identify issues, leading to a reduction in bugs by **30%** across multiple applications.\nEnhanced overall system architecture by integrating **AWS** services, ensuring scalable and reliable hosting for applications with minimal downtime.\nActively contributed to team collaboration efforts, fostering a culture of knowledge sharing and agile methodologies for project success.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **React (18)** and **Next.js** to develop high-performance, SEO-friendly e-commerce applications, applying **TypeScript** for type safety and improved code reliability across different platforms.\nImplemented CI/CD pipelines using **GitHub Actions** to streamline deployment processes, ensuring rapid integration and delivery of features while promoting continuous improvement.\nEngineered RESTful and GraphQL APIs with **Python** frameworks like Django and FastAPI, optimizing backend services for scalability and performance in a global e-commerce environment.\nCollaborated with cross-functional teams to troubleshoot and debug complex issues, enhancing application functionality and user experience through strong problem-solving skills.\nDesigned visually appealing user interfaces using **SCSS**, ensuring mobile-first engagement and compliance with accessibility standards (WCAG 2.1).\nEmployed AWS cloud services to host and manage application infrastructure, ensuring reliability and high availability under peak traffic conditions.\nRegularly applied best practices in debugging and optimization, increasing system efficiency by **30%** through targeted performance improvements.\nMaintained documentation and participated in code reviews to foster team collaboration and uphold coding standards, contributing to a culture of continuous learning.\nLed initiatives for continuous improvement in development processes, resulting in a decrease in deployment time by **25%** over **6 months**."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Frontend Frameworks:**\n\tReact, TypeScript, Next.js, SCSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tREST, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3,\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, collaboration, debugging, problem-solving, continuous improvement, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Terraform, Ansible, Helm, Docker Compose"
}