{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior GTM Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior GTM Engineer with 8 years of experience in leveraging technology for process improvement and data-driven decision-making. Proficient in **APIs**, **Python**, **JavaScript**, and **SQL**, enabling seamless integration with platforms such as **Salesforce**, **HubSpot**, and **Clay**. Adept at utilizing data analytics tools to drive strategic initiatives that enhance sales and marketing efficiency.\nSpecializing in high-performance solution development, I bring a solid foundation in full-stack technologies including **React**, **Next.js**, and **Node.js**, and have successfully led the deployment of enterprise-grade applications. My hands-on background in modern frameworks empowers me to solve complex problems while aligning with industry standards. Additionally, I have contributed to enterprise platforms through intelligent automation and predictive analytics, ensuring compliance with regulations like HIPAA and PCI DSS. A proactive problem-solver, I am committed to leveraging advanced tech stacks to enhance programmatic GTM strategies.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior GTM Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **APIs** to integrate various marketing tools such as **Salesforce**, **HubSpot**, and **Clay**, enhancing the data-driven decision-making process for GTM strategies.\nDeveloped data pipelines using **Python** and **SQL**, ensuring high-quality data ingestion and processing to support GTM initiatives and performance metrics.\nLeveraged **JavaScript** frameworks to create interactive dashboards and data visualizations that provide actionable insights into sales and marketing performance, improving overall process efficiency by **25%**.\nImplemented a successful GTM strategy through effective use of automation tools like **Lemlist** and **Instantly**, resulting in a **40%** increase in lead conversion rates over a **6-month** period.\nExecuted problem-solving methodologies to identify and rectify bottlenecks in sales processes, contributing to a **20%** reduction in cycle times.\nEngaged in cross-functional collaboration with marketing, sales, and product teams to refine GTM processes, ensuring alignment with organizational goals and improving stakeholder satisfaction by **30%**.\nConducted regular training sessions on **data-driven** methodologies for new hires, fostering a culture of continuous improvement and innovation within the GTM team.\nMaintained a robust understanding of customer relationship management tools like **Common Room**, enhancing customer segmentation strategies and fostering long-term relationships.\nGenerated comprehensive reports on GTM initiatives leveraging **analytics** tools, presenting findings to executive leadership for data-driven strategic decision-making.\nContinuously improved processes by utilizing insights from past performance data and market research, which led to the introduction of new targeting strategies and a **15%** growth in market share."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **APIs** to integrate and enhance customer relationship management systems like **Salesforce**, **HubSpot**, and **Clay**, leading to a **20%** increase in lead conversion rates.\nDeveloped data-driven solutions using **Python** and **JavaScript**, leveraging **SQL** databases to analyze sales and marketing performance, achieving a **15%** improvement in campaign effectiveness.\nImplemented process improvement strategies that reduced overhead costs by **25%** while increasing the efficiency of GTM operations through automation and advanced analytical tools.\nCreated visualizations and dashboards using data tools like **Common Room** and **Lemlist** to track customer engagement and sales metrics, improving insights for decision-making by **30%**.\nEmployed problem-solving skills to troubleshoot and enhance existing technology stacks, leading to a more agile and responsive GTM strategy that aligned with rapidly changing market conditions.\nAutomated workflows and communication processes with **Instantly**, streamlining the lead nurturing process and improving outreach efficiency by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **APIs** and **data-driven** strategies to optimize customer engagement through platforms like **Salesforce**, **HubSpot**, and **Clay**, resulting in a **25%** increase in user acquisition through targeted marketing campaigns.\nImplemented process improvement initiatives using **Python** and **JavaScript** to enhance data flow and integration across various systems, achieving a reduction in processing times by **30%**.\nDeveloped and maintained systems that interact with **GTM** (Google Tag Manager) for effective tracking of user interactions, improving data accuracy and reporting capability.\nUtilized **SQL** for querying and analyzing customer data, facilitating informed decision-making processes,\nBuilt automated workflows utilizing **Instantly** and **Lemlist**, reaching out to **10,000+** potential leads and improving response rates by **15%**.\nEngaged in problem-solving to address integration challenges between various platforms, streamlining operations and enhancing overall system reliability.\nCollaborated cross-functionally with marketing and sales teams to ensure alignment and effective execution of go-to-market strategies, which resulted in a **20%** increase in revenue within the first quarter.\nConducted training sessions and provided guidance on using tools like **Common Room** for improved team collaboration and visibility into customer journeys, boosting team productivity by **40%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, SQL\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tGTM, Salesforce, HubSpot, Clay, Common Room, Lemlist, Instantly, data-driven, problem-solving, process improvement, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Weflow"
}