{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior System Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior System Engineer with 13+ years of experience in DevOps and Infrastructure as Code, proficient in managing Linux environments and utilizing tools like **Ansible** for automation. Skilled in developing and maintaining cloud architectures on **GCP**, ensuring compliance and security protocols are upheld. Expertise in implementing **CI/CD** pipelines to streamline development workflows and enhance operational efficiency. Strong programming skills in **Python** and experience with systems programming in **Go**.\n\nDemonstrated ability to deploy high-performance applications across various sectors, including healthcare and finance. Adept at integrating predictive analytics and AI/ML capabilities within applications, leveraging tools such as **FastAPI**, **Django**, and data orchestration frameworks like **Airflow**. Extensive experience adhering to compliance standards (HIPAA, FHIR, PCI DSS, SOC 2) and a solid background in MLOps with tools like **MLflow** and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior System Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- **DevOps:** Designed and implemented CI/CD pipelines using **Ansible** and **GCP** for automated deployment and infrastructure management, ensuring efficient and reliable software delivery across environments.\n- **Infrastructure as Code:** Managed infrastructure efficiently with **Terraform** and **Ansible**, promoting repeatability and version control in the deployment process.\n- **Linux Administration:** Leveraged **Linux** expertise to optimize server performance and security, leading to a **40%** reduction in downtime.\n- **Networking:** Configured and managed network protocols such as **TCP/IP** and **HTTP**, contributing to seamless application connectivity and data transmission.\n- Developed robust backend services utilizing **Python** and **Go**, implementing **RESTful APIs** to streamline data processing and application interaction.\n- Automated system configurations and application deployments using **CI/CD** tools, adhering to best practices for **DevOps** workflows and promoting collaboration across development teams.\n- Collaborated in cross-functional teams to troubleshoot and resolve issues across application layers, contributing to an average resolution time reduction of **30%**.\n- Implemented monitoring and logging solutions using tools such as **Prometheus** and **Grafana**, enhancing visibility into system performance and reliability.\n- Provided training and knowledge transfer sessions on best practices in Linux system management and network administration to team members.\n- Conducted regular audits and assessments to ensure compliance with industry standards and best practices in system security and configuration management."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Implemented **Infrastructure as Code** principles using tools such as **Ansible** to automate server provisioning and configuration management, enhancing operational efficiency by **30%**.\n- Developed and maintained CI/CD pipelines to streamline software deployment processes, reducing deployment time by **40%** through automation and continuous integration techniques.\n- Monitored and managed system performance on **Linux** servers, ensuring high availability and reliability for critical applications serving over **10,000** concurrent users.\n- Executed networking protocols including **TCP/IP** and **HTTP** to optimize performance and connectivity across distributed systems, aiding in seamless communication between services.\n- Contributed to a collaborative **DevOps** culture that emphasized quality assurance and agile methodologies, leading to improved team delivery speed by **25%**.\n- Employed **Python** for scripting and automation tasks, reducing manual effort on repetitive tasks and elevating team productivity.\n- Assisted in cloud operations using **GCP** for scalable infrastructure deployments, improving disaster recovery procedures by implementing robust backup strategies.\n- Conducted research and gap analysis to improve system security protocols, leading to a **15%** reduction in potential vulnerabilities via proactive monitoring.\n- Supported troubleshooting and resolution efforts for DNS-related issues, enhancing domain resolution times by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Linux** and **GCP** to manage and optimize cloud infrastructure for enhancing system performance and reliability for a global e-commerce platform.\nImplemented **Infrastructure as Code** principles using **Ansible** to automate deployment processes, achieving a 40% reduction in manual error and increasing deployment speed by **25%**.\nDesigned and maintained CI/CD pipelines to streamline the software development lifecycle, improving operational efficiency by **30%**, and ensuring rapid deployment of updates without service interruptions.\nConfigured and monitored network protocols such as **TCP/IP** and **HTTP** to facilitate efficient data transfer and system communication across various services.\nDeveloped backend services using **Python** and **Node.js**, ensuring high availability, low latency, and scalability in system architecture for critical applications.\nUtilized best practices in **DevOps** to enhance the collaboration between development and operations teams, resulting in a 50% faster feature delivery rate.\nConducted regular system audits and performance tuning, positively impacting response times with metrics improving by up to **20%** across applications.\nEngaged in security hardening practices with **RBAC** and **OAuth 2.0** to ensure data protection and compliance for customer and admin access, enhancing overall security posture.\nFacilitated cross-functional team collaborations for implementation plans that align system upgrades with business objectives, leading to improved resource allocation and project management efficiency."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, Go, PHP\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tHTTP, OAuth2, JWT\n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, Azure: App Services\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Ansible, Terraform, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, GCP, DNS, Linux, TCP/IP, RHCSA, RHCE\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Infrastructure as Code, CI/CD",
  "apply_company": "Hostinger"
}