{
  "name": "Rei Taro",
  "role_name": "Senior Go Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Go Engineer with over 10 years of experience in developing robust backend systems, specializing in **Golang**, **Kubernetes**, and **Distributed Systems**. Proven expertise in API development, including **REST APIs**, and microservices architecture, delivering scalable solutions that enhance system performance. Skilled in **Continuous Integration** and **Version Control**, with a passion for leveraging **Open Source** technologies and fostering collaboration within development teams. Strong background in designing and implementing innovative solutions, with a commitment to excellence demonstrated through successful projects at industry leaders such as VISA, Sii Poland, and Reply Polska. Proficient in cloud platforms including **AWS** and **Azure**, and adept at integrating AI/ML pipelines in backend environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Go Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered microservices in **Golang** to enhance system scalability and performance for distributed systems.\nDeveloped and integrated **REST APIs** to facilitate seamless communication between various services and ensure efficient API development.\nImplemented **Kubernetes** for container orchestration, managing deployment and scaling of applications with **99.99% uptime** reporting.\nAutomated CI/CD pipelines to ensure continuous integration and delivery, reducing deployment times by **30%**.\nUtilized version control systems to maintain code quality and enable collaborative development within cross-functional teams, ensuring compliance with open-source standards.\nCollaborated with teams to design and implement distributed systems architecture, significantly improving application reliability and speed by **25%**.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "● Designed and developed microservices architecture using **Golang** for robust API development and efficient data processing.\n● Implemented distributed systems strategies to enhance scalability and reliability of applications, ensuring 99.9% uptime.\n● Created REST APIs for seamless integration with other services and **Kubernetes** orchestration for container management.\n● Ensured continuous integration and deployment pipelines with a focus on version control systems, achieving a lead time for changes of less than 1 week.\n● Managed deployment processes within **Kubernetes** leveraging cloud-native solutions to enhance system reliability and performance.\n● Spearheaded the adoption of the **Model Context Protocol** to standardize data exchange across various microservices.\n● Collaborated with open-source communities to innovate and integrate new features, leading to a 30% increase in code contribution and collaboration effectiveness.\n● Conducted code reviews and team brainstorming sessions to foster a culture of collaboration and continuous improvement within the engineering team."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed and implemented **Microservices** architecture for trading applications, utilizing **Golang** to enhance backend scalability and efficiency.\nCollaborated with cross-functional teams to design robust **API Development** strategies, integrating **REST APIs** for seamless data exchange between services.\nImplemented **Distributed Systems** solutions, utilizing **Kubernetes** to orchestrate containerized applications for improved deployment processes, managing **3** separate microservices.\nLed the integration of Continuous Integration (CI) practices, ensuring code quality through version control systems, specifically with **Git**, promoting a reliable development pipeline.\nEnsured high-level collaboration across teams to maintain alignment with project goals, improving team efficiency by **15%** in delivery times.\nContributed to open-source projects, enhancing community engagement and sharing best practices in coding and architecture.\nDeveloped effective test strategies within CI/CD pipelines, maintaining a code coverage of over **85%** using automated testing frameworks.\nUtilized **Kubernetes** and **Go** to streamline deployment processes, reducing deployment times by over **30%**."
    }
  ],
  "skills": " **Programming Languages** \n\t Golang, Python (3.8+), SQL, Bash, JavaScript \n\n **Backend Frameworks** \n\t FastAPI, Flask, Django, Celery \n\n **API Technologies** \n\t REST APIs, REST/gRPC APIs, API Development \n\n **Serverless and Cloud Functions** \n\t AWS (EC2, S3, Lambda), Azure \n\n **Databases** \n\t PostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps** \n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, Continuous Integration, Version Control \n\n **Cloud & Infrastructure** \n\t AWS (EC2, S3, Lambda), Azure \n\n **Other** \n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Distributed Systems, Open Source, Collaboration, CI/CD, PyTest, Git, Kafka ",
  "apply_company": "Stacklok"
}