{
  "name": "Marcin Karol Kotlinski",
  "role_name": "PHP Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a skilled PHP Developer with 8 years of experience, I focus on developing high-performance web applications and backend services, utilizing **PHP** for efficient API integration. My technical expertise includes cloud service deployment and management, with a solid foundation in **DevOps** practices to ensure seamless workflows and optimized performance. I thrive in **agile** environments, collaborating effectively with cross-functional teams to deliver solutions that meet business objectives.\nAdditionally, I bring strengths in building microservices architectures and applying CI/CD methodologies to enhance the software development lifecycle. I have successfully delivered enterprise-grade platforms with a focus on compliance standards and robust application security.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "PHP Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust **web applications** using **PHP**, ensuring seamless **API integration** for smooth data exchange.\n- Collaborated closely with cross-functional teams to enhance **backend services**, focusing on scalability and performance.\n- Implemented CI/CD practices to streamline **DevOps** processes, reducing deployment time by **30%** through automation and continuous integration techniques.\n- Designed and developed RESTful APIs to support mobile and web interfaces, facilitating efficient data handling and client-server communication.\n- Utilized **collaboration** tools such as Git and JIRA to manage project workflows and maintain high levels of transparency in **agile** environments.\n- Engaged in code reviews and pair programming to ensure code quality and foster a culture of continuous learning and improvement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and integrated robust **API** solutions for web applications using **PHP**, enhancing interconnectivity and data exchange efficiency between backend services and client-side frameworks.\nCollaborated in an **Agile** environment with cross-functional teams to deliver high-quality financial web applications, ensuring timely completion of projects and adherence to best practices.\nImplemented best practices for **DevOps**, automating deployment workflows and improving application reliability and performance.\nContributed to the user experience of financial applications by integrating backend logic with dynamic front-end components, ensuring seamless interactions across platforms.\nCreated and maintained documentation for **API integrations** and backend services, facilitating effective collaboration and knowledge sharing among team members.\nEnhanced application capabilities by leveraging existing financial platforms and ensuring compatibility through successful integration of various third-party services, demonstrating a strong background in web application development.\nUtilized strong problem-solving skills to troubleshoot and optimize code, contributing to a **30%** reduction in response times and improving overall system performance.\nAchieved a **99.9%** uptime for deployed applications through effective use of monitoring tools and proactive maintenance practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed robust **PHP** backend services and web applications, ensuring smooth operation and integration of APIs for diverse functionalities within the e-commerce platform.\nLeveraged **API integration** techniques to connect various services, enhancing functionality and user experience across the application by seamlessly interfacing with both internal and third-party APIs.\nCollaborated with cross-functional teams in an **agile** environment to deliver high-quality applications, demonstrating strong communication and teamwork skills while aligning project goals and timelines.\nImplemented **DevOps** best practices to automate deployment processes, resulting in a **30%** reduction in deployment time and improved release cycles.\nOptimized application performance through effective collaboration, addressing issues with a resolution time improved by **25%**, and enhancing overall user satisfaction.\nIntegrated efficient backend services using technologies like **Laravel**, ensuring quick and reliable access to e-commerce functionalities.\nDesigned and maintained user-friendly web applications, focusing on responsive design and performance optimization, leading to a **40%** increase in engagement metrics post-launch.\nParticipated in regular code reviews and team meetings, contributing to a shared pool of knowledge and fostering a collaborative development culture.\nUtilized modern PHP frameworks to streamline the development process, achieving consistent and maintainable codebases for long-term project scalability."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, PHP, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI integration\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, collaboration, agile, web applications, backend services"
}