{
  "name": "Rei Taro",
  "role_name": "Senior Security Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Security Engineer with over 10 years of experience in backend system design and delivery, focusing on cloud-native architectures and security best practices. Proficient in leveraging **AWS**, **Kubernetes**, **Docker**, **Ansible**, **Terraform**, and other technologies for robust infrastructure management and application deployment. Skilled in troubleshooting, collaboration, and communication within cross-functional teams. Proven track record of execution in fast-paced environments, enhancing security measures and system integrity for top-tier organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Implemented secure infrastructure solutions using **Terraform** and **Ansible** on **Linux** environments to enhance security posture and operational efficiency.\n• Designed and deployed scalable authentication systems leveraging **Active Directory**, **SSO**, and **PKI** to ensure robust identity management.\n• Automated deployment processes with **Docker** and **Kubernetes**, achieving a reduction in deployment time by **30%**.\n• Utilized **GitLab** for version control and collaboration, improving code quality and team productivity, resulting in **40%** quicker issue resolution.\n• Configured **NGINX** as a reverse proxy to enhance application security and performance, improving system response times by **20%**.\n• Engaged in troubleshooting and incident response for security vulnerabilities across multiple platforms and services.\n• Collaborated with diverse teams to drive security initiatives and foster communication, ensuring alignment on best practices and policies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Terraform** for infrastructure automation, ensuring scalable and consistent environments for microservices deployment on **Azure App Services**.\nImplemented **NGINX** for efficient traffic routing and improved performance of backend systems, enhancing user experience by up to **30%**.\nLeveraged **Ansible** for automated configuration management and deployment, reducing deployment time by **25%** while maintaining system integrity.\nConducted security audits and integrated **OAuth2** and **Azure AD B2C** for robust access controls and authentication mechanisms, improving compliance with industry standards by **40%**.\nEmployed **Kubernetes** and **Docker** for container orchestration, facilitating smoother deployment and scalability of applications.\nCollaborated effectively with cross-functional teams to ensure thorough system integration and regulatory compliance, enhancing communication efficiency by **50%**.\nDrove troubleshooting efforts to resolve system issues in a timely fashion, using a **Linux-based** environment to maintain operational excellence."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Ensured effective **Linux** server configurations to maintain secure environments for backend applications managing trade execution and account tracking.\nCollaborated on identity management solutions including **Active Directory**, **SSO**, and **PKI**, enhancing user security and access protocols across platforms.\nDeployed and maintained **Docker** containers and **Kubernetes** orchestration for scalable backend services, reducing deployment times by **30%**.\nUtilized **Ansible** and **Terraform** for automation of infrastructure provisioning, achieving a deployment error rate reduction of **15%**.\nMonitored and optimized **NGINX** web server configurations to ensure performant and secure access to REST APIs and WebSocket channels.\nImplemented robust CI/CD pipelines using **GitLab**, facilitating seamless integration and delivery for improved operational efficiency.\nLeveraged **AWS** cloud services to enhance infrastructure resilience and compliance with regulatory requirements such as MiFID II and GDPR.\nParticipated in cross-functional teams to bolster communication and collaboration, addressing security vulnerabilities proactively, leading to a **25%** improvement in response times."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda)\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, Ansible, Terraform\n\n**Cloud & Infrastructure**\n\tAWS, Azure, VMware, NGINX, NetApp\n\n**Other**\n\tLinux, Active Directory, SSO, PKI, Troubleshooting, Collaboration, Communication, CI/CD, PyTest, Git, Kafka",
  "apply_company": "SolarEdge"
}