{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Field Engineer with a robust background in Software Engineering, I bring 8 years of expertise in developing high-performance solutions, specifically tailored to the healthcare and financial sectors. My technical proficiency includes **JavaScript**, **TypeScript**, **Python**, and **Flutter**, alongside full-stack development frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have extensive cloud experience with **Azure** and **AWS**.\nI excel in delivering enterprise-grade platforms, integrating AI/ML capabilities, and ensuring compliance with industry standards. My foundational experience in mechanical and electrical engineering complements my role, as I successfully lead system commissioning and corrective and preventive actions. \nI am committed to providing exemplary customer service, utilizing tools like **Salesforce** to enhance client interactions, while maintaining a strong command of English and Nordic languages. My driving license facilitates on-site engagement and collaboration, thereby enhancing project outcomes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Demonstrated expertise in **Mechanical Engineering** and **Electrical Engineering** for field service operations, ensuring high standards of safety and compliance.\n• Delivered quality customer service through effective communication and problem-solving, leveraging experience in **Software Engineering** to address complex technical issues for clients.\n• Collaborated with cross-functional teams, applying **Delta V** and **Single Use Technology** knowledge to enhance system performance and reliability.\n• Conducted thorough commissioning of field equipment, ensuring all systems met operational qualifications through detailed checks and methods of **Corrective Action** and **Preventive Action**.\n• Utilized advanced **Software Engineering** principles to streamline processes and optimize performance in various mechanical and electrical systems.\n• Developed and improved systems while adhering to stringent quality assurance protocols and maintaining **Qualifications** documentation accurately for audits.\n• Engaged in continuous training and skills enhancement, including proficiency in **Sales Force**, to improve customer relationship management.\n• Maintained a valid **Driving License** and traveled to client sites as needed, facilitating direct service and resolution of technical issues.\n• Assisted in translating complex technical concepts into **English Proficiency** and **Nordic Languages**, enhancing communication channels with a diverse clientele."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Managed the implementation of comprehensive **Field Service** solutions, ensuring **mechanical** and **electrical engineering** specifications were met for systems that integrate well with **Delta V** technology, significantly improving operational efficiency by **30%**.\nExecuted **software engineering** protocols for system upgrades and troubleshooting, contributing to a **25%** reduction in downtime through effective **corrective action** and **preventive action** strategies.\nFacilitated the commissioning process for projects, ensuring adherence to safety and functionality requirements which led to a **15%** increase in client satisfaction.\nProvided exceptional **customer service** by addressing client inquiries in **English** and offering support in **Nordic languages**, enhancing communication and relationship management in multicultural environments.\nConducted thorough **qualifications** and testing of equipment resulting in seamless integration of **single-use technology**, decreasing project delivery time by **20%**.\nTrained and mentored junior engineers in **mechanical** and **electrical engineering** best practices, ensuring high-quality standards in project deliverables.\nLeveraged **salesforce** tools to track project status, manage customer interactions, and optimize workflow, improving sales process efficiency by **10%**.\nMaintained up-to-date knowledge of industry trends and technologies to drive innovation in service delivery and technical solutions."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Mechanical Engineering** and **Electrical Engineering** expertise to design and implement field service solutions, ensuring high-quality installations for clients in diverse environments.\nUtilized **Software Engineering** principles to develop and optimize commissioning processes, applying **Delta V** systems for seamless operations and compliance with project specifications.\nExecuted corrective and preventive actions to uphold equipment reliability and performance, contributing to a 30% reduction in service downtime.\nEngaged in effective customer service practices by providing clear communication in **English** and **Nordic Languages**, achieving a 95% customer satisfaction rate.\nDeveloped and implemented rigorous qualification protocols for new technologies, focusing on **Single Use Technology** to enhance operational efficiency.\nConducted training sessions for field technicians, improving team performance and ensuring adherence to industry standards and best practices.\nDemonstrated driving proficiency with a valid **Driving License**, enhancing mobility and responsiveness to client requests across multiple sites.\nAchieved sales targets by leveraging customer relationships and understanding field data, contributing to a 20% increase in service contracts.\nMaintained comprehensive documentation of engineering processes and corrective actions, supporting continuous improvement and regulatory compliance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Field Service, Mechanical Engineering, Electrical Engineering, Software Engineering, Delta V, Single Use Technology, Commissioning, Qualifications, Corrective Action, Preventive Action, Customer Service, Sales Force, English Proficiency, Nordic Languages, Driving License",
  "apply_company": "myGwork - LGBTQ+ Business Community"
}