{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience designing and developing high-performance web applications, primarily utilizing **React**, **HTML**, **CSS**, and **JavaScript**. Proficient in modern frontend development frameworks and tools, ensuring exceptional user experiences aligned with Agile methodologies. Strong background in Object-Oriented Programming (OOP) principles to create maintainable and scalable code.\nDemonstrated ability to collaborate effectively with cross-functional teams, translating design assets from **Figma** into responsive and interactive user interfaces. Possesses a robust skill set in full stack development, with hands-on experience in **Python**, **Flutter**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in integrating cloud services and implementing CI/CD pipelines, contributing to efficient delivery processes. Committed to maintaining compliance with industry standards to ensure secure and reliable applications.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed interactive user interfaces utilizing **React (17–18)**, **JavaScript**, **HTML**, and **CSS** to create seamless user experiences in healthcare and fintech applications.\nEmployed **Agile** methodologies to drive iterative development and continuous improvement, ensuring timely delivery of high-quality features.\nCollaborated with design teams using **Figma** to transition design prototypes into functional front-end applications, enhancing user engagement and satisfaction.\nImplemented Object-Oriented Programming (**OOP**) principles to create modular and maintainable code, adhering to best practices in software development.\nOptimized web applications for maximum performance and scalability, reducing load times by over **30%** and increasing user retention.\nIntegrated third-party services and APIs, ensuring responsiveness and seamless data flow between the front end and backend systems.\nConducted thorough testing using **Jest** and **Cypress**, achieving over **90%** code coverage to ensure application reliability and performance.\nMentored junior developers on best practices in front-end development, fostering a collaborative and innovative team environment.\nParticipated in regular sprint reviews and stand-ups to communicate progress and blockers, ensuring alignment with project goals and objectives."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed interactive front-end applications using **React (18)**, ensuring responsive and user-friendly interfaces through modern practices in **HTML**, **CSS**, and **JavaScript**.\nCollaborated in an **Agile** team environment, leveraging **OOP** principles to enhance code quality and maintainability, resulting in a **30%** reduction in bugs through iterative improvements.\nUtilized design tools like **Figma** to create visually appealing layouts and prototypes, which improved client feedback scores by **25%**.\nEmployed **Redux Toolkit** and **Tailwind CSS** for efficient state management and scalable UI design, optimizing load times by **15%**.\nParticipated in code reviews and mentorship activities to elevate team proficiency in **React** and modern web development standards.\nExecuted best practices in front-end development, ensuring cross-browser compatibility and performance optimization across various devices."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **React (18)** and **JavaScript** to develop high-performance, responsive web applications for a global e-commerce platform, significantly enhancing user engagement and satisfaction.\nDesigned and maintained visually appealing, **SEO-friendly** user interfaces using **HTML5/CSS3** and integrated with **Figma** for design collaboration, boosting conversion rates by **30%**.\nImplemented Object-Oriented Programming (**OOP**) principles in frontend development, promoting code reusability and modular architecture within the application.\nCollaborated in an **Agile** environment to ensure timely delivery of feature enhancements, leading to a **25%** improvement in project delivery timelines.\nIntegrated dynamic design elements to adapt to user interactions, improving the overall user experience and reducing bounce rates by **15%**.\nParticipated in regular code reviews and design discussions, fostering a culture of continuous learning and improvement within the development team.\nEnhanced application performance by optimizing frontend assets, resulting in a **40%** reduction in load times and improved search engine rankings.\nContributed to cross-functional teams, ensuring seamless integration of frontend components with backend systems and services, leveraged through knowledge of RESTful APIs."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, Python\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Figma, OOP, Agile",
  "apply_company": "SOFTSWISS"
}