{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Modern C++ Software Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Modern C++ Software Developer with over 13 years of comprehensive experience in delivering high-performance applications, particularly within regulated industries like healthcare and finance. Proficient in **C++ 20**, incorporating **Boost.Asio** for networking, and emphasizing **unit testing**, **asynchronous programming**, and **object-oriented principles** to produce robust software solutions. Skilled in **design patterns** and **UML design** for effective application architecture. Proven ability to integrate with financial protocols like **FIX protocol** and utilize APIs such as **MetaTrader API**. Experienced in problem-solving and profiling to enhance application performance.\nAdditionally, I possess a strong foundation in **JavaScript/TypeScript**, **Python**, and **Flutter**, with extensive hands-on expertise in both frontend and backend frameworks including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Environmental experience includes developing AI/ML-driven platforms, deploying on **AWS** and **Azure**, and implementing microservices and CI/CD pipelines. Communicative and approachable, I excel in a team-oriented environment, ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. A proactive self-starter with strong interpersonal skills, I aim to drive project success while maintaining professional English proficiency.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Modern C++ Software Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **C++ 20** features to develop efficient software solutions, enhancing performance and maintainability.\nUtilized **Boost.Asio** to design and deploy high-performance asynchronous systems, ensuring non-blocking operations for improved scalability.\nConducted comprehensive **unit testing** across modules with modern libraries to guarantee software reliability and performance metrics.\nApplied **object-oriented principles** and **design patterns** to create modular systems that adhere to best practices for reusability and maintenance.\nCreated UML diagrams to effectively communicate system architecture and design to stakeholders, facilitating collaboration and understanding.\nInterfaced with financial protocols using **FIX protocol** and **MetaTrader API** to provide robust trading solutions capable of handling high-frequency transactions.\nEmployed profiling techniques to identify performance bottlenecks, ensuring optimized execution for both computation and memory usage.\nDemonstrated strong **problem-solving** capabilities by addressing technical challenges through innovative solutions and strategic approaches.\nFostered effective **communication skills** within the development team, promoting a collaborative environment for software development.\nDeveloped team dynamics through solid **interpersonal skills**, engaging stakeholders and cross-functional teams to drive project success.\nExhibited a **self-starter attitude**, proactively identifying opportunities for improvement in existing codebases and processes.\nMaintained proficiency in **English**, ensuring clear articulation of complex technical concepts in both written and verbal communication."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **C++ 20** proficiency to develop high-performance, asynchronous systems, incorporating **Boost.Asio** for robust network communication and exceptional response times in financial applications.\nEmployed object-oriented principles and design patterns to create modular and maintainable code, ensuring adherence to project specifications and **UML design** standards for clear documentation.\nConducted comprehensive unit testing to guarantee software quality and performance, demonstrating excellent problem-solving skills and attention to detail, vital for minimizing bugs in production environments.\nCollaborated effectively with cross-functional teams, exhibiting strong communication and interpersonal skills to facilitate knowledge sharing and project updates.\nIntegrated **FIX protocol** and **MetaTrader API** to enhance trading functionalities, optimizing real-time data exchange between systems and enhancing the trading experience.\nExecuted performance profiling on critical components, identifying bottlenecks and implementing solutions to improve system efficiency by **30%**.\nInitiated self-starter projects that leveraged **asynchronous programming** techniques, significantly reducing latency in high-frequency transaction processing.\nDemonstrated **English proficiency** in all technical documentation and presentations, ensuring clarity and understanding among diverse stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C++ 20** and **Boost.Asio** to develop robust server-side components for high-performance applications, ensuring adherence to **object-oriented principles** and effective **design patterns** throughout code implementation.\nEmployed **unit testing** frameworks to ensure code reliability and maintainability, achieving a **95% code coverage** rate across all components.\nImplemented **asynchronous programming** techniques to enhance application responsiveness, achieving a **30% reduction** in processing time for high-volume transaction scenarios.\nDesigned system architectures using **UML design** methodologies to improve collaborative efforts and facilitate clear communication among team members, thereby enhancing overall project delivery timelines.\nIntegrated the **FIX protocol** and **MetaTrader API** for seamless financial data exchange, ensuring system stability while handling up to **10,000 messages per second** without performance degradation.\nImplemented profiling tools to analyze application performance metrics, successfully identifying and rectifying bottlenecks that improved execution time by **40%**.\nDemonstrated strong **problem-solving** skills to troubleshoot and resolve software issues, enhancing system functionality and user experience.\nFostered a collaborative environment through effective **communication skills** and **interpersonal skills**, aiding in cross-functional teamwork across design and implementation phases.\nExhibited a **self-starter attitude**, consistently seeking to improve processes and proactively addressing potential project risks in evolving development environments.\nMaintained high levels of **English proficiency** for clear documentation and team presentations, contributing to overall project transparency and knowledge sharing."
    }
  ],
  "skills": "**Programming Languages:**\n\tC++ 20, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tMetaTrader API, FIX protocol\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, unit testing, asynchronous programming, object-oriented principles, design patterns, UML design, profiling, problem-solving, communication skills, interpersonal skills, self-starter attitude, English proficiency"
}