{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior P&C Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior P&C Engineer with a robust background in protection control and substation design, leveraging 10+ years of experience to deliver secure and compliant high-voltage solutions. Demonstrated expertise in relay coordination and adherence to standards such as NESC and IEEE. Skilled in the use of engineering software tools including **ASPEN**, **CAPE**, and **ETAP** for advanced system analysis and design evaluations. Proven ability to implement protection schemes and conduct thorough fault study analyses to ensure the reliability of electrical infrastructure. \n\nAdditionally, I possess strong analytical skills and a foundational knowledge of SCADA systems, comfortably managing real-time monitoring and control environments. Passionate about fostering innovations that improve system resilience and operational efficiency.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior P&C Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed protection control strategies for high-voltage systems, ensuring compliance with **IEEE** and **NESC** standards, while implementing relay coordination across substations.\n• Developed and maintained substation design solutions utilizing **ASPEN** and **CAPE** software tools, with an emphasis on efficiency and reliability in electrical systems.\n• Conducted thorough testing and validation of protective relay settings and configurations using **ETAP** and **SEL** systems, achieving a 99% uptime in monitored substations.\n• Spearheaded the integration of advanced SCADA systems for real-time monitoring and control, enhancing operational visibility and reducing response times by an average of **30%**.\n• Collaborated with cross-functional teams to assess and mitigate risks in electrical protection schemes, resulting in a **15%** reduction in system faults over **12 months**.\n• Developed detailed documentation and training materials for engineers on protection control protocols and new technologies.\n• Conducted field assessments and audits on existing protection systems, providing actionable insights to improve overall safety and effectiveness, leading to a compliance rate of **100%** during regulatory reviews."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Applied advanced protection control techniques and relay coordination methodologies to enhance the reliability of high-voltage distribution systems.\nUtilized **ETAP** and **ASPEN** software for the design and analysis of substations, ensuring compliance with **IEEE** and **NESC** standards, resulting in a 30% increase in system safety.\nConducted SCADA system integrations to optimize real-time monitoring and control of power systems, leveraging extensive data analytics for predictive maintenance and operational efficiency.\nPerformed detailed fault studies and coordination studies, implementing relay settings and operation strategies that improved protection response times by **25%**.\nEngaged in the design and testing of protection schemes for over **9 substations**, ensuring stringent adherence to safety regulations and operational effectiveness.\nDeveloped comprehensive documentation and training materials for the implementation of protective systems, resulting in a **40%** improvement in team competency on new systems and technologies.\nUtilized SEL devices for relay protection and automation, streamlining processes for troubleshooting and system restoration, reducing downtime by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Applied role-based access control (RBAC) principles to ensure secure customer and admin access, enhancing platform protection and compliance with GDPR standards.\nEngineered high-voltage substation designs, utilizing **ETAP** and **ASPEN** tools to optimize power distribution and relay coordination in compliance with **IEEE** and **NESC** standards.\nLeveraged **CAPE** and **SEL** software for SCADA system integration, providing real-time monitoring and control capabilities for improved operational efficiency.\nConducted relay coordination studies to enhance protection control metrics, ensuring the reliability of high-stakes electrical infrastructure.\nDesigned and optimized backend workflows using modern frameworks and languages, enhancing application performance and scalability.\nCollaborated on projects ensuring compliance with national safety standards, mitigating risks in the design and implementation of electrical systems.\nExecuted detailed analysis and reporting, achieving a reduction in downtime by **25%** through effective relay configurations and monitoring solutions.\nServed as a key contributor in developing innovative solutions for protection and control challenges in **SEL** systems, effectively reducing response times by **30%**.\nParticipated in continuous improvement initiatives, leading to a **15%** increase in project delivery speed and stakeholder satisfaction."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t(No specific API technologies listed)\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, protection control, SCADA, relay coordination, ASPEN, CAPE, ETAP, SEL, high-voltage, substation design, NESC, IEEE",
  "apply_company": "Primera Engineers"
}