{
  "name": "Rei Taro",
  "role_name": "Senior Network Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Network Engineer with over 10 years of experience in network design and implementation, specializing in **Cisco**, **HPE Aruba**, **Dell EMC**, and **Extreme Networks** technologies. Proficient in managing complex LAN and WLAN infrastructures, ensuring network automation, virtualization, and security. Demonstrated success in project management and delivering superior customer service, with a strong emphasis on team collaboration and effective communication. Multilingual with proficiency in German (C1) and English (B2), complemented by a proactive approach to problem-solving and seamless stakeholder interactions.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Cisco** and **Dell EMC** technologies to optimize and enhance network infrastructure performance.\nImplemented **HPE Aruba** solutions to ensure robust **WLAN** and **LAN** configurations with uptime exceeding **99.9%**.\nLed the deployment of **Network Automation** strategies to streamline network management processes, achieving a **30%** reduction in configuration errors.\nConducted thorough **Network Security** assessments and employed **NAC** solutions to fortify perimeter defenses and reduce vulnerabilities by **40%**.\nCollaborated with cross-functional teams to execute **Project Management** initiatives, ensuring adherence to project timelines and effective communication across different stakeholders.\nFacilitated proactive **Customer Service** engagements, effectively resolving network-related inquiries with a satisfaction rating of over **90%**.\nMaintained ongoing professional development while enhancing **Team Collaboration** through training in **Network Virtualization** technologies, contributing to a knowledge-sharing culture within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Cisco** and **HPE Aruba** technologies to design and implement secure local area networks (LAN) and wireless local area networks (WLAN) for diverse client environments, enhancing connectivity by **30%**.\nLed **Dell EMC** solutions deployment to improve network performance, resulting in a **25%** reduction in latency and better resource management.\nExecuted **Network Virtualization** strategies to optimize network architecture, enhancing scalability and flexibility for large-scale operations by **40%**.\nImplemented **Network Automation** tools for streamlined and efficient network operations, resulting in a **35%** reduction in configuration errors and manual labor.\nConducted comprehensive **Network Security** assessments and integrated **NAC** systems to prevent unauthorized access, maintaining compliance with industry regulations.\nDemonstrated exceptional **Project Management** skills by overseeing multiple networking projects simultaneously, ensuring on-time delivery and stakeholder satisfaction.\nProvided top-notch **Customer Service** and **Team Collaboration**, consistently achieving high satisfaction ratings from clients and team members.\nCommunicated complex technical concepts in both **German (C1)** and **English (B2)**, facilitating smoother collaboration with international teams."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Designed and implemented network architecture utilizing **Cisco**, **HPE Aruba**, and **Extreme Networks** to enhance LAN and WLAN connectivity, achieving a 20% reduction in network latency.\nLed **network automation** initiatives to streamline processes, enhancing operational efficiency by **30%** through scripting and configuration management.\nManaged network security protocols, including **NAC** implementations, ensuring 100% compliance with organizational security standards.\nCollaborated with cross-functional teams to ensure adherence to project timelines, improving project delivery by **25%** through effective project management and team collaboration.\nProvided exceptional customer service by addressing network-related issues swiftly, maintaining a **95%** satisfaction rate among clients.\nCommunicated effectively in **German (C1)** and **English (B2)** with stakeholders, facilitating seamless interactions across diverse teams.\nAssisted in formulating network virtualization strategies to enhance system performance, leading to a more scalable and resilient infrastructure."
    }
  ],
  "skills": "Programming Languages:\n\t**Python (3.8+), SQL, Bash, JavaScript**\n\nBackend Frameworks:\n\t**FastAPI, Flask, Django, Celery**\n\nAPI Technologies:\n\t**REST/gRPC APIs**\n\nOther:\n\t**Cisco, HPE Aruba, Dell EMC, Extreme Networks, LAN, WLAN, Network Virtualization, Network Automation, Network Security, NAC, Project Management, Customer Service, Team Collaboration, Communication, German C1, English B2, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, CI/CD, PyTest, Git**\n\nCloud & Infrastructure:\n\t**AWS (EC2, S3, Lambda), Azure, Docker, Kubernetes, GitHub Actions, Azure DevOps**\n\nDatabases:\n\t**PostgreSQL, MySQL, MongoDB, Redis**\n",
  "apply_company": "SVA System Vertrieb Alexander GmbH"
}