{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Android Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Android Developer with a strong focus on Android Development and expertise in **Kotlin**, **Android SDKs**, **MVVM architecture**, **RxJava**, and **Retrofit**. Adept at building high-performance, scalable applications tailored for mobile platforms. Additionally, possesses over 13 years of experience in full-stack development, showcasing proficiency in **JavaScript/TypeScript**, and various frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, along with backend technologies like **FastAPI** and **Django**. Proven ability to deliver solutions that leverage AI/ML for enhanced predictive analytics and automation. Excellent problem-solving skills, complemented by effective communication abilities, ensuring collaboration within cross-functional teams.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Android Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and delivered reliable **Android applications** utilizing **Kotlin**, implemented using **MVVM architecture** with effective use of **Android SDKs** to ensure optimal performance and enhanced user experience.\n- Leveraged **RxJava** for asynchronous programming, managing **Retrofit** networks efficiently for robust API consumption, boosting application response time by **30%**.\n- Designed and implemented state management solutions integrating the **Hilt** dependency injection framework, reducing boilerplate code and enhancing testability by **25%**.\n- Collaborated with cross-functional teams to decipher business requirements while providing insights and solutions through effective communication, resolving problems encountered during development promptly.\n- Maintained high code quality and facilitated continuous integration/continuous deployment (CI/CD) pipelines ensuring smooth collaboration with DevOps and QA teams, minimizing deployment errors by **40%**.\n- Conducted code reviews and provided mentorship to junior developers, fostering a culture of learning and shared problem-solving within the Android team.\n- Documented development processes carefully ensuring clarity and accessibility, which reduced onboarding time for new team members by **20%**.\n- Participated in daily stand-ups and sprint retrospectives, actively engaging in discussions to streamline workflows and improve project outcomes based on feedback.\n- Employed debugging techniques effectively, enhancing app stability and overall user satisfaction metrics after implementation of fixes by **15%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed high-quality Android applications using **Kotlin** and **Android SDKs**, implementing the **MVVM architecture** to ensure maintainability and scalability in complex projects.\nUtilized **RxJava** for reactive programming, enhancing efficiency in managing data streams and asynchronous tasks in applications.\nIntegrated **Retrofit** for seamless REST API communication, ensuring robust data handling between the application and server.\nImplemented **Hilt** for dependency injection, streamlining the development process and improving code modularity.\nCollaborated with cross-functional teams to define project requirements and deliver exceptional user experiences, demonstrating strong communication skills throughout the development cycle.\nSolving complex problems by incorporating feedback and utilizing analytical skills to improve app performance, resulting in a **40%** increase in user satisfaction based on post-launch surveys.\nEnsured high code quality through rigorous testing practices, maintaining a **95%** test coverage rate to uphold application stability.\nLed reviews and mentoring sessions for junior developers, fostering their growth and elevating team capabilities.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained Android applications by leveraging **Kotlin** and **Android SDKs** to create efficient and user-friendly mobile solutions.\nImplemented the **MVVM architecture** to enhance app performance, ensuring scalability and maintainability across projects.\nIntegrated **RxJava** for asynchronous programming, improving responsiveness and user experience during data processing and network operations.\nUtilized **Retrofit** for seamless API integration, enhancing app functionality by efficiently connecting to various backend services.\nEmployed **Hilt** for dependency injection, streamlining the codebase and simplifying the management of application components.\nDemonstrated exceptional problem-solving skills by troubleshooting performance issues, leading to a **30%** increase in app responsiveness and user satisfaction.\nFacilitated effective communication between cross-functional teams, resulting in enhanced collaboration and timely delivery of project milestones.\nDesigned and implemented user interfaces optimized for mobile devices, adhering to the best practices of **Android Development**, significantly improving overall user engagement rates.\nExecuted rigorous QA practices, leading to a **25%** reduction in post-launch defects and ensuring the delivery of high-quality applications.\nDelivered features in line with project timelines, consistently meeting or exceeding deadlines in **5 out of 5** major release cycles."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript, Kotlin\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRetrofit\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, MVVM architecture, RxJava, Problem-solving, Communication"
}