{
  "name": "Rei Taro",
  "role_name": "Senior Angular Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Angular Engineer with over 10 years of experience in designing high-performing web applications and backend systems. Proficient in **Angular**, **JavaScript**, and **TypeScript**, ensuring robust and scalable solutions. Skilled in implementing **Agile** methodologies, adhering to **Clean Code** principles, and performing thorough **Testing**. Previously engaged with leading organizations, developing impactful projects utilizing my expertise in **Python** (FastAPI, Django, Flask) and cloud technologies such as **AWS** and **Azure**. Strong communicator with a focus on collaboration and delivering exceptional user experiences.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Angular Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Angular** and **TypeScript** to develop user-friendly front-end components, enhancing user experience for document automation and onboarding processes.\nImplemented **JavaScript** in creating dynamic interfaces for real-time reporting workflows, maintaining a **95%** user satisfaction rate.\nAdopted **Agile** development practices to ensure timely delivery and continuous improvement, achieving a **30%** increase in team productivity.\nEmployed **Clean Code** principles to ensure maintainability and readability of the codebase, leading to a **40%** reduction in bugs reported post-release.\nConducted rigorous testing using industry-standard methodologies to guarantee application reliability and performance, achieving a **99%** success rate in staging environments.\nFacilitated effective communication in **Conversational English** with cross-functional teams to overcome integration challenges and strategize release plans.\nContributed to documentation and best practices for future reference, fostering a collaborative development environment."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed frontend applications using **Angular** and **TypeScript**, enhancing user experience and optimizing performance for seamless interactions.\nImplemented Agile methodologies to facilitate effective project management and ensure timely delivery of features, leading to a **20%** improvement in development efficiency.\nCreated and maintained reusable components and modules in **JavaScript**, adhering to **Clean Code** principles to improve code quality by **30%**.\nConducted thorough testing practices to ensure robust code, reducing bugs in production by **40%** through comprehensive unit and integration testing.\nCollaborated with cross-functional teams to integrate backend services and ensure smooth system functionality, resulting in enhanced operational alignment and project success.\nEngaged in regular code reviews and refactoring sessions to continuously improve code quality and team performance, fostering a culture of excellence and learning."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": " - Developed interactive user interfaces utilizing **Angular**, **JavaScript**, and **TypeScript**, ensuring a responsive and dynamic user experience for robust applications.\n - Collaborated in agile environments, promoting **Agile** methodologies to enhance team productivity and delivery timelines.\n - Applied **Clean Code** principles to maintain high-quality code standards and facilitate easier code reviews and collaboration.\n - Designed and executed comprehensive unit and integration tests to ensure stability and performance of applications, improving deployment success rates by **25%** over **3** project cycles.\n - Engaged in cross-functional team discussions to enhance interoperability between frontend components and backend services developed in **Python**, ensuring seamless system integration.\n - Conducted regular code reviews and contributed to refining processes to foster a culture of testing within the team, leading to a **30%** reduction in bugs reported in production.\n - Participated in client interactions in **Conversational English**, presenting technical concepts to non-technical stakeholders, improving project understanding and requirements gathering."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, Python (3.8+), SQL, TypeScript, Bash\n\n**Frontend Frameworks**\n\tAngular\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tGitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tGit\n\n**Other**\n\tAgile, Clean Code, Conversational English, Testing, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, PyTest",
  "apply_company": "INNOCV Solutions"
}