{
  "name": "Tomasz Lee",
  "role_name": "Senior Frontend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled Senior Frontend Engineer with 9+ years of experience in developing sophisticated applications using **React**, **Next.js**, and **JavaScript**. Proven expertise in implementing **Typescript** for enhanced code quality and maintainability. Proficient in utilizing **Git** for streamlined version control and collaboration. Extensive knowledge of **CSS modules** and **Webpack** to optimize UI performance and responsiveness. Committed to testing best practices, leveraging **Jest** and other testing libraries for robust solution delivery. Strong background in asynchronous programming and user authentication strategies, complemented by a solid understanding of server-side and client-side rendering techniques. Experienced in fostering cross-team collaboration, leading projects to successful outcomes while ensuring data protection and client satisfaction.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed user-friendly web interfaces using **React** and **Next.js**, enhancing user satisfaction by **25%**.\n• Leveraged **JavaScript**, **TypeScript**, and **CSS modules** in the design of responsive and interactive UI components.\n• Implemented server-side rendering for improved performance and SEO optimization, utilizing **Next.js** capabilities.\n• Collaborated with cross-functional teams to integrate **Node.js** and **Express** for seamless interactions between frontend and backend systems.\n• Managed source control using **Git**, ensuring code quality through version control practices.\n• Conducted unit and integration tests using **Jest** and other testing libraries, improving overall code reliability and reducing bugs.\n• Implemented authentication and data protection measures, ensuring secure access through **User authentication** methods.\n• Optimized workflows using **Webpack** for efficient asset bundling, enhancing load times for users.\n• Applied asynchronous programming principles to enhance application responsiveness and user experience.\n• Explored the potential of **Micro frontends** architecture for greater scalability and maintainability of frontend applications."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **React** and **Next.js** to build high-performance user interfaces, enhancing user experience and satisfaction by 25%.\nEmployed **JavaScript** and **TypeScript** to develop scalable web applications, leading to a 30% reduction in code errors.\nImplemented **Git** for version control, ensuring seamless collaboration and tracking of project changes across a team of **9** developers.\nApplied **CSS modules** and **Webpack** for optimized styling and improved load times, achieving a **15%** faster rendering of web pages.\nDeveloped and maintained testing frameworks with **Jest** and other testing libraries, ensuring high code quality and an increase in test coverage by **40%**.\nExecuted user authentication using state-of-the-art techniques, ensuring robust **data protection** and enhancing security protocols.\nEngaged in **asynchronous programming** to improve application responsiveness, allowing multiple tasks to run concurrently without performance degradation.\nDrove initiatives to integrate **micro frontends** for enhanced modularity and easier application maintenance, increasing team efficiency by **20%**.\nGuided junior developers through code reviews and mentorship, improving team productivity and knowledge sharing.\nCollaborated with cross-functional teams to define system architecture and timelines, delivering projects on schedule with a focus on quality and performance."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed web applications using **React** and **Next.js**, enhancing user experience and increasing engagement metrics by **30%**.\nImplemented **JavaScript** and **TypeScript** to create scalable and maintainable code, ensuring robust data protection mechanisms.\nUtilized **Node.js** and **Express** to build RESTful APIs, increasing data retrieval speed by **25%**.\nEmployed **Webpack** for optimized asset bundling, resulting in improved application load times by **40%**.\nConducted automated testing using **Jest** and various testing libraries, ensuring code quality and performance standards.\nIntegrated user authentication features, reinforcing security and access control across applications.\nLed initiatives in **micro frontends** architecture to enhance modularity and team collaboration on large-scale projects.\nCollaborated using **Git** for version control, streamlining code management and team workflows.\nEngaged in continuous integration and deployment strategies to maintain an efficient development pipeline.\nContributed to project documentation and knowledge sharing, improving onboarding times for new team members by **50%**."
    }
  ],
  "skills": "•\t**Programming Languages**\n\tJavaScript, TypeScript, Python\n\n•\t**Frontend Frameworks**\n\tReact, Next.js, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, CSS modules\n\n•\t**Backend Frameworks**\n\tNode.js, Express, NestJS, C#, .NET, Entity Framework, Microservices\n\n•\t**API Technologies**\n\tRESTful API, GraphQL, User authentication\n\n•\t**Serverless and Cloud Functions**\n\tAWS, Azure\n\n•\t**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n•\t**DevOps**\n\tCI/CD pipelines\n\n•\t**Cloud & Infrastructure**\n\tAsynchronous programming\n\n•\t**Other**\n\tGit, GitHub, Testing libraries, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Micro frontends, Data protection",
  "apply_company": "dLocal"
}