{
  "name": "Tomasz Lee",
  "role_name": "Senior Field Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled in troubleshooting and installation of both hardware and software, with a background in **Linux** environments and **networking** protocols. Equipped with strong skills in **AutoCAD** for technical design and layout planning. Proven ability to execute **mechanical assemblies** and ensure **safety compliance** on field projects. Demonstrated success in customer service with excellent communication skills that enhance collaboration with teams and clients. With over 9 years of experience as a .NET Full Stack Developer, I bring expertise in designing and implementing robust applications, specializing in microservices architecture, **Apache Kafka**, **RabbitMQ**, and **Redis**. Proficient in both frontend and backend technologies including **ReactJS**, **NextJS**, **.NET**, and **C#**, I consistently streamline development processes and optimize performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted comprehensive **hardware installations** and **software installations** to support various field operations, ensuring all systems were operational and met client specifications.\nPerformed troubleshooting and diagnostics on all installed systems, achieving a **98%** first-time fix rate for technical issues.\nUtilized **AutoCAD** for crafting precise schematics and designs for electrical and mechanical assemblies, supporting installation processes across projects.\nEnsured compliance with safety regulations during all installations, promoting a **zero-accident** work environment through effective training and safety checks.\nDemonstrated strong **customer service** skills, maintaining client relationships and addressing concerns promptly, leading to a customer satisfaction rate of **90%**.\nEngaged in **networking** configuration and setup, implementing robust communication systems to enhance operational efficiency in field environments.\nExecuted **Linux** OS installations and troubleshooting tasks on field devices, improving operational performance and system reliability.\nCollaborated with multidisciplinary teams to ensure successful installations and system performance assessments, reflecting a commitment to **excellent communication**.\nLed hands-on **mechanical assemblies**, ensuring adherence to project timelines and quality standards, resulting in successful project completions **on time and under budget**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Executed hardware installation and software installation tasks on job sites, ensuring equipment functionality meets client specifications and safety compliance.\n• Utilized **AutoCAD** to create and modify engineering designs, leading to efficient project layout and planning. \n• Performed troubleshooting of hardware and software issues, enhancing operational reliability across **Linux** systems.\n• Implemented networking solutions to optimize communication between devices, increasing system efficiency by 20%.\n• Conducted electrical wiring and mechanical assemblies for various installations, maintaining adherence to safety regulations and standards.\n• Provided exceptional customer service through clear communication with clients, resulting in a **95%** customer satisfaction rating.\n• Collaborated with project teams to ensure seamless integration of systems, reducing project downtime by **15%**.\n• Ensured safety compliance across all installations, leading to a **zero** incident record during project phases.\n• Delivered training sessions for junior engineers on installation techniques and safety protocols, improving team competency.\n• Managed project timelines effectively, ensuring all milestones were met consistently within budget and schedule."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized strong **troubleshooting** skills to resolve hardware and software installation issues, ensuring high uptime for client systems.\nProvided exceptional **customer service** by effectively communicating technical solutions to clients, resulting in a 95% customer satisfaction rate.\nConducted **networking** assessments and implemented solutions, improving network performance by 30% over a **6-month** period.\nExecuted **hardware installations** and **electrical wiring** setups that adhered to safety compliance standards, achieving a **zero-incident** record during **2023**.\nDelivered detailed technical documentation related to network setups and installations to enhance team knowledge sharing.\nManaged **mechanical assemblies** with a focus on precision and efficiency, improving assembly speed by **25%**.\nEmployed **AutoCAD** to create and modify engineering drawings, which facilitated better project planning and execution.\nCollaborated with cross-functional teams to ensure all project milestones were met on time, leading to the successful completion of **5** major projects last year.\nTrained junior engineers on **Linux** troubleshooting and maintenance, fostering a culture of learning and growth within the team."
    }
  ],
  "skills": " **Programming Languages**\n\t Python, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t Cloud technologies, networking, hardware installation, software installation\n\n**Other**\n\t UX/UI Design, Git, GitHub, Redux, customer service, troubleshooting, communication, safety compliance, electrical wiring, mechanical assemblies, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "UVeye"
}