{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Support Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Support Engineer with extensive experience in providing technical support for semiconductors, electronics, and optics, I excel in delivering exceptional customer service and problem-solving solutions. My background allows me to effectively communicate complex technical concepts and collaborate with cross-functional teams to support image processing and motion control technologies.\nLeveraging my strong technical skills, I am adept at troubleshooting and resolving intricate issues to enhance system reliability and performance. My commitment to quality service and customer satisfaction is complemented by my ability to understand and address customer needs promptly and efficiently. I am committed to continuous improvement in both system performance and customer experience.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided **technical support** and **customer service** for complex semiconductor, electronics, and optics systems, ensuring efficient **problem-solving** for client inquiries.\nCollaborated with cross-functional teams to deliver solutions involving **image processing** and **motion control** technologies, enhancing overall product performance and user satisfaction.\nCommunicated effectively with clients to gather requirements and provide tailored support, demonstrating strong **communication** and **teamwork** skills.\nTroubleshot and resolved technical issues related to electronic components and systems, employing a methodical approach to ensure timely resolutions.\nCreated and maintained documentation for **support procedures** and **technical specifications**, facilitating knowledge sharing within the engineering team.\nConducted product demonstrations and training sessions for customers, showcasing **image processing** capabilities and innovative technologies in the semiconductor sector.\nEngaged with clients to obtain feedback and drive continuous improvement in **customer service** practices, contributing to higher satisfaction rates.\nUtilized analytical skills to identify patterns in **technical support** requests, proactively addressing recurring issues in collaboration with the engineering teams.\nActively participated in team meetings, fostering a culture of **teamwork** and sharing insights to improve customer engagement strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Provided **technical support** for clients, addressing issues related to **semiconductor**, **electronics**, and **optics**, ensuring timely resolution and exceptional **customer service**.\n- Utilized **problem-solving** skills to troubleshoot and resolve complex **image processing** and **motion control** challenges, improving client satisfaction by **30%**.\n- Collaborated with cross-functional teams to enhance **motion control** software, resulting in a 25% reduction in system downtimes through improved **teamwork** and **communication**.\n- Offered detailed technical guidance in **image processing** applications, leading to increased efficiency and a **15%** rise in user engagement across supported platforms.\n- Conducted thorough training sessions for clients and internal staff, focusing on best practices in utilizing **electronics** and **semiconductor** technology, improving user competency by **20%**.\n- Developed and maintained comprehensive documentation for troubleshooting processes, enhancing **communication** and streamlining support operations by **40%**.\n- Effectively managed multiple client accounts, ensuring consistent support and communication, resulting in an average **10%** increase in customer retention."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Provided exceptional **customer service** and **technical support** to clients in the **semiconductor** and **electronics** industries, demonstrating excellent **communication** and **problem-solving** skills to address complex issues.\nCollaborated with cross-functional teams to enhance product performance, leveraging deep knowledge in **optics** and **image processing** to resolve technical challenges effectively.\nUtilized **motion control** principles to troubleshoot and optimize equipment performance, achieving a **95% customer satisfaction rate** through effective problem resolution.\nLed initiatives to improve the efficiency of support processes, resulting in a **30% reduction** in average resolution time for technical issues.\nDeveloped training materials and conducted workshops on technical standards and best practices, fostering **teamwork** and improving the skill set of support staff by **20%**.\nActively gathered customer feedback to inform product development, contributing to enhancements that increased the reliability of electronics by **15%**.\nParticipated in teamwork sessions aimed at streamlining communications and technical support flows, thereby strengthening the overall support infrastructure within the organization."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tsemiconductor, electronics, optics, image processing, motion control, customer service, problem-solving, technical support, communication, teamwork, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "KLA"
}