{
  "name": "DANIEL HE",
  "role_name": "Senior Mobile Developer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-9189a3390/",
  "profile_summary": "Results-driven Senior Mobile Developer skilled in **React Native**, **React**, **ES6+**, **TypeScript**, and **Node.js** for developing high-performance mobile applications. Expertise in Component architecture, Advanced hooks, and state management using **Redux** and **Zustand**. Proven experience in REST API development and integrating external APIs to enhance app functionalities. Adept at implementing Automated testing, optimizing performance, and utilizing tools like **React Navigation** and **Fabric** for seamless navigation and deployment. Recognized for driving significant improvements in user experience and application efficiency, leveraging a solid foundation in designing scalable, reliable, and user-centric applications tailored for diverse sectors including healthcare and finance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Senior Mobile Developer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed user-friendly mobile applications using **React Native** and **TypeScript**, enhancing user engagement by 30% through intuitive interface design and advanced hooks.\nImplemented **Redux** and **Zustand** for state management, optimizing data flow and improving performance by 40% in dynamic environments.\nArchitected reusable components leveraging **ES6+** features, promoting code maintainability and reducing development time by 25%.\nIntegrated external APIs, achieving seamless data retrieval while ensuring robust authentication protocols to enhance security measures.\nExecuted automated testing strategies to maintain code quality and reduce bugs by 50% prior to deployment.\nImplemented deep linking features to streamline user navigation, resulting in a 20% increase in application engagement.\nOptimized application performance using techniques such as **FlatLists** and **animations with Reanimated**, leading to a smoother user experience.\nCollaborated with cross-functional teams to align project deliverables, ensuring the delivery of high-quality mobile applications within tight deadlines."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "• Developed robust mobile applications using **React Native** and **TypeScript**, ensuring optimal performance and user experience.\n• Implemented **ES6+** features and advanced hooks to enhance component architecture and reusability across the application.\n• Integrated **Redux** and **Zustand** for effective state management, resulting in a 30% faster loading time for the mobile app.\n• Designed and developed REST APIs with **Node.js**, facilitating smooth external APIs integration and user authentication processes.\n• Executed automated testing strategies to maintain code quality, leading to a **40% reduction** in bugs post-deployment.\n• Applied **React Navigation** for seamless transitions, achieving a **95% user engagement rate** through optimized deep linking.\n• Utilized **Fabric** for application performance monitoring, enhancing app stability and user satisfaction by **25%**.\n• Developed visually appealing animations using **Reanimated**, contributing to a more interactive and responsive user interface.\n• Collaborated with cross-functional teams to ensure smooth integration of back-end services and third-party tools, improving overall application reliability."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "• Developed high-quality mobile applications using **React Native** and **React**, leveraging advanced hooks and component architecture to create engaging user experiences.\n• Implemented state management solutions utilizing **Redux** and **Zustand** for efficient data handling, improving app responsiveness by 30%.\n• Integrated deep linking and navigation solutions with **React Navigation**, enhancing user journey across the application.\n• Conducted automated testing using **Jest** and **React Testing Library**, resulting in a bug reduction of 25% and ensuring robust code quality.\n• Engaged in REST API development and external API integrations, enhancing functionality and connectivity for mobile solutions, achieving seamless user authentication with **Node.js**.\n• Optimized application performance through techniques like FlatLists and animations with **Reanimated**, improving frame rates by 50%.\n• Executed deployment strategies and ensured reliable application scaling using cloud services, matching user demand with 99% uptime."
    }
  ],
  "skills": " **Programming Languages**\n\tTypeScript, Java, JavaScript (ES6+, React, Vue.js, Angular, Pixi.js, Vanilla JS, Node.js), Go, Python, SQL, Swift, Kotlin\n\n**Frontend Frameworks**\n\tReact, React Native, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest, Advanced hooks, Component architecture, React Navigation, Deep Linking, React Query, FlatLists, Animations with Reanimated\n\n**Backend Frameworks**\n\tSpring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ, REST API development, External APIs integration, Authentication, Performance optimization\n\n**Databases**\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n**DevOps**\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline\n\n**Cloud & Infrastructure**\n\tAWS (EKS, RDS, CloudFront, S3, Lambda), API Gateway, Git, CloudWatch, ELK Stack\n\n**Other**\n\tMicroservices, RESTful API design, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies, Automated testing, Native integration, Fabric, Bridge for iOS, Bridge for Android"
}