{
  "name": "Rei Taro",
  "role_name": "Software Development Engineer III",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Software Development Engineer III with over 10 years of experience in performance optimization and algorithms, specializing in web technologies and graphics programming. Proficient in **TypeScript**, **C++**, **WebGL**, **WebGPU**, and **WebAssembly**, with a strong focus on creating high-performing applications and implementing efficient algorithms. Experienced in utilizing **Web Workers** for improved performance and responsiveness in application development. Adept at collaborating in open-source contributions and fostering a growth mindset through effective communication and empathy. Proven track record of delivering scalable solutions in top-tier organizations, effectively leveraging my technical acumen to drive project success.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Software Development Engineer III",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **C++** and **TypeScript** to develop high-performance algorithms for graphics programming and rendering, ensuring optimal performance and efficiency.\nEngineered mobile SDKs integrating **WebGL**, **WebGPU**, and **WebAssembly** technologies for advanced graphics rendering on mobile platforms, achieving up to **30%** performance improvement.\nImplemented asynchronous processing with **Web Workers** to enhance application responsiveness and user experience in line with design specifications.\nDesigned and optimized maps and GIS functionalities, contributing to an open-source project that expanded community access to geospatial data tools by **25%**.\nEmphasized communication and collaboration skills to work effectively in cross-functional teams, addressing challenges and aligning project goals while maintaining a growth mindset.\nConducted peer reviews and provided constructive feedback, fostering an empathetic and inclusive development environment that promotes continuous improvement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **TypeScript** for developing robust web applications, focusing on **performance optimization** and efficient algorithms to enhance user experience.\nImplemented graphics programming techniques using **WebGL** and **WebGPU** to create high-performance visualizations in applications.\nExecuted tasks utilizing **Web Workers** and **WebAssembly** for multi-threading processes, improving application responsiveness and execution speed, achieving a **40%** reduction in load times.\nDeveloped and maintained mobile SDKs, employing **C++** for performance-critical components, enabling seamless integration with GIS and mapping services.\nContributed to open-source projects that enhanced application scalability, demonstrating a commitment to community growth and collaboration.\nFostering a **growth mindset**, participated in team discussions and provided feedback to improve project outcomes, resulting in a **15%** improvement in team efficiency.\nEngaged in clear communication across cross-functional teams to ensure alignment on project goals and timelines, facilitating smoother collaboration.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Applied algorithms and performance optimization strategies in the development of backend services for trade execution, leveraging **Python**, **Flask**, and **PostgreSQL** to enhance trading operations by **30%**.\nEngineered real-time price feed processors using **asyncio**, **WebSockets**, and **Redis**, delivering up-to-the-minute trading data for high-frequency transactions, with a latency reduction of **50ms**.\nCollaborated effectively with frontend teams to deliver data through **REST APIs** and **WebSocket channels**, ensuring smooth user interaction with the platform, enhancing user satisfaction scores by **20%**.\nEnsured the platform met regulatory requirements, including MiFID II and GDPR, while adhering to internal data security protocols, contributing to a zero-security incident year.\nImplemented comprehensive test suites with **PyTest**, **tox**, and mock servers, streamlining QA and CI processes for efficient development cycles, achieving **95%** test coverage.\nIntroduced job queuing and scheduling solutions with **Celery** and **RabbitMQ**, optimizing backend task execution and process management, resulting in task completion time improvements by **40%**."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, TypeScript, C++\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tWebGL, WebGPU, Web Workers, WebAssembly\n\n**API Technologies**\n\tREST/gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, communication, collaboration, empathy, growth mindset, algorithms, performance optimization, graphics programming, Mobile SDKs, maps, GIS, open source contributions"
}