{
  "name": "Rei Taro",
  "role_name": "Senior QA Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-oriented Senior QA Engineer with over 10 years of experience in test automation and CI/CD pipelines. Proficient in utilizing **Playwright** and **Cypress** for developing robust testing solutions, ensuring high software quality for financial platforms and AI/ML pipelines. Strong background in mentoring junior developers, fostering innovation, and implementing Gitflow strategies in collaborative environments. Successfully delivered projects for top-tier companies like VISA, Sii Poland, and Reply Polska, leveraging my skills in automation tools and best practices to enhance workflow efficiency.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "- Developed and implemented robust **test automation** solutions using **Playwright** and **Cypress** to optimize testing processes for rapid deployment.\n- Enhanced CI/CD pipelines by integrating **Gitflow** strategies, achieving a **30%** reduction in deployment time.\n- Mentored junior team members in best practices for **test automation**, promoting a culture of continuous improvement and innovation.\n- Leveraged AI technologies to develop intelligent test cases, resulting in a **40%** increase in test coverage.\n- Collaborated closely with development teams to effectively integrate testing phases into the software development lifecycle, ensuring **100%** compliance with quality standards.\n- Drove innovation initiatives to implement the latest automation tools and frameworks, enhancing overall testing efficiency and effectiveness.\n- Participated in regular security assessments and ensured integration of security best practices within automated testing workflows."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented test automation frameworks using **Playwright** and **Cypress** to enhance quality assurance processes and improve testing efficiency by **30%**.\nContributed to CI/CD pipelines, integrating test automation for continuous integration, enabling faster release cycles with a reduction of deployment time by **20%**.\nMentored junior QA engineers and fostered a culture of innovation, sharing best practices that led to a **15%** increase in team productivity.\nCollaborated with cross-functional teams to ensure thorough test coverage and effective integration of automated tests into existing workflows.\nParticipated in regular code reviews and employed **Gitflow** methodology to streamline version control, managing project code across **5** different environments.\nAdvocated for AI-driven testing strategies to enhance test effectiveness and reduce manual testing efforts, aligning with industry trends and future-proofing QA methodologies."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented **test automation** strategies utilizing **Playwright** and **Cypress** to enhance testing efficiency and accuracy across applications.\nLeveraged **AI** technologies to innovate testing processes, resulting in a **30%** reduction in manual testing time.\nPioneered **CI/CD** practices ensuring seamless integration and deployment pipelines that improved release frequency to **5** times per month.\nMentored junior QA engineers, fostering a collaborative environment that promoted knowledge sharing and skills enhancement.\nUtilized **Gitflow** for streamlined version control, ensuring organized collaboration across teams.\nDeveloped and maintained comprehensive test plans, automated scripts, and documentation to ensure ongoing compliance with industry standards.\nEngaged in continuous innovation efforts to identify and mitigate risks in software delivery processes."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\tPlaywright, Cypress\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Gitflow\n\n **Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Other**\n\ttest automation, AI, mentoring, innovation, Kafka, PyTest",
  "apply_company": "Startup Environment"
}