{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Quality Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Quality Engineer with a strong emphasis on **test automation** and **software testing**, leveraging 8 years of experience in the technology sector. Proficient in **Python**, **Git**, and **Shell scripting**, with hands-on skills in **Linux** environments and mobile technologies including **Android** and **QNX**. My expertise extends to using frameworks like **Pytest** and **Appium** for comprehensive testing solutions. I have a solid foundation in automotive communication protocols including **CAN** and **Ethernet**, which enhances my analytical skills and problem-solving capabilities. \nI excel in managing multiple projects with excellent time management and initiative, ensuring high-quality deliverables within tight deadlines while fostering continuous improvement. My diverse technical background, including **modern libraries and frameworks**, allows me to interface effectively with cross-functional teams to deliver robust quality assurance initiatives.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Quality Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed comprehensive **test automation** frameworks and executed **software testing** strategies for cross-platform applications, enhancing overall stability and performance by **30%**.  \n- Utilized **Python**, **Shell scripting**, and **Linux** environments to create automated test scripts ensuring rigorous validation of application functionalities.  \n- Employed **Pytest** and **Appium** to facilitate both unit and functional testing on **Android** platforms, achieving a **95%** test coverage rate across mobile applications.  \n- Conducted thorough analysis and resolved complex issues through strong **analytical skills** and exceptional **problem-solving** abilities, resulting in a **25%** reduction in bug turnaround time.  \n- Initiated and managed concurrent testing projects, applying effective **time management** techniques to meet aggressive deadlines while maintaining high standards of quality.  \n- Engaged in continuous learning and adaptation, proactively identifying areas for improvement and implementing best practices in **test automation**.  \n- Collaborated extensively with cross-functional teams to integrate quality assurance into the software development lifecycle, ensuring compliance with industry standards and best practices.  \n- Documented and reported testing outcomes and issues using efficient version control with **Git**, facilitating clear communication within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented test automation frameworks using **Python** and **Pytest** to enhance software testing efficiency and coverage for automotive applications, ensuring high-quality deliverables in compliance with industry standards.\nConducted rigorous software testing across various platforms, including **Android** and **Linux**, utilizing **Shell scripting** to automate testing processes, resulting in a **30%** reduction in testing time.\nLeveraged **Git** for version control and collaboration, maintaining clean and efficient codebases while working on multiple concurrent projects in a dynamic environment.\nDeveloped and executed automated test scripts using **Appium** for mobile applications, leading to improved reliability and user experience in **Android** and **QNX** environments.\nApplied analytical skills to identify defects through **CAN** and **Ethernet** communication analysis, significantly enhancing the fault detection process in automotive systems.\nEmployed problem-solving techniques to troubleshoot issues and provide innovative solutions in high-pressure situations, demonstrating initiative and adaptability in project challenges.\nUtilized time management skills to prioritize tasks effectively, ensuring timely project deliverables aligned with team objectives and deadlines."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented **test automation** frameworks using **Python** and **Pytest** to enhance software testing efficiency for automotive applications, significantly reducing testing time by **30%**.\nConducted rigorous **software testing** on Android devices, employing **Appium** for UI automation and ensuring high-quality performance across versions, specifically Android **10** and **11**.\nUtilized **Git** for version control and collaboration with cross-functional teams, tracking changes in codebases and maintaining high standards of code integrity.\nDeveloped and executed **Shell scripting** solutions on **Linux** systems to automate and streamline repetitive testing tasks, improving time management and productivity.\nAnalyzed and troubleshoot issues within **QNX** and Android environments, applying analytical skills and problem-solving strategies to deliver actionable insights.\nEngaged in CAN and Ethernet protocol analysis, ensuring the reliability of communication in automotive systems and contributing to the overall quality of the product.\nDemonstrated initiative in prioritizing and managing testing timelines, consistently meeting project deadlines and quality benchmarks.\nFostered a culture of continuous improvement by collaborating closely with development teams to integrate quality practices early in the software development lifecycle."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Shell scripting\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript, React, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tLinux, Nginx, Certbot\n\n**Other:**\n\ttest automation, software testing, Pytest, Appium, automotive, CAN, Ethernet, analytical skills, problem-solving, initiative, time management",
  "apply_company": "Unikie"
}