{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Detail-oriented Senior Field Engineer with 13+ years of experience in delivering exceptional customer service and problem-solving solutions within the electrical and mechanical domains. Proficient in fault finding and repairs, demonstrating a strong technical aptitude to quickly diagnose and resolve issues. Experienced in utilizing **Salesforce** to enhance client interactions and management processes. Proven ability to collaborate effectively with cross-functional teams to ensure client satisfaction and operational excellence. Skilled in leveraging technology to streamline processes, contributing to high-performance outcomes. Strong background in compliance-driven environments, ensuring adherence to industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized strong problem-solving skills to diagnose and troubleshoot electrical and mechanical issues on-site, ensuring minimal downtime for clients.\nPerformed fault finding and repairs with a proven track record of achieving **95%** first-time fix rate, enhancing customer satisfaction and loyalty.\nProvided exceptional customer service during field operations, explaining technical issues in clear terms and keeping clients informed throughout service processes.\nUtilized **Salesforce** to document service calls and track customer interactions, improving response times and operational efficiency by **30%**.\nExecuted complex repairs and installations, contributing to an overall reduction in service costs by **25%** through efficient resource management and skilled workmanship.\nMaintained a consistent schedule of preventative maintenance checks to ensure systems were functioning optimally, achieving a **100% compliance** rate.\nCollaborated with cross-functional teams to streamline processes and resolve technical challenges effectively, fostering a culture of teamwork and innovation."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized exceptional **customer service** skills to effectively communicate and resolve client inquiries while prioritizing **problem-solving** techniques in complex engineering scenarios.\nPerformed detailed **fault finding** and **repairs** on electrical and mechanical systems, ensuring operational efficiency and minimal downtime within a **3%** margin.\nImplemented proactive maintenance strategies that resulted in a **25%** reduction in equipment failures, utilizing **electrical** and **mechanical** expertise.\nCollaborated with cross-functional teams to enhance service delivery by leveraging **Salesforce** for streamlined case management, achieving an overall customer satisfaction score of **94%**.\nConducted on-site assessments and technical evaluations of equipment to devise and recommend solutions based on customer needs, enhancing service excellence and company reputation in the field.\nTrained junior engineers and technicians in advanced troubleshooting techniques, fostering a culture of knowledge sharing and continuous improvement within the team, leading to a **15%** increase in service efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized problem-solving skills to investigate and perform fault finding on electrical and mechanical systems, effectively enhancing operational efficiency as a Senior Field Engineer.\nConducted repairs and maintenance of equipment in various environments, ensuring customer service excellence and minimal downtime for clients.\nImplemented customer service strategies, leading to a **15%** increase in client satisfaction ratings and fostering long-term positive relationships with customers.\nManaged repair workflows using **Salesforce**, streamlining processes and providing real-time updates to clients regarding the status of their service requests.\nAnalyzed customer feedback to develop solutions for recurring issues, employing critical thinking to improve service delivery and reduce repair time by **20%**.\nCollaborated with cross-functional teams to address complex engineering challenges, showcasing strong communication and teamwork skills.\nTrained and mentored junior engineers on best practices for mechanical and electrical repairs, improving overall team efficacy and knowledge sharing.\nMaintained detailed records of service calls and repairs, which resulted in a **30%** reduction in repeated faults and improved equipment reliability."
    }
  ],
  "skills": "**Backend Frameworks:**\n\t•\tPython: FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\t•\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\t•\tAuthentication & Security:\n\t\t•\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\t\t•\tNginx, Let’s Encrypt, Certbot\n\n**Databases:**\n\t•\tPostgreSQL (Fintech), MySQL (Healthcare)\n\t•\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\t•\tDocker, Kubernetes\n\t•\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\t•\tAWS: ECS, Lambda, RDS, S3\n\t•\tAzure: App Services, Blob Storage, SQL Database\n\t•\tCI/CD & Infrastructure as Code:\n\t\t•\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\t•\tSalesforce\n\t•\tCustomer service\n\t•\tProblem solving\n\t•\tFault finding\n\t•\tRepairs\n\t•\tElectrical\n\t•\tMechanical",
  "apply_company": "Diversey"
}