{
  "name": "Rei Taro",
  "role_name": "Senior QA Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Detail-oriented Senior QA Engineer with over 10 years of experience in software testing, including API testing and automation. Proficient in applying ISTQB standards to ensure quality reporting and collaborates effectively with cross-functional teams using collaborative tools. Skilled in analyzing and documenting test cases, and delivering comprehensive testing strategies for high-performing applications. Background in backend development allows for a unique understanding of the technical aspects of testing, especially for financial platforms and cloud-native architectures. Recently contributed to significant projects for industry leaders, utilizing technologies such as **Python**, **FastAPI**, **Django**, **Flask**, and cloud platforms like **AWS** and **Azure**. Known for strong analytical capabilities, meticulous attention to detail, and exceptional written communication skills.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Conducted rigorous **API testing** and **automation** to guarantee the quality of backend services developed in **Python** with **FastAPI**.\nEmployed **manual testing** strategies to ensure comprehensive coverage of software functionality and compliance with requirements.\nFacilitated quality reporting processes to document findings, improvements, and maintain high standards in software delivery.\nCollaborated with cross-functional teams, leveraging **collaborative tools** to enhance communication and ensure a thorough understanding of testing requirements.\nImplemented best practices as per **ISTQB** standards to elevate testing procedures and improve overall project quality.\nDemonstrated analytical skills by assessing system performance and aligning with customer specifications for solutions deployed on **Azure App Services**.\nApplied a meticulous approach to **software testing**, focusing on **attention to detail** to detect and resolve issues in a timely manner."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented comprehensive software testing strategies, ensuring functionality and performance of backend systems developed in **Python** and **FastAPI**.\nConducted thorough API testing on event-driven microservices employing **Celery** and **Redis**, verifying asynchronous processing of financial data with over **1000+** transactions per minute.\nExecuted rigorous manual testing and automation initiatives, assessing system integration and compliance with industry standards.\nCreated quality reporting mechanisms to track and analyze defect trends, utilizing collaborative tools for enhanced team communication and quality assurance.\nManaged documentation for robust testing processes in accordance with **ISTQB** standards, ensuring attention to detail in all testing phases.\nEngineered analytical testing approaches, facilitating successful release management through meticulous quality checks across diverse environments.\nMaintained documentation for office software and automated testing scripts to foster team collaboration and knowledge sharing."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Executed comprehensive software testing strategies, including both manual and automation techniques, to enhance the quality of backend services for trade execution.\nDeveloped and maintained quality reporting systems to track the efficacy of trade execution and portfolio management features, ensuring adherence to high standards.\nCollaborated effectively with cross-functional teams, utilizing collaborative tools to communicate testing outcomes and engage in solution discussions for frontend and backend integrations.\nProvided rigorous testing using REST APIs and WebSocket channels to verify real-time data delivery processes, ensuring an optimal user experience in trading operations.\nApplied analytical skills to identify potential issues in the technologies used, including **Python**, **Flask**, **PostgreSQL**, **asyncio**, **WebSockets**, and **Redis**.\nConducted API testing as part of comprehensive test suites implemented with **PyTest**, **tox**, and mock servers, enhancing CI processes with a structured approach.\nUtilized attention to detail in ensuring compliance with regulatory requirements, such as MiFID II and GDPR, while maintaining the highest data security protocols.\nLeveraged workflow optimization through job queuing and scheduling solutions with **Celery** and **RabbitMQ**, reducing backend task processing times by up to **30%**."
    }
  ],
  "skills": "****Programming Languages****\n\tPython (3.8+), SQL, Bash, JavaScript\n\n****Backend Frameworks****\n\tFastAPI, Flask, Django, Celery\n\n****Frontend Frameworks****\n\t\n\n****API Technologies****\n\tREST/gRPC APIs\n\n****Serverless and Cloud Functions****\n\tAWS (EC2, S3, Lambda), Azure\n\n****Databases****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps****\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n****Cloud & Infrastructure****\n\t\n\n****Other****\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, software testing, API testing, manual testing, automation, ISTQB, quality reporting, collaborative tools, office software, rigorous, analytical, written communication, attention to detail, Microservices, Kafka, PyTest, Git",
  "apply_company": "Federation for Sustainable Entrepreneurship"
}