{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Offering a comprehensive skill set in engineering principles, I am a results-oriented Senior Engineer with 8 years of extensive experience in civil and mechanical engineering domains. My expertise includes proficiency in **AutoCAD** for 3D modeling, as well as strong capabilities in finite element analysis (FEA) to support detailed load calculations and design assessments. I excel in creating precise load charts and lifting plans essential for safe and efficient operations. Additionally, I am adept in the use of **MS Office** for project documentation and reporting.\n\nI leverage advanced analytical approaches combined with hands-on experience in rigging and crane operations to ensure that projects meet safety and compliance standards. My commitment to delivering high-quality engineering solutions is underscored by a proven track record of managing complex engineering projects on time and within budget.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Conducted detailed load calculations and created lifting plans for complex projects, ensuring safety and compliance with industry standards.\n• Designed and implemented load charts using **AutoCAD**, enhancing project efficiency and clarity in visual representations.\n• Collaborated effectively with cross-functional teams, utilizing **MS Office** tools for presentations and documentation, achieving a 10% increase in project communication efficiency.\n• Developed and optimized 3D models for various engineering applications, leading to a 20% reduction in design time through streamlined workflows.\n• Utilized **Finite Element Analysis (FEA)** techniques to assess structural integrity, resulting in a 15% improvement in material utilization across projects.\n• Conducted extensive rigging assessments, ensuring all equipment and methods met safety and operational requirements, minimizing incident reports by 25%.\n• Designed mechanical components to meet specified performance standards, contributing to successful project completions within timeframes of less than 6 months.\n• Implemented innovative solutions in mechanical design, focusing on reliability and maintainability, which enhanced overall project sustainability.\n• Mentored junior engineers and interns in best practices for engineering design and safety protocols, fostering a collaborative and educational team environment.\n• Led site inspections and evaluations using **AutoCAD** and other engineering software, ensuring compliance and adherence to project specifications."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed comprehensive load calculation methodologies and lifting plans for heavy equipment and machinery, ensuring safety and compliance in engineering applications.\n- Utilized **AutoCAD** (latest version) to create detailed designs and 3D models, enhancing project visualization and client presentations.\n- Conducted Finite Element Analysis (FEA) for structural integrity assessments, optimizing mechanical components while reducing material costs by **15%**.\n- Collaborated with interdisciplinary teams to integrate engineering solutions, leveraging **MS Office** for documentation, presentation, and project management tasks.\n- Oversaw rigging and crane operations, designing effective load charts that improved efficiency and safety during the lifting process by **20%**.\n- Mentored junior engineers in best practices for mechanical system design and project execution methodologies, fostering a culture of innovation and safety in civil engineering projects.\n- Streamlined engineering workflows by implementing best practices in rigging and load calculations, contributing to a **10%** reduction in project timelines."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted comprehensive load calculations and developed lifting plans for complex projects, ensuring compliance with Mechanical and Civil engineering standards.\nUtilized **AutoCAD** to create precise 3D models for structural components, enhancing visualization and accuracy in design execution across **8+** major projects.\nExecuted finite element analysis (FEA) to assess structural integrity and optimize mechanical designs, improving performance metrics by up to **25%** while reducing material costs.\nSupervised rigging operations and crane utilization, ensuring safety and efficiency on-site, resulting in a **15%** reduction in project timelines.\nCollaborated with cross-functional teams to produce detailed load charts that informed decision-making and facilitated risk assessments for lifting operations.\nCreated and maintained project documentation using **MS Office**, ensuring effective communication and compliance with industry standards throughout the engineering lifecycle.\nLeveraged mechanical engineering principles to design innovative solutions, enhancing the capability for large-scale projects and meeting client specifications in a timely manner.\nImplemented best practices in the application of mechanical designs, ensuring high standards of quality and regulatory compliance in all engineering outputs."
    }
  ],
  "skills": "Frameworks & Technologies:\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\nArtificial Intelligence & Machine Learning:\n\tMLflow, Airflow, Kubeflow\n\nDevOps & Cloud:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\nAuthentication & Security:\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\nDatabases & Caching:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\nCI/CD & Infrastructure as Code:\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tCivil, Mechanical, AutoCAD, 3D, FEA, MS Office, rigging, crane, load calculations, load charts, lifting plans",
  "apply_company": "Omega Morgan, Inc."
}