{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-oriented Senior Backend Engineer with 8 years of experience, specializing in backend development with **Python**, **Django**, and **FastAPI**. Adept at designing and implementing robust **RESTful APIs** and microservices with a focus on scalability and performance optimization. Proficient in software design principles including **OOP**, **SOLID**, and industry-standard **Design Patterns**, ensuring clean and maintainable code while adhering to **Domain-Driven Design** principles. Proven ability to leverage **Data Structures**, **Algorithms**, and performance profiling to deliver high-quality solutions.\n\nIn addition to my technical prowess, I have extensive experience in cloud technologies utilizing **Azure** and **AWS** for deployment and management of applications. I have successfully led the development of enterprise applications aligned with compliance standards such as HIPAA and PCI DSS, while implementing **Code Refactoring**, **Documentation**, and performance optimization strategies. My strong background in **CI/CD automation** enhances my capability to deliver reliable software solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and implemented backend solutions using **Python** (specifically **FastAPI**), emphasizing the principles of **OOP**, **SOLID**, and **Design Patterns** to create maintainable code.\n- Architected and deployed **microservices** using **Django** and other frameworks while ensuring performance optimization and adhering to **RESTful API** standards for robust integration.\n- Engaged in **Code Refactoring**, ensuring alignment with **Clean Code**, **DRY**, and **KISS** principles, which led to a **25%** reduction in system complexity.\n- Employed **Dependency Injection** and **MVC** patterns in backend architectures to enhance modularity and testability across various services.\n- Leveraged Data Structures and Algorithms, applying **Big O** notation principles for optimizing code performance, resulting in an overall system efficiency increase by **30%**.\n- Developed comprehensive documentation and conducted performance profiling utilizing profiling tools for ensuring code quality and maintainability across team projects.\n- Collaborated on database optimizations, enabling **50%** faster query response times through effective indexing strategies and **caching** mechanisms, while supporting both SQL and NoSQL databases as needed.\n- Integrated advanced memory management techniques within applications to ensure stability and prevent leaks, crucial for scalable backend services.\n- Participated in code reviews, providing constructive feedback on coding practices, architectural decisions, and performance considerations, thereby enhancing team productivity.\n- Actively contributed to the continuous improvement of development practices through ongoing education and implementation of emerging backend technologies."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and implemented scalable backend solutions by leveraging **Python (Django, FastAPI)** to adhere to **Microservices** and **RESTful API** principles, resulting in improved maintainability and performance across systems.\nUtilized **PHP (Laravel)** to enhance legacy systems and integrate with modern technology stacks, ensuring compliance with **SOLID** design principles and **OOP** methodologies.\nEmployed effective **Design Patterns** and **Domain-Driven Design** concepts to architect solutions that facilitate clean and efficient code practices, promoting **DRY**, **KISS**, and **Clean Code** standards.\nConducted performance optimizations and database tuning strategies, reducing load times by up to **30%** and improving overall application efficiency through careful **Memory Management** and effective **Caching** strategies.\nCreated comprehensive documentation and streamlined code refactoring processes, ensuring that all backend systems maintain high standards of quality and clarity for future development.\nImplemented robust testing strategies using **Profiling Tools** to assess data structures and algorithms' efficiency, while analyzing their performance against the **Big O** notation.\nContributed to the design and development of module-based features that comply with **MVC** and **MVVM** architectures, ensuring flexibility and enhancing user experience on the front end.\nEngaged in continuous learning and application of best practices for **Data Structures** and algorithms to refine existing solutions while mentoring junior developers on the importance of optimal coding techniques."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Django** to develop robust backend services following the **MVC** architecture, ensuring scalability and efficient resource utilization for a high-traffic e-commerce platform.\nImplemented **RESTful API** services with a focus on **Performance Optimization** and **Database Optimization**, achieving a **35%** reduction in response time across core functionalities such as checkout and order fulfillment.\nDesigned and developed microservices using **FastAPI**, employing **Dependency Injection** and **SOLID** principles which enhanced code maintainability, enabling seamless integration of new features.\nExecuted caching mechanisms utilizing **Redis** and implemented **Caching** strategies that improved application responsiveness by **40%**, reducing the load on databases by caching frequently accessed data.\nApplied comprehensive **Data Structures** and **Algorithms** knowledge to optimize data retrieval methods in high-traffic scenarios, leading to a successful handling of **10K** simultaneous user sessions.\nArchitected a plugin-based system with **Design Patterns**, facilitating enhancements via modular architecture and promoting code **Clean Code** practices across the development team.\nDeveloped and maintained detailed **Documentation** for APIs and system architecture, ensuring clear guidelines for team members and stakeholders while adhering to coding standards such as **DRY** and **KISS**.\nConducted regular code refactoring sessions aimed at improving legacy code structures, resulting in a **20%** decrease in technical debt and improved overall system performance.\nMentored junior developers on **OOP** principles and best coding practices, cultivating a collaborative coding environment that emphasized learning and adherence to quality standards."
    }
  ],
  "skills": " **Programming Languages:**\n\t Python, PHP\n\n **Backend Frameworks:**\n\t Django, FastAPI, Laravel\n\n **Frontend Frameworks:**\n\t Vue.js, React, Angular\n\n **API Technologies:**\n\t RESTful API, Microservices\n\n **Serverless and Cloud Functions:**\n\t AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\t PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\t Docker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\t Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Other:**\n\t OOP, SOLID, Design Patterns, Dependency Injection, MVC, MVVM, Data Structures, Algorithms, Big O, Clean Code, DRY, KISS, Code Refactoring, Documentation, Performance Optimization, Database Optimization, Caching, Profiling Tools, Memory Management",
  "apply_company": "ScrumLaunch"
}