{
  "name": "Tomasz Lee",
  "role_name": "Konsultant AWS i Data Science",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven AWS and Data Science Consultant with 9+ years of experience in designing, developing, and implementing complex applications on **AWS**, including **Amazon SageMaker**, **ECR**, **IAM**, **EMR**, and **JupyterHub**. Proficient in utilizing **Python** for data science projects and implementing **Docker** for containerization. Expertise in **MLOps** practices for optimizing machine learning workflows. Previous experience as a .NET Full Stack Developer with a strong foundation in **microservices architecture** and distributed systems, utilizing technologies like **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, **.NET**, and **C#**. Demonstrated ability to deliver robust solutions, streamline development processes, and enhance performance, alongside effective collaboration across teams to lead projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Konsultant AWS i Data Science",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **AWS** services including **Amazon SageMaker**, **ECR**, and **EMR** to develop scalable machine learning models, boosting deployment efficiency by **30%**.\nUtilized **Docker** for containerization, ensuring consistent development environments across various stages of the pipeline.\nImplemented **IAM** policies to enhance security and access management for cloud resources in compliance with industry standards.\nDeveloped and deployed data science workflows using **Python** in **JupyterHub**, streamlining experimentation and collaboration among data scientists.\nApplied **MLOps** best practices to automate model training and deployment, reducing time to production by **25%**.\nCollaborated with cross-functional teams to gather requirements and deliver data-driven insights, improving decision-making processes.\nConducted performance tuning on ML models, resulting in a **15%** increase in accuracy over previous benchmarks.\nProduced comprehensive documentation for processes and models to maintain reproducibility and knowledge transfer within the team.\nEngaged in regular code reviews and mentoring sessions to improve coding standards and team efficiency."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **AWS** solutions, leveraging **Amazon SageMaker** for deploying machine learning models, enhancing data-driven decision-making processes.\nUtilized **Docker** for containerization of applications, enabling seamless deployment and scalability across environments.\nDeveloped and maintained MLOps processes using **EMR** and **IAM** to ensure secure and efficient handling of large-scale data analytics.\nCreated and configured **JupyterHub** for collaborative data analysis, facilitating real-time projects with teams across 3 departments.\nDesigned automation scripts in **Python** to streamline ETL processes, improving data processing speed by **40%**.\nLed the deployment of models into production with **ECR**, resulting in a quicker turnaround time of **8 weeks** from development to deployment.\nConducted training sessions for data science teams on MLOps practices and tools, increasing overall team skillset by **20%**.\nCollaborated with cross-functional teams to define project specifications and milestones, ensuring delivery adherence to the **4-month** project timeline.\nOptimized data storage and retrieval processes, employing customizable data lakes for better data accessibility.\nMentored junior data scientists on best practices in **Docker** and **AWS** solutions, fostering a knowledge-sharing culture."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **AWS** services including **Amazon SageMaker** to deploy machine learning models, optimizing performance with an **EMR** cluster for big data processing.\nUtilized **Python** and **JupyterHub** to perform exploratory data analysis and build predictive models, increasing insight generation speed by **30%**.\nImplemented **Docker** for containerization of applications, ensuring consistent deployments across environments and reducing setup time by **25%**.\nManaged access and security using **IAM** roles, ensuring compliance with best practices for data protection.\nUtilized **ECR** for efficient storage and management of Docker images, streamlining the development pipeline.\nCollaborated in MLOps initiatives, ensuring smooth model deployment processes and continuous integration for machine learning workflows.\nDeveloped technical documentation and user guides for deployed models and systems, enhancing knowledge sharing across teams.\nParticipated in daily standups and code reviews, fostering a culture of continuous improvement and alignment with project objectives.\nEngaged with cross-functional teams to ensure integration of data science solutions with existing applications, including legacy systems and third-party APIs."
    }
  ],
  "skills": " • **Backend Frameworks**:\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n • **Frontend Frameworks**:\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n • **API Technologies**:\n\tRESTful API, GraphQL\n\n • **Serverless and Cloud Functions**:\n\tAWS, Amazon SageMaker, ECR, IAM, EMR, JupyterHub, Docker\n\n • **Databases**:\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n • **DevOps**:\n\tAWS, Azure, CI/CD pipelines, MLOps\n\n • **Cloud & Infrastructure**:\n\tAWS, Azure\n\n • **Other**:\n\tUX/UI Design, Git, GitHub, Python, Redux, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Solidity, Ether.js, Web3.js, Ethereum"
}