{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Teamcenter Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a dedicated Teamcenter Developer with extensive experience, I excel in developing and integrating solutions using **Java**, **JavaScript**, **C**, and **C++** within Product Lifecycle Management (PLM) and Product Data Management (PDM) environments. My background includes work with **Siemens Teamcenter**, leveraging agile project management methodologies to deliver high-quality results efficiently. I am well-versed in code versioning and issue tracking systems, ensuring robust version control and project transparency.\n\nI translate business needs into technical solutions while maintaining a focus on high performance and compliance standards. My strong communication skills in both **German** and **English** enable seamless collaboration with cross-functional teams. With my adaptability and problem-solving abilities, I have successfully contributed to various projects while enhancing workflows and driving innovation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Teamcenter Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Siemens Teamcenter** for PLM and PDM solutions, emphasizing agile methodologies and effective project management strategies across teams.\nDeveloped and maintained applications using **Java**, **C** and **C++** to enhance Teamcenter functionalities, resulting in a 30% increase in user efficiency.\nImplemented code versioning practices and integrated issue tracking systems to streamline workflow, leading to a 25% reduction in bug resolution time.\nCollaborated with cross-functional teams in both **German** and **English**, fostering a multilingual environment that improved team communication by 40%.\nLed the design and development of customized Teamcenter configurations using **BMIDE**, ensuring compliance with established standards and customer specifications.\nConducted code reviews and implemented best practices in coding standards, contributing to a more efficient development process by 20%.\nParticipated in Agile project management sessions, ensuring that all deliverables were met within the projected timeline of **two-week sprints**.\nServed as a mentor for junior developers, providing training on Teamcenter best practices and PLM strategies, increasing team knowledge output by **15%**.\nEngaged in continuous learning to stay abreast of updates and improvements in **Teamcenter** capabilities, enhancing overall team skill sets."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Siemens Teamcenter** to enhance product lifecycle management (PLM) and product data management (PDM) solutions, ensuring seamless integration and efficient data flow between engineering and manufacturing teams.\nDeveloped and maintained robust applications using **C**, **C++**, and **Java** for backend services, implementing optimized algorithms that reduced processing time by **30%**.\nCollaborated with cross-functional teams in an **Agile project management** environment, contributing to iterative development cycles that improved delivery speed by **25%**.\nImplemented version control practices using **Code versioning** systems and tracked issues effectively with **Issue tracking systems**, fostering an organized and efficient development workflow.\nConducted code reviews and mentoring sessions to instill best practices, contributing to a **15%** decrease in bugs within the release candidates.\nCommunicated fluently in both **German** and **English**, enabling effective collaboration with diverse project teams and stakeholders across regions.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained applications using **C** and **C++** for Siemens Teamcenter, ensuring robust integration with PLM and PDM systems to streamline product lifecycle management.\nUtilized **JavaScript** for frontend enhancements, collaborating within Agile project management frameworks to deliver effective solutions for customer requirements and system optimizations.\nImplemented solutions within **Siemens Teamcenter**, including code versioning strategies and issue tracking systems to enhance software reliability and team collaboration.\nParticipated in code reviews and development processes, ensuring high-quality standards and adherence to best practices.\nEnsured seamless communication in both **German** and **English**, driving cross-functional communication and collaboration during project lifecycle.\nEngaged in continuous integration and version control practices to manage application code effectively, ensuring fast deployment cycles and reduced downtime.\nCollaborated with cross-functional teams to gather requirements, validate solutions, and support ongoing system improvements to enhance functionality.\nEmployed Agile methodologies in project management, allowing rapid iterations and responses to changing project demands, while maintaining clear stakeholder engagement and satisfaction."
    }
  ],
  "skills": " **Programming Languages:**\n\tC, C++, Java, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCI/CD & Infrastructure as Code\n\n**Other:**\n\tAgile project management, Issue tracking systems, Code versioning, Siemens Teamcenter, PDM, PLM, German, English, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow"
}