{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Full-Stack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Full-Stack Engineer with 8 years of extensive experience in developing scalable applications utilizing **React** and **Microservices** architecture within Agile environments. Proficient in leveraging cloud services like **GCP** for high-performance solutions in the healthcare and financial sectors. Adept in creating testable code and implementing **OpenAPI** standards for seamless integration, while focusing on distributed systems and real-time data processing. I excel at utilizing tools such as **BigQuery** and **Pub/Sub** to enhance data analytics and automate workflows.\n\nWith a strong foundation in JavaScript/TypeScript, **Python**, and **Flutter**, I have designed and led enterprise-grade platforms that incorporate AI/ML capabilities, ensuring compliance with standards like HIPAA, FHIR, PCI DSS, and SOC 2. My background includes creating efficient machine learning pipelines and deploying models using tools like **MLflow**, **Airflow**, and **Kubeflow**, which enhance operational efficiency and deliver intelligent automation solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Full-Stack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** for building user interfaces, ensuring responsive and engaging **UX Design** aligned with modern standards by collaborating with designers using tools like **Figma**.\nArchitected and developed scalable **Microservices** in **Scala**, ensuring optimal performance and maintainability across distributed systems for complex healthcare and financial applications.\nEmployed **GCP** services such as **BigQuery** and **Pub/Sub** for data management and real-time messaging, improving data processing speeds by **30%**.\nDesigned and implemented RESTful APIs using **OpenAPI**, enhancing the documentation and usability of services by **40%** for frontend integrations.\nCollaborated within an **Agile** framework, participating in daily stand-ups and sprint planning to improve team dynamics and project delivery times by **25%**.\nConducted thorough testing practices for **Testable Code** ensuring robustness across the application with frameworks like Jest and PyTest, boosting code reliability by **20%**.\nDeveloped high-performance financial dashboards integrated with data visualization libraries for real-time insights, maintaining responsiveness and clarity for end-users.\nLeveraged cloud-native architectures on **GCP** to ensure application scalability, reliability, and cost-efficiency, managing application services across multiple environments.\nContinuously improved code quality through code reviews and pair programming sessions, promoting best practices in software design across team projects.\nEngaged in troubleshooting and optimizing distributed systems, contributing to an uptime increase of **99.9%**, maintaining service reliability for users."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **Scala** to enhance distributed systems capabilities and improve code quality, ensuring delivery of **testable code** in compliance with best practices.\nUtilized **React** (18) to build dynamic, user-centric front-end applications, integrating **Figma** designs and deploying responsive user interfaces for financial dashboards and admin portals.\nAdopted microservices architecture employing **GCP**, enhancing the scalability and maintainability of financial platforms for high-volume transaction systems.\nImplemented real-time transaction monitoring and analytics using **BigQuery** and **Pub/Sub**, enabling effective tracking of financial activities and efficient data analytics.\nCollaborated in an **Agile** environment to deliver features iteratively, improving team synergy and accelerating project timelines.\nCreated and maintained robust ETL pipelines using **Apache Airflow** for batch and real-time data ingestion from various internal and third-party sources.\nExecuted event-driven architecture integrating **Kafka** and **RabbitMQ** for asynchronous communication, facilitating real-time processing of transactions and alerts.\nDesigned and integrated AI/ML solutions using **scikit-learn** and **XGBoost** for fraud detection, analyzing transaction patterns to promptly identify and mitigate risks.\nEnsured seamless user experience through comprehensive **UX Design** strategies, enhancing customer satisfaction and engagement in financial applications."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Scala** and **React** to design and develop innovative software solutions in a microservices architecture for a global e-commerce platform, ensuring seamless integration with **GCP** services.\nImplemented **OpenAPI** specifications to facilitate consistent API development and documentation, enhancing collaboration across multi-functional teams.\nLeveraged **BigQuery** and **Pub/Sub** for efficient data management and real-time data processing, improving analytics capabilities and enabling data-driven decision-making.\nAdopted Agile methodologies to streamline project workflows, improve delivery timelines by **25%**, and promote continuous improvement through iterative development cycles.\nCrafted high-fidelity prototypes using **Figma** to improve UX design processes, resulting in a **15%** increase in user engagement and retention metrics.\nDeveloped scalable, maintainable code with a strong emphasis on testable code practices, facilitating a **40%** reduction in regression-related bugs during production releases.\nEngineered backend services that support **100,000+** concurrent users, focusing on high availability, low latency, and robust performance.\nCollaborated closely with UI/UX designers to implement responsive, user-friendly interfaces optimized for accessibility, adhering to WCAG 2.1 standards.\nManaged application deployments and infrastructure on **GCP**, ensuring efficient resource usage and operational scalability through container orchestration.\nIntegrated feedback loops into the development cycle, applying user insights to continuously enhance the application features and performance, driving overall customer satisfaction."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Scala\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOpenAPI\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, BigQuery\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCloud Services\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Microservices, Distributed Systems, Authentication & Security, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile, Figma, Testable Code, UX Design",
  "apply_company": "Hopper"
}