{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior ML Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior ML Engineer with 8 years of extensive experience, I am proficient in developing and managing **MLOps** workflows, leveraging tools such as **MLflow** and **Databricks** for machine learning lifecycle management. My deep understanding of **Python** and data processing frameworks, including **Spark** and **PySpark**, allows me to efficiently build scalable solutions. I have significant hands-on experience with **Docker** and **Kubernetes** for containerization and orchestration, ensuring seamless deployment of machine learning models in production environments.\nI bring strong analytical thinking and problem-solving abilities, with a proven track record of leading cross-functional teams in agile environments. My expertise extends to Azure services, facilitating cloud-based solutions that are both robust and compliant with industry standards. Additionally, I prioritize effective communication and attention to detail, which enhances team collaboration and project delivery across sectors such as healthcare and finance. My adaptability in the fast-evolving tech landscape enables me to stay current with emerging technologies, ensuring that I consistently deliver high-performance, intelligent automation solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **Python** to design and implement machine learning solutions, with a focus on **MLOps** utilizing **MLflow**, enabling seamless training, validation, and deployment across **production** environments.\nUtilized **Azure Services** for deploying intelligent data pipelines and analytics models, enhancing data processing capabilities and delivering insights for healthcare applications.\nArchitected scalable data solutions using **Databricks**, facilitating high-performance analytics with **Spark** and **PySpark**, ensuring efficient handling of large datasets (up to **10TB**).\nEmployed **Docker** and **Kubernetes** for containerization and orchestration of microservices, streamlining application deployment processes, resulting in a **40%** increase in deployment speed.\nDemonstrated strong **analytical thinking** to troubleshoot complex problems, driving innovative solutions in model performance and system scalability by employing data-driven metrics.\nCommunicated effectively with cross-functional teams to understand project requirements, ensuring alignment between technical execution and business goals, enhancing collaboration by **30%**.\nMaintained a keen **attention to detail** during model development and testing phases, ensuring high-quality outputs and adherence to business specifications and regulatory standards (e.g., HIPAA).\nFostered **team collaboration** by sharing knowledge and mentoring junior engineers in best practices related to **machine learning** and cloud technology applications.\nAdapted to new challenges within fast-paced environments, showcasing flexibility in approaching evolving project needs and technical advancements.\nDesigned and executed robust testing strategies using automated testing tools to validate model accuracy and performance enhancements, leading to a **25%** reduction in error rates.\nIntegrated advanced data processing capabilities in client-facing applications, enriching user experiences through streamlined analytics and real-time insights derived from large datasets."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to develop and scale machine learning models, leveraging **MLflow** for effective **MLOps** and model management in line with the financial sector's requirements.\nImplemented **Azure Services** and **Databricks** to streamline data analytics workflows, facilitating batch and real-time processing of financial data, enhancing decision-making with reliable metrics.\nBuilt and deployed scalable data processing frameworks using **Spark** and **PySpark**, optimizing data pipelines to handle transactions from over **50k** monthly users across various banking applications.\nCreated containerized applications using **Docker** and orchestrated them with **Kubernetes**, ensuring robust deployment and maintenance of machine learning services across diverse environments.\nDemonstrated analytical thinking and problem-solving by developing an AI/ML-powered fraud detection system, effectively reducing fraud instances by **30%** through advanced pattern recognition techniques.\nEnsured team collaboration and effective communication while integrating machine learning models into production, maintaining a focus on attention to detail and adaptability in fast-paced environments.\nDesigned comprehensive ML pipelines for credit scoring and churn predictions, directly incorporating model inference into backend services to support real-time decision-making for transactions with a processing time under **1 second**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **PySpark** for designing scalable machine learning workflows on **Databricks**, enhancing data processing speeds by **50%** and reducing model training times by **30%**.\nImplemented **MLOps** practices with **MLflow** for streamlined model management and deployment, improving deployment success rates by **40%** and facilitating version control of models.\nLeveraged **Azure Services** for robust cloud solutions, ensuring high availability and performance; decreased infrastructure costs by **25%** while maintaining service reliability.\nEmployed **Docker** and **Kubernetes** for containerization and orchestration, enabling seamless integration and deployment of ML models across diverse environments.\nDeveloped advanced analytical models, applying strong **Analytical Thinking** and **Problem-Solving** skills to refine predictive accuracy and optimize resource utilization for machine learning projects.\nCommunicated effectively across cross-functional teams, fostering **Team Collaboration** to align model objectives with business goals and enhance project outcomes.\nAdapted to evolving project requirements, showcasing **Adaptability** through proactive identification and resolution of critical issues, resulting in 100% adherence to project timelines.\nMaintained meticulous documentation and attention to detail in all project deliverables, contributing to enhanced team productivity and knowledge sharing."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript, React, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Cloud & Infrastructure:**\n\tDocker, Kubernetes, Terraform, Ansible, Helm, Docker Compose\n\n**DevOps:**\n\tGitHub Actions, GitLab CI/CD\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Databricks, MLOps, Spark, PySpark, Analytical Thinking, Problem-Solving, Effective Communication, Attention to Detail, Team Collaboration, Adaptability, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Elitmind"
}