{
  "name": "Tomasz Lee",
  "role_name": "Senior Test Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Test Engineer with 9+ years of experience specializing in software testing methodologies, including both automated testing and manual testing. Proficient in developing test plans, executing test cases, and generating detailed test reports to ensure compliance with industry standards such as **IEC 62304** and **ISO 14971**. Skilled in utilizing version control tools like **Git** and **Perforce**, as well as continuous integration tools such as **Jenkins** and **Bamboo**. Strong understanding of **FDA regulations** governing software development in healthcare. Known for fostering collaboration among cross-functional teams to achieve high-quality deliverables while optimizing testing processes. Original strengths include a solid technical background in **.NET**, **C#**, and cloud services, with hands-on experience in modern frameworks like **ReactJS** and **NextJS**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Test Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Executed comprehensive software testing methodologies including both automated and manual testing to ensure compliance with **IEC 62304** and **ISO 14971** standards, while adhering to **FDA regulations**.\nDeveloped detailed test plans, cases, and reports to enhance the overall quality of deliverables, effectively identifying critical defects that reduced bugs by **30%** before production.\nApplied collaboration techniques with cross-functional teams, ensuring all stakeholders were engaged and informed throughout the testing lifecycle, achieving alignment on **100%** of the project milestones.\nUtilized version control systems such as **Git** and **Perforce** for efficient management of test artifacts and resources.\nImplemented CI/CD practices through **Jenkins** and **Bamboo**, streamlining the deployment pipeline and resulting in a **50%** reduction in testing turnaround time.\nParticipated in test development and execution for mobile applications using **Xcode** and **Python**, leading to a robust testing framework that improved test coverage by **40%**.\nConducted rigorous analysis and debugging of test results, ensuring high standards were met before release, fostering a culture of quality assurance.\nCollaborated with developers to integrate testing processes earlier in the software development life cycle, enhancing overall product quality."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Conducted comprehensive software testing methodology adhering to **IEC 62304**, **ISO 14971**, and **FDA regulations** to ensure compliance and reliability.\nDeveloped and executed test plans and test cases using **Python**, enhancing test coverage by **40%** and improving defect detection rates.\nImplemented automated testing frameworks in **Jenkins** and **Bamboo**, increasing testing efficiency by **35%** and reducing manual intervention.\nCollaborated with cross-functional teams to define system requirements and ensure seamless integration throughout the testing phases, leading to a **20%** reduction in project timelines.\nUtilized **Git** and **Perforce** for version control, enhancing collaboration among team members and maintaining code integrity while managing artifacts.\nCreated detailed test reports that communicated findings and implications effectively to stakeholders, boosting transparency in the testing process.\nParticipated actively in code reviews to improve code quality and ensure adherence to testing standards, contributing to a **15%** improvement in overall project quality.\nMentored junior test engineers in manual and automated testing strategies, fostering skill development and collaboration within the team.\nCommunicated fluent English across various teams to coordinate testing efforts, facilitating smoother workflow and project alignment."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and executed **automated testing** strategies for iOS applications, ensuring compliance with **FDA regulations** and standards such as **IEC 62304** and **ISO 14971**.\n• Collaborated with cross-functional teams utilizing **Git** and **Perforce** for version control, enhancing team efficiency through effective collaboration.\n• Created and maintained comprehensive **test plans** and **test cases** for various software modules, including thorough documentation of **test reports** reflecting quality metrics and improvements.\n• Implemented **Jenkins** and **Bamboo** for continuous integration and delivery, improving deployment frequency by **30%**.\n• Facilitated manual and automated testing processes, achieving a **25%** reduction in bug reports post-release through rigorous **test development**.\n• Conducted daily stand-ups and actively participated in code reviews, ensuring the project remains aligned with quality standards and deadlines.\n• Provided mentorship on **software testing methodologies**, enhancing the team's testing capabilities and fostering a culture of quality assurance.\n• Delivered detailed user guides and technical documentation, improving onboarding and knowledge transfer for new engineering team members.\n• Engaged in root cause analysis of defects identified during testing cycles, leading to improved product reliability and user satisfaction scores by **15%**.\n• Maintained open communication in English with global teams to ensure clarity on requirements and testing status."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, TypeScript, JavaScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, iOS, Xcode\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Jenkins, Bamboo\n\n**Cloud & Infrastructure**\n\tGit, GitHub, Perforce\n\n**Other**\n\tUX/UI Design, Solidity, Ether.js, Web3.js, Ethereum, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, IEC 62304, ISO 14971, FDA regulations, software testing methodology, test development, test execution, automated testing, manual testing, test plans, test cases, test reports, collaboration, English",
  "apply_company": "GlobalLogic"
}