{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Value Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic Senior Value Engineer with a proven track record in **data analysis**, **change management**, and **project management**. Over 13 years of comprehensive experience as a Full Stack Developer in the healthcare and financial sectors, combining technical expertise in **JavaScript/TypeScript**, **Python**, and **Flutter** with strong consultative skills to drive **customer success** and deliver compelling **business cases**. Adept at fostering collaboration and effective communication to implement value-based selling strategies and executive presentations. \nExpert in developing high-performance applications leveraging **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** while ensuring alignment with compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Proficient in structuring cloud-native systems using **AWS** and **Azure**, and implementing innovative architectures, including microservices and CI/CD pipelines. Background in building AI/ML-driven platforms, emphasizing predictive analytics and automation to enhance decision-making processes.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Value Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed business cases demonstrating the value of innovative full-stack platforms for healthcare and fintech, utilizing **Python (FastAPI)**, **TypeScript**, and **Node.js**.\n• Led project management initiatives by transforming legacy systems into microservices architectures, leveraging **Docker**, **Kubernetes (AKS/EKS)**, and serverless functions via **AWS Lambda** and **Azure Functions**.\n• Collaborated with cross-functional teams to ensure customer success and effective change management while delivering mobile applications for iOS and Android using **Flutter** and **React Native**.\n• Delivered data analysis presentations to stakeholders, showcasing insights from advanced data visualization tools developed with **D3.js**, **Chart.js**, and **Power BI Embedded**.\n• Created consulting frameworks for MLOps workflows using **MLflow**, **DVC**, and **Airflow**, securing model training and deployment across development and production.\n• Executed effective communication strategies to integrate intelligent features into frontend applications, powered by models hosted on **Azure ML** and **AWS Sagemaker**.\n• Managed projects deploying ML models for risk scoring and fraud detection using **scikit-learn**, **PyTorch**, and **TensorFlow**, ensuring robust testing strategies with **Jest**, **Cypress**, and **Postman**.\n• Established transformative value by building CI/CD pipelines using **Fastlane** and **App Center**, enhancing test automation and release workflows while reducing time to market by **30%**.\n• Consulted on integrating search capabilities with **Azure Cognitive Search** and **Elasticsearch**, ensuring efficient querying of health and financial datasets.\n• Collaborated closely with ML teams to deploy NLP models such as **spaCy** and **Hugging Face Transformers**, enhancing document parsing and anomaly detection capabilities.\n• Facilitated executive presentations to communicate project objectives, driving alignment and collaboration across diverse teams for successful outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized data analysis skills to modernize core financial platforms by migrating to microservices architecture using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, enhancing scalability and performance for **high-volume transactional systems.**\nDeveloped business cases and collaborated with stakeholders to build interactive front-end applications with **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels.\nExecuted change management strategies by delivering real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies.\nManaged projects to design and deploy a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across **3** critical workflows such as payments, alerts, and compliance.\nApplied consulting skills in the development of ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing.\nEnhanced customer success by building and deploying machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns with a focus on **2%** improvement in detection accuracy.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, achieving a **5%** reduction in processing time."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized data analysis to create compelling business cases for value-based selling, demonstrating ROI and driving customer success initiatives.\nLed change management projects by collaborating with cross-functional teams, enhancing communication strategies to ensure project alignment and effective outcomes.\nDeveloped and presented executive presentations to stakeholders, effectively conveying project progress and strategic recommendations to enhance overall business value.\nImplemented project management methodologies to drive the successful execution of high-impact projects, ensuring on-time delivery and adherence to budget constraints.\nEngaged customers directly to gather insights and feedback, fostering strong relationships and enhancing customer success pathways.\nFacilitated collaboration across departments to promote a unified approach to problem-solving and innovation, ultimately boosting overall productivity.\nAnalyzed customer data to identify trends and opportunities for improvement, providing actionable insights that support value-driven decision making.\nCrafted and refined value propositions that resonate with customer needs, leading to improved engagement and satisfaction levels across the board.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\t\n\n **Frontend Frameworks:**\n\t\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\t\n\n **Other:**\n\tvalue-based-selling, business cases, change management, customer success, project management, data analysis, consulting, executive presentations, communication, collaboration",
  "apply_company": "dbt Labs"
}