{
  "name": "Mariusz Jan Skobel",
  "role_name": "Network Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Dynamic Network Engineer with over 10 years of experience in managing and optimizing network infrastructures, demonstrating a strong expertise in **Cisco**, **Routing Protocols**, **BGP**, **OSPF**, **EIGRP**, **VLANs**, **VPNs**, and **Cisco IOS**. Adept at executing **Physical Network Migrations** and overseeing **Data Centre Operations** with a focus on ensuring high availability and performance. Proven problem-solving skills with a little-known ability to communicate complex technical ideas clearly to stakeholders. Strong foundation in **Cisco NX-OS**, **Cisco ASA**, and **Cisco Meraki**, bringing experience in documentation and best practices to maintain compliance and security. Passionate about leveraging networking technologies to enhance performance and resilience in enterprise environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Network Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented robust network solutions utilizing **Cisco IOS**, **Cisco NX-OS**, and **Cisco ASA**, ensuring optimal configuration and security for **VPNs** and **VLANs** across complex enterprise environments.\n• Managed and monitored enterprise routing protocols including **BGP**, **OSPF**, and **EIGRP** to maintain high availability and performance in network services, achieving 99.9% uptime across data centers.\n• Led physical network migrations with minimal downtime, successfully transitioning 10+ data centers to new architectures while ensuring seamless connectivity for over **500** users.\n• Created comprehensive documentation for network configurations and protocols to facilitate knowledge sharing and compliance with industry standards, aiding in incident response and problem-solving for teams.\n• Collaborated with cross-functional teams to troubleshoot and resolve networking issues, improving communication and support processes, achieving a 30% reduction in response times.\n• Conducted training sessions for junior network engineers on best practices in **Cisco** technology and routing protocols, enhancing team capability and knowledge sharing.\n• Participated in the review and improvement of network policies, contributing to the streamlining of documentation processes that reduced administrative workload by **25%**.\n• Implemented solutions for data center operations that included disaster recovery strategies and network optimization practices, resulting in a **15%** increase in operational efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized strong problem-solving skills to oversee physical network migrations, ensuring minimal downtime and optimal performance during the transition to new systems.\nImplemented and maintained **Cisco IOS**, **Cisco NX-OS**, and **Cisco ASA** configurations to support secure and efficient routing protocols including **BGP**, **OSPF**, and **EIGRP**, enhancing overall network reliability.\nConfigured and managed **VLANs** and **VPNs** to facilitate secure data transmission and network segregation, improving data security standards by **30%**.\nExecuted thorough documentation practices for all network configurations and processes, enabling streamlined communication and knowledge transfer among team members.\nCollaborated with cross-functional teams to manage **Data Centre Operations**, ensuring effective integration and performance of network resources across multiple environments.\nParticipated in troubleshooting and problem resolution initiatives, leveraging advanced communication skills to coordinate technical support and resolve connectivity issues.\nMonitored network performance metrics, using data analytics to identify potential bottlenecks and propose optimization strategies for network efficiency improvement by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented and optimized **Cisco IOS** and **Cisco NX-OS** configurations to enhance network performance and reliability for data center operations, contributing to a **99.9%** uptime across network services.\nEngineered robust routing protocols including **BGP**, **OSPF**, and **EIGRP** to ensure efficient data packet routing and reduced latency, achieving rapid failover solutions in less than **5** seconds.\nManaged **VLANs** and **VPNs** to isolate network traffic and secure remote access, enabling a secure and scalable architecture for **up to 500** concurrent users.\nLed physical network migrations, documenting every step to ensure smooth transitions and minimal disruptions, facilitating a **30%** increase in bandwidth capacity post-migration.\nUtilized **Cisco ASA** and **Cisco Meraki** firewalls to establish secure and compliant network environments, maintaining strict adherence to GDPR standards.\nCollaborated with cross-functional teams to troubleshoot complex networking issues, applying strong problem-solving techniques to resolve issues swiftly and effectively within set **SLA** targets.\nAuthored comprehensive documentation of network configurations and protocols, enhancing knowledge transfer and operational efficiency among team members.\nExemplified strong communication skills by presenting technical network solutions to stakeholders, ensuring alignment with organizational objectives and project requirements."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tMLflow, Airflow, Kubeflow\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, GitHub Actions, GitLab CI/CD\n\n **Networking:**\n\tCisco, Routing Protocols, BGP, OSPF, EIGRP, VLANs, VPNs, Cisco IOS, Cisco NX-OS, Cisco ASA, Cisco Meraki, Physical Network Migrations, Data Centre Operations\n\n **Other:**\n\tDocumentation, Problem-solving, Communication, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n"
}