{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience specializing in **JavaScript**, **HTML5**, **CSS3**, and modern frameworks like **React**, **Next.js**, and **Vue**. Proven ability to design and implement high-quality user interfaces while ensuring responsive design through **Tailwind** and **Bootstrap**. Adept in creating intuitive and engaging UI/UX solutions aligned with best practices, utilizing tools like **Figma**. \nProficient in building and consuming **REST APIs**, and managing version control with **Git**. Experienced in optimizing web applications for maximum SEO performance and employing **WooCommerce** for eCommerce solutions. \nAdditionally, I hold strong expertise in backend technologies such as **Python** and **Node.js**, and a solid understanding of CI/CD pipelines, enhancing overall development efficiency. Passionate about leveraging my extensive background to deliver exceptional frontend experiences.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed interactive and responsive user interfaces for web applications utilizing **JavaScript**, **HTML5**, and **CSS3**, ensuring optimal performance across **9** different devices and browsers.\nImplemented design systems and UI components using frameworks like **Tailwind** and **Bootstrap**, enhancing UI responsiveness and maintainability, achieving a **30%** reduction in development time.\nLed UI/UX design sessions in collaboration with stakeholders, utilizing **Figma** for rapid prototyping and user flows, resulting in a **25%** increase in user satisfaction based on feedback metrics.\nIntegrated **REST API** services to enable dynamic content loading and real-time updates within applications, ensuring seamless user experiences.\nCollaborated with backend engineers on **WordPress** and **WooCommerce** integrations, optimizing e-commerce performance which led to a **15%** increase in transaction volume.\nManaged code versioning and deployment workflows using **Git**, implementing best practices in code contributions and peer reviews, which streamlined team collaboration.\nEnhanced website visibility and traffic through SEO best practices, employing analytics to track improvements and generate reports that informed future design and development strategy.\nEnsured high-quality code delivery through responsive testing frameworks, contributing to a **40%** decrease in reported frontend bugs post-launch.\nDesigned and maintained the aesthetics of the product experience in alignment with business goals while ensuring accessibility compliance and adherence to modern web standards."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Leveraged **JavaScript** frameworks like **React (18)** and **Vue 3** to develop responsive user interfaces, integrating design tools such as **Figma** to align with UI/UX best practices.\n- Implemented **HTML5**, **CSS3**, and **Tailwind CSS** to create visually appealing websites and applications, achieving a **30%** improvement in user engagement.\n- Utilized **REST API** services to ensure seamless data exchange between front-end and back-end systems, enhancing application performance and functionality.\n- Managed version control using **Git**, ensuring efficient collaboration and codebase stability within a team of **9** developers.\n- Conducted thorough **SEO** optimizations, resulting in improved search engine rankings and increased website traffic by **25%**.\n- Integrated **WordPress** and **WooCommerce** for e-commerce solutions, streamlining the online shopping experience and facilitating transactions.\n- Applied best practices in performance tuning and debugging to optimize code quality and application responsiveness, addressing client feedback effectively."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** frameworks, including **React** (18), **Vue 3**, and **Angular**, to develop engaging frontend applications that enhance UI/UX and ensure fast, responsive experiences on web and mobile platforms.\nImplemented modern styling techniques using **Tailwind CSS** and **Bootstrap** to create visually appealing, SEO-friendly e-commerce UIs optimized for mobile-first engagement and accessibility compliance (WCAG 2.1).\nCollaborated closely with design teams using **Figma** to translate concepts into interactive and user-friendly interfaces for seamless customer interactions.\nDeveloped and utilized **REST API** services to facilitate efficient communication between frontend interfaces and backend services, ensuring high availability and performance in key functionalities.\nManaged version control systems using **Git**, ensuring smooth collaborative development and effective tracking of changes in project codebases.\nStreamlined e-commerce workflows by integrating powerful features of **WooCommerce** alongside proprietary functionalities, focusing on boosting operational efficiency.\nEmployed best practices in SEO to optimize site visibility and drive organic traffic, leveraging analytics to iteratively improve performance metrics.\nWorked in an agile environment, iterating on designs and collecting user feedback to enhance overall UI/UX strategies, contributing to increased user satisfaction and engagement."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, HTML5, CSS3\n\n**Backend Frameworks:**\n\tPython: FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular, Tailwind, Bootstrap\n\n**API Technologies:**\n\tREST API\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, AI & ML: MLflow, Airflow, Kubeflow, Figma, WooCommerce, UI/UX, SEO",
  "apply_company": "Remote Office"
}