{
  "name": "Mariusz Jan Skobel",
  "role_name": "Field Service Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Detail-oriented Field Service Engineer with over 10 years of experience in IT support and troubleshooting within the healthcare and finance sectors. Proven expertise in installation and maintenance of medical devices, ensuring compliance with industry standards such as HIPAA and HL7. Proficient in managing IP Networks and TCP/IP configurations, with hands-on experience in operating systems including **Microsoft Windows 7**, **Microsoft Windows 10**, **Windows Server 2008**, and **Windows Server 2012**. \nSkilled in utilizing **PACS**, **PAS**, **EMR**, and **Mirth** for efficient data management and communication. Excellent interpersonal and communication skills with a strong commitment to delivering top-notch customer service and training. Brings a robust background in electrical engineering principles, ensuring a comprehensive understanding of systems integration to enhance operational reliability. Passionate about leveraging technology to deliver effective solutions that meet user needs and drive organizational success.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Field Service Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tProvided exceptional **customer service** by delivering on-site **IT support** and **troubleshooting** for healthcare technology applications, ensuring minimal downtime and optimal performance of medical devices and systems.\n•\tInstalled and configured **medical devices** and **IP Networks** within healthcare facilities, including the setup of **electrical engineering** components and ensuring compliance with standards such as **HL7**, **DICOM**, and **PACS**.\n•\tExecuted **installation** and **configuration** of Windows environments including **Microsoft Windows 7**, **Microsoft Windows 10**, **Windows Server 2008**, and **Windows Server 2012**, facilitating reliable operation and user support.\n•\tConducted **training** sessions for healthcare staff on new systems such as **EMR** and **Mirth**, enhancing their operational efficiency and overall understanding of technology.\n•\tDeveloped and maintained **documentation** for all installations and configurations, ensuring clarity and consistency across the support team.\n•\tCollaborated with cross-functional teams to enhance product offerings and support systems, demonstrating outstanding **communication skills** and **interpersonal skills** with stakeholders.\n•\tIdentified and resolved issues in **medical devices** using a systematic **troubleshooting** approach, achieving a **95%** first-contact resolution rate.\n•\tManaged **IP Networks** to ensure secure and efficient data exchange, achieving a response time reduction of **30%** in network issues.\n•\tProvided **technical support** for a range of applications, reducing downtime incidents by **20%** through proactive maintenance and immediate response to critical issues.\n•\tFacilitated the integration of new technologies into existing healthcare infrastructures, coordinating efforts around installation timelines to ensure seamless transitions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Provided exceptional **customer service** and **technical support** for medical devices and IT infrastructures, ensuring customer satisfaction and operational efficiency across various healthcare settings.\nPerformed **installation** and **troubleshooting** of complex systems, including **Windows Server 2012** and **Windows 10**, addressing issues efficiently to maintain seamless operations for healthcare clients.\nExecuted **training sessions** for healthcare professionals on device usage and best practices, enhancing their skills in **PACS** and **EMR** systems, leading to a 95% user satisfaction rate.\nCollaborated with cross-functional teams to develop comprehensive **documentation** for system operations and troubleshooting, improving communication and workflows in service delivery.\nManaged and supported multiple **electrical engineering** projects involving **IP Networks** and **TCP/IP**, ensuring consistent feedback and streamlined communication with clients during service appointments.\nImplemented effective diagnostic procedures for **medical devices**, resulting in a reduction of downtime by **40%** across multiple sites while adhering to **HL7** standards.\nUtilized strong **interpersonal skills** to foster relationships with clients and provide tailored solutions to their technical issues, increasing retention rates by **25%** in the past year.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Provided exceptional customer service and **IT support** to clients by effectively troubleshooting technical issues related to **Microsoft Windows 7**, **Windows 10**, **Windows Server 2008**, and **Windows Server 2012** environments, enhancing user satisfaction and operational efficiency.\nConducted installations of **medical devices** and ensured seamless integration into existing healthcare systems, demonstrating proficiency in **IP Networks** and **TCP/IP** protocols to maintain connectivity.\nCollaborated with healthcare professionals to deploy, maintain, and support systems like **HL7**, **DICOM**, and **PACS**, ensuring compliance with healthcare regulations and standards.\nTrained users on the operation and maintenance of deployed medical devices, fostering strong interpersonal skills and a commitment to clear communication.\nProduced comprehensive documentation for installation processes, troubleshooting guides, and maintenance procedures, enhancing training efficiency and user knowledge retention.\nLeveraged advanced problem-solving skills in **EMR** integration and troubleshooting, facilitating smoother workflows across various clinical applications including **PAS** and **Mirth**.\nExecuted routine preventative maintenance and emergency repairs, achieving a **95%** first-time fix rate and minimizing device downtime for healthcare providers.\nMaintained accurate records of all service activities among **10+** clients, ensuring timely follow-up and adherence to service level agreements.\nDeveloped strong relationships with clients through excellent communication skills, resulting in a **20%** increase in customer satisfaction scores over six months."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tHL7, DICOM, PACS, PAS, EMR, Mirth\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Nginx\n\n**Other:**\n\tIT support, troubleshooting, customer service, installation, electrical engineering, medical devices, IP Networks, TCP/IP, Microsoft Windows 7, Microsoft Windows 10, Windows Server 2008, Windows Server 2012, communication skills, interpersonal skills, training, documentation"
}