{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior .Net Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior .NET Engineer with 13+ years of experience in developing high-performance applications, specifically within the healthcare and financial sectors. Proficient in **.NET**, **C#**, **ASP.NET**, and **T-SQL**, and skilled in **SQL Server** and **XML** for robust backend solutions. Strong understanding of **web services** and **3rd party integrations**, including **Salesforce**, **Oracle**, **SAP**, **PeopleSoft**, and **Siebel**. Experienced in ensuring compliance with industry standards while engaging in technical problem solving and performance tuning.\n\nDemonstrated ability in leveraging **JavaScript** for frontend development alongside frameworks like **React**, **Next.js**, and **Vue**. Background in deploying cloud-native applications on **AWS** and **Azure**, utilizing microservices and event-driven architectures. Proficient in building AI/ML-powered platforms with **Python** and **Flutter**, enabling automation and real-time analytics. Strong capabilities in unit testing and ensuring code quality. Excellent communication and analytical skills, established through years of cross-functional collaboration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior .Net Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Designed and developed robust web services and applications using **.NET** and **C#**, ensuring effective integration with **SQL Server** for seamless data management and retrieval.\n- Leveraged **ASP.Net** to create responsive user interfaces and smooth user experiences, improving engagement metrics by over **30%**.\n- Conducted performance tuning on applications and databases, enhancing overall performance efficiency by **25%** through strategic optimization techniques.\n- Created and maintained XML-based web services for secure data exchange and 3rd party integrations, successfully implementing **SAML** for improved authentication processes.\n- Collaborated with cross-functional teams to integrate **Salesforce**, **Oracle**, and **SAP** systems, leveraging EAI solutions for streamlined communication and data flow.\n- Led unit testing initiatives using **T-SQL** and automated testing tools to ensure high-quality deliverables, achieving a **90%** test coverage rate.\n- Developed and implemented comprehensive troubleshooting strategies, utilizing strong analytical and technical problem-solving skills to address complex issues effectively.\n- Prepared documentation and communicated technical concepts clearly to non-technical stakeholders, improving cross-team collaboration and understanding of project goals.\n- Engaged in performance analysis and regular updates to internal systems such as **PeopleSoft** and **Siebel**, driving continuous improvement and user satisfaction through agile methodologies.\n- Mentored junior developers on best practices in **JavaScript**, **HTML**, and **performance tuning**, fostering a culture of knowledge sharing and professional growth."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **.NET** technology stack, specifically **C#** and **ASP.Net**, to develop high-performance web services that streamline financial transactions by integrating with existing systems.\nUtilized **SQL Server** and **T-SQL** to optimize database queries, achieving a **30%** reduction in response times for financial data retrieval.\nImplemented solutions for **3rd party integrations** and **EAI**, enhancing system interoperability and data exchange across platforms including Salesforce and SAP.\nConducted **unit testing** to ensure code quality and adherence to standards, resulting in an **80%** reduction of bugs in production environments.\nApplied strong **analytical skills** to troubleshoot and resolve technical challenges during deployment, ensuring seamless functionality of applications under heavy workloads.\nCreated and maintained documentation for applications using **XML**, enabling easier onboarding for new developers and facilitating communication among teams.\nDeveloped user-friendly interfaces with JavaScript and HTML, enhancing user engagement and experience in financial applications.\nFocused on **performance tuning** through regular audits and code reviews, improving system performance by **25%**.\nCollaborated with cross-functional teams to gather requirements and refine product features, demonstrating strong **communication skills** throughout the development lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **.NET** framework and **C#** for designing robust backend services tailored for enterprise applications, ensuring high availability, maintainability, and scalability based on a microservices architecture.\nLeveraged **SQL Server** and **T-SQL** for data management, executing complex queries and optimizing performance of high-traffic transactional systems, leading to a **30%** increase in processing speed for data retrieval tasks.\nImplemented web services and **XML** for seamless third-party integrations, enhancing application functionality with external systems such as **Salesforce** and **SAP**, resulting in improved data exchange rates by **25%**.\nDeveloped web applications using **ASP.Net** and **JavaScript**, focusing on creating responsive user interfaces powered by **HTML** and modern front-end libraries, significantly improving user engagement and satisfaction metrics.\nApplied advanced **EAI** strategies to facilitate communication between disparate systems, employing protocols such as **SAML** for secure and compliant user authentication.\nExecuted comprehensive unit testing and performance tuning processes, achieving a **15%** reduction in application load times and ensuring code integrity through robust testing methodologies.\nDemonstrated strong technical problem-solving abilities, resolving complex integration challenges, and enhancing system reliability through proactive maintenance and issue resolution strategies.\nCultivated effective communication and analytical skills by collaborating cross-functionally with stakeholders, facilitating requirement gathering, and conducting code reviews to ensure alignment with business objectives.\nMentored junior developers on best practices in software development and provided guidance on technical complexities, contributing to a **50%** reduction in onboarding time for new team members."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, .NET, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tASP.Net, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML\n\n **API Technologies:**\n\tWeb services, SAML, 3rd party integrations\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, SQL Server, Oracle\n\n **DevOps:**\n\tDocker, Kubernetes, Terraform, Ansible, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, performance tuning, unit testing, communication skills, analytical skills, technical problem solving, Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Redis, Salesforce, SAP, PeopleSoft, Siebel, EAI",
  "apply_company": "Cornerstone OnDemand"
}