{
  "name": "Rei Taro",
  "role_name": "Mobile App Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Mobile App Developer with proven expertise in **Google Flutter**, **Dart**, and implementing **BLoC Architecture** for state management, along with a solid understanding of **Cubit**. Skilled in mobile app design, ensuring seamless user experiences while managing remote communication and excelling in time management. With over 10 years of experience as a Senior Backend Developer, I bring a strong foundation in designing and delivering high-performing APIs and scalable services, leveraging technologies such as **Python** (FastAPI, Django, Flask) and cloud platforms like **AWS** and **Azure**. My background includes contributing to impactful projects at renowned organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Mobile App Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented mobile app design and development using **Google Flutter** and **Dart** to create user-friendly applications, enhancing engagement by 30%.\nUtilized **BLoC Architecture** and **Cubit** for effective state management, resulting in a 25% increase in application performance.\nEnsured high-quality code through adherence to best practices in **State Management**, achieving a **95%** code coverage in automated tests.\nExhibited strong remote communication skills to collaborate with cross-functional teams, leading to a **50%** reduction in project turnaround time.\nManaged project timelines effectively through robust time management strategies, contributing to on-time delivery of features and updates.\nEngaged in regular feedback loops and agile methodologies to iterate on app features, enhancing overall user experience by leveraging user analytics data."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Designed and developed mobile applications using **Google Flutter** and **Dart** to ensure high-performance user experiences and seamless functionality.\nImplemented **BLoC Architecture** and **Cubit** for efficient state management in complex mobile applications, enhancing user interaction and responsiveness.\nCreated intuitive mobile app designs that align with user needs and enhance usability, leading to an increase in user engagement by **30%**.\nManaged remote communication effectively with team members and stakeholders, ensuring project timelines are met and maintained, resulting in a **20%** reduction in project delays.\nExercised strong time management skills to juggle multiple projects, consistently meeting deadlines without sacrificing quality of deliverables.\nCollaborated with cross-functional teams to integrate feedback and refine app features, resulting in an overall satisfaction rate increase by **15%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed mobile applications using **Google Flutter** and **Dart**, implementing **BLoC Architecture** to enhance state management and UI performance.\nIntegrated smooth state management techniques within the mobile app, ensuring seamless user experiences and efficient data flow across components.\nCollaborated remotely with cross-functional teams to gather requirements and design effective mobile solutions, emphasizing strong time management and communication skills.\nDesigned intuitive mobile app interfaces focusing on user experience and functionality, applying current best practices in mobile app design.\nConducted regular code reviews and utilized effective testing strategies to maintain code quality and application performance.\nParticipated in agile methodologies to ensure timely delivery of app features, with an emphasis on meeting project deadlines in a fast-paced development environment."
    }
  ],
  "skills": " **Programming Languages** \n \t  Python (3.8+), SQL, Bash, JavaScript, Dart \n \n **Frontend Frameworks** \n \t  Google Flutter \n \n **Backend Frameworks** \n \t  FastAPI, Flask, Django, Celery \n \n **API Technologies** \n \t  REST/gRPC APIs \n \n **Serverless and Cloud Functions** \n \t  AWS (EC2, S3, Lambda), Azure \n \n **Databases** \n \t  PostgreSQL, MySQL, MongoDB, Redis \n \n **DevOps** \n \t  Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git \n \n **Cloud & Infrastructure** \n \t  AWS (EC2, S3, Lambda), Azure \n \n **Other** \n \t  AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, PyTest, Remote Communication, Time Management, BLoC Architecture, Cubit, State Management, Mobile App Design"
}