{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As a results-driven Senior Software Engineer with 8 years of comprehensive experience, I excel in backend development, cloud platforms, and CI/CD pipelines. My technical expertise includes working with **GoLang**, **Kubernetes**, and **AWS**, along with proficiency in **Azure** and **GCP**. I bring a strong focus on optimizing distributed systems and performance tuning, ensuring the delivery of high-quality solutions. With hands-on experience in database management using **PostgreSQL** and implementing cloud object storage solutions, I am well-prepared to tackle complex engineering challenges.\nAdditionally, I specialize in building robust applications utilizing modern technologies including **React**, **Node.js**, and **FastAPI**. My background encompasses deep involvement in DevOps practices, leveraging tools such as **GitLab CI**, **ArgoCD**, **Prometheus**, **Grafana**, and **gRPC** for system monitoring and debugging. I thrive in collaborative environments and maintain a startup mindset, continuously honing my problem-solving skills to drive innovation and efficiency in product development.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **GoLang** for backend development to architect and build scalable distributed systems, enhancing system performance and reliability.\nImplemented **Kubernetes** for orchestrating containerized applications, ensuring seamless deployment and high availability across cloud platforms like **AWS**, **GCP**, and **Azure**.\nDeveloped and optimized cloud-native data storage solutions using **PostgreSQL** and **Cloud Object Storage**, focusing on performance tuning for high-volume transaction processing.\nEstablished CI/CD pipelines using **GitLab CI** and **ArgoCD** to automate deployment processes, incorporating linting, testing, security scans, and multi-environment deployments.\nIntegrated **GCP Pub/Sub** for real-time messaging and data streaming across microservices, ensuring efficient data handling and responsiveness in applications.\nMonitored performance metrics and system health using **Prometheus**, **Grafana**, **Loki**, and **Tempo**, driving insights to optimize system operations and troubleshoot issues effectively.\nLeveraged **gRPC** and **REST** for building robust API interfaces that facilitate seamless communication between services, enhancing the overall architecture.\nFostered team collaboration and a startup mindset by promoting agile practices, iterative development, and proactive problem-solving within the engineering team.\nTransformed monolithic applications into microservices architectures, utilizing techniques that improve debugging and optimization practices.\nDesigned comprehensive test strategies encompassing unit, integration, E2E, and contract testing to ensure the quality and performance of backend services."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **GoLang** for backend development to build and enhance distributed systems that improve performance and scalability across financial platforms.\nImplemented CI/CD pipelines using **GitLab CI** and **ArgoCD**, reducing deployment times by **30%** and increasing release frequency to **weekly**.\nDesigned and maintained cloud-native applications on **AWS**, **GCP**, and **Azure**, ensuring optimal utilization of cloud resources while achieving cost savings of **15%**.\nDeveloped event-driven architecture with **GCP Pub/Sub** alongside **gRPC** and **REST** APIs, facilitating real-time communication and processing for financial data.\nUtilized **PostgreSQL** for efficient data storage and retrieval, optimizing query times and resulting in **25%** faster data access for analytics applications.\nMonitored system performance using **Prometheus**, **Grafana**, and **Loki**, implementing performance-tuning strategies that improved resource utilization by **20%**.\nCollaborated with cross-functional teams, fostering a startup mindset to solve complex problems efficiently and enhance team collaboration on product development.\nExecuted debugging optimization strategies that reduced issue resolution time by **40%**, significantly improving system reliability.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Engineered backend services using **GoLang** for high-performance applications, focusing on **distributed systems** and **backend development**, achieving an average response time improvement of **30%** across key platform features.\nImplemented **Kubernetes** for scalable container orchestration and efficient resource management, leading to a **40%** reduction in deployment time and enhanced uptime for services.\nLed integrations with **AWS**, **GCP**, and **Azure** for cloud platforms, ensuring redundancy and **high availability** with a measurable **99.9% uptime**.\nDeveloped and optimized database solutions with **PostgreSQL**, finding inefficiencies that resulted in query performance improvements of **50%** through better indexing and optimization strategies.\nPrepared CI/CD pipelines with **GitLab CI** and **ArgoCD** for seamless deployment and version control, driving a **60%** increase in deployment frequency through automated testing and monitoring.\nUtilized **GCP Pub/Sub** for event-driven architecture, enabling real-time data processing and reducing latency in data handling by **25%**.\nCreated observability tools using **Prometheus**, **Grafana**, and **Loki**, establishing real-time monitoring dashboards that resulted in quicker debugging and **40%** faster incident response.\nOptimized microservices communication using **gRPC** and **REST APIs**, reducing overhead and improving data transfer efficiency, supporting the scaling of services during peak traffic.\nEmphasized performance tuning and optimization techniques for backend systems, leading to enhanced system reliability and a reduction in resource consumption by **20%**.\nFostered a **team collaboration** environment with a **startup mindset**, driving innovative problem-solving practices and mentoring junior engineers to enhance skill development and project outcomes."
    }
  ],
  "skills": "Programming Languages:\n\tGoLang, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tgRPC, REST\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure, GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, ArgoCD, Terraform, Ansible, Helm, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), GCP, Cloud Object Storage\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Prometheus, Grafana, Loki, Tempo, debugging, optimization, performance-tuning, distributed systems, backend development, startup mindset, problem-solving mindset, team collaboration"
}