{
  "name": "Rei Taro",
  "role_name": "Core Engine/C++ Optimization Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Core Engine/C++ Optimization Engineer with over 10 years of experience specializing in **C++**, **multithreading**, and performance optimization. Proficient in using **VTune**, console profiling tools, and crash dump analysis for both CPU and GPU, delivering high-quality solutions for AAA titles across console platforms. Skilled in **Unreal Engine** to enhance engine performance and optimize game mechanics. Additionally, possess a solid background in backend development with expertise in designing and delivering systems for financial platforms, and AI/ML pipelines, utilizing a tech stack that includes **Python (FastAPI, Django, Flask)** and cloud services like **AWS** and **Azure**. Proven ability to contribute to high-impact projects at prestigious organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Core Engine/C++ Optimization Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **C++** to optimize backend services and enhance performance for AAA titles in game development.\nImplemented **multithreading** techniques to improve application responsiveness and efficiency across **console platforms**.\nConducted system **profiling** using tools such as **VTune** and console profiling tools to identify and eliminate performance bottlenecks by **30%**.\nDeveloped advanced algorithms for **CPU/GPU crash dump analysis** to troubleshoot and resolve critical issues, reducing crash rates by **25%**.\nCollaborated with cross-functional teams to integrate feedback loops into development processes and ensure alignment with project goals and timelines.\nEmployed optimization strategies that streamlined resource usage across game engines, resulting in improved load times by an average of **15 seconds**.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Optimized backend systems by applying multithreading techniques in **C++** to enhance performance and streamline processing for AAA titles.\nConducted profiling studies using **VTune** and console profiling tools to identify bottlenecks, achieving performance improvements of up to **30%**.\nEngineered and optimized high-performance systems in collaboration with Unreal Engine to ensure seamless integration on console platforms.\nAnalyzed CPU/GPU crash dumps to diagnose and resolve critical performance issues, reducing game load times by **20%**.\nImplemented advanced optimization strategies to improve memory management and processing speed in game engine components.\nConducted rigorous testing and validation to support the release of **3 major updates** to enhance overall game performance and user experience."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **C++** for developing high-performance backend systems in AAA titles, ensuring efficient trade execution and account management functionalities.\nEmployed **multithreading** techniques to optimize data processing, resulting in enhanced performance and responsiveness of trading operations.\nConducted **profiling** and optimization analysis using **VTune** and other console profiling tools, improving system efficiency by **30%**.\nCollaborated effectively with cross-functional teams to ensure seamless data integration and interaction, improving user experience across console platforms.\nDeveloped and maintained comprehensive test suites, including **mock servers**, ensuring robust QA processes and adherence to stringent performance benchmarks.\nApplied advanced optimization strategies to manage CPU/GPU crash dump analysis, enhancing the reliability of the trading platform while meeting **30%** reduction in latency.\nImplemented efficient job queuing and scheduling solutions to streamline backend task execution, using **Celery** and **RabbitMQ**, resulting in improved resource management."
    }
  ],
  "skills": " **Programming Languages**\n\t C++, Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t \n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure**\n\t \n\n **Other**\n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, multithreading, optimization, profiling, VTune, console profiling tools, AAA titles, console platforms, CPU/GPU crash dump analysis"
}