{
  "name": "Tomasz Lee",
  "role_name": "Senior Solr Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Solr Engineer with 9+ years of experience in designing and implementing search solutions utilizing **Apache Solr**, **Elasticsearch**, and **Opensearch**. Proficient in **Java**, **Kotlin**, and **SpringBoot** for building robust backend systems. Experienced with **NoSQL** databases such as **MongoDB** and knowledgeable in **Docker** for containerization. Strong understanding of Agile methodologies, with a proven track record of delivering high-impact projects on time while fostering teamwork and enhancing communication among cross-functional teams. Original strengths include adeptness at streamlining development processes, optimizing application performance, and problem-solving in high-pressure environments.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Solr Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed high-performance search solutions utilizing **Elasticsearch** and **Apache Solr**, enhancing search capabilities by 30%.\nDesigned and implemented microservices utilizing **SpringBoot** and **Java**, promoting system modularity and enhancing maintainability.\nApplied knowledge of **Docker** for containerization, streamlining development to production workflows by 50%.\nCollaborated within an **Agile** framework ensuring effective teamwork and enhancing project delivery speed by 25%.\nLed the integration of **AWS** components for scalable cloud solutions, achieving 99.9% uptime.\nUtilized **MongoDB** as a **NoSQL** database to support application data storage needs, improving data retrieval speeds by 40%.\nExecuted thorough testing and debugging processes to resolve software issues, demonstrating strong problem-solving skills and improving system efficiency.\nCommunicated effectively with cross-functional teams to define project requirements and update progress, fostering a collaborative environment.\nMentored junior developers in best practices for coding and project management, enhancing team skillsets.\nImplemented security measures, including JWT-based authentication, safeguarding sensitive application data."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **Apache Solr** for powerful search capabilities, enhancing data retrieval efficiency by **40%**.\nDesigned and implemented applications using **Elasticsearch** and **OpenSearch**, allowing for real-time search and analytics on large datasets.\nDeveloped microservices with **SpringBoot** to manage and process data efficiently, achieving a **20%** reduction in system response times.\nUtilized **Java** and **Kotlin** to build robust backend services, contributing to a **30%** increase in application reliability.\nIntegrated **MongoDB** for seamless data storage in a NoSQL environment, improving data access speeds significantly.\nWorked with **AWS** for cloud management, ensuring high availability and scalability of deployed applications.\nImplemented containerization using **Docker** for application deployment, resulting in a **35%** improvement in environment consistency across projects.\nAdopted **Agile** methodologies to streamline project workflows, enhancing team productivity and collaboration.\nEngaged in strong **communication** with cross-functional teams to gather requirements and deliver projects on time.\nLed workshops on problem-solving techniques to foster a culture of innovation and teamwork within the engineering team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Apache Solr** and **Elasticsearch** to optimize search functionalities, resulting in a **30%** increase in search performance and relevance.\nImplemented **NoSQL** solutions with **MongoDB** to support flexible data storage and retrieval, enhancing scalability for large datasets.\nDeveloped backend services using **Java** and **SpringBoot** frameworks, maintaining adherence to **Agile** methodologies for iterative project delivery.\nCollaborated with cross-functional teams to define project scope and implement solutions that effectively addressed user requirements, demonstrating strong **communication** and **teamwork** skills.\nLeveraged **Docker** for containerization of applications, facilitating seamless deployment and environment consistency, achieving a **40%** reduction in deployment time.\nConducted troubleshooting and debugging processes to resolve issues promptly, showcasing strong **problem-solving** abilities.\nParticipated in code reviews and technical discussions to enforce coding standards and ensure high-quality deliverables.\nProduced comprehensive technical documentation for internal use, improving **knowledge transfer** among team members and project stakeholders.\nEngaged in continuous learning and development of new skills related to **Kotlin**, **Laravel**, and **Rails** to enhance expertise and adaptability to upcoming projects."
    }
  ],
  "skills": "Programming Languages: Java, Kotlin, Python, JavaScript, TypeScript\n\n\tBackend Frameworks: SpringBoot, Rails, Laravel, NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n\tFrontend Frameworks: ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n\tAPI Technologies: RESTful API, GraphQL\n\n\tServerless and Cloud Functions: AWS, Azure, Docker\n\n\tDatabases: Apache Solr, Elasticsearch, Opensearch, MongoDB, MSSQL Server, MySQL, PostgreSQL, DynamoDB, CosmosDB, NoSQL\n\n\tDevOps: CI/CD pipelines, Agile, Teamwork, Communication, Problem-solving\n\n\tCloud & Infrastructure: AWS\n\n\tOther: Git, GitHub, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis",
  "apply_company": "Breuninger"
}