{
  "name": "Tomasz Lee",
  "role_name": "Senior Solutions Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled in API integration, with extensive experience in REST and SOAP protocols, OAuth authentication, and using tools such as Postman, Swagger, and OpenAPI for testing and documentation. Proficient in cloud services including **AWS**, **Azure**, and **GCP**. A seasoned developer with 9+ years of experience in designing and implementing complex applications using **.NET**, **C#**, **ReactJS**, **NextJS**, **JavaScript**, and **Node.js**. Background in consumer engagement and data platforms, along with expertise in microservices architecture and distributed systems utilizing technologies like **Apache Kafka**, **RabbitMQ**, and **Redis**. Proven track record of leading development projects, optimizing performance, and successfully collaborating across teams to achieve business objectives.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and integrated **RESTful APIs** using **.NET 7** to ensure seamless communication between services, leveraging **Swagger** for documentation and **Postman** for testing.\n• Utilized **OAuth** for secure authentication, enhancing application security and user trust.\n• Managed and optimized **MSSQL** database queries, achieving a **20%** reduction in average execution time and improving data handling efficiency.\n• Spearheaded the implementation of a microservices architecture with **.NET Core**, enhancing system scalability and maintainability.\n• Designed and developed an innovative customer management platform using **ReactJS** and **Next.js**, leading to a **25%** increase in user satisfaction.\n• Integrated **Apache Kafka** and **RabbitMQ** to streamline real-time data streaming and task queuing processes, significantly enhancing system resilience and throughput.\n• Implemented continuous integration and delivery (CI/CD) pipelines using **Azure DevOps**, which decreased deployment time by **40%**.\n• Enhanced system performance through the use of **Redis** for caching, reducing database load and improving response times by **35%**.\n• Developed a reporting engine utilizing **D3.js** and **Three.js** for interactive data visualization, enriching the user experience.\n• Collaborated with UX/UI designers to improve the interface and overall user engagement, ensuring optimal customer interaction.\n• Engaged with cross-functional teams to communicate project progress and gather requirements for effective project management."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and integrated **RESTful APIs** for seamless communication between services, ensuring compliance with **OpenAPI** specifications and enhancing system interoperability.\n• Utilized **Postman** for robust API testing and validation, contributing to a **30% reduction** in post-deployment errors.\n• Implemented **OAuth** for secure third-party integrations, reinforcing data protection and user privacy in all applications.\n• Designed a cloud-scale architecture on **AWS**, **Azure**, and **GCP** to ensure high availability and resilience of enterprise solutions, leading to a **15% increase** in uptime.\n• Employed **Python** and **Node.js** for backend development, optimizing the performance of server-side logic and data processing.\n• Led project management initiatives to align development timelines with stakeholder expectations, improving delivery adherence by **25%**.\n• Enhanced consumer engagement through the utilization of **Consumer Data Platforms** and **Commerce Stacks**, driving user interaction and satisfaction.\n• Streamlined workflows with integration tools like **Workato**, **Mulesoft**, and **Zapier**, facilitating automated data flow across various platforms.\n• Communicated complex technical concepts clearly to both technical and non-technical stakeholders, fostering collaboration and understanding.\n• Mentored junior developers, conducted code reviews, and promoted best practices to elevate the team's overall productivity and code quality."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and integrated APIs utilizing **REST** and **SOAP** protocols to ensure seamless communication with external systems, enhancing service interoperability by **30%**.\n• Employed **OAuth** for secure authentication, safeguarding user data and improving security measures across ALL platforms.\n• Leveraged **Azure** and **AWS** cloud services for scalable infrastructure, resulting in a **40%** reduction in operational costs through optimized resource allocation.\n• Executed API testing and documentation utilizing **Postman**, **Swagger**, and **OpenAPI** standards, improving the onboarding process for new developers and ensuring consistent API performance.\n• Designed integrations with automation platforms such as **Workato**, **Mulesoft**, and **Zapier**, streamlining workflows and reducing manual data entry by **25%**.\n• Collaborated with project management tools to track and communicate project progress, ensuring alignment with stakeholders and timely delivery of project milestones.\n• Implemented customer engagement strategies on both the frontend and backend using **JavaScript**, **Python**, and **Node.js**, enhancing the user experience and driving engagement metrics up by **15%**.\n• Actively participated in cross-functional team meetings to promote effective communication and project alignment, showcasing leadership and strategic thinking skills for project success.\n• Contributed to the development of a robust internal CRM system using **.NET Framework** and **Angular**, leading to a sales productivity increase of **20%**.\n• Assisted in migrations of legacy systems from **ASP.NET WebForms** to **.NET Core**, improving overall performance and maintainability of existing applications."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, TypeScript, Python, C#, Java\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tREST, SOAP, OAuth, Postman, Swagger, OpenAPI, RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, GCP\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tUX/UI Design, Git, GitHub, Redux, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Microservices, Commerce Stacks, Consumer Data Platforms, Consumer Engagement Platforms, project management, communication",
  "apply_company": "Talon.One"
}