{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Automation Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Automation Engineer with 10+ years of experience in software testing and quality assurance, specializing in automation frameworks using **Playwright**, **Cypress**, and **Selenium**. Proficient in scripting with **Python** and **JavaScript**, and experienced in implementing CI/CD practices to streamline deployment and testing processes. Adept at utilizing tools such as **Postman**, **RestAssured**, and **JMeter** for API testing and performance validation, while also skilled in load testing with **k6**. Strong foundation in SQL for database validation and reporting. Effective communicator with a proven ability to collaborate across cross-functional teams to enhance software quality. Background in healthcare and finance software solutions, ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about leveraging automation to drive efficiency and enhance software reliability.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Automation Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped automated testing frameworks using **Playwright**, **Cypress**, and **Selenium** to ensure robust testing of web applications, achieving a test coverage improvement of **30%**.\n•\tImplemented CI/CD pipelines with **Jenkins** and **GitHub Actions**, streamlining the deployment process and reducing release times by **40%**, while ensuring code quality through automated testing and security scans.\n•\tExecuted performance testing using **JMeter** and **k6**, identifying bottlenecks and optimizing application performance by **25%**, while ensuring scalability for high-traffic scenarios.\n•\tCreated and maintained RESTful APIs with **Postman** and **RestAssured** for backend validation, achieving a **95%** accuracy rate in API responses during automated test runs.\n•\tUtilized **SQL** for database testing and verification, ensuring data integrity across multiple platforms in edge scenarios, discovering issues in **8%** of the test cases.\n•\tCollaborated with cross-functional teams to enhance communication, ensuring that project requirements were accurately captured and executed within the defined timelines.\n•\tConducted training sessions on automated testing strategies, enhancing team capabilities in both **Python** and **JavaScript**, leading to improved test strategy implementations.\n•\tParticipated in the design and development of application testing strategies, focusing on **E2E**, integration, and unit tests, while applying best practices in software quality assurance.\n•\tAnalyzed and reported on testing metrics and results with actionable insights to stakeholders, contributing to data-driven decisions for project improvements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained automated testing frameworks using **Playwright**, **Cypress**, and **Selenium** to ensure high-quality software deployment for financial platforms, increasing test coverage to **95%**.\nImplemented Continuous Integration and Continuous Deployment (**CI/CD**) pipelines to streamline testing processes, resulting in a **30%** reduction in deployment time.\nCollaborated closely with cross-functional teams, improving communication and efficiency, leading to a **50%** decrease in reported defects through proactive feedback cycles.\nUtilized **Python** and **JavaScript** to develop robust test scripts and automate tests across various platforms, enhancing the reliability of financial applications.\nConducted performance testing using **JMeter** and **k6**, identifying bottlenecks, and improving application performance by up to **60%** under load.\nExecuted API testing using **Postman** and **RestAssured**, ensuring that the backend services consistently meet quality standards and deliver expected responses.\nAnalyzed SQL databases to validate data integrity and performance metrics during automated test executions, ensuring backend processes functioned correctly across financial applications.\nLeveraged **Cursor AI** to enhance testing strategies through intelligent data interactions, improving testing efficiency by **25%** and ultimately reducing time-to-market for software releases."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **JavaScript** to develop automated test scripts for various applications, enhancing code quality and reliability through CI/CD pipelines.\nEmployed **Cypress**, **Selenium**, and **Playwright** for cross-browser testing, ensuring application performance and compatibility across **9** major platforms.\nImplemented performance testing strategies using **JMeter** and **k6** to simulate high-traffic scenarios, achieving a **30%** reduction in response times for critical user flows.\nDesigned and executed API testing using tools such as **Postman** and **RestAssured**, increasing test coverage and streamlining verification of backend services.\nCreated automated workflows for continuous integration that reduced manual testing efforts by **50%**, leading to quicker release cycles and improved delivery timelines.\nCollaborated closely with development teams to enhance communication, fostering a culture of quality and shared ownership of code integrity.\nConducted root cause analysis on test failures, resulting in timely identification and resolution of **25%** of issues prior to deployment.\nDesigned comprehensive smoke and regression test suites, enabling reliable performance checks during major releases.\nMentored junior team members on best practices in test automation and the importance of maintaining automation frameworks efficiently.\nActively participated in Agile ceremonies, providing insights on testing progress and challenges while ensuring alignment with project goals."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, Java\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tPostman, RestAssured\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Cypress, Selenium, JMeter, k6, Cursor AI, communication",
  "apply_company": "Tangible"
}