{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dedicated Senior QA Engineer with 13+ years of experience in delivering high-performance applications, specializing in **JavaScript**, **TypeScript**, **React**, and **Node.js**. Proficient in **CI/CD** practices and skilled in automation, leveraging tools such as **Playwright** for effective testing frameworks. Expertise in code reviews and defect tracking, ensuring high-quality deliverables aligned with agile methodologies.\nProven track record in developing and implementing robust testing strategies that enhance product reliability, specifically within the healthcare and financial sectors. Adept at integrating continuous testing within the development lifecycle, driving improvements in efficiency and quality results.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented automated testing solutions using **Playwright** to ensure high-quality deliverables across web applications built with **JavaScript**, **TypeScript**, and **React**.\nDesigned and maintained CI/CD pipelines leveraging **GitHub Actions** and **CircleCI**, streamlining deployment processes and reducing release times by **30%**.\nConducted thorough code reviews and defect tracking to improve code quality and identify issues early in the development cycle, leading to a **25%** decrease in production defects.\nDeveloped and executed comprehensive test strategies utilizing **automation** tools and **test frameworks** to guarantee robust coverage for new features and bug fixes within an Agile environment.\nCollaborated closely with cross-functional teams to ensure user stories were translated into functional tests, encompassing both unit and integration test scenarios.\nEnhanced testing processes by integrating performance and load testing, reducing page load times by **40%** and improving user experience metrics.\nProvided mentorship and training to junior QA engineers, fostering an environment of continuous improvement and knowledge sharing across the team.\nReported QA metrics and test results to stakeholders, facilitating transparency and actionable insights for enhancing software quality.\nUtilized defect tracking tools to manage and prioritize issues effectively, ensuring timely resolution and stakeholder communication."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented and maintained automated testing frameworks using **Playwright** and **JavaScript**, enhancing the efficiency of regression testing and improving overall software quality for high-volume applications.\nCollaborated closely with development teams to ensure robust CI/CD pipelines utilizing **Node.js** and **TypeScript**, streamlining deployment processes and reducing release times by **30%**.\nConducted thorough code reviews and defect tracking, contributing to a **20%** reduction in post-release defects and fostering an agile development environment.\nDeveloped test strategies for front-end applications built with **React (18)**, ensuring comprehensive test coverage, and improving user interface reliability through detailed and structured testing methodologies.\nExecuted manual and automated test cases in a fast-paced, agile environment, achieving an automation coverage benchmark of over **75%** across projects.\nIntroduced automation workflows that reduced testing cycles by **40%**, allowing for quicker feedback loops and enhanced productivity across cross-functional teams.\nParticipated in sprint planning and retrospective meetings, collaborating with cross-disciplinary teams, which resulted in an average sprint velocity increase of **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented automated testing frameworks using **Playwright** and **JavaScript** to enhance the quality assurance process for e-commerce applications, achieving a **30%** reduction in manual testing hours.\nDeveloped and maintained CI/CD pipelines to streamline deployment processes, ensuring smooth integration and delivery across multiple environments while adhering to **agile** methodologies.\nExecuted comprehensive code reviews to uphold code quality standards, utilizing **TypeScript** for type safety and maintainability in testing scripts.\nUtilized defect tracking systems to monitor, report, and resolve issues with a focus on continuous improvement of processes, reducing defect rates by **25%** over **6 months**.\nCollaborated with cross-functional teams to ensure alignment on requirements and deliverables, enhancing communication and productivity in an **agile** work environment.\nDesigned and conducted performance tests using **Node.js** to assess system capabilities, ensuring scalability and high performance under load.\nImproved test coverage by integrating unit and end-to-end tests in **React** applications, leading to early detection of bugs and reduced regression issues.\nAutomated regression testing and created reusable test scripts, contributing to a consistent testing environment that facilitates faster feedback loops during development cycles.\nEngaged in continuous learning and adaptation of new testing technologies, leveraging emerging practices in **automation** and **test frameworks** to optimize testing efficiency.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript\n\n **Backend Frameworks:**\n\tPython: FastAPI, Flask, Django\n\tNode.js\n\n **Frontend Frameworks:**\n\tReact\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\tautomation, test framework, code review, defect tracking, agile, Playwright",
  "apply_company": "lemlist"
}