{
  "name": "Tomasz Lee",
  "role_name": "Principal Solutions Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Accomplished Principal Solutions Engineer with 9+ years of experience in API integrations, leveraging REST, SOAP, and OAuth protocols to deliver seamless connectivity across systems. Highly proficient in data exchange formats such as JSON and XML, utilizing tools like **Postman** and **Swagger** for effective API documentation and testing. Demonstrated expertise in cloud services including **AWS**, **Azure**, and **GCP**, ensuring scalable and reliable solutions. Adept in **Commerce Stacks** and **Consumer Data Platforms**, enhancing consumer engagement through effective strategies. Specialized in **Python**, **JavaScript**, **Node.js**, and **Java**, merging frontend and backend technologies to create interoperable applications. Strong background in **microservices architecture** and distributed systems, with practical experience in **Apache Kafka**, **RabbitMQ**, and **Redis**. Proven ability to lead cross-functional teams, manage projects efficiently, and communicate technical concepts clearly, driving successful project outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Principal Solutions Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Designed and developed multi-platform **API integrations** with a focus on **REST** and **SOAP** protocols, enhancing interoperability and efficiency across services.\n• Created detailed **JSON** and **XML** data structures for seamless data communication, supporting robust client-server interactions.\n• Spearheaded the development of RESTful APIs with **.NET 7**, achieving a 25% increase in user satisfaction through streamlined data access.\n• Integrated **Postman** and **Swagger** for comprehensive API documentation and testing, significantly improving workflow and team collaboration.\n• Led the implementation of JWT-based authentication and authorization, ensuring secure access and compliance for the applications.\n• Executed project management strategies to successfully coordinate the development and deployment of solutions across various platforms including **AWS**, **Azure**, and **GCP**.\n• Developed a web-based customer management platform utilizing **ReactJS**, **Next.js**, and **Node.js**, which drove an increase in user engagement by 25%.\n• Employed a microservices architecture using **.NET Core** to enhance system scalability and maintainability.\n• Integrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for asynchronous task processing, improving system resilience and throughput.\n• Utilized **Redis** for caching strategies, reducing database load and achieving a 35% improvement in response times.\n• Optimized **MSSQL** database queries and indexing, resulting in a 20% reduction in average query execution time.\n• Collaborated with UX/UI designers to refine the platform’s interface, enhancing overall user experience.\n• Developed a reporting engine using **D3.js** and **Three.js** for creating interactive data visualizations, providing users with analytical insights.\n• Implemented CI/CD pipelines on **Azure DevOps**, effectively reducing deployment time by 40%."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "- Executed **API integrations** using **REST** and **SOAP** protocols, ensuring seamless data exchange and functionality across multiple platforms.\n- Designed and developed cloud-based solutions utilizing **AWS**, enhancing project management capabilities and improving team collaboration efficiency by **15%**.\n- Leveraged **Node.js** and **Python** for backend development, creating robust microservices architectures with technologies like **RabbitMQ** and **Apache Kafka** for scalable task orchestration and event-driven data handling.\n- Integrated **PostgreSQL** and **MySQL** databases for efficient data retrieval and management, optimizing queries to improve performance metrics by **25%**.\n- Enhanced user experience by building interactive front-end components using **ReactJS** and **Tailwind CSS**, leading to a **25%** increase in user engagement on the platform.\n- Developed and managed **RESTful APIs**, ensuring well-documented interfaces through **Swagger** and **Postman**, and enabling real-time data access.\n- Implemented CI/CD pipelines with **GitHub Actions**, successfully reducing production deployment errors by **30%** and streamlining workflow.\n- Created interactive data visualizations with **D3.js** for project tracking and reporting, facilitating clearer communication with stakeholders.\n- Fostered team productivity by conducting thorough code reviews and mentorship sessions for junior developers, promoting growth and best practices within the team.\n- Collaborated with stakeholders to define system requirements and development timelines, ensuring projects are delivered on time and meet client expectations."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and integrated **API integrations** using **REST** and **SOAP**, streamlining communication between our internal CRM system and external platforms, improving data accuracy by **30%**.\n• Designed authentication mechanisms leveraging **OAuth** for secure access, ensuring compliance with industry standards.\n• Utilized frameworks like **Postman** and **Swagger** for API documentation and testing, enhancing developer collaboration.\n• Migrated existing code to **Node.js** and integrated **JSON** and **XML** for improved data handling in **AWS** cloud environments.\n• Led the implementation of **Azure** for deployment automation and continuous integration, reducing deployment time by **50%**.\n• Engaged with **Consumer Engagement Platforms** to optimize user experience based on consumer data, resulting in **15%** higher user retention.\n• Contributed to cross-functional project management teams, facilitating communication between stakeholders and technical teams to meet project milestones.\n• Delivered technical documentation and user guides for system features to streamline knowledge transfer and support onboarding of new team members.\n• Actively participated in code reviews and daily standups to uphold coding standards and promote best practices across the development team."
    }
  ],
  "skills": "API Technologies: REST, SOAP, OAuth, API integrations, JSON, XML, Postman, Swagger, Workato, Mulesoft, Zapier\n\n**Programming Languages:** JavaScript, Python, TypeScript, Java\n\n**Frontend Frameworks:** ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks:** NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Databases:** MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & Infrastructure:** AWS, Azure, GCP\n\n**DevOps:** CI/CD pipelines\n\n**Other:** UX/UI Design, Git, GitHub, Redux, project management, communication, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, JMeter, Jest"
}