{
  "name": "Rei Taro",
  "role_name": "Software Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Software Engineer with over 10 years of experience in backend development, adept in **C++23**, **Rust**, **Go**, and Linux OS architecture. Highly skilled in **Linux low-level development**, debugging, event tracing, and leveraging **eBPF** within the **Linux networking subsystem**. Demonstrated expertise in cybersecurity and anti-malware practices. Proven ability to create high-quality, high-performance systems while collaborating effectively through peer code reviews. A proactive learner committed to mastering new technologies, and experienced in containerization using **Docker** and orchestration with **Kubernetes**. Highly successful in delivering complex projects for leading firms, utilizing a strong foundation in backend architecture and automation tools.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "- Developed advanced software solutions utilizing **C++23**, **Rust**, and **Go** for efficient and high-performance applications.\n- Engineered and optimized Linux OS architecture to enhance system performance and reliability, leveraging expertise in **Linux low-level development**.\n- Implemented robust debugging and event tracing techniques to identify and resolve software issues, ensuring optimal system functionality.\n- Designed and executed complex networking solutions within the **Linux networking subsystem**, improving network reliability by **30%**.\n- Championed cybersecurity initiatives to prevent security breaches, incorporating **anti-malware** strategies and best practices.\n- Utilized **Docker** and **Kubernetes** for containerization and orchestration of applications, successfully reducing deployment times by **50%**.\n- Conducted peer code reviews promoting best practices and fostering a culture of **teamwork** and continuous improvement.\n- Actively pursued learning new technologies within the software ecosystem, keeping abreast of **latest trends** and innovations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **C++23** and **Rust** to develop robust backend systems, ensuring low-level development and optimization for Linux OS architecture.\nImplemented **Go** for creating asynchronous services, enhancing event tracing capabilities and debugging efficiency in high-performance environments.\nEngaged in cybersecurity practices, conducting security audits and developing anti-malware strategies to protect sensitive data and systems.\nCollaborated within cross-functional teams to facilitate peer code reviews, ensuring high-quality code and fostering a culture of teamwork and continuous learning.\nDeployed applications using **Docker** and **Kubernetes**, streamlining container orchestration and management for improved scalability and reliability.\nMonitored and optimized the **Linux networking subsystem**, ensuring efficient data transfer and network performance.\nInvestigated and debugged system issues with an emphasis on performance analytics, using **eBPF** for tracing system calls and networking events."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **C++23**, **Rust**, and **Go** to develop high-performance backend services that optimize trade execution, portfolio management, and account tracking for enhanced trading operations.\nEmployed **Docker** and **Kubernetes** to automate deployment processes for reliable trade systems, reducing deployment time by **40%** compared to previous versions.\nImplemented debugging strategies and event tracing methodologies in **Linux OS architecture** to identify and resolve critical issues, improving system stability by **30%**.\nCollaborated effectively within a team environment, conducting peer code reviews to ensure high-quality code and share knowledge on **Linux low-level development** techniques.\nMonitored and enhanced the **Linux networking subsystem** to support high-frequency transactions, increasing throughput by **25%**.\nFocused on cybersecurity measures and anti-malware strategies to secure the platform, complying with industry standards such as MiFID II and GDPR.\nAdapted successfully to new technologies and frameworks, continuously learning to improve both personal and team performance."
    }
  ],
  "skills": " **Programming Languages**\n\t C++23, Rust, Go, Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t \n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure**\n\t Linux OS architecture, Linux low-level development, Linux networking subsystem\n\n **Other**\n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Debugging, Event tracing, eBPF, Cybersecurity, Anti-malware, Peer code reviews, Teamwork, Learning new technologies"
}