{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic Senior Sales Engineer with a strong foundation in business development and customer relationship management, leveraging 13+ years of technical expertise to drive sales success. Proficient in using **CRM** platforms and proposal tools to streamline processes and enhance client engagement. Skilled in project management and effective communication, ensuring alignment with customer needs and project timelines.\nPreviously held a robust technical background as a Full Stack Developer, adept in languages such as **JavaScript/TypeScript**, **Python**, and frameworks like **React**, **Node.js**, and **Django**. Experienced in delivering AI/ML-powered applications, supporting real-time processing and predictive analytics. Familiar with cloud native deployments on **AWS** and **Azure**, as well as implementing CI/CD pipelines and microservices architectures. This technical acumen complements my ability to address complex customer challenges in water treatment, filtration, and wastewater management.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged expertise in customer relationship management (CRM) to build strong client relationships and drive business development initiatives, leading to a **25%** increase in client engagement over **6 months**.\nCreated tailored proposals utilizing proposal tools and Microsoft Office to address specific client needs, resulting in a **40%** win rate on submitted proposals.\nManaged end-to-end project management for water treatment solutions, including filtration, softening, reverse osmosis, and dewatering processes, ensuring on-time delivery and customer satisfaction.\nConducted detailed technical presentations and product demonstrations to effectively communicate complex water treatment systems to stakeholders and clients, improving communication efficiency by **30%**.\nMaintained up-to-date knowledge of wastewater treatment technologies, resulting in the implementation of innovative filtration solutions that reduced operational costs by **15%**.\nCollaborated with cross-functional teams to identify new business opportunities in the water treatment sector, enhancing the sales pipeline effectiveness by **20%**.\nTrained and mentored junior engineers on CRM practices and technical knowledge, fostering a collaborative team environment and increasing overall team productivity.\nDeveloped strong rapport with customers, gathering feedback to inform product improvements and tailor solutions specifically for client requirements, leading to improved customer retention rates.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **CRM** systems to drive business development, resulting in a **20% increase** in customer engagement and retention.\nUtilized **Microsoft Office** tools to create compelling proposal documents, streamlining the proposal process and improving win rates by **15%**.\nDeveloped robust project management frameworks to oversee the execution of water treatment projects, enhancing efficiency and meeting **95%** of project deadlines.\nProvided expert consultation on advanced water treatment solutions, including **filtration**, **softening**, and **reverse osmosis**, resulting in customized solutions for clients and driving **$2M** in sales growth.\nConducted comprehensive customer relationship management initiatives, leading to enhanced communication and collaboration with key stakeholders throughout project lifecycles.\nImplemented strategies that drove business development efforts in wastewater management, achieving a **30%** growth in market penetration within a year.\nPresented technical capabilities and solutions to clients effectively, fostering long-lasting relationships and reinforcing company credibility in the water treatment industry."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Managed business development activities and cultivated strong customer relationships, leveraging **CRM** tools and **Microsoft Office** suite to enhance proposal effectiveness.\nDesigned and optimized sales proposals using advanced proposal tools, resulting in a **15% increase** in successful bids.\nEngaged with clients across various sectors including **water treatment**, **filtration**, **softening**, **reverse osmosis**, and **wastewater management**, providing tailored solutions that have resulted in a **30% growth** in market penetration.\nProject-managed multiple sales campaigns, coordinating between technical teams and customers to ensure timely and effective delivery of solutions, achieving **95% satisfaction** rates.\nCommunicated technical concepts and solutions effectively to non-technical stakeholders, driving clarity and understanding in complex product offerings.\nAnalyzed customer needs and managed project scopes to drive successful implementations of filtration and dewatering technologies.\nEducated clients on the benefits and applications of advanced treatment processes, supported by data-driven insights and performance metrics.\nFostered collaborative relationships with internal and external teams, enhancing communication and streamlining project execution.\nAttended industry conferences and trade shows, representing the company and showcasing our innovative solutions, resulting in new lead generations of up to **200 leads** per event."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tCRM\n\tproposal tools\n\tMicrosoft Office\n\twater treatment\n\tbusiness development\n\tfiltration\n\tsoftening\n\treverse osmosis\n\tdewatering\n\twastewater\n\tcustomer relationship management\n\tcommunication\n\tproject management",
  "apply_company": "Nijhuis Saur Industries"
}