{
  "name": "Tomasz Lee",
  "role_name": "Senior Data Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Data Engineer with 9+ years of experience in data modeling, performance optimization, and monitoring data pipelines. Proficient in **Azure Data Factory**, **Snowflake**, **DBT**, **SQL**, and **Python** for building and optimizing robust data workflows. Skilled in version control using **Git** and adept in CI/CD workflows to streamline deployment processes. Strong communication skills enhance collaboration across teams and ensure the successful execution of complex projects. Additionally, experienced in **microservices architecture** and distributed systems, with technical proficiency in **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, **.NET**, and **C#**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Azure Data Factory** to design and implement data pipelines, enhancing ETL processes and improving data accessibility.\nDeveloped and maintained data models in **Snowflake** to ensure efficient storage and retrieval of large datasets, optimizing data performance by **30%**.\nApplied **DBT** for transformation of data models, ensuring data accuracy and consistency across analytics workflows.\nExecuted SQL queries for data extraction and manipulation, improving query performance by **25%** through effective indexing strategies.\nMonitored data pipelines for performance bottlenecks and implemented debugging techniques in **Python** to enhance workflow efficiency.\nImplemented **CI/CD workflows** for automated deployment and integration of data solutions, reducing deployment time by **40%**.\nCollaborated with cross-functional teams to communicate data insights, aligning with the organization’s strategic objectives and improving stakeholder engagement.\nEmployed version control using **Git**, facilitating seamless collaboration and code management within the data engineering team.\nConducted performance optimization of data workflows, leading to a significant reduction in processing times by **20%**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Azure Data Factory** for orchestrating and managing data workflows, ensuring high availability and reliability of data pipelines.\nDeveloped data models and transformations using **Snowflake** and **DBT**, optimizing for **SQL** performance to enhance data retrieval times by 20%.\nImplemented monitoring strategies for data pipelines, reducing error rates by 15% through proactive **debugging** techniques.\nDesigned and maintained CI/CD **workflows** with **Git** for version control, streamlining deployment processes and significantly reducing code-related issues by 25%.\nUtilized **Python** for data processing and analysis, leading to an increase in data processing efficiency by 30%.\nEnhanced performance optimization tactics for existing databases, achieving a 40% reduction in query execution times.\nCollaborated with cross-functional teams to gather requirements and communicate data insights, improving project alignment and deadlines by 10%.\nConducted regular performance evaluations and implemented enhancements based on analytical results, increasing system performance stability.\nFacilitated training sessions on data workflows for junior engineers, boosting team knowledge and efficiency by 20%."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Azure Data Factory** for orchestrating data workflows, optimizing data ingestion processes by over **30%**.\nEmployed **Snowflake** for cloud data warehousing, enhancing data retrieval efficiency and scalability for large datasets.\nDeveloped data pipelines with **DBT** and **SQL**, focusing on data modeling strategies that improved data accuracy and performance metrics by **25%**.\nImplemented **Python** scripts for data transformation and cleaning, resulting in a **15%** decrease in processing times.\nMonitored data pipelines to ensure operational integrity and reliability, successfully reducing downtime incidents by **10%**.\nDirected debugging efforts on data workflows, enabling quicker identification and resolution of data quality issues.\nMaintained rigorous **version control using Git**, ensuring seamless collaboration across team members and project consistency.\nEstablished CI/CD workflows to automate deployment processes, achieving a deployment time reduction of **40%**.\nEnhanced communication skills by facilitating cross-team collaborations, ensuring clarity in project goals and deliverables.\nParticipated in daily standups and collaborative discussions to align with project objectives and best practices."
    }
  ],
  "skills": " **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL, Snowflake\n\n **Cloud & Infrastructure**\n\t AWS, Azure, Azure Data Factory\n\n **DevOps**\n\t CI/CD pipelines, CI/CD workflows, Version control (Git)\n\n **Other**\n\t UX/UI Design, GitHub, Python, Redux, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Data modeling, Performance optimization, Monitoring data pipelines, Debugging data workflows, Communication skills, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest"
}