{
  "name": "Tomasz Lee",
  "role_name": "Senior React Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior React Engineer with 9+ years of experience in developing high-performance applications leveraging **React Native**, **TypeScript**, and **Expo**. Expert in implementing Offline-First strategies, app versioning, beta distribution, and crash analytics. Proficient in secure storage and effective data handling to enhance user experience and application reliability. Proven ability to communicate effectively with stakeholders and manage cross-functional teams, ensuring project alignment with business goals. Experienced with **ReactJS**, **NextJS**, **.NET**, **C#**, and cloud services, complementing a strong foundation in microservices architecture and distributed systems.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior React Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **React Native** and **TypeScript** to develop high-performance mobile applications with an emphasis on **Offline-First** approaches, improving user engagement by **30%**.\nImplemented **Expo** for simplified app deployment and management, streamlining the app versioning process for **3** major releases.\nConducted thorough **beta distribution** testing, effectively using **Crash analytics** to monitor app stability and resolve issues before full-scale launch, decreasing crash rates by **15%**.\nDesigned and integrated **Remote config** solutions to enable dynamic feature management, allowing real-time updates without redeployment.\nCollaborated closely with stakeholders to define project requirements and ensure effective communication throughout the development lifecycle, enhancing stakeholder satisfaction by **20%**.\nManaged data handling processes to ensure secure storage of user information and compliance with security protocols.\nOversaw the deployment of applications to **Google Play** and **App Store**, managing the entire release cycle to ensure timely availability to users.\nEnhanced user experience by incorporating feedback and making iterative improvements based on user data and app usage trends.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and optimized mobile applications using **React Native** and **TypeScript**, focusing on **Offline-First** strategies to enhance user experience in data handling.\nImplemented **Expo** for streamlined build processes, achieving a total application deployment time reduction of **40%**.\nApplied crash analytics tools to monitor application performance and improve stability, leading to a **20%** reduction in reported user crashes.\nManaged app versioning and facilitated beta distribution for testing on **Google Play** and **App Store**, ensuring smooth rollouts to over **10,000** users.\nConfigured **Remote Config** for dynamic content updates without app redeployment, enhancing user engagement by **15%**.\nEnsured secure storage solutions for sensitive user data, complying with industry standards and improving user trust.\nCollaborated with cross-functional teams to define and manage stakeholder requirements, achieving a **95%** satisfaction rate in project delivery.\nMaintained clear and continuous communication with team members to align on project goals and timelines, driving project completion ahead of deadlines by **30%**.\nConducted mentorship and training sessions for junior developers, enhancing overall team skill level and productivity.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **React Native** and **TypeScript** to develop robust applications, ensuring an **Offline-First** approach to enhance user experience even in low connectivity scenarios.\nImplemented **Expo** for expedited app development and streamlined the **Beta distribution** process for testing among stakeholders, leading to a faster feedback loop and reduced deployment time by **30%**.\nIntegrated **Crash analytics** tools to monitor and address application performance, achieving a **25%** decrease in crash reports post-launch.\nEmployed **Remote config** strategies to implement dynamic feature toggling, enabling timely adjustments based on user feedback.\nManaged versioning of the app meticulously to ensure smooth updates, engaging with the **Google Play** and **App Store** platforms effectively, which contributed to a **15%** increase in user engagement.\nImplemented secure storage practices for user data, adhering to best practices in **Data handling** and maintaining customer trust.\nFostered effective **Communication** and **Stakeholder management** practices to align project goals and expectations, facilitating a collaborative environment.\nParticipated in code reviews and contributed to team knowledge sharing sessions, promoting coding standards and best practices within the team.\nDeveloped comprehensive technical documentation and user guides for new features, ensuring smooth onboarding for future team members."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, TypeScript, Expo, Offline-First, App versioning, Beta distribution, Crash analytics, Remote config, Google Play, App Store, Secure storage, Data handling, Communication, Stakeholder management\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Testing Tools**\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\n**Blockchain**\n\tSolidity, Ether.js, Web3.js, Ethereum\n\n**Other**\n\tUX/UI Design, Git, GitHub, RESTful API, GraphQL, Python, Redux",
  "apply_company": "Zenitech"
}