{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Ruby Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Ruby Engineer with 10+ years of experience in full stack development, specializing in **Ruby**, **Ruby on Rails**, and **PostgreSQL**. Expert in building **RESTful APIs** and implementing **Test-Driven Development (TDD)**, with a deep commitment to **secure coding** practices. Experienced in **Continuous Integration** and **DevOps** methodologies leveraging tools like **Git**, **GitHub**, and **GitLab** to streamline processes and improve software quality.\nSkilled in modern frontend technologies including **JavaScript/TypeScript**, **React**, and familiar with **Agile** methodologies, ensuring effective **remote collaboration** and agile development practices. Proven track record in delivering cloud-native solutions using **AWS** and automating workflows to enhance operational efficiency.\nBrings strong analytical and problem-solving skills, with hands-on expertise in developing and deploying AI/ML capabilities for enhanced data-driven insights. Adept at conducting **code reviews**, ensuring effective **documentation**, and promoting best practices in **domain modeling** to deliver secure and maintainable solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Ruby Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented secure, scalable web applications using **Ruby** and **Ruby on Rails**, ensuring adherence to secure coding practices and regulatory standards.\n• Developed comprehensive RESTful APIs, optimizing performance for large datasets in **PostgreSQL** and integrating with front-end technologies such as **React** and **TypeScript** for a seamless user experience.\n• Utilized Test-Driven Development (**TDD**) methodologies to ensure high-quality code, conducting code reviews and implementing automated unit tests with frameworks such as RSpec.\n• Led the continuous integration process using **GitHub** and **GitLab**, streamlining deployment for applications hosted on **AWS**, and facilitating efficient version control and collaboration.\n• Automated build and deployment workflows, reducing deployment time by **40%** using tools like Jenkins and Docker, enhancing the overall development pipeline.\n• Spearheaded agile methodologies within the team, improving project delivery timelines by **25%** and fostering collaboration across departments in a remote work environment.\n• Conducted comprehensive code documentation and established domain modeling strategies, improving knowledge sharing among team members and enhancing on-boarding processes.\n• Collaborated with cross-functional teams to integrate security practices into the development lifecycle, ensuring the protection of sensitive data and compliance with industry standards.\n• Engaged in regular sprint planning and retrospectives, continually iterating on processes for improved efficiency and adaptability in project management.\n• Provided mentorship to junior developers, facilitating growth through pair programming and knowledge transfer sessions."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed and maintained **RESTful APIs** using **Ruby on Rails**, enhancing the efficiency and user experience of financial platforms.\n• Executed **TDD** practices and **Continuous Integration** workflows to ensure code quality, reliability, and faster deployment cycles, achieving a **30% reduction** in bugs post-deployment.\n• Integrated and collaborated on team projects using **Git**, **GitHub**, and **GitLab** for version control, promoting best practices in **Code Documentation** and effective **Code Reviews**.\n• Leveraged **PostgreSQL** for database management, maintaining a **99.9% uptime** and optimizing query performance by **40%** through efficient domain modeling.\n• Employed **DevOps** principles to automate deployment processes, enabling faster release cycles and increased team productivity by around **25%**.\n• Ensured **Secure Coding** practices were applied across all applications to protect sensitive financial data, leading to zero security incidents in the last **12 months**.\n• Facilitated agile workflows in a **Remote Collaboration** environment, leading to improved team synergy and project completion rates.\n• Designed and implemented dynamic user interfaces with **React** and **TypeScript**, contributing to improved user engagement and satisfaction across various financial applications."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Employed **Ruby on Rails** to design and implement scalable **RESTful APIs**, achieving a response time of under **200ms** for key service endpoints.\nUtilized **PostgreSQL** for robust data management and optimized queries, resulting in a **30%** reduction in load times on data-heavy pages.\nImplemented **Test Driven Development (TDD)** practices to ensure code quality and reliability, maintaining a code coverage of **85%** with unit and integration tests.\nStreamlined CI/CD pipelines using **GitHub Actions** for rapid deployment, enhancing productivity through automated testing and deployment processes.\nDeveloped user-centric applications with **React** and **TypeScript**, ensuring responsive design for enhanced user experiences, contributing to a **25%** increase in user engagement.\nApplied **Agile methodologies** to effectively manage project timelines and deliverables, ensuring timely completion of sprint goals through strong remote collaboration.\nConducted peer **code reviews** to maintain high standards of code quality and consistency across the team.\nCreated detailed **code documentation** to facilitate knowledge sharing and onboarding processes for new team members.\nImplemented secure coding practices to comply with security best practices, significantly mitigating vulnerabilities throughout the development life cycle.\nEngaged in domain modeling to enhance project scope clarity and ensure alignment with business objectives."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Ruby, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Ruby on Rails\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Continuous Integration, Automation\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tTDD, Secure Coding, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Code Documentation, Agile, Domain Modeling, Code Reviews, Remote Collaboration",
  "apply_company": "Oyster"
}