{
  "name": "Patryk Zaslawski",
  "role_name": "Timber Construction / Structural Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a detail-oriented Timber Construction / Structural Engineer, I bring exceptional project management skills to oversee structural analysis using advanced programs. My strong communication skills foster team-oriented collaboration, while also supporting independent working styles to achieve project goals efficiently. With a solid background in timber engineering and a commitment to structural integrity, I ensure high-quality outcomes in all projects. Fluent in English, I excel at conveying complex concepts clearly, aligning with both team and client needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Timber Construction / Structural Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Conducted structural analyses and design assessments for timber construction projects, ensuring adherence to safety regulations and standards.\n- Collaborated with multidisciplinary teams to manage all phases of timber engineering projects, applying effective project management techniques to deliver on time and within budget.\n- Communicated complex technical information clearly to stakeholders, ensuring alignment and understanding throughout the project lifecycle.\n- Facilitated team-oriented working environments by mentoring junior engineers and promoting best practices in timber engineering.\n- Worked independently on the development and implementation of innovative solutions to enhance timber design processes and construction methodologies.\n- Utilized advanced **structural analysis programs** to evaluate the performance of timber structures under various load conditions, ensuring durability and compliance.\n- Ensured accurate documentation in both English and technical specifications, enhancing clarity and reducing miscommunication among project teams.\n- Analyzed project requirements and specifications to create tailored engineering solutions, fostering an environment of independent problem-solving.\n- Optimized workflows by implementing efficient project management tools and methodologies, improving team productivity and project delivery times."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Conducted thorough **structural analysis** using advanced programs to ensure the integrity and safety of timber structures, optimizing design processes.\n• Managed **timber engineering** projects from concept to completion, ensuring timely delivery and adherence to safety regulations.\n• Effectively communicated complex engineering concepts to stakeholders, fostering collaboration and aligning project goals across teams.\n• Collaborated within a **team-oriented** environment, enhancing project outcomes through shared knowledge and teamwork.\n• Executed project plans independently, demonstrating strong problem-solving skills to overcome engineering challenges throughout the project lifecycle.\n• Developed and maintained project documentation in English, ensuring clear communication of technical specifications and project updates to various audiences.\n• Utilized **project management** tools for tracking progress and managing deadlines, leading to a **15%** increase in project efficiency compared to previous timelines.\n• Implemented best practices in timber construction, achieving a reduction in material waste by **20%** over the project duration.\n• Participated in continuous learning and development opportunities, enhancing communication skills that improved team dynamics and project results."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Conducted structural analysis using **advanced structural analysis programs** to ensure safety and compliance of timber engineering projects across a range of specifications.\nManaged multiple timber construction projects simultaneously, ensuring adherence to timelines and budgets through effective **project management** strategies.\nDeveloped detailed technical drawings and specifications for timber structures, integrating sustainable practices and innovative engineering solutions.\nCollaborated with cross-functional teams to enhance **communication skills** and foster a **team-oriented working** environment, resulting in more cohesive project outcomes.\nProvided technical guidance and support to junior engineers, promoting **independent working** skills within the team by sharing knowledge and resources.\nUtilized **timber engineering** principles to assess the performance and durability of materials, achieving a **20%** improvement in structural efficiency across projects.\nPrepared and delivered project presentations in **English** to stakeholders, ensuring clarity of technical concepts and project goals.\nPerformed risk assessments and analyses to mitigate potential issues in timber construction, aligning with strict codes and safety regulations.\nOrganized training sessions on the latest trends in timber engineering technology, enhancing the **team-oriented working** atmosphere and advancing skills.\nImplemented feedback mechanisms for continuous improvement in project execution, ensuring all stakeholders were engaged in the process."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQLAlchemy\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, structural analysis programs, timber engineering, project management, communication skills, team-oriented working, independent working, English language skills"
}