{
  "name": "Tomasz Lee",
  "role_name": "Senior Security Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Driven Senior Security Engineer with 9+ years of extensive experience in **AWS**, **Kubernetes**, **Terraform**, **Python**, and **CI/CD** practices. Proficient in **Infrastructure as Code** and well-versed in security compliance frameworks, including ISO 27001, SOC 2, and GDPR. Demonstrated expertise in **Vulnerability Management**, **Threat Analysis**, **Penetration Testing**, and implementing **Security Controls**. Proven ability to automate security processes and maintain high-security standards, ensuring robust protection across cloud environments. Additionally, recognized for leveraging technical background in **microservices architecture**, **Apache Kafka**, **RabbitMQ**, **Redis**, and full-stack development with **ReactJS**, **NextJS**, **.NET**, and **C#** to lead projects that enhance security measures and optimize performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Built and maintained automated security frameworks using **AWS** and **Terraform** to streamline infrastructure deployment and enhance security compliance with **ISO 27001** and **SOC 2** standards.\nConducted vulnerability assessments and penetration testing, enhancing the overall security posture by identifying and remediating **50+** vulnerabilities.\nImplemented cloud security best practices for applications running on **Kubernetes**, ensuring compliance with **GDPR** and security standards.\nDeveloped and monitored CI/CD pipelines to enforce security compliance, reducing deployment risks by **40%**.\nCreated detailed threat analysis reports, highlighting potential security threats and recommending mitigations, which improved incident response time by **30%**.\nAutomated security controls and compliance checks, significantly reducing manual effort and ensuring adherence to **Security Controls** and standards.\nCollaborated with cross-functional teams to integrate security measures throughout the development lifecycle, promoting a culture of security awareness.\nDesigned and implemented security monitoring solutions to proactively identify and respond to threats in real-time, enhancing system resilience.\nProvided training and guidance on security best practices to development teams, resulting in a **25%** decrease in security-related incidents.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **AWS** cloud services to enhance infrastructure security and scalability while ensuring compliance with **ISO 27001** and **SOC 2** standards.\nConfigured **Kubernetes** for orchestrating containerized applications, improving deployment efficiency by **40%**.\nUtilized **Terraform** for **Infrastructure as Code**, enabling repeatable and consistent environments across development and production, contributing to reduced provisioning time by **50%**.\nDeveloped and automated security compliance checks for **GDPR** adherence, streamlining internal audits and increasing compliance accuracy by **60%**.\nConducted regular **Vulnerability Management** assessments and **Threat Analysis** exercises, leading to a **30%** reduction in security incident response time.\nPerformed **Penetration Testing** to evaluate system robustness and identify security flaws, which enhanced the overall security posture of the organization.\nEstablished and maintained **Security Controls** that align with **Security Standards**, promoting a culture of security awareness and accountability across the teams.\nLed the development and implementation of CI/CD pipelines while ensuring secure code deployment practices and reducing vulnerability incidents by **25%**.\nCollaborated with cross-functional teams to define security requirements and implement effective automation strategies, improving security operations efficiency by **35%**.\nMentored junior security engineers in best practices of **Security Compliance**, fostering a knowledgeable and skilled workforce."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented **AWS** solutions to enhance cloud security measures, ensuring compliance with **ISO 27001** and **SOC 2** standards.\nConducted **vulnerability management** and **threat analysis** using tools and frameworks such as **Python** for automation, increasing security incident response by **30%**.\nLed efforts in **penetration testing** and continuously enforced **security controls** to safeguard infrastructure against breaches, achieving a **100%** compliance rate.\nUtilized **Terraform** for **Infrastructure as Code** to streamline cloud deployment processes, reducing setup time by **25%**.\nMaintained and optimized **Kubernetes** clusters to support application security, enabling efficient scaling while adhering to **GDPR** regulations.\nManaged CI/CD pipelines with a focus on **automation** and applied rigorous security standards, improving deployment quality by **15%**.\nConducted training sessions on **security compliance** to enhance team awareness and application of security standards across projects.\nDeveloped and maintained technical documentation related to **security controls** and best practices, facilitating knowledge transfer and adherence to security protocols.\nEngaged in regular audits to assess security posture, ensuring alignment with organizational objectives and enhancing overall risk management."
    }
  ],
  "skills": " **Programming Languages**\n\tPython\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Kubernetes, Infrastructure as Code, Terraform\n\n**Cloud & Infrastructure**\n\tCloud Security, Security Compliance, ISO 27001, SOC 2, GDPR, Vulnerability Management, Threat Analysis, Penetration Testing, Security Controls, Security Standards\n\n**Other**\n\tUX/UI Design, Git, GitHub, Redux, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Jimdo"
}