{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a focused Senior Backend Engineer with 8 years of advanced experience, I excel in **Backend Engineering**, specializing in developing high-performance backend solutions that enhance system scalability and support growth strategy in the FinTech sector. My strong background includes modern technologies such as **Python**, **Node.js**, **FastAPI**, and **Django**, which I have leveraged to create robust, secure applications. \nI have successfully managed high-impact projects, leading cross-functional teams in remote environments to deliver enterprise-grade platforms that comply with regulatory standards including HIPAA and PCI DSS. My expertise extends to integrating machine learning capabilities, where I have built and deployed data processing pipelines using tools such as **MLflow**, **Airflow**, and **Kubeflow**. Additionally, I have a proven track record in implementing CI/CD in cloud environments with **Azure** and **AWS**, ensuring efficient and scalable production deployments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable backend solutions using **Python (FastAPI)** and **Node.js** to support high-load transactions in the financial industry.\n• Engaged in high-impact project management to ensure timely delivery of backend features while adhering to regulatory standards such as PCI DSS.\n• Employed advanced growth strategies to enhance system scalability across applications, including healthcare and financial software.\n• Conducted remote collaboration with cross-functional teams to address system scalability challenges and optimize backend performance.\n• Leveraged **PostgreSQL** and **MongoDB** for robust data management, optimizing queries for increased performance in large datasets exceeding **1 million** records.\n• Integrated AI solutions using **Azure ML** and **AWS Sagemaker** for predictive analytics within financial systems, facilitating real-time insights.\n• Implemented enterprise-level DevOps pipelines with **GitHub Actions** and **Azure DevOps**, ensuring seamless updates and system reliability in environments with **99.9%** uptime.\n• Contributed to system development through the implementation of microservices architecture using **Docker** and **Kubernetes (EKS/AKS)**, improving deployment speed by **30%**.\n• Established and executed testing strategies leveraging frameworks like **Jest** and **Cypress**, achieving over **95%** code coverage in backend services.\n• Participated in the design and integration of cloud-native systems, utilizing technologies such as **GraphQL** for flexible API interactions to enhance user experience and system interaction efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Designed and implemented **Backend Engineering** solutions for high-volume financial platforms using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), achieving a **50%** increase in scalability and maintainability.\n• Spearheaded **High-Impact Project Management** initiatives that resulted in a **30%** reduction in project delivery time through efficient use of **Agile** methodologies.\n• Executed **Growth Strategies** by developing APIs that supported over **100,000** transactions per day and enhanced user experience with responsive designs using **React** (18), **Vue 3**, **Next.js**, and **TypeScript**.\n• Fostered **Remote Collaboration** by leading cross-functional teams in integrating event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, facilitating real-time processing of alerts and compliance workflows.\n• Leveraged **FinTech Expertise** to build ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting batch and real-time ingestion of financial data with an efficiency increase of **40%**.\n• Implemented advanced **System Scalability** techniques by developing AI/ML-powered fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, successfully reducing false positives by **25%**.\n• Created and streamlined **ML pipelines** for credit scoring and transaction classification utilizing **MLflow** and **Airflow**, integrating model inference into backend services for real-time decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Engineered high-performance backend services for a global e-commerce platform utilizing **Python** (FastAPI, Django) and **Node.js** (NestJS, Express), ensuring system scalability and low latency for key features across a user base of over **1 million** active customers.\n• Led high-impact projects focusing on backend scalability that resulted in a **30%** increase in platform responsiveness, achieving high availability across checkout and order fulfillment modules.\n• Collaborated effectively in remote settings with cross-functional teams to implement growth strategies that enhanced system operational efficiency by **25%**.\n• Integrated cutting-edge machine learning recommendation systems using **scikit-learn**, **LightGBM**, and **TensorFlow**, which contributed to improving product search relevance and increasing conversion rates by **15%** based on real-time behavioral analytics.\n• Managed robust data architectures employing **MongoDB**, **PostgreSQL**, and **Redis** to facilitate distributed data storage and caching, ensuring access speeds suited for high-traffic environments, serving upwards of **500,000** transactions daily.\n• Developed and optimized backend processes that reduced operational downtimes, leveraging **Redis** for caching product metadata and boosting application responsiveness.\n• Implemented secure payment processing frameworks integrated with **Stripe**, **PayPal**, and **Razorpay**, focusing on compliance with PCI standards to safeguard sensitive transaction data.\n• Established a secure access management framework utilizing **OAuth 2.0** which ensured GDPR compliance while facilitating role-based access control for customer and administrative features.\n• Drove improvements in system scalability by executing feature flags and blue-green deployments using **Kubernetes** and **LaunchDarkly**, allowing for controlled feature rollouts and reducing risks during major updates."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tPython(FastAPI, Flask, Django)\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow, High-Impact Project Management, Growth Strategy, Remote Collaboration, FinTech Expertise, System Scalability, Backend Engineering"
}