{
  "name": "Patryk Zaslawski",
  "role_name": "Software Developer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-77bb38396/",
  "profile_summary": "Proficient in **.NET**, **.NET Core**, **MS SQL Server**, **T-SQL**, and **REST APIs**, I am a highly experienced Senior Software Developer with 8+ years in software engineering. My expertise includes Agile and Scrum methodologies, ensuring full SDLC compliance while delivering high-performance solutions across various sectors. I've effectively utilized **SharePoint** for development and support, implementing responsive UI through **HTML**, **CSS**, and **JavaScript**, as well as frameworks like **React**. With strong capabilities in **Azure DevOps** and CI/CD practices, I ensure streamlined deployment and integration processes. My original strengths include developing secure and modern applications, applying microservices architecture and leveraging cloud platforms like **Azure** for reliability and performance optimization.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Software Developer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Agile** and **Scrum** methodologies to manage software projects from initiation through completion, ensuring timely and efficient delivery.\nDeveloped and maintained **REST APIs** and **HTTP APIs** to enhance interoperability within software applications, supporting features for both web and mobile platforms.\nImplemented and supported **SharePoint** solutions, contributing to enhanced collaboration and document management for cross-functional teams.\nEngaged in the full software development lifecycle (SDLC), applying best practices to ensure quality and reliability of software products.\nCreated responsive user interfaces using **HTML**, **CSS**, **JavaScript**, and **React** to deliver seamless experiences across various devices and platforms.\nDeveloped backend services using **.NET** and **.NET Core**, ensuring robust and scalable solutions tailored for business needs.\nCollaborated in the design and implementation of database solutions using **MS SQL Server** and **T-SQL**, optimizing performance for data-intensive applications.\nDesigned and implemented **GraphQL** services to provide a flexible and efficient way for clients to query needed data from the server.\nContributed to CI/CD pipelines using **Azure DevOps** to automate software builds, testing, and deployments across multiple environments, achieving over **90% automation** in deployment processes.\nParticipated in the creation of UML diagrams to effectively communicate design strategies and architecture to stakeholders.\nEmployed modern JavaScript frameworks and libraries, ensuring compatibility with **TypeScript** to enhance code maintainability and scalability.\nAdvocated for best practices in **Responsive UI** development, ensuring applications deliver a consistent experience regardless of device or screen size.\nLeveraged **Azure DevOps** for managing source code and implementing version control, streamlining team collaboration processes.\nConducted code reviews and contributed to knowledge sharing within the team, fostering a culture of continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and supported **.NET** and **.NET Core** applications, participating in the full Software Development Life Cycle (**SDLC**) to ensure high-quality delivery within Agile and Scrum methodologies.\n• Created and maintained **REST APIs** and **HTTP APIs**, utilizing **MS SQL Server** and **T-SQL** to optimize database interactions for enhanced performance and reliability.\n• Designed responsive user interfaces using **HTML**, **CSS**, and **JavaScript**, with a focus on integrating **React** for seamless user experiences across platforms.\n• Implemented CI/CD pipelines utilizing **Azure DevOps** for automated deployment and quality assurance, streamlining the development process.\n• Collaborated in a cross-functional team, contributing to project planning and progress tracking using **Agile** techniques, ensuring adherence to timelines and project specifications.\n• Conducted rigorous testing and debugging processes to enhance application performance and reliability, including automated unit and integration testing.\n• Participated in SharePoint development/support, enhancing collaboration tools for effective teamwork and document management.\n• Collaborated with stakeholders to gather requirements and translate them into technical specifications using **UML** diagrams for clear communication and project alignment.\n• Maintained and improved existing applications by refactoring code and implementing new features based on user feedback and performance metrics.\n• Engaged in continuous learning and professional development to stay updated with the latest technologies and industry trends."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Led the development and optimization of REST APIs for critical applications, ensuring adherence to **Agile** and **Scrum** methodologies, which improved collaboration and project delivery timelines by **30%**.\nImplemented and supported full software development lifecycle (SDLC) processes in projects leveraging **.NET** and **.NET Core**, successfully deploying **20+** applications over **12 months**.\nEmployed **MS SQL Server** and T-SQL to manage and optimize databases, achieving a **40%** increase in query performance and reducing downtime.\nDesigned and executed CI/CD pipelines using **Azure DevOps**, incorporating **Git** for version control, allowing for rapid, reliable deployments with a **99.9%** success rate.\nDeveloped responsive UI components using **HTML**, **CSS**, **JavaScript**, and **TypeScript**, integrated with **React** to enhance user engagement and achieved **95%** user satisfaction in feedback surveys.\nCreated comprehensive documentation and UML diagrams for application architectures and processes, facilitating better understanding and knowledge transfer among team members.\nSupported project goals through effective performance monitoring and debugging of applications built on **HTTP APIs** and **GraphQL**, enabling a significant improvement in response times.\nCollaborated with cross-functional teams to ensure the development of high-quality software solutions, leveraging strengths in **SharePoint** development and support to enhance team productivity and project outcomes."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, T-SQL, HTML, CSS\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, .NET, .NET Core, REST APIs, WCF, HTTP APIs, GraphQL\n\n**Frontend Frameworks:**\n\tReact (15–18), Angular (1–16), Next.js, Vue.js (2/3), Responsive UI\n\n**API Technologies:**\n\tREST & gRPC APIs, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MS SQL Server, MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tAgile, Scrum, Full SDLC, SharePoint development/support, UML"
}