{
  "name": "Tomasz Lee",
  "role_name": "Senior Flight Dynamics Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Flight Dynamics Software Engineer with 9+ years of experience in developing mission-critical applications and systems. Expertise in **microservices architecture**, **containerization**, and **cloud-based deployments**, alongside proficiency in **Python**, **Java**, **C++**, and **Fortran**. Strong background in flight dynamics systems, mission control systems, and spacecraft operations ensuring effective **verification and validation (V&V)**. Proven ability to design and implement **telemetry/telecommand workflows**, and develop mission planning tools with a focus on user-centric solutions. A collaborative leader skilled in customer interaction and product strategy, committed to delivering quality and optimizing performance in aerospace software.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Flight Dynamics Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python**, **Java**, **C++**, and **Fortran** to develop and maintain Flight Dynamics Systems (FDS) and Mission Control Systems (MCS), ensuring robust spacecraft operations and mission success through effective **orbital mechanics** and **astrodynamics** analysis.\nImplemented microservices architecture in various projects to enhance scalability and maintainability, mirroring industry best practices in software development.\nDrove the integration of sensor fusion techniques to improve data accuracy and operational efficiency in spacecraft telemetry and telecommand workflows.\nLed technical verification and validation (V&V) processes, achieving compliance with mission requirements and enhancing overall product reliability.\nDesigned ground segment software and mission planning tools, influencing the functionality with real-time data analytics and responsiveness.\nSpearheaded cloud-based deployments leveraging **Docker** to facilitate efficient containerization strategies and improved deployment cycles.\nEngaged in customer interaction to refine product strategy, resulting in user feedback initiatives that increased satisfaction metrics by **30%**.\nExercised technical leadership to mentor junior engineers, fostering a collaborative and innovative team environment.\nLeveraged experience in SSA/SST technologies to enhance situational awareness and operational planning.\nActively participated in the integration of telemetry/telecommand workflows for mission-critical activities, streamlined execution by **15%**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Applied **Python**, **Java**, and **C++** to enhance flight dynamics algorithms, optimizing calculations for real-time spacecraft navigation.\n• Developed and maintained a **cloud-based deployment** strategy for mission control software, improving operational efficiency by 20%.\n• Designed and implemented **microservices architecture** for spacecraft operations, improving system scalability and reliability.\n• Utilized **Docker** for containerization, streamlining deployment processes across **5** different environments.\n• Executed verification and validation (V&V) processes for **space software** components, achieving a **99%** success rate in compliance checks.\n• Led **technical leadership** initiatives by mentoring junior developers, resulting in improved team performance metrics by **15%**.\n• Engaged in customer interaction to refine product strategies for mission planning tools, aligning development with stakeholder expectations.\n• Conducted in-depth analysis of **orbital mechanics** and **astrodynamics**, ensuring precise trajectory calculations for satellite missions.\n• Implemented sensor fusion techniques to enhance telemetry/telecommand workflows, providing real-time data insights.\n• Coordinated with cross-functional teams to deliver innovative solutions for **SSA/SST** challenges, enhancing situational awareness.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed innovative **Flight Dynamics Systems (FDS)** software that enhanced spacecraft operations through optimized algorithms, improving flight path accuracy by **15%**.\n• Led the transition of legacy systems to a modern **microservices architecture** using **Docker**, significantly improving scalability and deployment time by **30%**.\n• Utilized **Python** and **C++** to create simulation tools for astrodynamics, validating performance through rigorous **verification and validation (V&V)** techniques.\n• Collaborated on project-level technical leadership initiatives to refine software quality standards, resulting in reduced bug counts by **25%** post-deployment.\n• Designed robust mission planning tools facilitating better **telemetry/telecommand workflows**, enhancing mission efficiency and response time.\n• Integrated advanced **sensor fusion** techniques which increased the accuracy of data interpretation for the **Mission Control System (MCS)** by **20%**.\n• Engaged in customer interaction to align software capabilities with client needs, ensuring delivery of effective ground segment software solutions.\n• Provided ongoing support and maintenance for **cloud-based deployments**, ensuring minimal downtime and high operational reliability.\n• Participated in code reviews to uphold coding standards and provide mentorship to junior developers on spacecraft operations software development.\n• Delivered technical documentation and training sessions for **SSA/SST** systems, enhancing team knowledge and operational readiness."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, C++, Fortran, Python, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices, microservices architecture\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tcloud-based deployments\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines, Docker, containerization\n\n**Cloud & Infrastructure**\n\tspace software, telemetry/telecommand workflows, sensor fusion, SSA/SST, spacecraft operations, Flight Dynamics System (FDS), Mission Control System (MCS)\n\n**Other**\n\tverification and validation (V&V), mission planning tools, technical leadership, customer interaction, product strategy, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Git, GitHub, UX/UI Design"
}