{
  "name": "Rei Taro",
  "role_name": "Senior PowerBI Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior PowerBI Engineer with over 10 years of comprehensive experience in data modeling, ETL, and data analysis. Proficient in **Power BI**, **DAX**, **Power Query**, and **SQL Server**, with a strong focus on delivering robust dataflows and ensuring data quality and security. Adept at leveraging **Azure** for scalable solutions, while creating and optimizing APIs to enhance data accessibility. Proven expertise in collaborating effectively with cross-functional teams, demonstrated in previous roles at top-tier organizations such as VISA, Sii Poland, and Reply Polska. Passionate about harnessing data to drive strategic decision-making and support business goals.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior PowerBI Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Power BI** to design and implement data visualizations, enhancing decision-making processes across teams by **30%**.\nDeveloped **DAX** measures and calculated columns to optimize data retrieval times, achieving a **15%** performance improvement.\nLeveraged **Power Query** for advanced data transformation, enabling seamless ETL processes from various data sources, including **SQL Server**.\nCreated efficient **Dataflows** and engaged in **Data Modeling** to ensure streamlined data availability and integrity for reporting needs.\nImplemented **APIs** to connect and extract data from various systems, improving user accessibility to data by **25%**.\nEnsured **Data Quality** and **Data Security** measures were upheld in every reporting initiative, collaborating with cybersecurity teams to enforce protocols.\nMaintained clear communication with cross-functional teams to troubleshoot and resolve data-related challenges, fostering effective **Teamwork** and project success."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Power BI** for creating interactive dashboards and reports, enabling data visualization and decision-making processes for stakeholders.\nImplemented **DAX** and **Power Query** to develop complex data models, ensuring optimal performance and data integrity across reports.\nExecuted ETL processes utilizing **Azure Dataflows** to extract, transform, and load data from **SQL Server** and other sources for comprehensive analysis and reporting.\nEngineered effective **APIs** to facilitate seamless data integration between various systems, enhancing data accessibility for users.\nConducted thorough data quality assessments and implemented security measures, maintaining compliance with data security regulations, ensuring only authorized access to sensitive information.\nCollaborated within a cross-functional team, maintaining clear communication and teamwork to achieve project milestones and ensure successful delivery of Power BI solutions.\nAnalyzed and documented workflow processes, leading to a **30%** improvement in reporting efficiency and a reduction of data redundancies by **25%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Power BI** to create interactive dashboards and reports, enabling data visualization for enhanced decision-making.\nApplied **DAX** and **Power Query** for data manipulation and modeling, streamlining ETL processes and ensuring data quality across various datasets.\nCollaborated with cross-functional teams to integrate data from **SQL Server** and **Azure** services, ensuring seamless data flow and accessibility.\nDesigned and implemented dataflows to automate data transformation, leading to a **30%** reduction in manual data handling time.\nExecuted rigorous data security practices, compliant with industry standards, to protect sensitive information and ensure data integrity.\nMaintained high communication and teamwork standards, coordinating effectively with technical and non-technical stakeholders to achieve project goals.\nConducted extensive data quality assessments, identifying and resolving issues, resulting in a **95%** increase in data accuracy within reports.\nLeveraged **APIs** for data integration between various platforms, enhancing the overall functionality and usability of analytic tools.\n"
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices, APIs\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL Server\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure**\n\tAWS, Azure\n\n **Other**\n\tPower BI, DAX, Power Query, Dataflows, Data Modeling, ETL, Excel, Data Quality, Data Security, Communication, Teamwork, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git",
  "apply_company": "syffer"
}