{
  "name": "Tomasz Lee",
  "role_name": "Infrastructure Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Skilled Infrastructure Engineer with 9+ years of experience in designing and implementing robust cloud solutions using **Terraform**, **Azure IaaS**, **Azure PaaS**, **App Services**, **Azure Active Directory**, and **Application Gateway**. Proficient in automation and configuration management through **PowerShell**, **YAML**, and **PowerShell Desired State Configuration**. Expertise in managing distributed systems and cloud infrastructure, with a strong understanding of **cloud security best practices**, **OAuth2**, **OpenID Connect**, and **Azure Policies** for comprehensive access management and security compliance. Demonstrated ability to deploy applications in scalable environments with effective use of **disaster recovery** and backup strategies. Proven track record in leading cross-functional projects, optimizing performance, and streamlining development processes. Additionally skilled in **SQL**, **Linux**, **Windows Server administration**, along with a solid foundation in **Kusto Query Language**, **Gremlin Query Language**, and **Pester**, enabling effective management and troubleshooting of cloud services.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Infrastructure Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Terraform** and **ARM templates** for infrastructure as code, ensuring scalable and repeatable deployments on **Azure IaaS** and **Azure PaaS** environments.\nImplemented **Azure Firewall** and **Application Gateway** for enhanced security and traffic management, increasing system security posture by 30%.\nDeveloped **PowerShell** scripts for automating deployment and configuration tasks, reducing manual effort by 50%.\nDesigned **YAML** configurations for CI/CD pipelines, facilitating continuous integration and delivery across cloud services.\nManaged **Windows Server** and **Linux** environments, optimizing performance and reliability for distributed systems.\nLeveraged **Azure Active Directory** and **Azure Entra ID** for secure access management and identity governance, ensuring compliance with cloud security best practices.\nConfigured **API Management** to streamline the deployment of robust APIs, enhancing service discovery and scalability across the platform.\nExecuted backup and restore strategies, achieving a 99% success rate in disaster recovery drills.\nDeveloped processes based on **SQL Server** administration and optimized **T-SQL** queries for improved data retrieval speeds by 25%.\nIntegrated **OAuth2** and **OpenID Connect** for secure authentication and authorization across applications, ensuring adherence to access management principles."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **Azure IaaS** and **PaaS** services, resulting in a 20% reduction in infrastructure costs.\nDesigned and managed **Terraform** templates for automated resource provisioning, increasing deployment speed by 40%.\nConfigured **API Management** to streamline microservices communication, enhancing overall system efficiency.\nDeveloped and maintained **YAML** configurations for CI/CD pipelines on **Azure** DevOps, reducing deployment times to under **10 minutes**.\nOrchestrated the use of **PowerShell** for automating routine server administration tasks, improving productivity by 30%.\nEstablished disaster recovery plans and ensured **backup** and **restore** processes were in place to maintain business continuity with **99.9%** uptime.\nConducted performance tuning for **SQL Server** databases, leading to a **15%** improvement in query response times.\nImplemented **OAuth2** and **OpenID Connect** for secure access management across applications, enhancing security protocols.\nUtilized **Azure Active Directory** for centralized identity management, improving user access and authentication processes.\nConducted regular audits for **cloud security best practices**, ensuring compliance with industry standards and reducing vulnerabilities by **25%**.\nCollaborated with cross-functional teams to define and implement **Azure Policies** for governance, ensuring efficient resource utilization and compliance."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **Azure IaaS**, **Azure PaaS**, and **Azure App Services** to deploy scalable infrastructure, increasing system availability by **30%**.\nDeveloped and managed **Terraform** configurations to automate infrastructure deployment, achieving a **25%** reduction in provisioning time.\nImplemented **PowerShell Desired State Configuration** to enforce consistent server configurations, enhancing system stability.\nDesigned **YAML** templates for Azure deployments, ensuring efficient version control and managing **Azure Policies** for compliance.\nConfigured **Azure Firewall** and **Application Gateway** for improved cloud security and traffic management, resulting in a **40%** decrease in security alerts.\nOrchestrated backups and restore procedures using **disaster recovery** strategies, ensuring data integrity and business continuity.\nDeveloped API Management solutions to facilitate integration with third-party services, improving data flow across infrastructures.\nCollaborated in the transition to distributed systems architecture, enhancing the scalability of applications and services.\nConducted SQL Server administration, optimizing database performance and improving query efficiency by **15%**.\nEngaged in Windows Server and Linux administration tasks to maintain a reliable and secure operating environment, implementing **cloud security best practices**.\nEmployed **OAuth2** and **OpenID Connect** for secure access management, ensuring compliance with access management principles.\nDocumented infrastructure architectures and best practices, facilitating knowledge sharing across teams."
    }
  ],
  "skills": " **Programming Languages**\n\t Python, C#, JavaScript, TypeScript\n\n **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, .NET\n\n **Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL, OAuth2, OpenID Connect, API Management\n\n **Serverless and Cloud Functions**\n\t Azure Functions\n\n **Databases**\n\t MongoDB, PostgreSQL, MySQL, MSSQL Server, DynamoDB, CosmosDB, SQL, SQL Server administration, Kusto Query Language, Gremlin Query Language\n\n **DevOps**\n\t CI/CD pipelines, Terraform, PowerShell, YAML, Pester, PowerShell Desired State Configuration\n\n **Cloud & Infrastructure**\n\t AWS, Azure, Azure IaaS, Azure PaaS, App Services, Application Gateway, Azure Firewall, Windows Server administration, Azure Active Directory, Managed Identities, Azure Policies, cloud security best practices, access management principles, scaling strategies, disaster recovery, backup, restore, Software as a Service\n\n **Other**\n\t UX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Microservices, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, distributed systems"
}