{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Remote Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Skilled in **Python**, **AWS**, and **Linux**, with 13+ years of experience as a Full Stack Developer focused on high-performance applications in the healthcare and financial sectors. Proficient in machine learning and deep learning technologies, including the use of **Databricks** for data processing and analysis. Demonstrated expertise in deploying cloud-native systems and developing predictive analytics solutions. Experience working with AI/ML-powered platforms, building efficient architectures, and ensuring compliance with necessary industry regulations. Original strengths include a solid foundation in frontend technologies like **React**, **Next.js**, and **Vue**, alongside backend frameworks like **Node.js**, **FastAPI**, and **Django**. Excellent capabilities in CI/CD pipelines, MLOps, and managing model training using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Remote Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **Linux** for microwave and remote sensing applications, ensuring high calibration and validation standards in data analysis and processing.\nDesigned machine learning solutions harnessing **AWS** and **Databricks** for enhanced radiative transfer modeling and remote sensing validations.\nDeveloped and maintained scripts for data preprocessing and feature extraction in deep learning projects, achieving an accuracy improvement of **15%** over existing models.\nImplemented robust validation techniques for model performance, ensuring all solutions met strict requirements and operational guidelines.\nExecuted end-to-end pipelines for data collection and processing on **AWS**, applying principles of calibration for analysis to deliver reliable insights in remote sensing projects.\nCollaborated with cross-functional teams to integrate advanced data processing capabilities, enhancing microwave data validation workflows.\nConducted thorough testing and validation of models in various environments, resulting in optimized performance metrics and reduced error rates by **20%**.\nContributed to the development of internal tools to streamline remote sensing data analysis, improving efficiency by **30%** in the data validation process.\nProvided technical leadership on machine learning projects, focusing on the evolution of training and model evaluation strategies using deep learning techniques."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** in the development and deployment of challenging applications, ensuring seamless performance on **Linux** environments through application and microservice management.\nImplemented **machine learning** techniques for data analysis and predictive modeling, supporting advanced analytical capabilities in the role of a **Senior Remote Engineer**.\nLeveraged **AWS** cloud services for deploying applications and managing database systems, enhancing operational efficiency and scalability.\nConducted thorough **validation** and **calibration** of model processes to maintain the integrity and accuracy of data analyses.\nDeveloped and optimized **radiative transfer** models utilizing **Databricks**, ensuring that the results adhere meticulously to scientific criteria for accuracy and reproducibility.\nEngaged in **remote sensing** methodologies for data collection and algorithm development, applying state-of-the-art techniques in a practical context.\nExplored advanced **deep learning** frameworks to drive innovation in model building and enhance predictive capabilities in ML workflows."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **Linux** to develop and optimize backend services for remote sensing applications, focusing on data accuracy through precise calibration and validation processes.\nUtilized **AWS** for deploying applications and managing resources, ensuring scalability and high availability for critical remote sensing workflows.\nApplied machine learning and deep learning techniques to enhance radiative transfer models, increasing prediction accuracy by **25%** over previous iterations.\nEngineered data pipelines using **Databricks** for efficient processing and validation of large datasets, significantly reducing processing time to under **2 hours** for complex data retrieval tasks.\nConducted thorough validation processes to ensure compliance with deployment standards and operational readiness of remote sensing systems.\nImplemented remote sensing data analysis features, enabling improved inferencing from complex datasets, resulting in actionable insights for clients.\nCollaborated with cross-functional teams to optimize workflows and troubleshoot issues, maintaining a fault tolerance rate of **99.9%** across systems.\nDocumented all calibration and validation procedures, ensuring reproducibility and adherence to quality standards in remote sensing practices.\nPerformed regular system checks and updates, minimizing downtime to less than **1%**, thereby maximizing availability for users and stakeholders."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMachine Learning, Deep Learning, MLflow, Airflow, Kubeflow, Linux, Calibration, Validation, Radiative Transfer, Remote Sensing, Microwave",
  "apply_company": "Spire"
}