{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Backend Engineer with 8 years of experience, I excel in developing scalable, high-performance solutions using **Go**, **Ruby**, and **Kubernetes**. My extensive background with cloud services includes **AWS** and my strong database management skills are demonstrated through my expertise in **PostgreSQL**. I am well-versed in implementing **event-driven architecture** and utilizing messaging systems like **Kafka**, reinforcing my capability in building responsive and resilient applications.\nIn addition to my technical skills, I have a solid foundation in **Domain-Driven Design**, which enables the creation of well-structured systems that align with business needs. I leverage tools such as **ELK** for logging, which enhances code quality and observability.\nMy original strengths include team collaboration, effective communication, and a problem-solving mindset, enabling me to lead and contribute to high-impact projects while fostering an environment of curiosity and innovation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Go** and **Ruby** to architect and develop robust backend systems in a scalable, event-driven architecture, ensuring high performance and maintainability.\nImplemented container orchestration using **Kubernetes** for efficient deployment and management of microservices, leading to a **30%** reduction in time-to-deploy.\nDesigned and maintained cloud infrastructure on **AWS**, ensuring compliance with best practices for security and scalability in an agile environment.\nManaged databases using **PostgreSQL**, optimizing queries to improve performance by **25%**, while ensuring data integrity and consistency.\nIntegrated **Kafka** as a messaging layer for real-time data processing, facilitating seamless communication between microservices and achieving a **20%** increase in throughput.\nDeveloped and maintained logging and monitoring solutions with **ELK** stack, enhancing observability for production systems and reducing downtime incidents by **15%**.\nCollaborated with cross-functional teams to adopt **Domain-Driven Design** principles, ensuring all teams had a shared understanding of the business domains and enhancing the development process.\nPromoted team collaboration through regular code reviews, maintaining high standards of code quality and mentoring junior developers to advance their skills and confidence.\nDemonstrated strong problem solving and communication skills during the development cycle, effectively addressing blockers and ensuring smooth project progression.\nFostered a culture of curiosity within the team, encouraging experimentation with new technologies and strategies to continuously improve backend services and processes."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Go** and **Ruby** for building efficient, high-performance backend services, enhancing overall application reliability and responsiveness.\nDesigned and implemented **Kubernetes** clusters for seamless deployment and scaling of applications, reducing downtime by **30%** during updates.\nLeveraged **AWS** cloud services to optimize infrastructure costs, achieving savings of **15%** while maintaining performance standards.\nImplemented a robust data storage solution using **PostgreSQL**, ensuring data integrity and optimizing query performance for scalable applications handling millions of transactions.\nIntegrated **Kafka** for reliable messaging and real-time data streams, supporting high throughput and low latency in financial transactions.\nDeveloped monitoring and logging systems using the **ELK** stack, improving system observability and reducing troubleshooting time by **40%**.\nApplied **Domain-Driven Design** principles to align software architecture with business needs, facilitating better communication between technical and non-technical stakeholders.\nEngaged in team collaboration through regular code reviews and pair programming sessions, fostering a culture of **code quality** and continuous improvement.\nDemonstrated **problem-solving** capabilities by proactively addressing and resolving complex issues in system architecture and implementation.\nExercised strong **communication skills** to facilitate knowledge sharing and enhance team productivity in both technical and non-technical discussions.\nCultivated a mindset of **curiosity** leading to the exploration of new technologies, resulting in the successful integration of innovative solutions into existing workflows."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Go** and **Ruby** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\nEngineered event-driven architecture using **Kafka** for real-time features, enabling responsive order updates, dynamic inventory tracking, and real-time customer support, contributing to a **30%** reduction in response time.\nCollaborated with cross-functional teams to implement **Kubernetes** for container orchestration and deployment, streamlining development workflows and enhancing team collaboration for faster feature delivery.\nEnsured robust application performance by managing **PostgreSQL** for distributed data storage, achieving **99.99%** uptime and fault tolerance for high-traffic e-commerce workflows.\nIntegrated advanced monitoring solutions using **ELK** stack to enhance code quality and problem-solving capabilities, leading to a **40%** reduction in downtime through proactive issue detection.\nCultivated a collaborative work environment, demonstrating strong communication skills and curiosity to explore new technologies, resulting in improved code quality and team performance.\nApplied Domain-Driven Design principles to create maintainable and scalable system architecture, aligning with business goals and user needs.\nFacilitated A/B testing and risk mitigation during major platform updates through feature flags and blue-green deployments using **Kubernetes**, resulting in smoother transitions with minimal user impact.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript, Go, Ruby\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, EmberJS\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Kafka, ELK, Domain-Driven Design, event-driven architecture, team collaboration, code quality, problem solving, communication skills, curiosity",
  "apply_company": "Qonto"
}