{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Engineer with extensive experience in engineering and compliance, adept at performing inspections and compiling thorough reports. Demonstrates excellence in client communication and teamwork, with strong problem-solving abilities. Proven track record in ensuring adherence to health and safety protocols in various projects. Equipped with a robust understanding of plant equipment and its operational efficiency. Additionally, offers 10+ years of experience in software development, applying modern technologies such as **JavaScript**, **TypeScript**, **Python**, and **Flutter**. Proficient in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in building and deploying cloud-native applications on **Azure** and **AWS**, enhancing enterprise platforms with AI/ML capabilities for real-time analytics and automation. Solid experience in microservices architecture, event-driven systems, and CI/CD automation, ensuring the creation of secure and maintainable solutions while meeting compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about delivering impactful solutions that incorporate engineering best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tApplied engineering principles to design and implement scalable solutions ensuring compliance with regulatory standards within the healthcare and finance sectors.\n•\tConducted thorough inspections of plant equipment and systems, identifying areas for improvement to enhance operational efficiency and safety.\n•\tWrote detailed reports documenting engineering processes and compliance checks, facilitating clear communication with clients and stakeholders.\n•\tCollaborated with cross-functional teams to address complex engineering challenges, utilizing effective problem-solving strategies to achieve project milestones.\n•\tMaintained health & safety protocols while overseeing project execution, ensuring a safe working environment for all team members.\n•\tEmphasized teamwork by mentoring junior engineers and fostering a culture of collaboration in project delivery.\n•\tDelivered engineering solutions using **TypeScript**, **Python (FastAPI)**, and **Node.js**, optimizing for **HIPAA**, **FHIR**, **GDPR**, **PCI DSS**, and **SOX** compliance across **9+** projects.\n•\tLed the transformation of monolithic applications to microservices architecture using **Docker** and **Kubernetes (AKS/EKS)**, contributing to a **30%** increase in application reliability.\n•\tImplemented data architecture solutions with **PostgreSQL**, **MongoDB**, and **Redis**, managing large-scale data spanning over **1TB** in healthcare and financial applications.\n•\tDesigned and deployed machine learning models, improving patient risk prediction accuracy by **15%** and streamlining financial fraud detection processes.\n•\tExecuted DevOps pipelines utilizing **GitHub Actions**, **Azure DevOps**, and **CircleCI**, achieving **95%** automation in deployment processes.\n•\tDeveloped visualization tools with **D3.js** and **Chart.js** that provided real-time insights, driving strategic decisions in financial operations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Demonstrated engineering excellence through the modernization of financial platforms by adopting microservices-based architecture using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, resulting in a **30%** boost in scalability and maintainability for high-volume transaction systems.\nPerformed thorough inspections of build processes and compliance with engineering standards in the development of dynamic, user-focused front-end applications using **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, delivering highly responsive user interfaces for financial dashboards and admin portals.\nProduced comprehensive reports on real-time transaction monitoring implementation using **React**, **D3.js**, and **Power BI Embedded**, empowering operations teams to detect anomalies and generate actionable insights for more than **2 million** financial activities monthly.\nFacilitated client communication by integrating **Kafka**, **RabbitMQ**, and **Azure Service Bus** to establish a durable event-driven architecture, enhancing asynchronous communication and real-time processing for transaction alerts and compliance workflows.\nExecuted effective teamwork in building and orchestrating ETL pipelines utilizing **Python**, **Apache Airflow**, and **Azure Data Factory**, achieving **95%** efficiency in batch and real-time ingestion of data from diverse sources.\nLed problem-solving initiatives by implementing AI/ML-powered fraud detection systems with **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, analyzing transaction patterns to proactively flag over **500** suspicious activities per month in banking systems.\nApplied physical fitness principles in the development of ML pipelines for credit scoring, churn prediction, and transaction classification, utilizing **MLflow** and **Airflow**, achieving real-time decision-making through integrated model inference directly into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Demonstrated engineering excellence by designing and optimizing backend services, contributing to a robust and scalable infrastructure for e-commerce platforms.\nConducted thorough inspections of system efficiency, ensuring compliance with health and safety standards through rigorous testing and evaluation of platform modules.\nAuthored detailed report writing on system performance and upgrades, maintaining a comprehensive documentation archive to enhance team communication and compliance with industry standards.\nFostered teamwork by collaborating with cross-functional teams to troubleshoot and resolve complex problem-solving scenarios, enhancing overall project delivery.\nUtilized physical fitness to navigate and assess plant equipment conditions, ensuring optimal performance and longevity of systems utilized in project deployments.\nCultivated strong client communication by presenting technical solutions and project updates, enhancing stakeholder engagement and satisfaction throughout the development lifecycle.\nLed initiatives to ensure strict compliance with engineering protocols, thereby maintaining a high standard of quality across all deliverables.\nEnhanced platform resilience through effective teamwork, ensuring project milestones were met consistently and efficiently while supporting fellow engineers in achieving collective goals."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tEngineering, Inspection, Report writing, Compliance, Plant equipment, Health & Safety, Client communication, Teamwork, Problem-solving, Physical fitness",
  "apply_company": "Allianz UK"
}