{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior DevOps Engineer with 8 years of extensive experience in optimizing deployment pipelines and infrastructure management using **Azure**, **AWS**, **Ansible**, **Terraform**, **Kubernetes**, and **Jenkins**. Proficient in Infrastructure as Code and automation, leveraging **Bash**, **PowerShell**, and **Linux** for system management. Skilled in monitoring and observability tools including **Grafana**, **Prometheus**, **Elastic**, and **Kibana** to ensure high availability and system performance.\n\nMy background as a Full Stack Developer enriches my DevOps role by bringing a strong understanding of application architectures and the development lifecycle, employing **Python** for scripting and automation. I have successfully led initiatives that resulted in reduced deployment times by up to 50%, and increased system reliability through robust CI/CD practices using **GitLab**. I am also well-versed in observability tools like **Jaeger** and **Kiali** for tracing and monitoring.\n\nPassionate about creating efficient solutions that are in compliance with industry standards, I leverage my technical skill set to deliver top-notch DevOps strategies that support business goals.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented enterprise-level DevOps pipelines utilizing **Azure DevOps**, **Jenkins**, and **GitLab**, ensuring efficiency in CI/CD processes through automated testing and deployment strategies.\nBuilt and maintained Infrastructure as Code using **Terraform** and **Ansible** to streamline environment provisioning and configuration management across cloud platforms (**AWS**, **Azure**).\nManaged Kubernetes clusters for container orchestration, enabling scalable deployment and orchestration of microservices, ensuring high availability and performance across the **Kubernetes** ecosystem.\nMonitored application performance and health using **Prometheus**, **Grafana**, and **Elastic** tools such as **Kibana** to enable proactive system management and troubleshooting.\nDeveloped scripts using **Bash** and **PowerShell** for automation of routine tasks, enhancing operational efficiency and reducing manual overhead by up to **30%**.\nDesigned and integrated logging and monitoring solutions using **Elastic Stack**, enabling comprehensive observability across various infrastructures and applications, resulting in improved incident response times by **25%**.\nCollaborated with cross-functional teams to optimize and secure cloud infrastructure, ensuring compliance with industry standards and best practices in both **AWS** and **Azure** environments.\nConducted in-depth capacity planning and performance tuning for hosted applications, enabling resources optimization that improved operational performance by **15%**.\nParticipated in the continuous improvement of cloud strategies, leveraging **Linux** expertise to maintain and support agile, cloud-native application deployments securely.\nChampioned IT security protocols including access control and encryption strategies, significantly reducing vulnerabilities across multiple cloud services and platforms."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **Infrastructure as Code** using **Terraform** and **Ansible** to automate and manage cloud infrastructure deployment on **Azure** and **AWS**, ensuring consistent and reliable environments across **5** projects.\nDeveloped CI/CD pipelines with **Jenkins** and **GitLab** to streamline the build, test, and deployment processes, achieving a reduction in deployment times by **30%**.\nManaged container orchestration and workloads in **Kubernetes**, optimizing resource utilization for applications with over **100** microservices running concurrently.\nAutomated monitoring and logging solutions using **Prometheus**, **Grafana**, and **Elastic Stack** (including **Kibana**), leading to a **40%** improvement in system observability and incident response times.\nConducted regular system performance tuning and optimization on **Linux** servers, reducing latency by **15%** across critical applications and improving user satisfaction metrics.\nCreated custom scripts using **Python**, **Bash**, and **PowerShell** for system administration and operational tasks, enhancing workflow efficiency by automating repetitive processes.\nCollaborated with development teams to implement **Kiali** and **Jaeger** for service mesh and distributed tracing, facilitating easier debugging and enhancing system reliability.\nProvided expert guidance on best practices for DevOps methodologies, leveraging years of experience to mentor juniors and lead a team effectively in achieving common goals."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented **Infrastructure as Code** using **Terraform** and **Ansible** to automate deployment pipelines and manage cloud resources on **Azure** and **AWS**, ensuring consistent and reproducible environments across a team of **9** developers.\nUtilized **Kubernetes** for container orchestration, managing deployments and scaling of microservices, achieving a **30%** reduction in downtime during application rollouts.\nDeveloped CI/CD pipelines utilizing **Jenkins** and **GitLab**, facilitating an efficient workflow for build, test, and deployment, resulting in a **50%** acceleration of release cycles.\nMonitored system performance and reliability using **Prometheus**, **Grafana**, **Elastic**, and **Kibana**, allowing for proactive identification of bottlenecks and achieving an **80%** decrease in incident response times.\nManaged Linux servers and environments with scripting in **Python**, **Bash**, and **PowerShell**, improving operational efficiency and reducing manual configuration efforts by **25%**.\nOrchestrated infrastructure monitoring with **Jaeger** and **Kiali**, providing end-to-end visibility into service performance and ensuring compliance with SLAs.\nCollaborated with development teams to implement security best practices using **RBAC** and **OAuth 2.0**, maintaining GDPR compliance and enhancing data protection.\nStreamlined cloud resource management practices, leveraging automation tools to decrease costs and simplify operational responsibilities across multiple environments."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Bash, PowerShell\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, Jenkins\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot, Elastic, Kibana, Grafana, Prometheus, Jaeger, Kiali",
  "apply_company": "Vodafone"
}