{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Golang Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Golang Engineer with 8 years of experience, I bring strong expertise in **Go**, alongside proficiency in **TypeScript**, **Python**, **Vue**, and **React**. I have a proven track record in developing scalable applications leveraging cloud technologies, particularly using **Docker** and **Kubernetes** for container orchestration and deployment. My experience spans architecting microservices and implementing **REST**ful APIs, enabling CI/CD pipelines to enhance development workflows and deployment efficiency.\n\nIn addition to my technical prowess, I have successfully led teams, providing mentorship and fostering collaboration, and I excel in communication across cross-functional teams. My background includes utilizing advanced technologies such as generative AI for innovative solutions, as well as developing robust applications in compliance with industry standards. With experience in database management using **Postgres**, I ensure data-driven decision-making and application performance. I am committed to delivering high-performance solutions that drive results.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Golang Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Designed and implemented robust microservices utilizing **Go** and **Docker**, enhancing scalability and maintainability of healthcare and financial applications.\n- Engineered efficient back-end architecture using **Postgres** to optimize data storage, retrieval, and transaction processing.\n- Developed user interfaces with **TypeScript**, **Vue**, and **React** to deliver interactive and responsive web applications, adhering to user experience best practices.\n- Led cross-functional teams in adopting **CI/CD** pipelines for continuous integration and deployment processes, driving a **30%** increase in deployment frequency.\n- Mentored junior developers in best practices and technologies, enhancing team skills in **Go**, front-end frameworks, and cloud infrastructure.\n- Collaborated on RESTful API design and integration, ensuring seamless communication between front-end and back-end services, while maintaining documentation for easier onboarding of new developers.\n- Conducted code reviews and performance optimization sessions, resulting in a **25%** reduction in application load times and overall improved system efficiency.\n- Engaged in Agile methodologies, participating in regular scrum meetings to maintain clear communication and project progress across the team.\n- Integrated generative AI features into solutions, enhancing data-driven decision-making capabilities for users and stakeholders, and facilitating advanced analytics capabilities across applications.\n- Established effective test strategies utilizing **Docker** for local testing environments, improving deployment reliability and lowering error rates in production environments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed robust financial applications using **Go** and **Postgres**, leveraging best practices for code quality, performance, and scalability in transaction processing systems.\nConstructed and maintained dynamic front-end solutions with **TypeScript**, **Vue 3**, and **React 18**, ensuring seamless integration with back-end services for enhanced user experiences in financial dashboards.\nLed CI/CD practices to streamline deployment processes using **Docker** and **Kubernetes**, achieving a deployment frequency of **10 times per month**, significantly reducing production downtime.\nEnhanced application interoperability by designing and implementing RESTful APIs, fostering better communication between microservices and driving a **30% improvement** in app response times.\nMentored junior developers by providing guidance on **generative AI** applications and software design patterns, improving their technical skills and productivity metrics by **25%**.\nCollaborated with cross-functional teams to facilitate effective communication, ensuring alignment on project deliverables and timelines, resulting in a **20% reduction** in project delivery delays.\nCreated deployment strategies using cutting-edge tools, enabling operational efficiency while working with financial data at scale by optimizing ETL processes through **Python** and cloud services.\nImplemented feedback mechanisms for continuous improvement, actively participating in code reviews, and promoting best practices among team members, fostering a culture of shared learning and innovation."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed microservices architecture using **Go** and **Postgres** to enhance functionality and maintainability in a large-scale application, facilitating seamless integration and deployment processes.\nUtilized **Docker** and **Kubernetes** for containerization and orchestration, ensuring consistent environments and smooth CI/CD pipelines for over **50** deployment cycles per month.\nEngineered RESTful APIs along with **TypeScript**, **Vue**, and **React** for building dynamic, interactive front-end functionalities, improving user engagement metrics by over **30%**.\nMentored junior developers in best practices surrounding clean code principles and effective communication, fostering a collaborative and synergistic team environment.\nIntegrated **generative AI** frameworks into existing workflows, leading to an innovative feature set that includes personalized user experiences and improved interface system complexity.\nCollaborated on cross-functional teams, utilizing exceptional communication skills to translate technical requirements into user-centric solutions, resulting in a **20%** decrease in project delivery time.\nEmployed CI/CD methodologies to automate deployment processes, reducing manual efforts and cutting release time by **15%** while maintaining high quality standards.\nBuilt performance monitoring tools that ensure application reliability, achieving a **99.9%** uptime across all deployed services."
    }
  ],
  "skills": "**Programming Languages:**\n\tGo, Python, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Redis, generative AI, mentoring, communication",
  "apply_company": "Threecolts"
}