{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Technical Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Technical Engineer with 13+ years of experience in developing high-performance applications across diverse sectors, including healthcare and finance. Proficient in **JavaScript**, **Python**, **SQL**, and familiar with **Java** and **C#** for robust backend and frontend solutions. Hands-on expertise in API development, utilizing cutting-edge frameworks such as **React**, **Node.js**, **Next.js**, and **Django**. \nSkilled in deploying applications on **AWS**, **Azure**, and familiar with **GCP**, ensuring scalable, cloud-native architectures. Demonstrated ability in implementing microservices and event-driven architecture while utilizing **Git** for version control. \nExperienced in compliance-driven environments, ensuring strict adherence to standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Adept in project management and documentation, with strong analytical skills that enhance problem-solving capabilities. Committed to delivering excellent customer service and clear communication across technical and non-technical stakeholders.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Technical Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **Python**, and **C#** to design and build robust full-stack platforms for healthcare and fintech, ensuring compliance with regulations such as HIPAA and GDPR.\nDeveloped RESTful APIs and integrated services for seamless data exchange across applications, leveraging **SQL** databases and **AWS** for storage solutions.\nImplemented best practices in security and **networking**, ensuring applications adhere to high standards of safety and reliability throughout development.\nLed projects managing timelines and deliverables using **JIRA** and agile methodologies, enhancing team collaboration and project efficiency during execution.\nExecuted CI/CD pipelines to automate deployment processes using **GitHub Actions** and **Azure DevOps**, which increased deployment efficiency by **30%**.\nTransformed legacy systems into microservices-based architectures using **AWS Lambda** and **Azure Functions**, improving system scalability and fault tolerance by **25%**.\nConducted analytical assessments to optimize system performance and user experience based on customer feedback, ensuring high levels of documentation and customer service.\nDeveloped comprehensive testing strategies with frameworks like Jest and PyTest, ensuring a coverage rate of over **85%** across various application components.\nIntegrated modern data visualization tools like **D3.js** and **Power BI Embedded** for real-time analytics, enhancing insights into key operational metrics by **40%**.\nCollaborated with cross-functional teams, effectively communicating in **English** to ensure seamless integration of features and adherence to project specifications."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **Python** for modernizing core financial platforms, migrating to microservices architecture with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability and performance for **9** high-volume transactional systems.\nDeveloped interactive front-end applications using **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, employing **Redux Toolkit** and **Tailwind CSS** to deliver sleek, responsive interfaces for financial tools and admin panels, significantly improving user engagement.\nDelivered real-time analytics dashboards incorporating **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies, resulting in a **30%** reduction in response time for detecting irregularities.\nEngineered a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance, improving system reliability by **25%**.\nConstructed ETL pipelines for ingesting financial data from internal and third-party sources with **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing, facilitating data availability in less than **5 minutes**.\nDeveloped and deployed machine learning models for fraud detection utilizing **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns, achieving an accuracy rate of over **90%**.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, enhancing prediction reliability and increasing throughput by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and **Python** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules including checkout and order fulfillment.\nDeveloped and maintained APIs leveraging **AWS** services for hosting and deployment, ensuring efficient communication between frontend and backend systems.\nApplied strong analytical skills to engineer real-time features using **Kafka** and **RabbitMQ**, enabling responsive order updates and dynamic inventory tracking processes.\nCreated frontend applications using **React (18)** and **Angular**, enhanced with **TypeScript** and **Redux Toolkit**, achieving an average load time reduction of **30%** on both web and mobile platforms.\nLeveraged **PostgreSQL** and **MongoDB** for secure and fault-tolerant data storage, achieving a throughput of **1000+** concurrent database connections during peak traffic.\nIntegrated AI/ML-based recommendation engines using **TensorFlow** and **LightGBM** that improved conversion rates by **20%** through personalized product listings.\nImplemented caching mechanisms with **Redis**, resulting in a **40%** improvement in application responsiveness by optimizing product metadata and shopping cart sessions.\nManaged project deployments using **Kubernetes** namespaces and equipped feature flags with **Azure** DevOps tools to facilitate controlled rollouts and A/B testing, minimizing downtime during critical updates.\nDesigned SEO-friendly e-commerce UIs utilizing **Next.js**, optimized for mobile-first engagement and compliance with accessibility standards such as WCAG 2.1.\nDeveloped secure payment workflows integrated with **Stripe** and **PayPal**, ensuring PCI-compliant handling of sensitive data, aiming for zero breaches.\nApplied role-based access control (RBAC) and **OAuth 2.0** to enhance security for customer and admin access, maintaining GDPR compliance throughout the platform."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, JavaScript, Python, C#, SQL\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services, GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Salesforce, JIRA, networking, security, English, documentation, customer service, project management, analytical",
  "apply_company": "Sovos"
}