{
  "name": "Tomasz Lee",
  "role_name": "Senior Reliability Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dedicated Senior Reliability Engineer with 9+ years of experience in reliability engineering, network engineering, and risk assessment. Proven expertise in designing and verifying robust systems while adhering to safety standards and method statements. Strong analytical and problem-solving abilities complemented by excellent communication and collaboration skills. Leverages technical knowledge in **.NET**, **C#**, **ReactJS**, **NextJS**, and cloud services to enhance application performance and reliability. Experienced in implementing microservices architecture and utilizing frameworks such as **Apache Kafka**, **RabbitMQ**, and **Redis** to optimize development processes and ensure the delivery of high-quality solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Reliability Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Executed reliability engineering strategies to ensure system resilience following **safety standards** and **risk assessment** protocols, including the application of **network engineering** principles.\nDesigned and verified systems in alignment with CRE Accreditation requirements, enhancing infrastructure reliability and efficiency.\nCollaborated with cross-functional teams to develop method statements that support project objectives, utilizing strong **problem-solving** and **communication** skills.\nAnalyzed and assessed system performances through comprehensive **design** evaluations, effectively diagnosing issues and implementing improvements.\nDrove initiatives to enhance reliability metrics, facilitating a 25% increase in overall performance metrics in adherence to industry benchmarks.\nConducted thorough verifications of engineering designs using modern analysis tools, improving adherence to safety and operational standards by 30%.\nUtilized strong **analytical skills** to develop solutions addressing complex networking challenges, leading to improved system reliability.\nFostered collaboration among team members to enhance project delivery efficiency, achieving a 20% reduction in project timelines.\nLed training sessions and workshops on safety standards and reliability practices, enriching team knowledge and compliance.\nDeveloped comprehensive reports to communicate findings and recommendations to stakeholders, improving information flow and decision-making processes."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Implemented **network engineering** strategies to enhance system reliability, ensuring compliance with **CRE Accreditation** and safety standards.\n• Conducted thorough **risk assessments** for engineering designs, utilizing **analytical skills** to identify potential failure points and develop mitigation methods.\n• Designed and verified system components following strict **safety standards**, which led to a **20% increase** in operational safety metrics.\n• Collaborated with cross-functional teams to redefine project requirements, enhancing **communication** and **collaboration**, which resulted in on-time project delivery at a **95%** success rate.\n• Developed comprehensive **method statements** that outlined safety and operational procedures, helping achieve a **30% reduction** in compliance violations.\n• Employed **problem-solving** techniques to troubleshoot network issues, reducing network downtime by **15%** through effective root cause analysis.\n• Conducted training sessions for engineering teams on reliability concepts and **verification** processes, improving team skill sets and efficiency by **25%**.\n• Championed the integration of advanced **reliability engineering** methods, leading to improved system performance evaluations across various projects.\n• Facilitated workshops focused on enhancing **design** strategies, improving stakeholder engagement and project outcomes by fostering better teamwork."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Conducted thorough **risk assessments** to ensure compliance with **safety standards**, enhancing system reliability by **15%**.\n• Developed and maintained **method statements** that streamlined processes for engineering tasks, improving operational efficiency by **25%**.\n• Collaborated extensively within cross-functional teams to foster **communication** and ensure alignment on project goals, leading to timely project delivery by **30%**.\n• Leveraged strong **analytical skills** to identify issues in network systems, proposing **design** solutions that improved **reliability engineering** metrics.\n• Participated in **verification** processes to ensure network designs meet necessary standards and regulations, enhancing overall network integrity.\n• Maintained relationships with **Network Rail** stakeholders, contributing insights for improved project outcomes and compliance with industry regulations.\n• Offered proactive **problem-solving** strategies to mitigate risks and enhance system performance, contributing to a safer operational environment.\n• Provided detailed technical support and documentation, improving knowledge transfer among teams and reducing onboarding time by **40%**."
    }
  ],
  "skills": " **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL\n\n **Cloud & Infrastructure**\n\tAWS, Azure, CI/CD pipelines\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n **DevOps**\n\tGit, GitHub\n\n **Other**\n\tUX/UI Design, Python, Redux, Solidity, Ether.js, Web3.js, Ethereum, analytical skills, problem-solving, communication, collaboration, risk assessment, reliability engineering, network engineering, design, verification, method statements, safety standards, CRE Accreditation, Network Rail",
  "apply_company": "Myticas Consulting"
}