{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Frontend Engineer with 8 years of experience, I possess advanced skills in **React**, **Next.js**, **TypeScript**, and UI/UX design, along with proficiency in modern frameworks such as **WebGL**, **Three.js**, and **React Three Fiber**. My expertise extends to implementing animations and enhancing user experiences using **Tailwind** and **Radix UI**. Additionally, I have hands-on experience with testing frameworks like **Vitest**, **Cypress**, and **Playwright**, ensuring high-quality deliverables through continuous integration.\n\nMy background includes building high-performance applications integrating AI technologies from **OpenAI**, **Hugging Face**, and **LangChain** for innovative solutions. I have developed a keen understanding of REST and GraphQL APIs along with real-time data processing using **WebSocket**. I am also proficient in backend technologies like **Node.js** and **Python**, and have utilized **Docker** for containerization, ensuring seamless deployment workflows.\n\nWith a solid track record in the healthcare and financial sectors, I possess a strong foundation in microservices architecture, event-driven systems, and CI/CD automation. My experience in innovative development frameworks and tools allows me to contribute effectively to enterprise-grade platforms that leverage AI and machine learning capabilities.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable web applications using **React** (17-18), **Next.js**, and **TypeScript**, ensuring high-performance front-end architecture and adherence to UI/UX best practices.\n• Implemented RESTful and **GraphQL** APIs for seamless integration between client and server, enhancing application functionality and responsiveness.\n• Designed engaging and animated user interfaces with **WebGL**, **Three.js**, **React Three Fiber**, and **Tailwind**, contributing to intuitive user experiences.\n• Integrated AI technologies, including **OpenAI** and **Hugging Face**, into applications to provide advanced features like personalized health recommendations and automated content generation.\n• Built and optimized client-side applications with **Cypress**, **Vitest**, and **Playwright** for comprehensive end-to-end, unit, and integration testing, covering 100% of critical user journeys and functionalities.\n• Collaborated with cross-functional teams to conceptualize and prototype designs using **Figma** and **Framer**, ensuring alignment with both technical and design specifications.\n• Utilized **Docker** for containerization, promoting consistency across development and production environments, and enhancing deployment efficiency by reducing setup time by **50%**.\n• Led migration efforts to modern frameworks like **React** and **Next.js**, resulting in a **25%** improvement in application load time and performance metrics.\n• Engaged in continuous learning and implementation of new technologies, focusing on improving system architecture and leveraging tools like **Tailwind** and **Radix UI** for enhanced design productivity.\n• Mentored junior developers in frontend best practices, promoting knowledge sharing and team growth, leading to a **30%** increase in team project delivery timelines."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed dynamic and user-centric web applications leveraging **React (18)**, **Next.js**, and **TypeScript**, employing **Tailwind CSS** for responsive design and efficiency in UI/UX.\nEngineered high-performance data-driven interfaces for dashboards utilizing **D3.js** for data visualization and analytics, ensuring smooth monitoring of financial transactions and anomalies.\nCollaborated on the integration of backend services through **REST** and **GraphQL** APIs, facilitating seamless data retrieval and enhancing system performance for user interactions.\nImplemented robust event handling using **WebSocket** technologies to support real-time data updates and improve the responsiveness of user-facing applications.\nParticipated in architecture discussions to enhance the scalability and maintainability of applications, utilizing **Node.js** for server-side logic and **Python** for managing backend processes effectively.\nConducted performance optimizations through modern testing frameworks such as **Cypress**, **Vitest**, and **Playwright**, achieving a 30% reduction in load times for critical application paths.\nIntroduced AI capabilities by integrating **OpenAI** and **Hugging Face** for intelligent features in user interfaces, improving customer interaction through personalized experiences.\nCollaborated in the design phase using tools like **Figma** and **Framer**, achieving 100% alignment between design and implementation.\nLeveraged containerization with **Docker** to standardize development environments, enhancing deployment consistency and reducing setup times by 25% across teams."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed responsive, high-performance frontend applications using **React (18)**, **Next.js**, and **TypeScript**, focusing on delivering fast, engaging user experiences across web and mobile platforms.\n- Integrated advanced UI/UX practices with tools like **Figma** and **Tailwind CSS**, ensuring accessibility compliance (WCAG 2.1) and enhancing mobile-first design.\n- Implemented real-time data features utilizing **WebSocket** for dynamic user interactions, enhancing customer engagement during crucial processes like checkout.\n- Utilized **GraphQL** and **REST** APIs for efficient data management, ensuring high availability and reduced latency in data fetching.\n- Leveraged state management libraries such as **Redux Toolkit** to enhance application performance and maintain a seamless user experience.\n- Led the creation of interactive animations with **Three.js** and **React Three Fiber**, enriching the visual appeal and interactivity of the platform.\n- Collaborated with backend teams utilizing **Node.js**, optimizing data flow and application performance through efficient architectural patterns.\n- Ensured comprehensive testing and reliability of the frontend components using frameworks like **Cypress** and **Vitest**, aiming for a minimal bug rate of less than **2%**.\n- Participated in product ideations, applying AI technologies from **OpenAI**, **Hugging Face**, and **LangChain** for intelligent feature enhancements.\n- Engaged in cross-functional collaboration to drive design and functional iterations using prototyping tools like **Framer** and **Storybook**, resulting in a streamlined development process.\n- Applied Docker for containerization, facilitating a consistent development environment across multiple team members.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, React Three Fiber, Storybook, Radix UI, Tailwind\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **API Technologies:**\n\tREST, GraphQL, WebSocket\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tAI, MLflow, Airflow, Kubeflow, Figma, Framer, OpenAI, Hugging Face, LangChain, Stable Diffusion, ComfyUI, Midjourney, animation, UI/UX, Playwright, Vitest, Cypress",
  "apply_company": "Noxx"
}