{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "Skilled in **HTML/CSS**, **JavaScript**, **TypeScript**, and **Vue 2/3**, I possess extensive experience as a Full Stack Developer with 8 years in crafting high-performance solutions in the healthcare and financial sectors. My proficiency encompasses frontend technologies like **SSR**, **SSG**, and **Nuxt**, supported by a solid background in **Git**, **Docker**, and **Kubernetes** for seamless development and deployment. I specialize in creating intuitive user interfaces, ensuring robust functionality through **unit tests** and leveraging **microfrontends** for scalable projects. \n\nFocused on teamwork and self-organization, I've successfully led enterprise-grade platform developments, integrating **CI/CD** practices using **GitLab CI** and **GitHub Actions**. My tech stack also includes **websockets**, **Fetch API**, and **PWA** capabilities backed by service workers, delivering real-time data experiences. I am committed to following design patterns to enhance maintainability while ensuring compliance with industry standards. My background in **FastAPI**, **Django**, and cloud platforms **Azure** and **AWS** further strengthens my development acumen, enriching collaborative workflows in diverse environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed responsive user interfaces using **HTML/CSS**, **JavaScript**, and **TypeScript** while adhering to design patterns and best practices.\n- Implemented state management solutions in **Vue 2/3** applications utilizing Vuex for efficient data handling and rendering.\n- Ensured high code quality through unit tests using Jest, enhancing maintainability and reliability of code with **CI/CD pipelines** via **GitHub Actions**.\n- Employed **SSR (Server-Side Rendering)** and **SSG (Static Site Generation)** techniques with **Nuxt** to deliver optimized web applications that improve loading speeds and SEO.\n- Collaborated effectively in cross-functional teams, ensuring smooth communication and project delivery through **self-organization** and **teamwork**.\n- Integrated modern tools like **Vite** to enhance development speed and bundle optimization for seamless deployments.\n- Implemented **PWA (Progressive Web App)** features, such as **service workers**, to enhance the user experience with offline capabilities and push notifications.\n- Utilized **Git** for version control, streamlining collaborative development and maintaining project history.\n- Participated in designing microfrontend architecture to break monolithic applications into manageable units, enabling modular enhancements and independent deployments.\n- Led initiatives that contributed to a **30%** increase in user engagement through performance optimizations and enhanced UX design, influencing operational KPIs positively.\n- Streamlined development processes and reduced code delivery times by **25%** through the implementation of robust CI/CD practices.\n- Contributed to the efficiency of onboarding processes for new front-end technologies by documenting practices and conducting team workshops."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained high-performance front-end applications using **React (18)**, **Vue 3**, and **TypeScript**, ensuring responsive designs and user-centric interfaces that improve user engagement in financial dashboards.\nImplemented **HTML/CSS** best practices, optimizing web performance and accessibility to enhance user experience across all platforms with a focus on responsiveness and design consistency.\nCollaborated with cross-functional teams to integrate unit tests and ensure quality assurance, applying **Git** for version control and **GitHub Actions** for automated CI/CD pipelines, enhancing deployment efficiency by **30%**.\nUtilized design patterns and built microfrontend architectures, which improved code maintainability and reduced deployment times by **20%**.\nDesigned Progressive Web Applications (PWAs) featuring service workers and **WebSockets** to facilitate real-time updates, concentrating on performance metrics to meet user expectations and operational demands.\nAdopted modern development tools like **Vite** to streamline build processes, reducing development time from **45m** to **15m** per feature sprint, and increasing overall team productivity.\nParticipated actively in team collaboration and self-organization initiatives, resulting in a **15%** increase in overall project completion rate through more effective communication and resource management practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Enhanced user experiences by developing responsive, SEO-friendly e-commerce UIs using **Next.js**, **Vue 3 + Nuxt**, and **HTML5/CSS3**, optimized for mobile-first engagement and accessibility compliance (WCAG **2.1**).\nImplemented **unit tests** to ensure high code quality and application reliability while adhering to industry standards for **HTML/CSS** and **JavaScript** development.\nEngineered progressive web applications (PWAs) utilizing **service workers** and **Vite** to improve performance and accessibility on the e-commerce platform.\nLeveraged **Git** for version control and collaborated with teams using **GitHub Actions** to streamline CI/CD processes.\nUtilized design patterns and incorporated **microfrontends** architecture to enhance code reusability, maintainability, and team collaboration.\nIntegrated **WebSockets** for real-time communication features, ensuring instant user feedback and fostering dynamic interactions within the application.\nEmployed **Docker** and **Kubernetes** for containerization and orchestration, facilitating better deployment strategies and scalability across environments.\nCollaborated within a team environment, demonstrating strong **teamwork** and **self-organization** skills to manage project timelines and deliver high-quality features efficiently."
    }
  ],
  "skills": " **Frontend Frameworks:**\n\tHTML/CSS, JavaScript, TypeScript, Vue 2/3, SSR, SSG, Nuxt, Vite, PWA, Service workers, Websockets, Fetch API, React, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Express\n\n**API Technologies:**\n\tREST, GraphQL\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD GitLab CI\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tArtificial Intelligence & Machine Learning, MLflow, Airflow, Kubeflow, Authentication & Security, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, design patterns, teamwork, self-organization"
}