{
  "name": "Tomasz Lee",
  "role_name": "PHP Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented PHP Developer with 9+ years of experience in crafting and implementing dynamic web applications. Proficient in **PHP**, **Symfony**, **Laravel**, and **TypeScript**, alongside hands-on expertise in **RabbitMQ** and **Kafka** for message brokering and stream processing. Strong background in RESTful APIs and microservices architecture, ensuring scalable and efficient application design. Demonstrated ability to work within an Agile methodology, fostering effective communication and collaboration across diverse teams. Committed to delivering high-quality solutions that drive business success and enhance user experience.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "PHP Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **PHP** frameworks such as **Symfony** and **Laravel** to develop robust web applications, ensuring high-performance and maintainability.\nIntegrated **RabbitMQ** for efficient task queuing and **Kafka** for seamless real-time data processing, resulting in a 30% increase in system reliability.\nDesigned RESTful APIs to facilitate communication between services, improving data accessibility and integration by 25%.\nEmployed **Git** for version control, streamlining collaboration and enhancing code quality across the development team.\nImplemented a microservices architecture to enhance modularity, enabling the scaling of applications with a 50% reduction in deployment times.\nAdopted **Agile methodology** for project management, fostering effective communication and collaboration within cross-functional teams.\nDeveloped user-centric features using **TypeScript**, enhancing code readability and maintainability by 20% over previous projects.\nLed code reviews and mentorship sessions, improving team performance and promoting best practices in software development.\nManaged CI/CD pipelines, achieving a **40%** reduction in deployment times while maintaining high standards of quality assurance.\nAchieved a **95%** customer satisfaction rate through continuous feedback loops and iterative improvements in application functionality."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **PHP** and **Laravel** frameworks to design and develop scalable web applications, enhancing software maintainability and performance.\nApplied **Symfony** for efficient backend development, streamlining the deployment process by **20%** through enhanced modularity.\nImplemented **RESTful APIs** adhering to best practices, facilitating seamless integration with third-party services and improving data communication efficiency by **30%**.\nDeveloped a microservices architecture leveraging **RabbitMQ** for asynchronous processing and **Kafka** for real-time data handling, increasing system scalability.\nCollaborated in an Agile environment to promote iterative development and maintain transparent communication, boosting team productivity.\nLed initiatives for effective version control using **Git**, establishing practices that reduced code conflict occurrences by **25%**.\nConducted training and mentorship for junior developers, fostering effective team collaboration and enhancing overall team skill levels.\nDeveloped comprehensive documentation for APIs and system architecture, ensuring clarity in project requirements and development timelines.\nPerformed code reviews that ensured high code quality and identified potential optimizations, promoting efficient team workflows.\nFacilitated team discussions to gather feedback and align on project objectives, reinforcing collaboration among team members."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and maintained web applications using **PHP**, **Symfony**, and **Laravel**, driving project impact and enhancing user experience.\n• Implemented **RabbitMQ** for message queue management, optimizing communication between microservices and reducing latency by **25%**.\n• Collaborated in an Agile team environment, participating in daily standups and code reviews to ensure high standards in quality and effective communication.\n• Integrated **RESTful APIs** into applications to facilitate seamless third-party interactions and enhance system functionality.\n• Leveraged **TypeScript** for developing scalable client-side applications, enhancing the maintainability of codebase by **30%**.\n• Utilized **Git** for version control, managing code repositories and facilitating team collaboration on projects effectively.\n• Contributed to architecture decisions focusing on **Microservices Architecture**, resulting in a reduction of deployment times by **15%**.\n• Created technical documentation and guides improving onboarding processes and knowledge transfer across teams.\n• Actively participated in collaborative sessions to enhance overall project delivery, aligning technical solutions with client needs."
    }
  ],
  "skills": "**Programming Languages**\n\tPHP, TypeScript, Python\n\n**Backend Frameworks**\n\tSymfony, Laravel, NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful APIs, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Git, GitHub\n\n**Cloud & Infrastructure**\n\tAgile Methodology, Effective Communication, Collaboration\n\n**Other**\n\tBlockchain: Solidity, Ether.js, Web3.js, Ethereum, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Messaging & Caching: Apache Kafka, RabbitMQ, Redis"
}