{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Engineer especializado/a en Inteligencia Artificial",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Software Engineer specializing in Artificial Intelligence, I bring 8 years of experience in developing high-performance solutions leveraging advanced technologies. My core areas of expertise include **Azure** services such as **App Services**, **Cosmos DB**, and **Key Vault**, as well as building APIs that seamlessly integrate with **Generative AI** and **LLMs**. I have a profound understanding of **speech-to-text** technologies and have successfully implemented **Intelligent Document Processing** solutions.\n\nI possess a strong foundation in full-stack development, utilizing frameworks and tools like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, **Django**, alongside key cloud services on **AWS**. My experience encompasses leading the development of enterprise-grade platforms that incorporate AI/ML capabilities, enabling predictive analytics and intelligent automation. I am well-versed in microservices architecture, event-driven systems, and CI/CD automation, ensuring that the applications I build are robust, secure, and compliant with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, I am skilled in developing machine learning pipelines and implementing MLOps workflows with tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer especializado/a en Inteligencia Artificial",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and integrated **AI-based features** into client-facing applications, utilizing **Generative AI** and **LLMs**, enhancing user engagement with personalized health recommendations and smart financial dashboards.\n- Designed and implemented **Intelligent Document Processing** solutions, employing **APIs** for seamless integration and data retrieval from diverse sources.\n- Leveraged **Azure** services including **Funciones de Azure**, **App Services**, and **Cosmos DB** to build robust, cloud-native applications, ensuring high availability and scalability.\n- Crafted innovative **Retrieval-Augmented Generation** solutions, improving document retrieval and contextual understanding for healthcare and financial data.\n- Integrated **speech-to-text** technologies for enhanced user accessibility, expanding the usability of applications across various demographics.\n- Implemented secure access and storage solutions using **Key Vault** for managing sensitive application secrets and ensuring compliance with industry standards.\n- Collaborated with cross-functional teams to develop, test, and deploy applications on **Azure**, utilizing CI/CD principles to streamline the software development lifecycle.\n- Conducted performance analysis and optimization for multiple services ensuring adherence to SLA with a focus on reducing latency by **30%**.\n- Managed complex data workflows and infrastructure using tools such as **Terraform** for Infrastructure as Code, maintaining consistency across environments.\n- Delivered user-centric applications, leading to a **15%** increase in user satisfaction scores and enhancing overall engagement metrics."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented AI/ML-powered solutions utilizing **Azure** services and frameworks such as **scikit-learn**, **XGBoost**, and **Azure Machine Learning** for intelligent decision-making in financial applications.\nDeveloped and integrated APIs for **Generative AI** and **Intelligent Document Processing**, facilitating seamless communication between various components of the system.\nBuilt applications leveraging **Azure App Services**, **Cosmos DB**, and **Key Vault** for secure storage and efficient data management, enhancing overall application performance.\nCreated and managed event-driven architectures using **Azure Functions** and other messaging systems to improve system responsiveness and event handling.\nExecuted complex data processing through efficient ETL pipelines with **Python** and **Azure Data Factory**, ensuring accurate and timely financial data ingestion from multiple sources.\nApplied **Retrieval-Augmented Generation** for improving user interaction models and enhancing customer service applications.\nEmployed speech-to-text technologies in developing user-friendly interfaces that streamline operations and improve accessibility.\nConducted comprehensive testing and optimization of AI models, ensuring accuracy rates exceed **90%** and significantly reducing error margins in transactions.\nUtilized prompt engineering techniques for fine-tuning interactions with **LLMs**, improving response quality in dynamic financial contexts."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Azure** services for deploying and managing AI solutions, utilizing **Azure App Services** and **Functions** for seamless integration and scalability.\nDesigned and developed RESTful **APIs** that effectively communicate with **Generative AI** models, ensuring efficient data retrieval and manipulation through strategic **Retrieval-Augmented Generation** techniques.\nImplemented **speech-to-text** functionalities within applications, enhancing accessibility and user interaction via advanced **Intelligent Document Processing** methods.\nIntegrated **Cosmos DB** for high-performance data storage and retrieval, optimizing database operations to support AI-driven applications with low latency under heavy workloads.\nUtilized **Key Vault** for managing sensitive credentials and AI model parameters, ensuring security and compliance with industry standards.\nApplied **prompt engineering** techniques to optimize model inputs, enhancing the accuracy and relevance of AI-generated outputs across multiple use cases.\nConducted thorough testing and optimization of AI workflows to improve system efficiency by **30%**, leading to faster processing times for complex queries.\nDeveloped and maintained AI-driven applications running on **LLMs**, achieving a **50%** increase in user engagement through personalized content delivery.\nCollaborated on projects utilizing cutting-edge AI technologies, contributing to a successful deployment of solutions that resulted in an annual revenue increase of **$150K** for the organization.\nMaintained high standards of code quality and documentation, supporting team collaboration and project transparency while implementing best practices in AI development."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs, Retrieval-Augmented Generation, speech-to-text\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Functions, Blob, SQL, Key Vault)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Cosmos DB\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Generative AI, LLMs, prompt engineering, Intelligent Document Processing"
}