{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Backend Engineer with 13+ years of experience specializing in high-performance application development, particularly in API integration and chatbot development. Proficient in **JavaScript**, **Node.js**, **PostgreSQL**, and **Python**, with hands-on expertise in integrating **AI APIs** such as **OpenAI**, **Gemini**, and **Anthropic** to enhance conversational interfaces and provide cutting-edge solutions. Experienced in building efficient **ETL pipelines** and leveraging prompt engineering and document parsing techniques to optimize data flow and user interactions. \nAdditionally, well-versed in implementing microservices and CI/CD pipelines in cloud environments on **AWS** and **Azure**. Holds a strong background in compliance-driven development, ensuring adherence to standards such as HIPAA and PCI DSS. Recognized for delivering projects that align with business goals while managing complex system architectures.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained backend systems leveraging **JavaScript** and **Node.js** for seamless API integration and chatbot development, ensuring efficient data handling and processing for health and finance domains.\n• Designed ETL pipelines for data processing and storage utilizing **PostgreSQL**, optimized for high performance with a focus on real-time analytics and compliance.\n• Implemented AI API integration using **OpenAI APIs**, **Gemini APIs**, and **Anthropic APIs** for advanced conversational interfaces and document parsing functionalities, enhancing user interactions.\n• Engineered and optimized backend services using **Python** for enhanced data management and processing capabilities, ensuring secure and reliable interactions.\n• Collaborated with cross-functional teams to define and deploy robust API integration strategies, facilitating efficient communication between frontend and backend systems.\n• Developed and deployed high-quality backend infrastructure supporting chatbot development, including prompt engineering techniques to enhance user experience.\n• Maintained extensive documentation and testing protocols ensuring smooth deployment and integration of conversational interfaces and AI-driven features.\n• Monitored and maintained the performance of backend systems, using metrics and analytics to drive continuous improvement and efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed and integrated APIs using **Node.js** and **Python** to enhance back-end functionality and communication with various services.\nImplemented ETL pipelines for data ingestion from PostgreSQL and third-party sources, ensuring efficient data processing and storage solutions.\nUtilized **PostgreSQL** for database management, ensuring reliable data retrieval and storage in compliance with application requirements.\nEngaged in extensive API integration with **OpenAI**, **Gemini**, and **Anthropic** APIs, building conversational interfaces and chatbots that enhance user interaction.\nCreated effective prompt engineering techniques for document parsing, optimizing data accuracy and extraction processes.\nCollaborated with cross-functional teams to deliver scalable backend solutions that support high-traffic applications.\nMonitored system performance and implemented optimizations, successfully reducing latency by **25%** and improving overall system efficiency.\nRapidly adapted to emerging technologies, contributing to team efforts around machine learning and AI API integration in backend services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and **Node.js** to develop and optimize backend services, ensuring high availability and scalability in API integrations for seamless functionality across various modules.\nEngineered **API integration** with **OpenAI APIs**, **Gemini APIs**, and **Anthropic APIs** to implement advanced conversational interfaces and chatbot development for enhanced user interaction.\nDesigned and executed **ETL pipelines** that efficiently managed data transformation and loading processes, optimizing performance and reliability when handling large datasets.\nApplied **Python** to build robust backend services, implementing features that improve system efficiency while maintaining compliance with GDPR and user data protection standards.\nLeveraged **PostgreSQL** for database optimization, ensuring fast and reliable data access across high-traffic applications while utilizing techniques that enhance database interactions.\nDeveloped and maintained real-time features through effective **API integration**, empowering dynamic user experiences and consistent feedback through optimized server responses.\nImplemented sophisticated **document parsing** techniques which enhanced data processing workflows, enabling efficient information retrieval and manipulation.\nEngaged in prompt engineering methodologies to refine conversational components of the platform, tailoring responses based on user interactions and queries.\nFacilitated the development of scalable backend solutions that successfully supported e-commerce platforms catering to **9** million users, ensuring low latency and high performance.\nCollaborated with cross-functional teams to achieve an **85%** reduction in response time for API calls, contributing significantly to improved user satisfaction and engagement."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI integration, AI API integration, OpenAI APIs, Gemini APIs, Anthropic APIs, chatbot development, conversational interfaces, prompt engineering, document parsing\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, ETL pipelines"
}