{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I am proficient in **Git**, **Java**, **Python**, **Linux**, and **Docker**, making me adept in agile development practices using tools like **Jira** and **Confluence**. I possess solid knowledge of **C** and **C++**, ensuring versatile programming capabilities. I specialize in building high-performance, scalable applications, with a strong focus on infrastructure as code principles. My background in full-stack development is complemented by my extensive experience with **JavaScript**, **TypeScript**, and **Flutter**. I have successfully delivered enterprise-grade platforms in healthcare and financial sectors, utilizing frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My hands-on cloud expertise spans **Azure** and **AWS**, and I have integrated AI/ML capabilities into my projects for predictive analytics and data processing. Additionally, my experience with microservices architecture, event-driven systems, and CI/CD automation ensures secure applications that adhere to compliance standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **C** to develop and maintain robust systems within agile frameworks, ensuring efficient project delivery through effective **Git** version control and team collaboration.\nEmployed **Docker** for containerization, streamlining application deployments and simplifying the orchestration of microservices within a CI/CD pipeline.\nDemonstrated proficiency in **C++** for system-level programming tasks, contributing to high-performance applications and improving overall system reliability.\nLeveraged **Linux** environments for application deployment and server management, ensuring optimal platform performance and security.\nParticipated in sprint planning and retrospectives, utilizing **Jira** and **Confluence** for effective project tracking and documentation, fostering open communication among team members and stakeholders.\nAdopted Infrastructure as Code (IaC) practices, enhancing deployment processes, and maintaining infrastructure consistency across environments.\nContributed to code reviews and team mentorship, utilizing strong communication skills to provide constructive feedback and facilitate knowledge sharing.\nImplemented agile methodologies to adapt to changing project requirements and improve productivity, showcasing flexibility and commitment to continuous improvement.\nEnhanced team performance by mentoring junior developers and facilitating knowledge transfer sessions on **Python** best practices and advanced **C** techniques."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Git** and **Docker** for version control and containerization, enhancing collaboration and deployment efficiency in the software development process.\nAdopted **Agile** methodologies to streamline project workflows and ensure timely delivery of software solutions, resulting in a **30%** improvement in project turnaround time.\nCollaborated with cross-functional teams to gather requirements and design software solutions that aligned with business objectives, enhancing team communication and understanding.\nLed the implementation of coding best practices using **Python** and **Java**, ensuring high-quality code and adherence to industry standards, which improved system maintainability by **25%**.\nDeveloped applications on **Linux** servers, ensuring optimal performance and reliability for financial services.\nParticipated in code reviews and provided mentorship to junior engineers, fostering a culture of continuous learning and improvement within the team.\nContributed to project documentation and knowledge sharing through **Jira** and **Confluence**, ensuring clarity and alignment on project goals and progress."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Java** in an Agile environment for designing and optimizing backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\nEmployed **Git** and **Jira** for effective version control and project management, enhancing team collaboration and code quality through best practices in version tracking and continuous integration.\nDesigned and executed real-time features using **WebSockets** and event-driven architecture with **Kafka** and **RabbitMQ**, which facilitated responsive order updates, dynamic inventory tracking, and real-time customer support for over **1 million** monthly active users.\nLeveraged **MongoDB**, **PostgreSQL**, and **Redis** for distributed data storage, ensuring a fault-tolerant and scalable database infrastructure that supports high-traffic e-commerce workflows, enhancing data access speed by **30%**.\nDeveloped scalable frontend applications using **React (18)**, **Vue 3**, and **Angular**, integrated with **TypeScript** and optimized through **Tailwind CSS**, delivering fast and responsive user experiences with an average load time reduced to under **2 seconds**.\nIntegrated AI/ML-based recommendation engines with **scikit-learn**, **LightGBM**, and **TensorFlow**, which improved product listing personalization and boosted conversion rates by **15%** in response to real-time behavioral data.\nExecuted caching strategies using **Redis**, improving application responsiveness by minimizing read latency and enhancing shopping cart performance for **10,000+** concurrent users.\nManaged **Docker** containers and infrastructure as code practices for application deployment, leading to consistent development and production environments with reduced setup times by **50%**.\nImplemented safety protocols incorporating **OAuth 2.0** and role-based access control (RBAC) to ensure secure customer and admin access, achieving GDPR compliance and enhancing user data protection across the platform.\nCommunicated effectively with cross-functional teams, ensuring clear understanding of project goals, timelines, and deliverables, which improved overall project completion rates by **20%**."
    }
  ],
  "skills": "Programming Languages:\n\tC, C++, Java, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tInfrastructure as Code, Nginx, Certbot\n\n**Other:**\n\tAgile, Git, Subversion, Linux, Jira, Confluence, Communication, MLflow, Airflow, Kubeflow",
  "apply_company": "Haystack"
}