{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Java Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Java Engineer with 13+ years of experience in delivering high-performance applications in the healthcare and financial sectors. Proficient in **Java**, **Spring**, **JavaScript**, **TypeScript**, and **ReactJS**. Specialized in developing scalable **SaaS** solutions using **Microservices** and **Event-driven** architectures. Skilled in **DevOps** practices, including **CI/CD** implementation and cloud deployment on **AWS** and **Azure**. Strong background in low-code and no-code development, with expertise in documentation processes.\n\nAdditionally, I have hands-on experience in building AI/ML-powered platforms leveraging predictive analytics and real-time processing. I am well-versed in compliance-driven development, ensuring alignment with HIPAA, FHIR, PCI DSS, and SOC 2 standards, while also having a solid foundation in MLOps with tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable microservices architectures using **Java** and **Spring**, employing event-driven design principles to enhance system responsiveness and reliability.\nImplemented CI/CD pipelines using **DevOps** tools, ensuring seamless integration and deployment workflows to the cloud, enhancing the development lifecycle.\nEngineered full-stack applications utilizing **JavaScript** and **TypeScript** frameworks, including **ReactJS**, to create dynamic and responsive user interfaces.\nPioneered the design and development of SaaS applications that adhere to high standards of documentation and usability, driving user engagement and satisfaction.\nLed the migration of legacy applications to modern **microservices**-centric architectures, ensuring enhanced scalability and maintainability across systems.\nUtilized **Redux** and **Context API** for effective state management in front-end applications, resulting in a more efficient and cohesive user experience.\nMonitored and optimized application performance, leveraging cloud services to ensure high availability and low latency for end-users.\nCollaborated with cross-functional teams to document and share best practices in software development and architectural design, fostering a culture of continuous improvement.\nImplemented automated testing frameworks such as **Jest** and **Cypress** to ensure robust quality assurance throughout the development process.\nConducted code reviews and provided mentorship to junior developers, promoting adherence to coding standards and best practices in software development."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Leveraged **Java** and **Spring** frameworks to design and implement microservices architecture, improving system scalability and maintainability in financial applications. \n- Utilized **JavaScript** and **TypeScript** to develop interactive front-end applications with **ReactJS** (18), enhancing user experience and engagement for financial tools and dashboards. \n- Integrated **Redux** and **Context API** for state management in complex applications, ensuring efficient data flow and UI responsiveness. \n- Employed SaaS principles to deliver scalable software solutions and optimize deployment processes through **DevOps** practices and **CI/CD** pipelines. \n- Designed and executed an event-driven architecture with **Kafka** and **RabbitMQ**, ensuring reliable asynchronous communications across critical workflows (e.g., payments, alerts). \n- Developed comprehensive documentation for all new features and architectural changes, streamlining onboarding and maintenance processes.\n- Managed deployments on cloud platforms, implementing automation and orchestration using **Azure Cloud Services** for improved resource management.\n- Contributed to low-code/no-code initiatives to accelerate development cycles, achieving project completion over **30%** faster. \n- Ensured the application of best practices in software development life cycle, delivering high-quality and maintainable code on each project."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Spring** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules such as checkout and order fulfillment.\nLeveraged **JavaScript** and **Typescript** frameworks, specifically **ReactJS**, to develop responsive frontend applications that enhance user experience on both web and mobile platforms.\nEmployed **microservices** architecture and implemented **DevOps** best practices to streamline development and deployment processes, achieving a **30%** reduction in time-to-market for new features.\nConfigured **CI/CD** pipelines for efficient continuous integration and delivery, incorporating automated testing and deployment strategies that improved release frequency by **50%**.\nImplemented event-driven architectures using **Kafka** and **RabbitMQ** to support real-time order updates and inventory tracking, enhancing responsiveness by **40%**.\nDocumented all technical designs and implementations to provide clear and concise communication across cross-functional teams, leading to improved collaboration in **SaaS** environments.\nAdopted cloud solutions for scalable infrastructure, optimizing resource utilization, and achieving cost savings of up to **20%** on operational expenses.\nIntegrated low-code and no-code development tools to facilitate rapid prototyping and streamline feature development, boosting productivity across teams.\n\nOriginal strengths include building secure payment workflows with **Stripe** and **PayPal**, applying tokenized transactions, and ensuring compliance with PCI regulations, as well as implementing role-based access control (RBAC) and **OAuth 2.0** for enhanced security across the platform."
    }
  ],
  "skills": "Programming Languages:\n\tJava, Python, JavaScript, Typescript\n\n**Backend Frameworks:**\n\tSpring, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReactJS, React, Vue, Angular, Redux, Context API\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, Azure: App Services, Cloud\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, SaaS, Microservices, Event-driven, Low-code, No-code, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Documentation",
  "apply_company": "AgileEngine"
}