{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior WebRTC Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior WebRTC Engineer with 13+ years of experience creating high-performance applications, specializing in **WebRTC**, **JavaScript**, and **PHP**. Proficient in version control with **git** and **GitHub**, ensuring quality assurance through open-source contributions and cross-platform testing. Known for strong teamwork abilities while also thriving in independent, self-reliant roles. Demonstrated expertise in both frontend and backend development leveraging **React**, **Next.js**, **Vue**, **Node.js**, and cloud-native deployment on **AWS** and **Azure**. Proven track record in designing AI/ML-powered platforms for predictive analytics and real-time processing, with a robust understanding of compliance standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior WebRTC Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **WebRTC** to develop and enhance real-time communication features, ensuring high-quality audio and video streaming in applications.\nImplemented and maintained collaborative functionalities using **JavaScript** and **PHP**, ensuring optimal performance and scalability once integrated with existing systems.\nFacilitated efficient version control and collaboration within development teams using **git** and **GitHub**, promoting an **open source** approach to development.\nConducted rigorous **quality assurance** tests to validate application performance, ensuring compliance with industry standards and user requirements.\nLed the cross-platform testing initiatives to guarantee seamless user experiences across multiple devices and operating systems.\nFostered a culture of **teamwork** while also encouraging **independence** and **self-reliance** among team members to enhance productivity and problem-solving capabilities.\nDelivered solutions that improved user engagement by **30%** through effective implementation of real-time features using **WebRTC** technology.\nOptimized existing workflows to decrease deployment times by **40%** utilizing best practices in **git** branching and merging strategies.\nEngaged in continuous learning and open collaboration with the tech community, contributing to **open source** projects that align with personal and team objectives."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **WebRTC** for real-time communication in applications, enhancing customer interaction and engagement through seamless video and audio services.\nDeveloped and maintained robust applications using **JavaScript** frameworks, ensuring top-notch performance and user experience across various platforms.\nCollaborated with cross-functional teams to implement **quality assurance** processes, leading to a **30%** reduction in bugs and performance issues post-deployment.\nSupported continuous integration and deployment practices through **git** and **GitHub**, promoting self-reliance and independence within the development team.\nSpearheaded efforts in **cross platform testing**, ensuring applications function flawlessly across different environments and browsers, resulting in a **20%** improvement in user satisfaction ratings.\nParticipated in open source projects, fostering a spirit of teamwork and collaboration while enhancing technical skills and community engagement.\nAnalyzed and troubleshot production issues, reinforcing the importance of quality assurance in delivering reliable solutions to end-users.\nMentored junior developers, providing guidance in **JavaScript** and **WebRTC**, and promoting effective teamwork skills to cultivate a productive development environment."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **WebRTC** technology to develop robust real-time communication features, enhancing user interaction and engagement on web and mobile platforms.\nLed collaboration efforts with team members utilizing **git** and **GitHub** to maintain high-quality code through **quality assurance** and **cross-platform testing** practices, improving deployment efficiency by **25%**.\nEmployed **JavaScript** for dynamic interface development, ensuring seamless integration between backend and frontend, which increased application speed by **20%**.\nContributed to open-source projects relevant to **WebRTC** and web development, promoting knowledge sharing and community engagement within the tech ecosystem.\nDemonstrated **teamwork** by mentoring junior developers and conducting regular code reviews, fostering a culture of independence and **self-reliance** in the team.\nDeveloped comprehensive testing strategies to ensure application stability and performance, achieving a **30%** reduction in defects post-release.\nCollaborated with cross-functional teams to assess project requirements and deliver high-quality solutions within deadlines, leading to a successful product launch and user satisfaction ratings above **90%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript, PHP, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tWebRTC\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\topen source, quality assurance, cross platform testing, teamwork, independence, self-reliance, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Nextcloud"
}