{
  "name": "Rei Taro",
  "role_name": "Senior Field Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Field Engineer with a strong foundation in **technical support**, **problem solving**, and **customer service**. Possessing over 10 years of experience in backend development, I bring a unique perspective to the role with competencies in **Windows** and **Microsoft** applications, along with excellent **administration** skills. Recognized for my ability to manage time efficiently and maintain organization in dynamic environments. Highly effective communicator with a flexible approach to travel. My background includes designing robust backend systems, specializing in **cloud-native architectures** and automation, and contributing to significant projects for esteemed firms like VISA, Sii Poland, and Reply Polska. I leverage my expertise in **Python** (FastAPI, Django, Flask) and **cloud platforms** (AWS, Azure) to create high-quality solutions, enhancing operational efficiency and client satisfaction.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Provided **technical support** by troubleshooting and resolving **Electro-mechanical** system issues, ensuring optimal performance and client satisfaction.\nDemonstrated exceptional **problem-solving** skills by diagnosing complex issues within **laboratory** settings, resulting in a **15%** reduction in downtime.\nUtilized **Windows** and **Microsoft** tools for data analysis and reporting, enhancing communication and organizational workflows within the team.\nDeveloped and executed **administration** processes for equipment maintenance scheduling, ensuring timely completion of tasks with a **30%** improvement in efficiency.\nFostered strong **customer service** relationships by effectively communicating technical specifications and providing appropriate solutions, leading to a **20%** increase in client retention.\nExercised **time management** and **organization** skills while allocating resources effectively during field operations, maintaining a project completion rate of **95%** on time.\nAdapted to **travel flexibility** requirements by managing multiple client sites and projects, demonstrating ability to work under diverse conditions while consistently meeting deadlines."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Provided **technical support** for electro-mechanical systems, ensuring customer satisfaction by efficiently troubleshooting issues and delivering **problem-solving** solutions within **24 hours**.\nConducted **laboratory tests** on equipment, documenting results and developing procedures to enhance system reliability and performance, achieving a **15%** increase in operational efficiency.\nMaintained comprehensive **administration** of systems using **Windows** and **Microsoft** tools, resulting in improved organization and time management across the field ops team.\nDelivered clear and effective **communication** with clients to assess needs and provide solutions, resulting in a **30%** improvement in customer service ratings.\nTraveled to various field sites as required, demonstrating flexibility and commitment to project timelines and **problem-solving** on-site challenges.\nOrganized training sessions for customers to enhance their understanding of electro-mechanical equipment, receiving positive feedback from **90%** of participants.\nImplemented time management strategies that reduced equipment downtime by **20%**, ensuring more efficient operations."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Provided **technical support** for complex field operations, utilizing **Windows** and **Microsoft** tools to enhance service delivery.\n• Offered **customer service** excellence by addressing client inquiries and resolving issues promptly, contributing to a **95% satisfaction rate**.\n• Collaborated with cross-functional teams to ensure **problem-solving** strategies were effectively implemented, reducing operational downtime by **30%**.\n• Demonstrated strong **time management** and **organizational** skills while managing multiple tasks and projects, meeting deadlines consistently with a **100% on-time delivery** record.\n• Applied **laboratory skills** in troubleshooting equipment, ensuring proper functionality and adherence to safety standards during field operations.\n• Provided comprehensive **administrative** support, maintaining accurate records and documentation critical for project management and reporting.\n• Fostered open lines of **communication** with clients and colleagues, facilitating effective teamwork and cooperation across different departments.\n• Showed flexibility in travel, adapting to various field conditions and client needs, which enhanced service flexibility and responsiveness."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes\n\n**DevOps**\n\tGitHub Actions, Azure DevOps, CI/CD, Git, PyTest\n\n**Other**\n\tElectro-mechanical, Technical support, Laboratory skills, Customer service, Windows, Microsoft, Administration, Problem solving, Time management, Organization, Communication, Travel flexibility, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka",
  "apply_company": "Bio-Techne"
}