{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Developer with 13+ years of experience proficient in **.NET**, **C#**, **Web API**, **SQL**, **PostgreSQL**, **TypeScript**, **JavaScript**, **React**, **Angular**, **AWS**, and CI/CD practices. Proven track record in building and maintaining robust, high-performance applications in dynamic environments. Skilled in developing **NestJS** applications and implementing deployment pipelines that enhance productivity and reliability. \nExpert in Agile methodologies and DevOps principles, fostering seamless collaboration and communication across teams. Strong mentoring abilities that empower junior developers through knowledge sharing and support. Additionally, equipped with extensive experience in the healthcare and financial industries, including implementing compliance-driven solutions aligned with HIPAA and PCI DSS standards, and building AI/ML-powered platforms with **React**, **Python**, and **FastAPI**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained APIs using **.NET**, **C#**, and **Web API** to support web applications integrated with diverse frontend frameworks, ensuring high performance and responsiveness.\n- Implemented database solutions with **PostgreSQL** and **SQL** to optimize data retrieval processes, achieving a **30%** reduction in load times.\n- Collaborated with cross-functional teams to utilize **TypeScript** and **JavaScript** along with frameworks such as **React** and **NestJS** to create modular and scalable web applications.\n- Spearheaded the automation of deployment pipelines using **CI/CD** tools like GitHub Actions and Azure DevOps, resulting in a **50%** improvement in release cycle efficiency.\n- Led mentorship programs to enhance team skills in Agile methodologies and **automated testing**, promoting best practices in code quality and collaboration.\n- Designed responsive user interfaces in **Angular** that enhanced customer engagement, increasing user satisfaction scores by **25%**.\n- Conducted regular code reviews and provided constructive feedback, fostering a culture of continuous improvement and problem-solving within the development team.\n- Maintained a robust change management process and documentation protocols to ensure compliance with SOX and other regulatory standards, successfully passing audits by **100%**.\n- Streamlined communication channels among team members using Agile practices, enabling effective collaboration and timely project delivery.\n- Leveraged cloud services on **AWS** to enhance application scalability and reliability, decreasing downtime incidents by **40%** over the year."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Leveraged **.NET** and **C#** to modernize core financial platforms by migrating to microservices architecture, enhancing scalability and performance for high-volume transactional systems.\n• Developed Web APIs using **Node.js** (NestJS) and built interactive front-end applications with **React** (18), **Angular**, and **TypeScript** to streamline user interactions and improve functionality.\n• Utilized **SQL** and **PostgreSQL** to create robust databases ensuring secure and efficient data management for transaction processing.\n• Delivered real-time analytics dashboards powered by **D3.js**, **Power BI Embedded**, and **React**, enabling operations teams with instant insights into transactions and anomalies.\n• Designed and implemented **DevOps** practices with CI/CD pipelines to automate deployment processes, significantly decreasing deployment time by **40%**.\n• Created and maintained automated testing frameworks ensuring high-code quality with a bug detection rate improvement of **30%** through effective coverage.\n• Built and deployed machine learning models using scikit-learn and XGBoost for fraud detection, improving detection rates based on patterns within **100,000+** transactions.\n• Collaborated with cross-functional teams in an **Agile** environment to enhance delivery timelines by effectively communicating project goals and timelines, resulting in improved collaboration and problem-solving.\n• Mentored junior developers, sharing expertise in modern frameworks like **React**, leading to enhanced team capabilities in delivering high-quality software solutions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed robust backend services utilizing **.NET** and **C#** Web API, ensuring high availability and scalability under high-load conditions, benefiting an average of **1M+** daily transactions.\n- Enhanced database interactions using **SQL** and **PostgreSQL**, optimizing storage and retrieval processes by **30%**, enhancing performance across key e-commerce workflows.\n- Designed and implemented responsive front-end applications with **React** and **Angular**, leveraging **TypeScript** for type safety, and achieving load times reduced to **1.5 seconds** across platforms.\n- Advocated for and implemented Agile practices and **DevOps** principles, leading to a **40%** decrease in deployment times through automated testing and **CI/CD** deployment pipelines.\n- Conducted mentoring sessions on best practices for **NestJS** and **JavaScript**, fostering collaboration and improving team coding standards by **20%**.\n- Supported real-time application features utilizing advanced problem-solving strategies, focusing on improving user engagement through proactive communication and collaboration within cross-functional teams.\n- Collaborated with cloud services such as **AWS**, deploying applications efficiently and securely to handle scalability and reliability.\n- Engaged in automated testing and troubleshooting using **VB.NET** methodologies, enhancing code quality and reducing runtime errors by **25%**.\n- Developed and maintained feature flags and deployment strategies to facilitate smooth releases and A/B testing, ensuring consistent delivery in live environments.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, .NET, JavaScript, TypeScript, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, NestJS\n\n **Frontend Frameworks:**\n\tReact, Angular, Vue\n\n **API Technologies:**\n\tWeb API\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, deployment pipelines, automated testing, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob Storage, SQL Database)\n\n **Other:**\n\tAgile, problem-solving, communication, collaboration, mentoring, Authentication & Security (Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot)"
}