{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Backend Engineer with 13+ years of experience in developing robust applications in the healthcare and financial sectors. Proficient in **Java**, **Spring Boot**, **Python**, and experienced in building scalable **API** integrations. Skilled in cloud services, particularly **AWS** and utilizing **CDK** for infrastructure management, alongside strong database expertise in both **SQL** and **NoSQL** technologies.\n\nDemonstrated success in implementing Test Driven Development (**TDD**) methodologies, ensuring high-quality code and thorough documentation practices. Well-known for fostering collaboration across teams and promoting a growth mindset. Additionally, I have a proven track record in deploying cloud-native systems and employing microservices architecture, while advocating for best practices in software development.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust **API** services using **Java** and **Springboot**, focusing on scalability and performance for high-traffic applications.\n- Designed and implemented database schemas in **SQL** and **NoSQL** solutions, enhancing data retrieval speed by **30%** through optimized queries.\n- Leveraged **AWS** services, including **CDK**, for infrastructure as code, automating deployment processes and reducing setup time by **40%**.\n- Employed **Python** for backend scripting and data processing, ensuring seamless integration with various applications and workflows.\n- Utilized Test-Driven Development (**TDD**) methodologies, increasing code coverage to **90%** and enhancing code reliability through structured testing practices.\n- Collaborated with cross-functional teams, facilitating a growth-oriented environment that led to a **25%** improvement in project delivery timelines.\n- Documented architectural designs, API specifications, and deployment processes to ensure clear communication and knowledge sharing among team members.\n- Conducted code reviews and provided mentorship, promoting best practices in collaborative environments and fostering a growth mindset among junior developers."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and maintained **APIs** utilizing **Java** and **Springboot** to enhance application functionality and ensure seamless integration with various systems.\n• Designed and implemented reliable microservices architecture for core financial operations, leveraging **Python** with a focus on **TDD** (Test Driven Development) for robust code quality.\n• Engaged in documentation efforts to create clear and concise technical guides, ensuring smooth onboarding processes and knowledge sharing within teams.\n• Collaborated with cross-functional teams to drive efficient development practices, fostering a culture of collaboration and continuous improvement in growth.\n• Migrated and optimized existing database systems for performance improvements using **SQL** and **NoSQL** integrations.\n• Utilized **AWS** services for scalable deployments and infrastructure management, implementing various components via **CDK** (Cloud Development Kit).\n• Participated in agile methodologies and iteration planning to ensure timely delivery of high-quality software solutions while meeting operational demands.\n• Engaged in performance tuning and capacity planning, resulting in a 30% increase in application performance and reduced response times to under **200ms**.\n• Achieved a **99.9%** system uptime through rigorous testing and monitoring practices, ensuring reliability and excellence in service delivery."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and optimized backend services utilizing **Java** and **Springboot**, ensuring high performance and scalability across various application modules.\n• Designed RESTful **APIs** for seamless communication between frontend and backend systems, enhancing system integration and user experience.\n• Leveraged **AWS** services including **Lambda**, **S3**, and **RDS** to deploy applications in a cloud environment, achieving over **99.9%** uptime and efficient resource management.\n• Conducted **TDD** practices to enhance code quality and reliability, ensuring robust backend solutions through comprehensive unit and integration testing.\n• Collaborated with cross-functional teams to document system architectures and processes, promoting knowledge sharing and alignment across project stakeholders.\n• Implemented **SQL** and **NoSQL** databases including **PostgreSQL** and **MongoDB** to manage data efficiently, supporting high-throughput transactions with a focus on optimizing query performance.\n• Fostered a **Growth Mindset** culture within the team, encouraging continuous learning and skill advancement to stay ahead in emerging technologies.\n• Created deployment pipelines and automation scripts using **AWS CDK**, streamlining the deployment process while minimizing manual intervention.\n• Integrated third-party services and APIs to enhance application functionality, achieving a reduction in development time by **30%** through effective use of existing solutions."
    }
  ],
  "skills": " **Programming Languages:** \n\tJava, Python\n\n **Backend Frameworks:** \n\tSpringboot, FastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tJavaScript/TypeScript: React, Vue, Angular\n\n **API Technologies:** \n\tAPI, Keycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:** \n\tAWS: ECS, Lambda, RDS, S3, CDK\n\n **Databases:** \n\tSQL, NoSQL, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS, Azure: App Services, Blob Storage, SQL Database\n\n **Other:** \n\tTDD, Documentation, Collaboration, GrowthMindset, MLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, CI/CD & Infrastructure as Code",
  "apply_company": "Enfuce"
}