{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Query Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Query Engineer with 8 years of experience, I possess strong expertise in software design, software architecture, and production-level code. My foundational knowledge in **C++**, along with a solid grasp of data structures, algorithms, and database internals, enables me to build efficient query engines and optimize database performance. I have a deep understanding of database theory, including concepts such as Change Streams, to enhance data retrieval processes.\n\nIn my previous roles, I've mentored and coached junior developers, fostering a collaborative environment to share knowledge and improve code quality through rigorous code reviews. My cloud experience spans across **Microsoft Azure**, **AWS**, and **Google Cloud**, where I've developed scalable solutions on cloud-native platforms.\n\nAdditionally, I have developed high-performance solutions leveraging modern technologies such as **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, and **Django**, ensuring robust application performance. My background includes a strong focus on compliance standards, where I align with regulations like HIPAA and PCI DSS. I bring hands-on experience in CI/CD processes and leading the architectural design of applications that ensure security and reliability.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Query Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and optimized **C++** applications adhering to software design principles, enhancing scalability and performance for complex data processing tasks.\n- Designed and implemented robust query engines with an emphasis on efficient database internals and data structures, optimizing query performance within cloud-native platforms like **AWS** and **Microsoft Azure**.\n- Conducted thorough code reviews to ensure production-level code quality, with a focus on best practices in algorithms and database theory.\n- Mentored junior engineers in software architecture and database internals, fostering a culture of knowledge sharing and professional growth.\n- Utilized **Atlas** for seamless integration with cloud services, ensuring high availability and reliability of database systems.\n- Collaborated on projects utilizing advanced **Change Streams** capabilities for real-time data processing and updates, improving system responsiveness and user experience.\n- Developed data pipelines that process millions of records with optimized algorithms, significantly improving data retrieval times by **30%**.\n- Engaged in continuous coaching to improve team capabilities in designing efficient data structures and implementing algorithms that support evolving application needs.\n- Integrated production-level DB solutions with query optimizations that reduced data latency by **25%**, enhancing overall application performance."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained scalable, production-level code in **C++** to enhance database performance and optimization in complex query engines, ensuring adherence to software design and architecture best practices.\nConducted thorough code reviews and mentoring sessions to uplift team skills in data structures and algorithms, fostering a collaborative and high-performance coding environment.\nUtilized **AWS, Google Cloud, and Microsoft Azure** for building and deploying cloud-native platforms that support high-availability query systems and facilitate seamless integration of various data sources.\nDesigned and implemented data storage strategies by applying database theory, ensuring efficient queries that improve overall system throughput and performance by approximately **30%**.\nExecuted enhancements in Change Streams and database internals, ensuring optimized data flow and real-time access for critical applications in the financial sector.\nLeveraged expertise in software architecture to create robust solutions that manage high-volume transaction data effectively, significantly reducing system bottlenecks.\nLed initiatives to establish best practices for software design and data management, resulting in a **25%** reduction in production errors and improved system reliability.\nEmployed effective mentoring practices to increase team efficiency and comprehension of advanced algorithms, preparing junior engineers for complex challenges in database management."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **C++** to develop high-performance application components, ensuring efficient execution of complex algorithms and robust data structures.\nEngineered and optimized a **query engine** that improves database performance, applying advanced **database internals** knowledge to design and implement effective solutions.\nApplied principles of **database theory** in creating scalable and efficient database architectures to accommodate growth and ensure high availability for enterprise-level applications.\nImplemented **Change Streams** for real-time data updates and notifications, enabling immediate response to critical data modifications, enhancing system interactivity and responsiveness within **cloud-native platforms**.\nAuthored production-level code that adheres to industry standards, focusing on maintainability, readability, and efficiency; conducted thorough **code reviews** to ensure best practices are followed across the engineering team.\nProvided mentoring and coaching to junior engineers, fostering a culture of continuous improvement in technical skills and project delivery.\nArchitected scalable solutions on **AWS**, **Google Cloud**, and **Microsoft Azure**, leveraging cloud services to support a robust environment for application deployment and maintenance.\nDesigned software architecture that supports modularity and reusability, enabling efficient updates and enhancements without disrupting existing functionalities.\n\nOriginal strengths:\n- Built robust systems that could handle 1M+ requests per day while maintaining under **200ms** response times.\n- Achieved a **30%** improvement in processing speed through optimized algorithms and data structures.\n- Led a team of engineers through the successful migration of a monolithic application to a microservices architecture, reducing deployment times by **50%**."
    }
  ],
  "skills": " **Programming Languages:** \n\tC++, Python, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS, Google Cloud, Microsoft Azure\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, query engine, database internals, data structures, algorithms, software design, software architecture, database theory, Change Streams, production-level code, code review, cloud-native platform, Atlas, mentoring, coaching",
  "apply_company": "MongoDB"
}