{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience specializing in developing high-performance applications. Proficient in **Java**, **Spring**, **Angular**, **React**, **Vue.js**, **TypeScript**, and **Python**, with hands-on expertise in building robust applications using **Node.js**, **FastAPI**, and **Django**. Skilled in implementing **Event Driven Architectures** and adept at using **Kubernetes**, **Helm**, and **Apache Kafka** for scalable deployments. Familiar with **Agile** methodologies, focusing on iterating through constructive **Feedback** and conducting thorough **Code Reviews**. Additionally, well-versed in developing AI/ML platforms for predictive analytics and automating workflows. Experienced in cloud deployments through **AWS** and **Azure**, while ensuring compliance with industry standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and implemented scalable applications using **Java**, **Spring**, and **TypeScript** to enhance system performance for complex software solutions.\nCollaborated within Agile frameworks to ensure effective feedback loops, continuous integration, and delivery through robust **Kubernetes** orchestration and **Helm** for streamlined deployment.\nDesigned front-end experiences utilizing **Angular**, **React**, and **Vue.js** effectively engaging users while adhering to modern design principles and best practices.\nExecuted code reviews to validate best coding practices, improve code quality, and enhance overall team collaboration, resulting in a **30%** increase in code efficiency.\nLeveraged **Apache Kafka** for real-time data streaming and integration, facilitating robust communication across microservices with minimal latency.\nManaged development environments using **Linux**, ensuring smooth and efficient operational workflows and enhancing developer productivity by **25%**.\nBuilt event-driven architectures to improve system responsiveness and reliability in transaction processing by leveraging best practices in software engineering.\nEngaged in continuous learning initiatives, consistently updating skills in modern technologies like **Go** and various event-driven patterns to anticipate and meet business needs.\nPresented regular updates and feedback sessions to stakeholders, fostering greater transparency and ensuring alignment with project objectives and timelines.\nImplemented security best practices within software solutions to protect user data and ensure compliance with industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring** frameworks to modernize core financial platforms, migrating to microservices architecture that enhanced scalability and performance for high-volume transactional systems.\nImplemented front-end applications using **React (18)**, **Angular**, **Vue.js 3**, and **TypeScript**, ensuring the delivery of sleek, responsive interfaces for financial tools and admin panels.\nContributed to the development of real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, offering operations teams instant insights into over 5,000 transactions and anomalies.\nDesigned and deployed robust event-driven architecture with **Apache Kafka** and **Event Driven Architectures**, ensuring asynchronous communication across critical workflows like payments, alerts, and compliance.\nDeveloped ETL pipelines for ingesting financial data from over 10 internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting batch and real-time processing.\nCollaborated in building and deploying machine learning models for fraud detection, utilizing **scikit-learn**, **XGBoost**, and **Azure ML**, leading to a reduction in fraudulent activities by 15% based on user behavior and transaction patterns.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services.\nEngaged in **Agile** methodologies, ensuring continuous integration and feedback through effective **Code Reviews** to enhance overall code quality and team productivity."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Spring** for developing robust backend services, ensuring code efficiency and seamless integration within the existing architecture of the platform.\nEngineered responsive frontend applications with **Angular**, **React**, and **Vue.js**, implementing **TypeScript** for improved code quality and maintainability.\nImplemented **Event Driven Architectures** to enhance system responsiveness and scalability, utilizing **Apache Kafka** for handling data streams effectively in high-traffic scenarios.\nExecuted Agile development practices, facilitating regular feedback loops, code reviews, and iterative improvements across all phases of the software development lifecycle.\nOptimized application performance through container orchestration using **Kubernetes** and configuration management via **Helm**, resulting in reduced deployment time by **25%**.\nEngaged in code reviews and implemented best practices which led to a **40%** reduction in critical bugs in production deployments.\nCollaborated in cross-functional teams utilizing **Linux** environments, ensuring stable and efficient server management throughout development and production phases.\nApplied event sourcing patterns which reduced the data retrieval time by **50%** for user profiles and transactional data, enhancing overall system response times.\nMaintained documentation and provided training to junior developers, promoting knowledge sharing and continuous professional growth within the team."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, Go, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring\n\n **Frontend Frameworks:**\n\tReact, Angular, Vue.js\n\n **API Technologies:**\n\tApache Kafka\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n **Cloud & Infrastructure:**\n\tLinux\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Event Driven Architectures, Agile, Feedback, Code Review, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Docker Compose",
  "apply_company": "WALTER GROUP"
}