{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Advanced Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Advanced Software Engineer with 13+ years of experience delivering high-performance applications in complex environments. Proficient in key technologies including **C#**, **ASP.NET**, **SQL**, **Microsoft SQL Server**, **JavaScript**, **AJAX**, and **GitHub**. Experienced in implementing **CI/CD** processes utilizing **Jenkins** and **Git** to streamline software development and ensure quality assurance (QA). Adept in aligning solutions with engineering principles, leveraging problem-solving capabilities to troubleshoot and enhance system functionality. \n\nSkilled in developing and maintaining robust applications with a strong focus on cloud-native patterns deployed on **Azure**. Additionally, I have hands-on expertise in **JavaScript** frameworks (React, Next.js, Vue) and backend technologies including **Node.js**, **FastAPI**, and **Django**. My experience extends to building AI/ML platforms that support predictive analytics and real-time processing, alongside a robust understanding of MLOps frameworks such as **MLflow**, **Airflow**, and **Kubeflow**. Committed to compliance-driven development aligning with standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Advanced Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **ASP.NET** to design and build scalable applications, implementing **Cloud Native Patterns** to enhance performance and reliability in line with industry standards.\nEmployed **SQL** and **Microsoft SQL Server** for efficient data management, ensuring high performance of database operations in enterprise applications.\nDeveloped responsive user interfaces using **JavaScript** and **AJAX**, improving user experience and engagement metrics by **35%**.\nDesigned **CI/CD** pipelines using **GitHub**, **Jenkins**, and **Git** for seamless deployment processes, reducing deployment time by **50%**.\nApplied Object-Oriented Programming principles to create modular and maintainable code, facilitating easier troubleshooting and collaboration across engineering teams.\nIntegrated automated testing frameworks to ensure Quality Assurance (QA), achieving a **90%** reduction in post-deployment bugs through robust testing strategies.\nIdentified and resolved coding issues and bugs leveraging problem-solving capabilities, contributing to a smoother development lifecycle.\nParticipated in code reviews and provided mentorship to junior engineers, fostering a culture of continuous learning and adherence to engineering principles across the team.\nCollaborated with cross-functional teams to define project requirements and develop solutions, successfully delivering projects on time and with an **exceptional** quality standard."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Applied **C#** and **ASP.NET** frameworks for developing robust back-end solutions, enhancing system performance by **30%**.\n• Implemented **CI/CD** pipelines using **Jenkins** and **GitHub**, reducing deployment times by **50%** through automated testing and integration strategies.\n• Leveraged **SQL** and **Microsoft SQL Server** for database management, creating efficient queries that improved data retrieval speeds by **40%**.\n• Utilized **JavaScript** along with **AJAX** for dynamic web applications, ensuring seamless user experiences across platforms.\n• Employed **Object-Oriented Programming** techniques to design modular and maintainable codebases, facilitating collaboration and ease of troubleshooting.\n• Focused on **Quality Assurance (QA)**, implementing testing protocols that reduced production bugs by **25%**.\n• Devised **Cloud Native Patterns** for scalable and resilient cloud applications in **Azure**, optimizing resource usage and reliability.\n• Demonstrated critical **Problem Solving** skills, diagnosing complex issues and implementing effective resolutions.\n• Fostered teamwork and knowledge-sharing through Git version control and code reviews, enhancing project collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed robust applications using **C#** and **ASP.NET**, ensuring adherence to **Object-Oriented Programming** principles for maintainability and scalability in mission-critical systems.\nDesigned and implemented cloud-native solutions on **Azure**, leveraging **SQL** and **Microsoft SQL Server** for efficient data management and real-time analytics to enhance user experience.\nExecuted **CI/CD** pipelines using **Jenkins** and **GitHub** for streamlined deployment processes, ensuring rapid iteration and delivery of high-quality software with minimal downtime.\nUtilized **JavaScript**, including AJAX techniques, to create interactive and responsive web applications, improving user engagement by **30%**.\nApplied effective **troubleshooting** strategies and **Quality Assurance (QA)** practices, resulting in a **25%** reduction in production bugs and enhanced software reliability.\nInstituted meticulous code review processes on **Git** to maintain code quality and advocate for best practices among team members.\nApplied **Cloud Native Patterns** to optimize application infrastructure and support scalability under peak loads, achieving a **99.9%** uptime for all services.\nDrove effective problem-solving initiatives that led to the successful resolution of high-stakes challenges, thereby increasing overall project delivery speed by **15%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, JavaScript, Python\n\n**Backend Frameworks:**\n\tASP.NET, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAJAX, OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, Azure: App Services\n\n**Databases:**\n\tMicrosoft SQL Server, SQL, PostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Git\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tObject-Oriented Programming, Problem Solving, Quality Assurance (QA), Troubleshooting, Engineering Principle, Cloud Native Patterns"
}