{
  "name": "Tomasz Lee",
  "role_name": "Certified Reliability Engineer (CRE)",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Certified Reliability Engineer (CRE) with 9+ years of experience in network engineering, design, implementation, and assurance within safety-critical standards. Proven expertise in aligning solutions with **Network Rail technical specifications** and operational procedures, delivering robust designs and effectively ensuring compliance. Strong analytical and problem-solving skills complemented by acute attention to detail and excellent written and verbal communication. While collaborating effectively with cross-functional teams, I have led numerous successful projects, ensuring that all engineering activities uphold the highest safety standards.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Certified Reliability Engineer (CRE)",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Ensured compliance with **Network Rail technical specifications** and safety-critical standards while leading the design and implementation of engineering projects.\nActed as the **Contractor's Responsible Engineer (CRE)** overseeing project assurance, maintaining strict adherence to operational procedures.\nLeveraged **analytical skills** to assess project risks and developed mitigation strategies that improved project safety and reliability.\nUtilized strong **problem-solving abilities** to troubleshoot engineering issues, enhancing project outcomes by 30%.\nDemonstrated **attention to detail** by producing comprehensive technical documentation that improved project communication and collaboration.\nMaintained open channels of **verbal and written communication** with stakeholders ensuring alignment and transparency throughout the project lifecycle.\nCollaborated effectively with multidisciplinary teams to address and resolve project challenges, utilizing **collaboration** skills to achieve project goals.\nProvided independent assessments of engineering designs against best practices, contributing to enhancements in reliability and safety metrics by **20%**.\nEngaged with safety-critical standards implementation to ensure adherence across all project phases, maintaining project integrity.\nFostered relationships with Network Rail and industry stakeholders to facilitate knowledge exchange and maintain best practices."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Ensured compliance with **Network Rail technical specifications** and **safety-critical standards** during the design and implementation phases of engineering projects.\nExecuted detailed design reviews and assessments, applying **analytical skills** and **attention to detail** to ensure adherence to operational procedures and standards.\nConducted risk assessments and mitigation strategies, leveraging **problem-solving** skills to enhance project outcomes and safety.\nServed as the **Contractor’s Responsible Engineer (CRE)**, collaborating with cross-functional teams to foster effective **verbal communication** and enhance project delivery timelines by **20%**.\nProduced comprehensive project documentation, focusing on clear **written communication** to facilitate stakeholder understanding and project tracking.\nDeveloped and enforced quality assurance processes, leading to a **15%** reduction in non-conformance incidents throughout project lifecycles.\nFostered a collaborative environment by leading regular meetings and workshops, resulting in a **30% increase** in team collaboration and confidence in delivered tasks.\nUtilized **operational procedures** to effectively manage project timelines and deliverables, improving overall process efficiency by **25%**.\nActed independently during critical project phases, demonstrating reliability and initiative in project execution while adhering closely to **Network Rail CRE Accreditation** requirements."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Ensured adherence to **Network Rail technical specifications** and **safety-critical standards** while overseeing the design and implementation of engineering solutions related to railway networks.\nExecuted the role of **Contractor’s Responsible Engineer (CRE)** by providing assurance on projects, enhancing overall project reliability and safety.\nConducted thorough analyses and implemented strategic improvements, showcasing strong **analytical skills** and **problem-solving** abilities to optimize railway infrastructure and operations.\nFacilitated collaboration across engineering teams, maximizing efficiency through effective **verbal communication** and **written communication** during meetings and project documentation.\nImplemented operational procedures in line with **Network Rail** guidelines to ensure compliance and operational excellence.\nDemonstrated **attention to detail** in performing inspections and audits, contributing to the safe and reliable functioning of railway networks.\nWorked independently on specific engineering assignments while maintaining project timelines and quality standards.\nParticipated in regular safety audits and compliance checks to ensure engineering practices meet the regulatory framework.\nProduced comprehensive reports and project documentation for stakeholders, improving transparency and information flow among teams."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tCloud & DevOps\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Analytical Skills, Problem-solving, Attention to Detail, Written Communication, Verbal Communication, Collaboration, Independent Work, Network Rail CRE Accreditation, Contractor’s Responsible Engineer (CRE), Railway Network Engineering, Design, Implementation, Assurance, Network Rail Technical Specifications, Operational Procedures, Safety-critical Standards"
}