{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Highly skilled Senior DevOps Engineer with 8 years of extensive experience in SRE and DevOps practices, specializing in CI/CD automation and infrastructure management. Proficient in **AWS**, **Azure**, **Kubernetes**, and **OpenStack** for deploying and managing robust applications across cloud platforms. Extensive experience with **Linux**, **Ansible**, **Chef**, and **Jenkins** for automating deployment pipelines and configuration management. Strong capabilities in networking practices and source code management utilizing **Git** and **Artifactory**. Versatile programming expertise in **Python**, and experience with **Golang**, **Ruby**, and **Scala** to enhance development workflows and application performance.\n\nAdditionally, my background in full-stack development enables me to collaborate effectively with both development teams and operations. I possess profound knowledge in **React**, **Next.js**, **Node.js**, and **Django**, facilitating seamless integration of applications. Experienced in ensuring compliance with industry standards, I advocate for secure and efficient operational practices while delivering high-performance solutions tailored to healthcare and financial sectors.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented and managed **DevOps** practices to facilitate CI/CD processes, utilizing **Jenkins**, **Git**, and **GitHub Actions** to automate deployment workflows across multiple environments.\nDesigned and maintained infrastructure as code using **Ansible** and **Chef**, enhancing the automation of deployment processes and configurations, achieving a **30% reduction** in setup time for new environments.\nLed the integration of **Kubernetes** and **OpenShift** for container orchestration, ensuring optimal resource utilization and effective scaling of applications in production environments.\nDeveloped and maintained secure network configurations to support application deployments, ensuring compliance with industry standards while utilizing **Linux** operating systems for operations.\nUtilized **AWS** and **Azure** cloud services to establish a resilient infrastructure, optimizing application performance and availability, resulting in a **99.9% uptime**.\nCollaborated with cross-functional teams to improve communication and operational efficiency, fostering a culture of agile methodologies in project management.\nImplemented monitoring and logging solutions to enhance visibility into system performance and health, leveraging **AWS CloudWatch** and **Prometheus** for proactive incident management.\nExecuted performance tuning and system optimization strategies across various environments, achieving a **15% increase** in application responsiveness.\nIntegrated third-party tools and services such as **Artifactory** for artifact management to streamline build and deployment processes throughout the CI/CD pipeline.\nConducted thorough system audits and vulnerability assessments to ensure adherence to security best practices and mitigate risks associated with deployments."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented SRE and DevOps practices to enhance the delivery and reliability of financial platforms, focusing on scalability and maintainability of systems through automation.\nUtilized **Linux** environments to deploy and manage systems, ensuring smooth operations and optimized performance across high-volume transaction platforms.\nManaged CI/CD pipelines with **Jenkins**, streamlining deployment processes and maintaining a consistent and efficient deployment of applications across environments.\nDesigned and maintained infrastructure as code with **Ansible** and **Terraform**, enabling automated provisioning and configuration of cloud resources in **AWS** and **Azure**, increasing deployment speed by **40%**.\nEmployed **Git** for version control and collaboration, ensuring efficient workflow among development teams with a merge request success rate of **95%**.\nDeveloped and operated containerized applications using **Docker** and orchestrated deployments with **Kubernetes**, ensuring high availability and scalability of microservices architecture.\nStreamlined configuration management using **Chef**, facilitating consistent deployments and updates across multiple environments.\nLeveraged **Networking** concepts to enhance performance and security of systems, maintaining optimal connectivity for financial applications.\nFostered effective communication and collaboration across teams, advocating for best practices in DevOps and system reliability initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented CI/CD pipelines using **Jenkins** and **Git** to automate deployments, streamline the delivery process, and enhance operational efficiency, ensuring a weekly deployment frequency of **3-5** updates.\nUtilized **Ansible** and **Chef** for configuration management, enabling consistent and reliable environments across **Linux** servers, which improved deployment success rates by **98%**.\nDesigned monitoring solutions and logging strategies for applications and infrastructure, enhancing uptime through proactive incident response mechanisms in line with **SRE** principles.\nManaged cloud infrastructure on **AWS**, **Azure**, and **OpenStack**, ensuring high availability and optimized resource utilization through auto-scaling configurations and cost management best practices.\nCollaborated across teams with effective communication strategies to bridge the gap between developers and operations, enhancing team collaboration and productivity.\nOrchestrated containerized applications using **Kubernetes** and **Openshift**, leading to a **40%** reduction in service deployment time and improved system resilience.\nDeveloped and maintained scripts in **Python** and **Golang** for automation of routine tasks, resulting in a **25%** increase in operational efficiency.\nEngaged in network configuration and troubleshooting, ensuring optimal system performance and security through disciplined networking practices.\nMaintained audits and documented configuration changes to comply with industry best practices and ensure traceability of changes.\nPromoted the adoption of DevOps culture through training sessions and workshops, encouraging a mindset shift towards continuous integration and delivery across the organization."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Golang, Ruby, Scala, JavaScript/TypeScript (React, Vue, Angular)\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC), Nginx\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, Jenkins, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, OpenStack, Kubernetes, Openshift\n\n **Other:**\n\tSRE, Networking, Communication, Artifactory",
  "apply_company": "Blip"
}