{
  "name": "Mariusz Jan Skobel",
  "role_name": "Customer Support Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Customer Support Engineer with 10+ years of experience delivering high-performance software solutions. Highly proficient in programming languages and technologies including **Java**, **C**, **C++**, **Android**, and **iOS** development with tools like **Android Studio** and **XCode**. Strong background in application and system security, focusing on **Cyber Security** to ensure robust and secure software implementations. Excellent communication skills and a collaborative team player with proven resourcefulness and flexibility in dynamic environments.\n\nAdditionally, experienced in modern frameworks and architectures such as **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, and **Django**. Expertise in deploying cloud-native applications on platforms like **Azure** and **AWS** and adept at building enterprise software that meets compliance frameworks like HIPAA and PCI DSS. Passionate about leveraging technical skills to enhance customer support and deliver impactful solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Customer Support Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDemonstrated excellent communication skills while collaborating with cross-functional teams to deliver enterprise software implementations within the allocated time frame of **9** months.\n•\tServed as a team player, providing exemplary support for customers utilizing application security features, ensuring compliance with industry standards and practices.\n•\tExercised flexibility and resourcefulness to troubleshoot and resolve issues in software applications, enhancing user satisfaction scores by **15%**.\n•\tUtilized organizational skills to manage and prioritize multiple support tickets, maintaining an average response time of **8** hours, significantly improving customer experience.\n•\tProactively identified and improved security measures in desktop and mobile applications developed with **Java**, **C++**, **Android**, and **iOS**, resulting in a **20%** reduction in security incidents.\n•\tApplied knowledge in System Security, Network Security, and Cyber Security to consult on best practices for clients seeking to enhance their application security.\n•\tLeveraged the ability to self-start and independently drive projects that improved system performance and security.\n•\tEngaged with customers to gather feedback and suggest improvements, helping shape product features aligned with user needs and industry shifts."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Provided excellent communication and support for customers by troubleshooting technical issues related to **C** and **Java**, ensuring a high level of customer satisfaction.\nDemonstrated resourcefulness in resolving complex problems with **Android** and **iOS** applications, contributing to a seamless user experience.\nActively collaborated as a team player, coordinating with cross-functional teams to implement and enhance security measures across applications, focusing on **System Security**, **Network Security**, and **Application Security**.\nMaintained and improved enterprise software implementations by leveraging **Excellent Organizational Skills** to manage project timelines and deliverables effectively.\nMonitored and assessed application performance, employing flexibility in adapting solutions for different environments and user needs, thereby supporting user adoption by over **1,000** clients.\nDeveloped and executed training sessions for clients, enhancing their understanding of security practices and application features, resulting in a **30%** reduction in support tickets.\nUtilized advanced problem-solving techniques to identify security vulnerabilities, contributing to a **15%** decrease in security incidents over **6 months**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **C**, **C++**, and **Java** to develop and maintain enterprise-level customer support applications, ensuring scalability and responsiveness to meet business needs.\nImplemented **System Security**, **Network Security**, and **Application Security** measures that enhanced the overall security posture of the support platform, protecting sensitive customer data from breaches.\nCollaborated with cross-functional teams to troubleshoot and resolve issues in real-time, demonstrating strong **Excellent Communication** skills to convey technical concepts to non-technical stakeholders.\nStreamlined support processes through the integration of automated solutions in **Android** and **iOS** applications, improving response times by **40%** and increasing customer satisfaction ratings.\nEngaged in **Enterprise Software Implementation**, adapting solutions to fit diverse customer environments while ensuring minimal disruption during the transition period.\nFostered a culture of **Team Player** approach, facilitating knowledge sharing among team members and encouraging a resourceful mindset for problem-solving.\nMaintained rigorous organizational skills by managing project timelines and deliverables effectively to ensure on-time completion of support initiatives.\nDemonstrated flexibility to adapt to changing requirements, showcasing a **Self-Starter** attitude by proactively identifying areas for improvement within the support framework."
    }
  ],
  "skills": "Programming Languages:\n\tC, C++, Java, Python, JavaScript, TypeScript\n\nBackend Frameworks:\n\tFastAPI, Flask, Django\n\nFrontend Frameworks:\n\tReact, Vue, Angular\n\nAPI Technologies:\n\tJWT, OAuth2\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\tAWS, Azure\n\nOther:\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, System Security, Network Security, Application Security, Cyber Security, Excellent Communication, Team Player, Resourcefulness, Flexibility, Organizational Skills, Self-Starter, Enterprise Software Implementation"
}