{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior PHP Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Senior PHP Backend Engineer with 8 years of experience specializing in high-performance solutions, primarily utilizing **PHP**, **Symfony**, and **Laravel**. Proficient in modern software engineering practices and OOP principles including SOLID, I have a strong background in designing and implementing **RESTful APIs**, relational databases with **MySQL**, and NoSQL databases like **MongoDB** and **DynamoDB**. My extensive experience in microservices architecture, event-driven systems, and **service-oriented architecture** ensures robust and scalable application development.\n\nI am adept in CI/CD pipelines, leveraging tools such as **Git**, **Docker**, and **infrastructure-as-code** practices to deliver efficient deployment pipelines. With practical knowledge in cloud environments like **AWS** and serverless technologies, I ensure reliable application performance and compliance with industry standards. My strong problem-solving skills and adaptability allow me to collaborate effectively within teams to drive project success while creating innovative backend solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust RESTful APIs using **PHP** frameworks such as **Symfony** and **Laravel** to optimize backend processes for scalable applications.\n- Implemented modern software engineering practices, ensuring adherence to **OOP** and **SOLID principles** for maintainable and extendable code structures.\n- Designed and managed CI/CD pipelines with **Git**, facilitating seamless integration and deployment processes while enhancing code quality with automated testing.\n- Built and maintained relational databases using **MySQL** and **NoSQL databases** such as **MongoDB** and DynamoDB, ensuring efficient data storage and retrieval for enterprise applications.\n- Engineered event-driven systems and messaging protocols within microservices architectures, utilizing **Docker** to containerize applications, resulting in improved isolation and scalability.\n- Collaborated with cross-functional teams to troubleshoot and resolve issues, demonstrating strong problem-solving skills and adaptability within dynamic project environments.\n- Ensured the application infrastructure was defined as code using **infrastructure-as-code** practices, leading to consistent and repeatable deployments across various environments.\n- Delivered high-performance service-oriented architectures, supporting seamless communication between microservices and enhancing application responsiveness.\n- Integrated advanced cloud services such as **AWS** for serverless technologies and deployment pipelines, achieving high availability and performance optimization for PHP-based applications.\n- Championed collaboration among team members, fostering an environment of shared knowledge and continuous improvement in development processes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained **PHP (Symfony, Laravel)** applications, adhering to **OOP** and **SOLID principles**, ensuring high-level software quality and scalability.\n• Designed and implemented **RESTful APIs** to facilitate seamless integration and communication between client and server applications, improving data exchange efficiency by **30%**.\n• Architected robust event-driven systems utilizing **messaging frameworks** for real-time data processing, enhancing system responsiveness for financial transactions.\n• Employed **MySQL** and **NoSQL databases (MongoDB, DynamoDB)** for data storage, optimizing queries for large-scale user data management with up to **1 million** records processed daily.\n• Implemented CI/CD pipelines using **Docker** and **Git**, streamlining the deployment process and reducing deployment times by **40%**.\n• Collaborated with cross-functional teams to align development efforts with business objectives, leveraging strong problem-solving and adaptability skills to overcome challenges in a fast-paced environment.\n• Integrated **AWS** services and utilized **serverless technologies** for infrastructure management, enhancing system reliability and reducing operational costs.\n• Utilized **modern software engineering practices** to guide development, ensuring high code quality through extensive peer code reviews and collaboration with team members."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained backend services using **PHP** (Symfony, Laravel), ensuring high availability, performance, and scalability in alignment with **SOLID principles** and modern software engineering practices.\nImplemented and optimized **RESTful APIs** for seamless integration across microservices, enhancing system interoperability and promoting a service-oriented architecture in complex applications.\nLeveraged **MySQL** and **MongoDB** for effective data management, ensuring efficient storage solutions and high-performance retrieval in critical scenarios, including support for high-traffic environments.\nDesigned and implemented **event-driven systems** utilizing **messaging** technologies for real-time data processing and responsiveness to system events, improving overall system interaction.\nCreated and managed deployment pipelines with **Docker** and **Git**, integrating **CI/CD pipelines** for automatic testing and deployment, resulting in a faster release cycle by **30%**.\nUtilized **AWS** services including serverless technologies for scalability and cost management, effectively reducing operational costs by **20%**.\nCollaborated with frontend teams to ensure high-quality APIs, creating responsive, user-friendly interfaces that adhere to **OOP** principles and promote code reusability.\nImplemented security best practices such as **role-based access control (RBAC)** and OAuth 2.0, ensuring the protection of user data and compliance with privacy regulations like **GDPR**.\nApplied infrastructure-as-code principles, managing cloud resources with efficient modular configurations, enabling rapid environment provisioning and change management.\nDrove collaborative problem-solving sessions, fostering team adaptability and innovation to meet project goals and timelines."
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tSymfony, Laravel, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, DynamoDB\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tOOP, SOLID principles, modern software engineering practices, CI/CD pipelines, event-driven systems, messaging, service-oriented architecture, microservices, problem-solving, collaboration, adaptability, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}