{
  "name": "Tomasz Lee",
  "role_name": "Senior Fullstack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Highly skilled Senior Fullstack Engineer with 9+ years in full stack development, specializing in **React**, **TypeScript**, **Node.js**, **Express**, as well as REST and GraphQL APIs. Proficient in database technologies including **PostgreSQL** and **MongoDB**. Experienced in implementing CI/CD pipelines and optimizing application performance by applying best practices and conducting thorough code reviews. Recognized for delivering innovative solutions and demonstrating exceptional problem-solving skills. A strong advocate for attention to detail and effective collaboration in team environments.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Designed and developed a web-based customer management platform utilizing **React** and **Node.js**, enhancing user satisfaction by **25%**.\n• Implemented modular architecture with **Express** and **TypeScript** for improved scalability and maintainability, addressing complex requirements efficiently.\n• Developed and integrated **RESTful** APIs and **GraphQL** endpoints with a **MongoDB** database to ensure seamless data access across services.\n• Optimized application performance using **PostgreSQL**, achieving a **20%** reduction in average query execution times through refined queries and indexing.\n• Established CI/CD processes on Azure DevOps, resulting in a **40%** decrease in deployment time, demonstrating strong capabilities in **CI/CD** practices.\n• Integrated user authentication using JWT, ensuring application security by adhering to best practices in protecting user data.\n• Collaborated closely with UX/UI designers, applying **HTML**, **CSS**, and creativity to revamp the platform’s user interface and enhance user experience.\n• Conducted thorough code reviews to uphold quality standards and promote knowledge sharing among the development team.\n• Developed interactive data visualizations using **D3.js** and **Firebase** to boost engagement and insight generation.\n• Leveraged performance best practices, utilizing tools like **Lighthouse** and **Axe** to ensure optimal application performance and accessibility."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **React**, **TypeScript**, and **Redux** to build responsive user interfaces, enhancing application performance and user experience.\nDesigned and developed RESTful APIs using **Node.js** and **Express**, achieving a 20% reduction in response times while managing data storage with **PostgreSQL** and **MongoDB**.\nImplemented effective CI/CD strategies using **GitHub Actions**, streamlining deployment processes and achieving a 30% decrease in deployment errors.\nAdopted performance best practices while integrating **Lighthouse** and **Axe** tools to ensure high-quality code and application efficiency, scoring a 90+ in performance audits.\nConducted regular code reviews emphasizing code quality, improving overall team performance by 15% through mentorship and development sessions for junior developers.\nDeveloped and maintained interactive components using **HTML** and **CSS**, achieving a 25% higher user engagement on web platforms.\nCollaborated with cross-functional teams to capture and define project requirements, ensuring on-time delivery of projects within **3 months**.\nOptimized database queries for **MSSQL** and **MySQL**, leading to a 30% enhancement in data retrieval times and overall application responsiveness.\nUtilized **GraphQL** for improved data querying efficiency, enabling flexible and performant data retrieval strategies.\nCreated dynamic visualizations using **D3.js** to facilitate interactive and insightful project status tracking, leading to increased stakeholder satisfaction."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **React** and **TypeScript** to develop dynamic user interfaces, enhancing the overall user experience by 30%.\nImplemented **Node.js** with **Express** to construct efficient REST APIs, resulting in a 25% reduction in server response time.\nIntegrated **Redux** for state management, simplifying data flow and improving application responsiveness across a range of components.\nOptimized frontend performance using **Lighthouse** and **Axe**, achieving a performance score increase of 15% while ensuring accessibility compliance.\nDesigned and developed database solutions leveraging **PostgreSQL** and **MongoDB**, streamlining data retrieval and increasing query performance by 40%.\nEstablished CI/CD pipelines and deployment strategies in **AWS**, accelerating deployment processes by 50% and reducing downtime.\nConducted thorough code reviews to uphold coding standards, allowing for a 20% decrease in bugs and enhancing team collaboration.\nCollaborated cross-functionally to solve complex problems and implement creative solutions, resulting in an innovative feature set that boosted user engagement.\nDelivered technical documentation and user guides to facilitate knowledge transfer and onboarding, ensuring team members were up to speed efficiently.\nEmployed **GraphQL** to enhance data interactions, improving data retrieval flexibility and reducing over-fetching issues by 30%."
    }
  ],
  "skills": "  **Programming Languages**\n\tTypeScript, JavaScript, Python\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, React, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, Redux\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Databases**\n\tPostgreSQL, MongoDB, MSSQL Server, MySQL, DynamoDB, CosmosDB\n\n  **DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Performance Best Practices, Code Reviews, Firebase, Creativity, Attention to Detail, Problem Solving",
  "apply_company": "AccessiWay"
}