{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Algorithms Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Algorithms Engineer with 10+ years of experience delivering high-performance software solutions, specializing in **machine learning**, **Java**, **CI/CD**, and cloud platforms such as **AWS** and **Azure**. Proficient in programming languages including **JavaScript**, **Python**, **C#**, **Go**, and **PHP**, with a solid understanding of **static analysis** and **dynamic analysis**. Skilled in developing **LLMs** and implementing **prompt engineering** strategies to enhance AI capabilities in software applications.\n\nHands-on expertise includes building and deploying intelligent systems, with a focus on **GenAI** and creating robust algorithms that leverage real-time analytics for automation and decision-making. Experienced in building and leading the development of scalable architectures, including microservices and event-driven systems. Committed to creating solutions that not only meet industry compliance standards such as HIPAA and PCI DSS but also drive impactful results in healthcare and finance.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Algorithms Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Utilized **Python**, **JavaScript**, and **C#** for developing advanced algorithms and machine learning models, significantly improving performance and accuracy in various applications.\n• Designed and implemented **GenAI** solutions with a focus on **LLMs** and **prompt engineering** to enhance user interaction and experience in client-facing products.\n• Leveraged **machine learning** techniques to deliver high-performance predictive analytics and AI-driven insights, contributing to data-informed decision-making.\n• Conducted **static analysis** and **dynamic analysis** on software systems, employing best practices to ensure code quality and robustness across multiple platforms.\n• Developed and maintained CI/CD pipelines using **AWS** and **Azure**, enabling seamless integration and delivery of features while enhancing deployment efficiency and reducing downtime.\n• Collaborated in cross-functional teams to integrate advanced **Java** and **Go** algorithms with existing architectures, providing scalable solutions for evolving project requirements.\n• Spearheaded projects focusing on the deployment of **ML models** (in **Python**) leading to a 50% improvement in processing speed for data operations.\n• Demonstrated expertise in **CI/CD** processes, utilizing tools like GitHub Actions and Azure DevOps to automate testing and deployment workflows, achieving a deployment success rate of 98%.\n• Contributed to the growth of team knowledge by hosting workshops on **machine learning best practices**, enhancing the team’s skill in modern algorithm design and deployment techniques.\n• Implemented high-performance applications that leverage **AWS** and **Azure** for scalability, ensuring support for over **10,000** concurrent users efficiently.\n• Managed the integration of third-party services using **Python** and **JavaScript**, facilitating a streamlined workflow and creating an enriched user experience that led to a 30% increase in user engagement."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Python** to develop innovative algorithms and solutions that streamline operations and enhance decision-making processes in a financial environment.\nLeveraged machine learning techniques and **GenAI** to create predictive models for credit scoring and risk assessment, improving accuracy by up to **25%**.\nEmployed static and dynamic analysis methodologies to evaluate algorithm performance, ensuring robustness and reliability across deployments.\nArchitected and executed **CI/CD** pipelines using **Azure** DevOps to automate deployment processes, achieving deployment times reduced by **40%**.\nDesigned and implemented prompt engineering strategies for Large Language Models (LLMs) to enhance user interactions and data processing efficiencies in financial applications.\nCollaborated with cross-functional teams to integrate solutions developed in **JavaScript** and **C#** into existing platforms, enhancing overall system performance by leveraging existing architecture.\nConducted thorough code reviews and utilized **AWS** services for efficient resource management and scalability in algorithm execution.\nMentored junior engineers on best practices in **machine learning** deployment and the use of **Go** and **PHP** for algorithm support systems."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Python** to develop and optimize machine learning algorithms and dynamic analysis frameworks, enhancing the performance and scalability of software solutions across various projects.\nDesigned and implemented static analysis tools in **C#** and **Go**, facilitating early detection of code vulnerabilities and ensuring high standards of code quality and maintainability.\nEngineered **GenAI** solutions leveraging **JavaScript** and **Python** for developing and deploying rapidly adaptable language models (LLMs) with a focus on prompt engineering strategies.\nConducted comprehensive evaluations of algorithms using **AWS** and **Azure** cloud services to automate deployment through CI/CD pipelines, achieving a **40%** reduction in deployment times.\nDeveloped innovative machine learning solutions, integrating deep learning methodologies and traditional ML models, driving improvements in data processing efficiency by up to **60%**.\nCollaborated with cross-functional teams to implement secure coding practices, employing advanced coding techniques to align with GDPR compliance and data protection regulations.\nContributed to the optimization of existing codebases through rigorous testing and debugging processes, improving system reliability and performance by **30%**.\nPerformed peer code reviews and mentored junior developers in best practices for both static and dynamic analysis, fostering a culture of continuous improvement and learning within the team."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, C#, Go, PHP, Python, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, GenAI, machine learning, static analysis, dynamic analysis, LLMs, prompt engineering",
  "apply_company": "Mend.io"
}