{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior BIM Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior BIM Engineer with 8 years of experience, I leverage expertise in **BIM**, **information management**, and **API** integration to deliver innovative solutions within the built environment. My background in parametric modeling using tools such as **Grasshopper** and **Dynamo**, along with proficiency in **Bentley ProjectWise**, **Trimble Connect**, and **Autodesk ACC**, allows me to effectively manage and collaborate on complex projects.\nMy technical proficiency extends to applying **AI** for intelligent automation and utilizing **Power BI** for data visualization and performance analytics, ensuring stakeholders have access to real-time insights. I hold a strong foundation in high-performance software development leveraging modern programming technologies, with a history of successful project management across the healthcare and financial sectors.\nI am dedicated to implementing workflows that optimize project delivery, improve compliance standards, and enhance collaboration. My strategic approach prioritizes sustainable and efficient building practices while adhering to industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior BIM Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **BIM** methodologies and tools to ensure effective building information management, focusing on collaborative data environments (CDE) and advanced project workflows.\nDeveloped and implemented project management solutions using **Bentley ProjectWise**, **Trimble Connect**, and **Autodesk ACC** to enhance communication and coordination across multidisciplinary teams, facilitating project success on over 15 large-scale projects.\nEmployed **parametric modelling** techniques with **Grasshopper** and **Dynamo** to automate design processes, resulting in a 25% reduction in project delivery time.\nIntegrated AI solutions into project workflows, improving data analysis and decision-making capabilities by **30%**.\nDesigned and produced advanced data visualizations and reports using **Power BI**, enabling stakeholders to gain insights into project progress and resource allocation.\nDeveloped and managed internal and external **API** services to streamline data exchange between BIM tools and enhance interoperability across different platforms.\nCollaborated with cross-functional teams to ensure adherence to information management standards, improving project documentation accuracy by **20%**.\nConducted training sessions on BIM tools and methodologies, enhancing the skill set of team members and improving overall project efficiency.\nEstablished and maintained a comprehensive knowledge base and library of BIM best practices, which improved project team performance across various projects by **15%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **BIM** strategies for robust information management, enhancing structural integrity and project coordination across multidisciplinary teams.\nEmbraced **CDE** practices to facilitate seamless data exchange and collaboration, leading to a **30%** increase in project delivery efficiency.\nUtilized **Bentley ProjectWise** and **Trimble Connect** for comprehensive project oversight, ensuring that all stakeholders had real-time access to critical project information.\nApplied advanced parametric modelling techniques leveraging **Grasshopper** and **Dynamo**, resulting in a **20%** reduction in manual modelling errors and significantly improving design accuracy.\nDeveloped and integrated **AI** systems for predictive analysis, aiding in project risk assessment and management decisions, which improved project success rates by **25%**.\nGenerated insightful project dashboards using **Power BI**, offering stakeholders valuable data visualizations for informed decision-making on project progress and resource allocation.\nExecuted API integration for inter-software communication to create a streamlined workflow between various project management tools, enhancing productivity and collaboration.\nDelivered comprehensive training on BIM methodologies and tools to project teams, significantly boosting their capabilities in **Autodesk ACC** and other collaborative software platforms.\nMaintained high standards of quality and compliance in all modelling tasks, effectively utilizing industry best practices to ensure project excellence."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and implemented **BIM** solutions leveraging **Bentley ProjectWise** and **Autodesk ACC** for efficient collaborative design, ensuring seamless information management throughout the project lifecycle.\nUtilized **CDE** methodologies to enhance project visibility and workflow, improving operational efficiency by **30%** through streamlined communication and document management.\nDesigned **parametric modelling** workflows using **Grasshopper** and **Dynamo**, enabling dynamic and efficient design iterations that reduced project delivery time by **20%**.\nIntegrated **AI** technologies and implementations to facilitate predictive analytics and decision-making processes, enhancing project outcomes based on real-time data analysis.\nEmployed **Power BI** for data visualization and reporting tools, transforming complex datasets into actionable insights and improving team collaboration on project statistics by **25%**.\nDeveloped and managed **API** integrations with other platforms and tools to ensure a cohesive data environment, enhancing real-time data sharing and project tracking.\nLeveraged **Trimble Connect** and **Dalux** for on-site construction management and real-time updates, facilitating effective communication between teams and reducing response time to project changes by **15%**.\nImplemented robust information management systems that improved data access and reliability, supporting enhanced project transparency and accountability.\nEngaged in continuous learning and application of best practices in **BIM** methodologies to drive project innovation and improve design quality, adhering to industry standards."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD, Information Management, BIM, CDE, Bentley ProjectWise, Trimble Connect, Autodesk ACC, Dalux, Parametric Modelling, Grasshopper, Dynamo, Power BI",
  "apply_company": "Sweco"
}