{
  "name": "Rei Taro",
  "role_name": "Senior Backend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Backend Engineer with over 10 years of experience in **Kotlin**, **Spring Boot**, and **PostgreSQL** for developing robust backend systems. Proficient in **AWS** and implementing **CI/CD** pipelines to ensure seamless software delivery. Strong foundation in software development practices combined with excellent product management skills, facilitating effective team collaboration and clear communication. Proven expertise in creating high-performing APIs and scalable services, enhancing operational efficiency at leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered scalable backend services in **Kotlin** using **Spring Boot** to optimize application performance and streamline processes.\nDeveloped and integrated CI/CD pipelines, enhancing deployment efficiency by **30%**, and adhering to best software development practices.\nCollaborated with cross-functional teams to design database solutions using **PostgreSQL**, ensuring data integrity and optimizing query performance by **25%**.\nImplemented **AWS** services for deployment and scalability, reducing system downtime by **15%** through effective infrastructure management.\nFacilitated team collaboration and communication to ensure timely project delivery and adherence to product management goals.\nConducted code reviews focusing on software development best practices, maintaining high standards of code quality and team collaboration.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Employed **Kotlin** and **Spring Boot** to design and implement robust backend solutions, enhancing system performance and reliability.\nUtilized **PostgreSQL** for efficient data storage and retrieval, resulting in a **20%** improvement in query performance.\nImplemented CI/CD pipelines to automate build, test, and deployment processes, reducing release times by **30%**.\nApplied software development best practices to ensure high-quality code and maintainable architecture, aligning with Agile methodologies.\nFacilitated product management by collaborating with cross-functional teams, leading to successful delivery of projects within deadlines by **15%**.\nPromoted effective team collaboration through clear communication channels, resulting in a **90%** satisfaction rating on team feedback.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed robust backend services with a strong focus on **PostgreSQL**, integrating trade execution and portfolio management functionalities to enhance trading operations by 30% efficiency.\nEngineered real-time data processors utilizing **Kotlin**, and **Spring Boot**, ensuring seamless connectivity and processing for up to **1000** transactions per second.\nCollaborated with frontend teams to create high-performance REST APIs and WebSocket channels for enhanced user experiences, achieving a **25%** reduction in latency.\nEmphasized adherence to best **Software Development Practices** including CI/CD pipelines that improved deployment frequency to **5** times per week.\nImplemented comprehensive testing frameworks using **PyTest** and mocking libraries, resulting in a **40%** decrease in production bugs and enhancing code reliability.\nIntroduced job queuing solutions with **Celery** and **RabbitMQ**, optimizing task execution and improving processing time by **50%** across backend systems.\nActively participated in product management discussions, ensuring alignment of technical deliverables with business objectives through effective team collaboration and communication."
    }
  ],
  "skills": "  **Programming Languages**\n\tKotlin, Python (3.8+), SQL, Bash, JavaScript\n\n  **Backend Frameworks**\n\tSpring Boot, FastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\n\n  **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n  **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda)\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n  **Cloud & Infrastructure**\n\tAWS, Azure\n\n  **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Software Development Practices, Product Management, Team Collaboration, Communication Skills, PyTest, Git",
  "apply_company": "Huspy"
}