{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Sales Engineer, I excel in **Technical Communication** and **Project Management**, leveraging my strong **Customer Orientation** and **Networking** skills to effectively connect with clients and deliver tailored solutions. With 8 years of experience in technology, I have a solid background in **JavaScript**, **TypeScript**, **Python**, and **Flutter** technologies, enabling me to engage in insightful technical discussions.\nMy experience spans high-performance solution development in the healthcare and financial sectors, where I have utilized a tech stack including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I am well-versed in **cloud services** such as **Azure** and **AWS**, orchestrating the integration of AI/ML capabilities that enhance customer-focused solutions.\nAdditionally, I bring expertise in microservices architecture, event-driven systems, and CI/CD automation, ensuring compliance with frameworks including HIPAA, FHIR, and PCI DSS. My analytical and **critical thinking** abilities allow me to navigate complex technical challenges and drive successful project outcomes. Fluent in both **German** and **English**, I effectively bridge communication gaps between technical teams and clients.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged **Technical Communication** skills to effectively interact with clients and stakeholders, ensuring clear understanding of project requirements and deliverables.\n- Utilized **Project Management** techniques to oversee project timelines, resource allocation, and deliverables for multiple initiatives in the sales engineering domain.\n- Implemented **Networking** strategies to establish connections with potential customers and partners, enhancing business opportunities and driving sales growth by **20%** year-over-year.\n- Demonstrated **Customer Orientation** by conducting in-depth needs assessments and tailoring solutions to meet unique client specifications, leading to a **15%** increase in customer satisfaction metrics.\n- Applied **Critical Thinking** to troubleshoot and resolve complex technical issues, ensuring seamless operation of solutions and minimizing downtime by **30%**.\n- Conducted presentations and technical demonstrations in **German** and **English** to diverse client bases, enhancing product understanding and driving successful adoption.\n- Collaborated with cross-functional teams to gather insights on **Electrotechnics** and **Lighting Systems**, ensuring product alignment with market needs and technical feasibility.\n- Fostered long-term relationships with key accounts that accounted for **40%** of total sales revenue.\n- Analyzed market trends and customer feedback to develop strategies, resulting in an **increase in upsell opportunities by 25%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **technical communication** skills to articulate complex technical information about **lighting systems** and **electrotechnics** to clients, ensuring a clear understanding of product benefits and customization options.\nDemonstrated **customer orientation** by building strong relationships with clients, assessing their needs, and providing tailored solutions to enhance their electrical and lighting infrastructure.\nEmployed **project management** principles to lead the successful execution of multiple projects simultaneously, achieving a 95% on-time delivery rate.\nApplied **critical thinking** to troubleshoot and resolve technical issues that arose during project implementation, reducing downtime by **30%**.\nCollaborated with cross-functional teams, demonstrating strong **networking** skills to gather information and insights that improved overall project outcomes.\nProvided exceptional support to clients post-installation, fostering long-term partnerships that contributed to a **15%** increase in repeat business.\nConducted technical presentations and training sessions in both **German** and **English**, enhancing the client’s understanding and proficiency in using our systems.\nDeveloped and maintained detailed documentation of project specifications and client interactions, ensuring all technical communications were precise and valuable for future reference."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Demonstrated **technical communication** skills by effectively presenting complex **lighting systems** and **electrotechnics** solutions to customers, ensuring their specific needs are met and understood.\nApplied **project management** techniques to coordinate cross-functional teams, improving responsiveness and customer orientation while delivering critical projects on time and within budget, achieving an average project delivery rate of **95%**.\nUtilized **networking** strategies to build strong relationships with clients, enhancing customer satisfaction and loyalty, leading to a **15%** increase in repeat business over the last year.\nEmployed **critical thinking** to analyze customer requirements and propose tailored solutions, resulting in a **20%** improvement in sales conversion rates through effective presentations and demos.\nConducted comprehensive training sessions in both **German** and **English** for clients and team members, fostering a clear understanding of product capabilities and applications, which improved technical literacy by **30%** among sales staff.\nLed initiatives to enhance customer orientation in product offerings, resulting in the successful customization of **lighting systems** for diverse client specifications, thereby enhancing overall user experience.\nCollaborated with engineering teams to bridge customer feedback with technical requirements, ensuring a seamless transition from customer requests to technical solutions, underscoring the importance of effective **technical communication** throughout the sales process."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Electrotechnics, Lighting Systems, Customer Orientation, Technical Communication, Project Management, Networking, Critical Thinking, German, English",
  "apply_company": "Eaton"
}