{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Tools Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Tools Engineer with over 13 years of expertise in delivering high-performance applications across diverse industries, including healthcare and finance. Proficient in **C#**, **Python**, and automation strategies to enhance user experience and streamline game development processes. Strong background in **CI/CD** practices with tools such as **Jenkins** and **Gitlab CI**, leveraging automation to ensure efficient delivery cycles. \n\nExperienced in frontend and backend technologies, including hands-on development with **React**, **Next.js**, and **Node.js**, along with a solid foundation in **Unity** for game development. \n\nExcellent communication and interpersonal skills, fostering collaboration in cross-functional teams. Adept at building user-centric solutions, focusing on automation and real-time processing, while ensuring compliance with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Tools Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **Python** to design and build advanced tools for game development, enhancing user experience and automation processes across projects.\nLed the implementation of CI/CD pipelines using **Jenkins** and **GitLab CI**, achieving a deployment frequency improvement of **30%** and reducing rollout times to **5 minutes** per feature.\nCollaborated with cross-functional teams to enhance communication and interpersonal skills, ensuring requirements were met on time and with high quality, impacting user satisfaction positively by **25%**.\nDeveloped automation scripts using **Lua** within the **Unity** environment to streamline workflows and improve development efficiency, achieving a **40%** reduction in manual testing efforts.\nEngaged in game development processes by providing effective solutions and support to improve overall team productivity, resulting in the launch of **3** successful titles within **12 months**.\nIncorporated feedback mechanisms into tools to enhance user experience, utilizing analytics to inform design choices and updates based on player engagement metrics.\nDefined and enforced testing strategies across development pipelines, utilizing automation frameworks to ensure comprehensive coverage and facilitate faster iteration cycles.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **C#** and **Python** to develop tools enhancing automation and user experience within the game development lifecycle.\nImplemented continuous integration and delivery (CI/CD) pipelines using **Jenkins** and **Gitlab CI**, achieving deployment frequency improvements of up to **30%**.\nCollaborated with cross-functional teams to gather requirements and translate them into impactful tools, demonstrating strong communication and interpersonal skills.\nStreamlined game development processes by optimizing workflows with automation strategies, resulting in a reduction of development time by **15%**.\nCreated user-friendly interfaces and tools that improved developer productivity, receiving positive feedback from over **50** team members for enhanced usability and functionality.\nDocumented tool development processes and provided training sessions for team members, helping to foster a culture of knowledge sharing that increased team efficiency by **20%**.\nLed brainstorming sessions to gather feedback on tool effectiveness and user experiences, ensuring tools remained aligned with developer needs and company objectives.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed automation scripts and tools using **Python** for the enhancement of game development workflows, optimizing processes to boost productivity by **30%**.\nImplemented CI/CD pipelines using **Jenkins** and **GitLab CI** to ensure robust and swift deployments, reducing deployment times by **50%** and maintaining high software quality.\nCollaborated with cross-functional teams to enhance user experience design, focusing on seamless integration of tools that improved game development efficiency and UX feedback loops.\nCreated and maintained documentation and user guides for various tools, ensuring clear communication and comprehensive resources for team members, resulting in a **40%** reduction in onboarding time for new engineers.\nEngineered solutions utilizing **C#** for developing real-time analytics within games, allowing for data-driven decision-making that improved gameplay strategies.\nFacilitated communication and interpersonal skills to foster a collaborative environment among developers, designers, and stakeholders, enhancing project outcomes and team morale.\nUtilized **Lua** for scripting game mechanics and automating testing processes, increasing test coverage by **20%** and improving overall code reliability.\nLed workshops and training sessions to promote best practices in automation and CI/CD across the team, building a shared knowledge base and improving collective skills in the department.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, C#, Lua\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tNginx, Let’s Encrypt, Certbot, Keycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, Jenkins, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, game development, automation, user experience, communication, interpersonal",
  "apply_company": "Voodoo"
}