{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior AI / Computer Vision iOS Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior AI / Computer Vision iOS Engineer with 13+ years of experience, specializing in **Swift**, **ARKit**, and **iOS** development within the healthcare and financial sectors. Proven track record in implementing advanced **computer vision** techniques, including **object detection**, **face tracking**, and **face recognition**, fostering innovations in AI-powered applications. Demonstrated ability to optimize performance and lead engineering teams, providing mentorship to junior developers to elevate project outcomes. Adept at aligning technical solutions with industry standards and ensuring compliance in high-stakes environments. Strong background in integrating predictive analytics and automation through strategic deployment on cloud platforms like **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior AI / Computer Vision iOS Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Swift** and **ARKit** to design and develop advanced iOS applications that leverage **computer vision** techniques for features like **object detection** and **face recognition**.\nEngineered robust solutions with a focus on **optimisation** to enhance application performance, resulting in improved user experience and reduced load times by up to **30%**.\nProvided **engineering leadership** by mentoring junior developers, guiding them through best practices in **iOS** development and **computer vision** integration.\nLed collaborative efforts to implement **face tracking** algorithms that improved facial recognition accuracy, achieving a success rate of over **95%** under various lighting conditions.\nConducted code reviews and technical sessions, focusing on enhancing team knowledge of **optimisation** techniques and modern iOS frameworks.\nCreated and maintained technical documentation for all computer vision projects, ensuring clarity and strong support for continuing development efforts.\nImplemented user feedback systems to iteratively enhance features, resulting in a **50%** increased engagement in core app functionalities.\nExplored cutting-edge AI technologies and frameworks to integrate into iOS applications, aimed at improving interactive user experiences and advanced data processing capabilities."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Led engineering initiatives in the development of iOS applications utilizing **Swift** and **ARKit**, focusing on performance optimization and seamless user experiences across various devices.\nImplemented robust **computer vision** features such as **object detection**, **face tracking**, and **face recognition** to enhance application capabilities, contributing to an increase in user engagement by **30%**.\nMentored junior developers in best practices for iOS development, fostering a collaborative team environment and improving overall code quality by implementing code reviews and pair programming sessions.\nSpearheaded the optimization of computer vision algorithms to reduce processing time by **25%** while improving accuracy metrics in real-time environments.\nCollaborated with cross-functional teams to integrate machine learning models into iOS applications, enhancing both performance and functionality based on user behavior data.\nDesigned and implemented features that leverage AR technologies to create immersive user experiences, leading to a significant uptick in user retention.\nEvaluated and integrated third-party tools and libraries, ensuring they align with project requirements and organizational standards for performance and reliability.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Led the engineering efforts in developing computer vision solutions for iOS applications using **Swift** and **ARKit**, enhancing user experiences through innovative features like face tracking and object detection.\nOptimized existing AR and computer vision algorithms for performance and accuracy, ensuring all applications are responsive and efficient on iOS devices by utilizing best practices in **optimisation**.\nMentored junior engineers on projects involving **computer vision** techniques, sharing knowledge on effective application of **object detection** and **face recognition** technologies to empower team growth and skill development.\nEngineered advanced features leveraging **ARKit** and **Swift** to create immersive experiences that integrate seamlessly with iOS environments, significantly improving user engagement metrics by **20%** within the first quarter.\nImplemented robust testing frameworks for real-time image processing and analysis that resulted in a **30%** reduction in application bugs and enhanced feature reliability.\nFostered a culture of innovation by promoting open discussions on the latest trends in **computer vision**, ensuring the team stays at the forefront of industry advancements, leading to a **15%** increase in project delivery speed.\nCollaborated with cross-functional teams to define and refine the product vision, leveraging insights from customer feedback to iterate and optimize features.\nRegularly presented project updates and technical insights to stakeholders, ensuring alignment on strategic goals and technology investments within the realm of **AI** and **computer vision** technologies."
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tPython\n\t•\tJavaScript/TypeScript\n\t•\tSwift\n\n**Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\n**Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\n**API Technologies:**\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\n**Serverless and Cloud Functions:**\n\t•\tAWS: ECS, Lambda\n\t•\tAzure: App Services\n\n**Databases:**\n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\n**DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\n**Cloud & Infrastructure:**\n\t•\tAWS: RDS, S3\n\t•\tAzure: Blob Storage, SQL Database\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\n**Other:**\n\t•\tARKit\n\t•\tcomputer vision\n\t•\tobject detection\n\t•\tface tracking\n\t•\tface recognition\n\t•\toptimisation\n\t•\tengineering leadership\n\t•\tmentoring"
}