{
  "name": "Tomasz Lee",
  "role_name": "Senior Platform Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Platform Engineer with 9+ years of experience in developing and implementing complex applications, focusing on blockchain technologies and EVM-based solutions. Proficient in **Go**, **Rust**, **C++**, **Scala**, **Solidity**, and **Yul**, with a strong understanding of **Merkle trees**, **cryptography**, and **protocol components**. Experienced in creating and managing **CI/CD** processes, enhancing developer experience through effective technical documentation and observability practices. Demonstrated expertise in algorithms, data structures, and system performance optimization. Recognized for cross-functional communication and collaboration to drive project success. Original strengths include hands-on experience with microservices architecture, distributed systems, **Apache Kafka**, **RabbitMQ**, and cloud services.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Platform Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Implemented CI/CD pipelines to enhance release pipelines, achieving a **40%** reduction in deployment time.\nDesigned and developed observability tools for monitoring system performance across various platforms using **.NET 7**, **ReactJS**, and **Next.js**.\nOptimized algorithms and data structures, achieving a **20%** improvement in average query execution time and ensuring efficient data handling.\nCollaborated on blockchain solutions utilizing **Solidity** and **Rust**, enhancing smart contract functionality and developer experience.\nDeveloped technical documentation to facilitate cross-functional communication among teams, improving collaboration and project clarity.\nConstructed microservices architecture leveraging **Go** for improved scalability and maintenance, supporting the platform's growing user base.\nIntegrated cryptographic techniques for secure data storage and transfer in line with industry best practices.\nUtilized container orchestration for environment orchestration, ensuring smoother deployment processes and system resilience.\nImplemented protocols and components for blockchain interactions, including work with **Merkle trees** for data integrity.\nDeveloped robust reporting capabilities utilizing data visualization libraries to present complex information succinctly for decision-makers."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Go** and **Rust** to develop high-performance blockchain applications, ensuring robust integration with **Ethereum Virtual Machine (EVM)** standards.\nImplemented **CI/CD** pipelines to streamline code deployment processes, reducing release times by **30%** and enhancing observability across development phases.\nDesigned algorithms and data structures to improve system performance, achieving a **25%** reduction in processing times for decentralized transactions.\nCrafted technical documentation to facilitate cross-functional communication with stakeholders, improving clarity and developer experience in project execution.\nDeveloped release pipelines using **Foundry** and integrated **Solidity** for smart contract deployment, adhering to best practices in cryptography and security protocols.\nEngineered scalable solutions using **C++** and **Scala** for protocol components, driving a **15%** increase in system reliability and uptime.\nLed initiatives in environment orchestration strategies to ensure efficient resource allocation and performance tuning.\nMentored junior developers in blockchain technologies, fostering a culture of continuous learning and improving overall team productivity.\nConducted in-depth code reviews to ensure adherence to high coding standards and algorithmic efficiency, ultimately enhancing team output.\nDeveloped observability features for monitoring and performance tracking, utilizing tools that provide insights into system health and response times."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Focused on enhancing **developer experience** through the implementation of best practices and technical standards:\n- Improved system performance by 20% by contributing to the design and development of scalable blockchain solutions utilizing **Go**, **Rust**, and **Solidity**.\n- Developed high-performance algorithms and optimized data structures to efficiently handle **Merkle trees** within the blockchain environment.\n- Led cross-functional communication initiatives to coordinate tasks between teams and stakeholders, ensuring project alignment and success.\n- Established **CI/CD** pipelines with **observability** features for robust deployment processes, leading to a 15% reduction in deployment times.\n- Participated in the development of protocol components and infrastructure orchestration, focusing on **environment orchestration** for smoother workflows.\n- Delivered comprehensive technical documentation to facilitate onboarding and knowledge transfer among teams, improving efficiency in project handovers.\n- Utilized **Foundry** for smart contract development and testing, enhancing reliability in code delivery through advanced testing techniques.\n- Mentored junior developers in best practices for implementing cryptography and secure coding principles in blockchain applications.\n- Collaborated on implementing **release pipelines** to ensure seamless updates and version control, contributing to an increase in code reliability.\n- Engaged in continuous learning and adaptation of new technologies, staying updated on **Scala**, **C++**, and other languages to support broader project needs."
    }
  ],
  "skills": "  **Programming Languages:** Go, Rust, C++, Scala, Python, Solidity, TypeScript, JavaScript\n\n  **Backend Frameworks:** NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks:** ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies:** RESTful API, GraphQL\n\n  **Serverless and Cloud Functions:** AWS, Azure\n\n  **Databases:** MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps:** CI/CD, CI/CD pipelines, release pipelines, observability, environment orchestration\n\n  **Cloud & Infrastructure:** AWS, Azure\n\n  **Other:** UX/UI Design, Git, GitHub, algorithms, data structures, system performance, cryptography, Merkle trees, protocol components, developer experience, technical documentation, cross-functional communication, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Matter Labs"
}