{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with 9+ years of experience in developing and implementing **microservices** and **distributed systems**. Proficient in **Go**, **Docker**, **Kubernetes**, and **Infrastructure as Code**, enabling robust application architecture and efficient deployment strategies. Proven expertise in leveraging **Grafana** and **Prometheus** for monitoring and enhancing performance. Strong programming skills in **Python**, **C**, **C++**, and **Rust** complemented by a solid understanding of **Clean Code** principles. Recognized for exceptional problem-solving abilities and fostering effective collaboration within cross-functional teams, ensuring project objectives are met on time and within scope.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Designed and developed distributed systems using **Go** and **Kubernetes**, enhancing system scalability and reliability in a cloud environment.\n• Implemented microservices architecture principles for improved modularity and maintainability, leveraging technologies like **Docker** and **Infrastructure as Code**.\n• Integrated **Prometheus** and **Grafana** for monitoring and performance metrics, resulting in a **20%** decrease in downtime.\n• Spearheaded the optimization of system performance through **Clean Code** practices, significantly improving code maintainability and readability.\n• Collaborated with cross-functional teams, enhancing collaboration and communication across development and operations, fostering a culture of innovation and efficiency.\n• Leveraged **Python** for automating deployments and testing processes, yielding a **30%** increase in deployment frequency.\n• Advised on strategies for site reliability engineering (SRE), ensuring high availability and resilience of applications in production.\n• Applied **Problem Solving** skills to troubleshoot and resolve critical issues in a timely manner, maintaining system integrity and performance.\n• Developed a reporting engine using **D3.js** and **Three.js** for interactive data visualizations, improving data insights for end-users.\n• Integrated **JWT** for secure authentication and authorization, reinforcing application security."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Leveraged **Go** and **Docker** to design and develop microservices in a cloud-based architecture, enhancing system scalability and resilience.\n• Employed **Kubernetes** for orchestrating microservices, resulting in improved resource management and deployment efficiency.\n• Implemented **Prometheus** and **Grafana** for monitoring and logging, facilitating real-time insights into system performance and uptime by **99%**.\n• Contributed to infrastructure as code using **Terraform**, streamlining deployment processes and reducing setup times by **40%**.\n• Utilized **Python** for automation scripts, improving operational efficiency in managing distributed systems.\n• Established best practices in **Clean Code** principles to enhance code quality, leading to a **20%** reduction in bug rates.\n• Fostered collaboration and communication within teams to define system requirements and timelines, leading to successful project outcomes with a **100%** on-time delivery rate.\n• Problem solved complex issues arising from system integrations, ensuring robust and stable backend services.\n• Mentored junior developers in core backend technologies, improving team knowledge and performance.\n• Conducted code reviews and provided feedback, contributing to a **15%** increase in overall code quality within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **Go** and **Docker** to develop scalable backend services, optimizing resource utilization by **30%**.\nDesigned and implemented **Microservices** architecture, improving system resilience and allowing independent deployment of services.\nUtilized **Kubernetes** for orchestrating containerized applications, enhancing system reliability and automated scaling by **25%**.\nMonitored application performance through **Grafana** and **Prometheus**, identifying bottlenecks and improving response times by **15%**.\nApplied **Infrastructure as Code** principles to automate deployment processes, reducing manual configuration errors and deployment time by **40%**.\nImplemented best practices for **Clean Code** and conducted code reviews to uphold code quality standards across the team.\nCollaborated across teams to solve complex problems, integrating backend services with front-end solutions to deliver a seamless user experience.\nCommunicated effectively with cross-functional teams to align project goals and deliverables, enhancing overall project execution.\nParticipated in organized knowledge-sharing sessions focusing on best practices in **Distributed Systems** and **SRE**.\nProvided ongoing support and maintenance for existing systems, enhancing the reliability and performance of backend services."
    }
  ],
  "skills": "    **Programming Languages**\n    \tPython, Go, C, C++, Rust, JavaScript, TypeScript\n\n    **Backend Frameworks**\n    \tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n    **Frontend Frameworks**\n    \tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n    **API Technologies**\n    \tRESTful API, GraphQL\n\n    **Serverless and Cloud Functions**\n    \tAWS, Azure, Cloud\n\n    **Databases**\n    \tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n    **DevOps**\n    \tDocker, Kubernetes, Grafana, Prometheus, CI/CD pipelines, Infrastructure as Code\n\n    **Cloud & Infrastructure**\n    \tSRE, Distributed Systems\n\n    **Other**\n    \tUX/UI Design, Git, GitHub, Redux, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Clean Code, Collaboration, Communication, Problem Solving",
  "apply_company": "Grafana Labs"
}