{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Data Platform Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior Data Platform Engineer with 13+ years of experience in data governance and metadata management, specializing in **Databricks Unity Catalog**, **Collibra**, **SQL**, and **Python**. Proven ability to implement robust CI/CD pipelines and manage complex Azure Cloud environments, leveraging **Azure DevOps**, **Azure CLI**, and **PowerShell**. Expertise in data lineage and security best practices, including RBAC and ABAC in compliance frameworks such as HIPAA and PCI DSS. Demonstrated capability in collaborating within Agile environments to drive analytical solutions and optimize cloud-native applications.\nAdditionally, hands-on experience in developing high-performance applications across healthcare and financial industries with proficiency in **JavaScript/TypeScript**, **React**, **Node.js**, and backend frameworks like **FastAPI** and **Django**. Strong background in building AI/ML platforms and implementing microservices, event-driven architectures, MLOps strategies using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Platform Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **Data Governance** strategies leveraging **Collibra** and **Databricks Unity Catalog** to ensure comprehensive metadata management and data lineage tracking across projects in compliance with various regulatory frameworks.\nDeveloped and maintained **SQL** databases ensuring adherence to **RBAC** and **ABAC** principles for secure data access management within applications.\nDesigned **CI/CD** pipelines using **Azure DevOps**, incorporating automation tools for streamlined integration and deployment processes across development environments.\nCollaborated with cross-functional teams in an **Agile** setting to ensure project alignment and foster effective communication throughout the development stages.\nUtilized **Python** to build data processing frameworks and analytical tools, generating insights from large datasets efficiently leading to a **40%** increase in data processing speed.\nLeveraged **Azure CLI** and **PowerShell** scripts for managing cloud resources, ensuring efficient deployment and infrastructure management across multi-cloud platforms such as **Azure** and AWS.\nEmployed **Terraform** for Infrastructure as Code (IaC) deployment strategies, streamlining infrastructure provisioning with at least a **30%** reduction in deployment time.\nDeveloped secure **REST APIs** to integrate data services within applications while adhering to best practices in security and compliance frameworks, including **GDPR** and **PCI DSS**.\nConducted thorough analysis and documentation of computing processes to support data governance efforts, resulting in improved tracking and compliance with industry standards.\nFostered a culture of collaboration and innovation among teams by actively participating in code reviews and knowledge sharing sessions, enhancing team performance and delivery.\nApplied analytical thinking to troubleshoot and resolve complex data issues, significantly improving data accuracy and reliability for stakeholders.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Ensured **Data Governance** and compliance with frameworks by implementing **Databricks Unity Catalog** and **Collibra**, enhancing data quality and lineage tracking across all financial platforms.\n• Developed and maintained data pipelines with **Python** and **SQL**, ensuring robust **metadata management** and streamlined access for teams, facilitating a **30%** reduction in data retrieval times.\n• Engaged in **CI/CD** processes using **Azure DevOps** for automated deployments and version management, improving deployment efficiency by **40%**.\n• Implemented role-based access control (**RBAC**) and attribute-based access control (**ABAC**) mechanisms within **Azure Cloud**, ensuring secure data handling in accordance with best security practices.\n• Collaborated in an **Agile** environment with cross-functional teams, enhancing project delivery timelines and increasing team satisfaction ratings by **25%**.\n• Utilized **Azure CLI** and **PowerShell** for infrastructure management and automation, leading to a **20%** reduction in manual provisioning efforts.\n• Effectively employed **Terraform** for infrastructure as code, facilitating consistent and repeatable deployments across multiple cloud environments, ensuring better resource management.\n• Designed and integrated **REST APIs** to facilitate communication between microservices, supporting enhanced functionality and modular architecture.\n• Analyzed and optimized data processes for compliance with internal and external audit requirements, significantly reducing compliance risks in operational workflows."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented **Data Governance** strategies and ensured compliance using **Collibra** and **Databricks Unity Catalog** to manage organizational data and metadata effectively.\nDeveloped and optimized backend services leveraging **Python** and **SQL**, focusing on high availability and robust data processing within the data platform.\nEstablished CI/CD pipelines through **Azure DevOps** and **Terraform**, automating deployment processes and enhancing operational efficiency by **30%**.\nLeveraged **Azure Cloud** services to design scalable solutions that accommodate growing data needs and workloads, contributing to a **25%** reduction in operational costs.\nApplied **RBAC** and **ABAC** models for secure access control to sensitive data, ensuring compliance with security best practices and frameworks.\nConducted data lineage tracking and metadata management to assist in troubleshooting and enhancing data quality across different sources and platforms.\nPromoted collaborative development practices within Agile teams, ensuring timely delivery of features and enhancements that adhere to organizational standards.\nExecuted REST APIs integration, delivering significant improvements in data accessibility and interoperability between systems, achieving a **40%** increase in data retrieval speed.\nUtilized **Azure CLI** and **PowerShell** for managing and automating cloud resources, which improved resource management efficiency.\nEngaged in analytical reviews and data audits to ensure that data integrity and compliance standards are upheld across all platforms."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, SQL\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **API Technologies:**\n\tREST APIs\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, CI/CD, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure Cloud, Azure: App Services, Blob Storage, SQL Database, Azure DevOps, Azure CLI, PowerShell\n\n **Other:**\n\tData Governance, Databricks Unity Catalog, Collibra, RBAC, ABAC, Metadata Management, Data Lineage, Agile, Collaboration, Analytical, Security Best Practices, Compliance Frameworks, Multi-cloud Exposure, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose"
}