{
  "name": "Tomasz Lee",
  "role_name": "Principal Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Principal Engineer with 9+ years of experience in developing scalable and reliable systems utilizing **Microservices architecture**, **DevSecOps**, **DevOps**, **MLOps**, and **Infrastructure as Code**. Proficient in a diverse tech stack including **Python**, **Java**, **JavaScript**, **TypeScript**, **React**, **SQL**, and **AI/ML integration**. Demonstrated expertise in automated testing and ensuring observability, performance, and security across applications. Strong leadership skills with a proven ability to coach and mentor teams, fostering collaboration to drive projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Principal Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "- Leveraged **Python** and **JavaScript** to spearhead the design and development of a web-based customer management platform using **.NET 7**, **ReactJS**, and **Next.js**, improving user satisfaction by **25%**.\n- Designed and implemented a **microservices architecture** using **.NET Core** to enhance scalability and maintainability of the system, accommodating **up to 100,000** concurrent users.\n- Integrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, significantly improving system resilience and throughput by **30%**.\n- Utilized **Redis** for caching frequently accessed data, reducing database load and improving response times by **35%**.\n- Developed RESTful APIs with **.NET**, integrated with a **MongoDB** database, offering seamless data access across various services and supporting high transaction volumes.\n- Implemented **CI/CD pipelines** on **Azure DevOps**, achieving a **40%** reduction in deployment time and enhancing collaboration.\n- Optimized **MSSQL** database queries and indexing, leading to a **20%** decrease in average query execution time and improved performance.\n- Mentored and collaborated with UX/UI designers to elevate the platform’s user interface, fostering an enhanced user experience.\n- Developed a reporting engine using **D3.js** and **Three.js** for interactive data visualizations, facilitating better data comprehension for users.\n- Implemented **JWT-based authentication** and authorization measures to secure the application, ensuring reliable security protocols."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Lead the design and development of scalable, high-performance systems using **Python**, **Java**, **JavaScript**, and **TypeScript**, contributing to an overall increase in system reliability by 20%.\nUtilize **AI/ML integration** and **AI-assistive development tools** to enhance project outcomes and foster innovation within the team.\nImplement **Microservices architecture** to support a modular approach in application development, improving deployment speed by 40%.\nAdopt **DevSecOps** practices to ensure security considerations are integrated throughout the development lifecycle, reducing vulnerabilities by 50%.\nDrive **Automated testing** strategies to uphold software quality, achieving a **95% test coverage** across key projects.\nCollaborate with cross-functional teams to define system requirements, ensuring alignment with project delivery timelines and user needs.\nFoster a culture of learning and improvement by providing **Coaching** and **Mentorship** to junior developers, enhancing team skill sets by an average of **30%** as measured in performance reviews.\nOptimize database management processes using **SQL** for efficient data storage and retrieval, leading to a **20% improvement** in query performance.\nIncrease observability of applications through advanced monitoring and logging practices, identifying potential issues before they impact system availability.\nParticipate in the creation of infrastructure as code, allowing for rapid environment setup and consistent deployment processes across development, staging, and production environments."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized advanced programming languages like **Python**, **JavaScript**, and **TypeScript** to enhance system capabilities and integrations, driving a **30%** efficiency increase in development processes.\nLed the transition toward **Microservices architecture**, improving service scalability by **40%**, while ensuring high reliability and performance across applications.\nImplemented **DevOps** practices, including automated testing and **Infrastructure as Code** strategies, to streamline deployment and reduce release cycles by **25%**.\nCollaborated with cross-functional teams to integrate machine learning solutions using **AI/ML integration**, resulting in innovative features that enhanced user experience.\nConducted code reviews and mentorship sessions, fostering a culture of **collaboration** and continuous improvement, which elevated team performance metrics by **15%**.\nDesigned and managed SQL databases for data engineering initiatives, increasing query efficiency by **20%** and optimizing data retrieval times.\nDeveloped and maintained robust security protocols to ensure system integrity and user data protection, achieving compliance with industry standards.\nChampioned observability practices, incorporating tools that enhanced system monitoring and troubleshooting, leading to a **50%** reduction in downtime incidents.\nFacilitated relationship building with stakeholders to ensure alignment with project goals and requirements, promoting successful project delivery.\nDelivered comprehensive technical documentation and user guides, improving system onboarding process for new team members by **30%**."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, Java, JavaScript, TypeScript, Ruby, Scala, R, SQL, Go\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Microservices architecture, Entity Framework\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, DevOps, DevSecOps, MLOps, Infrastructure as Code, Automated testing, Observability\n\n**Cloud & Infrastructure**\n\tScalability, Security, Reliability, Performance\n\n**Other**\n\tUX/UI Design, Git, GitHub, Coaching, Mentorship, Collaboration, Blockchain, Solidity, Ether.js, Web3.js, Ethereum"
}