{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a results-driven Senior QA Engineer, I possess extensive expertise in **QA**, **SaaS**, and **API Testing**, utilizing tools like **Postman**, **Cypress**, and **Playwright** for thorough **automated testing** and **regression testing**. I have a solid foundation in **JavaScript**, **TypeScript**, and **Python**, which enhances my ability to collaborate with development teams and ensure high-quality software delivery. Additionally, my experience with **OAuth** and **webhooks** enables seamless integration across platforms.\n\nWith 8 years of experience as a Full Stack Developer, I have successfully built high-performance solutions in the healthcare and financial sectors, leveraging a diverse tech stack including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I also bring a strong understanding of mobile testing for both **iOS** and **Android**, along with hands-on experience in documenting tests and communicating with cross-functional teams. My focus on compliance standards like HIPAA and PCI DSS complements my capabilities in delivering secure and reliable applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and executed comprehensive **QA** strategies focusing on **automated testing**, regression testing, and mobile testing for healthcare and financial platforms, ensuring all features met industry compliance standards.\nPerformed **API Testing** using tools like **Postman** and **Cypress**, ensuring robust functionality and integration with third-party services such as Google Calendar and Zoom.\nCollaborated closely with development teams, utilizing **JavaScript**, **TypeScript**, and **Python** to enhance testing processes and drive quality assurance initiatives.\nDesigned and maintained end-to-end test scenarios leveraging **Cypress** and **Playwright** for both web and mobile applications on **iOS** and **Android** platforms.\nConducted rigorous **manual testing** and **documentation** of test cases, ensuring clear communication of test strategies and outcomes to stakeholders to align with project goals.\nMonitored and reported on test execution metrics, identifying trends and areas for improvement, which resulted in a **25% reduction** in post-deployment defects over **3** consecutive releases.\nLed the implementation of continuous integration/continuous deployment (CI/CD) practices for automated testing, significantly improving the efficiency of the testing cycle by **40%**.\nFacilitated team workshops to educate colleagues on **QA** best practices and tools, improving overall quality literacy and team collaboration.\nIntegrated testing processes with agile methodologies, ensuring timely delivery of features while adhering to sprint timelines and maintaining high-quality standards."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive **API Testing** for high-availability financial platforms by utilizing **Postman** and **Cypress**, ensuring seamless integration and functionality of various microservices.\nExecuted both **manual testing** and **automated testing** strategies to validate systems developed using **JavaScript**, **TypeScript**, and **Python**, increasing defect identification by **30%** across the board.\nDevised and implemented testing frameworks and methodologies specifically tailored for **SaaS** applications, achieving a **95%** test coverage on critical features and reducing regression test cycle time by **40%**.\nCoordinated with cross-functional teams to enhance **communication** and **documentation** processes for test cases, fostering clarity and efficiency among developers and stakeholders.\nLed mobile testing efforts for both iOS and Android applications, ensuring compatibility with major calendar integrations such as **Google Calendar** and **Outlook Calendar**, and enhancing user experience in applications through rigorous QA practices.\nFacilitated real-time collaboration and issue tracking using tools like **Zoom**, streamlining the feedback loop and significantly improving response time for identified bugs.\nOversaw the generation of testing reports for senior management, providing insights that guided test strategy adjustments and improved product delivery timelines by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted **regression testing** and **automated testing** on web and mobile applications, ensuring seamless functionality across different platforms, including **iOS** and **Android**.\nDeveloped and executed **API Testing** strategies utilizing **Postman** and **Cypress**, facilitating thorough verification of backend services to confirm compliance with functional specifications and performance benchmarks.\nCollaborated with cross-functional teams to enhance the overall **SaaS** product quality, contributing to an increase in user satisfaction ratings by **15%** through effective communication and documentation practices.\nUtilized **JavaScript** and **TypeScript** for writing robust test scripts, automating repetitive test cases, and improving overall efficiency by reducing manual testing time by up to **30%**.\nImplemented **OAuth** for authentication in APIs, ensuring secure access and protecting user data while performing thorough security testing for vulnerabilities.\nEngaged in **manual testing** of e-commerce functionalities, including checkout and payment workflows, identifying defects and enhancing the user experience, leading to a **20%** decrease in reported bugs post-release.\nManaged and documented all test processes, results, and defects, providing reports and insights for continuous improvement while maintaining clear communication with stakeholders.\nEmployed testing frameworks such as **Playwright** for cross-browser testing, ensuring consistent user experience and application behavior across **5** major browsers.\nFacilitated **webhooks** integration for events in applications like **Google Calendar** and **Outlook Calendar**, offering users real-time updates and notifications, thus improving engagement and usability.\nConducted training sessions for team members on **mobile testing** tools and best practices, resulting in a more proficient QA team and increased test coverage by **25%**."
    }
  ],
  "skills": " **Programming Languages:**\n\t Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\t FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\t React, Vue, Angular\n\n **API Technologies:**\n\t Postman, OAuth, webhooks\n\n **Serverless and Cloud Functions:**\n\t AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\t PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\t Docker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\t AWS, Azure\n\n **Other:**\n\t QA, SaaS, API Testing, Cypress, Playwright, Google Calendar, Outlook Calendar, Zoom, iOS, Android, regression testing, manual testing, automated testing, mobile testing, documentation, communication",
  "apply_company": "Amberscript"
}