{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Staff Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Staff Engineer with 8 years of comprehensive experience in designing and implementing robust, high-performance applications. Proficient in **Ruby**, **Ruby on Rails**, **Django**, **JavaScript**, **Python**, **Node.js**, and cloud services like **AWS**. Skilled in modern software development methodologies, including Domain-Driven Design and CI/CD practices using **Jenkins** and **GitLab** for continuous integration and automated testing. \n\nI possess deep expertise in **Kafka** and **SQS** for building scalable event-driven systems, along with RESTful APIs and GraphQL for seamless integration. My extensive background in AI and ML allows me to effectively incorporate intelligence into applications. Throughout my career, I have focused on industries such as healthcare and finance, emphasizing compliance with standards such as HIPAA and PCI DSS. I have a solid foundation in observability and have led the development of enterprise-grade solutions utilizing microservices architecture. My passion for innovation drives me to create secure applications that push technological boundaries.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Staff Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Expertly utilized **Ruby**, **Ruby on Rails**, and **Django** to enhance backend services, ensuring high performance and scalability within healthcare and finance platforms.\n- Developed robust **RESTful APIs** and **GraphQL** services to facilitate seamless communication between front end and back end, improving user experience and data interchange.\n- Led the implementation of **CI/CD** pipelines using **Jenkins** and **Gitlab**, ensuring consistent and efficient deployment practices across 100% of services.\n- Architected the cloud infrastructure leveraging **AWS** and **Docker**, ensuring system reliability and uptime of over **99.9%** by employing best practices in **Domain-Driven Design** and observability.\n- Integrated advanced **AI** and **ML** techniques for real-time data processing and predictive analytics, significantly enhancing decision-making processes for healthcare providers and financial institutions.\n- Collaborated with cross-functional teams to implement comprehensive **automated testing** strategies using industry-standard tools, leading to a **30%** reduction in production bugs.\n- Spearheaded the transition to microservices architecture with high availability configurations, successfully improving system performance metrics by **50%**.\n- Championed the development of data visualization tools utilizing modern frameworks, enabling stakeholders to gain insights from complex datasets easily.\n- Engaged closely with product management to align on requirements and deliverables, ensuring that priorities and deadlines were consistently met or exceeded."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Designed and implemented backend services using **Ruby on Rails** and **Django** to support scalable financial transactions, achieving a throughput improvement of **30%**.\n• Developed RESTful APIs and **GraphQL** endpoints for dynamic data access, ensuring efficient communication between frontend and backend systems.\n• Leveraged **CI/CD** practices using **Jenkins** and **GitLab** to automate software deployment, reducing release cycle time by **40%**.\n• Led the modernization of applications with a focus on **Domain-Driven Design**, enhancing code maintainability and system reliability.\n• Integrated **Kafka** and **SQS** to facilitate seamless event-driven architecture for real-time financial transaction processing and alerts.\n• Implemented robust observability practices that monitor system performance, reducing downtime by **25%**.\n• Conducted automated testing with frameworks in **Ruby**, **Python**, and **JavaScript**, improving code quality and reducing bugs by **50%**.\n• Collaborated with cross-functional teams to drive the adoption of **AI** and **ML** technologies for predictive analytics and operational efficiency in financial services.\n• Championed the development of high-quality documentation and coding standards, fostering best practices among team members."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Enhanced backend services for a global e-commerce platform utilizing **Python (Django)** and **Node.js (Express)**, focusing on scalability and performance across key modules including checkout, cart, and order fulfillment.\n\nLeveraged **AI** and **ML** techniques to integrate recommendation engines, utilizing tools such as **scikit-learn** and **TensorFlow** to optimize product listings and boost conversion rates through real-time data analysis.\n\nEngineered event-driven architecture utilizing **Kafka** and **RabbitMQ** for real-time features, facilitating dynamic inventory tracking and order updates, with an aim to enhance customer support responsiveness.\n\nDeveloped and maintained frontend applications with **JavaScript** frameworks including **React (18)** and **Vue 3**, applying **TypeScript** and **Redux Toolkit** to ensure seamless, fast user experiences across web and mobile platforms, achieving a **25% increase in user engagement**.\n\nImplemented efficient data storage solutions using **PostgreSQL**, **MongoDB**, and **Redis**, ensuring fast, reliable access to data for high-traffic workflows, and achieving **99.9% uptime** on all database interactions.\n\nDesigned and executed CI/CD pipelines using **Jenkins** and **GitLab**, streamlining deployment processes and reducing release times by **40%**, while ensuring robust observability for all microservices.\n\nApplied RESTful APIs and **GraphQL** to optimize data transfer between frontend and backend, ensuring a more flexible and efficient system architecture.\n\nDeveloped payment processing features integrated with **Stripe**, **PayPal**, and **Razorpay**, ensuring compliance with PCI standards through tokenized transactions to secure sensitive customer data.\n\nImplemented role-based access control (RBAC) and utilized OAuth 2.0, ensuring secure customer and admin access while achieving GDPR compliance and safeguarding user data integrity throughout the platform."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Ruby, JavaScript, TypeScript, Go, Java\n\n**Backend Frameworks:**\n\tDjango, Ruby on Rails, Spring Boot, FastAPI, Flask\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful APIs, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda, ECS), Azure App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Jenkins, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tML, AI, Kafka, SQS, Domain-Driven Design, observability, automated testing, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)",
  "apply_company": "Housecall Pro"
}