{
  "name": "Tomasz Lee",
  "role_name": "Senior Java Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Java Engineer with 9+ years of extensive experience in developing and implementing high-quality applications using **Java**, **Spring**, **SpringBoot**, and **REST APIs**. Proficient in utilizing **JUnit** for testing, along with **Sonar** for code quality and consistency. Adept at working with **SQL** for database management and optimizing application performance. Bringing expertise in full-stack development, with a strong background in distributed systems and microservices architecture, alongside hands-on experience in **Apache Kafka**, **RabbitMQ**, and **Redis**. Proven track record of delivering efficient solutions, streamlining development workflows, and successfully leading cross-functional projects to completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and maintained high-quality APIs using **Java** and **SpringBoot**, demonstrating expertise in RESTful services and enhancing system integration.\n• Designed and implemented unit tests with **JUnit**, ensuring robustness and reliability of the application with a coverage of over **85%**.\n• Conducted code reviews and integrated static code analysis through **Sonar** to uphold code quality and standards.\n• Managed **SQL** database operations, optimizing queries and indexing which resulted in a **25%** reduction in execution time.\n• Collaborated with cross-functional teams to enhance application functionality and user experience, leading to a **30%** increase in customer satisfaction metrics.\n• Utilized **Swagger** for API documentation and testing, streamlining development processes and improving team collaboration.\n• Designed microservices architecture to enhance scalability and maintainability, successfully implementing **3** key services within **6 months**.\n• Implemented CI/CD practices to automate deployment cycles, significantly reducing deployment errors by **50%**.\n• Improved system performance by integrating caching mechanisms to reduce data retrieval time by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leverage **Java** and **Spring** frameworks to design and implement RESTful APIs, ensuring high performance and scalability.\nEmploy **JUnit** for unit testing, maintaining a test coverage of over **90%** to ensure software reliability and quality.\nUtilize **Swagger** for API documentation, streamlining communication with front-end teams and improving integration efficiency.\nIntegrate **SQL** databases, optimizing query performance and reducing response times by up to **30%**.\nDevelop microservices architecture, enhancing system modularity and allowing for independent deployment.\nParticipate in code reviews using **Sonar** to maintain code quality and adhere to best practices, aiming for a reduction in technical debt by **20%**.\nCollaborate with cross-functional teams to gather requirements and translate them into technical specifications, ensuring alignment with project timelines.\nDrive agile methodologies within the team, leading to a **15%** increase in sprint delivery success.\nMentor junior developers in **Java** and **SpringBoot**, fostering a culture of continuous learning and skill enhancement.\nContribute to the design of CI/CD pipelines, enhancing deployment frequency and reducing lead time for changes."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed RESTful APIs using **Java** and **Spring Boot** to enhance application functionality and ensure seamless integration with external services.\nImplemented automated testing frameworks such as **JUnit** to maintain code quality and foster test-driven development.\nDesigned and documented APIs with **Swagger** for improved communication and clarity among development teams.\nOptimized database interactions using **SQL**, achieving a **30%** increase in data retrieval speeds.\nParticipated in code reviews and utilized **Sonar** for code quality analysis, leading to a **15%** reduction in code issues.\nCollaborated with cross-functional teams to develop and implement best practices for application performance and maintainability.\nEngaged in daily standups to ensure project alignment and progress tracking across multiple stakeholders.\nDelivered technical documentation and training materials for internal use, facilitating better onboarding and knowledge transfer for new developers."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, Python\n\n**Backend Frameworks**\n\tSpring, SpringBoot, NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tREST, RESTful API, GraphQL, Swagger\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines, Sonar\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Redux",
  "apply_company": "GRUPO NS"
}