{
  "name": "Patryk Zaslawski",
  "role_name": "Senior DevOps Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a results-driven Senior DevOps Engineer with 8+ years of software engineering experience, I excel in implementing high-performance solutions using **AWS**, **Terraform**, **Ansible**, **Jenkins**, **Datadog**, and **Bitbucket**. My technical proficiency includes managing containers and orchestrating environments on **Linux** and **Windows**, streamlining continuous integration/delivery processes. Additionally, I bring expertise in **Python**, enhancing automation through scripts in **Bash** and **Perl**. I have a solid foundation working with **Git** for version control, along with a strong understanding of **TCP/IP** networking and **ITIL** practices. My prior experience as a Full Stack Developer has honed my ability to deliver secure and robust applications, utilizing frameworks like **FastAPI**, **Django**, and front-end technologies such as **React** and **Angular**.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **AWS** services to manage and orchestrate scalable cloud infrastructure for healthcare applications.\nImplemented infrastructure as code using **Terraform**, automating deployment processes and ensuring consistency across environments, reducing deployment times by **30%**.\nManaged containerization strategies with **Docker** to enhance the scalability and portability of applications, and orchestrated deployment using **Kubernetes** on **AKS/EKS**.\nDeveloped and maintained CI/CD pipelines utilizing **Jenkins** and **Git**, ensuring automated testing and reliable deployments across multiple environments.\nConfigured monitoring and observability solutions through **Datadog**, enhancing system performance tracking and proactive issue resolution.\nOrchestrated system configurations across both **Linux** and **Windows** environments, ensuring seamless integration and operation of health tech applications.\nAutomated routine tasks and system management using scripting languages such as **Bash** and **Perl**, increasing operational efficiency.\nCollaborated with cross-functional teams to implement infrastructure best practices adhering to ITIL frameworks, improving service delivery.\nParticipated in incident response, managing on-call duties to resolve system outages and improve overall uptime to **99.9%**.\nDocumented deployment processes and system architectures in **Jira** to enhance team collaboration and project tracking.\nMentored junior engineers on **Git** practices, container technologies, and cloud infrastructure management, fostering skill development within the team.\nLeveraged configuration management tools like **Ansible** to ensure systems are consistently deployed in desired states, enhancing system reliability.\nExecuted network configurations and maintenance tasks, utilizing **TCP/IP** protocols to ensure seamless communication across distributed systems.\nParticipated in capacity planning initiatives, predicting scaling needs based on system performance metrics to prepare infrastructure for peak usage.\nConducted thorough security assessments and compliance checks ensuring adherence to best practices and regulations, including SOC 2 and HIPAA."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Managed **AWS** resources and used **Terraform** to automate infrastructure deployment, resulting in a 30% reduction in provisioning time.\n• Implemented configuration management practices using **Ansible**, enhancing operational efficiency and reducing manual errors by 25%.\n• Deployed and maintained CI/CD pipelines with **Jenkins** and **Bitbucket**, achieving a 40% faster release cycle through automated testing and deployment processes.\n• Utilized **Datadog** for monitoring and logging, integrating it into infrastructure to improve incident response time by 35%.\n• Developed and maintained containerized applications using **Docker** and **Kubernetes**, optimizing resource utilization and scalability of services.\n• Handled version control and collaboration through **Git**, ensuring code integrity and facilitating seamless teamwork across 9 projects.\n• Performed system administration tasks on **Linux** and **Windows**, ensuring system reliability and performance for over 100 users.\n• Wrote automation scripts in **Bash** and **Python**, streamlining routine tasks that led to a 20% increase in team productivity.\n• Collaborated with product teams using **Jira** to track and resolve issues promptly, maintaining a backlog and improving project management processes.\n• Implemented ITIL practices to align IT services with business needs, improving service delivery with a 15% increase in user satisfaction reports.\n• Conducted TCP/IP network configuration and troubleshooting to ensure high availability and secure communication between services.\n• Contributed to DevOps best practices, incorporating automated testing to ensure reliability and facilitate smoother releases, resulting in a 50% decrease in production bugs.\n• Managed and monitored container orchestration using **Kubernetes** for strategic deployment and management of microservices, ensuring high availability and disaster recovery on a 24/7 basis."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented infrastructure as code using **Terraform** to manage and provision resources on **AWS**, ensuring scalability and reliability across cloud environments.\nAutomated deployment pipelines utilizing **Jenkins** and **Bitbucket**, integrating build, test, and release processes for faster and more reliable delivery cycles.\nDeveloped and maintained configuration management scripts with **Ansible**, automating the provisioning and configuration of Linux and Windows environments, resulting in a **30%** reduction in deployment time.\nMonitored system performance and health using **Datadog**, creating actionable insights for proactive issue resolution and enhancing overall system reliability.\nUtilized **Bash** and **PowerShell** scripts to automate routine tasks and improve operational efficiency, saving approximately **15 hours** per week in manual effort.\nDesigned containerized applications using **Docker**, streamlining application deployments and enabling consistent environments across development, testing, and production systems.\nManaged and configured **Linux** servers, optimizing system performance and security, while ensuring compliance with ITIL best practices.\nCollaborated with cross-functional teams using **Jira** for agile project management, enhancing team communication and project visibility.\nParticipated in troubleshooting network issues utilizing protocols like **TCP/IP**, ensuring minimal downtime and stable connectivity.\nLed initiatives to enhance disaster recovery plans, ensuring availability of critical systems with an **RTO** of less than **2 hours**.\nFostered a culture of continuous integration/continuous deployment (CI/CD) within the team, contributing to a **40%** increase in deployment frequency.\nMentored junior engineers on best practices in DevOps tools and methodologies, leading to the successful onboarding of **5** new team members within the past year."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Bash, Perl\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Jenkins, Bitbucket, Datadog\n\n **Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL), Linux, Windows\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, TCP/IP, ITIL, Jira, Git"
}