{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Dynamics Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Dynamics Engineer with 13+ years of experience specializing in **Microsoft Dynamics 365**, **Power Automate**, and CRM solutions. Proficient in API Integrations, leveraging **Azure DevOps** and **GitHub Actions** for streamlined CI/CD processes. Strong skills in **JavaScript**, **TypeScript**, and **C#**, ensuring the development of high-performance applications tailored to business needs.\n\nExperienced in Agile and DevOps methodologies, fostering collaboration and enhancing productivity within teams. Known for delivering insights through data analytics using **Power BI** and integrating with platforms like RIVA and Campaign Monitor. A strong analytical mindset complemented by a solid track record in creating innovative solutions that drive efficiency and performance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Dynamics Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Power Automate** and **Microsoft Dynamics 365** for seamless **CRM** solutions and API integrations, enhancing operational efficiency across projects.\nLeveraged **JavaScript**, **TypeScript**, and **C#** in developing dynamic web applications, ensuring optimal user experiences and responsiveness.\nImplemented robust CI/CD pipelines with **Azure DevOps** and **GitHub Actions**, achieving **100%** test automation with continuous integration workflows.\nUtilized **Power BI** for advanced data visualization, enabling real-time analysis of CRM metrics and operational KPIs to inform strategic decision-making.\nApplied Agile methodologies to accelerate project timelines, achieving a **25%** increase in delivery speed while maintaining high quality standards.\nConducted analytical assessments and developed solutions to enhance system integrations and performance across various channels, leading to a **15%** improvement in user engagement.\nCreated and maintained comprehensive documentation to support API integrations and facilitate team collaboration, improving onboarding efficiency by **30%**.\nCollaborated across departments to unify data processes using **API integrations** for real-time data accessibility and streamline workflows.\nDelivered innovative solutions in CRM automation, significantly enhancing customer interaction and satisfaction rates.\nEmployed a data-driven approach to strategy development, utilizing Jay's analytical skills to enhance decision-making processes across the organization."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Microsoft Dynamics 365** to enhance CRM functionalities and ensure seamless API integrations with existing systems for a holistic data ecosystem.\nEmployed **Power Automate** to automate workflows, significantly reducing manual processes and increasing operational efficiency by **30%**.\nImplemented agile methodologies and **DevOps** practices, improving deployment frequency by **40%** and delivery lead time by **25%**.\nDeveloped and maintained custom solutions leveraging **C#**, **JavaScript**, and **TypeScript**, ensuring compatibility and performance standards in line with industry best practices.\nCollaborated with cross-functional teams to design and execute analytical dashboards using **Power BI**, enabling data-driven decision making with near real-time access to insights.\nManaged version control and CI/CD pipelines using **Azure DevOps** and **GitHub Actions**, ensuring stability and reliability in production environments.\nConducted data analysis for marketing campaigns utilizing **Campaign Monitor**, resulting in an increase in targeted engagement metrics by **15%**.\nChampioned best practices in agile project management, resulting in improved team collaboration and project transparency for multiple concurrent initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and integrated customized solutions in **Microsoft Dynamics 365** to enhance CRM functionalities, ensuring a streamlined user experience for over **500+** users.\n• Built automated workflows and processes using **Power Automate**, reducing manual tasks by **40%** and improving responsiveness on client requirements.\n• Designed RESTful APIs for seamless **API Integrations** with third-party tools including **Campaign Monitor**, improving campaign efficiencies by **30%**.\n• Managed deployment pipelines using **Azure DevOps** and **GitHub Actions**, ensuring continuous integration and delivery for critical updates.\n• Employed **JavaScript** and **TypeScript** for developing user-friendly interfaces, boosting user engagement metrics by **20%**.\n• Analyzed and reported on data insights using **Power BI**, aiding in data-driven decision-making for strategic initiatives.\n• Collaborated in an **Agile** development environment, adapting to changes swiftly while maintaining high-quality outputs.\n• Utilized **RIVA** to improve business processes and client interactions, fostering a **25%** increase in customer satisfaction.\n• Developed and maintained documentation and user training materials, ensuring successful platform adoption and operational continuity.\n• Conducted thorough testing and validation of solutions, achieving a **99%** defect-free rate in user-facing features."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, C#, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI Integrations\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tMicrosoft Dynamics 365, Power Automate, CRM, RIVA, Campaign Monitor, Power BI, Agile, MLflow, Airflow, Kubeflow, Authentication & Security (Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot), Analytical",
  "apply_company": "Data Edge"
}