{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled in **Python**, **Django**, **Google Cloud Platform**, **DevOps**, **CI/CD**, **Git**, and **GitHub**, with 9+ years of experience as a .NET Full Stack Developer transitioning into a Senior Backend Engineer role. Expert in designing and implementing robust applications and microservices architecture, leveraging technologies such as **Docker**, **Kubernetes**, and **Terraform**. Proficient in database management with **PostgreSQL**, RESTful API development, and Agile methodologies including **Kanban**. Strong communicator and collaborator, consistently leading projects to successful completion while optimizing performance and streamlining processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **Django** to develop scalable backend systems, enhancing application performance by **30%**.\nImplemented **CI/CD** practices using **Docker** and **Kubernetes**, achieving deployment efficiency gains of **40%**.\nDeployed applications in the **Google Cloud Platform**, resulting in improved service reliability and uptime of **99.9%**.\nDeveloped RESTful APIs that integrated with **PostgreSQL** databases, ensuring seamless data accessibility and interactions.\nPracticed Agile methodologies, particularly **Kanban**, to optimize workflows and increase team productivity by **25%**.\nCollaborated with cross-functional teams to design and implement features that align with user requirements and business objectives.\nLeveraged **Git** and **GitHub** for version control and collaborative code reviews, ensuring high code quality and maintainability.\nProactively participated in DevOps practices to enhance deployment processes and improve overall system orchestration.\nImplemented caching strategies using **Redis**, leading to a reduction in database load and speeding up data retrieval by **35%**.\nContributed to the agile transformation by facilitating sprint planning and retrospectives, driving project success and team coherence.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and maintained backend services using **Python** and **Django** to enhance system performance and reliability, achieving a 20% reduction in server response times.\nImplemented **Google Cloud Platform** services for deployment, resulting in a scalable infrastructure that supports 10,000+ concurrent users.\nDesigned and maintained CI/CD pipelines leveraging **GitHub**, reducing integration times by 40% and enhancing deployment frequency by 50%.\nUtilized **PostgreSQL** for database management, optimizing complex queries to decrease data retrieval times by 30%.\nIntegrated containerization using **Docker** and orchestration with **Kubernetes**, improving application deployment speed and resource management.\nCollaborated in an Agile team environment employing **Kanban** methodologies to streamline project workflows and ensure timely feature delivery.\nAutomated infrastructure provisioning using **Terraform**, enabling consistent and repeatable deployments across development stages.\nCreated and maintained RESTful APIs, ensuring high performance and responsive interactions for end-users.\nConducted code reviews and provided mentorship to junior developers, fostering professional growth and improving code quality across the team.\nParticipated in cross-functional collaborations to gather requirements and feedback, aligning development efforts closely with business objectives."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **Django** to design and develop robust backend services, ensuring high performance and responsiveness, achieving a **30%** reduction in response time.\nImplemented **REST**ful APIs that supported **10,000+** concurrent users, optimizing backend data handling and absorbing traffic spikes effectively.\nDeployed applications on **Google Cloud Platform**, leveraging **Docker** and **Kubernetes** for container orchestration, which streamlined deployment workflows by **50%**.\nConfigured **CI/CD** pipelines using **Git** and **GitHub**, facilitating automated testing and integration, reducing deployment errors by **40%**.\nCollaborated with the DevOps team to utilize **Terraform** for infrastructure management, enhancing provisioning speed and consistency across development and production environments.\nIntegrated **PostgreSQL** to manage and query large datasets efficiently, improving data access speeds for analytical purposes.\nAdopted **Agile** methodologies, specifically **Kanban**, to manage project workflows, leading to a **25%** increase in productivity of development tasks.\nParticipated in code reviews and technical discussions to promote best practices and continuous improvement across the engineering team.\nDelivered comprehensive technical documentation and user guides for team utilization, enhancing onboarding processes and project knowledge dissemination."
    }
  ],
  "skills": "•\t**Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n•\t**Backend Frameworks**\n\tDjango, NodeJS, ExpressJS, NestJS, .NET, Microservices\n\n•\t**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n•\t**API Technologies**\n\tRESTful API, GraphQL, Wagtail\n\n•\t**Serverless and Cloud Functions**\n\t\n\n•\t**Databases**\n\tPostgreSQL, MSSQL Server, MySQL, MongoDB, DynamoDB, CosmosDB\n\n•\t**DevOps**\n\tDocker, Kubernetes, Terraform, AWS, Azure, CI/CD, DevOps\n\n•\t**Cloud & Infrastructure**\n\tGoogle Cloud Platform\n\n•\t**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Agile, Kanban",
  "apply_company": "Mozilla"
}