{
  "name": "Andrzej Ito",
  "role_name": "Senior DS Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Data Science Engineer, I bring over 9 years of experience in developing and deploying **Machine Learning** models, specializing in **Generative AI**, **NLP**, and **Deep Learning** techniques with frameworks such as **GPT-4** and **BERT**. I am adept at creating scalable **ML Pipelines** and conducting thorough **Data Analysis** to drive insights and innovation. My proficiency in **Python** and knowledge of **Cloud** platforms strengthen my capability to deliver impactful solutions. I have a proven track record of leading cross-functional teams, mentoring junior engineers, and effectively communicating complex concepts, all while prioritizing user experience and performance in every project I undertake.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior DS Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Leverage **Python** for developing and implementing **Machine Learning** models utilizing **GPT-4**, **BERT**, and other **AI** frameworks to enhance data-driven decision making.\n• Design and develop **Generative AI** systems with a focus on **NLP** to improve user experiences and engagement.\n• Conduct **Data Analysis** and build **ML Pipelines** that process large-scale data, ensuring accuracy and efficiency in insights generation for over **1M** data points.\n• Utilize **Deep Learning** techniques and implement **Diffusion Models** to innovate and optimize data solutions.\n• Enhance communication strategies for cross-functional teams, facilitating a collaborative approach to problem-solving.\n• Participate in cloud deployment strategies, ensuring seamless integration and scalability of machine learning services.\n• Demonstrate excellent problem-solving skills by identifying and addressing data quality issues, resulting in a **30%** reduction in errors.\n• Develop comprehensive documentation for data processes and **AI** model utilization, improving team knowledge sharing by **50%**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "Leveraged **Python** for developing and implementing machine learning models, enhancing the efficiency of data analysis processes by **30%**.\nUtilized **AI** techniques, including **Generative AI**, **NLP**, and **Deep Learning**, to solve complex problems and improve model accuracy by **15%**.\nEngineered large language models (LLMs) using frameworks such as **GPT-4** and **BERT** to boost application capabilities resulting in better user interactions.\nDesigned and managed ML pipelines for seamless integration and deployment of models into production, achieving a turnaround time reduction of **20%**.\nImplemented **Cloud** services for scalable data processing and storage solutions, ensuring efficient management of data workloads.\nApplied **Diffusion Models** to enhance generative capabilities in various applications, demonstrating strong analytical and problem-solving skills.\nCollaborated with cross-functional teams to automate data analysis tasks, improving project delivery timelines with effective **communication** strategies.\nConducted in-depth data analysis and interpretation to derive actionable insights, influencing business decisions positively."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed machine learning models and algorithms utilizing **Python**, **DeepLearning**, and **MachineLearning** frameworks to solve complex business problems.\n• Implemented Natural Language Processing (NLP) techniques using **GPT-4** and **BERT** for data analysis and interpretation of user inputs.\n• Created and maintained efficient data pipelines leveraging **MLPipelines** for seamless data flow and processing, ensuring quality and accuracy of results.\n• Conducted rigorous data analysis to extract insights, employing various statistical techniques and tools within **AI** methodologies.\n• Spearheaded the deployment of AI solutions on **Cloud** platforms such as **AWS**, **Azure**, and **GCP**, contributing to increased scalability, with projects successfully executed in **2022** and **2023**.\n• Collaborated effectively with cross-functional teams to communicate findings and strategies, enhancing team problem-solving capabilities, documented in **15+** detailed reports.\n• Utilized advanced frameworks for Generative AI and Diffusion Models, enabling innovative solutions and increasing project efficiency by **30%**."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, C++, C#, Python, Kotlin\n\n **Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA\n\n **Frontend Frameworks**\n\tReact, Vue, Angular\n\n **API Technologies**\n\tSOAP, REST APIs\n\n **Serverless and Cloud Functions**\n\tCloud\n\n **Databases**\n\tMS SQL Server, Oracle, MongoDB, PostgreSQL, Redis\n\n **DevOps**\n\tRabbit MQ, Microservices\n\n **Cloud & Infrastructure**\n\tGenerativeAI, NLP, GPT-4, BERT, LLM, DeepLearning, MachineLearning, DiffusionModels, MLPipelines, DataAnalysis\n\n **Other**\n\tProblemSolving, Communication, SOLID, DRY, LINQ",
  "apply_company": "SoftServe"
}