{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Cloud Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "Dynamic Senior Cloud Engineer with 8 years of full-stack development experience, specializing in **Azure**, **Infrastructure as Code (IaC)**, **Terraform**, **Bicep**, and **ARM Templates**. Expertise in leveraging **Defender for Cloud** and **Sentinel** for enhancing **Zero-Trust Security** frameworks. Proficient in designing robust **Cloud Architecture** and executing cloud strategies that prioritize security, compliance, and governance. Strong background in **Microsoft 365**, ensuring enterprise-grade compliance with standards like HIPAA, FHIR, PCI DSS, and SOC 2.\nDemonstrated ability to integrate AI/ML capabilities into cloud solutions, develop scalable microservices, and employ CI/CD best practices to streamline deployment processes. Proven track record in healthcare and financial sectors, delivering high-performance, mission-critical applications that leverage modern frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Architected and implemented **Cloud Architecture** strategies, ensuring **Compliance** with industry regulations through the use of **Azure**, **Defender for Cloud**, and **Sentinel** for robust security measures.\n• Developed Infrastructure as Code (IaC) solutions using **Terraform**, **Bicep**, and **ARM Templates** to automate cloud resource provisioning and enhancing governance practices.\n• Established **Zero-Trust Security** frameworks to safeguard sensitive data across infrastructures, improving overall organizational security posture.\n• Collaborated on **Cloud Strategy** initiatives, leveraging **Microsoft 365** tools to enhance user collaboration and productivity within cloud environments.\n• Ensured the integrity and compliance of systems through continuous monitoring and auditing processes aligned with **Security** best practices.\n• Managed cross-cloud architecture encompassing elements of hybrid environments, successfully integrating core services from **Azure** and other cloud platforms to optimize resource utilization.\n• Led cloud governance practices that ensured best-in-class compliance to internal and external audit standards, significantly reducing risks associated with cloud deployments.\n• Provided guidance on the adoption of security protocols and tools within cloud environments, resulting in an uplift in incident detection and response capabilities by **40%**.\n• Implemented and maintained automated CI/CD pipelines for infrastructure changes, improving deployment efficiency by **30%**.\n• Collaborated with cross-functional teams to ensure that all architecture designs are aligned with broader organizational **Cloud Strategy** and **Governance** policies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Implemented **Cloud Architecture** solutions utilizing **Azure** services to ensure secure, scalable, and compliant infrastructures for financial platforms.\nLeveraged **Infrastructure as Code** practices using **Terraform** and **Bicep** to automate deployment processes, enhancing operational efficiency by over **30%**.\nAdopted a **Zero-Trust Security** model to strengthen platform security through **Defender for Cloud** and **Sentinel**, ensuring continuous compliance across all systems, reducing security incidents by **25%**.\nDeveloped governance frameworks for managing **Microsoft 365** environments, ensuring adherence to best practices and compliance standards, resulting in a **40%** improvement in audit readiness.\nLed the modernization of financial applications by integrating technology stacks such as **Node.js** and **Python**, enhancing scalability and maintainability for transaction systems handling volumes exceeding **1M** transactions monthly.\nSpearheaded the development of ETL pipelines using **Azure Data Factory** and **Apache Airflow**, enabling seamless data integration from various sources, with batch processing speeds improved by **50%**.\nEnhanced analytics capabilities through real-time monitoring dashboards using tools like **Power BI Embedded** and libraries like **D3.js**, facilitating data-driven decision-making across operational teams.\nIntegrated robust event-driven architectures by utilizing **Kafka** and **RabbitMQ**, allowing for efficient asynchronous processing of transaction alerts and compliance workflows."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Designed and implemented **Cloud Architecture** and **Cloud Strategy** using **Azure**, ensuring high scalability and availability of critical services across cloud infrastructures.\nDeveloped and managed infrastructure using **Infrastructure as Code** principles, leveraging **Terraform**, **Bicep**, and **ARM Templates** to automate deployments, achieving a **60%** reduction in provisioning times.\nEnsured compliance and governance in cloud environments through rigorous security practices, applying **Zero-Trust Security** principles along with **Defender for Cloud** and **Sentinel** for proactive threat management and auditing.\nOptimized cloud services and processes to support **Microsoft 365**, enhancing collaboration tools and improving efficiency by **30%** across teams.\nEstablished security frameworks, applying role-based access control (RBAC) and **OAuth 2.0**, ensuring GDPR compliance and safeguarding user data integrity throughout cloud applications.\nConducted regular security assessments and compliance checks, leading to a **40%** decrease in vulnerabilities and risks associated with cloud infrastructure.\nCollaborated with cross-functional teams to define governance policies, ensuring adherence to best practices in cloud management and operational security across projects.\nProvided technical leadership in cloud adoption and migration strategies, directly influencing project success metrics and achieving **20%** faster project completion rates."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:** \n\tAWS Lambda, Azure Functions\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:** \n\tAWS, Azure, Terraform, Infrastructure as Code, Bicep, ARM Templates, Cloud Architecture, Cloud Strategy, Defender for Cloud, Sentinel\n\n **Other:** \n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak, Let’s Encrypt, Nginx, Certbot, Security, Compliance, Governance, Microsoft 365, Zero-Trust Security",
  "apply_company": "SelectLine Holding GmbH"
}