{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Software Engineer with 13+ years of experience in developing high-performance applications, focusing on both frontend and backend solutions. Proficient in **React**, **TypeScript**, **Python**, **FastAPI**, and **SQL**, with solid experience implementing microservices and CI/CD workflows. Skilled in using **Agile Management**, **Scrum**, and **Jira** for project coordination and team collaboration.\nDemonstrated expertise in AI-assisted development tools, contributing to the creation of predictive analytics platforms and automation solutions. Strong proficiency in **Git** and **GitHub Enterprise** for version control and team workflows. Committed to effective communication and remote collaboration, ensuring project success in distributed team environments. Experienced in building compliant systems aligned with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React (17–18)**, **TypeScript**, and **Python (FastAPI)** to design and build full-stack platforms in healthcare and fintech, ensuring compliance with industry standards such as HIPAA and GDPR.\nImplemented CI/CD pipelines using **GitHub Enterprise** and **CI/CD** strategies tailored specifically for mobile applications, enhancing deployment frequency by **30%**.\nEmployed testing frameworks like **Jest** and **PyTest** to define and enforce robust testing strategies across the software stack, achieving a reduction in bug-related incidents by **40%**.\nDeveloped state management solutions with **Redux**, enabling efficient data flow in complex applications and enhancing user experience across platforms.\nFacilitated an Agile Management environment, incorporating **Scrum** and tools like **Jira** and **Confluence** to streamline workflows and improve team communication.\nIntegrated AI-assisted development tools to enhance productivity, adopting best practices for remote work collaboration and efficient project management.\nCollaborated with cross-functional teams to build and enhance applications with a focus on responsiveness and performance, achieving performance improvements of up to **20%** in interactive elements.\nCultivated strong communication skills to effectively liaise between technical and non-technical stakeholders, facilitating project understanding and execution.\nEngaged in continuous learning of emerging technologies and methodologies related to **SQL** and testing libraries such as **React Testing Library** to ensure the team stays at the forefront of industry trends."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React** (18), **TypeScript**, and **Redux** to build interactive front-end applications, ensuring responsiveness and functionality for financial tools and admin panels.\nDeveloped backend services using **Python** (FastAPI, Django) to create robust APIs, supporting high-volume transactions in a modern, microservices architecture.\nImplemented **CI/CD** pipelines and automated testing with **Jest** and **React Testing Library**, enhancing code reliability and deployment efficiency by achieving **90%** automated test coverage.\nEmployed **Agile Management** methodologies, including **Scrum**, to effectively manage project workflow using tools such as **Jira** and **Confluence**, leading to a **25%** increase in team productivity.\nCreated and maintained databases with **SQL** for data storage and retrieval, ensuring data integrity and availability for financial applications.\nConducted code reviews with a focus on best practices in **Git** and **GitHub Enterprise**, promoting a collaborative coding environment.\nApplied **AI-assisted development tools** to enhance coding speed and accuracy, contributing to lower bug rates and more innovative solutions.\nFacilitated clear communication within remote teams, fostering collaboration and alignment on project goals and timelines.\nLeveraged **Python** for developing ETL pipelines using **Apache Airflow** and **Azure Data Factory**, automating data ingestion processes for a faster turnaround in reporting and insights.\nEngaged in continuous professional development to stay abreast of the latest trends in **React**, **Python**, and software engineering practices."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **React (18)** and **TypeScript** to develop and enhance user interfaces, ensuring fast, responsive web experiences, aligned with user-centric design principles.\nEmployed **Python** frameworks (**FastAPI**, **Django**) for backend service design, optimizing system architecture for high availability and scalability across e-commerce modules, improving transaction processing speed by **30%**.\nImplemented **SQL** databases such as **PostgreSQL** for efficient data management, enhancing query performance and reducing response time by **25%** compared to previous implementations.\nExecuted Agile development methodologies through **Scrum**, utilizing tools like **Jira** and **Confluence** to streamline project management and enhance team collaboration, resulting in on-time project deliveries in **90%** of cases.\nDeveloped automated testing pipelines using **Jest** and **React Testing Library** to ensure code reliability and reduce bug rates by **40%** prior to deployment.\nFacilitated CI/CD integration with **GitHub Enterprise** and **Git**, improving deployment frequency by **50%** and enhancing development team efficiency through seamless version control.\nFostered effective communication across remote teams, ensuring alignment and promoting agile responses to dynamic project requirements.\nIntegrate AI-assisted development tools to enhance productivity and code quality, leveraging advanced algorithms for intelligent code suggestions and debugging support.\nAdopted **Redux** for state management in complex application workflows, improving data flow and application state management efficiency across the front end.\nCultivated best practices in remote work, ensuring consistent communication, project visibility, and team engagement, driving overall project success."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Django\n\n **Frontend Frameworks:**\n\tReact, Angular, Vue, Redux, Jest, React Testing Library\n\n **API Technologies:**\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS\n\n **Databases:**\n\tSQL, PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tAI-assisted development tools, Agile Management, Scrum, Jira, Confluence, GitHub Enterprise, Git, communication skills, remote work"
}