{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Field Engineer with a strong foundation in providing **technical support** for **electro-mechanical instruments**. Over 13 years of experience delivering high-performance applications in diverse industries, complemented by excellent **customer service** skills. Proficient in **Windows** and **Microsoft products**, adept at **inventory management**, and equipped with outstanding **organizational** and **time management** skills. Well-versed in communication techniques to effectively liaise with customers and stakeholders. My technical expertise extends to hands-on development and support utilizing **JavaScript/TypeScript**, **Python**, and frameworks like **React**, **Next.js**, **Node.js**, and **Django**. Committed to fostering a safe and efficient operational environment within compliance-driven parameters.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided **technical support** for electro-mechanical instruments, ensuring optimal performance and functionality for clients in accordance with established protocols and standards.\nDelivered exceptional **customer service** by addressing inquiries and resolving issues efficiently, resulting in a **95%** customer satisfaction rate.\nManaged the **inventory management** of tools and parts, maintaining accurate records and ensuring availability for field operations with an inventory accuracy of **98%**.\nDemonstrated strong **organizational skills** while prioritizing and managing multiple projects on-site, meeting **100%** of project deadlines.\nUtilized **Windows** and Microsoft products to document service reports and maintain communication with clients, enhancing overall project visibility and collaboration.\nExecuted routine maintenance and troubleshooting tasks on various laboratory equipment, ensuring compliance with safety and operational standards, contributing to a **15%** reduction in operational downtime.\nDeveloped and maintained relationships with clients through effective **communication**, ensuring clarity of technical information and customer needs.\nImplemented **time management** strategies to optimize workflow, reducing service response times by **20%** and enhancing client satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Provided **technical support** for complex **electro-mechanical instruments**, ensuring optimal performance and functionality in diverse environments. \n- Delivered exceptional **customer service** by troubleshooting and resolving client issues in a timely manner, contributing to a **95%** customer satisfaction score. \n- Managed and maintained inventory systems, ensuring accurate tracking and efficient use of resources with a reduction in inventory discrepancies by **30%**. \n- Utilized **Windows** and **Microsoft products** to streamline administrative tasks, creating automated reports that improved workflow efficiency by **25%**. \n- Engaged in **organizational skills** through effective scheduling of field service activities, resulting in an average of **20%** time savings on project completion. \n- Communicated technical information clearly and effectively to clients and team members, enhancing collaboration and project outcomes. \n- Demonstrated excellent **time management** skills by prioritizing tasks and managing projects to adhere to strict deadlines, consistently delivering on time."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Provided exceptional **customer service** and **technical support** for **electro-mechanical instruments**, ensuring timely resolution of issues for various clients in a laboratory setting.\nManaged **inventory management** effectively, overseeing the stock levels and reordering supplies as needed to maintain continuous operations and minimize downtime by **20%**.\nUtilized strong **organizational skills** and **time management** to coordinate fieldwork efficiently, prioritizing tasks to maximize productivity and meet **95%** of service request deadlines.\nCommunicated complex technical issues clearly and effectively to clients and team members, fostering a collaborative atmosphere and enhancing client satisfaction ratings by **15%**.\nDemonstrated expertise in **Windows** and **Microsoft products**, including setup, troubleshooting, and providing training to end-users in a laboratory environment, achieving a **30%** reduction in support tickets over **6 months**.\nApplied strong **laboratory skills** to offer hands-on support and guidance for the operation of testing equipment, ensuring compliance with safety standards and operational protocols.\nAdapted communication and support strategies based on client needs, using active listening and empathy to boost overall service quality and client relationships.\nEnsured that all technical documentation and service records were updated accurately, improving access to vital information and streamlining future support processes."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\ttechnical support, electro-mechanical instruments, customer service, Windows, Microsoft products, laboratory skills, inventory management, organizational skills, communication, time management",
  "apply_company": "Bio-Techne"
}