{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Full-Stack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Full Stack Engineer with 13+ years of experience in building high-performance applications, specializing in **TypeScript**, **React**, and **Node.js**. Proficient in database management with **Postgres** and **Redis**, and skilled in UI Design, Product Management, and Agile Methodologies. A strong communicator adept at collaboration in cross-functional teams.\n\nDemonstrated expertise in both frontend and backend development utilizing frameworks like **Next.js**, **Vue**, and **FastAPI**, along with familiarity in delivering AI/ML-powered solutions for predictive analytics. Experienced in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices and CI/CD pipelines. Knowledgeable in compliance standards including HIPAA, FHIR, PCI DSS, and SOC 2. Competent in MLOps, encompassing model training and orchestration with tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Full-Stack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained full-stack applications using **TypeScript**, **React** (17–18), and **Node.js**, ensuring high user satisfaction through intuitive UI design and effective collaboration within Agile methodologies.\n• Implemented robust data management solutions utilizing **Postgres**, **Redis**, and **GraphQL** to optimize data retrieval and enhance application performance, handling up to **10,000** concurrent users.\n• Collaborated with product management and cross-functional teams to gather requirements and translate user needs into technical specifications, improving communication and fostering a high-impact development environment.\n• Led UI design initiatives, focusing on creating responsive and user-friendly interfaces that adhered to best practices in accessibility and usability.\n• Executed end-to-end testing strategies with tools such as Jest and Cypress, achieving a **95%** test coverage across all critical components and maintaining code quality.\n• Employed Agile methodologies to streamline development processes, reducing time-to-market by **30%** while ensuring compliance with established timelines and deliverables.\n• Conducted regular code reviews and knowledge sharing sessions to enhance team collaboration and promote a culture of continuous improvement, resulting in a **40%** increase in team productivity.\n• Delivered real-time data solutions through efficient querying capabilities and integrated search features, utilizing **Redis** and **GraphQL**, significantly improving data access times by **50%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** to build dynamic and responsive user interfaces with **React** (18) and **Next.js**, ensuring seamless user experiences across financial tools and admin panels.\nImplemented **Node.js** microservices with **Express** to modernize core financial platforms, enhancing scalability and performance for handling **high-volume** transactional systems.\nCollaborated effectively in an **Agile** environment to develop and optimize solutions, employing best practices in **UI Design** and fostering clear **Communication** with stakeholders.\nDeveloped APIs using **GraphQL** to improve data retrieval efficiencies, enabling real-time interactions within front-end applications.\nIntegrated database solutions with **Postgres** and caching mechanisms using **Redis** to enhance data accessibility and application performance.\nEngaged in **Product Management** to gather requirements and ensure alignment of technology deliverables with business goals, focusing on iterative development and feedback.\nMaintained documentation and conducted regular code reviews to uplift team **Collaboration** and enhance overall code quality.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed modern web applications utilizing **TypeScript** and **React** (18) to create dynamic user interfaces, focusing on UI Design and ensuring seamless interaction across web and mobile platforms.\n• Collaborated with product management and cross-functional teams in an Agile environment to gather requirements and translate them into functional specifications.\n• Enhanced backend functionalities using **Node.js** (NestJS) and **Postgres**, improving data handling and application performance for critical operations such as inventory management and order processing.\n• Implemented caching strategies with **Redis** to optimize read performance and system responsiveness, carrying out performance evaluations that yielded up to **40%** faster data retrieval.\n• Leveraged **GraphQL** for efficient API interactions, reducing response times and bandwidth usage during data fetching operations, thereby improving overall application efficiency.\n• Fostered team collaboration through strong communication skills, facilitating effective problem-solving discussions and brainstorming sessions to drive project outcomes and accelerate development cycles.\n• Ensured adherence to coding standards and best practices through rigorous code reviews, mentoring junior developers in using **TypeScript** and **Node.js** effectively.\n• Used Agile methodologies to prioritize project tasks and manage timelines, resulting in an average of **20%** improvement in delivery times for new features and bug fixes.\n• Created intuitive UI components and layouts that enhance user engagement, contributing to a **15%** increase in user retention rates across diverse platforms.\n• Continuously monitored application performance and user feedback to identify areas for improvement, demonstrating a commitment to iterative development and end-user satisfaction."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tGraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMachine Learning: MLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tUI Design, Product Management, Agile Methodologies, Collaboration, Communication"
}