{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior FullStack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Full Stack Engineer with 8 years of experience, I excel in utilizing **PHP**, **Symfony**, **Laravel**, **Node.js**, **TypeScript**, **JavaScript**, and **React** to deliver high-performance applications. My strong command over building REST and GraphQL APIs, alongside a solid foundation in microservices architecture, ensures the development of scalable and maintainable solutions. I have extensive experience in CI/CD processes and have successfully implemented **Docker** and **Kubernetes** for container orchestration and deployment, enhancing operational efficiencies.\nI am adept at working in agile environments, delivering results through effective communication and collaboration within cross-functional teams. My background includes developing, testing, and deploying robust applications that comply with industry standards, alongside automated testing practices to ensure software quality. I also leverage my knowledge of event-driven architecture to streamline processes and improve application responsiveness, supporting overall project success.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed scalable, full-stack applications using **Node.js**, **TypeScript**, and front-end frameworks such as **React** (17-18), ensuring high performance and maintainability.\n- Implemented **REST** and **GraphQL** APIs to facilitate efficient data exchange and communication between client and server components.\n- Led the transition of monolithic architectures to **microservices**-based solutions using **Docker** and **Kubernetes** for enhanced scalability and fault tolerance across multiple environments.\n- Established CI/CD pipelines utilizing **automated testing** frameworks which contributed to a **30%** reduction in deployment times and improved code quality through **GitHub Actions** and **CircleCI**.\n- Collaborated with cross-functional teams in an **agile** environment to deliver product features on time, ensuring seamless communication and project alignment.\n- Designed and executed complex data strategies leveraging **PostgreSQL** and **MongoDB** to optimize data storage and retrieval for performance metrics.\n- Developed high-quality unit, integration, and end-to-end tests using **automated testing** tools such as **Jest** and **Cypress**, achieving over **90%** code coverage.\n- Integrated modern DevOps practices to streamline the development cycle, employing **Docker** containers and cloud-based solutions to effectively manage application dependencies and workload.\n- Enhanced user experience by developing responsive front-end applications that incorporate the latest web technologies and UI/UX design principles.\n- Collaborated with development teams to refine engineering processes, resulting in an improved team velocity of **25%** within **6 months**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed scalable and maintainable **microservices** architecture using **Node.js** (NestJS/Express) and **PHP** (**Symfony**/**Laravel**), enhancing throughput for high-volume transaction systems.\nEngineered dynamic, user-focused front-end applications utilizing **React** (18), **TypeScript**, and **JavaScript**, applying **GraphQL** and **REST** for efficient data fetching, while ensuring responsive and performant interfaces for financial dashboards and admin portals.\nImplemented CI/CD best practices and **Docker** containerization to streamline deployment processes, achieving a reduction in deployment time by **30%**.\nLeveraged **Kubernetes** for orchestration of services, ensuring high availability and efficient resource utilization across all deployments.\nFacilitated effective communication and teamwork in an **agile** environment, promoting iterative development cycles for continuous improvement and faster delivery of features.\nEnhanced user interfaces by employing modern libraries such as **Redux Toolkit** and **Tailwind CSS**, leading to a **25%** increase in user satisfaction metrics through improved user experience design.\nEstablished automated testing strategies for **Node.js** applications, improving code quality and reducing bugs by **40%** before release.\nUtilized real-time data processing tools like **Kafka** and **RabbitMQ** to create robust event-driven systems, aiding in transaction monitoring and triggering alerts for timely reactions to anomalies.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Node.js** alongside **PHP** frameworks such as **Symfony** and **Laravel** to design and develop innovative backend services for a robust e-commerce platform, improving system performance by **30%**.\nImplemented **REST** and **GraphQL** APIs to enhance data retrieval processes, facilitating smoother client-server interactions and reducing response times by **20%**.\nApplied **TypeScript** and **JavaScript** to write maintainable, scalable, and efficient code for both frontend and backend functionalities, ensuring a seamless integration between the two layers.\nAdopted **Docker** and **Kubernetes** in a **CI/CD** pipeline to streamline deployment processes and enable rapid iterations with minimal downtime, improving the deployment frequency by **50%**.\nDeveloped dynamic frontend applications using **React** (18) for enhanced user experiences, emphasizing speed and responsiveness for web and mobile platforms.\nCollaborated effectively in agile teams, leveraging strong communication skills to coordinate across departments and ensure the timely completion of projects.\nConducted automated testing throughout the development lifecycle, enhancing software quality and reducing bugs reported to production by **40%**.\nDesigned microservices architecture to ensure modular and efficient application components, resulting in better scalability and maintenance.\n"
    }
  ],
  "skills": "Programming Languages:\n\tPHP, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tSymfony, Laravel, Node.js, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tGraphQL, REST\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tautomated testing, agile, communication, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "DocMorris"
}