{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Full Stack Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As a Senior Full Stack Software Engineer with 8 years of experience, I excel in building high-performance applications utilizing essential skills such as **TypeScript**, **ReactJS**, **NodeJS**, **NestJS**, and **RESTful API** development. My proficiency extends to managing databases with **PostgreSQL** and streamlining workflows through **Git** and CI/CD practices. I possess hands-on experience with cloud platforms including **AWS**, **Azure**, and **Google Cloud** as well as front-end libraries like **AG Grid** and **Apache Echarts**.\n\nI have a strong foundation in Agile methodologies, enabling me to efficiently collaborate with cross-functional teams. My work in full-stack development includes leading enterprise-grade solutions tailored for the healthcare and financial sectors, embedding compliance standards such as HIPAA and PCI DSS into my applications. I leverage **Python** and **Flutter** for backend services and mobile solutions, while my expertise in microservices and event-driven architectures leads to robust application performance. I am also well-versed in implementing innovative AI/ML strategies and MLOps workflows that enhance real-time data processing and decision-making capabilities.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented robust RESTful APIs using **Node.js**, **TypeScript**, and **NestJS**, ensuring efficient data handling and integration with various platforms.\nLeveraged **ReactJS** (versions **17-18**) and other modern front-end frameworks to develop responsive and user-friendly interfaces, complying with Agile methodologies for iterative development.\nDeveloped and maintained database infrastructures using **PostgreSQL**, performing optimizations for multi-million record datasets in healthcare and finance sectors, ensuring data integrity and high availability.\nExecuted automated CI/CD pipelines utilizing **Git** technologies, streamlining deployments and enhancing application reliability through rigorous testing protocols and deployment strategies.\nSkillfully collaborated with cross-functional teams, enhancing communication to resolve software development challenges and deliver high-quality products efficiently.\nApplied **AWS** and **Azure** services for seamless application deployments, including serverless architectures and containerized applications with **Docker** and orchestration using **Kubernetes** for improved scalability and performance.\nImplemented advanced data visualization solutions with tools like **AG Grid** and **Apache Echarts** to present crucial business insights, transforming complex data into actionable information.\nUtilized innovative problem-solving techniques to architect solutions for complex projects, improving overall system design, performance, and user satisfaction.\nEstablished test strategies with frameworks such as Jest and Cypress, ensuring code quality through comprehensive unit, integration, and end-to-end testing across web and API services.\nIntegrated agile project management principles, ensuring continuous delivery and alignment with stakeholder expectations throughout the development lifecycle."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Designed and developed scalable applications utilizing **React (18)** and **TypeScript**, delivering high-performance user interfaces for financial dashboards impacting over **10,000** users daily.\n• Implemented RESTful APIs using **Node.js** frameworks (**NestJS/Express**) and Python (**FastAPI, Django**), achieving a remarkable **30%** reduction in API response time, leading to enhanced user experience in financial transactions.\n• Applied **PostgreSQL** for data storage solutions, optimizing database queries and management processes, resulting in a **20%** performance improvement in data retrieval.\n• Collaborated in an Agile team environment, employing **Git** for version control and Continuous Integration/Continuous Deployment (CI/CD) methodologies, which facilitated swift deployment cycles by **25%**.\n• Enhanced front-end performance using **Next.js** and **Redux Toolkit**, contributing to the reduction of load times by **50%** across key applications.\n• Implemented robust event-driven architecture by integrating **Kafka**, **RabbitMQ**, and **Azure Service Bus**, streamlining transaction processing and compliance workflows in real-time.\n• Engineered ETL pipelines with **Apache Airflow** and **Azure Data Factory**, improving data ingestion speeds by **40%**, enabling near real-time data availability for analytical processes.\n• Developed and refined AI/ML-powered fraud detection systems with **scikit-learn** and **XGBoost**, successfully identifying and flagging fraudulent transactions with an accuracy rate of over **95%**.\n• Built and managed Machine Learning pipelines for credit scoring and churn prediction using **MLflow**, ensuring seamless integration of model inference into backend services for timely decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed highly responsive frontend applications using **React (18)** and **TypeScript**, ensuring optimal user experiences for both web and mobile platforms.\n• Engineered robust backend services utilizing **Node.js (NestJS)** and implemented **RESTful APIs** for seamless communication between services, achieving high availability and low latency across critical functionality such as checkout and order fulfillment.\n• Leveraged **PostgreSQL** for scalable, relational database solutions that supported complex data structures and queries in a high-traffic environment, ensuring fault-tolerant data access.\n• Managed source control efficiently through **Git**, facilitating smooth collaboration and version control across diverse teams.\n• Integrated CI/CD pipelines to streamline deployment processes, enhancing development workflows and reducing time-to-market for new features.\n• Utilized cloud services including **AWS**, **Azure**, and **Google Cloud** for building and deploying scalable applications, ensuring infrastructure reliability and responsiveness.\n• Collaborated in an **Agile** development environment to prioritize tasks, optimize project deliverables, and maintain open lines of communication within cross-functional teams.\n• Demonstrated strong problem-solving skills in the troubleshooting of complex issues, maintaining application performance and reliability.\n• Implemented feature flags and blue-green deployments using programmatic strategies like LaunchDarkly and Kubernetes, reducing risks during updates and enabling controlled feature rollouts.\n• Enhanced data visualization with tools such as **Apache Echarts** and implemented state management within large-scale applications using libraries like **AG Grid** to improve user engagement and decision-making.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, NodeJS, NestJS, Koa.js\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, ReactJS, AG Grid, Apache Echarts\n\n **API Technologies:**\n\tRESTful API\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Google Cloud\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tGitHub Actions, GitLab CI/CD, Docker, Kubernetes, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, CI/CD, Agile, Problem-solving, Communication, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}