{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Principal Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Principal Backend Engineer with 13+ years of experience in building high-performance, scalable applications. Proficient in **Go**, **TypeScript**, and **Node.js**, with a solid understanding of **PostgreSQL** and **Redis** for data management. Well-versed in algorithms, data structures, and performance optimization, ensuring clean and maintainable code.\n\nDemonstrated expertise in delivering robust backend solutions and implementing event-driven architectures and microservices. Experienced in adhering to industry standards, with a focus on compliance-driven development. Strong background in high-performance applications across healthcare and financial sectors, leveraging advanced frameworks and tools such as **React**, **Django**, and **FastAPI**. Proven ability to drive innovation through AI/ML technologies and cloud-native deployments on **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Principal Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Go** and **TypeScript** to design and implement scalable backend systems, ensuring adherence to clean code principles and maintainable architecture.\nDeveloped efficient algorithms and data structures to optimize performance, resulting in a **30%** decrease in response times across critical services.\nLed the adoption of **Node.js** for backend services and implemented caching strategies with **Redis**, improving data retrieval speeds by **50%**.\nArchitected database solutions using **PostgreSQL**, ensuring robust data integrity and secure transactions, successfully managing over **1 million** user records.\nConducted performance optimizations, including algorithm refinement and resource management, to increase system efficiency by **25%**.\nEstablished coding standards and best practices to promote maintainability and high-quality code across multiple teams, reducing bug rates by **40%**.\nUtilized advanced graph algorithms to solve complex queries within the data pipeline, enhancing data processing capabilities and analytics performance.\nMentored junior engineers in clean coding practices and advanced algorithms, increasing team productivity and code quality over multiple releases.\nImplemented CI/CD practices, adopting automated testing frameworks to ensure high-quality releases with **0%** downtime during rollouts.\nCollaborated with cross-functional teams to integrate backend services with frontend technologies, driving seamless user experiences across web and mobile platforms."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Go** and **Node.js** (NestJS/Express) to modernize core financial platforms by migrating to microservices architecture, enhancing scalability and performance for high-volume transactional systems.\nImplemented performance optimization techniques to improve system efficiency by **30%**, ensuring clean and maintainable code across multiple services.\nDeveloped robust APIs with **TypeScript** to support intricate data processing requirements, while ensuring that algorithms and data structures utilized are optimized for speed and reliability.\nIntegrated **PostgreSQL** for data management, focusing on maintainable code practices that support future development and scalability.\nLeveraged **Redis** for caching solutions to improve application response times by **40%**, enhancing user experience in financial applications.\nCollaborated with cross-functional teams to implement data structures and graph algorithms in backend calculations, improving operational workflows by **25%**.\nMaintained adherence to clean code principles, ensuring that all team members can contribute to and update code effectively without introducing bugs or performance issues.\nMentored junior engineers on best practices related to algorithms and data structures, fostering a culture of continuous improvement and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed robust backend services using **Go** and **Node.js** (yielding a **15%** increase in performance) to enhance scalability and maintainability, ensuring critical pathways remain optimized across high-load ecommerce modules.\n- Implemented advanced **PostgreSQL** solutions for data management, leveraging **C++** and **Rust** to optimize query performance and reduce latency by **30%**, while ensuring data integrity for complex transactions.\n- Ensured clean and maintainable code practices, applying **Algorithm** and **Data Structures** knowledge to improve system efficiency, resulting in reduced processing time for high-load operations by **20%**.\n- Engineered performance optimization strategies using **Redis** for cache management, decreasing database read pressure significantly and achieving sub-second response times for user queries.\n- Designed algorithms for enhanced inventory management, utilizing efficient **Graph Algorithms** to minimize stock discrepancies and improve real-time order processing accuracy.\n- Advocated for and implemented clean coding standards across the development team, resulting in a **40%** reduction in bugs during sprints and contributing to increased team productivity.\n- Led initiatives for code reviews and performance assessments, mentoring junior engineers in **Maintainable Code** practices, improving overall codebase quality and team collaboration.\n- Collaborated with cross-functional teams to integrate new features, effectively utilizing TypeScript for safer and more readable code while implementing best practices in documentation and version control.\n- Redefined purchase workflows with high-performance solutions, maintaining clear processes through the use of version-controlled DB migrations for **PostgreSQL**, ensuring backward compatibility during upgrades."
    }
  ],
  "skills": " \n**Programming Languages:**\n\tPython, Go, C++, Rust, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow\n\tAlgorithms, Data Structures, Graph Algorithms, Performance Optimization, Clean Code, Maintainable Code"
}