{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a skilled Software Engineer with 8 years of experience, I excel in utilizing **Python**, **AWS**, **Azure**, **Airflow**, and **CI/CD** to develop robust, high-performance applications, particularly within the healthcare and financial sectors. I possess a strong foundation in data integrity and have successfully managed numerous projects involving **SQL**, ensuring seamless data processing and security compliance. My proficiency in **GitHub** allows for effective version control and collaboration across teams.\nI am adept at problem-solving and have demonstrated exceptional communication skills, facilitating clear discourse among stakeholders and team members. With extensive experience in full-stack development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, I am well-versed in building comprehensive solutions. Additionally, I have led the implementation of machine learning pipelines and MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**, contributing to innovation and efficiency in software solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and optimized scalable applications leveraging **Python** and **SQL** for data management, ensuring data integrity and compliance with industry standards.\n- Implemented effective CI/CD practices using **GitHub** Actions and **Azure DevOps**, enhancing deployment efficiency and reducing downtime by **30%**.\n- Leveraged **AWS** and **Azure** cloud services, utilizing their features for deploying applications and managing resources, resulting in a **25%** cost reduction on cloud infrastructure.\n- Conducted data analysis and reporting using **VBA** and **SQL** to facilitate decision-making and improve operational strategies.\n- Enhanced performance and reliability of applications through actionable problem-solving and effective communication within cross-functional teams.\n- Utilized **Apache Airflow** for orchestrating complex workflows, automating data processing tasks, and improving task execution times by **40%**.\n- Participated in the design and development of robust data pipelines with **dbt** and **Spark**, ensuring optimal data flow and transformation for analytics.\n- Fostered a culture of collaboration by engaging with team members to share insights and coding best practices, enhancing overall project outcomes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed high-performance data-driven applications utilizing **Python** and **SQL**, ensuring data integrity and optimized query performance for financial transactions.\n• Designed and implemented automated CI/CD pipelines integrating **GitHub** and **Airflow**, streamlining the deployment process across multiple environments and reducing deployment times by **30%**.\n• Leveraged cloud services such as **AWS** and **Azure** to enhance system scalability and reliability, improving uptime to **99.9%** for critical financial services.\n• Conducted thorough problem-solving sessions to address software inefficiencies, fostering a collaborative environment that improved overall team communication and project outcomes.\n• Built robust ETL processes using **Apache Airflow** and **dbt**, enabling efficient data ingestion and transformation for analytical reporting.\n• Successfully managed version control and collaboration using **GitHub**, facilitating seamless integration of code contributions from multiple developers.\n• Engaged in cross-functional communication to convey technical concepts and project updates, enhancing stakeholder understanding and support.\n• Executed data quality assessments to ensure data integrity across financial datasets, developing strategies to maintain high standards in data management."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Ensured **Data Integrity** and optimized backend services utilizing **Python** frameworks such as FastAPI and Django, and facilitated smooth functioning in a server environment, achieving **99.9%** uptime for critical services.\n• Developed robust SQL database solutions while employing **AWS** and **Azure** cloud services to enhance scalability and reduce operational costs by **30%** for cloud deployment.\n• Applied **AWS** tools for **CI/CD** processes, reducing deployment time by **50%** and ensuring efficient version control through **GitHub**.\n• Utilized **Airflow** for orchestrating complex workflows, enhancing automation and reducing manual intervention by **40%**.\n• Demonstrated strong **problem-solving** abilities in troubleshooting issues across the tech stack, reducing bug resolution time by **25%**.\n• Collaborated effectively with cross-functional teams, showcasing superior **communication** skills to align development objectives with business goals, resulting in the timely delivery of **5+** major releases.\n• Engineered data processing solutions leveraging **Spark** for large-scale data analytics, leading to actionable insights and improved decision-making.\n• Designed and implemented VBA solutions for reporting and automation, improving data accuracy and reporting speed significantly."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, VBA\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n  **API Technologies:**\n\tJWT, OAuth2\n\n  **Serverless and Cloud Functions:**\n\tAWS, Azure, Lambda\n\n  **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n  **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n  **Other:**\n\tMLflow, dbt, Spark, Data Integrity, Problem-solving, Communication, Keycloak, Let’s Encrypt, Nginx, Certbot"
}