{
  "name": "Tomasz Lee",
  "role_name": "Senior Java Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Java Engineer with 9+ years of experience in Java, Java EE, and Object-Oriented Programming. Proficient in **Maven**, **Docker**, and **Linux**, with a strong foundation in microservices architecture and RESTful services. Hands-on expertise in cloud services including **AWS**, **Azure**, and **GCP**. Proven track record in CI/CD practices, SQL databases, and optimizing application performance. Adept in networking techniques, PKI, and Java Keystores, complemented by excellent problem-solving and communication skills. Strong capability in collaborating with cross-functional teams to ensure successful project delivery while continuously improving development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Java** and **Java EE** to develop robust, scalable applications following **Object-Oriented Programming** principles.\nImplemented **Microservices** architecture to enhance application modularity, greatly improving maintainability and scalability.\nEstablished **CI/CD** pipelines utilizing **Maven** and **Docker** to streamline deployment processes, leading to a **40%** reduction in deployment time.\nOrchestrated applications on **AWS**, **Azure**, and **GCP** to leverage cloud services for improved availability and performance.\nDeveloped RESTful APIs enabling seamless integration and communication between services, ensuring efficient data access with minimal latency.\nOptimized SQL database performance, achieving an average query execution time reduction by **20%** through effective query structuring and indexing.\nImplemented **ElasticSearch** and **OpenSearch** solutions for real-time data retrieval and analytics, enhancing data accessibility and reporting capabilities.\nExecuted coding best practices in a **Linux** environment, including shell scripting with **Bash** for automation tasks and system management.\nParticipated in Agile methodologies to collaborate with cross-functional teams, ensuring effective communication and alignment on project goals.\nLeveraged **Python** for scripting and automation tasks to improve overall development efficiency and workflow.\nSuccessfully designed and deployed secure applications utilizing **PKI** and **Java Keystores** for authentication and authorization protocols ensuring robust security measures."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and maintained Java applications implementing **Java EE**, focusing on robust **Object-Oriented Programming** principles to enhance software quality and performance.\n• Leveraged **Maven** for project management and dependency management, ensuring efficient build processes and version control.\n• Containerized applications using **Docker**, improving deployment consistency and enabling seamless collaboration across development environments.\n• Optimized system performance by implementing **Microservices** architecture, leading to a 40% decrease in system downtime.\n• Utilized **REST** principles to design scalable APIs, improving client-server interactions and increasing data retrieval efficiency by **30%**.\n• Implemented CI/CD pipelines using **GitHub Actions**, reducing deployment times by **45%**.\n• Effectively managed **SQL** databases, optimizing queries for better performance which resulted in a **20%** decrease in response times.\n• Integrated **ElasticSearch** for advanced search capabilities, enhancing data retrieval speed and accuracy.\n• Developed automation scripts in **Bash** and **Python** for system administration tasks, reducing manual processing time by **50%**.\n• Collaborated within an **Agile** framework, leading daily stand-ups and retrospectives to drive continuous improvement and team productivity.\n• Facilitated clear communication with cross-functional teams and stakeholders to define system requirements and ensure timely project delivery."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Java** and **Java EE** to design and implement microservices architecture for scalable applications, enhancing system performance by 30%.\nEmployed **Maven** for project management and dependency administration, ensuring consistency across builds.\nUtilized **Docker** containers to streamline development, testing, and deployment processes, achieving a 40% reduction in ecosystem setup time.\nImplemented **REST**ful APIs for robust communication between services, leading to a 25% increase in data retrieval speed.\nManaged database interactions with **SQL**, optimizing queries that improved access times by 15%.\nApplied Agile methodologies to collaborate effectively within team sprints, promoting continuous delivery and feedback.\nLeveraged **AWS**, **Azure**, and **GCP** for cloud-based solutions, enhancing system availability and reliability.\nIntegrating **ElasticSearch** and **OpenSearch** for optimized data retrieval and analytics, capable of handling 100+ queries per second.\nParticipated in CI/CD pipeline setup to automate testing and deployment, leading to a **50% decrease** in release times.\nConducted knowledge-sharing sessions on **Linux**, **Bash scripting**, and **Networking** best practices, fostering a culture of continuous improvement and skill enhancement."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, Java EE, Python, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tREST, GraphQL, RESTful API\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, GCP\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL, ElasticSearch, OpenSearch\n\n**DevOps**\n\tDocker, CI/CD, Agile\n\n**Cloud & Infrastructure**\n\tAWS, Azure, CI/CD pipelines, Linux, Bash\n\n**Other**\n\tUX/UI Design, Git, GitHub, Object-Oriented Programming, Maven, Networking, PKI, Java Keystores, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Problem-solving, Communication, Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "ThreatConnect"
}