{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Network Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Network Engineer with 10+ years of experience specializing in network security and infrastructure management. Expertise in **Cisco**, **F5**, **PaloAlto**, **Infoblox**, **Zscaler**, and **Azure**, alongside strong skills in **Python** for automation and scripting. Demonstrated proficiency in networking protocols including TCP/IP, BGP, OSPF, EIGRP, and VLAN configurations, enhancing secure and efficient communication pathways. Adept in **SDWAN** strategies, implementing **Ansible** for configuration management, and deploying **VPN** solutions to ensure robust connectivity across dispersed networks. Recognized for troubleshooting complex network issues and providing analytical insights to optimize performance and security compliance.\nIn addition to networking expertise, I bring hands-on experience in cloud-native application deployment on **Azure** and a strong understanding of modern tech stacks such as **React**, **Node.js**, and **Django**. Committed to driving innovation and real-world impact through strategic network architecture and proactive problem solving.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented robust network security measures using **Cisco**, **PaloAlto**, **F5**, and **Zscaler**, ensuring high availability and protection against cyber threats across enterprise environments.\n• Utilized **Ansible** for automated configuration management and deployment of network devices, improving operational efficiency by **30%**.\n• Led troubleshooting efforts on network infrastructure issues, utilizing analytical skills to resolve **99%** of problems on the first try, while optimally managing **TCP/IP**, **BGP**, **OSPF**, and **EIGRP** protocols.\n• Developed and maintained **SDWAN** solutions to enhance connectivity and performance, resulting in a **25%** increase in user satisfaction metrics.\n• Configured and managed **VLAN** and **MPLS** settings to optimize network segmentations, enabling effective traffic management and security protocols.\n• Implemented VPN solutions to ensure secure remote access for employees, complying with enterprise-level security standards.\n• Collaborated with cross-functional teams to communicate network requirements and provide analytical insights, simplifying the understanding of complex network interdependencies.\n• Conducted performance monitoring and reporting on network load balancers, enabling proactive management of network traffic."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Azure** to design and implement network solutions, ensuring high availability and performance across **Cisco**, **PaloAlto**, and **Zscaler** environments for secure data transmission.\nManaged, configured, and optimized load balancers, such as **F5**, to support **TCP/IP** traffic, achieving a **99.9%** uptime in network services.\nDeveloped detailed documentation and communication protocols to enhance troubleshooting efficiency, reducing incident response times by **30%**.\nConfigured and maintained VLANs, **MPLS**, and VPN setups, ensuring secure access and data integrity for over **500** internal users.\nSupported routing protocols like **BGP**, **OSPF**, and **EIGRP** to enhance network performance and reliability, leading to a **25%** increase in throughput.\nAutomated network provisioning and configuration management using **Ansible**, streamlining processes and minimizing errors across **50+** network devices.\nConducted thorough network security assessments and implemented best practices, significantly reducing vulnerabilities and improving compliance across all systems.\nAnalyzed network traffic patterns to improve data flow and reduce bottlenecks, leveraging **CiscoACI** to enhance application visibility and performance.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Designed and optimized network security protocols and configurations using **Cisco** hardware, ensuring high availability and low latency across key infrastructures.\nEngineered troubleshooting processes for effective network monitoring and maintenance, utilizing **F5** load balancers and **PaloAlto** firewalls to enhance security across the e-commerce platform.\nImplemented **Ansible** for network automation and orchestration, reducing manual configuration errors by **30%** and improving deployment speed.\nLeveraged **Azure** for cloud networking solutions, optimizing resource allocation, and ensuring reliable connectivity for over **100** concurrent users.\nConfigured **SDWAN** for enhanced network performance, providing a seamless user experience with improved packet management through **BGP** and **OSPF** protocols.\nApplied **VPN** solutions to secure remote access, ensuring compliance with industry standards while handling sensitive data exchanges and achieving **99.9%** uptime.\nMonitored and optimized routing protocols (**EIGRP**, **TCP/IP**) to ensure efficient data flow, significantly reducing latency by **20%** across main traffic corridors.\nCollaborated effectively with cross-functional teams, demonstrating strong communication skills to facilitate network upgrades and integrations that align with organizational goals.\nExecuted network management strategies using **Infoblox** for IP address and DNS management to maintain system integrity and availability.\nDeveloped analytical frameworks to evaluate network performance metrics, leading to informed decisions about infrastructure improvements and capacity planning."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n **API Technologies:**\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Ansible\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Helm, Docker Compose\n\n **Networking:**\n\tCisco, F5, PaloAlto, Infoblox, Zscaler, ISE, SDWAN, TCP/IP, BGP, OSPF, EIGRP, VLAN, MPLS, VPN, CiscoACI, loadbalancers, networksecurity\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, troubleshooting, communication, analytical",
  "apply_company": "CSC"
}