{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience in delivering high-performance applications, specializing in **React**, **JavaScript**, **TypeScript**, and **Next.js**. Proven ability to create robust and scalable frontend solutions while ensuring integration with backend services through **HTTP**, **JSON**, and **gRPC**. Experienced in implementing comprehensive testing strategies, including unit tests, integration tests, and E2E tests.\n\nExpert in leveraging **Amazon Web Services** for deploying cloud-native applications and capable of designing event-driven architectures that enhance application responsiveness and performance. Well-versed in industry compliance standards, ensuring developed applications align with necessary regulations. Additionally, possess strong foundational skills in **MySQL** for database management and am adaptable to new technologies like **Ruby** and **Java** as needed.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained frontend applications using **React** and **Next.js** to enhance user experience and performance, adhering to modern coding standards.\n• Implemented comprehensive **unit tests**, **integration tests**, and **E2E tests** with frameworks like Jest and Cypress to ensure high code quality and reliability.\n• Collaborated with backend teams to define APIs using **HTTP**, **JSON**, **gRPC**, and **Protocol Buffers**, facilitating seamless data communication and integration.\n• Optimized JavaScript and **TypeScript** code for improved application performance, achieving load times under **3 seconds**.\n• Leveraged cloud services such as **Amazon Web Services** (AWS) for deploying scalable frontend solutions, driven by an event-driven architecture.\n• Participated in code reviews and mentorship, sharing knowledge of best practices in **JavaScript** and **TypeScript** development with junior engineers.\n• Engaged in Agile methodologies, contributing to sprint planning, daily stand-ups, and retrospective meetings to drive team productivity.\n• Enhanced accessibility features in frontend applications, ensuring compliance with WCAG standards to improve inclusivity for users.\n• Integrated with **MySQL** databases to manage application data, optimizing queries to reduce response times by **30%**.\n• Developed reusable components and libraries with a focus on maintainability and scalability, resulting in a **20%** reduction in development time for new features."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Develop high-quality front-end applications to enhance user experience using **React** (18), **Next.js**, and **TypeScript**, ensuring cohesive and responsive design across financial platforms.\nImplement comprehensive testing strategies including **unit tests**, **integration tests**, and **E2E tests** to maintain code quality and ensure functionality in all deployed applications.\nOptimize application performance by employing best practices in **JavaScript** and **JSON** management to handle high-volume transactions efficiently.\nCollaborate with cross-functional teams to integrate back-end services with front-end components, utilizing APIs based on **HTTP** and **gRPC** for seamless data communication.\nParticipate in architectural decisions regarding the implementation of **event-driven architectures** to enhance scalability and resiliency in the system.\nUtilize cloud technologies including **Amazon Web Services** for deployment and scalability, ensuring high availability and performance.\nAdhere to agile methodologies, contributing to sprint planning and delivering on deadlines, demonstrating strong project management skills.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed responsive web applications using **React** (18), ensuring high performance by implementing **unit tests**, **integration tests**, and **E2E tests** to deliver top-quality user experiences.\nCollaborated closely with backend teams to ensure seamless integration of **HTTP**, **JSON**, and **gRPC** APIs for efficient data handling and real-time updates.\nUtilized **TypeScript** to enhance code quality and maintainability in frontend development, ensuring type safety across the entire project.\nEngineered applications adhering to best practices in **event-driven architecture** for optimized responsiveness, employing technologies such as **AWS** for scalable and reliable deployment.\nImplemented **Next.js** for server-side rendering and static site generation, improving page load times and enhancing SEO performance with mobile-first design principles.\nApplied state management strategies using **Redux** to maintain application state efficiently across various components, contributing to a smoother user experience.\nConducted thorough performance assessments, achieving an application response time improvement of **30%** through optimized code and effective caching strategies.\nEstablished a robust CI/CD pipeline incorporating automated tests to ensure consistent code quality and facilitate rapid deployment cycles.\nEngaged in collaborative code reviews and pair programming sessions, enhancing team knowledge sharing and fostering a culture of continuous improvement."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, Ruby, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Next.js\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tHTTP, JSON, gRPC, Protocol Buffers\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Unit tests, Integration tests, E2E tests, Event driven architecture, Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n",
  "apply_company": "Square"
}