{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Industrial Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly experienced Senior Industrial Engineer, I possess advanced skills in **Python**, **Statistical Software** (SPSS, Stata), and **Research** methodologies with over 8 years in full stack development. I have demonstrated proficiency in **Programming** and **Citation Standards** to produce high-quality technical documentation and reports. My hands-on experience has allowed me to develop robust analytical models and frameworks tailored for various organizational needs.\nIn addition, I have a solid grasp of **Academic Writing** and can effectively communicate complex concepts through clear and structured documentation. My strengths in **Teaching** and **Self-Management** have enabled me to mentor teams and lead projects successfully while adapting efficiently to changing environments. I am committed to delivering tangible results in industrial engineering processes through innovative solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Industrial Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented rigorous **Academic Writing** methodologies to document project frameworks and findings, ensuring adherence to citation standards for research dissemination.\nConducted in-depth **Research** using **Python** and statistical software such as **R**, **SPSS**, and **Stata**, enhancing data analysis and interpretation for various engineering projects.\nDesigned and executed data models and statistical analysis for optimizing operational processes, leading to a **15%** increase in efficiency measured across multiple project assessments.\nTaught advanced methodologies in statistical analysis and programming in **Python**, fostering a skill development atmosphere among team members and guiding junior engineers in complex project execution.\nExhibited superior **Self-Management** by prioritizing tasks and progressing projects to meet tight deadlines, successfully achieving project milestones within **6 months** of initiation.\nDemonstrated **Flexibility** in adapting to evolving project requirements and methodologies, maintaining high standards of quality and productivity throughout the engineering processes.\nCollaborated with cross-functional teams to align engineering solutions with business objectives, promoting synergy and achieving quarterly targets, such as reducing operational costs by **12%**.\nUtilized statistical software expertise to streamline data collection processes, enhancing accuracy and reducing necessary data input time by **20%** through automation techniques."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **R** to perform complex data analyses and statistical modeling, driving data-driven decision-making in the engineering processes.\nConducted extensive research and academic writing to document methodologies, ensuring compliance with **Citation Standards** and promoting best practices in data interpretation and analysis.\nLeveraged **SPSS** and **Stata** for statistical analysis, enabling the identification of trends and patterns in operational data, resulting in improved efficiency and reduced costs.\nImplemented **Statistical Software** solutions for analyzing operational metrics, leading to a **15%** increase in process optimization across projects.\nDesigned engaging and informative presentations to teach engineering concepts, enhancing knowledge transfer and contributing to a more skilled workforce.\nFostered a culture of **Self Management** and **Flexibility** among team members, encouraging proactive problem-solving and adaptability in a fast-paced industrial environment.\nSupported the optimization of production processes through data-driven insights, leading to a **20%** reduction in waste over a **12-month** period.\nCollaborated with cross-functional teams to implement engineering solutions that resulted in a **25%** improvement in project delivery timelines."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied **Programming** skills in **Python** and leveraged **Statistical Software** such as **R**, **SPSS**, and **Stata** for advanced data analysis and modeling.\nConducted comprehensive **Research** and data collection, adhering to high **Citation Standards** to ensure the integrity and accuracy of industrial engineering projects.\nEducated and guided teams on best practices in **Academic Writing** to effectively communicate complex findings and analyses.\nDemonstrated **Self Management** by effectively prioritizing tasks in high-pressure environments, ensuring timely delivery of project milestones within a budget of **$100K**.\nAdapted to dynamic work environments showing **Flexibility** in methodologies, collaborating across departments to integrate engineering solutions with business needs.\nDeveloped training materials and delivered workshops on industrial engineering principles, improving team productivity by **25%**.\nUtilized analytics to assess project performance metrics, achieving a reduction in operational costs by **15%** through process optimization initiatives."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, R, JavaScript/TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tN/A\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tN/A\n\n**Other**\n\tAcademic Writing, Research, Citation Standards, Statistical Software, SPSS, Stata, Teaching, Self Management, Flexibility",
  "apply_company": "HazMiTrabajo"
}