{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Engineer with a proven track record of leveraging **3D modeling** and engineering software, including **Fusion**, **Solidworks**, and **AutoCAD**, to create high-quality designs and components. Possessing expertise in **metalworking**, **forming**, and **machining** processes, ensuring precision and functionality in engineering projects.\nSkilled in utilizing MS Word and Excel for documenting and analyzing project metrics, enhancing communication with stakeholders. Demonstrated ability to work collaboratively in diverse teams while implementing advanced technical solutions.\nWith over 13 years of experience in the tech field as a Full Stack Developer, I have a strong foundation in **JavaScript/TypeScript**, **Python**, and **Flutter**, complemented by frontend and backend proficiency in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have successfully delivered AI/ML-powered platforms focusing on predictive analytics and automation, while also deploying cloud-native systems using **AWS** and **Azure**. My commitment to compliance-driven development aligns with rigorous industry standards, reinforcing my ability to contribute effectively to complex engineering challenges.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AutoCAD** and **Fusion** to create precise 3D models and detailed engineering drawings for project implementations, ensuring compliance with engineering standards and specifications.\nApplied **Solidworks** for advanced simulations and product designs, resulting in a **15%** increase in efficiency during the prototyping phase.\nLeveraged **Excel** for data analysis and project tracking, enhancing reporting accuracy by **20%** to stakeholders and contributing to timely decision-making.\nConducted metalworking and machining processes with a focus on precision and quality control, consistently meeting a **99%** manufacturing accuracy rate.\nDesigned forming strategies and plans to streamline production processes, cutting down processing time by **10%** while maintaining product integrity.\nCreated comprehensive documentation and reports using **MS Word** and **Bluebeam Revu**, facilitating better project communication and documentation management.\nCollaborated with cross-functional teams to refine engineering designs and processes, driving innovation and ensuring alignment with customer needs and industry regulations.\nImplemented quality assurance protocols and testing procedures to guarantee final product quality, contributing to a **5%** reduction in return rates.\nOptimized workflows through continuous process improvements, achieving project milestones within projected timelines and budgets."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **AutoCAD** and **Solidworks** for precise 3D modeling, optimizing designs for manufacturing processes featured in a variety of mechanical projects, achieving a **20%** improvement in production efficiency.\nExecuted **Fusion 360** simulations to test and validate designs through **5 iterations**, ensuring structural integrity and functionality before physical prototyping.\nImplemented advanced metalworking techniques and forming processes to fabricate high-quality components, reducing waste by **15%** through streamlined machining methods.\nCreated detailed technical documentation and reports using **MS Word** and **Excel**, ensuring clear communication of project specifications, timelines, and progress to stakeholders.\nCollaborated with cross-functional teams to ensure alignment on engineering specifications and objectives, leading to successful project launches within tight deadlines, with an 80% on-time completion rate.\nUtilized **Bluebeam Revu** to review and annotate engineering drawings and documents, facilitating seamless collaboration among design and construction teams across **10** projects.\nLed the development of machining processes, reducing cycle time by **30%**, and increasing tooling lifespan through more effective material selection and treatment strategies."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Utilized **Solidworks** and **AutoCAD** to create and optimize 3D modeling for prototyping and product design, leading to a reduction in design time by **30%**.\n- Executed advanced metalworking techniques and forming processes to enhance the product's durability and aesthetics, significantly improving end-user satisfaction ratings by **25%**.\n- Conducted precision machining operations to produce high-quality components with tolerances of **±0.01mm**, ensuring adherence to strict engineering specifications.\n- Developed comprehensive documentation and reports using **MS Word** and **Excel**, improving project clarity and communication across teams by **40%**.\n- Coordinated cross-functional teams to deliver projects on time and within budget, achieving a successful on-time delivery rate of **95%**.\n- Implemented effective quality control measures during the engineering process, maintaining defect rates below **2%**, thus ensuring product reliability and compliance with industry standards.\n- Trained junior engineers and team members on the usage of **Fusion 360** and **Bluebeam Revu**, enhancing team capabilities and project output.\n- Spearheaded the integration of sustainable practices into design and manufacturing processes, leading to a **15%** decrease in material waste."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\t3D modeling, Fusion, Solidworks, metalworking, forming, machining, MS Word, Excel, AutoCAD, Bluebeam Revu",
  "apply_company": "Not specified"
}