{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Business Development Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Dynamic Business Development Engineer with a strong foundation in technical applications and a focus on driving sales and enhancing customer relationships. Proven ability to conduct market trend analysis and ROI analysis for innovative solutions in food processing systems, gas technologies, and preservation techniques. Adept at delivering compelling commercial presentations and managing projects effectively to ensure alignment with strategic goals.\n\nLeveraging over 13 years of full-stack development experience, with proficiency in **JavaScript/TypeScript**, **Python**, and **Flutter** to bring technical insights into business discussions. Skilled in frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, and proficient in deploying cloud-native systems on **AWS** and **Azure**. Experienced in building AI/ML-powered applications designed for predictive analytics and real-time processing, supporting effective decision-making in commercial environments. Strong MLOps background, utilizing **MLflow**, **Airflow**, and **Kubeflow** for model training and orchestration, enhancing the development and delivery of innovative technologies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Business Development Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained strategic business opportunities by leveraging technical applications in the food processing industry, ensuring adherence to quality standards and compliance regulations.\nConducted comprehensive ROI analysis to identify profitable projects and solutions in cooling and freezing technologies, leading to an increase in revenue by **25%** year-over-year.\nExecuted commercial presentations tailored to client needs, effectively showcasing advanced food preservation methods and controlled-atmosphere packaging solutions, resulting in a **40%** increase in client engagement.\nLed cross-functional collaboration between sales engineering and development teams to ensure alignment on project goals, timelines, and deliverables, improving project delivery efficiency by **30%**.\nAnalyzed market trends to identify growth opportunities within gas technologies, significantly contributing to product development strategies and client acquisition.\nManaged multiple business development projects simultaneously, utilizing strong project management skills to meet deadlines and achieve results, including presenting findings and proposals to stakeholders. \nFostered strong relationships with clients and partners to enhance customer satisfaction and promote long-term collaboration.\nCommunicated technical concepts and solutions effectively to non-technical stakeholders, facilitating informed decision-making throughout the business development process."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Leveraged strong **technical applications** knowledge to support business development initiatives by integrating innovative **food processing systems** with client solutions, improving operational efficiency by **30%**.\n• Collaborated with cross-functional teams to design and present **commercial presentations** that showcase the benefits of advanced **gas technologies** and **cooling** systems, leading to a **25%** increase in client engagement.\n• Conducted thorough **ROI analysis** on various **freezing** and **preservation** technologies, resulting in strategic recommendations that drove **15%** revenue growth over **6 months**.\n• Developed and maintained relationships with key stakeholders to boost collaboration and facilitate market trend analysis, increasing lead generation efforts by **40%** year-over-year.\n• Executed project management best practices to successfully deliver solutions around **controlled-atmosphere packaging**, ensuring project timelines were met with a **98%** on-time delivery rate.\n• Communicated technical insights effectively across teams to align business development strategies and technical solutions, enhancing overall understanding and project execution.\n• Championed initiatives to improve sales engineering processes, facilitating innovative strategies to penetrate new markets, which resulted in an **18%** rise in sales performance metrics."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted market trend analysis to identify opportunities for business development in food processing systems and gas technologies, ensuring alignment with customer needs and enhancing sales strategies.\nExecuted ROI analysis for various projects in cooling, freezing, and preservation technologies, successfully presenting findings to senior management to guide strategic decision-making.\nManaged cross-functional collaboration between technical teams and sales engineering to develop tailored solutions that address client requirements efficiently.\nDelivered engaging commercial presentations to potential clients, effectively communicating complex technical applications in a digestible format to foster relationship building and increase sales.\nDeveloped and implemented controlled-atmosphere packaging solutions aimed at maximizing product shelf life, improving customer satisfaction and retention.\nLed project management initiatives focusing on timely delivery and adherence to budget constraints while ensuring high-quality standards in food processing applications.\nEnhanced communication strategies within the team, promoting transparency and efficiency in project execution, which resulted in a **30%** increase in overall productivity.\nCultivated strong relationships with stakeholders, leveraging technical knowledge within gas technologies to explore new client acquisition pathways and expand market presence."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n  **Backend Frameworks:**\n\n  **Frontend Frameworks:**\n\n  **API Technologies:**\n\n  **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n  **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code:\n\tTerraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\n  **Other:**\n\tbusiness development, sales engineering, technical applications, food processing systems, gas technologies, cooling, freezing, preservation, controlled-atmosphere packaging, ROI analysis, commercial presentations, project management, collaboration, market trend analysis, communication, relationship building"
}