{
  "name": "Mariusz Jan Skobel",
  "role_name": "IT Operations Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-118083397/",
  "profile_summary": "Results-driven IT Operations Engineer with over 10 years of experience in managing and optimizing IT infrastructure. Expertise in **Windows Server Administration**, **Active Directory**, **Microsoft 365**, and **Endpoint Management** ensures the delivery of effective IT solutions tailored to organizational needs. Proficient in utilizing **Microsoft Intune**, **Microsoft Autopilot**, and **PowerShell** for streamlined automation and management of IT environments. Demonstrated capability in **Bash** scripting for process improvement and **Root Cause Analysis** to enhance system reliability and performance.\n\nRecognized for strong analytical thinking skills and the ability to collaborate effectively in teams, fostering an environment of knowledge sharing and continuous improvement. Proven experience in monitoring systems using **RMM Systems** and various **Network Tools**, ensuring proactive problem resolution and system availability. Passionate about leveraging technology to drive efficiency and deliver impactful solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "IT Operations Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tAdministered **Windows Server** environments and ensured optimal performance and security, leveraging **Active Directory** for user management and policy enforcement across the organization.\n•\tManaged and supported **Microsoft 365** services for over **500** users, configuring **Microsoft Intune** for efficient **Endpoint Management** and software deployment, achieving a **30%** reduction in deployment time.\n•\tAutomated routine tasks and system monitoring using **PowerShell** and **Bash** scripts, streamlining operations and minimizing human error in system configurations.\n•\tConducted **root cause analysis** for critical incidents, improving system uptime and reliability by **25%** through effective troubleshooting and collaboration with cross-functional teams.\n•\tIntegrated advanced **monitoring systems** and utilized **RMM systems** to proactively manage IT infrastructure and enhance incident response times by **40%**.\n•\tDeveloped automation scripts to optimize recurring tasks, resulting in a **20%** increase in team productivity and efficiency of IT operations.\n•\tFacilitated knowledge sharing sessions to enhance team collaboration and upskill peers in the usage of **network tools** and problem-solving methodologies relevant to IT operations.\n•\tImplemented best practices for IT operations and provided analytical insights on performance metrics to inform decision-making and strategic improvements across systems and applications.\n•\tCollaborated with IT support teams to ensure a seamless deployment process using **Microsoft Autopilot**, achieving successful rollouts of **100+** devices with minimal end-user disruption."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive **Windows Server Administration** and **Active Directory** management to ensure optimal performance and security of IT infrastructure for over **500 users**.\nImplemented **Microsoft 365** solutions and effective **Endpoint Management** strategies, enhancing user productivity and collaboration across the organization by **30%**.\nUtilized **Microsoft Intune** and **Microsoft Autopilot** for streamlined device provisioning and management, minimizing deployment time to under **2 hours** per device.\nAutomated routine tasks with **PowerShell** and **Bash** scripts, resulting in a reduction of manual processes by **40%** and increased system reliability.\nConducted **Root Cause Analysis** to identify and troubleshoot system issues efficiently, contributing to a **99% uptime** for critical applications and services.\nMonitored and managed system performance through **Monitoring Systems** and **RMM Systems**, ensuring timely identification and resolution of potential issues. \nEnhanced network security using various **Network Tools**, fostering a proactive approach to threat detection and mitigation.\nPromoted **Team Collaboration** and **Knowledge Sharing** among IT staff through regular workshops and documentation, improving departmental efficiency and knowledge retention by **25%**.\nDemonstrated strong **Analytical Thinking** in diagnosing system failures and formulating actionable solutions, improving incident response times by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "- Managed and optimized **Windows Server Administration** processes, ensuring high availability and performance across multiple servers while supporting a user base of over **1,000** employees.\n- Administered **Active Directory** for user management, roles, and permissions, streamlining access control and improving security compliance by **30%**.\n- Implemented and maintained **Microsoft 365** environments, providing seamless communication tools and collaboration features to enhance productivity across the organization.\n- Configured **Microsoft Intune** and **Microsoft Autopilot** to oversee endpoint management, driving a reduction in device provisioning time by **50%**.\n- Developed automation scripts using **PowerShell** and **Bash** to improve operational efficiency and reduce manual tasks by **40%**, effectively managing software deployments and system updates.\n- Conducted in-depth root cause analysis on incidents and outages, reducing system downtime by **25%** through proactive monitoring and reporting.\n- Leveraged monitoring systems and **RMM systems** to track performance metrics and system integrity, enabling timely interventions and minimizing disruptions.\n- Utilized **network tools** to troubleshoot connectivity issues and ensure reliable network performance for critical applications.\n- Collaborated with cross-functional teams to implement automation solutions that improved team workflows and increased overall system uptime.\n- Shared knowledge and best practices within the IT operations team, fostering a culture of continuous improvement and skills development among team members."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tNone\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tWindows Server Administration, Microsoft 365, Active Directory, Endpoint Management, Microsoft Autopilot, Microsoft Intune, Monitoring Systems, RMM Systems, Network Tools\n\n**Other:**\n\tBash, PowerShell, Automation, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Root Cause Analysis, Analytical Thinking, Team Collaboration, Knowledge Sharing"
}