{
  "name": "Tomasz Lee",
  "role_name": "Senior ML Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior ML Engineer with over 9 years of experience in developing advanced machine learning solutions leveraging **Python**, **Databricks**, and **MLflow**. Proficient in **MLOps** practices with strong expertise in **Azure Services**, **Spark**, and **PySpark** for scalable, efficient data processing. Experienced in containerization and orchestration using **Docker** and **Kubernetes**. Highly analytical with a proven track record in problem-solving and attention to detail. Adept at team collaboration and effectively communicating complex concepts to stakeholders, ensuring successful project execution and delivery.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **Databricks** for developing and deploying scalable machine learning models for various business applications.\nImplemented **MLOps** strategies using **MLflow** for efficient model tracking and management, improving deployment frequency by 30%.\nLeveraged **Azure Services** to enhance cloud data solutions and optimize processing times, leading to a 40% reduction in resource costs.\nDeveloped data processing pipelines with **Spark** and **PySpark**, resulting in faster data retrieval and analysis by 25%.\nContainerized applications using **Docker** and orchestrated deployment using **Kubernetes**, achieving seamless scalability.\nApplied strong **analytical thinking** and **problem-solving** skills to troubleshoot complex data issues, enhancing overall project deliverables.\nExhibited **effective communication** through regular team updates and documentation, leading to a 15% increase in project efficiency.\nDemonstrated **attention to detail** while ensuring rigorous testing of ML models, saving up to 20% in post-deployment corrections.\nFostered **team collaboration** by leading cross-functional meetings, ensuring alignment on project objectives and timelines.\nAdapted swiftly to technological advancements and changing project requirements, contributing to a successful project turnaround within **6 months**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** within **Databricks** to develop scalable machine learning solutions, significantly enhancing analytical capabilities by 20%.\nImplemented **MLOps** practices to streamline deployment processes, achieving a reduction in model deployment times by 30%.\nConfigured **Azure Services** to manage and deploy machine learning models, ensuring a reliable infrastructure and scaling capabilities to support up to 5 simultaneous model predictions.\nDeveloped **Spark** and **PySpark** data pipelines to process large datasets efficiently, increasing data processing speed by 50%.\nContainerized machine learning applications using **Docker** and orchestrated them with **Kubernetes**, improving system reliability and resource utilization by 15%.\nCollaborated effectively with cross-functional teams to gather and define project requirements, enhancing team collaboration outcomes by 25%.\nConducted detailed code reviews to ensure code quality and optimized algorithms for better performance, leading to a 10% reduction in execution time.\nMentored junior developers in best practices for data science and machine learning, fostering a culture of continuous learning and improvement.\nEmployed analytical thinking and problem-solving skills to troubleshoot complex issues within machine learning workflows, minimizing downtime to less than 5%.\nPresented project updates and technical concepts effectively to stakeholders, improving overall communication efficiency within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **Databricks** for developing and deploying machine learning models, contributing to a **30%** increase in model accuracy over previous versions.\nImplemented **MLflow** for tracking experiments and managing the ML lifecycle, improving team efficiency in model iterations by **25%**.\nDesigned and executed data pipelines using **Spark** and **PySpark** to process large datasets, enhancing data processing speed by **40%**.\nContainerized applications with **Docker** and orchestrated deployment in **Kubernetes**, streamlining the deployment process and enhancing scalability.\nCollaborated with stakeholders to gather requirements and deliver data-driven solutions, ensuring alignment with business needs.\nEngaged in team discussions to brainstorm solutions for complex problems, utilizing **analytical thinking** and **problem-solving** skills effectively.\nCommunicated technical concepts clearly to both technical and non-technical team members, fostering an environment of **effective communication** and **team collaboration**.\nFocused on continual improvement and adapting to new technologies, showcasing **adaptability** in a fast-paced environment.\nMaintained detailed documentation of ML processes and results, emphasizing **attention to detail** for future reference and knowledge transfer."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAzure Services\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tDocker, Kubernetes, AWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tDatabricks, Spark, PySpark\n\n**Other**\n\tUX/UI Design, Git, GitHub, Analytical Thinking, Problem-Solving, Effective Communication, Attention to Detail, Team Collaboration, Adaptability, MLOps, MLflow, Selenium, Moq, Postman, Cypress, JMeter, Jest, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis",
  "apply_company": "Elitmind"
}