{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Sales Engineer with 9+ years of experience in technical expertise and market intelligence. Skilled in articulating complex technical solutions, leveraging tools like **CRM** systems to enhance client relationships and sales performance. Proven ability to communicate effectively in both German and English, fostering strong partnerships with clients and stakeholders. Additionally, experienced in utilizing **microservices architecture**, **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, and **.NET** technologies. Committed to delivering innovative solutions and driving revenue growth through a combination of technical prowess and strategic sales acumen.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Demonstrated **technical expertise** by spearheading the design and development of a web-based Customer Relationship Management (CRM) platform using **.NET 7** and **ReactJS**/**Next.js**, enhancing user satisfaction by **25%**.\nLeveraged **market intelligence** to design and implement a microservices architecture using **.NET Core** to ensure system scalability and maintainability.\nIntegrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, achieving improved system resilience and throughput.\nUtilized **Redis** for caching frequently accessed data, which reduced database load and improved response times by **35%**.\nDeveloped RESTful APIs with **.NET**, tightly integrated with a **MongoDB** database, ensuring seamless data access for various services.\nImplemented CI/CD pipelines on **Azure DevOps**, resulting in a **40%** reduction in deployment time.\nOptimized **MSSQL** database queries and indexing, achieving a **20%** reduction in average query execution time.\nCollaborated closely with UX/UI designers to enhance the platform’s user interface, substantially improving overall user experience.\nDeveloped a robust reporting engine using **D3.js** and **Three.js** for creating interactive and impactful data visualizations.\nApplied **JWT-based authentication** and authorization mechanisms to secure the application while providing exceptional communication with clients in both **German** and **English**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **CRM** systems to manage client relationships effectively, contributing to a 20% increase in sales conversions.\nDemonstrated **technical expertise** by providing in-depth product knowledge and technical support, resulting in a 30% reduction in customer inquiries.\nUtilized **market intelligence** to identify new business opportunities and optimize sales strategies, leading to a 15% growth in market share.\nCommunicated fluently in both **German** and **English**, enhancing team collaboration and international client relations.\nImplemented a structured sales process that streamlined onboarding and training, resulting in a 40% faster ramp-up time for new team members.\nAnalyzed sales data and metrics regularly to inform decision-making and strategy adjustments, achieving a sales target reach of **$1M** in **Q3 2023**.\nCultivated strong relationships with key accounts, contributing to a **25%** increase in renewals compared to the previous year.\nDelivered compelling technical presentations and product demos to clients, increasing engagement scores by **50%**.\nParticipated in knowledge-sharing sessions to uplift overall team performance and sales tactics, fostering a culture of continuous improvement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Utilized **CRM** systems to enhance sales strategies, contributing to a 20% increase in productivity for the sales team.\n• Leveraged **technical expertise** by developing an internal application using **.NET Framework** and **Angular**, streamlining workflows.\n• Analyzed **market intelligence** to identify key areas for improvement in customer engagement processes.\n• Implemented **RabbitMQ** for efficient message handling, which reduced system load by **30%** during peak traffic times.\n• Created reusable components in **C#** and **Angular 12** to reduce future project development time by **40%**.\n• Managed customer data effectively using **SQL Server**, achieving a **50%** improvement in query performance metrics.\n• Spearheaded the migration of legacy systems from **ASP.NET WebForms** to **.NET Core 3.1**, significantly enhancing maintainability.\n• Partnered with the DevOps team to establish CI/CD pipelines in **Azure DevOps**, reducing deployment times by **75%**.\n• Facilitated integration efforts with third-party APIs, promoting seamless data interactions between systems.\n• Enhanced client-side user interfaces by working with **Vue.js** on dashboards, improving user experience.\n• Conducted project standups and code reviews, ensuring compliance with best practices and alignment with strategic goals.\n• Developed comprehensive technical documentation and user guides for internal systems, enhancing inter-team knowledge sharing."
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS,\n\tBackend Technologies: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices,\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis,\n\tDatabase Systems: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB,\n\tCloud & DevOps: AWS, Azure, CI/CD pipelines,\n\tOther Skills: UX/UI Design, Git, GitHub, RESTful API, GraphQL, Python, Redux, Sales, Technical Expertise, CRM, Drilling, Market Intelligence, Communication, German, English",
  "apply_company": "Debe Flow Group"
}