{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Java Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Java Engineer with 8 years of experience in the finance sector, specializing in the development of robust applications using **Java**, **Kotlin**, **Scala**, and **PostgreSQL**. Proven expertise in employing **GCP** for cloud services, alongside container orchestration with **Kubernetes** and monitoring using **Grafana**, **Prometheus**, and **NewRelic**. Well-versed in Continuous Integration and Continuous Delivery (CI/CD) practices, with a focus on Test-Driven Development (TDD) and Domain-Driven Design (DDD) methodologies.\n\nStrong team collaborator and communicator, bringing organizational skills to manage product-focused development in a startup environment. Leveraging my foundation in microservices architecture and event-driven systems, I ensure the delivery of high-performance and secure software solutions tailored to client needs.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **GCP** to architect and develop scalable, full-stack solutions that meet financial industry standards, ensuring compliance with key regulations.\nImplemented continuous integration and continuous delivery (CI/CD) pipelines using **Kubernetes** and **Flyway** for automated deployment in cloud environments, enhancing the development workflow.\nDesigned and optimized database solutions with **PostgreSQL** and **Redis**, ensuring efficient storage and query performance for high-volume financial data.\nApplied test-driven development (TDD) methodologies to ensure robust code quality, employing frameworks like **Spock** and **JUnit** for unit testing and continuous validation.\nEmployed data-driven design (DDD) principles to enhance software architecture, leveraging collaboration and communication skills to align with product teams.\nLeveraged real-time monitoring tools such as **Grafana**, **Prometheus**, and **NewRelic** to oversee application performance and facilitate performance tuning for complex financial applications.\nCollaborated with cross-functional teams to integrate **SparkJava** for web services and to develop RESTful APIs that enable seamless data interaction between client applications and financial services.\nContributed to delivering results-driven solutions that meet strict deadlines, maintaining a startup mentality focused on product quality and team success.\nDeveloped machine learning models for financial risk prediction and anomaly detection in transaction data using **Python** libraries and integrated them with Java applications for enhanced business insights.\nCoordinated efforts in a team-oriented environment to drive innovation, ensuring that project goals and deadlines are met while maintaining high standards of communication and organization."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Kotlin** in the development of scalable and maintainable financial applications, implementing **TDD** and **DDD** methodologies to ensure high-quality code for complex systems supporting high-volume transactions.\nDesigned and deployed solutions on **GCP** using **Kubernetes** for container orchestration, resulting in a **30%** reduction in deployment time and improved scalability of financial services.\nDeveloped robust data storage solutions using **PostgreSQL** and **Redis**, optimizing queries to achieve an average response time of under **200ms** for financial transactions.\nImplemented monitoring and alerting systems using **Grafana**, **Prometheus**, and **NewRelic** to ensure system reliability and performance, achieving over **99.9%** uptime in production environments.\nCollaborated with cross-functional teams to deliver a product-focused financial platform, maintaining effective communication and teamwork to adapt to fast-paced startup environments.\nImproved system performance and reliability through continuous integration and continuous delivery (CI/CD) practices, reducing the average bug resolution time by **25%**.\nEngaged in results-driven projects that leveraged **Spock**, **SparkJava**, and **JOOQ** for seamless data manipulation and application testing in banking systems.\nParticipated in code reviews and knowledge sharing sessions to foster a culture of continuous learning and improvement within the team, consistently mentoring junior developers and enhancing organizational skills."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Engineered high-availability backend services utilizing **Java** and **Spring**, focusing on rapid, scalable performance and low latency across critical modules such as order processing and inventory management.\n• Integrated cloud solutions using **GCP** for optimized server management and resource allocation, achieving a **30%** reduction in operational costs while enhancing performance metrics.\n• Developed robust data storage solutions with **PostgreSQL** and **Redis**, enabling fast, fault-tolerant access for high-volume transactions and maximizing response times by **50%** during peak traffic.\n• Implemented monitoring and performance optimization tools including **Grafana**, **Prometheus**, and **NewRelic**, resulting in improved system reliability and a **25%** increase in issue detection speed.\n• Established CI/CD pipelines and embraced **Kubernetes** for automated deployments, facilitating agile software development processes and reducing release times by **40%**.\n• Advocated for Test-Driven Development (TDD) and Domain-Driven Design (DDD) principles, ensuring high code quality and maintainability across the application lifecycle.\n• Collaborated with cross-functional teams to enhance communication, foster teamwork, and align project goals to maintain product-focused development strategies.\n• Applied role-based access control (RBAC) and OAuth 2.0, leading efforts to ensure security compliance while focusing on user protection and GDPR alignment.\n• Engaged in continuous skill development and applied knowledge in **Java** frameworks such as **Spock** and **SparkJava**, enhancing team productivity and delivering results-driven solutions.\n• Demonstrated strong organizational skills by managing project timelines effectively, ensuring all deliverables were completed on schedule and met quality standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Kotlin, Scala, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, SparkJava, JOOQ, Spock\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tMLflow, Airflow, Kubeflow\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tGrafana, Prometheus, NewRelic\n\n**Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, TDD, DDD, Continuous Integration, Continuous Delivery, Communication, Teamwork, Organizational Skills, Results-driven, Quick learner, Finance, Startup, Product-focused",
  "apply_company": "Revolut"
}