{
  "name": "Patryk Zaslawski",
  "role_name": "Fullstack Software Engineer – E-Mobility",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a proficient Fullstack Software Engineer with 8+ years in software engineering, I specialize in developing dynamic and scalable applications using **PHP**, **Typescript**, and **Symfony**. I leverage **VueJS** and **Nuxt** for building intuitive user interfaces while ensuring responsive design with **TailwindCSS**. My expertise in cloud services such as **AWS CDK**, **API Gateway**, and **AWS Lambda** allows me to create robust backend solutions, while **Docker** ensures seamless deployment. I have a proven track record of implementing CI/CD processes and utilizing **Git** for effective version control within Agile methodologies. Additionally, I am fluent in English and possess German language skills, enhancing my communication in diverse environments. My strong foundation in software engineering empowers me to deliver efficient, high-performance solutions tailored to business needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Fullstack Software Engineer – E-Mobility",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and maintained full-stack applications using **PHP** and **Typescript**, ensuring efficient communication between the front-end (using **VueJS**, **Nuxt**, and **TailwindCSS**) and back-end systems.\n- Implemented serverless architectures with **AWS Lambda** and **API Gateway**, improving scalability and reducing operational costs by **30%**.\n- Designed and deployed containerized solutions with **Docker**, streamlining development workflows and enhancing application reliability across different environments.\n- Configured and maintained CI/CD pipelines using **Git** and **AWS CDK**, achieving an **85%** reduction in deployment time through automated testing and deployment processes.\n- Collaborated in an Agile environment, adhering to best practices in development and project management, resulting in a **50%** increase in team productivity.\n- Developed responsive UI components in **VueJS** and **Nuxt**, delivering seamless user experiences across web applications while ensuring compatibility with mobile platforms.\n- Conducted code reviews and mentored junior developers in **PHP** and **Typescript**, fostering a culture of continuous learning and improvement within the team.\n- Integrated third-party APIs for enhanced functionality, employing **API Gateway** to ensure secure and efficient service interactions.\n- Enhanced application performance and user engagement metrics by implementing state management solutions in **VueJS**, optimizing load times by **40%**.\n- Actively participated in firefighting high-critical incidents, reducing downtime of web applications by implementing proactive monitoring and adjustments.\n- Developed thorough documentation in English for technical specifications and user guides, making complex information accessible to non-technical stakeholders.\n- Utilized proficiency in the German language to collaborate with German-speaking stakeholders, ensuring clear communication and project alignment."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Developed and maintained web applications using **PHP**, **Typescript**, and **VueJS**, ensuring performance and scalability within an **Agile** environment.\n- Designed and implemented RESTful APIs with **Symfony**, integrating seamlessly with front-end frameworks like **Nuxt** to enhance user experience and interactivity.\n- Utilized **Docker** for containerization, streamlining application deployment across different environments and enhancing CI/CD pipelines.\n- Collaborated in a cross-functional team to deliver features and improvements, adhering to **Git** workflows for version control and team collaboration.\n- Implemented responsive designs using **TailwindCSS**, enhancing the frontend user interface of applications.\n- Worked with **AWS CDK** to provision cloud resources efficiently and developed serverless applications utilizing **AWS Lambda** for background processing tasks, reducing operational overhead.\n- Developed real-time features in applications using message queuing systems to improve communication between microservices, achieving a solution capable of handling up to **1,000** concurrent users.\n- Ensured high-code quality through automated testing and CI/CD practices, implementing pipelines with tools like **GitHub Actions** and **TFS**.\n- Contributed to the development of mobile applications using **Flutter**, ensuring feature parity with web applications.\n- Applied Agile methodologies to iteratively develop and refine software solutions, improving development timelines by **25%**.\n- Leveraged proficiency in English and **German language skills** for effective communication with international teammates and stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and maintained dynamic web applications using **PHP** and **Typescript** with frameworks like **Symfony** and **VueJS**, enhancing user experience and driving project efficiencies.\nManaged and deployed serverless architectures on **AWS Lambda** with **API Gateway**, ensuring high availability and scalability for web applications.\nImplemented CI/CD pipelines utilizing **Docker**, **Git**, and **AWS CDK** for automated application deployments, reducing release times by **30%**.\nCollaborated in an Agile environment, participating in daily stand-ups, sprint planning, and retrospective meetings to optimize team performance and productivity.\nCreated responsive UI components using **VueJS** and **Nuxt**, integrated with RESTful APIs for seamless client-server interactions.\nApplied modern design principles with **TailwindCSS** for styling applications, which resulted in a **40%** increase in development speed for new features.\nWorked with **Docker** to containerize applications, leading to consistent environments for development, testing, and production.\nImplemented testing strategies with **Jest** and **Cypress**, achieving **95%** code coverage for frontend components, ensuring high code quality and reliability.\nLeveraged cloud services such as **AWS** for deploying scalable applications and optimizing performance through effective resource management.\nDeveloped and integrated mobile applications with **Flutter**, enhancing the accessibility of services across platforms and improving customer engagement by **25%**.\nEngaged in thorough documentation of software procedures and workflows, enhancing team communication and knowledge sharing for English- and German-speaking stakeholders.\nConducted performance tuning and scaling of applications with an emphasis on minimizing response times and increasing throughput."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tPHP, Symfony, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), VueJS, Nuxt, Blazor, TailwindCSS, Flutter\n\n**API Technologies:**\n\tREST & gRPC APIs, API Gateway\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, RDS, S3), AWS CDK, Git, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Nginx, Certbot\n\n**Other:**\n\tPython (FastAPI, Django, Flask), SQLAlchemy, Pydantic, Celery, Agile methodologies, English proficiency, German language skills, JWT, OAuth2, Let’s Encrypt"
}