{
  "name": "Marcin Karol Kotlinski",
  "role_name": "QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Detail-oriented QA Engineer with 8 years of experience in test automation and quality assurance methodologies, proficient in **JavaScript**, **TypeScript**, and **Golang**. Adept at API testing, functional testing, integration testing, and regression testing, with a robust understanding of defect tracking tools and cloud services like **Google Cloud**. Proven track record of delivering high-quality solutions within Agile and SCRUM frameworks, ensuring compliance with industry standards.\nIn my previous roles as a Full Stack Developer, I created high-performance applications while utilizing frameworks such as **React**, **Next.js**, and **Node.js**. My experience extends to cloud environments like **Azure** and **AWS**, where I successfully implemented CI/CD pipelines that increased deployment efficiency. With strong interpersonal and time management skills, I excel in collaborative environments, leveraging attention to detail to drive projects to successful completion and enhance user experience.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented comprehensive **test automation** strategies using Jest, Cypress, and PyTest to ensure high-quality software delivery across **JavaScript** and **TypeScript** applications.\n- Applied **quality assurance methodologies** for **functional testing**, **regression testing**, and **integration testing**, achieving a **95%** defect detection rate before production releases.\n- Developed and executed extensive **API testing** methodologies for backend services, ensuring compliance with functional requirements and performance standards.\n- Collaborated effectively within **SCRUM** and **Agile** frameworks to manage testing cycles and deliver feedback in **sprints**, enhancing team productivity by **20%**.\n- Utilized **defect tracking tools** to monitor bugs and inconsistencies, establishing a clear communication protocol that curtailed issue resolution time by **30%**.\n- Enhanced time management and prioritization skills by coordinating multiple project timelines and testing activities while maintaining an unwavering attention to detail.\n- Contributed to the quality assurance of scalable healthcare and financial platforms developed using **TypeScript**, **Python (FastAPI)**, **Node.js**, and modern front-end frameworks like **React (17-18)** and **Next.js**.\n- Assisted in cross-platform mobile application quality assurance using **Flutter** and **React Native**, focusing on seamless user experience on iOS and Android devices.\n- Established robust testing strategies for microservices deployed in **Docker** and **Kubernetes (AKS/EKS)** environments to ensure application scalability and fault tolerance.\n- Participated in the development and testing of machine learning models with **Python (scikit-learn, TensorFlow)**, enhancing product features with automated data validation processes.\n- Created test plans for cloud-native applications utilizing **PostgreSQL**, **MongoDB**, and **GraphQL**, optimizing performance testing for large-scale data ingestion and processing.\n- Integrated advanced search capabilities with **Azure Cognitive Search** and **ElasticSearch**, validating the operational efficiency through rigorous testing."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented comprehensive **quality assurance methodologies** to ensure software stability and functionality, resulting in a **30% reduction** in production defects.\nConducted thorough **API testing** using **Postman** and **RestAssured**, validating services built on **Node.js**, **Python**, and **Golang** to ensure robust integration in a microservices architecture.\nExecuted **functional testing**, **regression testing**, and **integration testing** for financial platforms, contributing to an overall **25% improvement** in user acceptance metrics.\nDeveloped **test automation** frameworks with **JavaScript** and **TypeScript**, enabling continuous testing and integration in line with **Agile** and **SCRUM** methodologies.\nUtilized **defect tracking tools** to document and resolve issues, enhancing project collaboration and communication among development and QA teams.\nApplied **Google Cloud** services to optimize testing environments, resulting in increased testing efficiency and reducing setup time by **40%**.\nEmployed strong **time management** skills to meet tight deadlines and project milestones, fostering effective teamwork and collaboration throughout development cycles.\nMaintained a strong **attention to detail** to identify potential bottlenecks and improve overall software quality, ensuring an exceptional user experience across financial platforms.\nDemonstrated excellent **interpersonal skills** in cross-functional team settings, enhancing collaboration between engineers, product management, and stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented rigorous **API testing** methods to ensure the functionality and reliability of backend services in a global e-commerce platform.\nExecuted comprehensive **functional testing**, **regression testing**, and **integration testing** on applications built using **JavaScript**, **TypeScript**, **React (18)**, and **Node.js** frameworks like **NestJS** and **Express**, ensuring high quality in each release.\nApplied **test automation** strategies using modern tools, enhancing testing coverage and reducing manual testing efforts by **30%**.\nDeveloped testing scenarios in adherence to **quality assurance methodologies** to guarantee optimal performance and scalability of applications.\nIntegrated defect tracking tools to document and resolve issues efficiently, contributing to a **40%** decrease in reported bugs post-deployment.\nCollaborated effectively in **SCRUM** and **Agile** environments, participating in sprint planning and retrospectives to optimize team productivity and project timelines.\nUtilized **Google Cloud** services for deploying test environments and enabling seamless continuous integration and delivery processes.\nManaged time effectively while prioritizing multiple testing tasks, ensuring all deadlines were met and quality standards were upheld.\nExhibited strong **interpersonal skills** by working closely with development teams to identify potential areas of improvement and ensure adherence to best practices.\nDemonstrated exceptional **attention to detail** in all testing phases, identifying edge cases and preventing potential issues in production systems."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tPython(FastAPI, Flask, Django)\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tAPI testing\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tGoogle Cloud\n\n **Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\ttest automation, quality assurance methodologies, defect tracking tools, functional testing, regression testing, integration testing, SCRUM, Agile, time management, interpersonal skills, attention to detail"
}