{
  "name": "Rei Taro",
  "role_name": "Senior Software Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-oriented Senior Software Engineer with over 10 years of extensive experience in developing robust web applications and REST APIs. Proficient in **Python** (Django, FastAPI, Flask) and **JavaScript**, with a strong focus on internationalization and localization strategies. Skilled in collaborating within teams to deliver high-quality software solutions, leveraging open source technologies and methodologies. Experienced in optimizing backend systems for financial platforms and cloud-native architectures, utilizing **AWS** and **Azure**. Known for impactful contributions to projects at prestigious firms like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Django** to engineer robust backend services that enhance web applications and document automation workflows.\nDeveloped and optimized **REST APIs** for seamless integration and internationalization processes, contributing to effective **localization** strategies.\nDesigned and implemented event-driven architectures with **Celery** and **Redis** to boost asynchronous processing capacities for transaction requests, improving system efficiency by **30%**.\nDeployed and maintained microservices on **Azure App Services**, employing **Terraform** for Infrastructure as Code (IaC) to ensure a **99.9%** uptime for cloud operations.\nCreated reliable data pipelines using **Apache Airflow** and **Azure Functions** for regulatory data exchange, achieving a **40%** reduction in data latency.\nConducted thorough security assessments and integrated **OAuth2** and **Azure AD B2C** for secure and scalable authentication solutions, enhancing security compliance by **25%**.\nFostered team collaboration and communication across cross-functional teams, effectively addressing system integration challenges and refining release strategies, all while ensuring compliance with industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed web applications utilizing **Python** and **Django** to enhance internationalization and localization features, improving user experience for global markets.\n• Created and maintained **REST APIs** for efficient data exchange, ensuring high performance and scalability to handle over **10,000** requests per minute.\n• Collaborated effectively with cross-functional teams, using strong **communication** skills to align on project goals and objectives, achieving a **20%** reduction in project delivery time.\n• Implemented open source solutions, contributing to the **Pontoon** project, leading to improved localization workflows and stakeholder satisfaction.\n• Employed **JavaScript** for frontend enhancements, integrating with backend services to deliver seamless user experiences across platforms.\n• Leveraged expertise in **team collaboration** tools to foster an inclusive development environment, resulting in enhanced productivity and morale among team members.\n• Utilized **C++** and **Rust** for performance-critical modules, achieving optimization that improved processing times by up to **30%**.\n• Actively participated in code reviews and mentorship sessions, encouraging a culture of continuous learning and improvement within the engineering team."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **JavaScript** to develop robust backend services for trade execution, portfolio management, and account tracking with a focus on enhancing trading operations.\nEngineered high-performance real-time price feed processors using **asyncio**, **WebSockets**, and **Redis** to deliver up-to-the-minute trading data, accommodating over **500 transactions per second**.\nCollaborated effectively with frontend teams to deliver data through **REST APIs** and WebSocket channels, ensuring seamless user interaction with the trading platform by achieving a **99.9% uptime** rate.\nEnsured compliance with regulatory requirements, including **MiFID II** and **GDPR**, while upholding internal data security protocols for over **10,000** user accounts.\nImplemented comprehensive test suites using **PyTest**, **tox**, and mock servers, streamlining QA and CI processes, reducing bug rates by **30%** during development cycles.\nIntroduced job queuing and scheduling solutions with **Celery** and **RabbitMQ**, optimizing backend task execution and process management that resulted in a **25%** increase in processing efficiency.\nDemonstrated strong team collaboration and communication skills throughout the development process, contributing to a more unified software engineering team."
    }
  ],
  "skills": " **Programming Languages**\n\t Python, JavaScript, Rust, C++\n\n **Backend Frameworks**\n\t Django, FastAPI, Flask, Celery\n\n **Frontend Frameworks**\n\t Pontoon\n\n **API Technologies**\n\t REST APIs\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t web applications, open source, internationalization, localization, team collaboration, communication, Microservices, Kafka, CI/CD, PyTest, Git, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow",
  "apply_company": "Mozilla"
}