{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior IT Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior IT Engineer with 13+ years of robust experience in cloud services, specifically with **Azure** and **Microsoft 365** environments. Proficient in implementing security frameworks using **Microsoft Defender**, **DLP**, **RBAC**, **OAuth**, **OIDC**, and **SAML**, ensuring compliance and data protection standards are met. Adept in leveraging **Microsoft Graph**, **Azure Policy**, and **Microsoft Sentinel** for incident response and governance alongside strong knowledge of **HTTP/S**, **TCP/IP**, and network fundamentals.\n\nSkilled in using **PowerShell** to automate workflows and manage cloud infrastructure effectively, enhancing operational efficiency. Experienced in providing end-user collaboration solutions with tools such as **Teams**, **SharePoint**, and **Exchange Online**, enabling seamless communication and productivity.\n\nAdditionally, has a solid foundation in software development, with expertise in **JavaScript/TypeScript**, **Python**, and mobile frameworks like **Flutter**. Proven ability to build high-performance applications, leveraging both frontend and backend technologies including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Strong experience in deploying cloud-native systems and managing microservices architectures while adhering to compliance-driven development practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior IT Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented **Microsoft 365** strategies for enhanced team collaboration and communication, ensuring seamless integration with tools such as **Teams** and **Exchange Online**.\n- Managed identity and access management using **Entra ID**, **OAuth**, **OIDC**, and **SAML** protocols to secure sensitive data across corporate environments.\n- Utilized **PowerShell** scripts for automation of routine administrative tasks, improving efficiency by **30%** in user management and reporting.\n- Developed comprehensive data-loss prevention (DLP) policies across various platforms including **SharePoint** and **Microsoft Defender**, achieving a **25%** reduction in security incidents.\n- Designed and enforced conditional access policies with **Azure Policy**, ensuring compliance with corporate security standards and audit frameworks.\n- Led incident response initiatives utilizing **Microsoft Sentinel** for proactive threat management and **Purview** for data governance, enhancing data security and traceability.\n- Collaborated with cross-functional teams to implement device trust solutions, utilizing **Intune** for management of mobile and desktop devices, achieving compliance with corporate policies.\n- Established and maintained role-based access control (RBAC) measures to enhance security and compliance in all user-access scenarios, reducing unauthorized access incidents by **40%**.\n- Developed knowledge articles and documentation promoting best practices in using **Microsoft Graph** for data access and manipulation, improving team understanding by **20%**.\n- Conducted training sessions and workshops on **records management** and **eDiscovery**, fostering a culture of collaboration and adherence to internal policies and frameworks."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **Azure** solutions to enhance collaboration tools such as **Microsoft 365**, **Teams**, and **SharePoint**, ensuring seamless communication across departments for a team of 100+ employees.\nLeveraged **PowerShell** scripts for automating workflows within **Microsoft Defender** and **Intune**, increasing operational efficiency by **30%** in device management and threat detection.\nDesigned secure access protocols using **OAuth**, **OIDC**, and **SAML** for single sign-on and user authentication, maintaining compliance with industry standards and improving user satisfaction by **25%**.\nUtilized **Microsoft Graph** API to manage and integrate user data across **Azure** services, leading to a **20%** reduction in data redundancy and enhanced data insights.\nDeveloped and enforced **Azure Policy** frameworks to ensure compliance across cloud resources and implemented **RBAC** for fine-grained access control, reducing the risk of unauthorized access by **40%**.\nConducted incident response drills utilizing **Microsoft Sentinel** and **Microsoft Purview** to prepare for security breaches and data-loss incidents, improving response time by **50%**.\nExecuted **data-loss prevention (DLP)** strategies to safeguard sensitive information, with a measurable increase in data compliance scores by **15%** through training and policy updates.\nCollaborated with cross-functional teams to produce knowledge articles and assist in **eDiscovery** processes, enhancing the documentation and retrieval systems for legal audits.\nAdministered records and **insider risk** programs to monitor and identify potential threats, successfully mitigating risks through regular audits and analytics reviews at a frequency of **quarterly** assessments."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Implemented role-based access control (RBAC) and OAuth 2.0 to ensure secure customer and admin access, aligning with GDPR compliance and user data protection throughout the platform.\n- Utilized **Microsoft 365** and **Microsoft Defender** to enhance security measures and data-loss prevention strategies across cloud applications and services.\n- Employed **PowerShell** for automating administrative tasks in **Azure** and streamlining incident response processes, resulting in a **25%** reduction in response time.\n- Deployed and managed applications on **Azure** using **Azure Policy** to enforce governance and compliance measures, enhancing overall security posture by **30%**.\n- Integrated **Microsoft Graph** to facilitate seamless collaboration and data management within cloud environments, improving team productivity by **40%**.\n- Coordinated the use of **Intune** to implement device trust policies and ensure compliance across all devices accessing the e-commerce platform.\n- Developed eDiscovery strategies leveraging **Microsoft Sentinel** for proactive monitoring and compliance reporting, significantly reducing risk on sensitive data by **20%**.\n- Established collaboration workflows using **Teams** and **SharePoint**, enabling effective communication and document sharing across cross-functional teams, enhancing project completion rates by **15%**.\n- Configured **DLP** policies to monitor and protect sensitive information, ensuring compliance with internal audit frameworks and industry standards.\n- Managed Conditional Access policies to restrict access to sensitive data based on user roles and context, enhancing data integrity and security for sensitive transactions.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, OIDC, RBAC, SAML\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAzure, Microsoft 365, Entra ID, Intune, Microsoft Defender, Azure Policy\n\tMicrosoft Sentinel, Purview\n\n **Other:**\n\tDLP, incident response, collaboration, data-loss prevention, eDiscovery, Records, Insider Risk, device trust, audit frameworks, knowledge articles, team collaboration, HTTP/S, TCP/IP, network fundamentals, Conditional Access, app governance, SharePoint, Teams, Exchange Online, PIM",
  "apply_company": "Ideamine Technologies (Acquired by Netrix Global)"
}