{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Partner Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Full Stack Developer with 13+ years of experience, specializing in **TypeScript**, **API development**, and **Web3 technologies** for high-performance applications in the healthcare and financial industries. Proven expertise in **Solidity**, **EVM**, and utilizing tools such as **Hardhat** and **Foundry** for smart contract development. Strong proficiency in developing robust **SDKs** and implementing seamless **on-chain** and **off-chain** integrations, while leveraging tools like **Postman** for API testing.\nAdept at ensuring effective communication and collaboration with partner engineering teams, fostering strong relationships through **DevRel** practices. Committed to enhancing debugging processes and delivering efficient, scalable solutions. Additionally skilled in **JavaScript**, **Python**, **Flutter**, and deploying applications using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms and proficient in cloud-native deployments on **AWS** and **Azure**. Background in compliance-driven development aligned with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong understanding of model training and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Partner Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained secure APIs using **TypeScript** for advanced functionalities in partnership projects, enabling seamless integration with on-chain and off-chain ecosystems.\nDesigned SDKs to enhance developer experience and foster collaboration with partner engineering teams, ensuring robust communication and efficient usage of technologies such as **Web3** and **Solidity**.\nUtilized **Postman** for API testing and debugging, ensuring reliability and performance across all integrations with partner platforms, achieving a 99% uptime in collaborations.\nLed the implementation of **Hardhat** and **Foundry** for smart contract development, conducting thorough testing and deployment, which resulted in a 30% increase in deployment efficiency.\nCollaborated with DevRel teams to design educational resources, enhancing partner understanding of our APIs and services, boosting engagement by 25%.\nIntegrated **EVM** compatibility into our projects to facilitate broad access and interaction with various blockchain networks and applications.\nExecuted complex debugging processes involving **curl** to interact with various APIs, significantly reducing response time by 40% through optimized requests and error handling.\nCoordinated partner engineering efforts, advocating for user feedback to continually refine offerings, achieving a partner satisfaction rating of over 90%.\nAnalyzed blockchain transaction flows, leveraging relayers to enhance operational efficiencies, thus reducing latency in transaction confirmations by 35%.\nFostered strong communication between internal engineering teams and external partners, streamlining onboarding processes and cultivating long-term relationships that resulted in a 50% increase in collaboration opportunities."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** to build and enhance robust APIs and SDKs for seamless integration with blockchain environments, focusing on **on-chain** and **off-chain** interactions.\nImplemented **Web3** technologies to facilitate decentralized applications, enhancing user engagement with **EVM**-compatible chains while ensuring optimal performance.\nEngaged in **DevRel** activities to foster partnerships with developers, providing technical support and guidance in leveraging blockchain solutions effectively.\nDesigned and executed rigorous debugging processes, using tools such as **Postman** and **curl** to ensure smooth operations and integration of various applications including **Solidity** smart contracts.\nCollaborated with cross-functional teams to align partner engineering efforts with business objectives, improving project outcomes by **30%** through enhanced communication strategies.\nConducted technical workshops and webinars, reaching **over 200** participants quarterly, to educate stakeholders on integrating and utilizing blockchain technologies effectively.\nMonitored and optimized existing integrations to minimize latency by **15%**, ensuring real-time data processing and improved user experience across platforms.\nPioneered the implementation of innovative solutions using **Hardhat** and **Foundry** for efficient smart contract development and testing, achieving significant productivity gains in the development cycle."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** and **Web3** SDK to develop robust API integrations, facilitating seamless interactions with on-chain and off-chain components in the e-commerce platform.\nEngineered solutions leveraging **Hardhat** and **Foundry** for efficient smart contract testing and deployment, maintaining high standards in contract security and performance, achieving a **99%** test coverage rate.\nCollaborated with cross-functional teams to enhance partner engineering efforts, ensuring effective communication and understanding of requirements across diverse stakeholders, leading to a **30%** reduction in project turnaround time.\nApplied debugging techniques and tools like **curl** and **Postman** to troubleshoot API issues, resulting in improved system reliability and enhanced end-user experiences.\nImplemented relayer strategies for efficient transaction handling, optimizing performance by managing **200+** transactions per second during peak traffic.\nCreated comprehensive documentation and training materials for internal teams and partners, boosting understanding and engagement with the platform’s SDK and APIs.\nFostered relationships with strategic partners by providing technical support and solutions tailored to their needs, contributing to a **15%** increase in partner satisfaction metrics.\nMaintained a secure and efficient environment by managing role-based access control (RBAC) and ensuring all integrations comply with best practices for data protection and privacy standards."
    }
  ],
  "skills": "**Programming Languages:**\n\tTypeScript,\n\tPython,\n\tJavaScript,\n\n**Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango,\n\n**Frontend Frameworks:**\n\tReact,\n\tVue,\n\tAngular,\n\n**API Technologies:**\n\tAPI,\n\tcurl,\n\tPostman,\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS,\n\tAWS: Lambda,\n\tAWS: RDS,\n\tAWS: S3,\n\tAzure: App Services,\n\tAzure: Blob Storage,\n\tAzure: SQL Database,\n\n**Databases:**\n\tPostgreSQL,\n\tMySQL,\n\tMongoDB,\n\tRedis,\n\n**DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose,\n\n**Cloud & Infrastructure:**\n\tKeycloak,\n\tOAuth2,\n\tJWT,\n\tNginx,\n\tLet’s Encrypt,\n\tCertbot,\n\n**Other:**\n\tSolidity,\n\tWeb3,\n\tSDK,\n\tEVM,\n\tHardhat,\n\tFoundry,\n\ton-chain,\n\toff-chain,\n\trelayers,\n\tDevRel,\n\tPartner Engineering,\n\tcommunication,\n\tdebugging",
  "apply_company": "Albert Bow"
}