{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly adept Senior Field Engineer with 8 years of comprehensive experience in implementing AI, computer vision, and machine learning solutions, I excel at driving technical projects across diverse settings. My technical expertise includes a solid background in **Linux**, effective troubleshooting methods, and proficient skills in **networking**. I also have hands-on experience with hardware and software installations, ensuring operational efficiency while adhering to safety compliance standards. \nIn addition to my technical skills, I am skilled in creating clear and concise **technical documentation** that enhances communication with clients and stakeholders. My commitment to customer service ensures that client needs are prioritized and met effectively. I bring original strengths in problem-solving under pressure, teamwork, and strong communication skills, making me a valuable asset in both engineering and field settings.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Ensured safety compliance and effective troubleshooting across field operations while installing and maintaining hardware systems and software, utilizing **Linux** for system management and diagnostics.\n- Delivered exceptional customer service by providing technical support for mechanical assemblies, ensuring operational efficiency in civil works and electrical wiring installations.\n- Developed technical documentation for various projects, enhancing team communication and knowledge sharing regarding installation and operational procedures.\n- Implemented machine learning algorithms to improve field data analysis and operational workflows, leveraging advanced **AI** techniques to automate routine tasks and enhance system efficiency.\n- Collaborated on cross-functional teams to drive successful completion of field projects, integrating technology solutions to meet client specifications and industry standards.\n- Executed hardware installation projects, ensuring seamless integration and performance across complex networking environments while adhering to safety regulations.\n- Managed project timelines effectively, demonstrating expertise in mechanical and civil works, completing installations within a **9-week** timeframe and under budget.\n- Trained junior engineers on technical processes and safety compliance, fostering a culture of continuous improvement and shared knowledge.\n- Resolved network-related issues in real-time, improving uptime by **15%** and enhancing overall service delivery.\n- Coordinated with diverse stakeholders to enhance understanding of project requirements and technical needs, contributing to the delivery of effective solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented technical documentation processes for hardware and software installation, enhancing compliance with safety standards and operational protocols.\nProvided technical support and troubleshooting for complex systems, leveraging expertise in **Linux** and networking to ensure optimal performance and reliability.\nCollaborated with cross-functional teams to ensure seamless integration of mechanical assemblies and electrical wiring in field engineering projects, contributing to a **20%** increase in project efficiency.\nEnsured compliance with safety regulations during the execution of civil works, conducting thorough assessments and maintaining high standards of safety compliance.\nDelivered exceptional customer service by addressing technical inquiries and providing clear communication on system installations and troubleshooting methods.\nDeveloped and executed training programs on software and hardware installation procedures, increasing team competency and reducing installation errors by **15%**.\nUtilized innovative solutions in AI and machine learning for automation and predictive maintenance, enhancing operational efficiency in the field.\nConducted field assessments and created detailed reports utilizing AutoCAD for project planning and design, improving project planning accuracy by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented robust troubleshooting strategies, ensuring high performance and reliability of field operations by utilizing **Linux** systems for seamless hardware and software installations.\nLeveraged advanced **machine learning** techniques to optimize field engineering solutions, enhancing service delivery and increasing efficiency by **30%**.\nDeveloped comprehensive technical documentation to facilitate knowledge transfer and ensure compliance with safety standards, improving onboarding time for new team members by **20%**.\nExecuted hardware installations that met stringent safety compliance and customer service expectations, maintaining a **95%** customer satisfaction rate through effective communication and problem-solving techniques.\nApplied expertise in **networking** to troubleshoot and resolve connectivity issues, supporting seamless operations across diverse mechanical and electrical assemblies in field environments.\nEngaged in civil works related to field installations, ensuring that all engineering solutions are aligned with project requirements and specifications, resulting in timely delivery of projects within budgetary constraints.\nUtilized **AutoCAD** to design and modify engineering plans, improving project visualization and execution accuracy.\nEnsured complete adherence to safety compliance regulations during all field activities, leading to a **zero-accident** safety record.\nFostered strong communication with clients and team members to effectively address issues and deliver high-quality engineering support, contributing to successful project outcomes."
    }
  ],
  "skills": " **AI** \n\tAI, computer vision, machine learning, generative AI \n\n **Programming Languages** \n\tPython (FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular) \n\n **Backend Frameworks** \n\tFastAPI, Flask, Django \n\n **Frontend Frameworks** \n\tReact, Vue, Angular \n\n **API Technologies** \n\tN/A \n\n **Serverless and Cloud Functions** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL) \n\n **Databases** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis \n\n **DevOps** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n\n **Cloud & Infrastructure** \n\tAWS, Azure \n\n **Other** \n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Linux, networking, technical documentation, customer service, safety compliance, hardware installation, software installation, troubleshooting, communication, mechanical assemblies, civil works, electrical wiring",
  "apply_company": "UVeye"
}