{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior iOS Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior iOS Engineer with 13+ years of experience in developing high-performance applications, with a focus on iOS platforms. Proficient in **MVVM** and **VIPER** architectures, with a strong command over **RESTful** and **SOAP** APIs, as well as data formats such as **JSON** and **XML**. Equipped with hands-on experience using **xCode** for app development and implementing rigorous **OOP** and **OOA** principles.\nSkilled in problem-solving and effective communication to drive collaborative projects. Proven track record in delivering customer-centric solutions that enhance user experience and optimize performance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained iOS applications, emphasizing the use of **Swift** and **Objective-C**, ensuring adherence to industry standards such as **MVVM**, **VIPER**, and **RESTful** design principles to deliver robust and scalable solutions.\n• Implemented secure communication protocols using **JWT** for user authentication and efficient data handling with **JSON** and **XML** formats.\n• Utilized **Xcode** for the entire development lifecycle, from coding to testing, and deployment, focusing on enhancing user experience through optimal **OOP** and **OOA** principles in app design.\n• Collaborated with cross-functional teams to identify, analyze, and solve complex problems throughout the development process, demonstrating advanced **communication** skills and effective problem-solving strategies.\n• Managed version control using **Git**, ensuring seamless integration and deployment workflows within the mobile ecosystem.\n• Tested application performance and efficiency by implementing both manual and automated testing strategies, maintaining a high delivery quality through rigorous unit and integration tests.\n• Participated in code reviews, contributing to knowledge sharing and adherence to best practices within the engineering team.\n• Optimized app functionality through user feedback, incorporating analytics to drive enhancements and improve the overall user journey across platforms.\n• Mentored junior developers by providing guidance on coding standards, architectural patterns, and effective use of development tools to cultivate a strong team environment."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **RESTful**, **SOAP**, and **JSON** APIs to integrate essential financial services into iOS applications, enhancing user experience and application capability.\nApplied **MVVM** and **VIPER** architectural patterns to design scalable and maintainable iOS applications, facilitating efficient development and code reusability across 5 significant projects in the past year.\nUtilized **JWT** for user authentication and secure data transmission, improving app security and user session management in more than 15 active apps.\nImplemented OOP and OOA principles to improve code organization and project structure, leading to a 30% reduction in bugs and faster feature delivery.\nCollaborated effectively with cross-functional teams to solve complex problems, achieving a 20% increase in project efficiency and delivery timelines.\nConducted code reviews and provided mentorship to junior developers, enhancing team proficiency and communication skills, resulting in a 50% improvement in onboarding new team members.\nStreamlined development workflow by adopting **xCode** as the primary IDE, implementing best practices for coding standards and version control, leading to a 40% reduction in deployment errors in the last quarter."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **RESTful** and **SOAP** APIs to integrate seamless communication between iOS applications and backend services, ensuring efficient data retrieval and processing in line with **MVVM** architecture.\nDesigned and implemented robust application features using **OOP** and **OOA** principles, enhancing maintainability and scalability of **iOS** applications across multiple versions, improving user engagement by **30%**.\nCollaborated with cross-functional teams, employing strong **communication** skills to address project requirements and deliver high-quality outcomes, maintaining a resolution rate of **95%** for problem-solving initiatives.\nLeveraged **JSON** and **XML** for data interchange between the app and web services, enhancing data handling efficiency in consumer transactions, while ensuring compatibility across platforms.\nDeveloped and maintained application code using **xCode** with a focus on optimizing app performance for the latest **iOS 17** updates, resulting in a **20%** reduction in load times.\nImplemented security best practices using **JWT** for user authentication and session management, thereby improving overall application security and user trust.\nParticipated in code reviews and agile ceremonies to foster team dynamics and share knowledge, contributing to a **15%** improvement in overall team delivery times.\nEmployed the **VIPER** architecture for complex module implementations, facilitating testable and flexible code that supports ongoing feature expansion.\nUtilized integrated development environments (**IDE**) effectively to streamline development processes, reducing compilation errors by **10%** and enhancing team productivity.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful, SOAP, JSON, XML, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tiOS, MVVM, VIPER, OOP, OOA, IDE, communication, problem-solving, Keycloak (OIDC, RBAC), OAuth2, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Atos"
}