{
  "name": "Rei Taro",
  "role_name": "Modern C++ Software Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Results-driven Modern C++ Software Developer with over 10 years of experience in designing and delivering backend systems, specializing in financial platforms and asynchronous programming. Proficient in **C++ 20**, **Boost.Asio**, and **FIX protocol**, with a strong focus on unit testing and adherence to object-oriented principles and design patterns. Skilled in UML design and integrating with APIs such as **MetaTrader API**. Excellent in communication and problem-solving, with a proven track record of contributing to impactful projects in top-tier organizations like VISA, Sii Poland, and Reply Polska. Strong background in high-performing APIs, automation tools, and scalable services using **Python** frameworks like **FastAPI**, **Django**, and **Flask** on cloud platforms like **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Modern C++ Software Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **C++ 20** to develop high-performance software solutions, focusing on asynchronous programming and enhancing system efficiency and reliability.\nImplemented **Boost.Asio** for robust networking capabilities, enabling smooth communication in client-server architecture, handling up to **1000** simultaneous connections effectively.\nCrafted unit tests to ensure code quality and functionality adherence, achieving a **95%** test coverage rate through systematic unit testing strategies.\nApplied object-oriented principles and design patterns to create scalable and maintainable software architectures, reducing development time by **30%**.\nIntegrated the **FIX protocol** for standardized messaging in financial transactions, ensuring compliance with industry standards and improving transaction processing speed by **20%**.\nLeveraged the **MetaTrader API** to automate trading strategies, enhancing performance and providing real-time data analysis capabilities.\nDocumented system designs using **UML design** principles, facilitating clear communication of complex structures among team members.\nExhibited strong communication and interpersonal skills, collaborating with cross-functional teams to troubleshoot issues and implement innovative solutions while maintaining a focus on problem-solving strategies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed high-performance applications using **C++ 20** and **Boost.Asio** to enhance system efficiency and responsiveness.\nExecuted unit testing strategies to ensure robust and reliable code, implementing test cases for at least **95%** code coverage.\nLeveraged asynchronous programming techniques to optimize data handling and enhance the scalability of applications.\nIntegrated the **FIX protocol** and **MetaTrader API** to facilitate seamless communication with trading platforms, reducing transaction latency by **30%**.\nApplied **UML design** and object-oriented principles to create maintainable and modular architecture, adhering to industry best practices.\nUtilized design patterns to solve common design challenges, improving code reusability and simplifying future enhancements.\nDemonstrated strong communication skills by collaborating with cross-functional teams, ensuring clarity and alignment on project objectives.\nExhibited problem-solving skills by effectively troubleshooting and resolving technical issues, contributing to a **15%** increase in application performance.\nMaintained clear and concise documentation to facilitate knowledge sharing across the team, enhancing overall project communication and workflow."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **C++ 20** alongside **Boost.Asio** to develop high-performance backend services for trade execution and portfolio management, enhancing trading operations by up to **30%**.\nImplemented robust **asynchronous programming** techniques, optimizing real-time price feed processors using **WebSockets** and **Redis** to deliver low-latency trading data for high-frequency transactions.\nApplied **unit testing** methodologies, including comprehensive test suites with **PyTest**, ensuring a bug-free delivery and adherence to quality standards, resulting in a **20%** reduction in post-deployment issues.\nExecuted effective communication and **problem-solving skills** while collaborating with frontend teams to ensure seamless integration through REST APIs and WebSocket channels, achieving a smoother user experience.\nMaintained strict adherence to regulatory standards including **MiFID II** and **GDPR**, ensuring data security protocols were met without compromising operational efficiency.\nDesigned and implemented job queuing and scheduling solutions using **Celery** and **RabbitMQ**, which boosted backend task execution efficiency by **25%** through improved process management.\nLeveraged strong **interpersonal skills** to engage with team members and stakeholders, fostering a collaborative working environment that nurtured innovative solutions."
    }
  ],
  "skills": "Frontend Frameworks: C++ 20, Boost.Asio\n\n\tBackend Frameworks: FastAPI, Flask, Django, Celery\n\n\tAPI Technologies: REST/gRPC APIs, Microservices, MetaTrader API, FIX protocol\n\n\tServerless and Cloud Functions: AWS (EC2, S3, Lambda), Azure, Docker, Kubernetes\n\n\tDatabases: PostgreSQL, MySQL, MongoDB, Redis\n\n\tDevOps: GitHub Actions, Azure DevOps\n\n\tCloud & Infrastructure: CI/CD, PyTest, Git\n\n\tOther: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, unit testing, asynchronous programming, UML design, object-oriented principles, design patterns, communication skills, problem-solving skills, interpersonal skills, writing skills, verbal skills"
}