{
  "name": "Rei Taro",
  "role_name": "Senior Security Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Security Engineer with over 10 years of experience in cloud security and SOC operations, skilled in threat hunting and incident management. Proficient in security tools and technologies including **AWS**, **Azure**, **Sentinel**, **Splunk**, and **Rapid7**. Strong understanding of security fundamentals and frameworks (SIEM, EDR, DLP, CSPM). Experienced in scripting with **Python** and **PowerShell** to automate security processes. Proven ability to deliver effective security solutions and contribute to collaborative projects within top-tier organizations, such as VISA, Sii Poland, and Reply Polska. Adept at communicating complex security concepts to diverse audiences and fostering team collaboration.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented **cloud security** measures while engineering backend services in **Python** using **FastAPI** to streamline document automation, user onboarding, and reporting workflows.\nDeveloped event-driven solutions with **Celery** and **Redis** to effectively manage asynchronous processing for financial transaction requests, handling over **100,000** transactions per month.\nDeployed microservices on **Azure App Services** and utilized **Terraform** to manage infrastructure as code, ensuring seamless cloud operations in a **100% uptime** environment.\nCreated and maintained data pipelines for regulatory data exchange with **Apache Airflow** and **Azure Functions**, ensuring timely and accurate data flow with a processing time under **5 minutes** for over **1,000** records.\nLed security assessments and integrated **OAuth2** and **Azure AD B2C** for secure, scalable authentication systems protecting against threats in compliance with **ISO 27001** standards.\nPerformed threat hunting and collaborated with cross-functional teams to address system integration challenges, ensuring compliance and overseeing release strategies using tools like **Splunk** and **Sentinel** to monitor security events efficiently."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Azure** for deploying and managing cloud security solutions, ensuring high availability and security of services.\nConducted thorough security audits and vulnerability assessments using tools like **Splunk** and **Rapid7**, resulting in improved compliance with industry standards.\nImplemented **SIEM** solutions to enhance threat detection capabilities, actively monitoring for suspicious activities and anomalies in the environment.\nExecuted threat hunting strategies that reduced incident response times by **30%** through proactive analysis and remediation.\nDeveloped and maintained automated scripts in **Python** and **PowerShell** to optimize security workflows and incident response processes.\nCollaborated effectively with cross-functional teams, enhancing communication and ensuring clear understanding of security protocols and procedures.\nLed the integration of **EDR** and **DLP** solutions, mitigating risks associated with sensitive data handling and improving overall data security posture.\nParticipated in SOC operations, monitoring alerts from **Sentinel** and employing **CSPM** practices to maintain a secure cloud environment."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented robust **cloud security** measures to protect sensitive data in trading applications, ensuring compliance with security standards.\nConducted **threat hunting** exercises and incident responses, leveraging tools such as **Splunk** and **Rapid7** for proactive monitoring and analysis of potential threats.\nUtilized **SIEM** solutions to analyze log data and identify security incidents, enhancing the organization’s threat detection capabilities by **30%**.\nIntegrated **EDR** solutions to monitor endpoint activities, reducing incident response time from **48 hours to 12 hours**.\nDeveloped automated scripts using **Python** and **PowerShell** for security incident reporting and remediation, streamlining processes and improving operational efficiency by **25%**.\nCollaborated with cross-functional teams to enhance **SOC operations** and implement best practices in compliance with regulatory requirements.\nEngaged in continuous communication and collaboration with stakeholders to design and implement effective data loss prevention (**DLP**) strategies, safeguarding against data breaches.\nProvided training and guidance on **Azure** and **AWS** security protocols, ensuring teams are equipped to manage cloud environments securely.\nConducted regular assessments of vulnerability management systems such as **CSPM** to bolster security posture and compliance adherence.\n"
    }
  ],
  "skills": "{",
  "apply_company": "Novanta Inc."
}