{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior MES Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior MES Engineer, I bring 8 years of robust experience in the full-stack development landscape, particularly within the healthcare and financial sectors. I am proficient in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, enabling me to design and implement high-performance solutions. My technical expertise encompasses a variety of frameworks including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. In addition, I have extensive cloud experience with **Azure** and **AWS**, ensuring that my solutions are scalable and secure.\n\nI have a strong understanding of critical industry standards such as **GMP**, **CSV**, and compliance requirements like **HIPAA**, **FHIR**, **PCI DSS**, and **SOC 2**. My hands-on experience in developing enterprise-grade platforms is complemented by my skills in microservices architecture, event-driven systems, and CI/CD automation.\n\nMoreover, I am well-versed in integrating MES systems like **Opcenter**, **PharmaSuite**, and **POMS**. I excel in teamwork and communication, allowing me to collaborate effectively on complex projects. I also possess experience working with machine learning pipelines and workflows using tools such as **MLflow**, **Airflow**, and **Kubeflow**, which adds value to my role in intelligent automation and predictive analytics.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior MES Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Collaborated effectively within cross-functional teams, showcasing strong **teamwork** and **communication** skills to enhance project outcomes and align MES solutions with client objectives.\n- Designed and implemented **Manufacturing Execution Systems (MES)** using **Opcenter** and **Camstar**, streamlining production processes to maintain compliance with **FDA** regulations and **GMP** standards.\n- Managed and optimized **PharmaSuite** applications for real-time monitoring and control of manufacturing processes, ensuring **CSV** (Computer Software Validation) compliance.\n- Led the integration of **POMS** and **XFP** platforms into existing infrastructures, resulting in a **30% reduction** in production downtime.\n- Developed comprehensive documentation strategies in adherence to **FDA** Quality System Regulations, enhancing cross-departmental understanding and operational efficiency.\n- Trained teams on **MES** functionalities, promoting a culture of continuous improvement and knowledge sharing, which improved overall system utilization by **25%**.\n- Conducted system upgrades and migrations with minimal disruption, utilizing project management methodologies to ensure all phases were completed on time and within budget, achieving a **95% success rate** on deployment initiatives.\n- Assisted in the design of automated data collection systems, which improved data accuracy for production metrics by **40%**, thus facilitating better decision-making.\n- Contributed to regulatory audits and inspections, preparing detailed reports and presenting findings, reinforcing compliance with industry standards and practices.\n- Participated in ongoing training programs to stay abreast of new technologies and compliance regulations, ensuring that solutions remained cutting-edge and compliant."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Opcenter** and **PharmaSuite** to streamline the implementation and management of Manufacturing Execution Systems (MES), ensuring compliance with **FDA** regulations and adhering to **GMP** standards.\nCollaborated with cross-functional teams to enhance **Camstar** integrations, focused on improving operational efficiencies and achieving project milestones in a timely manner.\nLed process automation initiatives by leveraging **XFP** for reporting and data collection, resulting in a **30%** reduction in manual efforts across production lines.\nConducted comprehensive validation for **CSV** (Computer System Validation) procedures, ensuring data integrity and system reliability within the manufacturing environment.\nFacilitated effective communication and teamwork among various departments, improving project outcomes and fostering a collaborative work environment.\nDeveloped and maintained documentation related to MES processes and best practices, ensuring alignment with industry standards and internal protocols.\nProvided training and support for staff on MES tools and processes, enhancing workforce capabilities and adoption rates by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized manufacturing execution systems (MES) leveraging expertise in **Opcenter** and **Camstar**, ensuring seamless integration and high performance across production workflows with a focus on **FDA** compliance and **GMP** standards.\nEngineered process automation solutions using **PharmaSuite** and **POMS**, leading to a **30%** reduction in cycle time and enhancing overall production efficiency while maintaining strict adherence to **CSV** regulations.\nCollaborated effectively with cross-functional teams to implement system-wide upgrades and feature enhancements, enhancing system functionality and user experience.\nConducted thorough validation processes for system changes, ensuring compliance with **GMP** and **FDA** requirements, resulting in successful audits and minimizing non-conformities by **25%**.\nDeveloped training materials and conducted workshops for stakeholders, enhancing team knowledge on **MES** technologies and improving internal communication, leading to better teamwork and project execution.\nImplemented monitoring and reporting tools that improved data accuracy and accessibility, reducing troubleshooting time by **40%** and supporting data-driven decision-making.\nFacilitated the integration of **XFP** and other third-party tools into existing systems, optimizing workflows and increasing system compatibility while ensuring effective change management practices.\nSupported continuous improvement initiatives by applying analytical skills and troubleshooting techniques, significantly boosting system reliability and performance metrics.\nLeveraged strong communication skills to liaise with stakeholders, providing updates and gathering feedback effectively, which enhanced project alignment and stakeholder satisfaction."
    }
  ],
  "skills": "**API Technologies:**\n\tMES, PAS|X, Opcenter, PharmaSuite, XFP, POMS, Camstar, FDA, GMP, CSV\n\n**Programming Languages:**\n\tPython (FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, teamwork, communication",
  "apply_company": "Accenture"
}