{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Backend Engineer with 8 years of experience in developing and optimizing high-performance backend solutions using **Node.js**, **TypeScript**, **REST APIs**, **GraphQL**, **SQL**, **NoSQL**, and cloud services like **AWS**. Proven expertise in containerization technologies such as **Docker** and orchestration with **Kubernetes**, enabling rapid deployment and scaling of applications. \nI bring a strong foundation in microservices architecture and event-driven systems, ensuring robust, secure, and compliant applications. My background includes developing enterprise-grade platforms that integrate modern practices and standards. I have successfully led teams in building scalable backend systems aligned with compliance standards including HIPAA and PCI DSS. Adept at implementing CI/CD pipelines to streamline development workflows, I leverage my technical acumen to deliver projects on time and within scope.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained robust **Node.js** back-end services, ensuring high performance and responsiveness for REST APIs and **GraphQL** endpoints across multiple platforms.\n• Utilized **TypeScript** extensively to enhance code quality and maintainability, resulting in a **25%** reduction in bug reports.\n• Designed and implemented SQL and NoSQL databases, optimizing the data models for performance, utilizing **PostgreSQL**, **MongoDB**, and **Redis** to handle large-scale data efficiently.\n• Leveraged **Docker** for containerization of applications, enabling seamless development and deployment across multiple environments with a **50%** quicker setup time.\n• Orchestrated containerized applications using **Kubernetes**, achieving improved resource allocation and scaling capabilities under varying loads.\n• Collaborated with cross-functional teams to define and develop RESTful APIs, achieving **99.9%** uptime and consistent performance metrics.\n• Actively engaged in code reviews and implemented best practices, enhancing code quality and team collaboration, which led to an overall **15%** increase in team velocity.\n• Implemented CI/CD pipelines using modern tools to automate testing and deployments, reducing release time by **30%** and enhancing the continuous integration process.\n• Participated in architectural discussions to transform monolithic applications into microservices, leading to an agile development environment capable of faster feature deployment.\n• Mentored junior engineers in best practices for backend development and architectural standards, improving overall team proficiency in **Node.js** and **TypeScript**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed scalable backend services using **Node.js** and **TypeScript**, ensuring seamless integration with **REST APIs** and **GraphQL** for dynamic data retrieval, enhancing application performance by **30%**.\n• Designed and implemented robust database solutions utilizing **SQL** and **NoSQL** technologies, optimizing data storage and retrieval processes for high-volume financial applications.\n• Deployed containerized applications with **Docker** and orchestrated them in **Kubernetes**, achieving a fault-tolerance rate of **99.9%** and streamlining the deployment process across multiple environments.\n• Led the creation of microservices architecture that improved system maintainability and scalability, effectively supporting a transaction load of over **100,000** per day.\n• Collaborated on cross-functional teams to enhance security and efficiency in financial transactions, implementing best practices in software development and agile methodologies.\n• Contributed to the development of extensive API documentation and communication protocols, increasing developer onboarding efficiency by **25%**.\n• Utilized performance monitoring tools to measure response times and optimize query execution, resulting in a **15%** decrease in latency across critical services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Node.js** for developing robust **REST APIs** and **GraphQL** services, ensuring seamless communication between frontend and backend systems.\nImplemented **TypeScript** to enhance code quality and maintainability across modules, improving team productivity by **30%** through better type safety.\nDesigned and optimized backend architecture for **AWS** cloud services, achieving a **99.9%** uptime across all critical services, facilitating efficient resource management and scalability.\nManaged containerized applications using **Docker** and orchestrated workflows with **Kubernetes**, achieving simplified deployment and environment management that reduced downtime by **25%**.\nDeveloped complex SQL queries and integrated diverse **NoSQL** databases, ensuring efficient data retrieval and management tailored for high-volume traffic scenarios.\nCreated and deployed an automated CI/CD pipeline that enhanced deployment frequency leading to **40%** faster feature rollouts while maintaining production stability.\nCollaborated with cross-functional teams to define and implement coding standards and best practices, leading to reduced bugs by **20%** in production releases.\nMonitored application performance and implemented optimizations that decreased response time by **15%**, contributing to an improved overall user experience.\nParticipated in code reviews and knowledge sharing sessions to foster team learning and encourage the adoption of new technologies and skills."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tNode.js\n\n**Programming Languages:**\n\tJavaScript/TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST APIs, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, NoSQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "TechTree"
}