{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Software Engineer with 10+ years of experience in delivering high-performance software solutions, specifically skilled in **Golang**, **SQL**, and **API** development. Expertise in **SaaS** applications and **DevOps** practices including code review and pair programming to foster collaborative and secure coding environments. Proven ability to create technical roadmaps and manage product development with a proactive and autonomous mindset.\nDemonstrates strong hands-on experience in modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**, while utilizing frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proficient in building and deploying cloud-native applications on **Azure** and **AWS**, and leading enterprise platforms that integrate AI/ML capabilities for enhanced analytics and automation.\nPossesses a robust understanding of microservices architecture, event-driven systems, and CI/CD automation, prioritizing the construction of secure and maintainable solutions that comply with standards like HIPAA, FHIR, PCI DSS, and SOC 2. Experienced in MLOps methodologies, including the development of ML pipelines and the management of production workflows using tools such as **MLflow**, **Airflow**, and **Kubeflow**. Committed to creating systems that are technically proficient and deliver meaningful real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and deployed APIs and microservices for high-traffic applications in **Golang**, ensuring optimal performance and security for health and finance sectors.\n• Developed and maintained **SQL** databases, focusing on data integrity and optimization to support complex queries and reporting needs, enhancing overall system efficiency by **30%**.\n• Collaborated with cross-functional teams in product management to define technical roadmaps for new product features, ensuring alignment with business goals and regulatory compliance.\n• Implemented comprehensive DevOps practices for CI/CD using tools like Kubernetes and Docker, resulting in a **25%** reduction in deployment times through automation and improved code review processes.\n• Conducted pair programming sessions to foster knowledge sharing and improve code quality across the development team, leading to a **15%** decrease in bug rates.\n• Actively participated in identifying and mitigating security vulnerabilities in all systems, enhancing application security posture and meeting compliance standards.\n• Adopted a proactive approach to project management, autonomously leading initiatives to optimize workflows and increase productivity across teams.\n• Researched and integrated third-party SaaS solutions to enhance system capabilities, streamlining processes and improving user experience by leveraging cutting-edge technologies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained robust APIs and microservices using **Golang**, enhancing performance and scalability for high-volume financial applications.\nConducted thorough code reviews, promoting best practices in **DevOps** and boosting collaboration through pair programming to ensure high-quality deliverables for financial software solutions.\nEnsured security best practices were integrated into the development process, proactively identifying and mitigating potential vulnerabilities in financial platforms.\nParticipated in product management discussions, contributing to the technical roadmap and aligning software development efforts with business objectives in a **SaaS** environment.\nImplemented SQL-based solutions for efficient data storage and retrieval, optimizing queries to improve response times by over **30%** on key transactions.\nOrchestrated integration of real-time data processing systems, facilitating transaction monitoring and alerts through event-driven architecture and **API** integrations.\nExercised autonomy in executing complex projects, delivering features on time while maintaining a focus on user engagement and system reliability across **financial applications**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Golang** to design and optimize high-performance APIs for scalable SaaS applications, delivering seamless integrations and enhancing overall system reliability.\nConducted thorough code reviews and implemented pair programming practices to foster collaboration and maintain high-quality standards throughout the development process.\nDeveloped and maintained secure backend services with a focus on security best practices, ensuring protection against vulnerabilities and compliance with industry standards.\nEngaged in proactive product management by defining technical roadmaps and aligning development efforts with business goals, leading to a **30%** reduction in time-to-market for key features.\nEngineered solutions with SQL databases to efficiently handle complex queries and ensure robust data integrity, optimizing application performance under high loads.\nCollaborated with cross-functional teams to enhance workflows through **DevOps** practices, achieving a **25%** improvement in deployment frequency and reducing rollback rates by **15%**.\nDesigned modular architecture for APIs supporting a microservices approach, enabling the implementation of new features without impacting existing functionalities.\nDemonstrated autonomy in troubleshooting and resolving critical system issues, reducing downtime and ensuring the continuous operation of the platform.\nFostered technical mentorship within the team, providing insights into security measures and development best practices to enhance team skillset and code robustness.\nParticipated actively in product strategy discussions to align development objectives with customer needs and market trends, ensuring the product remains competitive and innovative."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Golang, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD, code review, pair programming, security, product management, technical roadmap, proactive, autonomous",
  "apply_company": "Mambu Payments"
}