{
  "name": "Tomasz Lee",
  "role_name": "Fullstack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Fullstack Engineer with 9+ years of experience in developing web-based applications and APIs. Proficient in both frontend and backend development using **Svelte**, **React.js**, and **.NET** technologies. Demonstrated expertise in implementing continuous integration, delivery, and deployment workflows to enhance software quality and operational efficiency. Hands-on experience with various **logging tools** and **monitoring tools** to ensure optimal application performance. Strong problem-solving skills and adaptability, complemented by a collaborative spirit that facilitates effective teamwork and mentoring. Proven record of delivering high-quality solutions using **cloud services** such as **AWS**, as well as advanced testing strategies and version control practices.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Fullstack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed web-based applications utilizing **Svelte** and **React.js** to enhance user engagement, achieving a 25% increase in user satisfaction.\n• Spearheaded backend development by designing RESTful APIs with **.NET 7** and integrating them with **MongoDB**, facilitating seamless data operations.\n• Implemented continuous integration and continuous deployment (CI/CD) strategies using **Azure DevOps**, leading to a **40%** reduction in deployment time.\n• Employed testing strategies and logging tools to ensure code quality and reliability in production environments.\n• Collaborated with cross-functional teams to enhance application features, implementing solutions that improved user experience.\n• Integrated **AWS** services for scalable cloud deployments, contributing to system reliability and performance.\n• Mentored junior developers, fostering a collaborative environment and enhancing team productivity through knowledge sharing.\n• Leveraged **Redis** for caching data, improving response times by **35%** and significantly reducing database load.\n• Designed a microservices architecture using **.NET Core**, resulting in a more maintainable and scalable system.\n• Enhanced data visualizations in the reporting engine by utilizing **D3.js** and **Three.js**, providing interactive experiences for users.\n• Executed performance optimizations on **MSSQL** database queries, achieving a **20%** reduction in average query execution time."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **React.js** to develop engaging web-based applications, enhancing user experience and driving a **25%** increase in user engagement.\nImplemented back-end development strategies with **.NET Core** to create robust RESTful APIs, ensuring seamless integrations with PostgreSQL for real-time data access.\nDesigned and maintained **Svelte** components that improved application performance and user interaction by **15%**.\nExecuted continuous integration and continuous deployment strategies using **GitHub Actions**, leading to a **30%** reduction in production deployment errors.\nDeveloped a powerful microservices architecture utilizing **RabbitMQ** for task orchestration and **Apache Kafka** for event-driven data handling, significantly enhancing system scalability.\nDesigned testing strategies for applications, ensuring high-quality releases and minimizing bugs in production.\nManaged version control effectively through **Git**, ensuring codebase integrity and team collaboration.\nUtilized **Redis** as a caching layer to reduce API call latency, resulting in a **25%** performance boost.\nConducted code reviews and mentoring sessions, fostering a culture of collaboration and skill enhancement within the team.\nCollaborated with stakeholders to gather requirements and set timelines, ensuring project delivery aligned with organizational goals.\nImplemented logging and monitoring tools for enhanced insights into system performance and issue resolution.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and maintained web-based applications using **React.js** and **Svelte**, enhancing user engagement by **30%**.\n• Integrated RESTful APIs to facilitate seamless communication between front-end and back-end, improving data handling efficiency.\n• Implemented robust testing strategies for code quality assurance, leading to a **25%** reduction in bugs during deployment.\n• Collaborated in continuous integration and continuous deployment (CI/CD) processes using **AWS**, optimizing deployment speed by **40%**.\n• Leveraged **version control** tools like Git for efficient project management and collaboration among team members.\n• Enhanced logging and monitoring tools to proactively identify and resolve issues, improving application uptime by **15%**.\n• Mentored junior developers on backend development principles and best practices, fostering a collaborative team environment.\n• Actively participated in code reviews and agile ceremonies to align with project goals and ensure code quality.\n• Adapted to emerging technologies and frameworks to continuously improve development processes and solutions."
    }
  ],
  "skills": " **Programming Languages** \n\t JavaScript, TypeScript, Python, C#, Solidity \n\n **Frontend Frameworks** \n\t ReactJS, Svelte, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices \n\n **API Technologies** \n\t RESTful API, GraphQL, APIs \n\n **Serverless and Cloud Functions** \n\t AWS, Azure \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n **DevOps** \n\t CI/CD pipelines, Continuous integration, Continuous deployment, Continuous delivery, Version control, Logging tools, Monitoring tools \n\n **Other** \n\t UX/UI Design, Git, GitHub, Frontend Technologies, Problem-solving, Adaptability, Collaboration, Mentoring, Testing Tools, Testing strategies"
}