{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled in **solution architecture**, **customer engagement**, and **collaboration**, with a substantial focus on cybersecurity and risk management strategies. Proven experience in technical training and delivering product demonstrations, effectively translating complex technical concepts for diverse audiences. As a seasoned .NET Full Stack Developer with 9+ years in developing and implementing complex applications, I bring expertise in **microservices architecture** and **distributed systems**, utilizing technologies like **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, **.NET**, **C#**, and **cloud services**. Strong ability to streamline development processes and optimize performance while leading projects to successful completion through effective communication and collaboration.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Implemented effective **cybersecurity** measures in the design and development of a web-based customer management platform, ensuring data integrity and user trust.\n• Collaborated with stakeholders to identify customer needs and deliver tailored **solution architecture** using **.NET 7** and **ReactJS**, resulting in a **25%** improvement in user satisfaction.\n• Engaged in **customer engagement** activities by conducting **product demonstrations** that clearly articulated the features and benefits of the platform.\n• Provided **technical training** to clients and internal teams, enhancing their understanding and effective use of the platform, while receiving positive feedback that noted a **40%** reduction in support queries.\n• Participated in creating and responding to **RFPs**, showcasing strong **communication** skills to convey complex technical concepts clearly.\n• Employed **NodeZero** for risk management, analyzing potential vulnerabilities within the platform's infrastructure.\n• Established strong teamwork through **collaboration** with UX/UI designers and software engineers, significantly enhancing the user interface and overall user experience.\n• Designed and implemented a microservices architecture with **.NET Core**, improving scalability and maintainability.\n• Integrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, increasing system resilience and throughput.\n• Utilized **Redis** for data caching, leading to a **35%** reduction in database load and enhanced response times.\n• Developed robust RESTful APIs using **.NET**, connected to a **MongoDB** database for seamless data access.\n• Optimized **MSSQL** database queries and indexing, achieving a **20%** reduction in average query execution time to enhance application performance.\n• Built a reporting engine using **D3.js** and **Three.js** for creating interactive data visualizations, aiding decision-making processes.\n• Secured the application with **JWT-based authentication** and authorization methods to safeguard sensitive information."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Managed customer engagement and collaboration to ensure a deep understanding of client needs, leading to a **30%** increase in sales conversions.\nConducted technical training sessions for clients, effectively demonstrating product capabilities and enhancing customer engagement with the platform.\nDeveloped and presented solution architecture proposals, showcasing the technical aspects of our offerings, resulting in a **20%** reduction in RFP response time.\nCollaborated with cross-functional teams to integrate **NodeZero** solutions into existing systems, strengthening the security framework and risk management practices.\nDesigned and executed product demonstrations tailored to specific customer needs, increasing audience engagement by **25%**.\nChampioned the use of **cybersecurity** best practices throughout the project lifecycle, ensuring compliance and mitigation of potential risks.\nLed discussions on technical requirements with stakeholders, prioritizing effective communication to align project goals with client expectations.\nParticipated in regular code reviews and collaborative sessions with team members to enhance the quality of deliverables and overall team productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Engaged in **customer engagement** by collaborating with clients to identify their needs and deliver tailored solutions, resulting in increased customer satisfaction by **30%**.\n• Conducted **technical training** sessions for clients, enhancing their understanding of product functionalities and leading to a significant reduction in support requests by **15%**.\n• Developed and presented product demonstrations, effectively showcasing solutions and driving sales conversion rates up by **25%**.\n• Collaborated with cross-functional teams to ensure seamless integration of **sales engineering** practices within the overall project lifecycle, improving project delivery speed.\n• Actively contributed to **solution architecture** discussions, applying principles of **risk management** to recommend effective strategies that meet both technical and business requirements.\n• Utilized **NodeZero** for security assessment and compliance, ensuring all solutions adhere to best practices in **cybersecurity**.\n• Participated in the RFP process, leveraging strong **communication** and **collaboration** skills to craft compelling proposals that align with client needs.\n• Improved internal processes for handling product-related inquiries and technical questions, thus optimizing **customer engagement** strategies.\n• Engaged in daily standups and team meetings to foster a culture of **collaboration**, keeping all team members aligned with project goals."
    }
  ],
  "skills": "  \n**Programming Languages**  \n\tPython, JavaScript, TypeScript, C#, Solidity  \n  \n**Frontend Frameworks**  \n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS  \n  \n**Backend Frameworks**  \n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices  \n  \n**API Technologies**  \n\tRESTful API, GraphQL  \n  \n**Serverless and Cloud Functions**  \n\t  \n  \n**Databases**  \n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB  \n  \n**DevOps**  \n\tAWS, Azure, CI/CD pipelines  \n  \n**Cloud & Infrastructure**  \n\t  \n  \n**Other**  \n\tUX/UI Design, Git, GitHub, Redux, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, cybersecurity, sales engineering, solution architecture, NodeZero, RFP, customer engagement, technical training, risk management, product demonstrations, collaboration, communication",
  "apply_company": "Horizon3.ai"
}