{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with over 13 years of experience specializing in modern web technologies, including **JavaScript**, **HTML5**, **CSS3**, **Tailwind CSS**, **Bootstrap**, and **React**. Adept at creating responsive and user-friendly interfaces that enhance UX, leveraging **Figma** for design and prototypes. Proficient in integrating **REST APIs** and managing version control with **GitHub** and **GitLab**. Demonstrated ability to optimize applications for SEO and ensure cross-browser compatibility through thorough **debugging** techniques.\n\nPossessing a strong technical background in frameworks like **Flutter** for mobile development and building solid backends with **Node.js** and **FastAPI**. Experienced in cloud deployments with **AWS** and **Azure**, ensuring scalable and secure application architecture. Committed to compliance with industry standards, including HIPAA and PCI DSS, while pushing the envelope with automated CI/CD pipelines and MLOps strategies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed interactive and responsive user interfaces using **JavaScript**, **React** (17–18), **HTML5**, and **CSS3** while adhering to modern design principles and ensuring an optimal user experience.\nUtilized **Tailwind CSS**, **Bootstrap**, and **Foundation** for styling and layout to enhance application aesthetics and functionality.\nCreated visually appealing prototypes and wireframes in **Figma**, translating designs into pixel-perfect implementations that improve user engagement.\nCollaborated with backend teams to integrate **REST API** services seamlessly into frontend applications, ensuring efficient data exchange and real-time user interaction.\nOptimized existing sites for performance and search engine visibility, applying SEO best practices and debugging techniques to enhance overall application quality.\nImplemented **GitHub** and **GitLab** for version control, maintaining code integrity and facilitating smooth collaboration across multiple teams.\nEngaged in cross-functional collaboration to enhance UI/UX designs, delivering features that meet user requirements and business goals efficiently.\nConducted comprehensive testing and debugging processes to identify and resolve issues, improve application resilience, and ensure a stable user experience.\nLed frontend development efforts for multiple projects, significantly reducing development time by **30%** while maintaining high-quality standards and user satisfaction.\nAnalyzed and monitored application performance metrics, achieving real-time performance improvements and maintaining a **99.9%** uptime across deployed instances."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed interactive front-end applications using **React (18)**, **JavaScript**, **HTML5**, **CSS3**, **Tailwind CSS**, and **Bootstrap**, creating responsive and user-friendly interfaces for financial tools and admin panels.\nCollaborated with designers using **Figma** to enhance UI/UX, ensuring a seamless experience across all platforms.\nImplemented REST API integrations to connect front-end applications with backend services effectively, optimizing data flow and user interaction.\nUtilized **GitHub** and **GitLab** for version control, enhancing collaboration and code management across multiple projects.\nConducted thorough debugging processes to identify and resolve issues, improving the overall application performance and stability.\nIncorporated SEO best practices in web applications to enhance visibility and drive user engagement.\nEmployed modern web practices to maintain code quality and ensure consistent delivery of top-notch user experiences, highlighting the importance of robust front-end engineering."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed intuitive and engaging user interfaces for e-commerce platforms using **React (18)**, **JavaScript**, **HTML5**, **CSS3**, and **Tailwind CSS**, ensuring an optimal user experience across web and mobile devices.\nCollaborated with designers to create responsive layouts and features utilizing **Figma** and **Bootstrap**, enhancing overall UI/UX that adheres to best practices and accessibility standards (WCAG 2.1).\nIntegrated seamless REST APIs to fetch and display data dynamically, optimizing page load speeds by conducting thorough performance debugging and utilizing tools for identifying bottlenecks.\nImplemented comprehensive SEO strategies to boost site visibility and improve organic search rankings, effectively increasing user traffic and conversion rates by **30%**.\nManaged version control and collaboration processes using **GitHub** and **GitLab**, ensuring smooth release cycles and team synergy through continuous integration and deployment practices.\nEnhanced user interactions with advanced CSS animations and responsive design patterns, ensuring that applications are mobile-first and accessible to a diverse audience.\nUtilized **WooCommerce** for seamless integration of e-commerce functionalities, providing users with a streamlined shopping experience and implementing payment workflows with **Stripe** and **PayPal** to facilitate secure transactions.\nParticipated in code reviews and mentor junior engineers on debugging techniques, front-end best practices, and the utilization of modern JavaScript frameworks to foster a culture of continuous learning and improvement.\nStay updated with the latest trends in front-end development and contributed to the overall strategy of the development team to drive quality and innovation in all deliverables."
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tPython\n\t•\tJavaScript/TypeScript\n\t\n **Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\t•\tHTML5\n\t•\tCSS3\n\t•\tTailwind CSS\n\t•\tBootstrap\n\t•\tFoundation\n\t•\tFigma\n\t\n **Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\t\n **API Technologies:**\n\t•\tREST API\n\t\n **Serverless and Cloud Functions:**\n\t•\tAWS: ECS, Lambda\n\t•\tAzure: App Services\n\t\n **Databases:**\n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\t•\tRedis\n\t\n **DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\t\n **Cloud & Infrastructure:**\n\t•\tAWS: RDS, S3\n\t•\tAzure: Blob Storage, SQL Database\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\t\n **Other:**\n\t•\tWordPress\n\t•\tWooCommerce\n\t•\tSEO\n\t•\tUI/UX\n\t•\tDebugging\n\t•\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\t•\tNginx, Let’s Encrypt, Certbot\n\t•\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose",
  "apply_company": "Remote Office"
}