{
  "name": "Rei Taro",
  "role_name": "Senior Quality Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Quality Engineer with over 10 years of experience in automation testing, performance testing, and QA methodologies. Proficient in leveraging **JavaScript**, **TypeScript**, and **Python** to enhance testing frameworks and deliver high-quality software solutions. Experienced in utilizing **Playwright** for end-to-end testing, as well as implementing **CI/CD** practices for streamlined deployments in various **cloud environments** including **AWS** and **Azure**. Strong background in root cause analysis and process improvement, ensuring efficient and effective testing practices. Demonstrated history of successfully driving projects at leading organizations, such as VISA, Sii Poland, and Reply Polska, while consistently delivering impactful results.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Quality Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Employed **Python** for automated testing solutions in conjunction with **FastAPI** to enhance quality processes and documentation workflows.\n• Leveraged **JavaScript** and **TypeScript** for developing robust automated quality assessment scripts, ensuring comprehensive coverage of functionalities.\n• Designed CI/CD pipelines using **Azure** and **AWS** to accelerate the delivery and testing of software products, reducing deployment time by **30%**.\n• Implemented **performance testing** frameworks and conducted **root cause analysis** to identify and mitigate performance bottlenecks in applications.\n• Utilized **Playwright** for end-to-end testing, improving test execution speed by **25%** and increasing test reliability.\n• Championed automation testing methodologies, facilitating a **40%** reduction in manual testing efforts through efficient automation tools.\n• Conducted comprehensive QA assessments and process improvements to elevate software quality metrics by **20%** in cloud environments.\n• Collaborated with development teams to streamline QA strategies while ensuring compliance with industry standards and QA methodologies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** for performance testing and automation testing to enhance quality assurance processes.\nDeveloped robust backend systems in **Python** and **FastAPI** to automate document workflows, streamline user onboarding, and handle complex reporting processes.\nImplemented **CI/CD** practices to ensure efficient and reliable software delivery, significantly reducing deployment times by **30%**.\nCreated event-driven microservices using **Celery** and **Redis**, enabling asynchronous processing of financial data and transaction requests, improving system performance by **25%**.\nManaged the deployment of microservices on **Azure** App Services, leveraging **Terraform** for infrastructure automation to maintain consistent and scalable environments.\nEngineered data pipelines for the secure exchange of regulatory data, using **Apache Airflow** and **Azure Functions** to automate and streamline data flow, achieving a processing time reduction of **40%**.\nPerformed thorough security audits, ensuring compliance with industry standards, and integrated **OAuth2** and **Azure AD B2C** to manage authentication and secure access controls.\nConducted root cause analysis and implemented process improvements based on findings, contributing to a **15%** decrease in defect rates.\nCollaborated effectively with cross-functional teams to ensure smooth system integration, regulatory compliance, and successful release management."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **JavaScript** within **Azure** and **AWS** cloud environments to develop automated testing frameworks, ensuring optimal quality assurance methodologies are consistently applied.\nExecuted comprehensive performance testing strategies using **Playwright** to identify system bottlenecks, leading to a **30%** improvement in application responsiveness.\nConducted root cause analysis to resolve defects and improve overall stability of applications by implementing CI/CD pipelines, enhancing deployment efficiency by **40%**.\nCollaborated with cross-functional teams to streamline automation testing processes, reducing testing cycle time by **25%** through innovative solutions.\nDesigned and integrated **PostgreSQL** databases and **Redis** caching mechanisms to enhance application performance and scalability in testing environments.\nImplemented job scheduling automation with tools like **Celery** and **RabbitMQ**, improving task execution efficiency by **20%**.\nDeveloped and maintained testing suite utilizing **PyTest** and various mock servers to facilitate seamless QA & CI processes, ensuring compliance with internal standards."
    }
  ],
  "skills": "• **Programming Languages**\n\tPython (3.8+), JavaScript, TypeScript, SQL, Bash\n\n• **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n• **Frontend Frameworks**\n\tPlaywright\n\n• **API Technologies**\n\tREST/gRPC APIs\n\n• **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n• **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n• **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n• **Cloud & Infrastructure**\n\tcloud environments\n\n• **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, performance testing, automation testing, QA methodologies, root cause analysis, process improvement, testing tools, PyTest, Git",
  "apply_company": "LexisNexis Legal & Professional"
}