{
  "name": "Tomasz Lee",
  "role_name": "Sales Support Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dedicated Sales Support Engineer with a strong foundation in technical competence, project scope development, and cost analysis. Proven ability to effectively communicate project details and collaborate across teams. Experienced in leveraging tools such as **AutoCAD**, **MS Word**, **MS Excel**, and **Bluebeam Revu** to support engineering projects. Additionally, my background includes over 9 years as a .NET Full Stack Developer, specializing in application design and implementation within a microservices architecture. I possess hands-on experience with technologies such as **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, **.NET**, and **C#**. My expertise extends to optimizing development processes, delivering robust solutions, and ensuring project success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Sales Support Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Technical Competence in **AutoCAD**, **MS Word**, and **MS Excel** to create and manage project documentation and reports.\nConducted project scope development and cost analysis ensuring budgets are adhered to, leading to a cost reduction of **15%** in project expenses.\nUtilized **Fusion** and **Solidworks** for 3D modeling, resulting in an increased efficiency of design review cycles by **30%**.\nProvided project communication and support for Sales teams through detailed technical documentation and presentations, enhancing customer understanding and engagement.\nLeveraged fabrication and metalworking expertise to ensure designs meet client specifications and quality standards.\nCollaborated with cross-functional teams to streamline machining processes, significantly boosting production line efficiency by **20%**.\nDesigned and implemented project deliverables, improving overall project success rates by **25%**.\nParticipated in technical reviews and provided feedback for continuous improvement in design methodologies and tools used within the team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **AutoCAD** and **Solidworks** to perform **3D modeling** for client-specific project designs, enhancing fabrication precision and accuracy by 20%.\nConducted comprehensive **cost analysis** for various project scopes, leading to a 15% reduction in material costs through optimized sourcing strategies.\nManaged and executed project scope development, ensuring alignment with client expectations and technical competencies, resulting in a 25% increase in client satisfaction rates.\nCollaborated with cross-functional teams to facilitate effective **project communication**, leading to a 30% improvement in information flow and project alignment.\nDocumented project specifications and technical details using **MS Word** and **MS Excel**, ensuring clarity and ease of understanding for all stakeholders.\nDeveloped technical presentations and reports using **Bluebeam Revu**, which increased approval rates by 18% during project pitches and reviews.\nProvided technical support and expertise to sales teams, contributing to a **40%** increase in successful project bids and sales closures.\nMentored junior staff in **metalworking** and **machining** techniques, improving technical skill sets within the team and reducing training time by 25%.\nFostered strong relationships with vendors and suppliers to enhance material quality, resulting in a **15%** increase in overall project quality outcomes."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and maintained project scope documentation for sales support processes using **MS Word** and **MS Excel** to enhance overall project communication effectiveness.\nConducted cost analysis for **metalworking** and **machining** processes to ensure competitive pricing and profitability of 15% on new projects.\nUtilized **AutoCAD** and **Fusion** to create detailed technical drawings and models, ensuring accurate design specifications for fabrication projects.\nImplemented **3D modeling** techniques to visualize project designs, streamlining the review process and reducing revision times by 30%.\nCollaborated closely with the fabrication team to optimize workflows and ensure timely completion of projects, resulting in a 25% increase in throughput.\nProvided training and technical support to team members on tools like **Solidworks** and **Bluebeam Revu**, enhancing their technical competence and improving team productivity.\nExecuted project communication strategies to keep stakeholders informed and aligned with project milestones, resulting in improved project satisfaction ratings.\nMonitored project progress and resource allocation to develop insights that informed future project strategy and scope.\nAssisted in the development of project schedules and forecasting tools, leveraging expertise in technical tools to enhance project planning accuracy."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n  **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tGit, GitHub\n\n  **Other**\n\tUX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Metalworking, Machining, Fabrication, 3D Modeling, Fusion, Solidworks, Project Scope Development, Cost Analysis, Technical Competence, MS Word, MS Excel, AutoCAD, Bluebeam Revu, Project Communication"
}