{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior AI Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior AI Engineer with a robust background in Generative AI and Prompt Engineering, leveraging 10+ years of experience in software development to create high-performance solutions. Adept at Content Creation and Expert Acquisition, I understand the intricacies of Auditing and Chat Moderation within AI contexts. Proficient in delivering impactful results while working remotely in a collaborative environment. My strong command of Advanced English enhances my communication capabilities, essential for Teaching and providing effective Feedback in tech-driven projects.\n\nAlongside my AI expertise, I possess extensive knowledge in JavaScript/TypeScript, Python, and **Flutter**, with practical experience across the full stack using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have successfully built and deployed cloud-native applications on **Azure** and **AWS**, leading enterprise platform development that incorporates AI/ML capabilities for real-time analytics and intelligent decision-making. My background in microservices architecture, event-driven systems, and CI/CD automation ensures the creation of secure, maintainable solutions that comply with standards such as HIPAA and PCI DSS. Furthermore, I bring hands-on MLOps experience—from developing ML pipelines to managing production workflows—utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**. Driven by a passion for building systems that deliver substantial real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented robust Generative AI solutions, utilizing frameworks and libraries to enhance content creation and feedback mechanisms in both healthcare and finance sectors.\n• Developed advanced prompt engineering strategies to improve user interactions within AI systems, ensuring smooth chat moderation and a high level of expert acquisition.\n• Conducted thorough auditing processes for AI-generated content to maintain quality and compliance, employing advanced English proficiency to craft clear guidelines and documentation.\n• Delivered training sessions and workshops focused on remote work strategies and best practices for AI implementation, enhancing team skills and collaboration.\n• Built scalable, full-stack solutions using **TypeScript**, **Python (FastAPI)**, and **Node.js**, integrating modern frontends in **React (17–18)**, **Next.js**, and **Vue 3**, while ensuring compliance with standards such as HIPAA and GDPR.\n• Developed cross-platform mobile applications with **Flutter** and **React Native**, achieving a user satisfaction rate of over **90%** for both iOS and Android healthcare applications.\n• Led the re-architecture of monolithic applications into microservices with **Docker**, **Kubernetes (AKS/EKS)**, and **AWS Lambda**, achieving an uptime of **99.99%**.\n• Created cloud-native data architecture using **PostgreSQL**, **MongoDB**, and **GraphQL**, optimizing storage and querying capabilities for datasets exceeding **1 million records**.\n• Designed and deployed machine learning models using **Python (scikit-learn, TensorFlow)** for applications like patient risk prediction, contributing to a **30%** reduction in false positives.\n• Developed MLOps pipelines with **MLflow**, **DVC**, and **Apache Airflow** for efficient model versioning and deployment across development and production environments, decreasing deployment time by **50%**.\n• Integrated AI-driven features into applications, such as smart dashboards and predictive alerts, powered by Azure ML and AWS Sagemaker, resulting in an enhanced user engagement rate by **40%**.\n• Implemented enterprise-level CI/CD pipelines using **GitHub Actions** and **Azure DevOps**, covering over **50 environments** for seamless deployment and security compliance.\n• Delivered complex data visualization tools with **D3.js**, providing real-time insights into financial trends and operational KPIs, leading to strategic decision-making improvements in less than **48 hours**.\n• Collaborated with data scientists to deploy NLP models with **Hugging Face Transformers** for improved document processing efficiency, achieving a **25%** faster processing time.\n• Established comprehensive test strategies using **Jest**, **Cypress**, and **Postman**, ensuring high code quality with over **85%** test coverage across services.\n• Enhanced search capabilities by integrating **Azure Cognitive Search** and **ElasticSearch**, streamlining access to millions of unstructured health records and financial documents."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Leveraged **Generative AI** techniques to design innovative solutions for content generation and user interaction, significantly enhancing user engagement metrics by **30%** within the first quarter.\nUtilized **Prompt Engineering** skills to refine AI models, improving response accuracy by **25%** and ensuring relevant content delivery in various applications.\nConducted thorough **Auditing** of AI models and outputs to align with industry standards, resulting in a **15%** reduction in bias during content creation processes.\nFacilitated **Remote Work** collaboration among cross-functional teams, enabling seamless integration of AI solutions with existing systems, leading to a **20%** increase in project efficiency.\nCrafted instructional content and teaching materials to educate team members on advanced AI techniques, which enhanced overall team competency and knowledge retention by **40%**.\nEstablished a feedback loop for continuous improvement in AI model performance, gathering insights from **10+** users to iterate and enhance chat moderation capabilities within the system.\nOversaw the process of **Expert Acquisition**, identifying top talent in AI/ML to scale up project efforts, resulting in the successful onboarding of **5** new experts.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **GenerativeAI** techniques to develop innovative AI-driven features that enhance user engagement and drive content creation.\nEmployed **PromptEngineering** strategies to refine and optimize AI-generated content, ensuring high-quality outputs that align with user expectations.\nExecuted comprehensive **Auditing** processes on AI models and outputs to maintain content integrity and compliance with industry standards.\nLeveraged expertise in **ContentCreation** to produce engaging and relevant materials that resonate with target audiences.\nImplemented advanced **ChatModeration** algorithms to ensure a safe and respectful user environment, enhancing community interaction and quality.\nApplied **ExpertAcquisition** methods to refine selection criteria for expert contributors, ensuring alignment with project needs and quality benchmarks.\nProvided high-level **Feedback** on AI performance and user interactions, leading to continuous improvements and refinements in AI systems.\nConducted **Teaching** sessions and remote training for team members on AI technologies and best practices, fostering a culture of knowledge sharing and innovation.\nFacilitated **RemoteWork** dynamics, ensuring team cohesion and productivity through effective communication and collaboration tools.\nMaintained a strong command of **AdvancedEnglish** to articulate complex AI concepts and present findings to diverse audiences."
    }
  ],
  "skills": "**Other**\n\tGenerativeAI, PromptEngineering, ContentCreation, ExpertAcquisition, ChatModeration, Auditing, AdvancedEnglish, Teaching, Feedback, RemoteWork\n\n**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\t\n\n**Serverless and Cloud Functions**\n\tAWS (Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n",
  "apply_company": "Mindrift / Toloka"
}