{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with 9+ years of comprehensive experience in designing and implementing robust applications. Proficient in **Kotlin**, **Ktor**, and **PostgreSQL**, with a strong background in **Kafka** and **Docker** for scalable event-driven architectures. Demonstrated expertise in **Google Cloud Platform** and various **Messaging Patterns** to enhance system performance and reliability. Skilled in API Design and utilizing AI-Coding-Tools to streamline the development process. With a proven track record of optimizing code efficiency and collaborating cross-functionally, I am committed to delivering high-quality software solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and developed a robust backend system using **Kotlin** with **Ktor** framework, ensuring high scalability and maintainability.\nImplemented **event-driven architecture** with **Kafka** for seamless data processing and real-time analytics, enhancing system performance by 30%.\nUtilized **PostgreSQL** for efficient data storage and retrieval, optimizing database queries to reduce response times by **25%**.\nContainerized applications using **Docker**, improving development workflows and simplifying deployment across environments.\nLeveraged **Google Cloud Platform** services to manage application infrastructure, enhancing system reliability and uptime by **99.9%**.\nAdopted **Messaging Patterns** for effective communication between microservices, leading to increased responsiveness in the application ecosystem.\nExecuted comprehensive **API Design** for RESTful services, ensuring seamless integration between front-end and back-end components.\nEmployed advanced **data structures** to streamline data handling and processing, improving overall application efficiency by **20%**.\nCollaborated with cross-functional teams to enhance the system design, focusing on user experience and performance optimization.\nDeveloped and maintained CI/CD pipelines for continuous integration and delivery, accelerating release cycles by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Kotlin** and **Ktor** to design and implement robust backend services, enhancing system performance and maintainability.\nDeveloped event-driven architecture leveraging **Kafka** for seamless communication between microservices, improving system scalability by **25%**.\nDesigned and optimized RESTful APIs, integrating with **PostgreSQL** to enable real-time data access and processing.\nEmployed **Docker** for containerization of services, facilitating a consistent development environment and accelerating deployment times by **40%**.\nImplemented CI/CD pipelines within **Google Cloud Platform**, resulting in a **30%** reduction in production deployment errors and streamlined delivery processes.\nCollaborated on architecture design using Messaging Patterns, enhancing modular system design for improved code quality and maintenance.\nConducted tutorials on API Design and event-driven architecture for junior developers, fostering team skill development.\nUtilized data structures effectively to optimize data retrieval and processing tasks, achieving improved response times across microservices.\nLed the integration of AI-Coding-Tools to assist in code generation and optimization, increasing development speed and accuracy."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Designed and implemented event-driven architecture using **Kafka** to optimize data processing, improving system responsiveness by **30%**.\n• Developed backend services with **Kotlin** and **Ktor**, ensuring robust API design that enabled seamless integration with external applications.\n• Managed PostgreSQL databases, achieving a query performance improvement of **25%** through effective indexing and data structure management.\n• Utilized **Docker** for containerization of applications, enhancing deployment consistency and reducing setup time by **40%**.\n• Deployed applications on **Google Cloud Platform**, leveraging cloud services for scalability and reliability, significantly improving uptime.\n• Integrated AI-coding-tools for predictive analysis and smart automation of coding processes, increasing development speed.\n• Collaborated on messaging patterns through implementations using RabbitMQ and **Kafka**, contributing to enhanced communication across services.\n• Engaged in code reviews and provided mentoring to junior developers, ensuring adherence to best coding practices and standards.\n• Participated in Agile methodologies, delivering iterative improvements during sprints and ensuring timely project progress.\n• Delivered comprehensive technical documentation for developed APIs and backend services, improving onboarding efficiency for new team members."
    }
  ],
  "skills": " **Programming Languages**\n\tKotlin, JavaScript, TypeScript, C#, Python \n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, Ktor, .NET \n\n **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies**\n\tRESTful API, GraphQL, API-Design \n\n **Serverless and Cloud Functions**\n\tAWS, Azure, Google Cloud Platform \n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n **DevOps**\n\tDocker, CI/CD pipelines \n\n **Cloud & Infrastructure**\n\tAWS, Azure, Google Cloud Platform \n\n **Other**\n\tUX/UI Design, Git, GitHub, Redux, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, event-driven architecture, Messaging-Patterns, data structures, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, AI-Coding-Tools ",
  "apply_company": "bex technologies"
}