{
  "name": "DANIEL HE",
  "role_name": "Android Developer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-9189a3390/",
  "profile_summary": "Proficient Android Developer with proven expertise in **Android SDK** and **Kotlin**, emphasizing user experience design through robust **wireframes and mockups**. Skilled in test-driven development which enhances application reliability and maintainability. Demonstrated success in mobile development best practices and effective cross-functional collaboration, ensuring high-quality software delivery. Strong communication and organizational skills underpin a collaborative mindset, supported by a solid **GitHub portfolio** showcasing previous work. Additionally, I bring valuable experience in financial services, contributing to the development of user-centric applications that drive efficiency and improve user engagement.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Android Developer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "- Developed and implemented user-focused mobile applications using **Android SDK** and **Kotlin**, enhancing user experience through effective algorithms and design principles.\n- Collaborated cross-functionally with design teams to create wireframes and mockups, leading to a **25% increase** in user satisfaction based on usability testing.\n- Utilized test-driven development (TDD) methodologies, achieving an **85% code coverage** and minimizing bugs in production releases.\n- Engaged in excellent communication practices, ensuring alignment across teams and fostering a collaborative mindset within the development process.\n- Adhered to mobile development best practices, resulting in application performance improvements that led to a **15% reduction** in app load time.\n- Maintained a dynamic **GitHub portfolio**, showcasing projects that reflect proficiency in the latest technologies and frameworks relevant to the Android ecosystem.\n- Achieved organizational excellence by implementing effective project management techniques, ensuring all deliverables were met on time with a **100% project completion rate**.\n- Leveraged experience in financial services to develop secure applications, adhering to industry standards and user privacy regulations."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Leveraged **Android SDK** and **Kotlin** to develop mobile applications, enhancing user experience design and achieving a user satisfaction score of **90%**.\nImplemented test-driven development (TDD) strategies, boosting code quality and reducing bugs by **30%** during initial testing phases.\nCollaborated cross-functionally with design teams to create wireframes and mockups, streamlining the development process and improving the overall project turnaround time by **15%**.\nUtilized version control with **GitHub** to manage and collaborate on code, ensuring seamless coordination across teams.\nMaintained excellent organizational skills for project management, leading to the timely delivery of **5+** major application updates within the fiscal year.\nEngaged in financial services projects, applying mobile development best practices to ensure compliance and security in app deployments."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Utilized **Android SDK** and **Kotlin** to develop and maintain high-quality mobile applications, adhering to **mobile development best practices**.\nImplemented **test-driven development** to enhance code quality, achieving a **30% reduction in bugs**.\nCollaborated cross-functionally with designers to create user-centric applications through wireframes and mockups, ensuring an optimal **user experience design**.\nOrganized and led team meetings to facilitate a **collaborative mindset**, enhancing project progress and communication.\nMaintained an active **GitHub portfolio** to showcase technical work and contributions to mobile development.\nDrew upon **financial services experience** to develop features that improve client engagement, ensuring a user-friendly interface."
    }
  ],
  "skills": "Programming Languages:\n\tKotlin, Java, JavaScript (React, Vue.js, Angular, Pixi.js, Vanilla JS, Node.js, TypeScript), Go, Python, SQL, Swift\n\nBackend Frameworks:\n\tSpring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\nFrontend Frameworks:\n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest\n\nAPI Technologies:\n\tRESTful API design\n\nServerless and Cloud Functions:\n\tAWS Lambda\n\nDatabases:\n\tMySQL, PostgreSQL, Redis, MongoDB\n\nDevOps:\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline\n\nCloud & Infrastructure:\n\tAWS (EKS, RDS, CloudFront, S3), API Gateway, Git, CloudWatch, ELK Stack\n\nOther:\n\tMicroservices, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies, Android SDK, test-driven development, user experience design, wireframes and mockups, cross-functional collaboration, excellent communication, excellent organizational skills, collaborative mindset, English fluency, mobile development best practices, GitHub portfolio, financial services experience"
}