{
  "name": "Mariusz Jan Skobel",
  "role_name": "Fullstack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Full Stack Engineer with 10+ years of experience proficient in **JavaScript**, and skilled in **Ruby**, **Git**, and agile processes. Adept in bridging the gap between front-end and back-end technologies, with hands-on expertise using **React**, **Node.js**, and modern web development frameworks. Proven ability in delivering high-performance software solutions, with a strong focus on open source contributions and AI tooling for enhanced functionality. Experienced in project management and coaching teams to adopt best practices in software development while maintaining clear and effective communication. Demonstrated success in remote work environments, ensuring collaboration and productivity across distributed teams. Committed to building secure and maintainable systems that align with organizational goals and drive real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Fullstack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Leveraged **Ruby** and **JavaScript** to design and implement robust full-stack solutions, enhancing collaboration and clarity within agile teams throughout the development lifecycle.  \n• Coordinated project management activities across teams, ensuring timely delivery of applications and adherence to agile processes, resulting in a **25%** increase in project success rates.  \n• Provided coaching to junior developers, fostering an environment of continuous improvement and technical excellence in development practices.  \n• Communicated effectively with stakeholders to gather requirements and provide updates, leading to improved project transparency and user satisfaction ratings of over **90%**.  \n• Applied AI tooling strategies to enhance application functionality, resulting in advanced features that increased user engagement by **30%**.  \n• Contributed to open source projects, demonstrating commitment to community involvement and enhancing expertise in **Git** workflow management.  \n• Conducted training sessions and public speaking events on best practices in development and emerging technologies in front-end frameworks such as React and Vue.  \n• Embraced remote work tools and practices to maintain team cohesion and productivity, achieving project milestones consistently despite geographical barriers."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **Ruby** to enhance front-end development, creating dynamic, user-friendly applications and increasing customer satisfaction by **35%**.\nEnhanced project management and communication processes using **Git** for version control, ensuring collaborative workflows and reducing code merge conflicts by **50%**.\nApplied agile methodologies to streamline project delivery, leading to a **20%** faster release cycle and improved team collaboration within remote work environments.\nCoached team members on best practices in **open source** technologies, fostering a culture of shared knowledge and skill development.\nDelivered presentations in public speaking settings to effectively communicate project updates and foster team engagement in an agile setup.\nImplemented AI tooling to support innovative solutions in product features, contributing to a **15%** increase in feature adoption rates among users.\nEngaged in regular feedback sessions to communicate project progress and encourage collaboration, improving team morale and productivity in remote work scenarios."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Ruby** and **JavaScript** to build and optimize robust full-stack applications, ensuring best practices in **open source** development and efficient use of **Git** for version control.\nApplied agile processes and effective **project management** techniques to coordinate complex development tasks, fostering team collaboration and timely project delivery in remote work settings.\nEngaged in **coaching** and **public speaking** sessions to share knowledge on cutting-edge **AI tooling** and best practices, enhancing the team's overall technical skillset and communication effectiveness.\nEnhanced application performance through continuous integration and deployment, leveraging **Git** and automated testing frameworks to ensure high-quality code and rapid deployment cycles.\nPromoted effective **communication** within cross-functional teams to facilitate agile processes, ensuring clarity in project goals and status updates for improved team dynamics.\nImplemented error tracking and debugging strategies using modern tools, reducing incident response time by **30%** and increasing overall system reliability.\nLed workshops on agile methodologies, helping to refine team workflows and engage in constructive feedback, resulting in a **20%** increase in productivity.\nSuccessfully managed multiple projects simultaneously, ensuring adherence to deadlines while maintaining a high standard of code quality, resulting in **5+** successful product releases within a single year."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, Ruby, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tAI tooling, MLflow, Airflow, Kubeflow, project management, coaching, communication, agile processes, public speaking, remote work, open source"
}