{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Field Engineer with over 13 years of experience in delivering technical solutions in biomedical and electronic fields. Adept at troubleshooting complex systems and automating processes to enhance efficiency. Proficient in **Windows** and **Networking**, with a solid grounding in **Database** management and customer service excellence. Experienced in integrating **Electrical** and **Mechanical** components to build high-performance applications.\nStrong background in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven ability in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices, event-driven architectures, and CI/CD pipelines. Well-versed in compliance-driven development, aligning solutions with **HIPAA**, **FHIR**, **PCI DSS**, and **SOC 2** standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized advanced **troubleshooting** and **automation** techniques to design and implement full-stack platforms in healthcare and fintech, utilizing **Python (FastAPI)**, **TypeScript**, and **Node.js** alongside front-end frameworks such as **React (17-18)**, **Next.js**, and **Vue 3** with a focus on compliance (HIPAA, FHIR, GDPR, PCI DSS, and SOX).\nExecuted mobile application development for iOS and Android using **Flutter** and **React Native**, integrating **native modules** and managing state through **Provider** and **Redux** to facilitate secure real-time user interactions.\nEstablished CI/CD pipelines for mobile with **Fastlane** and **App Center**, emphasizing test automation, release workflows, and crash analytics via **Firebase Crashlytics** and **Sentry** to ensure high software quality and performance.\nSpearheaded the modernization of legacy systems into **microservices architectures** by implementing **Docker**, **Kubernetes (AKS/EKS)**, and serverless solutions using **AWS Lambda** and **Azure Functions** for scalable, fault-tolerant deployments.\nDeveloped and maintained robust data infrastructure using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, designed to handle heavy data ingestion and real-time analytics for health and finance sectors.\nDeployed machine learning models for risk scoring, fraud detection, and document classification using **scikit-learn**, **PyTorch**, and **TensorFlow**, ensuring real-time inference integrated into operational systems.\nImplemented MLOps workflows utilizing **MLflow**, **DVC**, and **Airflow**, managing entire model training and deployment pipelines in development and production environments.\nIntegrated intelligent features within frontend applications, such as personalized dashboards and predictive analytics powered by machine learning models hosted on **Azure ML** and **AWS Sagemaker**.\nConstructed **DevOps** pipelines with **GitHub Actions**, **CircleCI**, and **Azure DevOps**, ensuring complete test automation, linting, security checks, and multi-environment deployment processes.\nDeveloped advanced data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded** for real-time analysis of financial activities, fraud trends, and operational KPIs.\nCollaborated with ML teams to deploy **NLP models** with **spaCy** and **Hugging Face Transformers** for tasks such as document parsing and anomaly detection, secured through REST APIs.\nDefined and supervised rigorous **testing strategies** across the stack with tools like **Jest**, **Cypress**, **Postman**, and **PyTest**, ensuring coverage at unit, integration, E2E, and contract levels.\nIntegrated efficient search capabilities utilizing **Azure Cognitive Search** and **Elasticsearch**, enhancing flexible querying across complex health and financial datasets."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Automation** and **Troubleshooting** skills to enhance operational efficiency, achieving a **15%** reduction in downtime through system optimizations and proactive maintenance.\nDesigned and implemented complex **Electrical** and **Computer** systems, ensuring seamless integration of **Biomedical** solutions to meet client specifications and industry standards.\nProvided expert **Customer Service** and technical support, assisting clients in resolving **Networking** and **Database** issues, which improved client satisfaction rates by **20%**.\nConducted thorough **Sales** presentations, demonstrating the capabilities of our **Mechanical** and **Electronic** products, leading to a **30%** increase in product adoption.\nCollaborated with cross-functional teams to analyze and troubleshoot system malfunctions, utilizing **Windows** operating systems and modern diagnostic tools.\nEnhanced engineering project deliverables by developing structured processes for **Automation**, resulting in a **10%** improvement in project turnaround times.\nMentored junior engineers on effective **Troubleshooting** techniques, fostering a culture of continuous improvement and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Executed complex troubleshooting and maintenance of biomedical and electronic equipment, ensuring compliance with regulatory standards and customer satisfaction in service delivery.\nDeveloped automation solutions for electrical systems, leveraging **Windows** environments to enhance operational efficiency and minimize downtime for critical medical devices.\nUtilized advanced networking principles to optimize communication between devices, ensuring seamless data transfer and improved system reliability across projects.\nManaged databases for tracking equipment performance and customer interactions, employing rigorous data management practices to support sales and service functions.\nProvided exemplary customer service by offering technical support and solutions for biomedical systems, resulting in a **15%** increase in customer retention and satisfaction metrics.\nCollaborated with sales teams to identify client needs and recommend appropriate technology solutions, contributing to a **20%** growth in annual revenue through effective stakeholder engagement.\nLed field installation and commissioning of automation and electronic systems, adhering to project timelines while ensuring high-quality standards were met.\nTrained junior technicians on troubleshooting and maintenance best practices, improving team efficiency and response times in the field.\nAssisted in the design and implementation of new systems, utilizing a blend of mechanical, electrical, and automation engineering principles to meet client specifications."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tBiomedical, Electrical, Computer, Electronic, Automation, Mechanical, Troubleshooting, Windows, Networking, Customer Service, Sales",
  "apply_company": "myGwork - LGBTQ+ Business Community"
}