{
  "name": "Marcin Karol Kotlinski",
  "role_name": "DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a DevOps Engineer with 8 years of experience, I excel in leveraging **Kubernetes**, **GitOps**, **Terraform**, and **Ansible** to implement efficient infrastructure and deployment strategies. My proficiency in continuous integration and delivery (CI/CD), along with monitoring tools like **Prometheus** and **Grafana**, enables me to ensure high-performance systems that are secure and compliant with standards such as HIPAA and PCI DSS.\nIn addition to my core DevOps skills, I possess a strong scripting capability in **Bash**, **Python**, and am familiar with **Ruby** and **Go**. I approach challenges with a hands-on mentality and an agile mindset, driving successful project outcomes through effective collaboration and problem-solving.\nMy background includes full-stack development experience using **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, allowing me to understand and integrate development processes seamlessly. I've contributed to enterprise-grade platforms with AI/ML capabilities, developing solutions that harness the power of **MLflow**, **Airflow**, and **Kubeflow** for MLOps workflows.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented enterprise-level DevOps pipelines utilizing **Kubernetes**, **GitOps** methodologies, and **Terraform** for infrastructure as code, enhancing deployment efficiency by **40%** through automation and orchestration.\nDeveloped and maintained CI/CD processes using **Ansible** for configuration management, ensuring consistent environments and reducing deployment times by **30%**.\nLed monitoring and alerting solutions with **Prometheus** and **Grafana**, achieving an **80%** reduction in incident response time through proactive system health checks.\nArchitected scalable, secure infrastructures on **Kubernetes** clusters, optimizing resource utilization leading to a **25%** increase in system performance across applications.\nImplemented comprehensive security protocols ensuring compliance with industry standards such as HIPAA and PCI DSS, effectively mitigating vulnerabilities and enhancing system integrity.\nAutomated script development in **Bash**, improving operational efficiency and workflow consistency while supporting system administration tasks and job scheduling.\nTransitioned to cloud-native architecture using **Docker** and **Helm** for packaging applications, resulting in a more flexible deployment process aligned with Agile methodologies.\nCollaborated in a cross-functional Agile environment, contributing to a culture of continuous improvement and innovation in deployment strategies and operational workflows.\nEngaged in hands-on troubleshooting and debugging, utilizing **Python** and **Go** to improve automation scripts and enhance application performance across multiple environments.\nEmbraced an Agile mindset in all development and deployment activities, facilitating better communication and collaboration among team members.\nConducted security audits and assessments to align with **Security Fundamentals**, ensuring robust operational security and compliance across all projects."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **Kubernetes** for container orchestration, ensuring high availability and scalability of financial platforms with **microservices** architecture.\nEmployed **GitOps** practices to streamline deployment processes, improving efficiency and minimizing operational risks in CI/CD workflows.\nAutomated infrastructure provisioning and management using **Terraform** and **Ansible**, achieving a **30%** reduction in deployment time across environments.\nMonitored application performance and infrastructure health with **Prometheus** and **Grafana**, allowing for proactive incident management and enhancing system reliability by **25%**.\nFacilitated compliance by incorporating **Security Fundamentals** into DevOps processes, ensuring compliance standards are met in all configurations.\nDeveloped and maintained scripts in **Bash** to automate routine tasks, improving team productivity by **15%**.\nContributed to the development of financial platforms using **Python** and other languages such as **Ruby** and **Go**, emphasizing coding standards and best practices.\nAdopted an **Agile mindset** to enhance project delivery and team collaboration, resulting in faster iteration cycles and improved product outcomes.\nLed cross-functional teams with a hands-on mentality, ensuring seamless integration between development and operations, consistently meeting **99.9%** uptime targets."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Implemented CI/CD pipelines utilizing **Kubernetes** and **GitOps**, streamlining deployment processes and enhancing operational efficiency by **30%**.\n• Managed infrastructure as code with **Terraform** and **Ansible**, enabling automated provisioning and configuration management across diverse environments, thereby reducing setup time by **25%**.\n• Leveraged **Prometheus** and **Grafana** for monitoring and logging, achieving a **40%** decrease in downtime through proactive issue identification and resolution.\n• Streamlined application deployment processes by utilizing **Helm** and **Argo CD**, promoting consistent releases and rollback strategies for enhanced reliability.\n• Developed scripts in **Bash** to automate repetitive tasks, contributing to a **50%** improvement in team efficiency. \n• Enhanced application security by implementing best practices in **Security Fundamentals** and applying **RBAC** and **OAuth 2.0** to ensure secure access and compliance with GDPR regulations.\n• Maintained and optimized backend services in **Python** and **Go**, focused on scalability and compliance exposure to meet industry standards.\n• Collaborated with cross-functional teams in an **Agile mindset**, ensuring alignment with business goals and promoting rapid iterations to development processes.\n• Enforced coding standards and version control practices, promoting quality and consistency across the codebase with **Ruby** and **Git**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Ruby, Go\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, GitOps, Terraform, Ansible, Helm, Prometheus, Grafana, Argo CD\n\n **Cloud & Infrastructure:**\n\t\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Compliance exposure, Agile mindset, Hands-on mentality, Scripting in Bash, Security Fundamentals"
}