{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Full Stack Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior Full Stack Software Engineer with 13+ years of experience delivering high-performance applications in the healthcare and financial sectors. Proficient in **C#**, **.NET**, **React**, and **SQL Server**, with expertise in building and integrating **APIs**. Experienced in developing both frontend and backend solutions, leveraging technologies like **JavaScript**, **TypeScript**, **Python**, and **Flutter**. Skilled in applying **Azure** for cloud-native deployments and implementing robust **CI/CD** pipelines to enhance continuous integration and delivery processes.\n\nDemonstrated ability to work in Agile environments, fostering strong **team collaboration** and **mentorship** among colleagues. Adept at **unit testing** and problem-solving, ensuring high-quality and compliant code. Strong communicator committed to aligning development with industry standards such as HIPAA and PCI DSS while driving innovative solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C#**, **.NET**, and **React** to design and implement full-stack applications, creating efficient and scalable solutions aligned with Agile methodologies.\nDeveloped and integrated **APIs** that foster seamless communication between front-end and back-end systems, improving data accessibility and user experience.\nEnsured a robust database management using **SQL Server**, focusing on performance optimization and security compliance for sensitive data transactions.\nImplemented **CI/CD** pipelines using modern tools, enhancing the development lifecycle speed by **40%**, and promoting continuous integration practices across deployment workflows.\nConducted unit testing and code reviews, instilling best practices in testing strategies which improved code quality significantly, reducing bug incidents by **30%**.\nCollaborated with cross-functional teams to deliver projects on time, enhancing team collaboration efforts which increased project throughput by **25%**.\nMentored junior developers, fostering skills in **Agile** methodologies and promoting a culture of constant learning and professional growth within the team.\nUtilized effective communication strategies to present complex technical information to non-technical stakeholders, ensuring alignment on project goals and expectations.\nDeveloped and maintained user-friendly data visualization interfaces using **React** and integrated them with back-end services for real-time analysis of operational KPIs.\nEngaged in problem-solving for complex technical challenges, resulting in solutions that improved application performance and user satisfaction by reducing load times by **50%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Utilized **C#** and **.NET** frameworks to modernize core financial platforms, enhancing scalability and performance through microservices architecture, supporting high-volume transactional systems.\n• Developed interactive front-end applications with **React (18)**, ensuring seamless integration with back-end **APIs**, and creating responsive interfaces for financial tools and admin panels.\n• Implemented robust **SQL Server** database solutions for efficient data management and retrieval in application development.\n• Engaged in continuous integration/continuous deployment (**CI/CD**) practices to streamline application development cycles and improve release management outcomes, reducing deployment times by **30%**.\n• Emphasized agile development methodologies, facilitating rapid iterations and fostering a culture of **team collaboration** and **problem-solving** across development teams.\n• Delivered real-time analytics dashboards, enhancing operational decision-making with insights into transactions utilizing **D3.js** and **Power BI Embedded**.\n• Designed APIs for asynchronous communication across critical workflows, ensuring robust integrations with services such as **Azure** and **RabbitMQ** for transaction alerts and compliance efforts.\n• Conducted **unit testing** to maintain code quality and reliability across all developed solutions, achieving a test coverage of over **85%**.\n• Provided mentorship to junior developers, promoting skill development and enhancing team performance through effective **communication**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **.NET** to design and implement robust RESTful **APIs** for seamless integration, ensuring high performance and reliability for the application.\nDeveloped and maintained **React** applications, ensuring responsive and user-friendly interfaces while adhering to best practices and utilizing **unit testing** to guarantee code quality.\nCollaborated in an **Agile** environment, participating in sprint planning, code reviews, and daily stand-ups to drive continuous integration and delivery (CI/CD), enhancing project transparency and team collaboration.\nManaged database interactions using **SQL Server**, ensuring efficient data retrieval and manipulation through optimized queries, which improved application performance by up to **30%**.\nImplemented CI/CD pipelines to automate deployment processes on **Azure**, reducing deployment times from days to **hours** and enhancing overall productivity.\nLed mentorship initiatives for junior developers, fostering an environment of knowledge sharing and skill development in **problem-solving** techniques and software best practices.\nFacilitated effective communication within cross-functional teams, ensuring that all stakeholders were aligned on project objectives and outcomes.\nDesigned features that adhered to unit testing frameworks, enhancing application reliability and maintainability, leading to a **15%** reduction in post-deployment bugs.\nContributed to improving team performance through active participation in code reviews and providing constructive feedback, enhancing overall code quality and team dynamics."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\t.NET, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs, Authentication & Security (Keycloak (OIDC, RBAC), OAuth2, JWT)\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage\n\n **Databases:**\n\tSQL Server, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD (Terraform, Ansible, Helm, Docker Compose)\n\n **Cloud & Infrastructure:**\n\tAzure: SQL Database\n\n **Other:**\n\tUnit testing, Continuous integration, Agile, Problem-solving, Team collaboration, Mentorship, Communication"
}