{
  "name": "Mariusz Jan Skobel",
  "role_name": "Sr. Incident Response Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Sr. Incident Response Engineer with over 10 years of experience in technical troubleshooting, incident response, and project management. Proficient in managing and securing systems using **Microsoft Windows Server**, **SQL Server**, **Active Directory**, **Exchange**, **SharePoint**, **VMware**, **Microsoft Hyper-V**, **SCCM**, and **MDT**. Skilled in network management with expertise in **VPN**, **Dynamic VPN**, **IPsec**, and **Remote Desktop**, ensuring seamless connectivity and communication. Adept at implementing comprehensive backup and disaster recovery strategies, and enhancing security through **MFA (Multi-Factor Authentication)** and **endpoint protection**.\n\nDemonstrated ability to coordinate incident responses efficiently and effectively, with a commitment to customer service and maintaining compliance standards. Experienced in working with **Azure** and **AWS** for cloud-based solutions. Strong background in developing enterprise platforms, bringing a unique perspective from the **Full Stack Development** domain, utilizing **JavaScript/TypeScript**, **Python**, **React**, **Next.js**, **Node.js**, and **FastAPI**. Passionate about driving real-world impact through technology and dedicated to preserving system integrity.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Sr. Incident Response Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Managed incident response processes leveraging **Azure** and **AWS** cloud services, ensuring swift recovery and mitigation strategies for IT infrastructure.  \n• Implemented and maintained secure access protocols using **VPN** and **MFA (Multi-Factor Authentication)** to enhance organizational security across **Microsoft Windows Server**, **Exchange**, and **Active Directory** environments.  \n• Developed and executed backup and disaster recovery strategies for **SQL Server**, **SharePoint**, and VMware systems, achieving **99.9%** uptime during critical operations and incidents.  \n• Conducted technical troubleshooting on endpoint protection systems and network services to resolve incidents efficiently, resulting in an improvement of incident resolution time by **30%**.  \n• Collaborated with teams to establish incident management workflows using **ServiceNow**, ensuring compliance with industry standards and enhancing overall customer service capabilities.  \n• Led the deployment of configuration management solutions with **SCCM** and **MDT**, streamlining system updates and enhancing operational efficiency across the organization by **25%**.  \n• Administered and monitored Citrix environments to ensure remote desktop services were optimized for end-users, with an uptime achievement of **98%** in remote access performance.  \n• Enhanced network security by integrating **Dynamic VPN** and **IPsec** configurations, significantly reducing unauthorized access attempts by over **40%**.  \n• Provided technical support and customer service for incident response tasks, allowing for swift action plans and resolution strategies during security incidents.  \n• Executed project management methodologies to oversee incident response projects, ensuring timely delivery and alignment with organizational goals."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented **Microsoft Windows Server** and **Active Directory** systems for enhanced user management and security protocols, leading to a **30%** reduction in incident response times.\nExecuted troubleshooting of **SQL Server** and **Exchange** environments to swiftly resolve incidents, maintaining system uptime at **99.9%**.\nManaged and configured **SharePoint** services to facilitate team collaboration, improving project management workflows and reducing document retrieval times by **40%**.\nUtilized **VMware** and **Microsoft Hyper-V** technologies for virtualized infrastructure, optimizing resources and increasing service availability to end-users.\nDeveloped and maintained **SCCM** and **MDT** solutions for software deployment and system updates, achieving consistent endpoint compliance across **1,500** devices.\nEngineered secure **networking** models incorporating **VPN** and **IPsec** connections to protect data integrity and confidentiality, achieving **100%** compliant remote access.\nExecuted backup and disaster recovery plans using **NetApp** and **Azure** services, ensuring business continuity and data integrity reduction of potential data loss incidents by **70%**.\nEnhanced security measures utilizing **MFA (Multi-Factor Authentication)** and **endpoint protection** technologies, mitigating unauthorized access risk by **50%**.\nConducted incident response and technical troubleshooting through **ServiceNow**, streamlining incident tracking and resolution processes leading to a **25%** improvement in customer service satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented robust incident response strategies leveraging **Microsoft Windows Server**, **Active Directory**, and **SQL Server** to mitigate risks and enhance platform security protocols.\nManaged and maintained **Exchange** and **SharePoint** environments, ensuring optimal functionality and immediate troubleshooting of user issues by applying effective customer service techniques.\nUtilized **VMware** and **Microsoft Hyper-V** for virtual environment management, including backup and disaster recovery solutions, achieving a **99% uptime** for critical services.\nConducted network analysis and **technical troubleshooting** using **VPN**, **Remote Desktop**, and **Citrix** technologies, significantly improving incident resolution times by **30%**.\nExecuted comprehensive endpoint protection strategies featuring **MFA (Multi-Factor Authentication)**, achieving a **50% reduction** in unauthorized access incidents.\nAdministered **Azure** and **AWS** cloud environments for scalable backup solutions, ensuring data integrity and availability at all times.\nLeveraged **ServiceNow** for efficient incident tracking and management, improving team response times and project management efficiency by **25%**.\nEngineered dynamic **IPsec** VPN solutions to secure remote connections, enhancing data protection for remote desktop users.\nDirected incident response drills and training sessions, resulting in a **40% improvement** in team preparedness and response effectiveness during real incidents.\nDrove systematic application of security protocols in line with incident response standards, ensuring compliance with internal and external regulations."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)  \n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)  \n **API Technologies:**\n\tJWT, OAuth2  \n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)  \n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), SQL Server, Redis  \n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose  \n **Cloud & Infrastructure:**\n\tMicrosoft Windows Server, Active Directory, VMware, Microsoft Hyper-V, Azure, AWS, NetApp  \n **Other:**\n\tAirflow, Kubeflow, Nginx, Certbot, Keycloak (OIDC, RBAC), Backup and disaster recovery, MFA (Multi-Factor Authentication), SCCM, MDT, Networking, Dynamic VPN, IPsec, Remote Desktop, Citrix, ServiceNow, Incident response, Project management, Technical troubleshooting, Customer service"
}