{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Backend Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Backend Developer with 13+ years of experience in delivering high-performance applications in dynamic environments. Proficient in key technologies such as **Java**, **Kotlin**, and **Spring Framework**, alongside hands-on expertise in **Postgresql** and **MySQL** database management. Solid background in **microservices** architecture and experience with CI/CD processes leveraging **Git** and **Gradle**.\nSkilled in deploying cloud-native systems using **AWS**, including services like **S3**, **Fargate**, and **Lambda**. Demonstrated capability in utilizing **Python** for backend logic and backend service integration. Familiar with agile methodologies, having successfully implemented the **Scrum** framework in previous projects.\nAlso experienced in the healthcare and financial sectors, with a strong focus on compliance-driven development adhering to industry standards such as HIPAA and PCI DSS. Committed to maintaining high coding standards and best practices to deliver robust software solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed robust backend solutions using **Java**, **Kotlin**, and the **Spring Framework** to support microservices architectures and enhance scalability.\nImplemented CRUD operations and data management with **PostgreSQL** and **MySQL**, ensuring data integrity and optimal performance in high-traffic environments.\nUtilized **AWS** services, including **S3**, **Fargate**, and **Lambda**, to architect and deploy serverless applications, resulting in reduced operational costs by **30%**.\nCollaborated with cross-functional teams following **Scrum** methodologies to deliver high-quality features on average within **2-week** sprints.\nDesigned and executed unit testing strategies using **Git** for version control, ensuring code quality and reducing bugs in production by **25%**.\nParticipated in continuous integration and deployment processes, facilitating smooth code releases and enhancing deployment frequency by **40%**.\nOptimized application performance through effective caching strategies and database indexing, leading to a **15%** decrease in response time for critical APIs.\nSecured backend services by implementing authentication and authorization protocols, using industry standards to protect sensitive data.\nMaintained comprehensive documentation for backend APIs and services to ensure clarity and enhance team collaboration.\nEngaged in code reviews and mentorship of junior developers to foster a culture of learning and improve overall team performance."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Kotlin** to build scalable back-end services within **Spring Framework**, ensuring high performance for high-volume transaction processing.\nImplemented robust database solutions with **Postgresql** and **MySQL** to manage financial data efficiently, achieving a **30%** improvement in data retrieval times.\nCollaborated with cross-functional teams using **Git** for version control and **Gradle** for building and managing project dependencies, facilitating smooth development processes.\nEmployed **Python** to develop microservices that integrate with existing architectures, streamlining workflows and enhancing system reliability by **25%**.\nParticipated in **Scrum** meetings to align development priorities, which increased team productivity by **15%**.\nDesigned cloud-native applications leveraging **AWS** services such as **S3**, **Fargate**, and **Lambda**, ensuring scalability and cost-effectiveness in application deployment.\nAutomated infrastructure and deployment processes using best practices, achieving a **20%** reduction in deployment time and minimizing downtime during updates."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized microservices for a high-scale backend infrastructure using **Java** and **Kotlin** within the **Spring Framework**, ensuring seamless integration with **PostgreSQL** and **MySQL** databases for data persistence.\nImplemented efficient CI/CD pipelines using **Git** and **Gradle** to facilitate smooth version control and project builds, achieving a **30%** reduction in deployment times.\nEngineered high-performance APIs for service orchestration, providing resilient and scalable backend services, leading to a **25%** increase in user transaction throughput during peak hours.\nUtilized cloud services like **AWS Lambda** and **Fargate** to enhance deployment scalability and management of serverless environments, reducing operational costs by **15%**.\nCollaborated in an agile environment following **Scrum** methodologies, participating in daily stand-ups, sprint planning, and retrospectives to improve team efficiency and project delivery timelines.\nApplied best practices in service design with a focus on high availability, low latency, and robust error handling to ensure system resilience.\nLeveraged **AWS S3** for object storage, enabling scalable and secure data management while enhancing system performance through optimized data retrieval strategies.\nConducted code reviews and provided mentorship on the **Spring Framework** and best practices in backend development, enhancing team skills and maintaining code quality.\n"
    }
  ],
  "skills": " **Programming Languages:** \n\tJava, Kotlin, Python, JavaScript/TypeScript \n\n **Backend Frameworks:** \n\tSpring Framework, FastAPI, Flask, Django \n\n **Frontend Frameworks:** \n\tReact, Vue, Angular \n\n **API Technologies:** \n\tOAuth2, JWT, Keycloak (OIDC, RBAC) \n\n **Serverless and Cloud Functions:** \n\tAWS Lambda, Azure App Services \n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD \n\n **Cloud & Infrastructure:** \n\tAWS: ECS, S3, Fargate, RDS; Azure: Blob Storage, SQL Database; Terraform, Ansible, Helm, Docker Compose \n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Scrum, Nginx, Let’s Encrypt, Certbot, microservices, Gradle, Git"
}