{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Support Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Support Engineer with 8 years of comprehensive experience in **Python**, **SQL**, and **Machine Learning Operations (MLOps)**. Adept in **troubleshooting** and resolving complex issues with a strong emphasis on **problem-solving**, **analytical skills**, and effective **communication**. Versatile in working within **customer-facing roles** and collaborating cross-functionally to enhance data infrastructure and support operational excellence.\n\nMy technical background includes extensive experience in **high-performance solutions** utilizing **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for full-stack development. Proven track record in deploying enterprise-grade platforms integrating AI/ML capabilities to enable predictive analytics and real-time data processing. Deep expertise in cloud environments including **Azure** and **AWS**, as well as a solid foundation in **microservices architecture** and **CI/CD automation**. Passionate about ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2 while delivering robust and secure applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided **technical support** and **troubleshooting** for scalable, full-stack healthcare and financial platforms utilizing **Python** (FastAPI) and **SQL** databases like PostgreSQL and MongoDB.\nDemonstrated **problem-solving** and **analytical skills** by addressing user issues related to cross-platform mobile applications built with **Flutter** and **React Native**, enhancing **customer-facing roles** to ensure seamless user experiences across iOS and Android platforms.\nCollaborated with various teams to maintain and optimize **data infrastructure**, ensuring efficient data ingestion, storage, and querying for large-scale healthcare and financial datasets, while leveraging **machine learning** to enhance system capabilities.\nUtilized advanced **communication** and **collaboration** skills to work effectively with data scientists in integrating NLP models into core services for healthcare document parsing and financial anomaly detection.\nSupported the design and deployment of ML models used for patient risk prediction and fraud detection, showcasing a solid understanding of **machine learning operations** with frameworks like **scikit-learn**, **PyTorch**, and **TensorFlow**.\nContributed to the establishment of CI/CD pipelines for applications, assisting in automated testing, release management, and issue tracking with tools such as **Firebase Crashlytics** and **Sentry**.\nLed the transition from monolithic applications to microservices-based ecosystems using Docker and Kubernetes (AKS/EKS), ensuring high availability and fault tolerance while employing **AWS Lambda** and **Azure Functions** for serverless architecture.\nStreamlined test strategies utilizing tools like **Jest**, **Cypress**, and **PyTest**, ensuring comprehensive coverage of **unit, integration, E2E,** and **contract testing** for web and API services.\nImplemented enterprise-level DevOps processes including security scans and multi-environment deployments through **GitHub Actions**, **Azure DevOps**, and **CircleCI**, focusing on enhancing operational efficiency.\nAnalyzed financial transaction trends by delivering data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded**, providing real-time insights to stakeholders.\nIntegrated advanced search capabilities for millions of health records and financial documents using **Azure Cognitive Search** and **ElasticSearch**, improving accessibility and usability of critical information."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided **technical support** by troubleshooting issues in financial platforms and addressing customer needs, leveraging **Python** and **SQL** for effective problem resolution.\nDemonstrated **problem-solving** and **analytical skills** to identify root causes of performance issues, resulting in a reduction of response times by **30%** across various applications.\nCollaborated with cross-functional teams, effectively communicating insights and updates, ensuring alignment on project goals and timelines, thus improving team collaboration by **25%**.\nEstablished robust **data infrastructure** to support real-time data analysis, enhancing the efficiency of **machine learning** workflows, resulting in increased data processing speeds by **40%**.\nAssisted in the integration and setup of **machine learning operations** (MLOps) pipelines, ensuring seamless deployment of machine learning models into production environments to facilitate data-driven decisions.\nFacilitated training sessions for team members and customers on **machine learning** tools and solutions, promoting a culture of knowledge sharing and continuous improvement.\nConducted regular performance reviews and assessments of the existing systems, leveraging insights to propose enhancements and optimizations that improved system reliability by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Provided **technical support** and troubleshooting expertise for backend services built with **Python** (FastAPI, Django) and **Node.js** (NestJS, Express), ensuring system reliability for over **1,000,000** daily users on a global e-commerce platform.\n- Collaborated with cross-functional teams to analyze and resolve issues, demonstrating **problem-solving** and **analytical skills**, and achieving a **95%** first-contact resolution rate for customer inquiries.\n- Utilized database technologies including **MongoDB**, **PostgreSQL**, and **Redis** to manage data infrastructure, contributing to a **20%** improvement in data retrieval times across e-commerce workflows.\n- Implemented **machine learning** models using **scikit-learn** and **TensorFlow** to enhance product recommendation accuracy, resulting in a **15%** increase in conversion rates through personalized user experiences.\n- Engaged in customer-facing roles, effectively communicating technical concepts and status updates, thereby improving customer satisfaction ratings by **30%**.\n- Supported the deployment of new features using **LaunchDarkly** for feature flags and **Kubernetes** for orchestration, which resulted in a **40%** reduction in deployment times and enhanced system stability during updates.\n- Conducted root cause analysis and troubleshooting for system outages, leveraging strong **collaboration** skills to coordinate with development teams and restore service within **1 hour** on average.\n- Designed and implemented secure data handling protocols using **OAuth 2.0** for role-based access control, ensuring compliance with **GDPR** standards and safeguarding user data integrity.\n- Championed efforts for effective internal communication and knowledge sharing through documentation and team trainings, which enhanced overall team performance and cohesion."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, SQL\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\t\t\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Technical Support, Troubleshooting, Problem-Solving, Analytical Skills, Communication, Collaboration, Customer-Facing Roles, Data Infrastructure, Machine Learning Operations",
  "apply_company": "Chalk"
}