{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Electrical Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Electrical Engineer with 8 years of experience, I bring a robust set of skills in **AutoCAD**, **MicroStation**, and **Bentley** for precise design and modeling, primarily focused on high-voltage systems, grounding systems, bus design, and cable routing. My expertise includes substation design, relay coordination, and compliance with **IEEE** and **NESC** standards. Furthermore, I excel in project leadership, mentoring team members, and effective communication to ensure successful project delivery.\nIn addition to these core skills, I have a strong background in full-stack development, utilizing modern tech stacks such as **JavaScript**, **TypeScript**, **Python**, and **Flutter**. I have led the development of enterprise-grade solutions within healthcare and financial sectors, incorporating **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My cloud proficiency with **Azure** and **AWS**, along with a solid understanding of microservices architecture and CI/CD automation, supports my ability to build integrated systems that meet strict compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Electrical Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Led the design and implementation of high-voltage substations, ensuring compliance with **IEEE** and **NESC** standards for safety and reliability.\n- Developed and optimized physical design layouts, focusing on **grounding systems** and **bus design** to enhance operational efficiency and safety in electrical installations.\n- Utilized **AutoCAD** and **MicroStation** to create detailed cable routing schematics, improving project accuracy and reducing errors in electrical designs by **20%**.\n- Managed projects involving relay coordination and SCADA system integration, enhancing system monitoring and control capabilities.\n- Provided mentorship and guidance to junior engineers, fostering a culture of knowledge sharing and professional growth within the team.\n- Communicated effectively with cross-functional teams, leading project discussions and ensuring alignment on design goals and timelines.\n- Spearheaded multiple successful electrical engineering projects, consistently delivering on time and within budget, improving overall project efficiency by **15%**.\n- Integrated advanced technology solutions and methodologies, including the use of **Bentley** tools, to support innovative project design and execution.\n- Championed safety protocols and best practices in electrical engineering projects, maintaining a pristine record of zero safety incidents over **3 years**.\n- Conducted thorough reviews of engineering designs, ensuring high-quality standards and adherence to project specifications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Led the design and implementation of **high-voltage** substation projects, ensuring compliance with **IEEE** and **NESC** standards, delivering projects on-time and within budget.\n• Developed comprehensive **grounding systems** and **bus design** configurations using **AutoCAD** and **MicroStation**, enhancing safety and reliability across electrical systems.\n• Spearheaded **cable routing** strategies for efficient installation, reducing project lead time by **15%** and ensuring optimal system performance.\n• Coordinated with project teams to integrate **SCADA** systems for real-time monitoring, achieving an **18%** increase in operational efficiency.\n• Mentored junior engineers and fostered effective communication across teams to promote best practices in **physical design** and project execution.\n• Demonstrated project leadership by managing multiple electrical design projects simultaneously, each valued at over **$2M**, driving successful collaboration and timely delivery.\n• Conducted relay coordination studies that improved system stability and reduced outage durations by **20%**, enhancing overall service reliability."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Led project leadership initiatives in the design and optimization of substation architecture, focusing on high-voltage systems and grounding systems to ensure compliance with **IEEE** and **NESC** standards.\nUtilized **AutoCAD** and **MicroStation** for advanced physical design and bus design layout, producing documentation and schematics for high-efficiency energy distribution.\nCoordinated relay systems and integration with **SCADA** systems, enhancing operational efficiency and safety measurements across multiple substations.\nImplemented a robust cable routing scheme that improved system reliability and reduced installation time by **25%**, ensuring minimal downtime during maintenance operations.\nProvided mentorship to junior engineers, fostering skills in grounding systems and high-voltage protocols, which elevated the team’s overall competency level and project efficiency.\nFacilitated clear and effective communication across multidisciplinary teams ensuring project timelines were met, and stakeholder expectations were consistently exceeded.\nExecuted detailed engineering studies and reports, meeting project deadlines and technical requirements while enhancing decision-making processes for electrical infrastructure improvements.\nDeveloped and maintained comprehensive documentation standards for all electrical designs, improving accessibility and quality control in engineering processes by **30%**.\nApplied critical thinking to conduct relay coordination studies, yielding improvements in system protection schemes and fault analysis, essential for maintaining grid reliability.\nCollaborated with external vendors and cross-functional teams in the integration of electrical systems, ensuring adherence to project specifications and timelines."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tmlflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, AutoCAD, MicroStation, Bentley, relay coordination, SCADA, IEEE, NESC, project leadership, communication, mentoring, substation, physical design, high-voltage, grounding systems, bus design, cable routing",
  "apply_company": "Primera Engineers"
}