{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior PowerBI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior PowerBI Engineer with 13+ years of full-stack development experience, leveraging a strong skill set in **PowerBI**, data management, and dashboard development to create insightful and high-performance analytics solutions. Proficient in data transformation and adhering to Microsoft best practices, ensuring web accessibility and high data quality diagnosis. Proven track record of developing robust data models and implementing user permissions to enhance data security and usability. Strong ability in technical documentation and overseeing the testing phase to deliver reliable applications.\nDemonstrated expertise in JavaScript/TypeScript, Python, and Flutter, with hands-on experience in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for both frontend and backend development. Skilled in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices, event-driven architectures, and CI/CD pipelines. Experienced in building AI/ML-powered platforms with a strong background in MLOps using **MLflow**, **Airflow**, and **Kubeflow** while ensuring compliance with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior PowerBI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained advanced data visualization tools using **Power BI Embedded** for real-time analysis of financial activity and operational KPIs, ensuring adherence to **Microsoft best practices**.\nConducted robust **data management** practices to ensure the quality and integrity of datasets, facilitating effective **data transformation** processes for dashboard development.\nCreated interactive dashboards that provided personalized insights, incorporating user feedback to improve accessibility and usability, aligning with **web accessibility** standards.\nCollaborated with cross-functional teams to conduct **data quality diagnosis**, ensuring data accuracy and consistency across reporting platforms.\nBuilt comprehensive ***technical documentation*** to outline data models and processes, promoting transparency and knowledge sharing among team members.\nManaged user permissions and access controls in line with organizational policies, ensuring secured data handling and compliance across data projects.\nEngaged in rigorous testing phases using industry-standard tools, implementing systematic approaches to validate data outputs and ensure reliability of reports.\nActively contributed to optimizing processes for data extraction and loading to improve performance across systems by leveraging efficient data handling strategies.\nUtilized Power BI's advanced features such as DAX for calculated metrics, ensuring accurate representation of complex datasets in visualizations.\nLed training sessions for stakeholders on Power BI best practices and dashboard utilization to enhance decision-making capabilities across the organization."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Power BI** to design and deliver real-time analytics dashboards, providing operations teams with instant insights into transactions and anomalies, improving data-driven decision-making by **30%**.\nManaged data transformation processes while ensuring data quality diagnosis to maintain accuracy and reliability of financial reporting, adhering to **Microsoft best practices**.\nDeveloped and maintained technical documentation for dashboard development and data management strategies, ensuring seamless transitions during the testing phase of projects and onboarding of new team members.\nImplemented user permissions to enhance data security and accessibility, ensuring compliance with industry regulations and best practices in web accessibility.\nBuilt and refined data models tailored to financial reporting needs, leading to a **40%** reduction in report generation time, thus improving operational efficiency.\nConducted thorough testing phases on all dashboards to identify and rectify any issues, ensuring quality delivery and enhancing user satisfaction by providing high-quality data visuals.\nContinued optimization of existing **Power BI** reports, leading to an increased performance improvement by **25%**, and driving user engagement across departments."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and maintained **PowerBI** dashboards, ensuring adherence to **Microsoft best practices** for data accuracy and usability.\n- Implemented robust **data management** strategies that enhance **data quality diagnosis** and enforce data transformation protocols for efficient reporting.\n- Designed and executed **data model building** techniques, incorporating complex queries and optimized connections to facilitate seamless data flows into **PowerBI**.\n- Executed comprehensive **data transformation** processes, aligning with specified requirements and improving overall performance metrics by up to **35%**.\n- Conducted thorough testing phases to validate dashboard functionalities, resulting in a **20% reduction** in deployment errors and enhanced reliability.\n- Created detailed **technical documentation** that outlines processes and workflows for team members, ensuring knowledge transfer and operational continuity.\n- Managed **user permissions** within **PowerBI**, optimizing accessibility while ensuring data integrity and security across the organization.\n- Championed **web accessibility** initiatives, promoting inclusive design standards that improve user experience for all stakeholders, adhering to the **WCAG 2.1** guidelines.\n- Integrated dynamic data sources, allowing for real-time data integration and representation that enhanced decision-making capabilities by **15%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tPowerBI\n\tData management\n\tDashboard development\n\tData transformation\n\tMicrosoft best practices\n\tWeb accessibility\n\tData quality diagnosis\n\tTechnical documentation\n\tUser permissions\n\tData model building\n\tTesting phase",
  "apply_company": "eir evo talent"
}