{
  "name": "Patryk Zaslawski",
  "role_name": "IT Operations Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As an IT Operations Engineer with a robust foundation in Windows Server Administration, Active Directory, and Microsoft 365, I leverage my comprehensive skills in Endpoint Management and Microsoft Autopilot to enhance operational efficiency. Proficient in PowerShell and Bash scripting, I ensure effective automation and management of IT processes. My experience with RMM Systems and a solid understanding of Network Administration enables me to monitor systems proactively and handle incidents effectively. Additionally, my analytical thinking and process-oriented approach, combined with strong collaboration skills, empower me to contribute effectively to team goals. With 8+ years of experience in software engineering, my background includes building high-performance applications using **Python (FastAPI, Django, Flask, SQLAlchemy)**, frontend technologies such as **Angular, Vue, React, and Next.js**, and cloud services like **AWS and Azure**. My expertise in database optimization with **PostgreSQL, MySQL, and MongoDB** further enhances my ability to deliver reliable solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "IT Operations Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Managed and maintained **Windows Server Administration** environments, ensuring high availability and performance of critical IT services.\nAdministered **Active Directory** to manage user accounts, access controls, and authentication processes for over **500** users, enhancing security and collaboration across departments.\nUtilized **Microsoft 365** for streamlined productivity, focusing on integration and user support to increase adoption and optimize workflows by **20%**.\nImplemented **Endpoint Management** solutions, including **Microsoft Autopilot** and **Intune**, to deploy and manage over **300** devices, improving the efficiency of device provisioning and user onboarding processes.\nDeveloped and executed **PowerShell** and **Bash** scripts for automating routine administrative tasks, which reduced manual work by approximately **30%**.\nMonitored system performance using **RMM Systems** and established protocols for **Monitoring and Incident Handling**, helping to identify and resolve issues within **1 hour** on average.\nOversaw **Network Administration** tasks, including configuration and management of firewalls, routers, and switches, maintaining a secure and efficient network environment.\nEvaluated and implemented **Security Solutions** to protect against security threats, ensuring compliance with industry standards and reducing vulnerability incidents by **15%** over **6 months**.\nDemonstrated exceptional **Analytical Thinking** in diagnosing and resolving system outages, contributing to an overall uptime of **99.5%**.\nFostered a culture of **Team Collaboration** by leading regular meetings and discussion forums to streamline IT operations and facilitate knowledge sharing among team members.\nAdopted a **Process-Oriented Work** approach in updating IT documentation and process workflows, achieving a more organized and accessible system for reference and training."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Administered **Windows Server** environments, ensuring optimal performance and reliability for servers supporting critical financial applications.\n• Managed **Active Directory** for user authentication and authorization, enhancing security protocols across the organization by ensuring **RBAC** practices.\n• Executed endpoint management strategies using **Microsoft Intune** and **Microsoft 365**, supporting over **500** endpoints with a focus on security and compliance.\n• Implemented automated scripts using **PowerShell** and **Bash** for system monitoring and incident handling, significantly reducing response times to less than **1 hour** during outages.\n• Developed and maintained robust **RMM Systems** that proactively monitor server health, allowing for predictive maintenance and reduced downtime by **25%**.\n• Collaborated with cross-functional teams to diagnose and resolve network administration issues, improving incident response efficiency through structured **process-oriented work** practices.\n• Established real-time monitoring dashboards utilizing tools like **ELK stack** for centralized logging, which improved visibility into system performance metrics and incident response times.\n• Conducted security assessments and deployed **security solutions** that adhered to best practices, enhancing protection against potential threats and vulnerabilities.\n• Developed training materials and led workshops focused on analytical thinking and team collaboration, fostering a culture of knowledge sharing and continuous improvement.\n• Orchestrated the migration of hardware and software components with the use of **Microsoft Autopilot**, minimizing downtime and ensuring seamless transitions with **100% compliance** to IT governance standards.\n• Engaged in network administration duties, configuring routers and switches to facilitate efficient communication and data transfer within the infrastructure.\n• Led incident handling processes, ensuring timely resolution of system issues while documenting solutions for future reference and troubleshooting guide updates.\n• Optimized process workflows by applying analytical thinking for assessment and improvement, enabling quicker response to user needs and IT demands."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Managed **Windows Server Administration** to ensure stable and efficient server operation, enhancing uptime to **99.9%**.\nAdministered **Active Directory** for user account management, access control, and policy enforcement, reducing unauthorized access incidents by **30%**.\nUtilized **Microsoft 365** tools and integrated solutions to streamline productivity and collaboration, achieving a **25%** increase in team efficiency.\nImplemented **Endpoint Management** strategies, deploying security policies across devices utilizing tools such as **Intune** and **Microsoft Autopilot**, leading to a **40%** reduction in security incidents.\nUtilized **PowerShell** and **Bash** scripting for automation of routine tasks, decreasing manual workload by **50%**.\nOperated and monitored **RMM Systems**, ensuring timely identification of issues and minimizing downtime, which enhanced incident response time to within **15 minutes**.\nConducted **Monitoring and Incident Handling** using state-of-the-art solutions, enabling proactive measures that improved overall system stability by **35%**.\nCollaborated in cross-functional teams, leveraging **Team Collaboration** skills to drive IT projects forward and enhance operational workflows.\nEngaged in **Network Administration**, optimizing performance and security across the organization’s infrastructure, facilitating a **20%** increase in data transfer efficiency.\nApplied **Security Solutions** to safeguard IT systems and sensitive data, ensuring compliance with industry regulations and decreasing vulnerabilities by **45%**.\nDemonstrated **Analytical Thinking** in diagnosing system issues and strategizing effective resolutions, leading to optimized system performance.\nMaintained a **Process-Oriented Work** methodology, ensuring all tasks adhered to established protocols for quality assurance and operational excellence."
    }
  ],
  "skills": " **Backend Frameworks:** \n\tPython (FastAPI, Django, Flask), Spring Boot\n\n **Frontend Frameworks:** \n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:** \n\tREST & gRPC APIs\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **Other:** \n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Windows Server Administration, Active Directory, Microsoft 365, Endpoint Management, Microsoft Autopilot, Intune, PowerShell, Bash, RMM Systems, Monitoring and Incident Handling, Network Administration, Security Solutions, Analytical Thinking, Team Collaboration, Process-Oriented Work"
}