{
  "name": "Mariusz Jan Skobel",
  "role_name": "Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Software Engineer with 10+ years of experience specializing in delivering high-performance software solutions. Proficient in **Java**, **Spring Framework**, and RESTful APIs, with hands-on experience in database management using **MySQL** and **PostgreSQL**. Skilled in building robust and scalable applications using **AWS**, alongside a solid understanding of **Elastic Stack** and **Elasticsearch** for efficient data processing and search functionalities. Experienced in Agile methodologies, fostering collaboration and effective communication within cross-functional teams.\nDemonstrates strong problem-solving abilities and a commitment to quality through extensive unit and integration testing practices. Additionally, possesses a broad technical skillset including **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in leading cloud-native application deployments and implementing microservices architecture, ensuring compliance with industry standards and enhancing system performance and security.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed REST APIs using **Java** and the **Spring Framework**, ensuring performance and reliability standards are met for healthcare and finance applications.\n• Designed and optimized database schemas in **MySQL** and **PostgreSQL** to manage large volumes of data efficiently, achieving a **50%** increase in query performance.\n• Led the adoption of **Agile methodologies**, enhancing team collaboration and communication, resulting in a **30%** reduction in project delivery timelines.\n• Built and maintained search capabilities using the **Elastic Stack** and **Elasticsearch**, facilitating advanced querying and data retrieval across complex datasets.\n• Implemented robust unit testing and integration testing strategies using frameworks like **JUnit** and **Mockito**, increasing code coverage to **85%** and ensuring software quality.\n• Collaborated with cross-functional teams, leveraging strong problem-solving skills to address technical challenges and improve system functionalities.\n• Utilized **AWS** cloud services to deploy applications, ensuring scalability and high availability across diverse environments.\n• Engaged in code reviews and provided mentorship to junior developers, fostering a culture of continuous learning and improvement within the development team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained robust REST APIs leveraging **Java** and **Spring Framework** to ensure seamless integration and data exchange between financial applications.\nDesigned and optimized MySQL and PostgreSQL databases with complex query handling, achieving a **30%** increase in data retrieval speed for financial transactions.\nCollaborated in Agile methodologies, contributing to sprints and enhancing team efficiency by reducing project completion time by **20%** through effective communication and teamwork.\nImplemented comprehensive unit testing and integration testing frameworks, resulting in a **40%** decrease in post-deployment bug reports by ensuring software quality and reliability.\nUtilized **Elastic Stack** for monitoring application performance and metrics, providing insights that led to system optimizations and a **25%** improvement in system response times.\nIntegrated AWS services to enhance application scalability and reliability, effectively managing cloud resources for a peak server load handling improvement of **50%**.\nDemonstrated strong problem-solving skills by addressing complex technical challenges, leading to innovative solutions and streamlined workflows across financial platforms.\nActively participated in collaboration sessions with cross-functional teams to align project goals and deliver high-quality software solutions that meet user needs."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and maintained REST APIs using **Java** and the **Spring Framework** to meet high-performance requirements for scalable applications, ensuring seamless integration with various services.\nApplied **MySQL** and **PostgreSQL** for robust data management, achieving a **30%** improvement in query performance through optimized indexing and efficient schema design.\nCollaborated with cross-functional teams using **Agile methodologies** to enhance project delivery, increasing team efficiency by **25%** through iterative feedback and adaptive planning.\nDesigned and implemented unit and integration tests, leading to a **40%** reduction in critical bugs, thereby improving the overall software quality and reliability.\nUtilized **Elastic Stack** and **Elasticsearch** for advanced search capabilities, enabling users to retrieve data in microseconds and enhance overall user experience.\nDeployed scalable applications on **AWS**, leveraging services like EC2 and RDS, resulting in optimized resource usage and cost reduction of **20%**.\nMaintained clear and effective communication across teams, ensuring alignment on project goals and timelines, which facilitated timely project deliveries.\nEngaged in problem-solving sessions to address complex issues, providing innovative solutions that improved system performance and user satisfaction.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Framework\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile methodologies, Elastic Stack, Elasticsearch, Unit testing, Integration testing, Problem-solving, Collaboration, Communication"
}