{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Webflow Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Webflow Engineer with 13+ years of experience delivering high-performance applications, specializing in **Webflow**, responsive design, SEO, and site integrations. Proficient in **Figma** for design collaboration and skilled in creating seamless user experiences with **microinteractions** and animations. Experienced in analytics to drive site performance and user engagement. \nBacked by a strong foundation in full stack development with expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**, utilizing frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Knowledgeable in building modern, responsive applications with a focus on delivering quality solutions aligned with industry standards. Demonstrated ability to manage complex projects in compliance with standards such as HIPAA and PCI DSS, while fostering strong communication skills in English.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Webflow Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Applied **Webflow** to design and develop responsive web applications, ensuring optimal performance and user engagement through **animations** and **microinteractions**.\nConducted comprehensive **SEO** audits and implemented strategies based on data-driven **analytics** to bolster site visibility and traffic.\nCreated seamless **site integrations** that enhanced user experience and accelerated site functionality, utilizing **Figma** for design prototyping and feedback.\nEnsured responsive design across all devices, improving site accessibility by **30%** as measured by user feedback and analytics.\nLed the optimization of site load times by implementing best practices, achieving a **50%** reduction in average load time.\nCollaborated with cross-functional teams to iterate on design concepts focusing on user-centered approaches, resulting in a **25%** increase in user engagement metrics.\nManaged version control for projects by utilizing tools like Git, ensuring smooth collaboration and code management within the development team.\nDeveloped prototypes with **Svelte** to enhance dynamic features, testing and deploying them successfully across multiple environments.\nConducted client presentations and demos in **English**, ensuring clear communication of project status and technical details."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Webflow** to create visually appealing and responsive designs, ensuring the user experience is optimized for all devices and screen sizes.\nIntegrated SEO best practices into website designs, enhancing visibility and search engine rankings for client projects.\nUtilized analytics tools to gather insights on user behavior, applying data-driven decisions to optimize site performance and engagement.\nCollaborated with cross-functional teams to implement site integrations, enabling seamless connections with third-party services and APIs.\nCreated wireframes and prototypes using **Figma** to visualize design concepts and iterate based on stakeholder feedback, driving efficient project timelines.\nImplemented microinteractions and animations to enrich user experience, resulting in a 30% improvement in user engagement rates.\nEmployed effective delegation and task management techniques to lead a team of 5 designers, ensuring timely project deliveries and high-quality outputs.\nConducted usability testing to validate design decisions and identify areas for improvement, leading to a 20% increase in user satisfaction ratings.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed responsive web pages using **Webflow**, ensuring optimal performance and compliance with **SEO** best practices to enhance search engine visibility and user engagement.\nCollaborated with cross-functional teams to integrate analytics tools for monitoring user behavior and site performance, driving data-informed decisions for continuous improvement.\nUtilized **Figma** to create wireframes and interactive prototypes, facilitating effective communication of design concepts and iterative feedback from stakeholders.\nImplemented microinteractions and animations for engaging user experiences, enhancing user retention and interaction across various web components.\nExecuted site integrations with third-party services, ensuring seamless data exchange and expanding platform capabilities to meet evolving business needs.\nApplied responsive design principles to create layouts that adapt to various screen sizes and devices, guaranteeing a consistent user experience across all platforms.\nUtilized **Svelte** for building high-performance, reactive user interfaces, improving site speed and responsiveness for end-users.\nManaged multiple projects simultaneously, demonstrating strong organizational skills and an ability to prioritize tasks effectively in a fast-paced environment.\nCommunicated fluently in English, collaborating with global teams and presenting design strategies clearly and effectively."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\t\n**Frontend Frameworks:**\n\tSvelte\n\t\n**Design & Prototyping:**\n\tFigma, responsive design, microinteractions, animations\n\t\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\t\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\t\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\t\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\t\n**Analytics & SEO:**\n\tanalytics, SEO\n\t\n**Other:**\n\tproficiency in English",
  "apply_company": "HKR"
}