{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Customer Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Customer Engineer with 13+ years of experience in delivering secure and high-performance applications, with a focus on **SQL**, **Python**, **Cloud**, and **APIs**. Proficient in **Cloud Security Posture Management** and **Data Loss Prevention**, ensuring compliance with data privacy regulations and security best practices. Experienced in **Security Information and Event Management** and **Vulnerability Management** to enhance system integrity and customer trust. Adept at project management and building strong customer relations, enhancing user experience through effective technical troubleshooting.\n\nDemonstrated expertise in developing robust solutions utilizing **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven ability in architecting and deploying AI/ML-integrated platforms within cloud environments like **AWS** and **Azure**, leveraging modern methodologies such as microservices and event-driven architectures, as well as implementing CI/CD pipelines. Strong background in **MLOps** practices with tools including **MLflow**, **Airflow**, and **Kubeflow**, effectively aligning innovative solutions with compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **SQL** to design, maintain and optimize databases, ensuring data privacy and security across all applications.\nImplemented robust **Python** solutions to enhance cloud security posture management while ensuring compliance with data loss prevention regulations and best practices.\nManaged cloud resources and security policies to safeguard sensitive information, utilizing modern **Cloud** technologies to protect against data breaches.\nDeveloped and exposed **APIs** and **Web Services** that facilitate secure communications between client applications and backend services, maintaining data integrity and privacy.\nLed project management efforts to coordinate cross-functional teams, enhancing collaboration and customer relations through effective communication and mentoring.\nProvided technical troubleshooting support to resolve complex issues related to cloud security, data privacy, and system vulnerabilities, ensuring prompt and effective resolution.\nCommunicated project statuses and technical details to stakeholders, facilitating transparency and alignment on project goals and customer needs.\nEngaged in continuous mentorship of team members, fostering growth and enhancing technical skills within the engineering team.\nDesigned advanced data privacy frameworks to align with organizational policies and industry standards, ensuring protection of sensitive customer data throughout the project lifecycle."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** to analyze and optimize database performance in core financial applications, ensuring efficient data handling and reporting.\nImplemented robust data privacy and loss prevention strategies in the architecture of financial platforms, aligning with regulatory standards and enhancing customer trust.\nLeveraged **Python** for developing secure ETL pipelines to ingest financial data, maintaining compliance with data security frameworks and improving data integrity across systems.\nManaged **Cloud Security Posture Management** initiatives across multiple projects, safeguarding sensitive financial data while maintaining compliance with security protocols.\nProvided technical troubleshooting support for API integrations within financial services, successfully resolving 95% of incidents within an 8-hour window to enhance operational efficiency.\nConducted regular vulnerability management assessments on financial applications using **Web Services**, achieving a **30%** reduction in potential security risks over a 6-month period.\nMentored junior engineers on data privacy best practices, resulting in a **40%** increase in team comprehension and adherence to security protocols.\nFacilitated effective communication among cross-functional teams, ensuring seamless project management and delivery timelines were met at a **90%** success rate.\nDeveloped and maintained documentation for APIs, enhancing customer relations by providing comprehensive resources that improved integration experiences for third-party clients.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **SQL** to design and optimize backend services, ensuring robust data management and compliance with **Data Privacy** standards within the e-commerce platform.\nImplemented **Cloud Security Posture Management** strategies to maintain high availability and security of services, facilitating smooth and secure project management for customer-facing applications.\nDeveloped comprehensive APIs and web services that enhanced customer interactions, achieving a **40%** reduction in response time across critical e-commerce workflows.\nEngineered effective **Vulnerability Management** protocols, ensuring that all systems remained compliant with security standards and protected against data loss, resulting in a **25%** decrease in reported vulnerabilities.\nCoordinated integration of **Security Information and Event Management (SIEM)** tools to monitor and respond to security incidents, improving incident response times by **30%**.\nProvided technical troubleshooting and customer relations support, improving customer satisfaction scores by **15%** through effective communication and problem resolution.\nMentored junior engineers in best practices for secure coding and data management, fostering an environment of learning and technical excellence.\nManaged projects with significant cross-team collaboration to align technical solutions with customer needs, showcasing strong project management skills that resulted in a **20%** increase in project delivery efficiency.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, SQL\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **API Technologies:**\n\tAPIs, Web Services\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm\n\n **Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Data Loss Prevention, Data Privacy, Cloud Security Posture Management, Security Information and Event Management, Vulnerability Management, Project Management, Customer Relations, Technical Troubleshooting, Mentoring, Communication, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Cyera"
}