{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior PHP Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior PHP Engineer with 13+ years of experience in delivering high-performance applications, specializing in **PHP**, **Magento**, **Laravel**, and **Alpine.js**. Proficient in **API** development, ensuring robust integrations and seamless user experiences. Skilled in implementing **Git** for version control and utilizing **JIRA** for efficient project management.\n\nSolid expertise in **React**, allowing for dynamic and responsive web applications. Experienced in agile methodologies, collaborating with cross-functional teams to drive project success. Demonstrated ability to deploy applications on **AWS**, leveraging cloud services to enhance scalability and performance.\n\nIn addition to core PHP skills, possess hands-on experience with **Flutter**, **JavaScript/TypeScript**, **Node.js**, and various backend technologies including **FastAPI** and **Django**. Proven track record in building AI/ML-powered platforms and maintaining compliance with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **PHP** and **Laravel** to design and build robust web platforms for eCommerce and content management, ensuring seamless integration with third-party services and APIs.\nEnhanced user experiences by implementing dynamic features using **Alpine.js**, successfully increasing user engagement metrics by **25%** over an **8-month** period.\nExecuted unit testing and integration testing using **PHPUnit**, improving code reliability and reducing bug reports by **30%**.\nUtilized **Git** for version control and collaborated within the team through **JIRA**, ensuring adaptive project management and sprint planning.\nDeveloped API endpoints for **Magento** and **Shopify**, facilitating data exchange with quick response times optimized for eCommerce transactions.\nUtilized **AWS** for cloud hosting solutions, architecting systems to ensure scalability and availability, effectively reducing operational downtime by **15%**.\nImplemented responsive design principles using **React**, successfully delivering front-end solutions that adhere to the latest standards, including **React 18**.\nAdapted to diverse project requirements by applying TALL stack solutions to create interactive and user-friendly web applications, resulting in a **40%** reduction in development time across projects.\nCollaborated with cross-functional teams to refine project objectives and user stories, leading to the successful launch of **3 major projects** last year that met strict deadlines and criteria.\nAutomated development workflows with DevOps best practices using **GitHub Actions**, enhancing continuous integration efforts and deployment efficiency.\nIntegrated feature feedback and analytics systems to track performance, allowing for data-driven decisions to enhance user interface experience and backend processes."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented robust server-side solutions using **PHP** and **Laravel**, contributing to the development of e-commerce platforms with **Magento** and **Shopify**.\nLed the integration of **API** services, ensuring seamless functionality and data exchange across platforms, enhancing transactional efficiency by **30%**.\nDeveloped dynamic user interfaces using **Alpine.js** in conjunction with **React**, optimizing front-end performance and improving user engagement metrics by **25%**.\nUtilized **Git** for version control, ensuring effective collaboration within the development team and maintaining high code quality through code reviews.\nManaged project workflows with **JIRA**, facilitating efficient task tracking and project progress updates for cross-functional teams, leading to a reduction in project completion time by **15%**.\nConducted extensive testing using **PHPUnit**, ensuring the delivery of high-quality software with less than **2%** defect rates in production.\nIntegrated CI/CD pipelines leveraging **AWS** services to streamline deployment processes and enhance application robustness and scalability.\nOptimized performance and reduced load times for web applications by **40%** through strategic refactoring and resource management."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and maintained web applications using **PHP** (7.x), **Laravel** (8.x), and **TALL** stack (Tailwind CSS, Alpine.js, Livewire) to deliver high-quality solutions for e-commerce.\n• Engineered robust backend services with **Magento** to support a scalable e-commerce infrastructure, ensuring high availability and performance across product catalog and order management systems.\n• Implemented RESTful **API** integrations with **Shopify** to facilitate seamless interactions and transactions between platforms, conducting over **100** successful integrations.\n• Utilized **Git** for version control and collaboration, managing code across multiple projects while employing **JIRA** for tracking progress and managing agile workflows effectively.\n• Conducted unit testing and debugging using **PHPUnit** to ensure application reliability and performance, maintaining a minimum of **90%** code coverage.\n• Employed **AWS** services for application deployment and scaling, achieving a **30%** reduction in load times through efficient resource management and auto-scaling strategies.\n• Developed CI/CD pipelines to automate deployments, ensuring consistent delivery and updates of features with minimal downtime.\n• Collaborated cross-functionally to optimize UI/UX using **React** for dynamic front-end implementations, enhancing user engagement and satisfaction.\n• Implemented analytics and monitoring solutions to track user behavior and application performance, resulting in a **15%** increase in conversion rates from targeted optimizations."
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tLaravel, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Alpine.js, Vue, Angular, Livewire\n\n **API Technologies:**\n\tAPI\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tJIRA, PHPUnit, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, MLflow, Airflow, Kubeflow, Shopify",
  "apply_company": "Cloud Bridge"
}