{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Customer Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Customer Engineer with over 10 years of experience delivering high-performance software solutions. Expert in **Jira Service Management** and adept in providing exceptional **customer service** and **helpdesk** support. Proficient in debugging, developing, and managing applications utilizing **JavaScript**, **Python**, and **SQL**, with hands-on expertise in **ETL** processes and **GraphQL** for efficient data handling. Skilled in cloud platforms including **AWS**, **Azure**, and **GCP**, ensuring robust deployments and integrations in various environments.\n\nExperienced in building enterprise-grade solutions while maintaining high standards of documentation and collaboration. I bring a solid foundation in creating low-code applications and enhancing user experiences in the automotive sector. Passionate about leveraging technology to deliver impactful outcomes for customers and stakeholders.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tProvided exceptional customer service and support for technical issues, utilizing **Jira Service Management** to track and resolve helpdesk inquiries efficiently, ensuring timely responses to over **100** customer requests weekly.\n•\tDeveloped and maintained robust SQL databases, optimizing queries to manage data for various applications while ensuring adherence to performance standards for **100+** concurrent users.\n•\tImplemented **ETL** processes to streamline data ingestion, transformation, and loading for analytical needs, resulting in a **30%** increase in reporting speed.\n•\tUtilized **Python** and **JavaScript** for scripting and automation tasks to improve system efficiency and reduce manual workload by **40%**.\n•\tCollaborated with cross-functional teams to deliver seamless integrations with cloud services, including **AWS**, **Azure**, and **GCP**, ensuring high availability and scalability of applications.\n•\tConducted thorough debugging of applications, identifying and resolving issues in real-time to maintain optimal function and performance levels for users.\n•\tProduced clear documentation for system processes and user guides, facilitating better understanding and usage among the customer support team.\n•\tDesigned low-code solutions to empower non-technical staff to handle basic customer service requests, thereby enhancing the service team's responsiveness.\n•\tApplied **GraphQL** for efficient data fetching, reducing the average load time of customer-facing applications by **25%**.\n•\tTrained staff on best practices for customer interactions and technical troubleshooting to elevate overall service quality and user satisfaction ratings."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **AWS**, **Azure**, and **GCP** to support cloud-based infrastructure and improve overall system efficiency and availability.\nImplemented helpdesk support strategies through effective use of **Jira Service Management**, improving incident resolution time by **30%**.\nDeveloped and maintained backend services using **JavaScript** (Node.js) and **Python**, facilitating seamless integration with database systems and ETL processes for data management.\nExecuted SQL queries for data analysis and reporting, enhancing customer support insights and decision-making capabilities.\nAutomated data ingestion and transformation processes through ETL frameworks such as **Apache Airflow**, reducing data processing time by **50%**.\nOptimized customer service operations by deploying low-code solutions, accelerating development cycles and elevating user experience.\nManaged project documentation for complex technical solutions ensuring clarity and compliance with project goals and standards.\nProvided debugging expertise within a collaborative environment, fostering knowledge sharing and continuous improvement in problem-solving approaches for customer-related issues."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and **Python** to develop and maintain comprehensive helpdesk solutions, enhancing customer support efficiency by over **30%** through streamlined ticketing workflows.\nManaged and configured **Jira Service Management** for tracking and resolving customer issues, resulting in a reduction of resolution times by **25%**.\nExecuted ETL processes to migrate and transform data, ensuring data quality and accessibility in service operations, achieving seamless integrations with **AWS**, **Azure**, and **GCP**.\nEnhanced database performance and reliability by implementing SQL queries and optimizing database structures, contributing to an overall system uptime improvement of **98.5%**.\nDeveloped low-code solutions for internal tools, increasing deployment speed by **40%** while maintaining high standards of documentation for process visibility and knowledge sharing.\nProvided exceptional customer service support, troubleshooting and debugging technical issues, and receiving a customer satisfaction score of **95%**.\nCollaborated with cross-functional teams to leverage **GraphQL** for efficient data fetching, reducing the necessary data request size and improving UI response times.\nDesigned and executed automotive software solutions tailored for client needs, capitalizing on **automotive** standards to enhance user experience and system performance.\nEstablished documentation standards to ensure clarity in processes and workflows, aiding in the onboarding of new team members and improving overall team efficiency by **20%**."
    }
  ],
  "skills": "helpdesk, Jira Service Management, JavaScript, Python, SQL, ETL, GraphQL, database, AWS, Azure, GCP, debugging, low-code, automotive, documentation, customer service,\n\n**Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tGraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, documentation, customer service",
  "apply_company": "SPREAD GmbH"
}