{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Backend Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a skilled Backend Developer with 8 years of experience, I excel in designing and implementing robust APIs and backend solutions utilizing **.NET**, **Spring Boot**, and **AWS** technologies. My ability to ensure data validation and maintain high-performance standards has been proven in dynamic environments. I am well-versed in Agile methodologies, allowing me to contribute effectively within collaborative team settings.\n\nIn addition, I have a solid foundation in modern programming languages such as Java, which complements my backend development expertise. My experience extends to integrating and optimizing full-stack applications, working with frontend frameworks when necessary, and prioritizing secure coding practices. I've successfully led projects in the healthcare and financial sectors, focusing on compliance with standards like HIPAA and PCI DSS, ensuring that systems remain secure and efficient.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust backend systems utilizing **.NET** and **Spring Boot** frameworks, ensuring high performance and scalability in line with Agile methodologies.\n- Designed and implemented **API Design** strategies to facilitate seamless communication between microservices and client applications, adhering to REST principles with a focus on **data validation**.\n- Collaborated effectively within Agile teams to deliver features iteratively, achieving a **25%** reduction in time-to-market for backend enhancements.\n- Managed and deployed applications on **AWS** to support scalable cloud architecture, ensuring high availability and resilience through services like **AWS Lambda** and **Docker**.\n- Developed comprehensive unit and integration tests using tools compatible with **.NET** and **Spring Boot**, achieving a test coverage of over **90%** to ensure code reliability and maintainability.\n- Implemented CI/CD pipelines with **Azure DevOps** to streamline development and deployment processes, leading to a **30%** increase in deployment frequency while minimizing downtime.\n- Utilized **API Design** standards for developing microservices architectures, improving system modularity and reducing dependency management complexities by **40%**.\n- Enhanced existing backend infrastructure through performance tuning and optimization techniques, resulting in response time improvements of up to **50%** in critical endpoints.\n- Engaged in cross-functional teamwork to align product vision with technical execution, leading to improved collaboration and efficiency in project milestones."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented RESTful API services using **.NET** and **Spring Boot** frameworks, ensuring robust API Design and Data Validation practices for seamless integration with front-end applications.\nDeveloped and maintained scalable backend solutions employing **Angular** for enhanced user experience and real-time data processing, resulting in a **30%** increase in user engagement.\nParticipated in Agile methodologies, contributing to sprint planning and stand-ups, boosting team collaboration by **40%** and streamlining development cycles for timely project deliveries.\nLeveraged **AWS** cloud services for deployment and scalability, utilizing tools like **AWS Lambda** and **Amazon RDS**, successfully decreasing infrastructure costs by **25%**.\nImplemented efficient data validation mechanisms, ensuring compliance with financial regulations and reducing data inconsistencies by **50%**.\nConducted code reviews and facilitated knowledge sharing sessions, enhancing team competency in backend technologies and leading to a significant increase in code quality and performance."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **.NET** and **Spring Boot** frameworks for backend service design, ensuring robust API design and data validation in alignment with agile methodologies.\nDeveloped scalable RESTful APIs with a focus on performance optimization and security, achieving a **30%** increase in response times for key endpoints.\nIntegrated cloud services on **AWS** to deploy applications, utilizing serverless architecture to enhance application availability and scalability across different environments.\nCollaborated with frontend developers using **Angular** to design cohesive application interfaces, ensuring smooth data flow between the client and server.\nImplemented comprehensive data validation techniques to maintain data integrity across customer-facing applications, resulting in an error reduction of **25%** in production.\nParticipated in agile ceremonies and contributed significantly to sprint planning and reviews, effectively enhancing team productivity and project transparency.\nOrchestrated regular code reviews and ensured adherence to best practices, leading to improved code quality and maintainability, with a decrease in technical debt by **15%**.\nMaintained extensive documentation on API endpoints, system architecture, and design decisions to facilitate onboarding and knowledge sharing among team members."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI Design, Data Validation\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Agile"
}