{
  "name": "Tomasz Lee",
  "role_name": "Remote Data Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Dynamic Remote Data Engineer with 9+ years of experience in managing the job cycle (MtJC) and real-time job monitoring. Demonstrated expertise in **Apache Kafka**, **RabbitMQ**, and **Redis** for efficient data transaction and processing in digital oilfields. Strong analytical problem-solving skills paired with exceptional communication capabilities, enabling effective stakeholder engagement. Highly adaptable multitasker with proficiency in both frontend and backend technologies, including **ReactJS**, **NextJS**, **.NET**, and **C#**. Proven track record of optimizing performance and delivering innovative solutions in complex project environments.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Remote Data Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **digital oilfield** techniques to enhance data lifecycle management for improved data accuracy and integrity.\nStreamlined **real time job monitoring** processes by designing and implementing monitoring solutions, ensuring a 25% increase in job cycle efficiency.\nUtilized **analytical problem-solving** skills to identify and resolve data discrepancies, leading to a reduction in errors by 30%.\nFostered effective **stakeholder engagement** through regular communication updates, resulting in a 40% improvement in project alignment and support.\nExecuted complex **transmission protocols** to ensure reliable data transfer across distributed systems, achieving a consistent data flow.\nApplied **communication skills** to make technical information accessible to non-technical stakeholders, facilitating better decision-making processes.\nDemonstrated **multitasking** abilities by managing multiple projects simultaneously, ensuring on-time delivery of all engineering tasks.\nAdapted to changing project requirements swiftly, using **adaptability** to refine solutions in a fast-paced environment.\nEmployed **technical skills** in various frameworks and tools, including .NET 7 and ReactJS, to develop scalable data solutions.\nMaintained a focus on operational excellence, achieving a 20% increase in data processing speed through optimized workflows."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Leveraged **real-time job monitoring** techniques to implement a cloud-based project management tool, improving team collaboration efficiency by **15%**.\n• Applied **analytical problem-solving** skills to create a microservices architecture using **RabbitMQ** for task orchestration and **Apache Kafka** for event-driven data streams, enhancing system scalability.\n• Utilized **technical skills** by integrating **Redis** as a caching layer, resulting in a **25%** reduction in latency in frequent API calls.\n• Developed robust **RESTful APIs** with **.NET Core** integrated with a **PostgreSQL** database for real-time data access.\n• Built and maintained components using **ReactJS** and **Tailwind CSS**, leading to a **25%** improvement in user engagement on the platform.\n• Implemented CI/CD pipelines using **GitHub Actions**, achieving a **30%** reduction in production deployment errors through rigorous **stakeholder engagement** for clear communication.\n• Managed data storage and retrieval effectively with **MSSQL** and **MySQL** databases, optimizing query performance through multitasking and adaptability.\n• Collaborated with stakeholders to define system requirements and development timelines, ensuring timely project delivery while honing **communication skills**.\n• Developed interactive project status tracking and reporting tools using **D3.js**, enhancing visual representation of data.\n• Conducted code reviews and provided mentorship to junior developers, fostering a strong development team and elevating overall productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Applied **analytical problem-solving** skills to manage the job cycle effectively, ensuring real-time job monitoring for optimal performance.\n• Engaged with stakeholders to gather requirements and establish communication protocols, enhancing collaboration across teams.\n• Demonstrated **adaptability** by seamlessly handling multiple tasks and projects simultaneously, resulting in a 35% improvement in on-time project delivery.\n• Leveraged **technical skills** to develop solutions in a **digital oilfield** environment, utilizing effective **transmission protocols** for efficient data processing.\n• Initiated and participated in technical discussions to enhance the team's understanding of job cycles and real-time job monitoring, contributing to a 15% reduction in issue resolution time.\n• Contributed to system enhancements that streamlined job operations, showcasing strong **communication skills** throughout team interactions.\n• Utilized **multitasking** capabilities to balance urgent tasks while maintaining the quality of deliverables, leading to a 30% increase in overall team productivity.\n• Collaborated with the engineering team to implement best practices in data handling and job management, ensuring compliance with industry standards."
    }
  ],
  "skills": " **Programming Languages**\n\t JavaScript, TypeScript, Python, C#, Solidity\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n**Frontend Frameworks**\n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t AWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t digital oilfield\n\n**Other**\n\t UX/UI Design, Git, GitHub, Redux, Apache Kafka, RabbitMQ, Redis, testing tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, real time job monitoring, communication skills, analytical problem-solving, multitasking, adaptability, stakeholder engagement, technical skills, Managing the Job Cycle (MtJC)"
}