{
  "name": "Tomasz Lee",
  "role_name": "AI Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven AI Software Engineer with 9+ years of experience in developing and implementing innovative solutions utilizing **Python**, **FastAPI**, **Flask**, and **microservices architecture**. Proficient in **event-driven architecture** and familiar with technologies like **Apache Kafka** for building real-time applications. Well-versed in conversational AI and large language models, including **GPT**, **Claude**, and **Gemini**, with hands-on experience in **fine-tuning**, **prompt engineering**, and **Retriever-Augmented Generation (RAG) systems**. Skilled in leveraging **Vector databases** and **OpenSearch** for data retrieval and optimization. Recognized for strong problem-solving capabilities and effective communication skills, with a proven track record of collaborating with cross-functional teams to drive project success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "AI Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Python** frameworks such as **FastAPI** and **Flask** to develop high-performance web applications in an agile environment.\nDesigned and implemented a **microservices architecture** to enhance system scalability, leading to a **50%** increase in deployment efficiency.\nIntegrated **Kafka** for event-driven architecture, enabling real-time data processing that improved response times by **30%**.\nDeveloped and optimized **RESTful APIs** while collaborating with cross-functional teams to improve system interoperability, reducing integration time by **20%**.\nUtilized **OpenSearch** and **FAISS** for advanced search functionalities, significantly improving data retrieval speed and accuracy.\nEmployed AI strategies like **prompt engineering** and **fine-tuning** with large language models such as **GPT** and **Claude** to enhance application performance and user interactivity.\nImplemented **SSE** and **WebSocket** protocols for real-time communication, boosting user engagement by **40%**.\nCreated and maintained documentation, promoting effective **communication** and **collaboration** across teams, improving project delivery time by **25%**.\nResolved complex problems through effective **problem-solving** techniques, achieving a 95% success rate in project deliverables.\nSpearheaded the development of AI-driven conversational agents that increased customer interaction efficiency by **35%**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Built and deployed advanced AI applications utilizing **Python**, **FastAPI**, and **Flask** to enhance conversational AI functionalities.\nArchitected a robust **microservices architecture** with **Kafka** for seamless event-driven data handling, allowing for dynamic scaling and efficient processing of **20,000+** events per minute.\nDesigned API integrations using **WebSocket** and **SSE** to facilitate real-time data communication for AI-driven applications, reducing latency by **30%**.\nImplemented cutting-edge techniques for **fine-tuning** and **prompt engineering** in **Large Language Models** (LLMs) such as **GPT** and **Claude**, improving model response accuracy by **15%**.\nUtilized **FAISS** and **OpenSearch** for efficient retrieval-augmented generation (RAG) systems, enhancing data search capabilities and reducing query times.\nCollaborated closely with cross-functional teams to gather requirements and provide solutions, ensuring effective communication during project development phases.\nDeveloped and maintained documentation for AI systems, fostering collaboration and ensuring adherence to best practices within the team.\nConducted training sessions on complex AI concepts and technologies, significantly improving team capabilities and knowledge sharing.\nLed the integration of AI agents for enhanced user experiences, increasing user satisfaction scores by **20%** through personalized interactions.\nMonitored and optimized AI model performance, employing problem-solving skills to address challenges swiftly and efficiently."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop robust microservices, enhancing application scalability and performance by 30%.\nImplemented **WSSE** (WebSocket Server Event) for real-time data handling, increasing user engagement on the platform by 25%.\nDesigned and developed **Event-driven architecture** using **Kafka** for seamless integration of various system components, improving overall system efficiency.\nEngaged in fine-tuning **Large Language Models**, such as **GPT** and **Claude**, to optimize their performance for conversational AI applications with a 15% accuracy increase in response generation.\nPerformed prompt engineering techniques to enhance model interactions, reducing response time by 10%.\nDeveloped **Retrieval-Augmented Generation (RAG)** systems to improve data retrieval for AI agents, achieving a 40% improvement in response relevance.\nUtilized **OpenSearch** and **FAISS** for efficient vector database operations, facilitating advanced search capabilities for user queries.\nCollaborated effectively with cross-functional teams to ensure high-quality software delivery, participating in daily standups and code reviews to maintain project alignment.\nDelivered technical documentation and facilitated knowledge sharing among teams to streamline processes and enhance communication across departments.\nDemonstrated strong problem-solving skills by addressing complex issues in AI integration and performance tuning across multiple platforms."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, NodeJS, ExpressJS, NestJS, C#, .NET, Microservices, Microservices architecture\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL, WebSocket, SSE\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Vector databases, OpenSearch, FAISS\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines, Apache Kafka, RabbitMQ, Redis\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Problem-solving, Communication, Collaboration, Event-driven architecture, Large Language Models, Fine-tuning, Prompt engineering, GPT, Claude, Gemini, RAG systems, AI agents, Conversational AI, OpenAI Chat Completion, Retrieval-Augmented Generation"
}