{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Staff Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Staff Software Engineer with 8 years of comprehensive experience, I excel in leveraging **Ruby on Rails** and **Postgres** to design and implement high-performance solutions. My strong background in **software design principles** ensures scalable and maintainable architectures, while my expertise in **data ingestion** and **data reconciliation** drives efficient data workflows. I am adept at **performance tuning** to enhance application responsiveness and optimize resource utilization. \nIn previous roles, I have demonstrated exceptional **collaboration skills** and a commitment to mentoring junior developers, facilitating knowledge sharing and fostering a productive team environment. Additionally, I possess strong capabilities in **technical documentation**, ensuring clarity and compliance for all project stakeholders. Outside of core responsibilities, I have built enterprise-grade platforms with a focus on security and compliance, and I am continually seeking to improve my technical repertoire.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Staff Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Ruby on Rails** and **Postgres** to architect and develop high-performance, scalable healthcare and financial platforms, ensuring adherence to software design principles and best practices for data ingestion and reconciliation.\nDemonstrated strong collaboration skills by working closely with cross-functional teams to deliver seamless integrations and address performance tuning needs of applications.\nCreated and maintained comprehensive technical documentation covering system architecture, workflows, and operational procedures for team members and stakeholders.\nProvided mentorship to junior engineers, guiding them through design challenges and enhancing their understanding of technical concepts and coding standards.\nImplemented effective data ingestion strategies to support real-time analytics, ensuring robust data reconciliation methods were in place to maintain data integrity.\nLed initiatives to optimize application performance, achieving overall system efficiency improvements by **30%** through code refactoring and database indexing.\nManaged the deployment of applications using **Docker** and developed CI/CD pipelines integrating **Ruby on Rails** applications within environments optimized for rapid delivery and scaling.\nEngaged in peer code reviews, offering constructive feedback and fostering a culture of continuous improvement among the engineering team.\nContributed to the development of user-friendly interfaces and backend services, leveraging expertise in modern web technologies to enhance user experience and engagement.\nDemonstrated a commitment to software craftsmanship by adhering to established coding standards and promoting clean code principles throughout the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Ruby on Rails** for developing scalable back-end services, ensuring high performance and reliability in financial applications.\nImplemented **Postgres** database solutions for efficient data storage and retrieval, leading to a **30% improvement** in data access times for end-users.\nDesigned and executed data ingestion and reconciliation processes, enhancing the accuracy of financial reporting and reducing discrepancies by **25%**.\nConducted performance tuning across applications, significantly optimizing response times and throughput to handle high-volume transactions with ease.\nApplied software design principles to create maintainable and extensible codebases, resulting in a **40% reduction** in technical debt over **6 months**.\nFostered collaboration skills by leading cross-functional teams, ensuring effective communication and alignment on project goals and deliverables.\nAuthored comprehensive technical documentation to support system design and workflow processes, facilitating smoother onboarding for new team members and promoting knowledge sharing.\nProvided mentorship to junior developers, helping to enhance their programming skills and understanding of best practices, leading to improved team productivity and morale."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Employed **Ruby on Rails** to design and develop robust backend services, ensuring optimal performance and efficiency for high-traffic e-commerce applications, enhancing user experience and system reliability.\nUtilized **Postgres** for data management and storage solutions, implementing performance tuning strategies that resulted in a **30%** increase in query efficiency and reliability.\nExecuted effective **data ingestion** techniques while focusing on **data reconciliation** to maintain data consistency across multiple platforms, achieving a **99.9%** accuracy in transactional data integrity.\nApplied software design principles to create scalable architecture, integrating best practices that streamlined code maintenance and increased overall development speed by **25%**.\nFostered collaboration skills within cross-functional teams, facilitating a productive development environment that improved project delivery timelines by an average of **15%**.\nProduced comprehensive technical documentation to support ongoing system improvements and developer onboarding, ensuring clarity and continuity in project execution.\nMentored junior developers, enhancing their competencies in software engineering practices and boosting team performance through guided support and knowledge sharing.\n"
    }
  ],
  "skills": "**Backend Frameworks:**\n\tRuby on Rails\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Programming Languages:**\n\tPython (FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Data ingestion, Data reconciliation, Performance tuning, Software design principles, Collaboration skills, Technical documentation, Mentorship, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)"
}