{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Machine Learning Specialist",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Machine Learning Specialist with 13+ years of experience in developing and implementing complex algorithms and models tailored for AI/ML applications. Proficient in **Python**, with a strong focus on **machine learning** techniques including **supervised learning**, **unsupervised learning**, **deep learning**, and **reinforcement learning**. Experienced in leveraging **ML frameworks** and **transformers** to optimize model performance and conduct data analysis that informs decision-making.\nSkilled in building cloud-based workflows and deploying solutions on **AWS** and **Azure** to ensure scalability and reliability. Possesses a thorough understanding of compliance-driven development, ensuring that all solutions align with industry standards such as HIPAA and PCI DSS. \nDemonstrates a strong aptitude for **natural language processing** and **probabilistic modeling**, coupled with clear communication and effective documentation skills, to translate complex technical concepts into actionable insights. Additionally, experienced in coordinating end-to-end processes for model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Machine Learning Specialist",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized advanced **Python** techniques for machine learning projects, focusing on **supervised learning**, **unsupervised learning**, **deep learning**, and **probabilistic modeling**, enhancing model accuracy by **30%**.\nDeveloped sophisticated **natural language processing** systems using **spaCy** and **Hugging Face Transformers** for document parsing, achieving a processing speed increase of **25%** compared to legacy systems.\nManaged end-to-end **cloud-based workflows** on **AWS Lambda** and **Azure Functions**, ensuring deployment efficiency for ML models with a shout-out to MLOps practices using **MLflow** and **DVC**.\nConducted in-depth **data analysis** on large datasets, using **scikit-learn**, **PyTorch**, and **TensorFlow** to deploy ML models for high-stakes challenges like fraud detection and risk scoring, resulting in improved detection rates of **15%**.\nCollaborated with teams to design and execute model optimization strategies, fine-tuning model parameters which led to on-the-fly adjustments improving prediction outcomes across applications.\nDrafted comprehensive documentation for machine learning workflows, facilitating clear communication within teams and ensuring seamless model handovers.\nDeployed advanced **data science** techniques to build predictive health and financial summaries, leveraging powerful dashboards integrated into user-friendly interfaces with real-time outputs.\nEngaged in **model optimization** and reviewed model performance regularly, maintaining a feedback loop that iteratively enhanced model reliability and robustness.\nCreated clear and precise visualizations using **D3.js** and **Power BI Embedded**, allowing stakeholders to analyze operational KPIs and fraud trends effectively.\nImplemented rigorous testing frameworks with **PyTest**, ensuring that each ML model was thoroughly vetted for performance under various datasets, leading to a **20%** reduction in error rates."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Python** for machine learning model development, emphasizing supervised and unsupervised learning techniques to address complex financial challenges.\nUtilized **ML frameworks** including scikit-learn and XGBoost for building, optimizing, and deploying robust models that ensure accurate fraud detection and transaction classification.\nImplemented **cloud-based workflows** using Azure ML and Azure Data Factory, effectively integrating models into scalable architectures for streamlined processing and analysis.\nEmployed **data science** methodologies, including probabilistic modeling, to derive actionable insights from financial data, contributing to enhanced decision-making.\nOptimized data pipelines and workflows for real-time data ingestion and processing with **Apache Airflow**, facilitating immediate access to analytics and operational metrics.\nConducted effective **data analysis** to visualize trends and anomalies using real-time analytics dashboards built with **React** and **D3.js**, offering instant insights into transactional activities.\nDocumented machine learning processes and model details clearly to ensure reproducibility and maintain comprehensive records for compliance and training purposes.\nMaintained clear communication with cross-functional teams to facilitate joint model development efforts and align project objectives, ensuring the successful integration of machine learning solutions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied advanced **machine learning** techniques, including **supervised learning**, **unsupervised learning**, and **reinforcement learning**, to develop algorithms that enhance e-commerce functionalities and customer experiences.\nUtilized **Python** and relevant **ML frameworks** such as **TensorFlow** and **scikit-learn** for modeling and implementing data-driven solutions.\nExecuted probabilistic modeling and **transformers** to optimize recommendation systems and improve the relevance of product listings, leading to a **15% increase** in conversion rates based on real-time user behavior.\nConducted thorough data analysis, transforming raw data into actionable insights that supported controlled deployments and feature enhancements.\nOptimized model performance to reduce prediction latency by **30%**, ensuring real-time responsiveness to user interactions.\nDocumented workflows and algorithms for internal teams to enhance clear communication and future training purposes.\nCollaborated with cross-functional teams to create cloud-based workflows that integrated with existing platform technologies, ensuring seamless deployment and scalability for machine learning initiatives.\nEngaged in continuous learning of latest ML trends and techniques, applying findings to enhance system architecture and algorithm effectiveness, including natural language processing to enhance customer support functionalities."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCloud-based workflows\n\n**Other:**\n\tMachine Learning, Natural Language Processing, ML frameworks, Supervised Learning, Unsupervised Learning, Deep Learning, Reinforcement Learning, Probabilistic modeling, Data Science, Model Optimization, Transformers, Documentation, Data Analysis, Clear Communication"
}