{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Software Developer with 13+ years of experience specializing in building scalable applications in the healthcare and financial sectors. Proficient in **.NET**, **C#**, **MS SQL Server**, and **T-SQL**, with a strong command of **Angular** for dynamic frontend development. Skilled in backend technologies such as **JavaScript** and **REST APIs**, ensuring seamless service-oriented architecture. Leveraged **Azure** cloud services for deploying applications and implementing **CI/CD** pipelines alongside **DevOps** practices for efficient delivery.\n\nDemonstrated expertise in supporting compliance-driven development strategies aligned with standards such as HIPAA and PCI DSS. Strong background in integrating data protection measures while utilizing design patterns to create maintainable code. Adept at utilizing **Visual Studio** for development and debugging, and implementing robust web services for enhanced application performance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **.NET** and **C#** to design and develop robust web services and **REST APIs**, ensuring efficient data processing and adherence to architectural best practices.\nUtilized **MS SQL Server** and **T-SQL** for designing optimized database schemas, enhancing query performance by over **30%** in high-load scenarios.\nImplemented modern front-end technologies such as **Angular** and CSS to create responsive user interfaces that improved user engagement metrics by **25%**.\nDeveloped and maintained **CI/CD** pipelines using Azure DevOps, enabling seamless code integration and deployment cycles that reduced time-to-market by **40%**.\nApplied DevOps practices, utilizing **Visual Studio** for efficient project management and collaboration, significantly cutting down development bottlenecks.\nEmployed design patterns and service-oriented architecture principles to create scalable applications that comply with established data protection regulations.\nContributed to code reviews and maintained coding standards, improving code quality and reducing bugs by **20%** through rigorous testing methodologies.\nCollaborated effectively within cross-functional teams to gather requirements, analyze system specifications, and ensure alignment with business objectives.\nEngaged actively in knowledge sharing sessions, enhancing team capabilities in modern technologies and development practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented REST APIs and Web Services using **.NET** and **C#**, enabling seamless integration between systems and enhancing service-oriented architecture for high-performance applications.\nDesigned and developed scalable databases on **MS SQL Server**, optimizing T-SQL queries for improved data retrieval and management.\nUtilized **Angular** and **CSS** to create dynamic and responsive web applications, enhancing user experience and engagement with intuitive interfaces.\nEmployed CI/CD practices and **DevOps** methodologies to automate software deployment processes, reducing time to market by **30%**.\nLeveraged **Azure** cloud services to deploy applications and manage resources efficiently, ensuring high availability and scalability of applications.\nApplied design patterns for maintainable code architecture, which improved the system's modularity and adaptability by **25%**.\nConducted thorough data protection strategies and secured web applications against vulnerabilities, adhering to best practices in security governance.\nCollaborated effectively with cross-functional teams, leading to a **15%** increase in project delivery speed and team efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized robust backend services using **.NET** and **C#**, ensuring high performance and scalability across critical components of the application.\nImplemented **MS SQL Server** database solutions with complex **T-SQL** queries, achieving efficient data retrieval and storage for high-volume transactions.\nCrafted responsive front-end interfaces utilizing **Angular**, coupled with **CSS** for enhanced visual appeal, ensuring user-friendly experiences on web platforms.\nDesigned and deployed **REST APIs** for seamless integration with third-party services, employing industry-standard **Web Services** to enhance application functionality.\nLeveraged **Azure** cloud services for scalable infrastructure and hosting solutions, ensuring high availability and disaster recovery for the software applications.\nExecuted CI/CD pipelines with **DevOps** practices, utilizing **Visual Studio** for streamlined development and deployment cycles, reducing release times by **30%**.\nImplemented Service-Oriented Architecture (SOA) principles and Design Patterns to ensure modular and maintainable code, enhancing collaboration efficiency in the team.\nEstablished strong data protection measures in compliance with industry standards, minimizing risks associated with vulnerability and ensuring integrity of sensitive user data.\nConducted thorough testing and debugging processes to enhance overall software quality, achieving a **95%** pass rate in quality assurance.\nCollaborated with cross-functional teams to gather requirements and deliver software solutions, consistently meeting project deadlines and objectives."
    }
  ],
  "skills": " **Programming Languages**\n\tC#, .NET, JavaScript, TypeScript, Python\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks**\n\tAngular, React, Vue, CSS\n\n **API Technologies**\n\tREST APIs, Web Services\n\n **Serverless and Cloud Functions**\n\tAWS: Lambda, ECS, Azure: App Services\n\n **Databases**\n\tMS SQL Server, T-SQL, PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n **Cloud & Infrastructure**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other**\n\tMachine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Service-Oriented Architecture, Design Patterns, Data Protection"
}