{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer (Search)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Senior Software Engineer (Search) with 8+ years in software engineering, I excel in designing and implementing robust search infrastructures, focusing on CI/CD practices and Object-Oriented Programming. Proficient in **Ruby** and **Ruby on Rails**, I leverage **Elasticsearch** and **OpenSearch** for indexing and query optimization, ensuring high performance and reliability in search functionality. My technical acumen extends to utilizing vector databases and AI/LLM tools, creating solutions that address complex search scenarios. In addition to my technical skills, I possess strong communication capabilities in both Polish and English, enabling effective collaboration across diverse teams. My solid background in software development empowers me to deliver innovative solutions tailored to meet business objectives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer (Search)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Designed and developed search infrastructure using **Elasticsearch** and **OpenSearch**, ensuring optimized query performance and indexing strategies to enhance data retrieval across multiple platforms.\nImplemented CI/CD pipelines for Ruby on Rails applications alongside **Python** microservices, achieving seamless deployment and integration with automated testing and security scans.\nUtilized Object-Oriented Programming principles in Ruby to develop scalable, maintainable code for search-related features, improving workflow efficiency and reliability.\nExecuted advanced query optimization techniques, significantly reducing response times by up to **75%** for complex search queries in both operational and analytical environments.\nLed the architectural strategy for integrating AI/LLM tools into search functionalities, enhancing the user search experience through intelligent recommendations based on previous interactions.\nCollaborated with cross-functional teams to define requirements and implement features, demonstrating strong communication skills in both **Polish** and **English** to ensure alignment across stakeholders.\nMentored junior engineers in Ruby on Rails best practices, focusing on search application development and maintenance, fostering a supportive and knowledge-sharing environment.\nArchitected vector databases to support advanced searching capabilities, leveraging similarities and relationships in large datasets for improved search accuracy and efficiency.\nConducted comprehensive performance evaluations and tuning of search algorithms, which led to a **40%** increase in application responsiveness and user satisfaction rates.\nDeveloped integration layers for third-party search services, streamlining data flow and accessibility to enhance overall user experience through effective search result presentation.\nParticipated in code reviews and implemented best coding standards for Ruby and Rails, ensuring scalability and performance optimization of search-related functionalities.\nChampioned the establishment of best practices in indexing and query optimization, resulting in reduced operational costs and improved application performance.\nImplemented feedback loops incorporating user analytics to continuously refine and enhance search features, leading to a **30%** increase in user engagement metrics."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed robust search infrastructure using **Ruby on Rails**, leveraging **Elasticsearch** for advanced indexing and query optimization to enhance the search experience for users.\n• Applied Object-Oriented Programming principles to design and implement scalable and maintainable software solutions in **Ruby**, ensuring the efficient handling of large datasets.\n• Spearheaded the implementation and optimization of CI/CD pipelines using **GitHub Actions** and **Azure DevOps**, leading to a **30%** increase in deployment efficiency and reduced time to market.\n• Engaged in enhancing search capabilities by utilizing **vector databases** and AI/LLM tools for improved semantic search functions and user relevancy.\n• Communicated effectively in both Polish and English, collaborating with cross-functional teams to align project objectives and deliver exceptional results.\n• Developed and maintained high-quality documentation, ensuring that the technical specifications for the search system are comprehensive and user-friendly.\n• Collaborated with product stakeholders to define search requirements and transform them into effective solutions, leading to a **25%** improvement in user satisfaction ratings.\n• Conducted performance tuning and optimization in search algorithms, achieving response time reductions of up to **50%**.\n• Implemented logging and monitoring strategies using **OpenSearch** to ensure availability and performance of search services.\n• Actively participated in code reviews and contributed to best practices in software development, promoting knowledge sharing and continuous improvement within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented **CI/CD** pipelines using modern tools (e.g., GitHub Actions, Azure DevOps, Jenkins) to ensure seamless deployment processes in search infrastructure projects.\nLeveraged **Elasticsearch** and **OpenSearch** for indexing and query optimization, resulting in a **30%** improvement in search response times and user satisfaction.\nDeveloped scalable backend services using **Ruby on Rails**, implementing Object-Oriented Programming principles to enhance system maintainability and performance.\nOptimized search algorithms and implemented effective **vector databases** strategies to elevate the accuracy of search results by **25%**.\nCollaborated with cross-functional teams to refine communication skills for articulating technical concepts and systems in **Polish** and **English** to diverse stakeholders.\nDesigned and managed APIs that seamlessly integrate search functionality with existing platforms, enabling improved user interactions and real-time data retrieval within **75%** faster response times.\nConducted performance tuning sessions on the search infrastructure, identifying and resolving performance bottlenecks which improved indexing times by **40%**.\nParticipated in Agile ceremonies, contributing to sprint planning and retrospectives, fostering a culture of continuous improvement within the team.\nUtilized AI/LLM tools to enhance search feature development, incorporating advanced algorithms that create more intuitive user experiences.\nPerformed thorough code reviews to uphold coding standards and support knowledge sharing among team members."
    }
  ],
  "skills": "Programming Languages:\n\tPython, Ruby\n\nBackend Frameworks:\n\tFastAPI, Django, Flask, Rails\n\nFrontend Frameworks:\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\nAPI Technologies:\n\tREST & gRPC APIs\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Elasticsearch, OpenSearch, vector databases\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\nCloud & Infrastructure:\n\tNginx, Certbot\n\nOther:\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, search infrastructure, indexing, query optimization, AI/LLM tools, Object-Oriented Programming, communication skills, Polish, English"
}