{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Product Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Results-driven Senior Product Engineer with 8+ years of comprehensive experience in software engineering, specializing in full-stack development with a focus on **Node.js**, **React**, and **TypeScript**. Adept at designing and implementing high-performance applications across various platforms, with strong capabilities in **GraphQL** and cloud infrastructure using **AWS** and **Terraform**. Proven expertise in mobile app development for both **iOS** and **Android** platforms, ensuring exceptional user experience (UX) and interface design. Complemented by strong analytical skills, I leverage my background in **Python** and modern web frameworks to create scalable systems and optimize workflows, delivering robust solutions tailored to meet evolving business needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Product Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Node.js** to design and implement scalable server-side applications, ensuring seamless integration with front-end frameworks like **React** and state management libraries such as **Redux**.\nDeveloped robust APIs leveraging **GraphQL** for efficient data retrieval, optimizing application performance across multiple platforms including web and mobile (iOS, Android).\nLed the automation of infrastructure provisioning and management using **Terraform**, achieving a deployment time reduction of **30%** and enhancing team productivity.\nApplied analytical skills to gather user feedback and iteratively improve UX/UI designs, resulting in a **15%** increase in user engagement across applications.\nSpearheaded front-end development with **TypeScript**, ensuring type safety and enhancing maintainability for large-scale applications with complex feature sets.\nCollaborated cross-functionally with product and design teams to define requirements, translating them into well-structured technical specifications for development.\nMentored a team of **5+** junior engineers on best practices in **Node.js** and **React**, fostering a culture of development excellence and continual learning.\nConducted performance optimization of applications, leading to a **20%** improvement in load times and responsiveness through strategic profiling and code refactoring.\nIntegrated third-party services and APIs to enhance product functionality, implementing features that improved user engagement and conversion rates.\nEstablished comprehensive testing strategies, including unit and integration tests, to ensure the reliability and performance of both back-end and front-end applications.\nMaintained hands-on involvement in code reviews, providing constructive feedback to enhance code quality and adherence to best practices across the development team.\nEngaged in continuous learning and professional development, staying updated with emerging technologies and industry trends to bring innovative solutions to the team."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js**, **React**, and **TypeScript** to design and develop scalable, user-centric applications, enhancing overall user experience by **30%** based on customer feedback.\nImplemented **GraphQL** for API development, allowing for efficient data fetching and reducing network requests by **25%**.\nDeveloped cloud infrastructure using **Terraform** in conjunction with **AWS**, achieving deployment efficiency and reducing infrastructure costs by **40%**.\nCollaborated with cross-functional teams to conduct UX research, driving insights to continuously improve product features, resulting in a **15%** increase in user engagement.\nApplied strong analytical skills to troubleshoot and optimize application performance based on real-time user data, improving response times by **20%**.\nLed the transition of legacy systems to modern frameworks, ensuring compatibility and maintaining core business functionalities while adhering to project timelines.\nContributed to the design and implementation of CI/CD pipelines, enhancing release cycles and reducing deployment errors by utilizing **AWS** tools and practices.\nEngaged in regular code reviews and collaborative sessions to foster knowledge sharing and promote best practices among team members, enhancing overall code quality.\nMaintained thorough documentation of the development processes and architecture designs to streamline onboarding for new developers, reducing ramp-up time by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and developed dynamic and responsive front-end applications using **React** and **TypeScript**, ensuring cross-device accessibility and optimized user experiences in alignment with business goals.\nUtilized **Node.js** for backend services to manage high-volume transactions, integrating smoothly with front-end applications to facilitate real-time interactions.\nApplied **GraphQL** for efficient data querying and manipulation, reducing the amount of data transferred and improving application performance by **30%**.\nLeveraged **AWS** for cloud deployment and infrastructure management, enhancing scalability and reliability of applications while reducing operational costs by **20%**.\nImplemented containerization with **Terraform** and **Docker** to streamline deployments and ensure uniform environments, improving deployment time by **40%**.\nConducted thorough UX evaluations and user testing to iteratively improve application usability based on analytical insights, leading to a **25%** increase in user satisfaction.\nDeveloped applications for both **iOS** and **Android** platforms, ensuring seamless functionality and performance through responsive designs.\nCollaborated with cross-functional teams to enhance features and integrate user feedback into product iterations, fostering a customer-centric approach.\nDesigned and executed analytic strategies to monitor application usage and performance, utilizing insights to inform development decisions and optimize workflows.\nUtilized CI/CD practices for automated testing and deployments with **GitHub Actions** and **Jenkins**, ensuring consistent feature delivery with reduced development cycles by **15%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tNode.js, Python, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Angular (1–16), Next.js, Vue.js (2/3), Blazor\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**API Technologies:**\n\tREST & gRPC APIs, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL), Docker, Kubernetes, Terraform, GitHub Actions, GitLab CI/CD\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQLAlchemy\n\n**DevOps:**\n\tNginx, Certbot, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt\n\n**Other:**\n\tCelery, Pydantic, UX, Analytical Skills, iOS, Android",
  "apply_company": "CrazyGames"
}