{
  "name": "Rei Taro",
  "role_name": "Modern C++ Software Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Modern C++ Software Developer with over 10 years of experience in backend systems and a strong focus on **C++ 20**, **Boost.Asio**, and **asynchronous programming**. Expertise in **unit testing**, **object-oriented programming**, and **UML design** to create efficient and reliable solutions. Skilled in implementing the **FIX protocol** and integrating with **MetaTrader API** to develop financial applications. Proven ability to tackle complex problems with a detail-oriented and self-starter approach. Excellent communication and interpersonal skills, demonstrated through collaboration on impactful projects within top-tier organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Modern C++ Software Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **C++ 20** to implement modern programming practices, enhancing code efficiency and maintainability.\nImplemented **Boost.Asio** for handling asynchronous programming, ensuring high-performance communication in financial applications.\nExecuted comprehensive **unit testing** strategies to validate software functionality and robustness prior to deployment, achieving a **95% code coverage**.\nApplied **object-oriented programming** principles and **UML design** to create modular and scalable system architectures for diverse software projects.\nDeveloped solutions that integrated with the **FIX protocol** for real-time trading data transmission, improving transaction processing times by **30%**.\nLeveraged **MetaTrader API** to build trading algorithms and interfaces, enhancing user interaction and experience with financial services.\nConducted performance **profiling** to identify bottlenecks in the application, achieving a **20% reduction** in processing time across multiple modules.\nExercised strong **problem-solving** skills to troubleshoot technical issues, fostering robust communication with team members for effective solutions.\nDemonstrated excellent **communication skills** and **interpersonal skills** in cross-team collaborations, driving project success with timely updates and stakeholder engagement.\nSelf-starter attitude fostered an independent work ethic, allowing for proactive contributions to team objectives and personal growth in development processes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Leveraged **C++ 20** for high-performance backend development, implementing **asynchronous programming** techniques to optimize system responsiveness.\nApplied **Boost.Asio** for network communication, ensuring efficient data transmission within microservices architecture.\nConducted comprehensive **unit testing** to validate code reliability and performance; achieved a **95%** code coverage across the project lifecycle.\nUtilized **UML design** principles in system architecture to enhance collaboration and facilitate clear documentation.\nIntegrated **FIX protocol** and **MetaTrader API** for real-time financial data processing and trading operations, ensuring a seamless user experience.\nDemonstrated strong **problem-solving** abilities by resolving complex integration issues during cross-team collaborations, enhancing system consistency.\nMaintained proactive communication and strong **interpersonal skills** to foster team cohesion and effectively relay project updates, contributing to a **30%** improvement in project delivery timelines.\nExecuted profiling techniques to identify performance bottlenecks, resulting in a **20%** increase in system efficiency."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "- Developed backend services leveraging **C++ 20** to optimize trade execution, portfolio management, and account tracking.\n- Utilized **Boost.Asio** for asynchronous programming to enhance real-time processing capabilities in high-frequency trading environments.\n- Engaged in unit testing strategies to ensure code reliability and performance, utilizing frameworks and methodologies consistent with rigorous **unit testing** practices.\n- Applied **UML design** principles to effectively visualize and implement complex software architecture, facilitating better communication among team members.\n- Implemented the **FIX protocol** for secure and reliable trading information exchange, integral for modern trading systems.\n- Integrated with the **MetaTrader API** to expand platform functionalities and improve user trading experience via robust backend solutions.\n- Employed profiling techniques to assess application performance and identify potential bottlenecks, driving continuous improvement.\n- Demonstrated exceptional problem-solving skills to troubleshoot and resolve technical challenges efficiently in a fast-paced environment.\n- Collaborated with cross-functional teams, leveraging strong communication and interpersonal skills to align project goals and enhance overall team performance.\n- Acted as a self-starter by initiating projects, prioritizing tasks, and ensuring timely delivery of high-quality software solutions."
    }
  ],
  "skills": "  **Programming Languages**\n\tC++ 20, Python (3.8+), SQL, JavaScript\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\t\n\n  **API Technologies**\n\tREST/gRPC APIs, MetaTrader API, FIX protocol\n\n  **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, unit testing\n\n  **Cloud & Infrastructure**\n\t\n\n  **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, asynchronous programming, object-oriented programming, UML design, profiling, problem-solving, communication skills, interpersonal skills, self-starter"
}