{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in developing high-performance applications across the healthcare and financial sectors. Proficient in **Java**, and skilled in **SQL** and **Angular** for both frontend and backend solutions. Expertise in building AI/ML-powered platforms to drive predictive analytics and automation while ensuring real-time data processing. \nAdept at deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, and managing CI/CD pipelines, facilitating efficient software delivery. Recognized for compliance-driven development aligned with industry standards including HIPAA, FHIR, PCI DSS, and SOC 2. Strong problem-solving capabilities, with a deep understanding of MLOps leveraging tools like **MLflow**, **Airflow**, and **Kubeflow**, coupled with a commitment to continuous learning and adapting to hybrid work environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable applications utilizing **Java** and **SQL** to enhance data-driven decision-making in healthcare and fintech sectors.\n• Led the design and implementation of user-friendly interfaces with **Angular**, ensuring optimal user experiences in both mobile and web applications.\n• Integrated **Machine Learning** algorithms for predictive analytics, enabling real-time decision-making for risk assessment and fraud mitigation.\n• Employed problem-solving skills to troubleshoot and optimize existing systems, reducing processing time by **30%** through innovative solutions.\n• Championed continuous learning initiatives within the team, facilitating workshops and knowledge-sharing sessions on emerging technologies and best practices in software development.\n• Collaborated in a hybrid work environment, leveraging tools for effective communication and project management while ensuring team alignment and productivity.\n• Contributed to the transformation of legacy systems into modular architectures, seamlessly transitioning to cloud environments.\n• Managed database systems using **PostgreSQL** and **MongoDB**, ensuring data integrity and availability for application users.\n• Delivered mobile applications for multiple platforms, enhancing user engagement through the latest frameworks.\n• Built automated CI/CD pipelines to streamline deployment processes, reducing release cycles by **40%**.\n• Enhanced application performance through proactive monitoring and optimization, achieving a **99.9%** uptime in production.\n• Facilitated cross-functional collaboration to meet project deadlines, ensuring alignment with business objectives and user needs.\n• Championed high coding standards through rigorous testing strategies and code reviews, resulting in improved software quality and reduced bugs."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed solutions using **Java** and **SQL** to enhance existing financial applications, ensuring high performance and reliability across various environments.\nUtilized **Angular** to design user-friendly interfaces, promoting an intuitive user experience for financial tools and applications.\nImplemented **Machine Learning** algorithms for predictive analytics, contributing to improved decision-making processes in fraud detection and credit scoring.\nCollaborated with cross-functional teams in a **Hybrid Work** setting, leveraging effective communication and problem-solving skills to drive project success and meet deadlines.\nEngaged in **Continuous Learning** to stay updated with the latest technologies and frameworks, applying this knowledge to optimize system architectures and processes.\nIntegrated microservices architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), modernizing core systems to enhance scalability for high-volume transactions.\nCreated interactive front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, employing **Redux Toolkit** and **Tailwind CSS** to build sleek, responsive interfaces.\nDelivered real-time analytics dashboards using **D3.js** and **Power BI Embedded**, equipping operations teams with instant insights into over **10,000** transactions daily.\nDesigned and deployed a robust event-driven architecture with **Kafka**, **RabbitMQ**, and **Azure Service Bus**, facilitating smooth asynchronous communication across workflows, including payments and compliance.\nDeveloped **ETL** pipelines for processing financial data utilizing **Python**, **Apache Airflow**, and **Azure Data Factory**, efficiently handling both batch and real-time data with over **5 TB** processed monthly.\nBuilt machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive monitoring of suspicious activities based on analytical models.\nEstablished **ML** pipelines for credit scoring and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference seamlessly into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Java** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules.\nApplied **SQL** for efficient data management and execution of complex queries, enhancing data retrieval processes for high-traffic workflows.\nDeveloped responsive frontend applications using **Angular** (version 13), delivering fast user experiences on both web and mobile platforms.\nEngaged in **Machine Learning** techniques to enhance personalization of product listings and improve conversion rates by analyzing real-time behavioral data.\nDemonstrated advanced **Problem Solving** skills by implementing and troubleshooting backend and frontend features efficiently, ensuring system reliability and performance.\nPromoted a **Hybrid Work** environment by participating in daily stand-ups and collaborative sessions to foster team synergy and project alignment.\nAdopted a strategy of **Continuous Learning** by integrating new technologies and frameworks, ensuring the team remains at the forefront of industry advancements.\nDesigned and engineered real-time features utilizing **WebSockets** and event-driven architecture with **Kafka** and **RabbitMQ**, facilitating dynamic updates and customer interactions.\nIntegrated AI/ML-based recommendation engines utilizing **scikit-learn**, **LightGBM**, and **TensorFlow** for enhanced user engagement and product relevance.\nImplemented **Redis** caching strategies, improving response times and reducing database load by over **30%** during peak operations.\nExecuted feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes** for controlled rollouts and A/B testing, significantly mitigating deployment risks.\nBuilt secure payment workflows with **Stripe**, **PayPal**, and **Razorpay**, guaranteeing compliance with **PCI** standards and safeguarding sensitive customer data.\nApplied role-based access control (RBAC) and **OAuth 2.0** to ensure secure access control and adherence to **GDPR** compliance across user and admin interactions."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tAngular\n\tReact\n\tVue\n\n**API Technologies:**\n\tOAuth2\n\tJWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tSQL\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n**Other:**\n\tMachine Learning\n\tMLflow\n\tAirflow\n\tKubeflow\n\tProblem Solving\n\tHybrid Work\n\tContinuous Learning\n\tKeycloak (OIDC, RBAC)\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tRedis",
  "apply_company": "Tuidi"
}