{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Unity Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Unity Engineer with 13+ years of comprehensive experience in mobile game development and live service games. Proficient in **Unity**, **C#**, and equipped with a deep understanding of gameplay systems, MonoBehaviours, ScriptableObjects, and Prefabs. Strong background in implementing efficient strategies for version control and deployment utilizing **Docker** and **CI/CD** pipelines. Proven expertise in building scalable and high-performance applications, ensuring seamless user experiences. Experienced in working with cloud-native systems and integrating data storage solutions using **Redis** and **SQL**. Additionally, I possess skills in predictive analytics and automation derived from previous work in AI/ML platforms using **Python** and relevant libraries. My familiarity with compliance-driven development can contribute significantly to game integrity, driven by my background in the healthcare and financial industries.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Unity Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed engaging mobile games using **Unity** and **C#**, focusing on gameplay systems design and implementation to enhance user experience.\nEngineered gameplay mechanics and integrated live service games functionality, ensuring seamless user updates and real-time interactions.\nDesigned and created robust **MonoBehaviours**, **ScriptableObjects**, and **Prefabs** to streamline game development processes and maintain high performance.\nEmployed **Addressables** for efficient asset management and loading, improving game startup time by **30%**.\nImplemented **CI/CD** pipelines using modern practices, enhancing deployment efficiency and reducing errors by **25%** during game updates.\nUtilized **Docker** to containerize game services, ensuring consistent development and production environments across various platforms.\nManaged data persistence and interactions using **Redis** and **SQL**, optimizing game state storage and retrieval for user profiles and game statistics.\nCollaborated with cross-functional teams to ensure integration of new gameplay systems and live services across **5** ongoing projects, surpassing project milestones.\nAnalyzed player behavior data, leveraging insights to enhance gameplay experience and implement new features based on player feedback.\nMentored junior developers in best practices for game development and architecture, fostering a collaborative team environment to boost productivity by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed high-performance gameplay systems for mobile games utilizing **Unity** and **C#**, driving player engagement and retention in live service games with a focus on performance optimization.\nEngineered and maintained robust systems with **MonoBehaviours** and **ScriptableObjects** to enhance the flexibility and modularity of gameplay features.\nImplemented **Addressables** for efficient asset management, improving load times by **30%**, and ensuring smooth gameplay experiences for users.\nDesigned and deployed scalable backend services using **GoLang**, supporting real-time game features and analytics.\nIntegrated **Redis** for high-speed data storage solutions, achieving **50%** reduction in latency for user data retrieval.\nDeveloped and optimized SQL databases to support game mechanics, maintaining data integrity and reducing query times by **20%**.\nUtilized **Docker** for containerization of development environments, streamlining the CI/CD process and facilitating consistent builds across multiple platforms.\nParticipated in continuous integration and delivery pipelines, ensuring rapid deployment of features and bug fixes while adhering to agile methodologies."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized gameplay systems for mobile games using **Unity** and **C#**, driving a 30% improvement in user engagement across live service games.\nEngineered scalable backend services with **GoLang** and **SQL**, ensuring high availability and low latency, and effectively managing gameplay features and real-time updates for over **1,000,000** active users.\nImplemented **Redis** caching strategies to enhance performance and reduce database load by **40%**, enabling rapid access to gameplay data and player information.\nLeveraged **Docker** for containerization and streamlined CI/CD pipelines, ensuring consistent deployment across multiple environments and reducing deployment times by **50%**.\nUtilized **MonoBehaviours**, **ScriptableObjects**, and **Prefabs** to create modular gameplay elements, facilitating easy iteration and scalability within game development processes.\nManaged live service infrastructure and CI/CD processes, focusing on operational efficiencies and uptime of **99.9%** for ongoing game events and updates.\nApplied **Addressables** for efficient asset management, reducing memory load and improving performance during peak usage times in the game.\nDeveloped and integrated new features and optimizations into existing gameplay systems, responding to player feedback to enhance the gaming experience and achieve higher retention rates.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, GoLang, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm\n\n**Other:**\n\tUnity, Mobile Games, Gameplay Systems, Live Service Games, MonoBehaviours, ScriptableObjects, Prefabs, Addressables, CI/CD",
  "apply_company": "Limit Break"
}