{
  "name": "Rei Taro",
  "role_name": "Senior Quality Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Quality Engineer with over 10 years of robust experience in implementing and testing distributed systems, focusing on performance tuning and observability. Proficient in utilizing **Kubernetes**, **EKS**, **Chaos Engineering** strategies, and tools like **Chaos Mesh**, **Litmus**, and **AWS Fault Injection Simulator** to enhance system reliability. Skilled in deploying and managing services with **ALB**, **Istio**, and leveraging **GitOps** practices for streamlined operations. Strong background in cloud platforms including **AWS** and **Azure** for building and maintaining scalable infrastructures. Demonstrated success in developing high-performing APIs and automation tools, with proven contributions to significant projects in leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Quality Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Kubernetes** and **EKS** to orchestrate containerized applications, enhancing the scalability and reliability of backend services.\nImplemented **Chaos Engineering** principles using **Chaos Mesh** and **Litmus** to proactively identify system vulnerabilities and improve resilience.\nLeveraged **AWS Fault Injection Simulator** to test application performance under various fault conditions, ensuring robust system behavior.\nManaged infrastructure provisioning and scaling with **Karpenter**, optimizing resource usage based on application demand by 30%.\nIntegrated **ALB** for advanced routing and load balancing, improving application availability and reducing response times by 20%.\nMonitored application health and performance using **CloudWatch** and **Prometheus**, achieving a 95% uptime rate through effective observability practices.\nDeveloped performance tuning strategies for distributed systems, resulting in a 15% increase in transaction processing efficiency.\nCollaborated with cross-functional teams to ensure seamless system integration, compliance, and adherence to best practices in release management."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Kubernetes** for scaling and managing containerized applications within **EKS**, ensuring high availability and reliability of systems.\nImplemented **Chaos Engineering** practices with **Chaos Mesh** and **Litmus** to proactively test system resilience, identifying potential failures before they impact users.\nEmployed **AWS Fault Injection Simulator** to execute controlled experiments aimed at improving system performance and operational excellence.\nDeveloped and maintained observability solutions using **HoneyComb**, **CloudWatch**, and **Prometheus** to provide real-time insights and streamline performance tuning efforts.\nCollaborated with teams to design and implement **GitOps** workflows for continuous integration and deployment, enhancing development efficiency.\nManaged distributed systems effectively to ensure optimal performance across environments, resulting in a **30%** decrease in downtime.\nConducted comprehensive performance tuning initiatives leading to a **15%** increase in system responsiveness and efficiency.\nFacilitated cross-functional collaboration to enhance system integration and drive regulatory compliance for seamless software delivery."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "- Designed and implemented observability strategies for backend services using **Prometheus**, **CloudWatch**, and **HoneyComb**, ensuring real-time monitoring and performance tuning across trading operations.\n- Developed and enhanced distributed systems for trade execution and portfolio management utilizing **Python**, **Flask**, and **PostgreSQL**, resulting in a 20% increase in transaction speed for high-frequency trading.\n- Collaborated with frontend teams to deliver data via REST APIs and WebSocket channels, facilitating smooth interactions with the platform at scale, processing over **100,000** transactions per day.\n- Optimized job queuing and scheduling using **Celery** and **RabbitMQ**, improving task execution times by **30%** and enhancing backend process management efficiency.\n- Implemented comprehensive test suites with **PyTest** and **tox**, significantly reducing QA cycle time by **40%** and ensuring high-quality releases in adherence to internal security protocols and regulatory compliance (MiFID II, GDPR).\n- Leveraged **Kubernetes** and **EKS** for container orchestration, resulting in high availability and scalability of backend microservices across cloud environments.\n- Applied chaos engineering principles with tools like **Chaos Mesh** and **Litmus**, conducting tests to improve system resilience and fault tolerance under varying load conditions.\n- Engaged in GitOps practices for continuous integration and deployment, streamlining the development cycle and maintaining consistency across codebases."
    }
  ],
  "skills": " **Programming Languages**\n\tLanguages: Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFrameworks: FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, GitOps\n\n **Cloud & Infrastructure**\n\tEKS, ALB, Chaos Engineering, Chaos Mesh, Litmus, AWS Fault Injection Simulator, Karpenter, Istio, CloudWatch, Prometheus, HoneyComb\n\n **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, CI/CD, PyTest, Kafka, Distributed Systems, Performance Tuning, Observability",
  "apply_company": "RLDatix"
}