{
  "name": "Tomasz Lee",
  "role_name": "Software Tester",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Software Tester with 9+ years of experience in performance testing, including black-box, gray-box, and regression testing methodologies. Proficient in automation tools and frameworks such as **Selenium WebDriver** and **JMeter**, ensuring high-quality software delivery. Expertise in **AWS**, **Kubernetes**, **Terraform**, and **GitOps** enhances cloud infrastructure and deployment processes. Strong skills in using **New Relic** and **OpenTelemetry** for performance monitoring and optimization. Additionally, I possess solid programming knowledge in **Python** and **Go**, complemented by Shell scripting capabilities, to automate testing and streamline workflows. Recognized for delivering effective testing solutions, collaborating effectively with cross-functional teams, and successfully leading projects to completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Tester",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **Go** for developing automated testing scripts, enhancing testing efficiency by **30%**.\nDesigned and executed comprehensive **performance testing** using **JMeter**, identifying and resolving bottlenecks that improved the application’s load handling capacity by **40%**.\nImplemented **Selenium WebDriver** for **black-box testing**, enabling automated regression tests with a coverage increase of **50%**.\nDeveloped **Shell scripting** tools to streamline testing processes, reducing manual intervention and time spent by **25%**.\nLeveraged **Terraform** to provision testing environments in **AWS**, automating setup processes and ensuring consistency across testing instances.\nAdopted **Kubernetes** for scalable testing infrastructure, allowing for easier management of test deployments and ensuring high availability during load tests.\nIntegrated **New Relic** and **OpenTelemetry** for monitoring the application performance during **system testing**, leading to improved diagnostics and quicker remediation of issues.\nEngaged in **risk-based testing** to prioritize test cases based on critical features, resulting in a **20%** reduction in testing cycle time while ensuring high-risk areas are thoroughly tested.\nExecuted **gray-box testing** techniques to enhance the quality and security of the software by uncovering hidden functionalities and vulnerabilities.\nParticipated in **GitOps** practices to ensure version-controlled environments, facilitating better collaboration within the QA team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **AWS** and **Terraform** to provision and manage cloud infrastructure, ensuring efficient deployment and scalability for testing environments.\nDeveloped automated test scripts using **Python** and **Selenium WebDriver** to conduct automated UI testing, achieving over a **90%** test coverage.\nImplemented performance testing frameworks with **JMeter** to assess system performance under load, resulting in a **40%** improvement in response times.\nExecuted risk-based testing strategies to prioritize test cases effectively, leading to a **20%** reduction in critical production bugs.\nCollaborated with development teams to analyze test results and utilize tools such as **New Relic** and **OpenTelemetry** for performance monitoring and optimization.\nConducted various types of testing including black-box, gray-box, system, regression, and exploratory testing, ensuring comprehensive test coverage throughout the software development lifecycle.\nParticipated in continuous integration and deployment with **GitOps**, integrating automated tests in CI/CD pipelines for smooth release cycles.\nContributed to the creation of documentation and reports on test findings and metrics to facilitate stakeholder communication.\nMentored junior team members in testing methodologies and tools, enhancing team skills and effectiveness.\nReviewed test plans and execution strategies, fostering a culture of quality and precision across development teams."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Executed **black-box testing**, **gray-box testing**, and **performance testing** methodologies to validate software functionality and performance across various applications.\nDeveloped automated test scripts using **Selenium WebDriver**, enhancing test coverage and reducing manual testing efforts by **30%**.\nCollaborated with development teams to implement **GitOps** practices, improving deployment frequency and reliability of software releases by **25%**.\nUtilized **Terraform** for infrastructure as code to streamline environment setup and ensure consistency across **AWS** deployments.\nConducted **risk-based testing** to prioritize testing activities, leading to a **15%** reduction in post-release defects.\nIncorporated **OpenTelemetry** and **New Relic** for monitoring application performance, enabling proactive issue resolution and system optimization.\nPerformed **system testing** and **regression testing** to validate functionality after enhancements, ensuring that existing features remained unaffected by new changes.\nEngaged in **exploratory testing** to uncover unexpected issues and ensure the software met quality standards before release.\nDocumented testing processes and results, fostering communication and knowledge sharing among development and testing teams.\nParticipated in code reviews and daily standups, aligning testing activities with project timelines and goals."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, Go, Shell scripting\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Kubernetes, GitOps\n\n**Cloud & Infrastructure**\n\tTerraform, New Relic, OpenTelemetry\n\n**Other**\n\tUX/UI Design, Git, GitHub, Apache Kafka, RabbitMQ, Redis, Selenium, Moq, Cypress, JMeter, Jest, Solidity, Ether.js, Web3.js, Ethereum, black-box testing, gray-box testing, performance testing, risk-based testing, system testing, regression testing, exploratory testing"
}