{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Experienced Backend Engineer with 8 years of expertise in building robust solutions, specializing in **JavaScript**, **Node.js**, and **Python**. I excel in API integration, including extensive work with **OpenAI APIs**, **Gemini APIs**, and **Anthropic APIs** for enhanced functionality. My strong skills in ETL pipelines and developing conversational interfaces support the efficient implementation of **Chatbot development** and **prompt engineering**, ensuring seamless user interactions.\n\nI have a solid background in utilizing **PostgreSQL** for database management, alongside building scalable systems that adhere to compliance standards. With a proven track record of creating efficient backend services, I leverage modern frameworks and libraries to optimize performance and maintain security. My attention to detail ensures high-quality code and operational reliability, contributing to successful project outcomes in the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed robust API integration solutions using **Node.js** and **JavaScript**, enhancing communication between various application components and ensuring seamless data flow.\nImplemented advanced **ETL pipelines** to efficiently process and transform large datasets from healthcare and financial domains using **Python**.\nDesigned and maintained strong database architecture solutions with **PostgreSQL**, optimizing for fast query responses and data integrity.\nIntegrated diverse **AI APIs** including **OpenAI**, **Gemini**, and **Anthropic** into backend systems to deliver cutting-edge features, such as conversational interfaces and intelligent document parsing.\nDeveloped and optimized chatbot functionalities, utilizing creative **prompt engineering** to improve user interaction and response accuracy.\nLed the design of document and file parsing utilities to enhance data ingestion processes, enabling real-time insights and decision-making.\nApplied best practices in backend development, ensuring high-performance and scalable system architecture capable of handling **100,000+** concurrent requests.\nUtilized cloud technologies and containerization strategies to maintain high availability with deployments on **AWS** and **Azure** services.\nCollaborated closely with front-end teams to ensure seamless integration of **API** functionalities, improving the overall user experience of applications.\nMonitored and refined backend performance following deployment, ensuring uptime and response times under **200ms** for critical APIs."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **Node.js (NestJS/Express)** to develop and modernize scalable backend systems, enhancing throughput for high-volume transactions by **25%**.\nImplemented robust **API integration** with **PostgreSQL** that streamlined data access and supported a microservices-based architecture.\nDesigned and executed ETL pipelines using **Python**, ensuring efficient ingestion of data from internal and third-party sources with a processing time reduced by **40%**.\nIntegrated AI-powered functionalities through **OpenAI APIs**, **Gemini APIs**, and **Anthropic APIs** to enhance the backend with intelligent query handling and document parsing capabilities for user interfaces.\nDeveloped efficient conversational interfaces and chatbots, employing comprehensive **prompt engineering** techniques, optimizing response accuracy by over **80%**.\nCollaborated with the frontend team to ensure seamless data flow and integrity between the backend and user-focused applications, fostering user engagement and satisfaction.\nOptimized and maintained existing systems to ensure peak performance and reduced latency, achieving a response time improvement of **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services leveraging **Node.js** for API integration and **PostgreSQL** for efficient database management, ensuring high availability and scalability across e-commerce functionalities like checkout and order processing.\nUtilized **Python** to develop data processing and ETL pipelines, enabling seamless integration with AI APIs including **OpenAI APIs**, **Gemini APIs**, and **Anthropic APIs** for enhanced feature capabilities.\nEngineered interactive and responsive conversational interfaces through **Chatbot development** and **Conversational interfaces**, achieving a user engagement increase of **30%** based on user feedback.\nImplemented robust file and document parsing mechanisms, ensuring data accuracy and integrity while reducing manual processing time by **25%**.\nCollaborated on the development of AI-driven recommendation systems, utilizing prompt engineering to personalize user experiences and optimize product discovery based on behavioral analytics, effectively boosting conversion rates by **20%**.\nStrategized and deployed feature flags using **LaunchDarkly**, enabling controlled rollouts and A/B testing to minimize deployment risks during major updates.\nEngaged in continuous improvement practices by integrating feedback into the development cycle, successfully enhancing application performance and responsiveness across platforms by **15%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI integration, AI APIs, OpenAI APIs, Gemini APIs, Anthropic APIs, Chatbot development, Conversational interfaces, Prompt engineering, Document parsing, File parsing\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Certbot\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt"
}