{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with a robust skill set in **React**, **CI/CD**, and **Postgres**, possessing 13+ years of experience in delivering high-performance applications within the healthcare and financial sectors. Proficient in **Java**, **Kotlin**, and **Springboot**, with a proven track record of developing dynamic and scalable applications. Adept in utilizing tools like **CircleCI** and **Spinnaker** to optimize workflows and enhance deployment efficiency.\nStrong problem-solving abilities and keen attention to detail, complemented by hands-on expertise in full stack development. Experienced in cloud technologies, deploying applications on AWS and Azure, and creating AI/ML-powered platforms that leverage predictive analytics and real-time data processing. Familiar with compliance standards including HIPAA and PCI DSS, and skilled in MLOps practices with tools such as MLflow and Airflow.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed robust applications using **React** and **Spring Boot**, ensuring high-quality code through meticulous attention to detail and problem-solving strategies.\nDesigned and implemented CI/CD pipelines leveraging **CircleCI** and **Spinnaker** for automated testing and deployment, achieving a 40% reduction in release times.\nMaintained and optimized databases using **Postgres**, ensuring <100ms response times for user queries and data transactions in high-load environments.\nCollaborated on cross-functional teams to innovate solutions in dynamic environments, showcasing STEM analytical skills to enhance application performance and user experience.\nUtilized **Ruby on Rails** and **Kotlin** for backend development, enhancing service architecture with seamless integration of new features and functionalities.\nConducted code reviews and pair programming sessions to foster knowledge sharing and maintain code quality across the development team.\nExecuted complex problem-solving techniques and strategic project management to deliver projects on schedule, maintaining a 95% on-time completion rate.\nEngaged in continuous learning to stay updated with evolving technologies and best practices within the **software engineering** landscape."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and maintained responsive web applications using **React** (18) and **Ruby on Rails**, ensuring user-centric designs that enhance customer experience.\n• Implemented CI/CD pipelines using **CircleCI** and **Spinnaker**, automating deployment processes to improve software delivery time by **30%**.\n• Designed backend services leveraging **Kotlin** and **Springboot** for financial platforms, ensuring robust performance and reliability in handling high-volume transactions.\n• Engineered database solutions with **Postgres**, optimizing queries for performance improvements of **25%** in data retrieval.\n• Applied problem-solving skills to troubleshoot and optimize existing applications, improving overall system responsiveness and reducing downtime by **15%**.\n• Participated in code reviews and maintained high attention to detail, ensuring adherence to coding standards and best practices.\n• Collaborated with cross-functional teams to deliver innovative solutions, enhancing product offering and driving increased customer satisfaction.\n• Employed effective STEM techniques to assess and address complex technical challenges, facilitating the development of scalable software solutions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained robust frontend applications using **React** (18) and back-end services leveraging **Kotlin** and **Spring Boot**, ensuring high performance and scalability across various components of a global e-commerce platform.\nUtilized **Postgres** for distributed data storage, ensuring efficient data access and managing high-traffic workloads effectively.\nImplemented CI/CD processes with **CircleCI** and orchestrated deployments using **Spinnaker** to enhance development productivity and streamline release cycles.\nEngineered solutions focusing on problem-solving and attention to detail, resulting in a reduction of deployment times by **30%** and improved system reliability.\nCollaborated on cross-functional teams to design APIs and services following best practices of software engineering, ensuring agile delivery and high-quality code.\nFacilitated troubleshooting and debugging sessions, applying STEM principles to resolve issues effectively, enhancing overall system functionality by **25%**.\nDeveloped features with a strong emphasis on maintainability and performance, leading to a significant reduction in technical debt over a period of **6 months**.\nActively participated in code reviews, shared knowledge on best practices in **Ruby on Rails**, and contributed to team knowledge resources.\nContributed to a culture of continuous improvement by fostering innovation in processes and technology adoption in line with modern software practices."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tReact,\n\n**Programming Languages**\n\tPython,\n\tJavaScript/TypeScript,\n\tKotlin,\n\tJava,\n\tRuby,\n\n**Backend Frameworks**\n\tFastAPI,\n\tFlask,\n\tDjango,\n\tSpringboot,\n\n**Databases**\n\tPostgreSQL,\n\tMySQL,\n\tMongoDB,\n\n**DevOps**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tCircleCI,\n\tSpinnaker,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose,\n\n**Serverless and Cloud Functions**\n\tAWS: ECS,\n\tLambda,\n\tRDS,\n\tS3,\n\tAzure: App Services,\n\tBlob Storage,\n\tSQL Database,\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC),\n\tOAuth2,\n\tJWT,\n\tNginx,\n\tLet’s Encrypt,\n\tCertbot,\n\n**Other**\n\tMLflow,\n\tAirflow,\n\tKubeflow,\n\tSTEM,\n\tproblem solving,\n\tattention to detail,\n\tCI/CD",
  "apply_company": "AlphaSights"
}