{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Sales Engineer with 13+ years of experience in enterprise monitoring and event management, specializing in delivering high-performance SaaS applications. Proficient in **AWS**, **Azure**, and **GCP**, with hands-on expertise in monitoring tools such as **Nagios**, **Datadog**, and **Splunk**. Strong background in leveraging **Python** and **JavaScript** for effective communication and presentation to stakeholders. Experienced in managing complex network environments and utilizing tools like **ServiceNow** and **Jira** for streamlined operations. \nDemonstrated ability in building AI/ML-powered platforms that enable predictive analytics and automation, and implementing cloud-native systems with a focus on compliance using HIPAA and PCI DSS standards. Recognized for skill in developing both frontend and backend solutions using frameworks like **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**, and proficient in deploying microservices and event-driven architectures. Well-versed in MLOps practices including model training and orchestration with **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS**, **Azure**, and **GCP** for enterprise monitoring and event management to support high-availability SaaS solutions.\nEmployed **Python** and **JavaScript** to design robust monitoring solutions, providing insights into system performance and reliability for client presentations.\nImplemented scalable infrastructures combining **Nagios**, **Datadog**, and **Splunk** for real-time performance tracking, achieving a **99%** uptime rate across monitored services.\nCollaborated with cross-functional teams using **Jira** to manage project timelines and deliverables, streamlining communication and improving project completion rates by **30%**.\nDeveloped comprehensive documentation and presentations for stakeholders, enhancing understanding of system capabilities and ensuring alignment on project goals.\nManaged deployments across **Linux** and **Windows** environments, ensuring smooth transitions for software at client sites with minimal service interruption of less than **2 hours** during major updates.\nLiaised with clients to deliver tailored solutions that integrate with existing workflows, ensuring customer satisfaction and decreasing churn by **15%**.\nCreated custom reports and dashboards for clients using **Python** data analysis libraries, providing insights that led to a **20%** increase in operational efficiency.\nConducted training and workshops for clients on using monitoring tools and interpreting data, frequently receiving commendations for presentation clarity and effectiveness.\nEstablished networking protocols and security measures for data integrity, leading to zero security breaches within the scope of project deployments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **cloud services** including **AWS**, **Azure**, and **GCP** to design and implement scalable solutions for enterprise monitoring in high-demand financial environments, driving an increase in system efficiency by **30%**.\nUtilized **event management** tools such as **ServiceNow** and **Jira** to streamline incident resolution processes, resulting in a **25%** improvement in response time for operational issues.\nImplemented comprehensive **enterprise monitoring** strategies using **Nagios**, **Datadog**, and **Splunk** to enhance visibility and performance tracking of core systems, achieving detailed insights and reducing downtime occurrences by **15%**.\nDeveloped interactive dashboards and reports to visualize performance metrics for stakeholders, enhancing data presentation and communication effectiveness within teams.\nEngineered core financial platforms utilizing **Python** (FastAPI, Django) and **JavaScript** (Node.js, React 18, Vue 3) that improved scalability and user experience, supporting transactions for over **100K** users.\nFacilitated effective communication between technical teams and non-technical stakeholders, utilizing advanced **presentation** skills to drive user adoption and satisfaction metrics.\nExecuted data-driven strategies for operational enhancements through detailed **network** analysis, demonstrating impactful results in customer engagement and service delivery."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented **enterprise monitoring** solutions using **Datadog** and **Nagios** to oversee system performance and ensure high availability of backend services in a global e-commerce structure, achieving an uptime of **99.9%**.\nDelivered **event management** strategies that improved incident response times by **30%** utilizing tools like **Splunk** for log aggregation and analysis.\nCollaborated on **SaaS** application enhancements, integrating with **AWS**, **Azure**, and **GCP** for cloud-based solutions that supported scalability for checkout and order fulfillment processes.\nUtilized **Python** for backend development and **JavaScript** for frontend applications, ensuring a seamless user experience that translated to a **25%** increase in customer satisfaction scores.\nConducted presentations and demonstrations with stakeholders to showcase optimized workflows and solutions, leading to a **15%** growth in user adoption targeted by product teams.\nFacilitated efficient communication across teams using **Jira** for project management, improving transparency in task delegation and progress tracking by **40%**.\nMaintained a secure and reliable operating environment across both **Linux** and **Windows** platforms, enabling robust support for development and production systems.\nStrengthened network communication protocols and established performance benchmarks that contributed to optimized application response times and reduced latency on key modules.\nLeveraged effective presentation skills to articulate technical solutions and foster stakeholder relationships, propelling project buy-in and alignment on deliverables."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, GCP\n\n**Other:**\n\tCI/CD, enterprise monitoring, event management, SaaS, Nagios, Datadog, Splunk, ServiceNow, Jira, Linux, Windows, network, communication, presentation, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "BigPanda"
}