{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Engineer Software",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Engineer Software with 8 years of experience, I excel in **C#** development and **agile** methodologies, focusing on **system architecture** and **performance optimization** for high-performance applications. My technical proficiency includes **CI/CD** practices encompassing automation and code reviews to ensure code quality and efficiency in software development.\nI have a proven track record in full-stack development, utilizing modern frameworks like **React**, **Next.js**, and **Node.js**, while also leveraging **Python** in backend services with technologies such as **Django** and **FastAPI**. My expertise extends to cloud platforms, specifically **AWS** and **Azure**, which I utilize for deploying scalable applications that adhere to compliance standards like HIPAA and PCI DSS.\nI also possess hands-on experience in elite technical areas such as microservices architecture and real-time data processing, allowing me to build secure, robust applications. I am adept at integrating AI/ML capabilities into enterprise-grade platforms, fostering intelligent automation and predictive analytics. Additionally, I have developed machine learning pipelines with tools like **MLflow**, **Airflow**, and **Kubeflow**, ensuring smooth deployment and monitoring of ML models in production environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer Software",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Focused on performance optimization and agile methodologies to enhance software development processes.\nConducted code reviews to ensure adherence to **C#** best practices and system architecture standards.\nArchitected and developed scalable applications using **C#** within a microservices architecture, ensuring high availability and efficient resource utilization.\nImplemented robust CI/CD pipelines to automate deployment and testing, enhancing delivery speed and software quality.\nCollaborated with cross-functional teams in an agile environment to gather requirements and deliver software solutions that meet business objectives.\nDelivered applications leveraging advanced system architecture principles to support complex financial and healthcare functionalities.\nOptimized existing applications for performance, achieving a **30%** increase in response times through targeted improvements.\nLed initiatives for code quality improvement, significantly reducing technical debt and increasing maintainability metrics by **25%**.\nDesigned and employed automated testing strategies to bolster software reliability, leading to a **40%** reduction in production bugs.\nMentored junior engineers in **C#** development, agile practices, and effective software design, fostering a culture of continuous improvement and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Employed **C#** within scalable software development practices, enhancing system architecture and performance optimization.\nAdopted agile methodologies to streamline project workflows, ensuring timely delivery and high-quality code standards through consistent code reviews and CI/CD practices.\nLed the transformation of financial platforms by integrating microservices architecture using Node.js (NestJS/Express) and Python (FastAPI, Django), improving system maintainability for high-volume transactions.\nImplemented dynamic front-end applications through **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, incorporating **Redux Toolkit** and **Tailwind CSS** to optimize the user experience across diverse financial applications.\nDeveloped real-time transaction monitoring dashboards utilizing **React**, **D3.js**, and **Power BI Embedded** to provide actionable insights and support operational decisions in tracking anomalies with a clear emphasis on performance monitoring.\nOrchestrated the integration of **Kafka**, **RabbitMQ**, and **Azure Service Bus** for an event-driven architecture that enhanced real-time processing and communication across transactions.\nConstructed ETL pipelines leveraging **Python**, **Apache Airflow**, and **Azure Data Factory** to facilitate efficient batch and real-time data ingestion from both internal and external sources.\nDesigned AI/ML-powered fraud detection systems utilizing **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, enabling proactive identification of suspicious activities based on transaction patterns.\nCreated and managed ML pipelines for various applications such as credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, embedding real-time decision-making capabilities in backend services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and optimized backend services using **C#**, focusing on system architecture and performance optimization to ensure high availability and scalability for critical e-commerce functionalities.\n• Implemented CI/CD practices to streamline deployment processes, enhancing development efficiency and ensuring rapid delivery of software updates.\n• Conducted comprehensive code reviews to maintain high code quality and foster continuous improvement within the engineering team while adhering to agile methodologies.\n• Collaborated on agile teams to design and implement effective software solutions, driving project success through iterative development and feedback.\n• Engineered robust system architectures for high-performance applications, achieving up to **99.9% uptime** across multiple service modules.\n• Spearheaded performance optimization initiatives resulting in a **30% reduction** in page load times and improved user experience metrics.\n• Led and mentored a team of developers, enhancing overall skill sets and ensuring alignment with best coding practices and agile workflows.\n• Applied modern testing frameworks to ensure software reliability and maintainability throughout the development lifecycle, achieving **80% unit test coverage** for all new features.\n• Coordinated cross-functional collaboration to integrate third-party APIs and services, ensuring seamless functionality and enhanced service offerings."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, C#\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tMLflow, Airflow, Kubeflow\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\tAgile, System Architecture, Performance Optimization, CI/CD, Code Reviews, Software Development",
  "apply_company": "Paylocity"
}