{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Data Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Data Engineer with 10+ years of experience specializing in **Master Data Management**, **Data Governance**, and **Data Integration**. Proficient in SQL and relational databases, with a strong background in **Data Warehouse** solutions and reporting frameworks. Practical experience in building efficient data pipelines, ensuring data validation and quality through thorough data testing. Adept at working with systems like **Oracle Fusion**, **Oracle E-Business Suite**, and **Salesforce CRM** to seamlessly integrate data across platforms. Solid understanding of **Agile PLM** methodologies to drive data projects to successful completion while adhering to compliance standards. \nAdditionally, skilled in modern programming technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise across the full stack using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in cloud-native deployments on **Azure** and **AWS** and have led the development of enterprise platforms embedding AI/ML capabilities for real-time analytics, automation, and intelligent decision-making. A strong advocate for building secure, maintainable solutions that have a positive impact on business outcomes.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tImplemented **Master Data Management** strategies to ensure data consistency and integrity across healthcare and finance applications, utilizing tools like **Oracle Fusion** and **Salesforce CRM**.\n•\tEstablished robust **Data Governance** frameworks, ensuring compliance with regulatory standards and optimizing data accessibility and security according to protocols such as HIPAA and GDPR.\n•\tExecuted **Data Integration** processes for seamless data flow between multiple **Relational Databases** including **PostgreSQL** and **MongoDB**, ensuring efficient storage and retrieval for analytics.\n•\tDesigned and maintained a comprehensive **Data Warehouse** architecture, enabling complex reporting and analysis, incorporating technologies like **SQL** and advanced analytics tools.\n•\tConducted in-depth **Data Validation** and **Data Testing** procedures, ensuring high data quality and reliability, and developed automated testing strategies using tools like **Postman** and **Jest**.\n•\tLeveraged agile methodologies to support continuous improvement in data management processes, and collaborated within cross-functional teams to enhance performance and reporting capabilities.\n•\tSpearheaded projects to integrate advanced reporting solutions, enabling stakeholders to derive decision-making insights from data visualizations and dashboards, with technologies such as **Power BI Embedded** and **Chart.js**.\n•\tImplemented a structured, version-controlled approach to manage data processing workflows, enhancing accountability and traceability of data assets.\n•\tOptimized data ingestion pipelines for high-volume datasets, supporting up to **1 million** records per day, to ensure timely access to critical financial and healthcare information."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented robust **Data Integration** strategies to enhance the flow of financial data through various systems, ensuring accurate and timely reporting.\nExecuted **Master Data Management** principles to maintain high-quality data standards and governance across financial platforms, leading to a **30%** increase in data accuracy.\nDeveloped automated reporting solutions and dashboards utilizing SQL and **Oracle Fusion** to provide actionable insights for decision-makers, optimizing operational efficiency by **25%**.\nEngaged in **Data Governance** practices to comply with regulatory requirements, establishing protocols for data validation and testing that reduced discrepancies by **40%**.\nCollaborated in agile methodologies for projects involving modern data warehousing solutions, effectively utilizing **Oracle E-Business Suite** to streamline data processes across departments.\nLeveraged relational databases in designing scalable data architectures that supported large-scale data operations, enhancing data accessibility for analytical purposes.\nParticipated in regular interactions with cross-functional teams to drive improvements in reporting capabilities and data utilization, achieving alignment with key business objectives.\nUtilized **Salesforce CRM** to track customer data, resulting in improved customer insights and a increase in sales effectiveness by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Mastered Data Management to ensure data integrity and consistency across systems, maintaining a robust framework for reliable data governance.\nEngineered data integration solutions utilizing **SQL** and relational database platforms like **Oracle Fusion** and **Oracle E-Business Suite**, managing **data warehousing** for high-volume transactional data.\nImplemented thorough data validation strategies and robust testing procedures, achieving a **99% accuracy** rate in data reporting and analytics.\nCreated comprehensive reporting frameworks to generate actionable insights, leveraging **Agile PLM** processes to streamline data workflows.\nSupported Salesforce CRM integration, enhancing customer insights through efficient data management practices and responsive reporting techniques.\nUtilized data governance protocols to uphold regulatory compliance and security standards while ensuring seamless data accessibility for stakeholders across the organization.\nSuccessfully participated in cross-functional teams, contributing to **data governance** initiatives that enhanced overall data quality and accessibility throughout the organization.\n\n"
    }
  ],
  "skills": "Master Data Management, Data Governance, Data Integration, Reporting, Data Warehouse, Oracle Fusion, Oracle E-Business Suite, Agile PLM, Salesforce CRM, SQL, Relational Databases, Data Validation, Data Testing,\n\n**Programming Languages:**\n\tPython, JavaScript, TypeScript,\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django,\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular,\n\n**API Technologies:**\n\tJWT, OAuth2,\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services,\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis,\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD,\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose,\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Hach"
}