{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Android Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Android Engineer with 13+ years of experience delivering high-performance applications in the healthcare and financial industries. Proficient in **Java**, **Kotlin**, and **Android SDK**, with extensive knowledge of **Android architecture**, **Bluetooth LE**, and **Coroutines**. Experienced with **diagnostic tools** and **unit testing** methodologies to ensure robust application performance.\nStrong background in **C** and **C++**, coupled with expertise in **Linux** to optimize Android applications. Proven ability to communicate effectively in English and collaborate within cross-functional teams. Beyond mobile development, well-versed in deploying web applications using **JavaScript/TypeScript**, **Python**, and frameworks such as **React**, **Next.js**, and **Vue**, while leveraging **FastAPI** and **Django** for backend solutions. Skilled in implementing **microservices**, **event-driven architectures**, and **CI/CD pipelines** within cloud environments such as **AWS** and **Azure**. Adept at ensuring compliance with industry standards such as HIPAA and PCI DSS while integrating AI/ML solutions for enhanced decision-making.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Android Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Kotlin**, **Android SDK**, and **Coroutines** to design and build advanced mobile applications for Android, ensuring seamless integration with Bluetooth LE for enhanced device connectivity and user interaction.\nImplemented robust **unit testing** strategies using **JUnit** and **Mockito** to ensure application reliability and maintainability, achieving over **90% code coverage** across all modules.\nEmployed **RxJava** for implementing reactive programming patterns, enhancing application responsiveness and user experience through efficient background processing.\nLeveraged **AOSP** (Android Open Source Project) to customize and optimize application performance, ensuring compatibility with a variety of Android devices, including managing **Android architecture** patterns for scalable solutions.\nDeveloped and maintained high-quality code using **C** and **C++**, optimizing critical performance bottlenecks and memory management for resource-intensive applications.\nCollaborated effectively with cross-functional teams, utilizing **Gerrit** for code review processes to ensure adherence to coding standards and best practices.\nEngaged in comprehensive debugging using **Android debugging tools**, ensuring rapid identification and resolution of issues, leading to a **30% reduction** in post-launch bugs.\nEffectively communicated technical concepts in **English** to stakeholders and team members, facilitating clear understanding and alignment on project objectives and timelines.\nDesigned and implemented a continuous integration pipeline using **Make** and **CMake**, significantly improving build and deployment efficiency by **40%** compared to previous methods.\nPerformed system-level programming and integration of custom hardware components using **HAL** (Hardware Abstraction Layer) to enhance functionality and ensure smooth user experiences across various mobile devices."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Android SDK** to develop high-performance mobile applications, ensuring seamless user experience and efficient resource management across platforms.\nImplemented **Kotlin** and **Java** for robust application architecture, enhancing maintainability and scalability through best programming practices.\nEmployed **Coroutines** and **RxJava** for asynchronous programming, achieving responsive UI and fluid performance in high-demand scenarios.\nLeveraged tools like **ADB** for debugging and performance optimization, leading to a **20%** reduction in app load times across multiple releases.\nCollaborated in a **Linux** environment to streamline build processes using **Make** and **CMake**, resulting in a **30%** improvement in build speed metrics.\nConducted unit testing protocols, increasing code reliability and reducing critical bugs by **15%** before deployment.\nContributed to team discussions in fluent **English**, sharing insights on **Bluetooth LE** integration to enhance app functionalities.\nParticipated in code reviews using **Gerrit**, promoting code quality and fostering a culture of continuous improvement in software development practices."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized Android applications utilizing **Kotlin** and the **Android SDK** to enhance user engagement and streamline app performance, ensuring seamless integration with Bluetooth LE functionalities.\nImplemented robust unit testing frameworks to ensure code integrity and application reliability, achieving a **95% code coverage** goal in the test suite and reducing crash rates by **30%** post-launch.\nUtilized **Coroutines** and **RxJava** for efficient asynchronous programming, leading to a **20%** improvement in response time for user interactions and background processes.\nEngaged in continuous integration and deployment using **Gerrit** and **Linux**, promoting collaboration and enhancing version control practices among the development team, which contributed to a **50%** decrease in deployment cycles.\nInvolved in the development of hardware abstraction layers (HAL) to facilitate compatibility with various Android devices, thereby enhancing device functionality and user experience.\nLeveraged **CMake** and **Make** build systems for efficient project setup and dependency management, ensuring smooth builds across multiple environments.\nApplied debugging tools effectively to troubleshoot issues and optimize application performance, successfully reducing the average debug time by **40%**.\nCommunicated effectively in English with cross-functional teams to ensure alignment on project goals and deliverables, maintaining a clear understanding of requirements and expectations throughout the development lifecycle.\nPioneered improvements in Android architecture design, resulting in a modular and maintainable codebase that supports future scalability and feature expansions.\nDeveloped and enhanced features by using **C** and **C++**, enriching the app's capabilities while ensuring consistency and performance across varying Android OS versions."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Kotlin, C, C++, Java\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t- Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\t- debugging tools, Linux, Soong\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Android SDK, ADB, Bluetooth LE, Coroutines, RxJava, Make, unit testing, Gerrit, English communication",
  "apply_company": "co.brick"
}