{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Java Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior Java Engineer with over 10 years of experience in crafting high-performance software solutions, specializing in **Java**, **Spring Boot**, and **Microservices**. Adept at leveraging **AWS** for cloud deployment and management, with a proven track record of building scalable, secure systems. Strong experience in event-driven architectures utilizing technologies such as **Kafka**, and implementing RESTful APIs compliant with **OpenAPI** standards. Proven success in agile environments with a focus on **Scrum** methodologies to facilitate efficient project delivery. \nAlongside my core technical expertise, I possess a solid foundation in full-stack development with proficiency in **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, **FastAPI**, and **Django**. My experience includes leading cross-functional teams to deliver enterprise solutions that integrate AI/ML capabilities for actionable insights and automation. Committed to developing maintainable applications in compliance with industry standards such as HIPAA and PCI DSS, I am passionate about creating impactful software solutions that enhance user experiences.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained scalable microservices architectures using **Java** and **Spring Boot**, ensuring high performance and reliability in applications by adhering to industry best practices.\n•\tImplemented cross-functional integration with **Kafka** for messaging and data streaming, achieving **95%** message delivery reliability and reduced latency in processing by **30%**.\n•\tDesigned APIs following the **OpenAPI** specification to streamline interactions within microservices, enhancing documentation accessibility and improving onboarding processes for developers by **40%**.\n•\tCollaborated in an Agile/Scrum environment, actively participating in sprint planning, daily stand-ups, and retrospectives to ensure timely delivery of project milestones.\n•\tManaged cloud resources on **AWS**, leveraging services such as EC2, RDS, and Lambda for deploying and scaling applications, achieving cost reductions of **20%** through optimized cloud architecture.\n•\tConducted code reviews and mentor junior developers, fostering knowledge sharing and maintaining code quality standards across the team, resulting in a **15%** improvement in software delivery timelines.\n•\tIntegrated **Docker** for containerization of microservices, enabling efficient deployment and scalability across development and production environments.\n•\tUtilized advanced debugging and profiling tools to monitor application performance, achieving response time improvements by **25%**.\n•\tDeveloped comprehensive automated test suites with tools such as JUnit and Mockito, enhancing the testing coverage by **50%** and ensuring the quality of released features.\n•\tActively participated in architectural discussions and contributed to the continuous improvement of development processes.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring Boot** to design and implement scalable **microservices** architectures, enhancing system flexibility and responsiveness in high-volume transaction environments.\nLeveraged **AWS** for deploying and maintaining cloud-based solutions, ensuring high availability and efficient resource management across financial platforms.\nIntegrated **Kafka** for real-time data streaming and event-driven communication, enabling timely transaction processing and alerting mechanisms within the system.\nCollaborated with cross-functional teams using **Scrum** methodologies, ensuring agile development cycles and effective sprint planning for feature rollouts and enhancements.\nDeveloped comprehensive API specifications using **OpenAPI**, facilitating seamless integration between microservices and third-party applications.\nEngineered efficient ETL processes utilizing Python and **Apache Airflow**, ensuring timely data ingestion and transformation for analytics and reporting.\nImplemented monitoring solutions for service reliability and performance metrics, leading to a 30% reduction in system downtime.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized microservices architecture using **Java** and **Spring Boot**, achieving over **99.9%** uptime and ensuring scalable service across production environments.\nEngineered robust backend components integrating **Kafka** for event-driven processing, enhancing data flow efficiency and real-time interaction, resulting in **25%** faster response times on critical functionalities.\nCollaborated in a **Scrum** environment to streamline workflows, enabling delivery of **6 major** releases per year, adhering to agile methodologies and enhancing team performance.\nDesigned RESTful APIs compliant with **OpenAPI** standards, ensuring clear documentation and simplified integration for third-party services.\nUtilized **AWS** cloud services for deploying resilient applications, implementing auto-scaling solutions that reduced operational costs by **30%** while maintaining optimal performance.\nImplemented CI/CD pipelines with automated testing frameworks to enhance deployment frequency by **50%** and improve code quality.\nMaintained coding standards and best practices for secure, maintainable code, achieving a **40%** reduction in bug reports post-deployment.\nContributed to system architecture discussions, focusing on high availability and fault tolerance, enhancing system robustness.\nParticipated in code reviews and team knowledge-sharing sessions, fostering an environment of continuous improvement and collaboration."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOpenAPI, FastAPI, Spring Boot\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tKafka, Microservices, MLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Scrum",
  "apply_company": "Knowmad Mood"
}