{
  "name": "Rei Taro",
  "role_name": "Senior Platform Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-oriented Senior Platform Engineer with over 10 years of experience in designing robust backend systems, especially in blockchain and financial technology domains. Proficient in **Go**, **Rust**, **C++**, and **Scala** for developing high-performance applications, alongside expertise in **Solidity**, **EVM**, and **Foundry** for smart contract development. Strong skills in **CI/CD**, **release pipelines**, and **observability** to ensure efficient deployment and monitoring of services. Proficient in algorithms and data structures, optimizing system performance, and employing cryptographic primitives and Merkle trees in solution architecture. Experienced in working with cloud-native technologies at leading organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Platform Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed and implemented algorithms and data structures using **Go**, **Rust**, and **C++** to enhance system performance in blockchain applications.\nEngineered observability solutions for backend services to monitor and optimize transaction processing times with efficient **release pipelines**.\nDesigned and deployed CI/CD strategies, utilizing **Foundry** to streamline the development and deployment of smart contracts workloads, ensuring code quality and compliance through automation.\nCollaborated with cross-functional teams to integrate cryptographic primitives and **Merkle trees** into existing systems, enhancing security and data integrity in distributed environments.\nAdeptly orchestrated environment configurations and service deployments using **Terraform** and **Azure**, ensuring robust infrastructure management and operational efficiency.\nExecuted secure coding practices and conducted performance reviews to uphold the integrity of platform components, leveraging **EVM** and **Solidity**.\nGuided teams through the adoption of blockchains and smart contract development, emphasizing best practices in security and maintainability across **Scala** and **Yul** environments."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Go** and **Rust** to develop and optimize platform solutions that enhance system performance and scalability.\nImplemented blockchain solutions with **Solidity** and **EVM**, focusing on smart contract development and deployment for efficient transactions.\nDesigned and executed CI/CD pipelines to streamline release management, ensuring faster and more reliable software deployments with minimal downtime.\nConducted observability practices to monitor system performance and reliability, enabling proactive incident management and troubleshooting.\nOrchestrated environment setups using **Terraform** and **Kubernetes**, ensuring consistent and reproducible development and production environments.\nEngineered cryptographic primitives and **Merkle trees** for secure data handling, enhancing security standards across the platform.\nDeveloped algorithms and data structures that improve data interchange efficiency, leading to a performance increase of **20%** in data processing tasks.\nCollaborated with cross-functional teams to align engineering efforts with business objectives, resulting in a **30%** increase in project delivery speed."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Leveraged **Go**, **Rust**, and **C++** to develop and optimize backend services for trade execution, portfolio management, and account tracking, enhancing the efficiency of trading operations.\n• Engineered efficient data processing algorithms and data structures for real-time price feed processors utilizing **asyncio**, **WebSockets**, and **Redis** to facilitate rapid updates in high-frequency transaction environments.\n• Collaborated with frontend teams to establish robust data delivery through REST APIs and WebSocket channels, ensuring an intuitive user experience and seamless platform interaction.\n• Ensured compliance with regulatory standards, including **MiFID II** and **GDPR**, while implementing secure coding practices to protect sensitive user data.\n• Implemented CI/CD practices and observability using frameworks such as **Foundry** and **Solidity**, ensuring streamlined deployment pipelines and reliable platform performance.\n• Developed and integrated comprehensive test suites with **PyTest** and **tox**, enhancing QA capabilities and facilitating continuous integration for team efficiency over **3** major releases.\n• Introduced job queuing and scheduling solutions with **Celery** and **RabbitMQ**, improving task execution efficiency and optimizing process management, resulting in a **25%** reduction in processing time."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, Go, Rust, C++, Scala, Solidity, Yul\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, release pipelines, environment orchestration, observability\n\n **Cloud & Infrastructure**\n\t\n\n **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, algorithms, data structures, system performance, cryptographic primitives, Merkle trees, Kafka, PyTest, Git",
  "apply_company": "Matter Labs"
}