{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Process Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a proficient Senior Process Engineer with 8 years of experience, I excel in process automation and orchestration using key technologies such as **Power Automate**, **Power Apps**, and **UiPath**. My solid expertise encompasses handling **APIs REST**, **APIs SOAP**, and **Webhooks** for seamless integration, alongside a robust proficiency in **Python**, **JavaScript**, and utilizing **PowerShell** for scripting tasks.\n\nI have demonstrated a strong ability to implement business process management (BPM) solutions, employing **BPMN** and **UML** methodologies. My project management experience includes agile practices with **Scrum** and **Kanban**, utilizing tools like **JIRA** and **Confluence** within **Azure DevOps** environments to ensure effective workflow and team collaboration.\n\nIn addition to my process engineering skills, I possess a solid foundation in full-stack development with **FastAPI**, **Django**, **React**, and **Next.js**. I've led initiatives that not only enhanced operational resilience but also ensured compliance with industry standards. As a forward thinker, I integrate modern technologies, including **Microsoft Copilot** and **ChatGPT**, to leverage AI capabilities for intelligent automation and improved decision-making processes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Process Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **Power Automate** and **Power Apps** to streamline workflows and enhance process automation, improving efficiency by **30%** across multiple projects.\nImplemented and optimized automation solutions using **UiPath**, **Automation Anywhere**, and **Blue Prism**, resulting in a **25%** reduction in manual workload and error rates.\nDeveloped and integrated RESTful and SOAP APIs, ensuring smooth data exchanges and functionality across systems, utilizing **JSON** for structured data communication.\nUtilized **Python** and **JavaScript** in process analysis and development, enhancing tool capabilities and improving user experience.\nAdopted and drove best practices in process modeling using **BPMN** and **UML**, facilitating clear documentation and communication of business processes among stakeholders.\nEmphasized Agile methodologies like **Scrum** and **Kanban** in project management using **JIRA** and **Confluence**, ensuring timely delivery of process improvement initiatives with a focus on team collaboration.\nImplemented DevOps practices via **Azure DevOps**, ensuring continuous integration and delivery pipelines for process automation solutions and effective version control, achieving deployment success rates of **99%**.\nUtilized advanced technologies such as **Microsoft Copilot** and **ChatGPT** to enhance productivity and innovation in process engineering and automation efforts.\nAdopted ITIL best practices to align IT services with the needs of the business, driving improved service delivery and operational efficiency.\nRegularly analyzed process performance metrics, presenting findings to stakeholders and making data-driven decisions to optimize workflows and automation strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Power Automate** and **Power Apps** to streamline workflows and automate processes, enhancing operational efficiency by up to **30%**.\nEmployed **UiPath**, **Automation Anywhere**, and **Blue Prism** for robotic process automation (RPA) initiatives, improving data processing times and reducing manual errors by **25%**.\nCollaborated in an agile environment leveraging **Scrum**, **Kanban**, and tools like **JIRA** and **Confluence** to coordinate projects effectively and adhere to timelines with over **95%** on-time delivery.\nDesigned and integrated REST and SOAP APIs using **Python** and **JavaScript**, facilitating seamless communication between applications with a focus on scalability and performance, managing over **1 million** API calls weekly.\nAnalyzed business processes using BPMN and UML methodologies to identify automation opportunities, leading to an increase in process effectiveness by **20%**.\nConducted training sessions on using **Microsoft Copilot** and **ChatGPT** for enhanced productivity and improved scaling of AI capabilities within the organization.\nMaintained and optimized process documentation in **Azure DevOps**, ensuring compliance with ITIL standards and improving cross-team collaboration on process enhancements."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Azure DevOps** and **JIRA** for effective project management and workflow optimization following **Scrum** and **Kanban** methodologies, resulting in a **25%** reduction in project turnaround time.\nImplemented automation processes using **Power Automate**, **UiPath**, and **Automation Anywhere**, significantly increasing efficiency by automating repetitive tasks, leading to a reported **40%** increase in productivity.\nDeveloped and maintained APIs in **Power Apps** for smooth data integration and process automation, enhancing system interoperability and user experience.\nWrote and maintained documentation using **Confluence** for operational processes, ensuring clarity and compliance with the **ITIL** framework across service management protocols.\nDesigned process models using **BPMN** and **UML** for effective visualization and analysis, contributing to enhanced stakeholder communication and process alignment.\nImplemented secure and efficient data exchange using **APIs REST** and **APIs SOAP**, with JSON and Webhooks support, leading to an improved data retrieval time of **30%**.\nCollaborated with cross-functional teams to enhance process flows through continuous improvement initiatives, delivering actionable insights and recommendations based on data analysis.\nEngaged in quality assurance measures to validate the effectiveness of automation and process designs, ensuring alignment with best practices and organizational standards.\nLeveraged advanced analytics tools such as **Microsoft Copilot** and **ChatGPT** to facilitate data-driven decision-making, enhancing strategic planning and execution within projects."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs REST, APIs SOAP, JSON, Webhooks\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure DevOps\n\n**Other:**\n\tPower Automate, Power Apps, UiPath, Automation Anywhere, Blue Prism, PowerShell, BPMN, UML, Scrum, Kanban, JIRA, Confluence, Microsoft Copilot, ChatGPT, ITIL, BPM, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "INCM Imprensa Nacional - Casa da Moeda"
}