{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Automation Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dynamic Senior Automation Engineer with 8 years of experience in developing and implementing automated testing solutions in the healthcare and financial sectors. Proficient in **Java** and **Python**, leveraging tools such as **Selenium**, **Cypress**, **Postman**, **JMeter**, and **REST-assured** to ensure the reliability and performance of applications. Experienced in CI/CD processes and using platforms like **Bamboo** and **Jira** for seamless workflow management. Adept at working with databases such as **MySQL** and leveraging monitoring tools like **Splunk** and **Datadog** to optimize application performance.\n\nPossessing a strong background in **full-stack development** and modern frameworks including **React**, **Next.js**, and **Node.js**, I have delivered enterprise-grade platforms with integrated AI/ML capabilities for advanced analytics. My expertise in implementing **microservices architecture**, event-driven systems, and compliance standards such as HIPAA and PCI DSS, combined with hands-on experience in developing efficient **MLOps workflows** and deploying machine learning models using tools like **MLflow** and **Airflow**, ensures the delivery of robust and secure applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Automation Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented robust **CI/CD** pipelines utilizing **Jenkins**, **Bamboo**, and **GitHub Actions**, ensuring efficient automation and quality control across all stages of development, resulting in a **30%** reduction in deployment time.\n• Developed and maintained **API** integrations and automated tests using tools like **Selenium**, **Cypress**, and **RESTassured**, achieving a **95%** test coverage on critical services.\n• Conducted performance testing with **JMeter**, identifying bottlenecks and optimizing API response times, which improved overall application performance by **40%**.\n• Collaborated with cross-functional teams using **Jira** and **Confluence** for project management and documentation, ensuring clear communication and alignment on objectives.\n• Implemented extensive logging and monitoring solutions with **Splunk** and **Datadog**, enabling proactive issue detection and enhancing system reliability.\n• Engaged in code quality enhancement through linting tools like **ESLint**, **Prettier**, and **Stylelint**, maintaining high standards for both JavaScript and Python codebases.\n• Designed and executed both unit and integration tests using **PyTest** and **Cypress**, covering critical functionalities with focus on regression testing.\n• Led workshops to train team members on best practices in automation frameworks and strategies, fostering a culture of quality and continuous improvement within the engineering team.\n• Enhanced automated testing processes by creating reusable testing components and integrating them into the existing frameworks, resulting in improved workflow and efficiency.\n• Advocated for the adoption of new technologies and tooling that align with our automation strategy, including **mySQL** for database interactions and efficient data handling practices."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained automated testing frameworks using **Java** and **Python**, ensuring comprehensive coverage of application functionalities through **API** integration testing and validating RESTful services.\nExecuted performance testing using **JMeter** and **Selenium**, achieving a **30%** reduction in application response time and identifying bottlenecks to enhance overall system efficiency.\nCollaborated with cross-functional teams to implement **CI/CD** pipelines utilizing **Bamboo**, streamlining code deployments and reducing release cycles by **40%**.\nGenerated detailed test reports and automation documentation using **Jira** and **Confluence**, providing clear insights into testing progress and enabling seamless communication across teams.\nEmployed **Cypress** for end-to-end testing of user interfaces, ensuring a **95%** pass rate for critical user journeys and improving application reliability.\nConducted thorough API testing with **Postman** and **REST Assured**, validating **99%** of all service endpoints with automated tests to ensure robust performance and functionality.\nUtilized **Splunk** and **Datadog** for monitoring application health and performance metrics, identifying issues proactively and facilitating timely resolution.\nImplemented code quality and style checks using **ESLint**, **Prettier**, and **Stylelint**, enhancing code maintainability and adherence to best practices across the development team.\nOrchestrated test scenarios with **Karma** and **Jasmine**, achieving high code coverage rates for component-level testing and improving collaboration among developers."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized automation frameworks and test scripts using **Java** and **Python**, ensuring consistent quality through the efficient usage of **Selenium**, **Cypress**, and **RESTassured** for UI and API testing.\nDeveloped and maintained robust API testing strategies utilizing **Postman** and **Jmeter**, which improved testing efficiency by **30%** and reduced regression testing time for releases from **5 days** to **2 days**.\nExecuted automated test cases across multiple browsers and devices leveraging **Cypress** and **Jasmine**, which led to an **85%** reduction in critical bugs post-release and improved deployment reliability.\nImplemented CI/CD pipelines using **Bamboo** and **Datadog**, establishing seamless integration processes which reduced deployment failures by **40%** and established faster feedback loops for development teams.\nUtilized **mySQL** for managing and validating test data, which supported comprehensive testing scenarios and enabled detailed reporting on test executions, cutting down manual reporting time by **50%**.\nManaged defect tracking and project documentation within **Jira** and **Confluence**, ensuring clear communication and traceability, leading to a **20%** improvement in team productivity.\nConstructed performance testing scenarios using **Jmeter** and integrated monitoring strategies with **Splunk**, resulting in enhanced system observability and performance optimization.\nWrote clean and maintainable code for automation tests while adhering to best practices using **ESLint**, **Prettier**, and **Stylelint**, contributing to improved code quality and readability standards across the project.\nCollaborated with cross-functional teams to gather requirements and define user stories, directly applying effective communication skills and tools like **Jama** to enhance project outcomes."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript, React, Vue, Angular\n\n **API Technologies:**\n\tAPI, Postman, RESTassured\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Selenium, Cypress, Jmeter, Splunk, Datadog, Jira, Confluence, Bamboo, ESLint, Prettier, Stylelint, Karma, Jasmine, Jama",
  "apply_company": "GlobalLogic"
}