{
  "name": "Tomasz Lee",
  "role_name": "Senior Developer Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Developer Engineer with a strong background in API integration and Agile methodologies. Proven expertise in Driver Development and Kernel programming, leveraging **C++** to deliver high-quality software solutions. Adept at developing and maintaining functional specifications, ensuring adherence to Quality Assurance standards. With 9+ years of experience as a .NET Full Stack Developer, I possess robust knowledge of both frontend and backend technologies, including **.NET**, **C#**, and **microservices architecture**. My background in mentoring teams and collaborating across disciplines enhances project effectiveness and fosters a culture of innovation and performance optimization.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Developer Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Executed robust **API** integrations to enhance system interoperability, leveraging expertise in **C++** and **Windows** environments.\nUtilized Agile methodologies to streamline processes, ensuring adherence to best practices while improving team productivity by **30%**.\nApplied principles of **Machine Learning** to develop data-driven solutions, enhancing predictive capabilities within the platform.\nConducted thorough **Quality Assurance** testing, achieving a **95%** defect-free rate in production releases.\nFostered a collaborative team environment through effective **mentorship**, guiding junior developers in best coding practices and project-specific knowledge.\nGathered and analyzed **Functional Specifications** to drive the design and implementation phases, improving project clarity and execution.\nSpearheaded the design and development of a web-based customer management platform using **.NET 7** and **ReactJS**, improving user satisfaction by **25%**.\nDesigned and implemented a microservices architecture using **.NET Core** to modularize the system for scalability and maintainability.\nIntegrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, resulting in improved system resilience and throughput.\nUtilized **Redis** for caching frequently accessed data, reducing database load and improving response times by **35%**.\nDeveloped **RESTful APIs** with **.NET**, integrated with a **MongoDB** database to provide seamless data access for various services.\nImplemented **CI/CD pipelines** on **Azure DevOps**, reducing deployment time by **40%**.\nOptimized **MSSQL** database queries and indexing, reducing average query execution time by **20%**.\nCollaborated with UX/UI designers to enhance the platform’s user interface, leading to an improved user experience.\nDeveloped a reporting engine using **D3.js** and **Three.js** for interactive data visualizations.\nImplemented **JWT**-based authentication and authorization for securing the application."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Windows** for development and deployment of applications, enhancing team collaboration through effective system architecture.\nEngineered robust and efficient **APIs** for seamless integration between systems, boosting application interactivity and data flow.\nPlayed a key role in implementing **Agile** methodologies within the team, leading to a **30%** improvement in project delivery timelines.\nActively mentored junior developers, fostering skills in **C++** and strengthening the team's overall capabilities.\nEnsured high-quality software delivery through rigorous **Quality Assurance** practices, reducing bug rates by **20%**.\nDeveloped functional specifications and technical documentation to align team objectives and streamline development processes.\nCollaborated with cross-functional teams to define user stories and requirements, ensuring all stakeholder expectations were met.\nEncouraged collaboration by organizing regular team meetings and code review sessions, leading to a more cohesive team environment.\nConducted performance assessments of existing **drivers** and **kernel** modules, optimizing system efficiency and responsiveness."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Collaborated effectively with cross-functional teams in an **Agile** environment to deliver high-quality software solutions on time, enhancing team productivity by **15%**.\n• Employed strong **API** development skills to integrate various systems, facilitating seamless data exchange and improving overall functionality.\n• Utilized **C++** for efficient driver development, optimizing system performance and resource management during project execution.\n• Provided mentorship and technical guidance to junior developers, fostering a culture of continuous learning and collaboration, which improved team skills by **25%**.\n• Ensured adherence to **Quality Assurance** practices throughout the software development lifecycle, resulting in a **30%** decrease in post-release defects.\n• Assisted in defining and documenting **Functional Specifications** for projects, aligning stakeholders and enhancing project clarity.\n• Participated in code reviews and technical discussions to promote best practices and maintain high coding standards across the team.\n• Conducted thorough testing and validation of code adjustments to ensure reliability and performance, achieving a test coverage of **95%**."
    }
  ],
  "skills": " **Programming Languages** \n\t C++, Python, JavaScript, TypeScript, C# \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices \n\n **Frontend Frameworks** \n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL, APIs \n\n **Serverless and Cloud Functions** \n\t AWS, Azure \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n **DevOps** \n\t CI/CD pipelines \n\n **Cloud & Infrastructure** \n\t AWS, Azure \n\n **Other** \n\t UX/UI Design, Git, GitHub, Agile, Quality Assurance, Machine Learning, Collaboration, Mentorship, Functional Specifications, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis",
  "apply_company": "Cloud Software Group"
}