{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior PHP Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior PHP Engineer with 10+ years of experience in software development, specializing in **PHP**, **Laravel**, and cloud-based solutions. Adept in **DevOps**, leveraging tools such as **GitHub Actions**, **Harness**, and **LaunchDarkly** for seamless CI/CD automation. Proven track record in developing SaaS applications with a strong emphasis on **Agile** and **Scrum** methodologies, ensuring efficient project delivery and team collaboration. Experienced in **unit testing**, **code reviews**, and best practices like **OOP** and **SOLID** principles to produce maintainable and high-quality code.\nAdditionally, I possess a solid foundation in cloud environments and monitoring tools like **New Relic** and **Splunk**. My background includes designing architectures with a focus on security and compliance, ensuring that solutions meet industry standards. Passionate about driving technical excellence and delivering real-world solutions that make a difference.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tUtilized **PHP** and **Laravel** framework to develop and maintain scalable web applications for clients in various sectors, implementing best practices in **OOP** and **SOLID** principles to enhance code quality and maintainability.\n•\tDesigned **SaaS** products aligned with Agile methodologies, ensuring rapid delivery through effective **DevOps** strategies and version control using **GitHub Actions** and **CI/CD** pipelines, with automated deployments achieving a 30% reduction in time-to-release.\n•\tImplemented comprehensive **unit testing** strategies, utilizing frameworks such as PHPUnit, to ensure high-quality code with a coverage rate of **90%** or higher and to enhance code reliability through regular **code reviews**.\n•\tDeveloped and maintained monitoring tools using **New Relic** and **Splunk** to oversee application performance, facilitating proactive identifying and troubleshooting of an average of 20 issues per month.\n•\tCollaborated within a **Scrum** team to drive project initiatives, participating in sprint planning and daily stand-ups, leading to a completion rate of projects meeting deadlines by **25%** more frequently.\n•\tLeveraged cloud technologies to enhance application scalability and reliability, implementing solutions on platforms such as AWS or Azure, optimizing costs by leveraging serverless architectures.\n•\tIntegrated and utilized **Laravel** Passport for authentication and authorization, ensuring secure access mechanisms in line with industry standards.\n•\tProduced documentation for software design and architecture fostering better communication and understanding across teams, contributing to a **100%** adoption rate of best practices among new team members.\n•\tParticipated in debugging efforts, effectively reducing the time taken to resolve production issues by **40%**, through targeted troubleshooting techniques and debugging tools.\n•\tFostered a culture of continuous learning and improvement within the team, hosting regular knowledge-sharing sessions and workshops focusing on emerging technologies and best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **PHP** and **Laravel** for building and maintaining high-performance SaaS applications, resulting in user satisfaction improvements by over **30%**.\nImplemented **DevOps** practices including **CI/CD** pipelines with **GitHub Actions**, enhancing deployment frequency by **40%** and reducing lead time for changes.\nCollaborated in an **Agile** environment, utilizing **Scrum** methodologies to effectively manage project timelines and deliverables, improving team productivity by **25%**.\nConducted thorough **Unit Testing** and **Code Reviews**, ensuring adherence to **SOLID** principles and enhancing code quality, which reduced bug rates by **15%**.\nEngaged in **Debugging** and **Troubleshooting** sessions, resolving issues in real-time and optimizing performance of applications built on **PHP** and **Laravel**.\nLeveraged monitoring tools like **New Relic** and **Splunk** for performance tracking and anomaly detection, facilitating proactive maintenance and response strategies.\nFostered a culture of continuous improvement and collaboration across teams, leading to a more robust deployment strategy and adherence to best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable web applications using **PHP** and the **Laravel** framework, ensuring high performance and responsiveness across all features.\nImplemented CI/CD pipelines utilizing **GitHub Actions** and **Harness**, achieving deployment automation with a **95%** reduction in manual intervention times.\nLeveraged **AWS** for cloud services, improving application resilience and uptime to **99.9%**, while managing resources efficiently.\nExecuted Agile methodologies and Scrum practices to streamline project delivery, enhancing collaboration within cross-functional teams.\nApplied OOP principles and the **SOLID** design methodology to architect robust software solutions, leading to a **30%** decrease in code complexity and improved maintainability.\nConducted thorough **unit testing** and code reviews, achieving a code coverage of **85%**, ensuring robustness and preventing regressions.\nUtilized **New Relic** and **Splunk** for application monitoring and performance optimization, reducing downtime incidents by **40%** through proactive troubleshooting.\nParticipated in debugging and troubleshooting complex issues across the software stack, ensuring swift resolution and maintaining user satisfaction.\nIntegrated SaaS solutions to enhance functionality and streamline workflows, leading to improved operational efficiency.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP, C#, Java, C++, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tLaravel, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tCloud, SaaS\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Agile, Scrum, OOP, SOLID, Unit Testing, Code Reviews, Debugging, Troubleshooting, New Relic, Splunk, Harness, LaunchDarkly",
  "apply_company": "Lumaserv"
}