{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Product Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Innovative Product Engineer with 13+ years of experience driving high-performance applications in the healthcare and financial sectors. Highly skilled in **Python**, **Django**, and cloud services such as **AWS**. Proven expertise in **Vue.js** for dynamic frontend development, coupled with strong capabilities in **AI tools** that enhance predictive analytics and automation. Effective in **Agile development** methodologies, emphasizing **collaboration** and **problem-solving** to deliver user-centric solutions.\nDemonstrates a robust understanding of systems architecture and **UX/UI design**, ensuring intuitive and efficient interfaces. Adept at employing systems thinking for comprehensive project oversight, while embracing adaptability to meet evolving customer needs. Experienced in developing and deploying solutions that comply with HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Product Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and designed full-stack applications using **Python** and **Django** to create robust and scalable solutions tailored for healthcare and fintech industries.\n• Employed **AWS** for cloud services, ensuring seamless deployments and management of applications in a scalable environment.\n• Collaborated with cross-functional teams to streamline **Agile development** processes, fostering a team-centric approach to product engineering and development.\n• Utilized **Vue.js** for engaging UX/UI design, enhancing user experiences across mobile and web platforms.\n• Designed and implemented efficient software architecture, aligning technical solutions with business needs and ensuring adaptability to changing requirements.\n• Demonstrated strong **problem-solving** skills by troubleshooting complex issues in real-time, optimizing system performance and reliability.\n• Ensured effective collaboration across interdisciplinary teams involving both technical and non-technical stakeholders to achieve project goals successfully.\n• Managed projects within **5**-sprint cycles, adhering to Agile frameworks to ensure timely delivery and iteration of products.\n• Championed **systems thinking** principles to analyze software design challenges, leading to innovative solutions for both frontend and backend systems.\n• Supported the implementation of data visualization techniques using advanced tools to provide insights into user interaction and application performance.\n• Integrated **AI tools** into existing workflows to enhance application capabilities, focusing on automation and efficiency.\n• Adapted to new technologies and tools as required, continuously enhancing the tech stack with modern solutions that improve productivity and collaboration."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Django** for developing scalable applications that align with **Agile development** practices, focusing on user-centric design and effective **UX/UI design** implementations.\nEmployed **Vue.js** to enhance user interfaces, ensuring smooth interactions and visually appealing layouts in compliance with best practices.\nDesigned microservice architectures to improve system efficiency and adaptability while maintaining high standards of **Systems thinking** and **Architecture**.\nCollaborated with cross-functional teams to ensure seamless integration of features, demonstrating strong **Collaboration** and **Problem-solving** abilities across diverse project scopes.\nConducted market and user research to identify opportunities for AI tools integration, enriching product offerings and enhancing user experience.\nLed teams through system enhancements and iterative development, applying **Adaptability** to align evolving requirements in fast-paced environments, resulting in an increase of productivity by **20%**.\nImplemented feedback loops and testing mechanisms, leading to a reduction in product issues by **15%** post-launch.\nMonitored project timelines, achieving milestones with **95%** adherence to deadlines while adapting strategies to facilitate ongoing improvements to applications."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Django** to design and optimize backend services for a global e-commerce platform, achieving **99.9%** uptime with low latency and scalable architecture across key modules such as checkout and order fulfillment.\nEmployed **AWS** services to enhance application reliability and performance, ensuring seamless deployment and integration in a cloud environment.\nCollaborated in an **Agile** development framework, facilitating teamwork and enhancing project outcomes through regular sprints and feedback loops.\nManaged real-time features using event-driven architecture with **Kafka** and **RabbitMQ**, enabling responsive order updates and customer support interactions with a **50%** reduction in response time.\nDeveloped intuitive frontend applications leveraging **Vue.js**, along with other frameworks like **React** (version **18**) and **Angular**, to deliver fast, responsive user experiences, achieving **90%** user satisfaction ratings.\nDesigned and implemented UX/UI elements, ensuring all interfaces adhered to accessibility compliance (WCAG 2.1) for mobile-first engagement and increasing user engagement by **30%**.\nOrchestrated the integration of AI/ML-based recommendation engines utilizing libraries such as **scikit-learn**, **LightGBM**, and **TensorFlow**, boosting product discoverability and conversion rates by **25%** based on real-time behavioral insights.\nUtilized **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for efficient, distributed data management, resulting in improved fault tolerance and data accessibility for high-traffic e-commerce workflows.\nImplemented efficient caching strategies with **Redis** for product metadata, which improved application responsiveness and reduced database read pressure, enhancing speed by **40%**.\nExecuted feature flags and blue-green deployments leveraging tools like **LaunchDarkly** and **Kubernetes**, ensuring smooth rollouts and risk-managed updates during major deployments.\nBuilt secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, ensuring all transactions were tokenized and compliant with PCI standards for data security.\nApplied robust security protocols through role-based access control (RBAC) and **OAuth 2.0** for safe customer and admin access, maintaining GDPR compliance and ensuring user data protection throughout the platform."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tDjango\n\n**Frontend Frameworks:**\n\tVue.js\n\n**API Technologies:**\n\tFastAPI\n\n**Serverless and Cloud Functions:**\n\tAWS\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tAI tools\n\tUX/UI design\n\tArchitecture\n\tAgile development\n\tSystems thinking\n\tCollaboration\n\tProblem-solving\n\tAdaptability\n\tMLflow\n\tAirflow\n\tKubeflow\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n"
}