{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Android Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a skilled Senior Android Engineer with 8 years of experience, I specialize in developing high-performance applications using **AOSP**, **Kotlin**, **Android SDK**, and **Bluetooth LE** technology. My expertise includes strong proficiency in **Java**, **C**, and **C++**, along with familiarity in utilizing **Coroutines** and **RxJava** to build responsive Android applications. I am adept at leveraging debugging tools and Android architecture principles to deliver efficient and reliable software solutions. \nAdditionally, I bring a robust background in the healthcare and financial sectors, where I have successfully led projects that adhere to compliance standards such as HIPAA and PCI DSS, ensuring secure and high-quality deliverables. My experience with CI/CD automation and unit testing has further empowered me to implement best practices in software development and provide coherent English communication with cross-functional teams.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Android Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Applied expertise in **Kotlin** and **Java** to architect and develop high-performance Android applications following **Android SDK** standards, ensuring optimal **Android architecture** compliance and performance optimization.\nUtilized **Coroutines** and **RxJava** for effective asynchronous programming, improving app responsiveness and user experience in multiple applications.\nEnsured thorough **unit testing** through frameworks like JUnit, achieving a **95%** code coverage on critical modules and enhancing code quality.\nCollaborated with cross-functional teams leveraging **English communication** skills to define project requirements and deliverables effectively in both technical and non-technical environments.\nExecuted debugging protocols using advanced **debugging tools** and techniques to minimize app crashes and optimize functionality, reducing bug reports by **30%**.\nIntegrated connectivity features utilizing **Bluetooth LE** to enable seamless device interactions and integrations within Android applications, enhancing user engagement.\nManaged code reviews and version control using **Gerrit**, enforcing best practices and coding standards, which resulted in a **20%** reduction in code defects.\nArchitected application components leveraging **C** and **C++** as needed for performance-critical tasks, enhancing the overall application efficiency by **15%**.\nContributed to build processes using **Make**, **CMake**, and **Soong** to streamline development workflows, reducing build times by approximately **25%** across projects.\nEngaged in agile development methodologies to deliver app features iteratively, adapting to changing user needs and feedback with flexibility and efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained Android applications using **Android SDK**, **Kotlin**, and **Java**, ensuring high performance and responsiveness by utilizing **Coroutines** and **RxJava** for asynchronous programming.\nImplemented **Bluetooth LE** functionalities for seamless connectivity and communication between mobile devices and peripherals, enhancing user experience in connectivity features.\nLeveraged **Linux** environments for building and debugging applications, utilizing **Gerrit** for version control and code review to maintain code quality and integrity across multiple projects.\nDesigned and implemented unit testing strategies, applying **debugging tools** to ensure optimal code performance and reliability, resulting in a **20% reduction** in post-deployment bugs.\nCollaborated with cross-functional teams to refine **Android architecture** for scalability, using **CMake** and **Soong** for build system optimization, improving build times by **30%**.\nConducted code reviews and provided mentorship to junior developers, enhancing team capacity and knowledge sharing, leading to improved project delivery times by **15%**.\nUtilized **AOSP** and contributed to the customization of Android frameworks, enabling tailored solutions for specific hardware and software capabilities.\nCommunicated effectively in **English** to engage with stakeholders, ensuring clear understanding of project requirements and timelines."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed robust applications for Android platforms leveraging **Android SDK**, **Kotlin**, and **Java**, ensuring high performance and responsiveness across diverse devices and operating systems.\nUtilized **Coroutines** and **RxJava** for efficient asynchronous programming, enhancing application performance and responsiveness for end-users.\nEngineered Bluetooth LE functionalities for seamless device connectivity and data exchange, facilitating a user-friendly experience with real-time communication.\nImplemented stringent unit testing protocols to evaluate application functionalities, achieving a code coverage of **85%** and ensuring minimal defects in production environments.\nDesigned and maintained Android architecture patterns to promote modularity and code reusability, maintaining a codebase of over **100,000** lines with a focus on scalability and maintainability.\nUtilized **Linux** for development and testing environments, streamlining application deployment processes and enhancing debugging capabilities with various **debugging tools**.\nManaged integration with AOSP enhancing core functionalities and ensuring compliance with platform standards using **Gerrit** for version control and code reviews.\nCreated and maintained build configurations using **Soong**, **Make**, and **CMake**, establishing efficient CI/CD pipelines to accelerate development cycles.\nDemonstrated strong English communication skills to collaborate effectively across cross-functional teams, facilitating clear discussions and collective problem-solving efforts."
    }
  ],
  "skills": "Programming Languages:\n\tC, C++, Java, Kotlin, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tAOSP, Android SDK, HAL, Bluetooth LE, Coroutines, RxJava, ADB, Linux, Soong, Make, CMake, debugging tools, Android architecture, unit testing, Gerrit, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, English communication",
  "apply_company": "co.brick"
}