{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior ML Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior ML Engineer with 10+ years of experience in delivering robust machine learning solutions within healthcare and finance sectors. Highly skilled in **Python**, with extensive experience in deploying applications on **AWS**, **Azure**, and **GCP**. Proficient in orchestration and containerization using **Docker** and **Kubernetes**, as well as infrastructure as code with **Terraform** and **CDK**. Experienced in applying machine learning (ML) methodologies, including **NLP**, **GenAI**, and **LLM**, for real-time analytics and intelligent systems.\nDemonstrated expertise in developing enterprise platforms that incorporate AI/ML capabilities, ensuring compliance with standards such as HIPAA and PCI DSS. Strong foundation in SQL for data manipulation and insights, alongside hands-on experience with version control using **Github** and monitoring with **Elastic Stack**.\nAdditionally, brings practical experience in MLOps, focused on creating and managing ML pipelines and workflows utilizing tools such as MLflow and Airflow. Committed to building innovative systems that not only meet technical standards but also create significant real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDesigned and implemented scalable solutions utilizing **Python** and leveraging cloud services such as **AWS** and **Azure** to deliver robust machine learning applications.\n•\tDeveloped and maintained containerized applications using **Docker** and orchestrated them in cloud environments using **Kubernetes**, ensuring seamless deployment and management of models.\n•\tUtilized machine learning frameworks such as **TensorFlow** and **scikit-learn** for model development focused on ML use cases like patient risk prediction and financial fraud detection.\n•\tImplemented advanced Natural Language Processing (NLP) techniques to enhance document parsing and anomaly detection, using libraries such as **spaCy** and **Hugging Face Transformers**.\n•\tEstablished and managed end-to-end ML workflows through MLOps practices with tools like **MLflow** and **Apache Airflow**, offering version control and model automation tailored for deployment in cloud systems.\n•\tCreated CI/CD pipelines utilizing **GitHub** and **Terraform** for infrastructure management, enhancing deployment speed and reliability across development and production environments.\n•\tDesigned and maintained SQL databases ensuring efficient data retrieval and operations, supporting operations across large-scale datasets.\n•\tLed the integration of GenAI features into applications, enhancing user experience through personalized insights by leveraging powerful LLMs deployed on platforms like **GCP** and **Azure**.\n•\tCollaborated with cross-functional teams to deliver actionable insights using Elastic Stack technologies, enhancing the ability to run complex queries and visualizations.\n•\tOptimized deployment strategies by using IaC (Infrastructure as Code) with **CDK** and ensuring scalable cloud-native application frameworks.\n•\tConducted testing across systems using frameworks such as **PyTest**, ensuring model performance and application stability through rigorous validation measures.\n•\tSpearheaded initiatives in building resilient architectures for microservices-based applications and maintained high availability and fault tolerance via cloud solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and various machine learning libraries to develop and deploy AI/ML models for fraud detection, credit scoring, and churn prediction, enhancing the accuracy of suspicious activity identification by **30%**.\nDesigned and implemented scalable ML pipelines with **Apache Airflow** and **MLflow**, ensuring seamless integration with backend services for real-time decision-making and monitoring of key financial metrics.\nOrchestrated cloud infrastructure using **Terraform** and **Docker**, facilitating a smooth deployment process on **AWS**, **GCP**, or **Azure** environments, reducing deployment times by **40%**.\nIntegrated natural language processing (NLP) capabilities to analyze user feedback and transactional data, improving insights generation by **25%** and enhancing customer experience.\nImplemented Kubernetes for container orchestration, ensuring high availability and reliability of deployed machine learning applications across multiple environments.\nCollaborated with cross-functional teams to develop and maintain data pipelines utilizing **SQL** and **Elastic Stack** for comprehensive data monitoring and analysis, bringing data retrieval efficiency to **85%**.\nEngaged in continuous improvement of development processes by leveraging **GitHub** for version control and collaborative code reviews, facilitating a more efficient code development environment."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **AWS**, **GCP**, and **Azure** to deploy and manage robust ML models that drive advanced analytics and recommendations in e-commerce.\nDesigned and developed scalable backend services using **Python** (FastAPI, Django) and integrated machine learning models leveraging **ML** and **NLP** techniques to enhance user experience and product recommendations.\nCollaborated across teams to implement **Docker** and **Kubernetes** for containerization and orchestration, ensuring seamless deployment and scalability of ML applications.\nUtilized **Terraform** and **CDK** for infrastructure as code (IaC) practices, facilitating automated provisioning and management of cloud resources for ML workloads.\nEngaged in continuous integration and deployment via **Github** workflows, enabling rapid updates to ML models and algorithms based on changing user behavior and patterns.\nApplied advanced caching strategies using **Redis** to boost the performance of ML predictions, enabling lower response times and higher throughput in high-traffic scenarios.\nOptimized SQL database interactions for data retrieval and storage, employing both **PostgreSQL** and **MongoDB** for efficient handling of structured and unstructured data.\nEmployed **Elastic Stack** for logging, monitoring, and visualizing data flows from ML models, aiding in performance tuning and troubleshooting.\nImplemented feature flags and blue-green deployments through **Kubernetes** for ML models, allowing for controlled rollouts and A/B testing of new features with minimal risk.\nAnalyzed large datasets using **PyTorch** and **TensorFlow** for training sophisticated machine learning models, achieving a 30% increase in recommendation accuracy.\nDeveloped and maintained documentation and best practices for deploying ML solutions, ensuring team alignment and adherence to standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, \n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, \n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript, React, Vue, Angular, \n\n**API Technologies:**\n\tGitHub, \n\n**Serverless and Cloud Functions:**\n\tAWS, GCP, Azure, Docker, Kubernetes, \n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, \n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, CI/CD, Infrastructure as Code, \n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), \n\n**Other:**\n\tML, NLP, GenAI, LLM, Elastic Stack, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot ",
  "apply_company": "sevdesk"
}