{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Data Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a proficient Data Engineer with 8 years of experience, I excel in data modeling, ETL design, and performance optimization using the **AWS** stack, including **AWS Glue**, **AWS S3**, **AWS Lake Formation**, **AWS Athena**, **AWS Redshift**, and **AWS Aurora**. My expertise in troubleshooting **AWS** services and implementing encryption protocols ensures the security and integrity of data processing workflows. I have a solid foundation in project management, enhancing team communication, and delivering high-quality solutions aligned with business objectives.\nIn addition to my technical skills, I am a seasoned Full Stack Developer, leveraging technologies such as **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My background includes designing enterprise-grade applications that incorporate AI/ML functionalities for advanced analytics and seamless real-time data processing. My hands-on experience in CI/CD automation, microservices architecture, and MLOps workflows with tools like **MLflow**, **Airflow**, and **Kubeflow** further enhances my ability to deliver comprehensive data solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Data Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS Glue** for data transformation, ensuring effective ETL design and data modeling for various data pipelines and analytics workloads.\nLeveraged **AWS S3** for scalable data storage, optimizing access patterns and cost while ensuring data security through appropriate **encryption** measures.\nEngaged in **performance optimization** of data workflows by implementing **AWS Athena** for interactive queries over large datasets, improving query performance and reducing execution time by **30%**.\nEmployed **AWS Redshift** for data warehousing, optimizing data retrieval processes and improving reporting efficiency by **25%** through effective query tuning and data distribution strategies.\nManaged data lakes using **AWS Lake Formation**, ensuring secure and efficient data access and compliance with data governance policies, while streamlining data ingestion workflows.\nLed the integration of **AWS Aurora** databases into data architecture, enhancing data reliability and availability for critical healthcare and financial applications.\nConducted troubleshooting of **AWS services**, diagnosing issues in a timely manner and implementing fixes, which resulted in a **20%** reduction in downtime.\nUtilized **AWS IAM** to establish robust security protocols and role-based access controls, ensuring compliance with regulatory standards and safeguarding sensitive data.\nImplemented effective **communication skills** and project management strategies to coordinate cross-functional teams on data engineering initiatives, driving successful project completions within predefined timelines.\nAchieved **AWS Certification** to validate expertise in cloud infrastructure and data engineering best practices, enhancing team credibility and project outcomes.\nCollaborated with cross-functional teams to strategize and deliver valuable data insights, ensuring alignment with organizational goals and client expectations.\nMaintained an emphasis on **query optimization**, ensuring efficient database performance for data-intensive applications in the healthcare and financial sectors."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and developed ETL processes using **AWS Glue** and **AWS S3** for efficient data ingestion and transformation from diverse sources, enhancing data accessibility and **performance optimization** for analytics workloads.\nExecuted data modeling strategies within **AWS Lake Formation** and implemented **AWS Athena** for seamless data querying, ensuring robust and scalable data structures aligned with business needs.\nPerformed performance tuning and query optimization within **AWS Redshift** and **AWS Aurora**, improving data retrieval speeds by **30%** and significantly reducing operational costs.\nLed the project management of data engineering initiatives, coordinating cross-functional teams and maintaining effective communication to ensure alignment with project goals and timely delivery.\nApplied encryption techniques to secure sensitive financial data, adhering to industry standards and compliance regulations.\nUtilized troubleshooting skills to resolve AWS service issues, minimizing downtime and maintaining high service availability for critical data processes.\nExecuted comprehensive performance optimization strategies resulting in a **25%** increase in processing efficiency across data pipelines and integration workflows.\nCollaborated effectively with stakeholders to gather requirements and provide technical insights, leveraging strong communication skills to bridge the gap between technical and non-technical teams."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **AWS Glue** for ETL design, efficiently transitioning data between **AWS S3**, **AWS Redshift**, and **AWS Aurora** to support seamless data workflows and analytics.\nEngineered data models aligned with business requirements, incorporating **AWS Lake Formation** for secure data access and governance, ensuring compliance and streamlined data processing across various platforms.\nImplemented **AWS Athena** for performance optimization by developing highly efficient queries, reducing query times by **30%** and extracting valuable insights from vast datasets.\nTroubleshot AWS services with a focus on performance tuning and query optimization, enhancing system responsiveness and reliability by **25%**.\nLed data migration projects with **AWS IAM** managing fine-grained access control to data resources, ensuring data integrity and security across all user interactions.\nApplied encryption techniques to safeguard sensitive data during ETL processes and storage, adhering to compliance standards and enhancing overall security.\nCommunicated effectively with cross-functional teams, managing project timelines and deliverables to ensure successful completion of data engineering projects.\nAchieved AWS Certification, demonstrating proficiency in managing data solutions and enhancing team credibility in AWS services implementation.\nHands-on experience with troubleshooting AWS services, leading to a **40%** reduction in downtime during critical operations through prompt identification and resolution of issues.\nMonitored and optimized data workflows for better performance and efficiency, directly contributing to improved data accessibility and usability across the organization."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3, Glue, Athena, Lake Formation, IAM, Redshift, Aurora)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure (App Services, Blob, SQL)\n\n **Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow)\n\tAuthentication & Security (Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot)\n\tData modeling, ETL design, Encryption, Performance optimization, Troubleshooting AWS services, Communication skills, Project management, AWS Certification, Performance tuning, Query optimization"
}