{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Tester",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior QA Tester with 13+ years of experience in delivering robust and compliant applications, particularly within the healthcare and financial industries. Proficient in testing methodologies using **Selenium**, **Cucumber**, and **REST** APIs, ensuring high-quality delivery through meticulous **API testing**, including validation of **JSON** and **XML** formats. Skilled in **RDBMS**, **SQL**, and data migration processes, with a focus on **Agile methodologies** and **DevOps** practices to enhance collaborative project workflows.\n\nDemonstrated analytical skills in identifying defects and improving testing efficiencies, supported by effective communication skills for cross-team collaboration. Additionally, leverage a strong technical foundation with hands-on expertise in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, along with cloud deployment experience on **AWS** and **Azure**. Have successfully contributed to building AI/ML-powered platforms, enhancing operational capabilities through predictive analytics.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Tester",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Executed comprehensive **API testing** strategies utilizing **Java** and **Selenium** to ensure seamless integration across systems, achieving a **95%** pass rate in all test cases.\nConducted detailed **data migration** processes, leveraging **RDBMS** and **SQL** to maintain data accuracy and integrity during transitions, with a focus on cleaning and transforming datasets that reduced data inconsistency by **30%**.\nCollaborated within **Agile methodologies** to deliver project milestones in an iterative manner, leading to a **25%** increase in team productivity through enhanced communication and workflows in **JIRA** and **Atlassian Confluence**.\nImplemented automated testing frameworks using **Cucumber** and **Selenium**, enabling **70%** of test cases to be executed with minimal manual intervention, speeding up release cycles significantly.\nLed the development of test plans for **REST** and **SOAP** APIs, covering both **JSON** and **XML** formats, ensuring compliance with **HTTP** standards and validating end-to-end scenarios through structured workflows.\nPerformed rigorous testing of system functionalities in a **Unix** environment, utilizing **Unix scripting** for test automation processes, achieving greater efficiency and reliability in test execution.\nFacilitated cross-functional communication to ensure alignment in quality assurance efforts, resulting in improved reporting processes and feedback loops in **Microsoft Office** tools.\nDefined and enforced best practices for test case management and defect tracking, utilizing **Git** for version control and collaboration in test repository management, enhancing team accountability and transparency.\nConducted performance testing to assess system scalability and responsiveness under heavy load conditions, reporting findings to stakeholders with clear, actionable recommendations for improvement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive **API testing** for financial platforms, including REST and SOAP services, ensuring data integrity and functionality across **Java** and other core technologies.\nExecuted **data migration** activities using SQL and RDBMS, successfully migrating over **10 million** records with zero data loss while maintaining operational continuity.\nCollaborated with cross-functional teams using **Agile methodologies** and tools like **Atlassian Confluence** and **JIRA** to streamline testing processes and track project progress effectively.\nDeveloped and maintained automated test scripts using **Selenium** and **JUnit** for comprehensive regression testing, resulting in a **30%** reduction in testing time and quick turnaround for release cycles.\nCreated detailed documentation and test cases in a **Cucumber** framework for both manual and automated tests, ensuring all scenarios were covered and regulatory requirements were met.\nImplemented Unix scripting for test automation, improving system interactions and enhancing the testing environment for various applications.\nUtilized **Git** for version control, ensuring collaboration among team members and maintaining up-to-date code repositories for test scripts and configurations.\nAnalyzed test results and reported findings to stakeholders through clear communication, facilitating effective decision-making and driving quality improvements in software releases."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted comprehensive **API testing** utilizing **REST** and **SOAP** protocols to ensure optimal functionality of backend systems integrated with **Java** applications.\nDeveloped and executed automated test scripts using **Selenium** and **Cucumber** to enhance test coverage and efficiency, achieving a 30% reduction in regression testing time.\nCollaborated with development teams on data migration efforts, applying **RDBMS** and **SQL** techniques to maintain data integrity and ensure smooth transitions between environments, successfully handling over **1 million** records.\nUtilized **JSON** and **XML** for data serialization and validation in API testing, streamlining data exchange processes and improving test accuracy.\nImplemented Unix scripting to automate repetitive test tasks and environment setups, leading to a **25%** improvement in overall testing efficiency.\nLed efforts in Agile methodologies, participating in sprint planning and daily stand-ups to align development and testing activities and ensure timely delivery of features with minimal bugs.\nUtilized **Git** for version control in collaboration with team members, maintaining comprehensive documentation in **Atlassian Confluence** and managing tasks effectively with **JIRA** and **ADO**.\nPerformed cross-browser testing and debugging, documenting results and communicating findings effectively to stakeholders to drive necessary improvements.\nEngaged in DevOps practices, promoting continuous integration and continuous deployment (CI/CD) processes through automated testing frameworks, reducing deployment time by **40%**.\nDemonstrated strong analytical and communication skills to liaise between technical and non-technical teams, ensuring thorough understanding of testing requirements and product specifications."
    }
  ],
  "skills": " **Programming Languages:** \n\tJava, Python, JavaScript/TypeScript \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n **Frontend Frameworks:** \n\tReact, Vue, Angular \n\n **API Technologies:** \n\tREST, SOAP, JSON, XML, HTTP, API testing \n\n **Serverless and Cloud Functions:** \n\tAWS: ECS, Lambda, Azure: App Services \n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis, RDBMS, SQL \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, DevOps \n\n **Cloud & Infrastructure:** \n\tAWS: S3, RDS, Azure: Blob Storage, SQL Database \n\n **Other:** \n\tSelenium, Cucumber, Data Migration, Unix scripting, Git, Atlassian Confluence, JIRA, ADO, Microsoft Office, Agile methodologies, analytical skills, communication skills"
}