{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a results-driven Senior Backend Engineer with 8 years of experience, I excel in building and deploying scalable applications using **Elixir**, **Phoenix**, and **Postgres** alongside modern frameworks such as **React**, **Next.js**, **Vue**, and **Angular**. My strong expertise in **CI/CD** processes, utilizing tools like **GitLab**, ensures efficient delivery and integration of code. I have extensive cloud experience with **AWS**, and I am proficient in containerization technologies including **Docker** and **Kubernetes**.\n\nI have successfully led the development of high-performance solutions in the healthcare and financial sectors, integrating AI/ML capabilities for enhanced predictive analytics and automation. My comprehensive knowledge in full-stack development covers **Node.js**, **FastAPI**, and **Django**, equipping me to build robust and secure applications compliant with standards such as HIPAA and PCI DSS. I bring a proven track record in implementing microservices architecture and developing MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable backend systems using **Elixir** and **Phoenix**, ensuring high performance and responsiveness across applications.\nArchitected integrated solutions with **Postgres** for efficient data management, optimizing database queries and performance for large-scale financial data.\nImplemented automated **CI/CD** pipelines utilizing **GitLab**, facilitating seamless application deployment and continuous integration.\nLeveraged **AWS** cloud services for deploying applications, ensuring adherence to best practices in cloud architecture for reliability and scalability.\nUtilized **Docker** for containerization, enabling microservices architecture and consistent development environments.\nManaged orchestration of containers with **Kubernetes**, leading to improved system reliability and easier scaling of applications.\nBuilt rich user interfaces utilizing **Next.js**, **React**, and **Vue**, enhancing user experience and ensuring responsive design across various platforms.\nCollaborated closely with front-end teams to maintain application integrity and performance, integrating with existing services to deliver comprehensive solutions.\nConducted regular code reviews and implemented test strategies, ensuring code quality and adherence to industry standards.\nLed performance optimization initiatives, achieving a **30%** reduction in response times across critical endpoints.\nGenerated detailed documentation for system architecture and APIs, improving project onboarding and knowledge transfer within the development team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **CI/CD** pipelines using **GitLab**, enhancing deployment efficiency by **30%** through automated testing and continuous integration.\nDesigned and developed backend services using **Elixir** and **Phoenix**, achieving a **20%** reduction in latency while handling **10,000+** concurrent users.\nCollaborated with front-end teams to integrate applications using **Next.js**, **React**, and **Vue**, ensuring seamless user interactions across platforms.\nManaged database systems with **Postgres**, optimizing query performance and reducing response times by **15%**.\nDeployed containerized applications using **Docker** and orchestrated them with **Kubernetes**, improving scalability and reliability of services.\nWorked with **AWS** cloud services to implement serverless architectures, reducing operational costs by **25%** while maintaining high availability.\nConducted code reviews and mentorship for junior developers, enhancing team performance and code quality through best practices and shared knowledge."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained robust backend services for scalable applications using **Elixir** and **Phoenix**, ensuring high throughput and fault tolerance across critical modules.\nLeveraged **Postgres** for relational data management, optimizing queries and indexes to achieve a **30%** improvement in response times under high load conditions.\nImplemented CI/CD pipelines utilizing **GitLab** to streamline deployment processes, reducing deployment times by **50%** through automated testing and integration.\nManaged containerization using **Docker** and orchestrated applications with **Kubernetes** to enhance scalability and simplify deployment across multiple environments, achieving zero downtime during updates.\nDesigned interactive user interfaces with **Next.js**, **React**, **Vue**, and **Angular**, ensuring responsive design and maintaining performance metrics even with a **95%** uptime.\nCollaborated on backend features, integrating real-time data processing principles while optimizing service architecture to handle **10k+** concurrent users without performance degradation.\nOversaw cloud deployments on **AWS**, applying best practices for security and cost management, to maintain operational efficiency and optimize resource utilization.\nEngaged in continuous learning to keep abreast of new technologies and methodologies, effectively contributing to team discussions and strategies for improvement.\nFormulated a strong understanding of user needs and translated them into functional backend services, nurturing a clear understanding of how backend performance impacts overall user experience."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Elixir\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Phoenix\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Nextjs\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Redis",
  "apply_company": "Remote"
}