{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a versatile Software Engineer with 8 years of full-stack development experience, I excel in crafting high-performance solutions using **Ruby**, **TypeScript**, **React**, and **Rails**. My technical prowess encompasses API integration and database management with **Postgres** and **Redis**, along with cloud development using **AWS CDK** and containerization through **Docker**. I emphasize collaborative teamwork and cybersecurity knowledge to deliver secure applications that meet industry standards.\nMy background includes hands-on experience in agile environments, strong problem-solving skills, and a customer-focused approach, ensuring that solutions not only meet technical requirements but also enhance user satisfaction. My curiosity drives continuous improvement, while I uphold integrity in all projects, further strengthening my contributions to successful development teams.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable, full-stack applications using **TypeScript**, **Ruby on Rails**, and **React** to ensure robust performance and seamless user experiences.\n• Integrated APIs for financial and healthcare applications utilizing **Postgres**, **Redis**, and efficient data retrieval methods.\n• Implemented cybersecurity best practices in code and deployment processes, ensuring data integrity and compliance with industry standards.\n• Collaborated with cross-functional teams to identify and resolve complex problems, enhancing project outcomes through effective teamwork and communication.\n• Led the deployment of applications on **AWS CDK** and containerized environments using **Docker**, achieving a **30%** reduction in deployment time.\n• Delivered solutions with a customer-centric approach, adapting features based on user feedback to improve satisfaction and engagement.\n• Implemented CI/CD pipelines leveraging tools like **GitHub Actions** and **Docker**, facilitating consistent and reliable releases.\n• Conducted code reviews and implemented best practices, fostering a culture of **integrity** and continuous improvement within the development team.\n• Designed and optimized database schemas and queries in **Postgres**, enhancing data retrieval speeds by **20%** for critical applications.\n• Emphasized curiosity and continuous learning by staying updated with industry trends and exploring new technologies to improve workflows and solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused front-end applications utilizing **React** and **TypeScript** (Version **18**) to enhance customer experience and engagement in financial platforms.\n• Participated in collaborative teamwork to design and implement API integrations using **Ruby on Rails**, supporting seamless communication between services and enhancing system interoperability.\n• Leveraged **Postgres** and **Redis** for data storage and caching solutions, improving application performance and scalability for high-volume transaction systems.\n• Applied **Docker** for containerization of applications, ensuring consistent development and deployment processes across environments.\n• Employed **AWS CDK** to automate infrastructure as code, reducing deployment times by **30%** and streamlining resource management in cloud environments.\n• Demonstrated problem-solving skills by architecting reliable systems for high-throughput transactions while addressing cybersecurity challenges effectively.\n• Fostered a customer-focused approach to software development, delivering features aligned with user needs and improving user satisfaction ratings by **25%**.\n• Maintained integrity in code development and project execution, ensuring adherence to best practices and security protocols.\n• Cultivated curiosity by staying updated with emerging technologies, exploring enhancements to stack innovations that drive operational excellence."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Ruby on Rails** for developing robust backend services, ensuring efficient API integration and scalability in alignment with project requirements.\nDemonstrated proficiency in **TypeScript** and **React** (18), collaborating in a team-oriented environment to deliver high-quality frontend applications with an emphasis on customer-focused design and performance.\nEngaged in collaborative teamwork, effectively communicating with cross-functional teams to troubleshoot issues and implement problem-solving strategies that enhance product functionality.\nImplemented database solutions utilizing **Postgres** and **Redis**, optimizing read and write performance, and ensuring fault-tolerant access to data for seamless user experiences.\nApplied **AWS CDK** and **Docker** for streamlined deployment processes, achieving a **20%** reduction in deployment times while maintaining high security standards.\nUpdated applications with a strong emphasis on cybersecurity knowledge, reinforcing data protection and ensuring compliance with regulations, including GDPR.\nConducted code reviews and knowledge-sharing sessions, fostering a culture of curiosity and integrity within the team, which led to an increase in team productivity by **15%**.\nExecuted continuous improvements in the development cycle, adopting agile methodologies to enhance responsiveness to customer feedback and project changes, significantly increasing user satisfaction scores by **30%**.\nCreated and maintained comprehensive documentation to facilitate ongoing development and onboarding of new team members, increasing project transparency and efficiency."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Ruby, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Rails\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI integration\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), AWS CDK, Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Cybersecurity knowledge, Collaborative teamwork, Problem-solving, Customer focus, Curiosity, Integrity"
}