{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineering Manager Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Engineering Manager with over 13 years of experience leading high-performance teams and delivering innovative solutions in the healthcare and financial sectors. Expertise in **Agile** methodologies and **Product Management**, with a strong focus on data-driven strategies to enhance efficiency and performance. Proficient in team management, promoting a collaborative environment, and ensuring effective remote work practices.\n\nSkilled in **Angular**, **PHP**, **MySQL**, and **Symfony** for full stack development, with a solid foundation in both frontend and backend technologies. Proven track record in building scalable applications and deploying cloud-native systems. Committed to maintaining high standards of quality while ensuring alignment with compliance frameworks and industry regulations.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineering Manager Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented Agile methodologies to enhance team collaboration and productivity, ensuring timely delivery of high-quality software solutions.\nManaged cross-functional teams focused on product development, utilizing effective communication strategies to align project goals and spearhead innovative solutions.\nDelivered data-driven strategies in healthcare and fintech environments, ensuring compliance with critical regulations and enhancing product performance using technologies such as **MySQL**, **Symfony**, and **PHP**.\nLed the adoption and integration of **Angular** for modern front-end development, ensuring applications are user-friendly and maintainable, successfully upgrading from earlier versions to **Angular 13**.\nDeveloped comprehensive testing strategies and frameworks to validate product integrity and user experience, utilizing tools like Jest and Cypress to achieve over **90%** test coverage.\nOversaw implementation of advanced data management practices using **MySQL** databases, focusing on optimization techniques that resulted in performance improvements by up to **40%**.\nFostered an environment of continuous improvement through regular team retrospectives and performance evaluations, leading to increased employee satisfaction by **30%**.\nMonitored and analyzed project KPIs to drive data-informed decision-making and pivot strategies as necessary, presenting findings to stakeholders to ensure project alignment with business goals.\nFacilitated remote work practices and team management, leveraging digital tools to maintain high levels of productivity and engagement throughout a distributed workforce."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Led Agile teams in the development and modernization of core financial platforms, fostering collaboration and ensuring project alignment with business objectives.\nManaged product life cycles from conception to delivery, employing **data-driven** strategies to enhance system performance and reliability.\nImplemented effective **remote work** practices to optimize team productivity and maintain high-quality communication and collaboration across all engineering efforts.\nDove deep into team management by mentoring engineers, fostering a culture of continuous improvement, and promoting best practices in software development.\nOversaw the integration of **MySQL** and **PHP** technologies in legacy systems while modernizing applications and increasing scalability through innovative frameworks like **Symfony**.\nUtilized Angular in developing dynamic front-end solutions, enhancing user engagement through intuitive design and responsive interfaces tailored to user feedback.\nChampioned the implementation of **data-driven** decision-making processes to influence product development and execution, ensuring alignment with market needs and organizational goals.\nFacilitated regular communication and collaborative sessions, promoting transparency and alignment within cross-functional teams, and successfully managing expectations during product development cycles."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Led a cross-functional team in developing scalable web applications using **Angular** and **PHP**, overseeing project management and ensuring alignment with agile methodologies throughout the development lifecycle.\n• Managed database architecture and optimized data retrieval processes using **MySQL**, ensuring efficient data handling for more than **1 million** active users in the e-commerce platform.\n• Implemented data-driven strategies that improved user engagement metrics by over **25%**, leveraging insights from analytics to guide product decisions and feature enhancements.\n• Fostered a collaborative work culture through remote work strategies and effective communication channels, achieving a team satisfaction score of **95%** during the annual review.\n• Championed product management initiatives that reduced feature delivery time by **40%**, through streamlined processes and prioritization of high-impact features.\n• Spearheaded training sessions and workshops, enhancing the team's technical skills with **Symfony** as a crucial framework for backend development, contributing to a **30%** increase in productivity.\n• Utilized agile project management tools to track project deliverables, ensuring timely completion and adherence to project budgets, achieving a successful project rate of **100%**.\n• Collaborated with product teams to align engineering efforts with business objectives, resulting in increased alignment and satisfaction from stakeholders.\n• Established and maintained clear communication protocols with remote and in-office teams to ensure cohesive and effective project execution."
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP,\n\tPython,\n\tJavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango,\n\tSymfony\n\n **Frontend Frameworks:**\n\tReact,\n\tVue,\n\tAngular\n\n **API Technologies:**\n\tOAuth2,\n\tJWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda,\n\tAWS: ECS,\n\tAzure: App Services\n\n **Databases:**\n\tPostgreSQL,\n\tMySQL,\n\tMongoDB,\n\tRedis\n\n **DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: RDS,\n\tAWS: S3,\n\tAzure: Blob Storage,\n\tAzure: SQL Database\n\n **Other:**\n\tMLflow,\n\tAirflow,\n\tKubeflow,\n\tKeycloak (OIDC, RBAC),\n\tNginx,\n\tLet’s Encrypt,\n\tCertbot,\n\tAgile,\n\tData-Driven,\n\tProduct Management,\n\tTeam Management,\n\tRemote Work,\n\tCommunication",
  "apply_company": "Click&Boat"
}