{
  "name": "Tomasz Lee",
  "role_name": "Senior PHP Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior PHP Engineer with 9+ years of experience in designing and developing feature-rich applications. Highly skilled in **PHP**, **React**, and **Redux**, with a deep understanding of **E2E** testing methodologies and **PHPUnit** for robust test automation. Proficient in code architecture and design patterns, ensuring scalable and maintainable software solutions. Strong database management skills with a focus on performance optimization. Proven track record of delivering high-quality applications while collaborating effectively across teams and managing end-to-end project lifecycles.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and developed scalable web applications using **PHP** and **React** with **Redux**, enhancing application performance and user engagement by **30%**.\nImplemented advanced **design patterns** and **code architecture** principles to ensure maintainable and modular solutions, leading to a **20%** reduction in bug reports.\nConducted **test automation** using **PHPUnit**, resulting in improved code quality and a **15%** increase in deployment success rate.\nCollaborated closely with cross-functional teams to gather requirements and deliver solutions that align with user needs, boosting customer satisfaction by **25%**.\nOptimized database interactions for various relational and NoSQL databases, reducing query response times by **40%**.\nLed end-to-end (E2E) testing initiatives to ensure full application functionality, achieving a comprehensive test coverage of **85%**.\nMentored junior team members on best practices in web development and test automation, fostering a culture of continuous learning and improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and maintained web applications using **PHP** and **React** paired with **Redux**, facilitating a robust user interface and state management that improved application efficiency by 20%.\n• Conducted effective **test automation** strategies using **PHPUnit** leading to a **40%** reduction in bugs during the testing phase.\n• Designed and implemented **code architecture** utilizing best **design patterns**, ensuring scalable and maintainable codebases across multiple projects.\n• Integrated various **databases** effectively, including MySQL and PostgreSQL, optimizing query performance by **30%** to enhance data retrieval processes.\n• Led **E2E** testing frameworks implementation, which improved deployment times by **25%** and reduced post-deployment issues.\n• Collaborated with cross-functional teams to gather requirements, translating them into technical specifications and ensuring alignment with project timelines.\n• Created comprehensive documentation and conducted code reviews to uphold coding standards and mentor junior developers, resulting in a **15%** increase in team productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **PHP** and **React** to develop high-performance web applications, ensuring adherence to design patterns and code architecture principles.\nImplemented **Redux** for state management, enhancing application responsiveness and user experience by **15%**.\nDeveloped and executed **PHPUnit** test cases and **E2E** tests to maintain code quality and robustness, achieving a **90%** pass rate on testing suites.\nManaged and optimized database interactions, improving data retrieval efficiency by **25%** through effective database design and query optimization techniques.\nContributed to the architecture of scalable solutions with a focus on reusable components and modular coding practices.\nCoordinated with cross-functional teams to streamline development processes and ensure alignment with business objectives.\nEngaged in code reviews and pair programming sessions to foster knowledge sharing and uphold coding standards.\nDelivered comprehensive technical documentation and user manuals, enhancing team collaboration and onboarding processes.\nParticipated in agile methodologies, including daily stand-ups and retrospectives, to optimize project delivery timelines."
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, React, Redux\n\n\tBackend Technologies: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices, PHP\n\n\tAPI Technologies: RESTful API, GraphQL\n\n\tTesting Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, PHPUnit, E2E\n\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis\n\n\tDatabase Systems: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, databases\n\n\tDevOps: AWS, Azure, CI/CD pipelines, test automation\n\n\tCloud & Infrastructure: AWS, Azure\n\n\tOther Skills: UX/UI Design, Git, GitHub, Python, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, code architecture, design patterns",
  "apply_company": "OnTheGoSystems"
}