{
  "name": "Rei Taro",
  "role_name": "Rust Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Proficient Rust Developer with extensive experience in software development leveraging **Rust**, **Golang**, and **TypeScript** to build robust backend systems. Demonstrated mastery in identity and access management, including **OAuth** and **OIDC**, ensuring secure applications with strong security fundamentals. Committed to high code quality and adaptable to evolving project requirements, enhancing collaboration across teams. A mentor with a knack for continuous learning and problem-solving, I have successfully delivered high-performing solutions in challenging environments, contributing to top-tier projects in the financial sector and beyond.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Rust Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Rust** to engineer robust backend services that enhance document automation and user onboarding workflows, achieving a processing efficiency increase of **35%**.\nDeveloped secure authentication systems using **OAuth** and implemented identity and access management strategies to bolster security fundamentals across applications.\nCollaborated with cross-functional teams to tackle integration challenges, enhancing overall project efficiency by implementing **TypeScript** for front-end development, leading to a **20%** reduction in bug reports.\nMaintained code quality and facilitated continuous learning through mentorship, resulting in a **15%** uptick in team performance metrics.\nAdapted to evolving project requirements and utilized **Golang** to develop scalable solutions, while enhancing problem-solving capabilities across the team.\nEngaged in thorough reviews of security protocols, ensuring compliance with standards and identifying potential vulnerabilities in software development processes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "- Demonstrated strong **software development** skills by contributing to backend systems with **Rust** and **Golang** for highly efficient and scalable applications.\n- Implemented **OAuth** and **OIDC** protocols for **identity and access management**, enhancing security measures and user authentication across applications.\n- Delivered high-quality code with a focus on **code quality** through regular code reviews and mentorship, fostering a culture of **continuous learning** within the team.\n- Adapted quickly to evolving project requirements and technologies, utilizing **TypeScript** and **WASM** for enhancing frontend performance and user interactions.\n- Collaborated effectively with cross-functional teams, ensuring seamless integration and problem-solving throughout the software development lifecycle.\n- Conducted security assessments and streamlined security fundamentals, achieving a 100% compliance rate with industry standards and regulations.\n- Engaged in ongoing professional development to enhance technical proficiency, contributing to team knowledge in **security fundamentals** and best practices in software engineering."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Rust** for developing robust backend services to enhance software performance and reliability in trade execution and portfolio management. \nApplied **Golang** and **TypeScript** strategies to improve account tracking functionalities, resulting in a **30%** increase in operational efficiency. \nImplemented strong security fundamentals including **OAuth** and **OIDC** to strengthen identity and access management protocols across the platform, ensuring compliance with regulations like MiFID II and GDPR. \nCollaborated effectively with cross-functional teams to streamline software development processes, enhancing adaptability and problem-solving across projects. \nMaintained high code quality through mentorship and best practices, utilizing comprehensive testing frameworks such as **PyTest** to conduct rigorous unit testing, achieving a **50%** reduction in bug rates. \nDesigned and deployed job queuing and scheduling systems using **Celery** and **RabbitMQ**, leading to improved backend task execution efficiency by **25%**."
    }
  ],
  "skills": "  **Programming Languages**\n\tRust, Golang, TypeScript, WASM, Python (3.8+), SQL, Bash, JavaScript\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **API Technologies**\n\tREST/gRPC APIs, OAuth, OIDC, identity and access management\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes\n\n  **DevOps**\n\tGitHub Actions, Azure DevOps, CI/CD\n\n  **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, software development, security fundamentals, collaboration, adaptability, continuous learning, problem solving, code quality, mentorship"
}