{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Azure Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Azure Engineer with 13+ years of experience in managing and optimizing cloud environments on **Azure**. Proficient in **Linux**, **Kubernetes**, and **Docker**, with a strong focus on **Cloud** administration and monitoring. Adept at ensuring compliance with SLAs and providing documentation for cloud solutions. Expert in troubleshooting and problem-solving, enhancing operational efficiency for enterprise applications. \n\nIn addition to cloud-focused skills, I have extensive experience in full stack development utilizing **JavaScript/TypeScript**, **Python**, and **Flutter**. My background includes delivering high-performance applications for the healthcare and financial sectors, utilizing frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My expertise in AI/ML-driven platforms supports predictive analytics and automation, while my MLOps knowledge encompasses model training and orchestration using **MLflow**, **Airflow**, and **Kubeflow**. Fluent in both German and English.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Azure Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Managed and administered **Azure** environments to ensure scalability and reliability while addressing **Linux** server configurations and monitoring for performance improvements.\n• Deployed and managed containerized applications with **Docker** and **Kubernetes** for enhanced fault tolerance and efficient resource utilization.\n• Developed comprehensive documentation for **Azure** deployments and processes, ensuring clarity and compliance with SLAs.\n• Provided high-level problem-solving skills to troubleshoot issues within **Azure** infrastructure while maintaining service uptime beyond **99%**.\n• Implemented monitoring solutions for **Azure** resources, utilizing native tools and third-party integrations to enhance performance and security.\n• Collaborated on **IIoT** projects, optimizing cloud-based solutions that integrate with existing industrial systems.\n• Designed and enforced SLAs for application performance and uptime across various services managed in the **Azure** cloud environment.\n• Coached team members on best practices for **Azure** administration and resource management, promoting a culture of continuous improvement.\n• Developed cross-functional capabilities by leveraging **Linux** servers for various backend services while ensuring compliance with industry standards.\n• Supported infrastructure as code (IaC) strategies using tools like ARM templates and Terraform for more rapid deployment cycles and environment consistency."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Administered cloud infrastructure on **Azure**, leveraging tools such as **Kubernetes** and **Docker** for efficient orchestration and container management of applications.\n- Developed and maintained comprehensive documentation to ensure compliance with **SLA** requirements while fostering clear communication among team members in both **German** and **English**.\n- Implemented robust monitoring solutions to enhance the reliability and performance of services, utilizing tools aligned with **cloud** and **Linux** environments to proactively address potential issues.\n- Provided cloud administration support through effective problem-solving techniques, ensuring smooth operational workflows across all processes involving embedded **IIoT** solutions.\n- Collaborated in multi-disciplinary teams to translate complex technical concepts into accessible documentation and training materials.\n- Engaged in performance optimization for cloud-native applications, contributing to a consistent **20%** reduction in downtime through proactive administration and monitoring strategies.\n- Spearheaded initiatives that improved operational efficiency by **15%**, leading to enhanced service delivery and customer satisfaction.\n- Trained new team members on **cloud** services, **Linux** administration, and the use of monitoring tools, improving team capability and confidence."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Managed cloud infrastructure on **Azure**, ensuring optimal performance and reliability for distributed applications.\n- Administered **Linux** systems to support backend services, contributing to improved system uptime and performance metrics.\n- Deployed containerized applications using **Docker** and orchestrated using **Kubernetes**, maximizing resource efficiency and facilitating scalable deployments.\n- Developed monitoring solutions to proactively address performance issues, maintaining **SLA** targets and enhancing overall application stability.\n- Prepared thorough documentation for system configurations and operational procedures to ensure team knowledge transfer and operational transparency.\n- Demonstrated strong problem-solving skills by troubleshooting and resolving complex issues in a timely manner, resulting in 95% problem resolution within the first **24 hours**.\n- Collaborated effectively with cross-functional teams, leveraging bilingual proficiency in **German** and **English** to facilitate communication and teamwork.\n- Ensured the security and compliance of cloud resources through regular audits and adherence to ISO standards, maintaining a secure environment for sensitive data.\n- Streamlined administration processes and operational tasks, leading to a 20% reduction in manual intervention efforts across the engineering team."
    }
  ],
  "skills": " **Programming Languages**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks**\n\t\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\t\n\n**Serverless and Cloud Functions**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAzure\n\tCloud\n\tLinux\n\n**Other**\n\tIIoT\n\tMonitoring\n\tAdministration\n\tDocumentation\n\tSLA\n\tProblem-solving\n\tGerman\n\tEnglish\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot",
  "apply_company": "ifm"
}