{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Backend Engineer with 13+ years of experience in building high-performance applications in the healthcare and financial industries. Proficient in **Go**, **Ruby**, and **PostgreSQL**, with hands-on experience in developing backend solutions using **Kubernetes**, **AWS**, **Kafka**, and **ELK** stack. Expertise in Domain-Driven Design, ensuring robust coding practices through effective **Code Quality** measures and diligent **Testing** protocols.\n\nSkilled in adopting and promoting **Code Reviews**, fostering **Teamwork**, and demonstrating strong **Communication** skills to enhance project outcomes. Well-versed in agile methodologies, embracing **Problem Solving** and **Curiosity** to tackle complex challenges, delivering impactful solutions aligned with business goals. Experienced in implementing best practices to drive impact orientation across teams.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Go** and **Ruby** to design and build robust backend solutions, ensuring high performance and reliability for health and finance applications.\nImplemented microservices architecture using **Kubernetes** and **AWS**, enhancing system scalability and fault tolerance while increasing deployment efficiency by **30%**.\nOperated data storage solutions using **PostgreSQL**, enabling efficient data management and retrieval, with support for heavy data ingestion and real-time analytics.\nEnsured code quality through thorough **code reviews**, maintaining high standards of software craftsmanship and minimizing technical debt.\nCollaborated in cross-functional teams to improve **domain-driven design** principles, resulting in more maintainable and adaptable codebases.\nDeveloped and maintained testing frameworks utilizing **Testing** tools like Jest and Cypress, achieving **95%** test coverage and robust regression testing procedures.\nContributed to team development by sharing knowledge of **Kafka** for real-time data processing and **ELK** stack for log analysis, optimizing system observability.\nParticipated in regular **communication** with stakeholders to align project goals and progress, ensuring all solutions met business needs and expectations.\nFostering a culture of **teamwork** and **curiosity**, mentored junior engineers, promoting skill development and collaborative problem-solving methodologies.\nEngaged in continuous improvement of processes to maximize **impact orientation**, implementing feedback mechanisms to enhance system performance and user experience."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Go** and **Ruby** for enhancing backend systems, focusing on **Code Quality** and implementing best practices in **Testing** and **Code Reviews** to ensure high reliability and maintainability.\nAdministered **PostgreSQL** for data storage, optimizing queries and performance to support high-volume transactions within financial platforms.\nImplemented **Kubernetes** for container orchestration, ensuring seamless deployment and scaling of microservices across cloud environments.\nCollaborated within an agile team structure, demonstrating **Teamwork** and effective **Communication** skills to drive project success and promote **Impact Orientation** in every sprint.\nEngaged in continuous learning to stay updated with **Domain-Driven Design** principles, which improved system architecture and led to better software solutions.\nDeveloped a microservices architecture that included technologies such as **Kafka** for event streaming, ensuring efficient data flow and real-time processing capabilities across applications.\nConducted thorough **Code Reviews** to uphold coding standards and enhance team productivity, leveraging curiosity and problem-solving skills to address and resolve issues.\nEnhanced system performance by writing robust, scalable APIs and services in **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), achieving **20%** reduction in response times.\nCreated dynamic front-end applications with **React** (18), **Next.js**, and integrated technologies like **D3.js** for advanced data visualization, heightening user experience and engagement by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Go** and **Ruby** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across critical modules, targeting a **99%** uptime.\nImplemented **PostgreSQL** for robust data management and retrieval, achieving response times under **200ms** for high-traffic e-commerce workflows.\nApplied **Kubernetes** for container orchestration, improving deployment efficiency by **30%** while enforcing consistent testing and code quality standards.\nEmployed **Kafka** for event-driven architecture, enhancing real-time order update responsiveness by **40%** and improving customer support capabilities.\nEngaged in rigorous **code reviews** and **testing** practices to uphold high **code quality**, fostering a culture of continuous improvement among team members.\nDemonstrated effective **teamwork** and **communication** skills across cross-functional teams to drive project objectives and align on tasks, resulting in a **15%** increase in project delivery speed.\nNavigated complex problem-solving scenarios to optimize system performance and drive impactful changes that led to an improved customer experience.\nCultivated a spirit of **curiosity** and **impact orientation** by exploring new technologies, resulting in innovative solutions integrated into platform workflows.\nPrioritized documentation and knowledge sharing within the team to maintain high standards of software engineering practices and promote learning opportunities."
    }
  ],
  "skills": " **Programming Languages:**\n\tGo, Ruby, Kotlin, Swift, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, EmberJS\n\n**API Technologies:**\n\tKeycloak, OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Kafka, ELK, Domain-Driven Design, Code Quality, Testing, Code Reviews, Teamwork, Communication, Problem Solving, Curiosity, Impact Orientation",
  "apply_company": "Qonto"
}