{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in building and delivering high-performance applications, specializing in **Python**, **Docker**, **Kubernetes**, and **Azure DevOps**. Proven expertise in implementing **Asynchronous Programming**, **API** development, and **Unit Testing** within both frontend and backend environments. \nSkilled in designing microservices architectures and deploying solutions with **DevOps** methodologies, enhancing efficiency and scalability. Experienced in utilizing **MQTT**, **Flask**, **Quart**, and **OpenAPI** for a robust system integration. \nProficient in **Websockets** and leveraging **Pymongo** alongside **AsyncIO** for optimal database interactions. Strong background in compliance-driven development, with solid communication and interpersonal skills that facilitate collaboration in cross-functional teams. Adept at Technical Writing and Data Analytics, with an additional focus on **Data Polishing** and **Encryption**, ensuring the delivery of quality and secure applications across sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** frameworks such as **FastAPI** and **Flask** to design and build full-stack platforms for healthcare and fintech, ensuring compliance with industry standards including HIPAA, FHIR, and GDPR.\nEmployed **Docker** and **Kubernetes (AKS/EKS)** to lead the transformation of legacy systems into microservices architectures, promoting fault tolerance and scalability.\nImplemented robust **DevOps** pipelines using **Azure DevOps** and **GitHub Actions**, ensuring full test automation, security checks, and seamless multi-environment deployment workflows.\nCreated and maintained asynchronous APIs with **OpenAPI** and **Websockets**, optimizing data flow for real-time user interactions and ensuring secure communications.\nEngaged in unit testing and employed testing frameworks such as **PyTest** and **Cypress** to enforce rigorous testing strategies across the technology stack.\nDesigned and executed data analytics initiatives utilizing both structured and unstructured datasets, with a focus on **Data Polishing** and **Data Analytics** techniques.\nCollaborated on integrating intelligent features in applications through advanced communication techniques like **MQTT**, enhancing user experience.\nCrafted advanced **data visualization** tools using **D3.js** and **Power BI** to analyze key operational KPIs and fraud detection metrics.\nDeveloped mobile applications for iOS and Android leveraging **Flutter** and **React Native**, incorporating native module management for improved performance and real-time interactions.\nLed the deployment of machine learning models for tasks including risk scoring and fraud detection, using **scikit-learn**, **TensorFlow**, and **PyTorch**, integrating backend inference in live systems.\nIntegrated search capabilities with **Elasticsearch** and Azure Cognitive Search, facilitating fast and flexible querying mechanisms for various datasets across the health and finance sectors.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and maintained APIs using **Python**, **Flask**, and **Quart** to facilitate efficient communication between microservices in a financial platform environment.\n- Designed event-driven architectures with asynchronous programming patterns in mind using **Kafka** and **RabbitMQ** to optimize message processing across services.\n- Leveraged **Azure DevOps** for continuous integration and deployment, ensuring seamless updates and efficient code management within **Docker** and **Kubernetes** environments.\n- Implemented unit testing strategies using **pytest** to improve code quality and reliability for **Python** applications, achieving a test coverage of over **85%**.\n- Engaged in technical writing to document APIs and system architecture, promoting clarity and consistency across development teams.\n- Enhanced data analytics capabilities by building real-time dashboards with tools like **Power BI Embedded** and **D3.js**, delivering insights on approximately **500,000** transactions daily.\n- Collaborated with cross-functional teams, showcasing strong interpersonal skills to ensure alignment on project goals and timelines.\n- Implemented data polishing techniques for accurate data ingestion in ETL pipelines, improving data accuracy by **20%** for analytical processes.\n- Engaged in ongoing education and professional development to stay current with emerging technologies, contributing to innovation in financial software engineering."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** with frameworks such as **Flask**, **Quart**, and **AsyncIO** to design and optimize backend services, ensuring high performance and scalability in a complex, global e-commerce platform.\nIntegrated **Docker** and **Kubernetes** for streamlined deployment processes and efficient management of containerized applications, achieving a **99%** uptime across key infrastructure components.\nImplemented asynchronous programming paradigms to enhance API responsiveness, utilizing techniques like **WebSockets** for real-time communication, contributing to a **30%** decrease in latency for order updates and customer interactions.\nExecuted comprehensive unit testing strategies to ensure high-quality code delivery, resulting in a **40%** reduction in production issues post-deployment.\nFacilitated effective communication between cross-functional teams through clear technical writing and documentation, enhancing project workflows and project delivery timelines by **15%**.\nLeveraged **Data Analytics** to analyze application performance metrics, providing insights that informed data-driven decisions and improved operational efficiencies.\nDesigned and implemented secure communication protocols, ensuring data encryption for protocol integrity and compliance with GDPR standards while working with third-party payment processors like Stripe and PayPal.\nCollaborated with Azure DevOps to manage CI/CD pipelines, automating deployment processes and reducing deployment times by over **50%**.\nApplied role-based access control (RBAC) and OAuth 2.0 strategies to enhance platform security and protect sensitive user data, aligning with industry best practices.\nMaintained robust interpersonal skills to foster collaboration and resolve conflicts within the development team, promoting a culture of teamwork and accountability."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Asynchronous Programming\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Quart, Werkzeug\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI, OpenAPI, Websockets, MQTT, OCPP\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Pymongo, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Azure DevOps, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Unit Testing, Data Polishing, Encryption, Communication, Interpersonal Skills, Technical Writing, Data Analytics",
  "apply_company": "GlobalLogic"
}