{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Python Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Python Engineer with 13+ years of experience in developing high-performance applications, specializing in **Python** and **Django**. Proven expertise in building robust APIs and automating processes to enhance system efficiency. Proficient in **AWS** for deploying cloud-native systems and implementing CI/CD pipelines to streamline development workflows. Strong focus on observability to ensure optimal performance of applications in production.\nSkilled in **JavaScript/TypeScript**, with hands-on experience in both frontend and backend development using frameworks such as **React**, **Next.js**, and **Vue**. Experienced in creating AI/ML-powered platforms that incorporate predictive analytics and real-time processing, leveraging tools in the MLOps ecosystem like **MLflow**, **Airflow**, and **Kubeflow**. Committed to compliance-driven development, aligning solutions with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained robust APIs using **Python** and **Django** to ensure seamless data interaction and automation functionalities for healthcare and fintech solutions.\n• Implemented CI/CD pipelines leveraging **AWS** services and tools like **GitHub Actions** and **CircleCI** to streamline deployment processes and enhance software observability.\n• Automated testing and deployment processes using a combination of **pytest**, **Jest**, and modern CI tools, achieving **95% test coverage** and reduced deployment times by **30%**.\n• Optimized backend services for scalability and reliability, integrating automation workflows that improved performance monitoring and observability metrics.\n• Collaborated with cross-functional teams utilizing **AWS** and intelligent automation tools to deliver innovative features, enhancing user experience in both financial and health applications.\n• Drove key performance indicators (KPIs) tracking through advanced observability strategies, leading to a **20%** increase in application responsiveness.\n• Mentored junior developers in best practices for API development and automation, fostering a culture of continuous learning and improvement.\n• Enhanced system reliability and error tracking through implementation of observability frameworks, reducing incident response time by **40%**.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Django** to develop scalable backend services, enhancing system performance by **30%** through code optimization and best practices.\nImplemented **CI/CD** pipelines for automated deployment processes, reducing lead time for releases by **50%** and improving overall software quality.\nDeveloped and maintained RESTful **APIs** to ensure seamless integration between front-end applications and backend services while adhering to industry standards for security and performance.\nAutomated data processing tasks using scripting in **Python**, increasing operational efficiency and reducing manual intervention by **40%**.\nIntegrated **AWS** cloud services to enhance application reliability and scalability, resulting in a **20%** reduction in infrastructure costs.\nEmployed observability tools to monitor application performance in real-time, proactively addressing potential issues and improving system uptime by **99.9%**.\nCollaborated with cross-functional teams to gather requirements and deliver high-quality software solutions that align with business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** frameworks such as **Django** to design and optimize backend services for a global e-commerce platform, enhancing scalability by supporting **9** key modules including checkout and order fulfillment.\nImplemented **CI/CD** pipelines to automate deployment processes, reducing release time by **30%** and ensuring continuous integration and delivery to support feature enhancements.\nIntegrated with AWS services for cloud hosting, enabling high availability and load balancing that supports up to **10,000** concurrent users during peak traffic times.\nDeveloped and documented robust **API** interfaces, enhancing interoperability between microservices and third-party integrations to foster system compatibility and agility.\nOptimized application performance through effective observability strategies, leading to a **25%** decrease in system downtime and enhancing overall user experience across the platform.\nEngaged in code reviews and automated testing to assure code quality and maintainability, leading to a **15%** reduction in bug reports from production.\nCollaborated with cross-functional teams to gather requirements and deliver high-quality solutions rooted in best practices and industry standards, enhancing team productivity by **20%**.\nFacilitated knowledge-sharing sessions and mentoring opportunities, contributing to a **50%** increase in team skillsets related to **Python** and **Django** development."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tDjango\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, automation, observability, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Paychex"
}