{
  "name": "Patryk Zaslawski",
  "role_name": "Fullstack Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-driven Fullstack Engineer with over 8 years of experience in developing web-based applications. Skilled in leveraging **React.js** and adept at implementing robust **APIs** alongside efficient testing strategies and continuous integration/deployment practices. Proficient in **AWS** for cloud environments, utilizing version control and logging/monitoring tools for operational excellence. My background includes building secure and scalable applications through a strong command of **Python** (FastAPI, Django, Flask, SQLAlchemy) and frontend frameworks like **Svelte**. I excel in problem-solving and adaptability, delivering clean code and high-performance solutions in e-commerce, financial, and healthcare sectors. Committed to adhering to industry best practices, including microservices architecture and REST/gRPC API development.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Fullstack Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and maintained web-based applications using **React.js** and **Svelte**, ensuring high performance and responsive design for user-friendly interfaces.\nImplemented robust **APIs** to facilitate seamless communication between front-end and back-end systems, fostering effective data exchange and cooperation.\nDesigned testing strategies, including unit, integration, and end-to-end tests, utilizing **Jest** and **Cypress**, to enhance code reliability and minimize bugs by **30%**.\nConfigured and maintained CI/CD pipelines for **continuous integration** and **continuous deployment** using **GitHub Actions** and **Azure DevOps**, reducing deployment times by **25%**.\nUtilized version control practices with **Git** to manage code changes and collaborate effectively in a team environment of **10+ engineers**.\nEmployed logging tools like **Logstash** and monitoring tools such as **Prometheus** to enhance observability across applications, facilitating proactive issue resolution.\nAdapted to cloud environments, optimizing application performance and scalability through **AWS** services, leading to reduced operational costs by **15%**.\nArchitected maintainable and clean code solutions by implementing best practices in software development, contributing to improved application security and maintainability.\nEngaged in problem-solving sessions to address complex issues within the development process, promoting a culture of adaptability and innovative solutions within the team.\nCollaborated with cross-functional teams to integrate feedback from users into the development process, ensuring that delivery practices align with user needs and expectations."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and deployed web-based applications utilizing **React.js** and **Svelte**, ensuring high interactivity and engagement with users.\n• Designed and implemented robust APIs ensuring seamless communication and data exchange across services, enhancing overall application performance.\n• Applied continuous integration and continuous deployment practices with **GitHub Actions** and **Azure DevOps**, maintaining a deployment success rate of over **95%**.\n• Utilized effective logging and monitoring tools alongside **Kubernetes** to maintain system health and performance, achieving reduced incident response time by **30%**.\n• Leveraged cloud environments including **AWS** for scalable infrastructure management, significantly improving application performance for high-demand scenarios.\n• Established testing strategies including unit testing with **Jest** and integration testing to ensure reliability and maintain clean code practices across the codebase.\n• Adapted quickly to changing requirements and technology stacks, demonstrating problem-solving skills to overcome development challenges efficiently.\n• Contributed to enhancing delivery practices by implementing version control systems ensuring codebase integrity, achieving streamlined collaboration across teams.\n• Managed and optimized logging systems with the **ELK stack** (Elasticsearch, Logstash, Kibana) for centralized logging, which improved debugging speed by **40%**.\n• Integrated CI/CD pipelines enhancing delivery time and reducing deployment errors, focusing on automated quality assurance and maintaining high delivery standards."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Developed and integrated user interfaces using **Svelte**, **React.js**, and other frontend technologies to create responsive web-based applications that enhance user engagement and satisfaction.\n• Designed, built, and consumed RESTful APIs, enabling seamless interaction between frontend applications and backend systems, significantly improving performance metrics.\n• Implemented robust testing strategies including unit, integration, and automated testing to ensure high code quality and delivery confidence, reducing production issues by up to **30%**.\n• Managed CI/CD processes with tools like **GitHub Actions** and **Azure DevOps** to automate the deployment pipeline, achieving an improvement in delivery speed by **40%**.\n• Ensured version control practices with **Git**, maintaining code integrity and facilitating collaboration within development teams.\n• Leveraged modern logging and monitoring tools such as **Prometheus** and **Grafana** for enhanced observability of application performance and quick issue resolution.\n• Worked within cloud environments, including **AWS**, to deploy scalable applications while optimizing resource usage and costs.\n• Applied problem-solving skills to diagnose software issues, adapt solutions quickly, and implement clean code practices across all projects.\n• Conducted thorough performance testing using tools like **JMeter** and **k6**, validating web applications under simulated peak loads of **1000+** concurrent users.\n• Enhanced system adaptability by incorporating event-driven architectures using message brokers like **RabbitMQ** and **Kafka**, allowing flexible and scalable data processing.\n• Ensured compliance and security in applications by implementing OAuth 2.0 and applying clean code principles throughout development processes, fostering maintainable and efficient codebases."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tPython (FastAPI, Django, Flask), Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), React.js, Next.js, Vue.js (2/3), Blazor, Svelte\n\n **API Technologies:**\n\tREST & gRPC APIs, APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, continuous integration, continuous deployment, delivery practices\n\n **Cloud & Infrastructure:**\n\tcloud environments\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, SQLAlchemy, Pydantic, Celery, logging tools, monitoring tools, version control, testing strategies, problem-solving, adaptability, clean code"
}