{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Developer (PHP/NodeJS)",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior Backend Developer with 13+ years of experience specializing in **PHP**, **Node.js**, and **RESTful APIs** for high-performance applications in the healthcare and financial sectors. Demonstrated expertise in **Laravel** and **Symfony** frameworks, ensuring efficient backend development. Proficient in both **SQL Server** and **MySQL** for robust data management, alongside proficiency in **NoSQL** databases like **MongoDB** and **CosmosDB**.\n\nSkilled in implementing cloud solutions with **Microsoft Azure** and **Amazon Web Services**, deploying scalable systems while adeptly utilizing **Docker** for containerization and orchestration. Experienced in continuous integration and delivery pipelines using **Azure DevOps** and **GitHub Actions**.\n\nAdept in collaborative methodologies such as **SCRUM** and **Kanban**, ensuring smooth project flow and efficient team dynamics. Backed by hands-on experience in comprehensive testing frameworks like **Codeception** and **PHPUnit**, emphasizing quality and robustness in application development.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Developer (PHP/NodeJS)",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed scalable backend systems using **PHP** and **NodeJS** frameworks like **Laravel** and **Symfony**, ensuring high-performance and maintainability across multiple projects.\nDesigned RESTful APIs to facilitate seamless communication between frontend and backend services, optimizing response times and security protocols.\nLeveraged **SQL Server** and **MySQL** for efficient data management and querying, achieving database performance improvements by up to **30%** through optimized queries and index management.\nManaged cloud services and deployment solutions using **Microsoft Azure** and **Amazon Web Services**, supporting continuous integration and delivery using **Azure DevOps** and **GitHub Actions** for a **50%** enhancement in deployment speed.\nImplemented containerized applications using **Docker**, streamlining development workflows and ensuring consistency across various development and production environments.\nCollaborated within Agile/SCRUM and Kanban frameworks, achieving timely project deliveries with a **25%** increase in team productivity.\nUtilized **NoSQL** databases like **Mongo** and **CosmosDB** for flexible data storage and real-time analytics, supporting applications with dynamic data structures.\nConducted unit and integration testing using **PHPUnit** and **Codeception**, increasing code coverage to **85%**, thereby ensuring application reliability and reducing bugs in production environments.\nIntegrated version control and collaboration best practices using **GIT**, enabling team members to work concurrently with a reduced risk of conflicts.\nDeveloped and maintained comprehensive documentation for the backend systems and APIs, resulting in improved onboarding processes and team knowledge sharing."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and maintained backend systems using **PHP** (Laravel/Symfony) and **Node.js** (NestJS/Express) to ensure high performance and responsiveness in transactional applications.\n- Designed RESTful APIs for seamless integration with front-end applications built on **React** and **Vue** frameworks, enhancing user experience for financial tools.\n- Implemented database solutions utilizing **SQL Server** and **MySQL**, optimizing queries and structures for a 50% increase in data retrieval efficiency.\n- Conducted data migration processes to **Azure** and **AWS** cloud services, improving system reliability and scalability by 30%.\n- Utilized **Docker** for containerization of applications which streamlined deployment process across different environments, improving consistency and reducing setup time by 40%.\n- Employed **GIT** for version control, ensuring collaborative coding practices and maintaining code integrity.\n- Actively participated in **SCRUM** and **Kanban** methodologies, contributing to sprint planning and retrospective meetings, leading to a 25% enhancement in team productivity.\n- Wrote unit tests using **Codeception** and **PHPUnit**, achieving over 85% code coverage to ensure application reliability and reduce bugs in production.\n- Engaged with NoSQL databases like **CosmosDB** and **MongoDB** for flexible data storage solutions, efficiently handling unstructured data from diverse sources."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized backend services for high-performance web applications using **PHP** (Laravel, Symfony) and **Node.js** (ensuring high availability and low latency for core business functionalities).\nLeveraged SQL Server and MySQL for efficient data storage and retrieval, implementing advanced database design strategies to handle **1M**+ transactions daily with **99.9%** uptime.\nEngineered RESTful APIs for seamless integration with various front-end modules and third-party services, enhancing overall system interoperability and user experience.\nImplemented cloud solutions using **Microsoft Azure** and **Amazon Web Services**, employing services like Azure Functions and EC2 to improve scalability and performance.\nUtilized **Docker** for containerization, ensuring consistent development and production environments and enabling microservices architecture across the system.\nManaged source control and CI/CD pipelines using **GIT**, **GitHub Actions**, and **Azure DevOps**, facilitating smooth and automated deployment processes that reduced release times by **30%**.\nConducted rigorous testing and quality assurance using **Codeception** and **PHPUnit**, ensuring robust performance and maintainability of the codebase.\nApplied agile methodologies (SCRUM and Kanban) to optimize development workflows and enhance team collaboration across project milestones and deliverables.\nAdministered both relational (**SQL Server**, **MySQL**) and NoSQL (**MongoDB**, **CosmosDB**) databases, ensuring data integrity and performance tuning for applications under heavy loads.\nImplemented security protocols, including role-based access control (RBAC) and OAuth 2.0, safeguarding sensitive user data and achieving compliance with GDPR regulations."
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tLaravel, Symfony, FastAPI, Flask, Django, NodeJS\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs, OAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, SQL Server, MongoDB, Redis, CosmosDB\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tLinux, GIT, MLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, SCRUM, Kanban, Codeception, PHPUnit"
}