{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior BIM Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior BIM Engineer with 13+ years of experience in delivering high-performance applications and solutions within the engineering and construction industries. Proficient in integrating **API** services and visualizing data through **Power BI** to enhance project outcomes. Strong capabilities in utilizing tools such as **BIM**, **Bentley ProjectWise**, **Trimble Connect**, **Autodesk ACC**, **Dalux**, **Grasshopper**, and **Dynamo** to optimize project workflows and collaboration.\nSkilled in implementing AI technologies to improve decision-making processes and project efficiencies, focusing on predictive analytics and real-time data processing. Committed to fostering effective **communication** across multidisciplinary teams for successful project execution. My technical expertise is complemented by my hands-on experience with frontend and backend development using **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, and cloud deployments on **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior BIM Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **BIM** technologies to enhance project collaboration through **CDE** platforms, implementing workflows using **Bentley ProjectWise**, **Trimble Connect**, and **Autodesk ACC** to streamline project delivery and communication.\nLed the integration of design automation tools such as **Grasshopper** and **Dynamo**, increasing efficiency in project design iterations by up to **40%**.\nDeveloped and maintained responsive dashboards using **Power BI**, enabling real-time project performance tracking and analytics to stakeholders with an accuracy rate of **95%**.\nImplemented API integrations to facilitate data exchange between architectural tools and project management systems, enhancing interoperability and reducing data redundancy by **30%**.\nCollaborated effectively across multidisciplinary teams, ensuring coherent communication channels and fostering a team-oriented environment focused on sustainable practices and innovation in **AI** technologies.\nDesigned and executed training programs on BIM methodologies and tools, benefiting over **50** project team members and improving their proficiency with **BIM** systems.\nStreamlined project workflows by employing communication strategies that led to project completion times being reduced by **20%**, improving overall client satisfaction.\nConducted regular audits of BIM standards and practices, enforcing quality controls that maintained compliance with industry regulations and enhanced data integrity across stakeholders.\nParticipated in the R&D of AI-driven solutions for predictive analysis and building performance optimization, which provided insights leading to cost savings of up to **15%** on project budgets.\nFostered cross-functional collaboration with engineering teams to address project-specific challenges, resulting in innovative solutions that met client expectations and legislative requirements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **BIM** principles to create comprehensive design documentation and workflows that integrated seamlessly with **CDE** using tools like **Bentley ProjectWise** and **Trimble Connect**.\nUtilized **Autodesk ACC** and **Dalux** to enhance project visibility and collaboration among multidisciplinary teams, ensuring timely communication and adherence to project deadlines.\nDeveloped interactive dashboards in **Power BI** to visualize project progress and KPIs, facilitating data-driven decision-making for teams across **9** concurrent projects.\nImplemented **AI**-driven analytical frameworks for predictive modeling in project delivery processes, improving efficiency by **20%**.\nEffectively communicated complex technical concepts to non-technical stakeholders, ensuring all parties understood project scopes and requirements.\nDesigned custom **API** integrations that streamlined data exchange between various tools like **Grasshopper** and **Dynamo**, increasing modeling efficiency by **15%**.\nCollaborated with cross-functional teams to develop solutions leveraging **BIM** technologies, resulting in an overall reduction in project delivery times by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **BIM** methodologies and tools to enhance project visualization and collaboration across teams, improving project delivery efficiency by **30%**.\nLed the implementation of **CDE** frameworks to streamline data management processes, ensuring accurate and timely information availability to stakeholders.\nIntegrated **Bentley ProjectWise** and **Trimble Connect** for effective document control and project data management, facilitating smooth communication among team members and reducing project delays by **15%**.\nDeveloped automation scripts using **Grasshopper** and **Dynamo**, optimizing design workflows and reducing manual errors, resulting in a **25%** decrease in project rework.\nCreated interactive dashboards and reports using **Power BI** to provide real-time insights into project metrics and KPIs, enhancing decision-making processes.\nEngineered API integrations to connect various software solutions, improving interoperability and workflow automation within project teams.\nEmployed **AI** technologies to analyze data sets and predict project risks, enabling proactive management and intervention strategies.\nFacilitated effective communication among multidisciplinary teams, ensuring alignment in project objectives and enhancing overall project performance.\nConducted workshops and training sessions to elevate team capabilities in **Autodesk ACC**, ensuring that staff are well-versed in the latest tools and processes for optimal project execution.\nAssured compliance with industry standards and protocols, significantly enhancing data integrity and project sustainability."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular, AI\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tAPI\n\n **Serverless and Cloud Functions:** \n\tAWS: ECS, Lambda, Azure: App Services\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:** \n\tBIM, CDE, Bentley ProjectWise, Trimble Connect, Autodesk ACC, Dalux, Grasshopper, Dynamo, Power BI, communication, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Sweco"
}