{
  "name": "Mariusz Jan Skobel",
  "role_name": "Fullstack Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Full Stack Developer with 10+ years of experience specializing in **C#**, **.NET**, and **Angular** for high-performance software solutions. Proficient in building APIs and implementing **Domain-Driven Design** to ensure robust architecture. Experienced in collaboration and product management, driving projects with proactivity and strong communication. Skilled in modern technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**, with a complete hands-on expertise in the full stack using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proficient in building and deploying cloud-native applications on **Azure** and **AWS**, and adept in developing enterprise platforms that integrate AI/ML capabilities for real-time analytics and intelligent decision-making. Strong background in microservices architecture and CI/CD automation, creating secure and maintainable solutions compliant with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Brings practical experience in MLOps from developing ML pipelines to managing production workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**. Passionate about delivering systems that are technically sound and driven by real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Fullstack Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented full-stack solutions leveraging **C#**, **.NET**, and **APIs** to meet business requirements, ensuring scalability and high performance in applications.\n• Utilized **Domain-Driven Design** principles to create robust application architectures, enabling better alignment between technical components and business domains.\n• Developed user interfaces using **Angular** for dynamic web applications, ensuring responsive design and seamless user experiences.\n• Collaborated closely with cross-functional teams to prioritize and manage product features, demonstrating strong **Product Management** skills and delivering on project timelines.\n• Championed proactive communication and collaboration across teams to enhance project transparency and foster an innovative development environment.\n• Led the evolution of application architecture by transitioning legacy systems to microservices using **Docker** and **Kubernetes**, achieving a 30% reduction in downtime.\n• Engaged in continuous integration and delivery by implementing DevOps practices with tools like **GitHub Actions** and **Azure DevOps**, reducing deployment times by 40% and increasing code quality.\n• Mentored junior developers in best practices for **C#** and **.NET**, improving team skill sets and enhancing overall project delivery capacity.\n• Delivered insightful data visualizations using frameworks like **D3.js** and **Chart.js** to facilitate understanding of complex production datasets and key performance indicators (KPIs).\n• Developed and executed comprehensive test strategies utilizing **Jest**, **Cypress**, and **Postman**, achieving 95% test coverage and ensuring code reliability prior to production deployments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained RESTful **APIs** to support backend services in C# and **.NET**, ensuring scalable inter-service communication aligned with Domain-Driven Design principles.\nCollaborated with cross-functional teams to gather requirements and implement product features, enhancing overall product usability and aligning with business objectives.\nLed the design and development of front-end applications using **Angular** to create responsive, user-friendly interfaces that streamline user interactions with the platform.\nEmployed Agile methodologies to enhance collaboration and productivity across teams, ensuring timely updates and the successful delivery of projects within **3-month** sprints.\nActively participated in code reviews and contributed to developing best practices for clean code and **API** integration, improving overall code quality by **25%**.\nUtilized Proactivity by identifying potential operational inefficiencies and proposing innovative solutions that resulted in a **15%** reduction in processing times.\nFacilitated knowledge sharing sessions to enhance team collaboration on using **C#** best practices and interconnection protocols, leading to improved performance across team projects."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable APIs using **C#** and **.NET**, ensuring optimal performance in accordance with **Domain-Driven Design** principles.\n• Engineered frontend applications with **Angular** to create user-focused interfaces, facilitating collaboration between product managers and development teams.\n• Applied interconnection protocols to enhance system integrations and data communications, streamlining workflows and improving overall product management capabilities.\n• Collaborated closely with cross-functional teams to prioritize project objectives, demonstrating proactivity in addressing potential roadblocks and optimizing development processes.\n• Designed and implemented robust caching mechanisms and performance optimizations to ensure high system resilience, achieving a **20%** reduction in API response time.\n• Managed the deployment of features with emphasis on maintaining service reliability, achieving a **99.9%** system uptime and seamless user experience during major updates.\n• Conducted regular code reviews and team workshops to encourage knowledge sharing and continuous improvement within the development team, reinforcing collaborative practices and enhancing overall skillsets.\n• Participated in product roadmap discussions to align technical advancements with business objectives, ensuring timely delivery and customer satisfaction.\n• Utilized version control systems effectively to manage code revisions and facilitate efficient team collaboration, improving overall productivity by **30%**."
    }
  ],
  "skills": "**Programming Languages**\n\tC#, Python, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, .NET\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tAPIs, Interconnection Protocols\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Collaboration, Proactivity, Product Management",
  "apply_company": "Agicap"
}