{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Automation Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Senior Automation Engineer with 8 years of full-stack development experience, specializing in UI Automation and API Testing. Proficient in utilizing **Selenium**, **JUnit**, and **JavaScript**, alongside a rich understanding of **HTML**, **CSS**, and **DOM** for effective test automation solutions. My development background includes frameworks like **React**, **Next.js**, **Node.js**, and programming languages such as **Java**, **C#**, and **Golang**, ensuring comprehensive coverage of both automation and application development. \n \nI have led teams in Agile environments, implementing Test-Driven Development (TDD) practices and quality assurance methodologies that align with compliance standards. Additionally, my strong foundation in cloud services, particularly **AWS** and **Azure**, complements my technical skills, optimizing the testing processes across distributed systems. I also have hands-on experience with version control using **Git** and automated CI/CD pipelines, which enhances the delivery of high-performance solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Automation Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented comprehensive UI Automation strategies to validate and ensure the quality of web applications using **Selenium** and developed automated test scripts in **Java**, **Golang**, and **JavaScript** for efficient testing.\nConducted API Testing to ensure robust functionality and performance, utilizing tools like **Postman** and **JUnit** for effective test management and reporting.\nDeveloped and executed manual and automated test suites, adhering to Agile methodologies for continuous improvement and delivery, while ensuring Quality Assurance across multiple applications.\nCreated reusable automation frameworks using **Test-Driven Development (TDD)** principles, resulting in a 30% reduction in defect rates, ensuring seamless integration with existing CI/CD pipelines.\nManaged source control using **Git**, ensuring version control and collaboration across the development team, aligning with Agile practices for effective project management.\nEnhanced user interface testing with automated scenarios, improving test coverage of DOM manipulation and CSS styling by 40%.\nCollaborated with cross-functional teams to refine testing strategies, rapidly adjusting to shifting priorities and ensuring alignment with project timelines and objectives.\nDeveloped comprehensive documentation and training materials to support the automation process, improving team scalability and knowledge transfer across 5 major projects.\nUtilized insights from industry trends to implement new tools and technologies that advanced automation capabilities, enhancing team productivity by 25%."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Led UI Automation projects ensuring robust quality assurance practices by implementing Test-Driven Development (TDD) methodologies to enhance system integrity and reliability.\nDeveloped API Testing strategies that support integration with microservices, utilizing **JUnit** for Java and **Selenium** for automated testing, achieving over **90%** test coverage on critical endpoints.\nUtilized **Java**, **C#**, **Golang**, and **JavaScript** to develop reusable test scripts and frameworks, improving testing efficiency and execution time by **30%**.\nConducted automated tests across various browsers and platforms to ensure consistent performance and adherence to specifications using **Selenium** integration in CI/CD pipelines with **Git** version control.\nCollaborated in an Agile environment, participating in sprints and retrospectives to continuously enhance the testing process and deliver high-quality software products.\nFostered strong communication between development and testing teams to streamline the integration of testing efforts with ongoing development.\nMaintained and updated test environments, ensuring they align with current production states, directly leading to a **20%** reduction in environment-related issues during deployment.\nManaged documentation of test cases, metrics, and results, contributing to comprehensive quality assurance processes that informed stakeholders of product readiness."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Performed UI Automation testing using **Selenium** to ensure the quality and reliability of web applications, enhancing user satisfaction by **20%**.\nConducted API Testing with **JUnit** to verify the performance and security of backend services, achieving a **95%** success rate in regression tests.\nDeveloped automation scripts in **Golang** and **Java** to streamline testing processes, reducing manual efforts by **30%** and accelerating the deployment pipeline.\nCollaborated in an Agile environment, participating in daily standups and sprint planning to enhance team communication and efficiency.\nImplemented Test-Driven Development (TDD) practices to ensure code quality and reduce bugs, achieving a **40%** decrease in post-deployment issues.\nUtilized version control with **Git** to manage code changes and maintain project integrity ensure a well-documented revision history.\nEnhanced the web application interface utilizing **JavaScript**, **HTML**, **CSS**, and DOM manipulation techniques to create responsive design elements that improved feature usability.\nEmployed frameworks like **JUnit** and **Selenium WebDriver** for robust testing of Java-based applications, resulting in improved coverage across critical functionalities.\nEngaged in continuous quality assurance efforts to maintain high standards in software delivery, directly contributing to a **25%** reduction in production defects."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Java, Golang, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n**API Technologies:**\n\tAPI Testing, JUnit, Selenium\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tGit, Agile, Quality Assurance, Test-Driven Development\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Consensus"
}