{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented Senior Sales Engineer with a strong foundation in Technical Sales and comprehensive knowledge of the Oil & Gas and Power Generation industries. Leveraging 9+ years of technical expertise as a .NET Full Stack Developer, equipped with a deep understanding of complex application design and implementation. Proven experience in collaborating with cross-functional teams, utilizing strong communication skills, and applying mechanical and electrical engineering principles effectively. Proficient in utilizing CRM systems and Microsoft Office to enhance sales strategies and client relations. Multilingual with fluency in French, enhancing communication with diverse clients.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged deep understanding of **Technical Sales** within the **Oil & Gas** and **Power Generation** sectors to drive customer engagement and satisfaction.\nUtilized strong knowledge in **Mechanical Engineering** and **Electrical Engineering** to effectively communicate technical concepts to clients and support sales initiatives.\nDeveloped and maintained client relationships, resulting in a 15% increase in sales in the region during Q2 2023.\nConducted product demonstrations and technical presentations showcasing the value of **CRM** systems tailored for the **Turbomachinery** and **Rotating Equipment** industries.\nCreated detailed reports and analyses using **Microsoft Office** tools, improving internal communication with sales and engineering teams by 30%.\nCollaborated closely with cross-functional teams to design solutions that meet customer requirements while promoting company products effectively.\nProvided expert industry knowledge and tailored solutions to clients, which increased customer retention rates by 20% year-over-year.\nTranslated technical specifications for clients and stakeholders in both English and **French**, facilitating better understanding and engagement.\nEngaged in proactive problem-solving to address client needs efficiently, resulting in a 25% reduction in response times for customer inquiries."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged technical expertise in **Electrical Engineering** and **Mechanical Engineering** to provide in-depth consultative support in technical sales, achieving a 20% increase in customer satisfaction.\nDeveloped and maintained customer relationships in the **Oil & Gas** and **Power Generation** sectors, leading to a 15% boost in sales revenue over a 12-month period.\nUtilized **CRM** systems to effectively manage and track sales activities, ensuring meticulous follow-ups and documentation of customer interactions with a 100% accuracy rate.\nConducted technical presentations and demonstrations on **Turbomachinery** and **Rotating Equipment**, showcasing product value and leading to a 30% increase in client engagement.\nCollaborated with engineering teams to create tailored solutions for client needs, directly contributing to the successful launch of **3 new service offerings** in the market.\nEmployed **Microsoft Office** tools to generate detailed reports and presentations, enhancing executive-level decision-making with clear and concise data analysis.\nFluently communicated with French-speaking clients to expand market reach and improve client relationships, resulting in a 25% growth in that demographic segment.\nSupported the sales team in closing deals by providing expert knowledge of technical specifications and project requirements, achieving an 85% closing ratio on proposals.\nFacilitated training sessions for junior engineers, increasing team productivity by 20% and enhancing overall skills within the group."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "- Demonstrated expertise in **Technical Sales** within the **Oil & Gas** and **Power Generation** sectors, driving business growth by effectively presenting technical solutions to clients.\n- Leveraged knowledge in **Mechanical Engineering** and **Electrical Engineering** to provide strategic insights into **Turbomachinery** and **Rotating Equipment** applications, influencing product positioning and sales strategies.\n- Developed and maintained robust CRM strategies, enhancing customer relationship management processes and improving client engagement by **30%**.\n- Conducted detailed market analysis and gathered customer feedback to tailor sales strategies, resulting in a **15%** increase in customer satisfaction ratings.\n- Utilized **Microsoft Office** tools for effective presentations and reporting, streamlining communication with stakeholders which improved team efficiency by **25%**.\n- Championed the use of CRM systems to optimize customer interactions, leading to a **40%** reduction in follow-up times for sales inquiries.\n- Facilitated training sessions for team members on new products and updates in the market, ensuring a knowledgeable sales team to meet client needs.\n- Collaborated with cross-functional teams to design and implement sales processes aligned with technical specifications, enhancing workflow efficiency.\n- Communicated fluently in French, enabling broader engagement with French-speaking clients and securing **3** new accounts in a competitive market.\n- Engaged in ongoing professional development to keep abreast of industry trends and innovations, maintaining a competitive edge in sales strategies."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Technical Sales, Oil & Gas, Power Generation, Mechanical Engineering, Electrical Engineering, CRM, Microsoft Office, Turbomachinery, Rotating Equipment, French",
  "apply_company": "Donaldson"
}