{
  "name": "Tomasz Lee",
  "role_name": "Security Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Security Engineer with over 9 years of experience in developing secure applications and implementing robust security protocols. Proficient in **AWS**, **JavaScript**, **TypeScript**, **Python**, and **Bash**, with a focus on SAST and SCA for proactive security measures. Extensive knowledge of ISO 27001, ISO 27002, and assessment frameworks including SOC and PCI, ensuring compliance and risk management. Excellent technical documentation skills and strong English communication abilities, coupled with a proven track record of delivering secure and efficient solutions in collaboration with cross-functional teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Security Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **AWS** cloud services for deploying and managing security solutions, ensuring compliance with **ISO 27001** and **ISO 27002** standards.\nDeveloped technical documentation and security plans in **English**, enhancing communication and clarity within the team.\nConducted **SOC** and **PCI assessments**, identifying vulnerabilities and recommending remediation strategies.\nImplemented **SAST** and **SCA** tools to ensure secure code practices, resulting in a **25%** reduction in vulnerabilities.\nCollaborated effectively with cross-functional teams to ensure secure integration of **JavaScript**, **TypeScript**, and **Python** components into existing systems.\nAutomated security assessments using **Bash** scripts, improving operational efficiency by **30%**.\nFacilitated training sessions on security protocols and standards, enhancing team awareness and adherence to compliance requirements.\nAnalyzed security incidents and utilized findings to improve existing security measures, leading to an overall risk reduction of **40%**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Implemented security best practices in cloud environments, utilizing **AWS** services to enhance data protection and compliance with **ISO 27001** and **ISO 27002** standards.\n• Developed secure JavaScript and **TypeScript** applications, conducting SAST (Static Application Security Testing) and SCA (Software Composition Analysis) to identify vulnerabilities, achieving a **20%** reduction in security risks.\n• Automated security assessments for applications and infrastructure using Python scripts and **Bash** to streamline compliance processes for **SOC** and **PCI assessments**.\n• Prepared and maintained comprehensive technical documentation to support security protocols and incident response, enhancing communication among team members.\n• Collaborated effectively with cross-functional teams to define security requirements and project timelines, ensuring adherence to security frameworks.\n• Delivered training sessions on security practices and compliance standards, improving the English communication skills of team members while promoting a culture of security awareness.\n• Conducted regular security audits and assessments, leading to a measurable performance improvement in system security posture by **15%**.\n• Managed security incident responses, leveraging data analytics tools to monitor and report on security incidents accurately, resulting in a **30%** faster incident resolution time.\n• Created custom scripts for monitoring and alerting on security breaches, resulting in proactive detection and response measures to counter threats."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **Bash** to automate security assessments and streamline operational processes in line with ISO 27001, ISO 27002 standards.\nConducted risk assessments and implemented solutions to improve security posture, achieving a 30% reduction in vulnerabilities over **12 months**.\nDeveloped and maintained technical documentation to support compliance with **PCI** and **SOC assessment** requirements, facilitating audits and reviews.\nCollaborated with cross-functional teams to integrate security best practices into development processes using **JavaScript** and **TypeScript**.\nImplemented static application security testing (**SAST**) and software composition analysis (**SCA**) tools to ensure code integrity prior to deployment, covering over **5** major applications.\nEnsured effective English communication in presenting security findings and recommendations to stakeholders.\nParticipated in regular security training sessions to keep abreast of the latest threats and compliance obligations, contributing to a culture of security awareness within the organization.\nLeveraged AWS cloud services to enhance security controls and configurations for applications, improving incident response times by **25%**."
    }
  ],
  "skills": "  **Programming Languages**\n\tJavaScript, TypeScript, Python, Bash\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tAzure, CI/CD pipelines, SAST, SCA\n\n  **Cloud & Infrastructure**\n\tISO 27001, ISO 27002, ISO assessment, SOC assessment, PCI assessment\n\n  **Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis, Technical documentation, English communication, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design"
}