{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-oriented Senior Sales Engineer with 13+ years of expertise in driving sales and account management within the B2B sector. Proven track record in utilizing **CRM** solutions to enhance client relationships and optimize sales processes. Adept in strategic planning and communication, ensuring collaboration across teams to deliver solutions that meet client needs.\nPossessing a strong technical foundation as a Full Stack Developer, with extensive experience in **JavaScript/TypeScript**, **Python**, and **Flutter**. Hands-on proficiency in frontend and backend technologies including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Equipped with experience in **AWS** and **Azure** deployment, microservices, and automating processes using CI/CD pipelines. Understanding of compliance in healthcare and financial sectors, aligning with HIPAA, FHIR, PCI DSS, and SOC 2 standards, enhancing credibility when discussing solutions with clients.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed strategic sales initiatives incorporating deep understanding of **CRM** systems to enhance customer engagement and satisfaction levels, leading to a **25%** increase in account retention rates.\nLeveraged **MS Office** tools to create compelling presentations and reports to outline new business opportunities, effectively communicating value propositions to stakeholders in **B2B** transactions.\nManaged client accounts with a focus on relationship building, ensuring proactive communication and addressing client needs in a timely manner, resulting in a **30%** improvement in customer feedback scores.\nImplemented condition monitoring strategies within the sales process, showcasing the benefits of **Plant Asset Management** solutions to prospects, leading to a **15%** boost in conversion rates.\nCollaborated with cross-functional teams to develop tailored solutions that align with client objectives, utilizing strong **communication** skills to facilitate stakeholder alignment and collaboration.\nEngineered strategic planning sessions to identify new market opportunities, resulting in the successful introduction of service offerings that contributed to **$2M** in additional revenue over **12 months**.\nEnhanced customer management processes by leveraging data analytics to identify trends and optimize account strategies, ensuring alignment with client goals and expectations.\nDelivered training and knowledge sharing sessions for internal teams on effective sales strategies and customer relations, fostering an environment of continuous improvement and strategic collaboration.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and maintained robust **CRM** systems to enhance **Account Management** capabilities, improving client relationships and increasing sales revenue by **20%**.\n- Leveraged **Sales** experience to create and implement strategic sales plans resulting in a **15%** growth in B2B partnerships.\n- Strengthened **communication** skills through collaboration across departments, ensuring alignment in **Sales** strategies and **Condition Monitoring** efforts.\n- Conducted thorough **strategic planning** sessions to identify key sales opportunities within **Plant Asset Management**, resulting in enhanced customer satisfaction and retention rates.\n- Utilized **MS Office** to prepare detailed sales reports and presentations, facilitating effective communication with stakeholders and clients.\n- Fostered strong collaboration with customers and internal teams to deliver tailored solutions in **B2B** environments, driving successful project outcomes.\n- Designed training materials and workshops focused on **Sales** techniques and **CRM** usage, enhancing the team's proficiency and effectiveness.\n- Actively monitored market trends and competitor activities, adapting sales strategies accordingly to stay ahead in the **B2B** segment, achieving a market share increase of **10%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Managed B2B sales processes and account management for high-value clients, ensuring customer satisfaction and retention through effective communication and personalized service strategies.\nDeveloped strategic plans by analyzing customer needs and market trends, leading to a **30%** increase in sales revenue year-over-year.\nUtilized CRM tools effectively to track leads, manage customer interactions, and streamline workflows, significantly improving collaboration among team members and reducing response times by **25%**.\nConducted condition monitoring and assessments of plant asset management solutions, facilitating the development of tailored presentations and proposals for prospective clients, showcasing efficiency and ROI.\nPresented technical product demonstrations and effective solutions, tailoring approaches based on client feedback to meet specific requirements, yielding a **15%** increase in conversion rates.\nDeveloped comprehensive MS Office reports and analytics, providing insights into sales performance and helping shape strategic decision-making processes.\nEngaged in continuous improvement through collaboration with cross-functional teams to enhance product offerings and address client pain points, further solidifying relationships and trust.\nFostered a customer-centric culture within the team by promoting principles of effective communication and strategic planning during client engagements."
    }
  ],
  "skills": "**Sales & Management**\n\tSales, Account Management, B2B, CRM, Condition Monitoring, Plant Asset Management, MS Office, Communication, Strategic Planning, Collaboration\n\n**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**\n\tNginx, Let’s Encrypt, Certbot\n\n**Other**\n\tMLflow, Airflow, Kubeflow",
  "apply_company": "Emerson"
}