{
  "name": "Rei Taro",
  "role_name": "Senior Backend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Backend Engineer with over 10 years of experience in building and scaling backend systems, focusing on Java and **Spring Boot** for high-performance API development. Proven expertise in developing REST and GraphQL APIs, and leveraging **GCP** services such as **Cloud Run** and **PubSub**. Extensive background in database management with **MySQL** and **NoSQL** solutions, and proficient in using **Kafka** for messaging. Skilled in version control using **Git** and **GitLab**, and experienced in Agile methodologies to enhance project delivery. Demonstrated success in delivering innovative solutions at top-tier companies, including VISA, Sii Poland, and Reply Polska, while effectively collaborating in fast-paced environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered robust backend services utilizing **Java** and **Spring Boot** to optimize document automation, user onboarding, and reporting workflows.\nDeveloped and implemented RESTful APIs and GraphQL interfaces to enhance system integration and user experience, managing over **1000** API calls daily.\nDesigned event-driven architectures using **Kafka** and **GCP PubSub** for managing asynchronous processing of financial transactions, enabling real-time data handling with a throughput of **200** messages per second.\nDeployed microservices on **GCP Cloud Run** with infrastructure managed through **Git** and **GitLab** repositories, ensuring reliable and efficient cloud operations.\nCreated and maintained data pipelines for regulatory compliance using **MySQL** and **NoSQL** databases, guaranteeing data accuracy within a **99.9%** uptime.\nLed security assessments and integrated secure authentication systems utilizing **OAuth2**, promoting a scalable access control architecture for over **5000** users.\nCollaborated with cross-functional teams in accordance with **Agile** methodologies to resolve system integration challenges and oversee deployment strategies in alignment with compliance requirements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Engineered robust APIs using **Java** and **Spring Boot** to facilitate seamless communication between microservices and frontend components, ensuring scalability in system design.\nDeveloped RESTful and GraphQL services for efficient data retrieval and manipulation, optimizing user experience for over **10,000** daily active users.\nUtilized **GCP** services like **Cloud Run** and **PubSub** for deploying applications in a serverless environment, reducing operational costs by **30%** and improving deployment speed by **40%**.\nImplemented CI/CD pipelines using **Git** and **GitLab** for smoother code integration and version control, enhancing team productivity by **25%**.\nDesigned, developed, and maintained databases using **MySQL** and **NoSQL** solutions, ensuring data consistency and reliability across the application with **99.9%** uptime.\nContributed to Agile methodologies by actively participating in sprint planning and retrospectives, resulting in a **50%** decrease in project cycle time.\nLeveraged **Kafka** for real-time data processing and integration of external systems, effectively handling millions of transactions per day."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed robust API endpoints using **Spring Boot** and **REST** frameworks for seamless communication between backend and frontend teams, improving response times by up to **30%**.\n• Implemented data management solutions using **MySQL** and **NoSQL** databases to efficiently handle datasets exceeding **1M** records while ensuring data integrity and performance.\n• Integrated **GCP** services such as **Cloud Run** and **PubSub** for scalable cloud solutions and real-time data processing, reducing latency in high-volume trade transactions by **25%**.\n• Collaborated with cross-functional teams in an **Agile** environment to deliver features iteratively, ensuring timely project completions with an **80%** sprint success rate.\n• Utilized version control systems like **Git** and **Gitlab** to manage codebase effectively, enabling streamlined collaboration and deployment processes.\n• Ensured adherence to best practices in security and regulatory compliance, reducing vulnerabilities and aligning with standards like GDPR and MiFID II.\n• Engineered event-driven architectures using **Kafka** for processing high-frequency transactions, ensuring system reliability and scalability under load.\n• Conducted thorough unit and integration testing using tools such as **PyTest** to maintain code quality and performance, achieving a test coverage of over **90%**."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tSpring Boot, FastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, REST, GraphQL, API\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), GCP, Cloud Run\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, NoSQL\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Gitlab, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure, GCP\n\n**Other**\n\tMicroservices, Kafka, Agile, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git",
  "apply_company": "Pathway Solutions GmbH"
}