{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Mechanical Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Mechanical Engineer with 13+ years of experience in mechanical engineering and product development. Proficient in **3D CAD** tools like **CATIA**, **Siemens NX**, **SolidWorks**, and **Creo** for creating detailed designs and simulations. Expertise in **PLM** systems including **3DExperience**, **Enovia**, **Teamcenter**, and **Windchill** to enhance project management and collaboration.\nSkilled in performing **FEA** and **CFD** analyses to support product optimization and validate designs. Experienced in **additive manufacturing** and **rapid prototyping** techniques, ensuring efficient and innovative design solutions. Strong focus on **GD&T**, **design for manufacture**, and **design for assembly** practices to effectively meet performance standards while maintaining manufacturability.\nKnown for exceptional **problem-solving**, **communication**, and **time management** skills, successfully leading cross-functional teams to deliver high-quality engineering projects on schedule.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Mechanical Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **3D CAD** software such as **CATIA** and **SolidWorks** to design and model complex mechanical components, ensuring adherence to design standards and specifications, achieving dimensional accuracy of up to **0.01 mm** in prototypes.\nExecuted engineering documentation and reporting that enhanced project transparency, receiving feedback scores of **95%** from stakeholders for clarity and effectiveness.\nConducted **FEA** analyses using **Siemens NX** to predict performance under various loading conditions, contributing to product durability assessments and reducing failure rates by **30%**.\nCoordinated with cross-functional teams to develop **PLC** systems and **3DExperience** environments, enhancing collaboration and integration across the design and manufacturing processes.\nImplemented **additive manufacturing** techniques to produce prototype parts in under **3 days**, significantly reducing time to market for new designs.\nEmployed **GD&T** methodologies to ensure effective tolerance stack-ups, leading to a **20%** reduction in assembly issues and improved manufacturability of components.\nServed as a key member in testing and prototyping activities, utilizing **Creo** for advanced simulations that validated design functionality prior to mass production.\nManaged multiple projects simultaneously, employing robust **time management** strategies to meet deadlines consistently, achieving a **100%** on-time project completion rate.\nFacilitated rapid prototyping initiatives, allowing for iterative design improvements based on real-world feedback, resulting in a **15%** faster design cycle.\nEngaged in continuous **problem-solving** efforts, collaborating effectively with teams to innovate solutions that drive product advancements while maintaining communication across diverse departments.\nReviewed and improved existing designs for manufacturability, significantly reducing production costs and enhancing assembly processes through detailed **design for assembly** techniques.\nLed internal training sessions to enhance team skills in **Teamcenter** and **Windchill**, boosting productivity by sharing best practices for PLM systems."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **3D CAD** software including **CATIA** and **Siemens NX** to create detailed mechanical designs and models, ensuring precision and adherence to project specifications.\nDeveloped prototypes and conducted testing using **SolidWorks** and **Creo** to validate design concepts and improve functionality, reducing development time by **15%**.\nImplemented **PLM** solutions such as **Teamcenter** and **Windchill** to streamline design workflows and enhance collaboration across engineering teams, improving project turnaround time by **20%**.\nApplied **FEA** and **CFD** simulations to evaluate and optimize performance characteristics of designs, resulting in improved stress and thermal analysis outcomes by **25%**.\nExecuted tolerance stack-up analysis and GD&T practices to guarantee manufacturability and assembly integrity, ultimately enhancing product reliability.\nManaged documentation and compliance for mechanical engineering projects, ensuring clarity and effective communication with cross-functional teams.\nOptimized processes for additive manufacturing and rapid prototyping to streamline product development and reduce costs by **30%**.\nDemonstrated strong problem-solving skills to address design challenges and enhance product performance through iterative testing and feedback, meeting project deadlines consistently."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied advanced problem-solving skills to develop and optimize mechanical designs using **3D CAD** tools such as **CATIA**, **Siemens NX**, and **SolidWorks** to create innovative solutions for complex engineering challenges.\nUtilized **Creo** and **3DExperience** platforms to create precise models and perform thorough **FEA** and **CFD** analyses, resulting in a reduction of design errors by **25%** and improved product performance metrics by **15%**.\nImplemented **PLM** systems including **Enovia** and **Teamcenter** to streamline project workflows and enhance collaboration across departments, reducing project turnaround times by an average of **20%**.\nConducted rigorous testing and prototyping phases with **additive manufacturing** techniques, achieving a **30%** reduction in material costs and a project delivery time improvement of **10%**.\nEmployed **GD&T** principles to ensure designs met strict tolerance requirements, thereby improving manufacturability and reducing assembly times by **15%**.\nManaged effective documentation processes and maintained comprehensive records of designs and modifications, enhancing project tracking and accountability.\nDemonstrated time management skills by organizing and prioritizing project tasks, leading to successful project completions under tight deadlines by **20%**.\nFacilitated clear communication within cross-functional teams to ensure aligned goals and efficient problem resolution, resulting in higher team productivity scores.\nDrove continuous improvement initiatives through detailed **tolerance stack-up** analysis and **design for assembly** strategies, contributing to overall product reliability and manufacturability."
    }
  ],
  "skills": " **Other**\n\tmechanical engineering, 3D CAD, CATIA, Siemens NX, SolidWorks, Creo, PLM, 3DExperience, Enovia, Teamcenter, Windchill, FEA, CFD, additive manufacturing, rapid prototyping, GD&T, design for manufacture, design for assembly, tolerance stack-up, prototyping, testing, documentation, communication, problem-solving, time management\n\n**Programming Languages**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions**\n\tAWS: Lambda, Azure: App Services\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose, MLflow, Airflow, Kubeflow\n",
  "apply_company": "Lumina"
}