{
  "name": "Mariusz Jan Skobel",
  "role_name": "Manual Tester / Support Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-118083397/",
  "profile_summary": "Detail-oriented Manual Tester / Support Engineer with 10+ years of expertise in software solutions, specializing in **SQL**, **MySQL**, **AWS**, and **Azure**. Proficient in executing manual testing strategies and proficiently tracking bugs using tools like **JIRA** and **GitHub Issues**. Adept at communicating complex technical issues clearly while collaborating with cross-functional teams to ensure high-quality deliverables. Strong problem-solving skills with a demonstrated ability to analyze and resolve issues efficiently. Experienced in the full development lifecycle, with familiarity in front-end frameworks such as **Vue.js**. Brings a wealth of knowledge from a solid background in full stack development, including technologies like **JavaScript/TypeScript**, **Python**, **React**, **Next.js**, **Node.js**, and **Django**, combined with a commitment to quality assurance and compliance standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Manual Tester / Support Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tConducted manual testing procedures across various applications to ensure compliance with regulatory standards like HIPAA, FHIR, and SOX while utilizing **JIRA** and **GitHub Issues** for efficient bug tracking and communication.\n•\tExecuted rigorous SQL queries to validate data integrity in **MySQL** and **PostgreSQL**, performing comprehensive data verification against expected outcomes in healthcare and finance systems.\n•\tCollaborated with development teams to identify and document bugs, enhancing problem-solving methodologies, and contributing to the improvement of application functionality.\n•\tParticipated in the design and implementation of **Azure** and **AWS** based solutions, ensuring robust backend performance and facilitating smooth user experiences in web applications built using **Vue.js**.\n•\tDeveloped test cases and executed functional and regression testing on applications built using technologies like **React** and **Node.js**, ensuring reliability and performance.\n•\tEngaged in communication with stakeholders to gather requirements and provide updates on testing progress, contributing to overall project transparency.\n•\tAnalyzed and reported testing results, utilizing metrics to track quality assurance progress and enhance future testing strategies over **3+ major releases** per quarter.\n•\tLeveraged professional problem-solving skills to troubleshoot issues effectively, minimizing project delays and enhancing software delivery times with an average reduction of **20%** across teams.\n•\tFacilitated cross-functional training sessions for team members on testing methodologies, fostering a culture of quality awareness across **5 teams** within the organization."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Conducted **manual testing** of financial applications to ensure seamless functionality, resulting in a **30% reduction** in post-deployment defects.\nUtilized **bug tracking** tools such as **JIRA** and **GitHub Issues** to document and track issues, enhancing communication between development and QA teams.\nExecuted SQL queries in **MySQL** databases to validate data integrity and accuracy, supporting decision-making processes with reliable information.\nCollaborated effectively within cross-functional teams, leveraging **problem-solving** skills to address and resolve technical issues promptly, ensuring project deadlines were met with a **95% success rate**.\nEngaged in thorough regression testing post-deployment, providing valuable feedback to improve product quality and user experience.\nEnhanced application performance by suggesting optimizations based on testing outcomes and user feedback, contributing to a **20% increase** in application efficiency.\nParticipated in daily stand-ups and sprint planning to align testing strategies with project objectives, demonstrating solid **communication** skills and contributing to team success.\nAssisted in automating **manual testing** processes using **Vue.js** and integrated testing frameworks, improving test coverage and reducing testing time by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Conducted **manual testing** to ensure the quality and functionality of applications, utilizing **JIRA** for efficient **bug tracking** and reporting enhancements to streamline workflows.\nCollaborated with development teams using **GitHub Issues** for issue management and communication, effectively advocating for user requirements and ensuring clarity in specifications.\nUtilized **SQL** and **MySQL** for database querying during testing phases to validate data integrity and optimize performance, resulting in a **30%** improvement in query response times.\nDeveloped detailed test plans and cases based on product specifications, enhancing problem-solving approaches that led to a **25%** reduction in high-priority bugs post-release.\nParticipated in daily stand-ups and retrospective meetings, fostering strong **communication** within the team to promote transparency and facilitate continuous improvement in testing methodologies.\nAssisted in troubleshooting production issues, demonstrating resilience and analytical skills by swiftly identifying and resolving **critical bugs**, significantly improving end-user satisfaction scores by **15%**.\nEngaged with cloud platforms such as **AWS** and **Azure** to test system integrations, contributing to the robustness and scalability of cloud-based applications.\nProvided support for ongoing testing efforts during Agile sprints, advocating user needs to enhance the overall product experience and ensure timely delivery against project milestones."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tmanual testing, bug tracking, problem-solving, communication, JIRA, GitHub Issues, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}