{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Node.js Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Experienced Senior Node.js Engineer with 8 years of full-stack development expertise, specializing in **Node.js**, **React**, and **CI/CD** automation. I possess robust skills in building scalable applications, employing modern tools and frameworks such as **Docker**, alongside a strong emphasis on infrastructure-as-code best practices to ensure efficient deployment and management. My experience in implementing **OAuth2**, **SAML**, and **SSO** enhances my capability in developing secure and compliant applications. \n\nProficient in RESTful services, I have successfully led projects in the healthcare and financial sectors, ensuring adherence to compliance standards including HIPAA and PCI DSS. I couple this with my strong background in **debugging** and **documentation**, facilitating effective communication within development teams. With hands-on experience in integrating microservices architecture and event-driven systems, I focus on building high-performance solutions that leverage my comprehensive technical stack, including **FastAPI** and **Django**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Node.js Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained scalable applications using **Node.js** and modern frameworks like **React** for web solutions, ensuring optimal performance and user experience.\n- Implemented CI/CD pipelines to streamline deployment processes, utilizing tools like Docker for containerization and automation, ensuring high-quality delivery.\n- Developed secure and robust API services using **REST** architecture, adhering to security protocols including **OAuth2** and **SAML** for authentication and authorization.\n- Led infrastructure-as-code initiatives to facilitate efficient environment setup and management, enhancing team collaboration and reducing deployment time by **30%**.\n- Participated actively in debugging processes to resolve technical issues efficiently, improving application reliability and performance metrics by **20%**.\n- Collaborated on documentation practices for project specifications and technical guidelines, enhancing communication across development teams.\n- Fostered strong communication with cross-functional teams to ensure alignment on project objectives and delivery schedules.\n- Provided mentorship to junior engineers in best practices for software development, enhancing team skill set and knowledge sharing.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained applications utilizing **Node.js** to support high-performance financial systems, ensuring seamless integration with infrastructure-as-code practices for efficient deployment.\n• Implemented CI/CD strategies to enhance deployment frequency and reliability, utilizing tools such as **Docker** to streamline build and release processes.\n• Integrated RESTful APIs within the financial platforms, leveraging **OAuth2** for secure authorization and **SAML** for robust Single Sign-On (SSO) capabilities to enhance user authentication.\n• Led the front-end development using **React (18)** and **TypeScript**, ensuring dynamic and responsive user interfaces for financial dashboards utilizing modern libraries such as Redux Toolkit and Tailwind CSS.\n• Built backend services in **Golang**, ensuring scalability and performance in handling high-volume transactions.\n• Developed comprehensive documentation for all features and systems, fostering clear communication among cross-functional teams to maintain alignment on project goals and debugging practices.\n• Enhanced system reliability through effective debugging and performance tuning, achieving a **30%** reduction in load times for application features.\n• Led a team that implemented an advanced microservices-based system architecture, resulting in a **25%** increase in system throughput for processing financial transactions, ensuring scalability and maintainability.\n• Communicated technical concepts to non-technical stakeholders, facilitating a better understanding of project requirements and deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Node.js** to develop and maintain high-performance backend services for a global e-commerce platform, ensuring a seamless experience across critical modules like checkout and order fulfillment.\nImplemented robust **REST**ful APIs for efficient data interaction and integrated **OAuth2** and **SAML** for secure user authentication and authorization.\nDesigned and deployed applications in **Docker** containers, streamlining CI/CD processes and enhancing the scalability of the application architecture.\nEngineered real-time functionalities leveraging **WebSockets** and a message-driven approach using **Kafka**, facilitating immediate order updates and enhancing user engagement.\nLed debugging efforts and optimized existing codebases, achieving a **30%** performance improvement in response times across various web services.\nDeveloped frontend interfaces using **React** (18) alongside efficient state management with Redux Toolkit, ensuring fast, responsive user experiences on both web and mobile platforms.\nCollaborated with cross-functional teams, fostering effective communication to document and share infrastructure-as-code practices, improving overall project visibility and alignment.\nApplied **role-based access control (RBAC)** and **SSO** methods, ensuring strict compliance with GDPR regulations and safeguarding user data access throughout the e-commerce platform.\nImplemented automated testing and quality assurance measures, contributing to a **15%** decrease in runtime errors and improving user satisfaction metrics.\nMaintained clear and concise documentation, streamlining onboarding processes for new team members and enhancing knowledge sharing within the development team."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript/TypeScript, Golang\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django, Node.js\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tREST, OAuth2, SAML, SSO\n\n **Serverless and Cloud Functions:** \n\tAWS (Lambda), Azure\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Infrastructure as Code, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, Let’s Encrypt, Nginx, Certbot, debugging, documentation, communication",
  "apply_company": "Bonapolia"
}