{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior NET Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior .NET Engineer with 8 years of experience in building high-performance applications within the healthcare and financial sectors. Proficient in **.NET**, **C#**, and **Microsoft Azure SQL Database**, enhancing operational efficiency through modern development practices. Skilled in **ReactJS** for crafting dynamic user interfaces and **Docker** & **K8s** for streamlined container orchestration and deployment. Adept in utilizing **Azure AI services** to integrate intelligent capabilities into applications. My expertise in **TypeScript** and SCRUM underpins my ability to maintain high-quality standards and ensure customer satisfaction. I have a strong foundation in developing enterprise-grade solutions that prioritize compliance with industry standards and foster excellent customer engagement. My original strengths include a proficient command of communicative English and Polish, as well as a collaborative approach to project management.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior NET Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained scalable applications using **.NET** and **C#**, ensuring high-quality standards and performance across all projects.\n- Leveraged **Microsoft Azure SQL Database** for data storage synchronization, effectively managing data flow for real-time application usage.\n- Utilized **Docker** and **Kubernetes (K8s)** for containerization, enabling streamlined deployment processes and enhancing system reliability in cloud-based environments.\n- Collaborated closely with cross-functional teams using **SCRUM** methodologies, emphasizing customer focus and quality throughout the project lifecycle.\n- Built user interfaces with **ReactJS** and optimized performance through modern best practices, ensuring great user experiences across web applications.\n- Developed advanced search functionalities using **Apache SOLR**, improving search efficiency across vast datasets.\n- Engaged effectively in both English and Polish to facilitate clear communication within multicultural teams and with stakeholders.\n- Employed Azure AI services to enhance application features, implementing AI-driven analytics to provide insightful data interpretation.\n- Implemented CI/CD pipelines using Azure DevOps and GitHub Actions to maintain consistent deployment practices across **10**+ environments.\n- Established comprehensive testing strategies utilizing tools like Jest, PyTest, and Cypress, with over **95%** code coverage ensuring robustness in both **front-end** and **back-end** services."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **.NET** and **C#** to lead the development and modernization of financial platforms, employing microservices architecture for enhanced scalability and maintainability across high-volume transaction systems.\nImplemented high-quality backend services using **Microsoft Azure SQL Database** and various Azure services to ensure robust data management and applications performance for financial operations.\nBuilt dynamic user-focused front-end applications with **React (18)** and **TypeScript**, leveraging state management with Redux Toolkit and responsive design through Tailwind CSS for optimized user interfaces in financial dashboards.\nFocused on delivering exceptional customer experiences while spearheading multi-functional teams through **SCRUM** methodologies to efficiently meet project timelines and functional requirements.\nDesigned and developed real-time transaction monitoring dashboards using **D3.js** and **Power BI Embedded**, facilitating data-driven decision-making and anomaly detection.\nIntegrated robust messaging systems using **Kafka** and **RabbitMQ** to establish an efficient event-driven architecture, vital for real-time transaction monitoring and compliance workflows.\nBuilt and orchestrated ETL pipelines utilizing **Python** and **Apache Airflow**, enabling batch and real-time data ingestion with sources yielding over **10 million** transactions weekly.\nCultivated quality focus through systematic testing and code reviews, ensuring deliverables meet the highest standards in line with industry best practices.\nDeveloped AI/ML applications for fraud detection employing **scikit-learn** and **XGBoost**, analyzing patterns in **over 100,000** banking transactions monthly to proactively identify potential fraud.\nImplemented ML pipelines for credit scoring and churn prediction seamlessly integrating with backend services for immediate operational responsiveness using **MLflow** and Airflow."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed backend services and applications using **.NET** and **C#**, focusing on high availability and scalability to support key e-commerce functionalities such as checkout and order management.\nUtilized **Microsoft Azure SQL Database** to enhance data handling and storage solutions, ensuring fast and reliable access to critical application data for over **100** concurrent users.\nEngineered cloud solutions leveraging **Azure** services for enhanced performance and deployment, leading to a **30%** reduction in infrastructure costs.\nImplemented **Docker** and **Kubernetes (K8s)** for containerization and orchestration of applications, improving deployment times by **50%** and facilitating seamless integration between services.\nIntegrated cutting-edge **ReactJS** to build dynamic and responsive frontend applications, ensuring optimal user experience across multiple devices and achieving a **20%** increase in customer engagement.\nEmployed **Azure AI services** for advanced analytics and personalization features, driving a **15%** increase in conversion rates through tailored user experiences.\nEngaged in **SCRUM** methodologies to foster collaboration and enhance project delivery, achieving project timelines consistently within **10%** of deadline goals.\nMaintained a strong customer focus throughout the development lifecycle, ensuring solutions aligned with user needs and expectations, which contributed to a significant boost in overall satisfaction ratings.\nEngaged in rigorous quality focus initiatives, implementing best practices that led to a **40%** reduction in post-deployment defects through continuous testing and feedback loops.\nCommunicated effectively in both **English** and **Polish**, ensuring clear understanding and collaboration amongst diverse team members and stakeholders."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, TypeScript, Python, JavaScript\n\n**Frontend Frameworks:**\n\tReact, ReactJS, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Azure AI services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), Microsoft Azure SQL Database, MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes (K8s), GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure, Nginx, Certbot\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, SCRUM, Customer focus, Quality focus, Communicative English, Communicative Polish",
  "apply_company": "ABB"
}