{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with over 13 years of experience in developing responsive and high-performance web applications specializing in **Angular**, **JavaScript**, **HTML5**, and **CSS3**. Expert in building RESTful APIs and implementing CI/CD processes to enhance development efficiency. Demonstrated success in performance optimization and creating intuitive web architectures, ensuring seamless user experiences. Proven ability to mentor junior developers and foster collaboration within team settings.\nSkilled in backend technologies such as **Node.js**, as well as familiar with **React** and **Vue** frameworks, allowing for a comprehensive understanding of full stack development. Adept at delivering innovative solutions in compliance-driven environments, with knowledge of HIPAA and PCI DSS standards. Strong background in deploying cloud-native systems on **AWS** and **Azure**, with hands-on experience in microservices and event-driven architectures.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed responsive web applications using **Angular**, **JavaScript**, **HTML5**, and **CSS3**, ensuring high performance and optimal user experience through performance optimization strategies.\n• Implemented RESTful APIs for seamless communication between frontend interfaces and backend services, enhancing application functionality and user satisfaction.\n• Collaborated within a cross-functional team to design web architecture that meets user needs and business requirements, facilitating the rapid implementation of new features.\n• Mentored junior developers, guiding them in utilizing **Git** for version control and best practices to ensure code quality across projects.\n• Established CI/CD pipelines using tools such as **GitHub Actions** and **CircleCI**, resulting in a 70% increase in deployment speed and a significant reduction in manual errors.\n• Conducted regular code reviews, promoting collaboration and enhancing code maintainability, as well as ensuring compliance with established coding standards.\n• Led initiatives in performance optimization, resulting in a **30%** improvement in page load times by utilizing best practices in responsive design and scalable frontend solutions.\n• Analyzed user feedback and analytics data to iterate on product features, achieving a **40%** increase in customer satisfaction ratings post-deployment.\n• Integrated state management using **NgRx** for efficient handling of application state, enabling smoother user interactions and application scalability.\n• Championed testing strategies across the frontend, implementing unit and integration tests with frameworks such as **Jest** and **Cypress**, ensuring a robust and reliable codebase."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Collaborated with cross-functional teams to design and optimize web architecture, ensuring responsive design and performance optimization across **8+** financial applications.\n• Utilized **Angular** and **JavaScript** to build interactive, user-friendly interfaces in alignment with **HTML5** and **CSS3** standards, enhancing user experience for **5000+** daily users.\n• Developed and implemented RESTful APIs to facilitate seamless data communication between the frontend and backend, contributing to the agile deployment of features in a **CI/CD** environment.\n• Mentored junior developers on best practices in modern web development, fostering a collaborative team culture and improving overall project delivery timelines by **20%**.\n• Streamlined front-end performance by employing **NgRx** for state management, achieving a **30%** reduction in load times across key financial services applications.\n• Engaged in code reviews and collaborative troubleshooting sessions, enhancing team productivity and ensuring adherence to industry coding standards using **Git** for version control.\n• Championed the adoption of responsive design principles, ensuring compatibility across various devices and platforms in compliance with industry standards.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized responsive web applications using **Angular** (latest version), **JavaScript**, **HTML5**, and **CSS3**, ensuring adherence to design principles and performance optimization for high-traffic environments.\nImplemented and maintained **RESTful APIs** for seamless communication between frontend and backend services, enhancing overall application responsiveness and user experience.\nUtilized **Git** for version control in collaborative environments, fostering efficient code management and team collaboration.\nDesigned and executed CI/CD pipelines for automated deployment processes, improving release cycles and product updates by **30%**.\nMentored junior developers, facilitating knowledge sharing in modern **web architecture** concepts and best coding practices.\nCollaborated with cross-functional teams to gather requirements, translating business needs into technical specifications and fostering a cooperative work environment.\nEnhanced applications' performance with strategic optimizations, resulting in page load times reduced by **25%**.\nApplied **NgRx** for state management in Angular applications, increasing application reliability and making it easy to manage complex states.\nConducted reviews of code and designs to ensure high-quality deliverables and compliance with the **WCAG 2.1** standards for accessibility.\nCreated engaging and SEO-friendly user interfaces, driving higher user engagement and retention rates, while following industry best practices in **responsive design**."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, Python\n\n **Frontend Frameworks:**\n\tAngular, JavaScript/TypeScript: React, Vue\n\tHTML5, CSS3\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tRESTful APIs\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n **Other:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n\tNgRx, performance optimization, responsive design, web architecture, mentoring, collaboration",
  "apply_company": "EPAM Systems"
}