{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a skilled Senior Fullstack Engineer with 8 years of experience, I bring a robust technical expertise in **Node.js**, **VueJS**, **JavaScript**, and **TypeScript**, complemented by a solid knowledge of **CSS**, **HTML**, and modern tooling practices using **Git**, **Webpack**, and **npm**. I have successfully developed high-performance and scalable solutions in the healthcare and financial sectors, integrating AI capabilities for enhanced functionality. \nMy proficiency in full-stack development is backed by my experience with both front-end and back-end frameworks, allowing me to create seamless and responsive user experiences. Additionally, I am adept at using testing frameworks such as **Mocha** and **Jest** to ensure quality and reliability in my applications. \nWith a proven track record of leading enterprise-grade projects, I excel in employing microservices architecture, event-driven systems, and CI/CD practices to deliver secure and compliant applications aligned with standards like HIPAA, FHIR, and PCI DSS. My ongoing commitment to innovation is evidenced by hands-on experience with AI/ML integration, developing machine learning pipelines, and implementing MLOps workflows.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed dynamic and responsive web applications leveraging **Node.js**, **TypeScript**, **VueJS**, and modern front-end technologies while maintaining high coding standards and consistent user experience.\nApplied **AI** techniques to enhance user interactions and site functionality, resulting in a 30% increase in user engagement metrics.\nImplemented RESTful APIs and microservices architecture using **Node.js**, ensuring optimal performance and scalability for applications serving over **50,000** active users.\nUtilized agile methodologies alongside **Git** for version control and **Webpack** for module bundling, ensuring efficient code deployment and collaboration across teams.\nEnforced responsive web design principles using **CSS**, **HTML**, and pre-processors like **SASS**, achieving a visually appealing interface compatible with various devices and platforms.\nConducted rigorous unit testing and integration testing utilizing **Jest** and **Mocha**, ensuring system reliability and maintaining a 95% test coverage ratio.\nCollaborated in cross-functional teams to develop MVP applications, focusing on the integration of **JavaScript**, enhancing functionality across various platforms.\nStreamlined front-end asset management and optimization using **npm** and **PostCSS**, leading to a **25%** reduction in load times.\nEnsured adherence to best practices in code quality and security throughout the software development lifecycle, contributing to applications that meet compliance for industry standards.\nParticipated in code reviews and mentorship for junior developers, fostering a culture of continuous improvement and knowledge sharing within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and modernized financial platforms leveraging **Node.js** (NestJS/Express) and **Python** (FastAPI/Django) in a microservices architecture to enhance scalability and maintainability, achieving a throughput increase of **30%** in high-volume transaction systems.\n• Created dynamic, user-centric front-end applications employing **React** (**18**), **Vue.js** (**3**), **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** to ensure responsive and efficient user interfaces, leading to a **20%** reduction in user drop-off rates.\n• Constructed real-time transaction monitoring and analytics dashboards utilizing **React**, **D3.js**, and **Power BI Embedded** to allow operations teams to track financial activities, detect anomalies, and generate actionable insights, improving decision-making speed by **35%**.\n• Integrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to create a robust, event-driven architecture that supports asynchronous communication and real-time event processing for transactional alerts and compliance workflows, enhancing system responsiveness by **40%**.\n• Built and orchestrated ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory** to facilitate batch and real-time ingestion of financial data from internal and third-party sources, reducing data processing time by **25%**.\n• Implemented AI/ML-powered fraud detection systems utilizing **scikit-learn**, **XGBoost**, and **Azure Machine Learning** to analyze transaction patterns and user behavior, effectively flagging suspicious activities with a **98%** detection accuracy.\n• Developed ML pipelines for credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, integrating model inference directly into backend services for real-time decision-making, achieving an operational efficiency enhancement of **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Node.js** with frameworks like **Express** and frontend technologies such as **VueJS** to create robust and scalable web applications, enhancing user engagement and application performance.\nImplemented intuitive interfaces using **HTML5**, **CSS**, and **JavaScript**, ensuring all designs adhere to modern best practices and are SEO-friendly.\nIntegrated and optimized state management with **TypeScript** and **Redux Toolkit**, delivering high-quality, maintainable code across all projects.\nConducted unit and integration testing using **Mocha** and **Jest** to maintain code reliability and performance, with a target coverage of at least **90%**.\nStreamlined development workflows with **Git**, **Webpack**, and **npm**, reducing build times by **30%** and improving overall project delivery timelines.\nDeveloped responsive applications for both desktop and mobile users, using techniques compliant with **WCAG 2.1** for enhanced accessibility.\nCollaborated with cross-functional teams to enhance features tailored for AI-driven solutions that optimize user interactions and improve product recommendations.\nParticipated in code reviews and mentoring junior developers, fostering a culture of continuous learning and improvement, significantly increasing team productivity by **25%**.\nMaintained documentation of project specifications and technical architecture, contributing to a knowledge base that has improved new team member onboarding time by **40%**."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript, PHP\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, VueJS, CSS, HTML, SASS, PostCSS, Webpack, npm\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Nginx, Certbot, Mocha, Jest, Git",
  "apply_company": "Skipso"
}