{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-118083397/",
  "profile_summary": "Accomplished Senior Software Engineer with 10+ years of experience in **TypeScript**, **JavaScript**, and **React**, dedicated to delivering scalable and high-performance solutions. Expertise in **cloud-native development**, specifically proficient in **microservices** architecture, leveraging **.NET (C#)**, **containers**, and **CI/CD pipelines** for efficient software delivery. Demonstrated ability in applying **design patterns** and scalability principles to enhance system architecture and performance optimization.\nBrings hands-on experience in **distributed systems** and a strong commitment to building developer tools that facilitate collaboration and continuous learning. Proven track record in leading projects across healthcare and finance sectors, ensuring compliance with industry standards while embedding intelligent decision-making capabilities through AI/ML integration. Eager to contribute to innovative solutions that create significant real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions as a Senior Software Engineer using **TypeScript**, **JavaScript**, and **React** (17–18) while ensuring adherence to scalability principles and software architecture best practices.\n• Led the transformation of applications to microservices, applying containers with **Docker** and orchestrated using **Kubernetes** (AKS/EKS) to optimize performance and ensure high availability in distributed systems.\n• Developed and maintained CI/CD pipelines with **GitHub Actions**, **Azure DevOps**, and **CircleCI**, enhancing the deployment process for both web and API services, significantly reducing deployment times by **30%**.\n• Collaborated with cross-functional teams, effectively communicating ideas and solutions while emphasizing collaboration to drive project success and continuous learning.\n• Enhanced cloud-native development skills by designing data architectures using **PostgreSQL**, **MongoDB**, and **Redis** for high-performance data storage and retrieval in healthcare applications.\n• Implemented comprehensive monitoring strategies to ensure the uptime and performance of services, leveraging advanced debugging techniques and performance optimization strategies.\n• Developed complex data visualization tools with **D3.js**, **Chart.js**, and built performance monitoring dashboards for operational KPIs, supporting informed decision-making processes.\n• Established design patterns and coding standards that improved overall code quality, making onboarding new developers more efficient by cutting time by **25%**.\n• Integrated advanced search capabilities using **Azure Cognitive Search** and **ElasticSearch**, enabling real-time access to millions of unstructured health records and financial documents.\n• Actively participated in knowledge sharing and technology discussions to foster a culture of continuous learning within the development team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Designed and implemented software architecture focusing on **scalability principles** and **cloud-native development**, leading the modernization of financial platforms through a microservices approach using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**.\nDeveloped and maintained dynamic front-end applications leveraging **TypeScript**, **React (18)**, **Vue 3**, and **Next.js**, utilizing **Redux Toolkit** and **Tailwind CSS** to enhance user experience in financial dashboards and admin portals.\nEngineered real-time monitoring systems with **React**, **D3.js**, and **Power BI Embedded**, empowering operations teams to visualize up to **1000+** financial transactions simultaneously, detect anomalies, and generate actionable insights.\nLeveraged **Kafka**, **RabbitMQ**, and **Azure Service Bus** to create an event-driven architecture that facilitates asynchronous communication and real-time event processing, enhancing transaction speed by **30%**.\nDesigned and orchestrated ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting data ingestion from both internal and external sources, ensuring availability of fresh data within **minutes**.\nImplemented AI/ML-powered systems for fraud detection using **scikit-learn** and **XGBoost**, analyzing over **10 million** transaction patterns to proactively flag suspicious activities in banking systems.\nDeveloped ML pipelines for credit scoring and churn prediction integrating with backend services, utilizing **MLflow** and **Airflow** to ensure real-time decision-making capabilities, optimizing processing time by **20%**.\nFostered collaboration and communication amongst teams, employing design patterns and engaging in continuous learning to stay updated with the latest technologies and methodologies, contributing to building developer tools for enhanced efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **TypeScript** and **JavaScript** to develop and optimize scalable web applications as a Senior Software Engineer, ensuring high performance and responsiveness across key components.\nDesigned and implemented robust **software architecture** and **design patterns** prioritizing **scalability principles** and **cloud-native development** for global e-commerce solutions.\nEngineered microservices using **React (18)**, **Angular**, and **.NET (C#)** frameworks to provide seamless user experiences, impacting over **1M** users monthly with improved load times and reduced latency.\nImplemented **CI/CD pipelines** that reduced deployment times by **30%** and increased release frequency, utilizing containerization with **Docker** and orchestration through **Kubernetes**.\nIntegrated advanced monitoring techniques and tools to enhance system observability, achieving a **99.9%** uptime across distributed systems.\nEmployed effective collaboration and communication skills to work cross-functionally and lead teams in developing developer tools that improved workflow efficiency.\nConducted performance optimizations that enhanced application response times by **25%**, utilizing techniques such as caching with **Redis** and optimizing database queries for efficient data access.\nApplied debugging expertise to troubleshoot and resolve issues promptly, ensuring minimal disruption to services across the e-commerce platform.\nMaintained a commitment to continuous learning by keeping up with the latest industry trends and technologies, seeking to implement effective, innovative solutions in daily tasks."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Angular, Vue\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET (C#)\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tCloud-native development, microservices, containers, CI/CD pipelines\n\n **Other:**\n\tSoftware architecture, design patterns, scalability principles, monitoring, distributed systems, building developer tools, performance optimization, debugging, collaboration, communication, continuous learning"
}