{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Customer Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Customer Engineer with 13+ years of software development experience, specializing in **C**, **C++**, and **Java** to deliver high-performance applications across diverse industries. Adept in mobile application development for both **Android** and **iOS** using **Android Studio** and **XCode**. Proven track record in ensuring system and application security, encompassing **Cyber Security**, **Network Security**, and **Application Security**. Excellent at fostering customer support through effective communication and technical guidance. Additionally, skilled in JavaScript/TypeScript, Python, and **Flutter**, with hands-on experience in full-stack development frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, event-driven architectures, and CI/CD pipelines, while adhering to compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Strong background in MLOps, harnessing tools like **MLflow**, **Airflow**, and **Kubeflow** for model training and orchestration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Demonstrated exceptional **software development** skills, focusing on client needs while developing secure applications in **C**, **C++**, and **Java** for both **Android** and **iOS** platforms.\nImplemented **application security** best practices to ensure user data protection and promote a secure environment, adhering to **Cyber Security** guidelines throughout the development lifecycle.\nProvided advanced **customer support** for software solutions, enhancing client satisfaction through effective **communication** and detailed technical guidance.\nDesigned user-friendly applications with robust features tailored for **Android Studio** and **XCode**, improving usability and accessibility across platforms.\nConducted comprehensive **system security** assessments, addressing vulnerabilities and ensuring compliance with industry standards to protect sensitive information.\nUtilized cutting-edge technologies and frameworks to address customer feedback and requirements, leading to a **30%** increase in user engagement.\nTrained internal teams on best practices in **network security** and **application security**, promoting a culture of security awareness and proactive risk management.\nCollaborated with cross-functional teams to streamline the software development process, achieving **95%** of project milestones on time and within budget.\nDeveloped and maintained high-quality documentation for applications, ensuring clarity and consistency across projects, which supported a **50%** reduction in onboarding time for new engineers."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed secure software solutions following best practices in **C**, **C++**, and **Java** to enhance system security and customer support.\n• Provided exceptional communication and support to clients, ensuring a clear understanding of cybersecurity measures within software development.\n• Implemented application and network security protocols to safeguard sensitive information and maintain compliance with industry standards.\n• Collaborated with cross-functional teams to assess and address software performance, facilitating system optimization and enhancing user experience.\n• Executed comprehensive software testing, troubleshooting, and customer support to ensure high-quality deliverables and satisfaction rates exceeding **95%**.\n• Spearheaded cybersecurity initiatives, improving application security measures that reduced vulnerabilities by **30%**.\n• Designed and maintained documentation for software development processes, improving team efficiency and knowledge sharing by **20%**.\n• Mentored junior engineers on secure coding practices and software development lifecycle, resulting in a **40%** increase in project delivery speed."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Ensured application security and system integrity by implementing robust cybersecurity measures across all software development phases, utilizing frameworks such as **Java** and **C++**.\nDesigned and developed secure mobile applications for **Android** and **iOS** platforms using **Android Studio** and **XCode**, maintaining compliance with industry security standards to protect sensitive customer data.\nCollaborated closely with cross-functional teams to deliver exceptional customer support, employing effective communication skills to address client concerns and provide technical assistance.\nOptimized development processes by applying **C** and **C++** programming methodologies, resulting in a **30%** improvement in coding efficiency and reduced bug rates.\nDeveloped and maintained system and network security protocols, achieving **99.9%** uptime for critical applications and services, and enhancing system resilience against potential threats.\nLed training sessions for junior staff on cybersecurity best practices and secure coding guidelines, fostering a culture of security awareness within the team.\nImplemented software updates and security patches, leading to a **40%** reduction in vulnerabilities identified during routine security assessments.\nEngaged in regular communication with stakeholders to convey technical concepts effectively, ensuring alignment with project goals and customer requirements."
    }
  ],
  "skills": "**Programming Languages:**\n\tC, C++, Java, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Cyber Security, System security, Network security, Application security, Software development, Customer support, Communication",
  "apply_company": "Zimperium"
}