{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Cloud Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Cloud Engineer with 10+ years of comprehensive experience in delivering high-performance cloud-native applications. Proficient in managing and deploying solutions on **AWS**, **Azure**, and **GCP**. Skilled in data warehousing technologies like **Snowflake** and experienced with relational databases, **SQL**, and **RDBMS**. Adept in implementing robust **Data Governance**, **Data Quality Monitoring**, and **Data Privacy** measures to ensure high standards of compliance and security.\n\nStrong expertise in building secure systems focusing on compliance standards such as **CISM**, **CISSP**, and **Security+**. Proficient in networking principles including **TCP/IP**, **DNS**, and **HTTPS**, enabling seamless integration and data transfer across diverse environments. Experience with **IAM**, **RBAC**, and security protocols like **OAuth** and **SSL/TLS** enhances the reliability and safety of the applications.\n\nSkilled in programming languages such as **Python**, **Java**, and **NodeJS**, with a proven record of developing and deploying efficient software solutions. Familiar with microservices architecture, event-driven systems, and CI/CD automation. Passionate about leveraging technology to drive significant, real-world impact, while continuously pushing for innovation in system design.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented data governance and data quality monitoring solutions for healthcare and finance with a focus on **AWS** and **Azure** cloud platforms, ensuring compliance with data privacy regulations such as GDPR and HIPAA.\n• Developed and optimized RDBMS solutions using **SQL** to manage large-scale data warehousing operations, ensuring efficient data storage and querying for analytical workloads.\n• Led the integration of advanced networking solutions (TCP/IP, HTTP, HTTPS, DNS) in deploying secure applications and services, enhancing overall system resilience.\n• Managed user identity and access management systems through IAM and RBAC principles, implementing robust security frameworks across multiple environments.\n• Established data governance policies that focus on data quality monitoring and privacy measures, enhancing stakeholder confidence in data integrity and reliability.\n• Collaborated on the deployment of infrastructure using **GCP** and **AWS**, including the design and management of load balancers and firewalls to optimize application availability and security.\n• Implemented DevOps strategies using **Azure DevOps** and other CI/CD tools to streamline the deployment and management of both web and API services.\n• Enhanced application security through SSL/TLS and OAuth implementations, ensuring secure data transmission and user authentication processes.\n• Integrated APIs in Python for seamless data access and functionality, connecting multiple services with REST API standards, facilitating smooth data flow across platforms.\n• Delivered enterprise-level applications with backend support for real-time data analytics and monitoring on **Snowflake** and **AWS**, optimizing performance for high-volume transaction environments.\n• Provided ongoing support for Windows, Mac, and *Nix systems, ensuring cross-platform compatibility and infrastructure reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **AWS**, **Azure**, and **GCP** to architect and modernize financial platforms, enhancing security and regulatory compliance through robust **IAM** and **RBAC** configurations.\nDesigned and managed **Data Warehouses** ensuring high standards in **Data Governance** and **Data Quality Monitoring**, leading to a **30% reduction** in data retrieval times for reporting.\nImplemented secure communications using **SSL/TLS**, and established network security protocols through **Load Balancers**, **Firewalls**, and **Proxies** to safeguard financial transaction processes.\nIntegrated **RDBMS** with **SQL** for seamless data management and retrieval, achieving a **50% improvement** in database performance for high-volume transaction systems.\nDeveloped and maintained RESTful APIs with **Node.js** and **Python**, facilitating data exchange and operational efficiency across services, with a focus on **MFA** and **OAuth** for security.\nLeveraged **Python** and various data processing tools like **Apache Airflow** to streamline ETL pipelines, contributing to critical financial data analysis and reporting efficiency.\nCollaborated with cross-functional teams to implement strategic cloud solutions, optimizing workloads across **AWS**, **Azure**, and **GCP**, ensuring a **40% increase** in system reliability and uptime.\nConducted extensive security assessments and audits following **CISM**, **CISSP**, and **Security+** guidelines, reinforcing the security posture of banking systems and protecting sensitive financial information."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **AWS**, **Azure**, and **GCP** for cloud architecture and deployment, ensuring robust, scalable, and high-availability solutions across varied environments.\nDesigned and optimized data storage solutions in **Snowflake** and various **RDBMS** platforms, enabling efficient data retrieval and high-performance analytics for real-time reporting with **SQL**.\nImplemented **IAM** and **RBAC** for comprehensive security management, controlling user access and ensuring compliance with data privacy regulations, including **GDPR**.\nDeveloped and maintained RESTful APIs using **Python** and **Node.js**, guaranteeing seamless integration with cloud services and third-party applications to deliver high-quality client experiences.\nEstablished data governance and quality monitoring frameworks to maintain the integrity and reliability of data, utilizing robust methodologies for data privacy and compliance.\nEngineered secure networking solutions incorporating **TCP/IP**, **HTTP**, **HTTPS**, and firewall settings to ensure secure communication between services and protect against potential threats.\nConfigured load balancers and proxies to evenly distribute traffic, enhancing the performance of applications and improving response times by **30%**.\nApplied **SSL/TLS** for secure data transmission, implementing OAuth and **MFA** for enhanced authentication methods to protect sensitive user information.\nCreated a multi-cloud deployment strategy that improved system resilience and reduced latency in service delivery by **25%**, significantly enhancing user satisfaction.\nConducted security audits and vulnerability assessments, aligning with **CISM**, **CISSP**, and **Security+** standards to proactively identify and mitigate risks to cloud infrastructure."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, R, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, NodeJS\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST API, OAuth, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, RDBMS, SQL, Snowflake\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, GCP, Public Key Infrastructure, SSL/TLS, IAM, RBAC, Networking, TCP/IP, HTTP, HTTPS, DNS, Load Balancers, Proxies, Firewalls\n\n **Other:**\n\tMachine Learning, AI, MLflow, Airflow, Kubeflow, Data Warehouse, Data Governance, Data Quality Monitoring, Data Privacy, Security, CISM, CISSP, CSSP, CCSK, Security+, CCNA, ODBC, JDBC, MFA, SCIM",
  "apply_company": "Snowflake"
}