{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a skilled Senior Software Engineer with 8 years of experience, I possess expertise in C/C++, **Linux**, **AWS**, **Azure**, **GCP**, **Microservices**, **CI/CD**, and **Terraform**. I have a proven track record in developing and deploying high-performance, scalable solutions, leveraging my strong foundations in **Python** and **Golang**. My experience includes designing and implementing robust systems utilizing concepts such as **Network Segmentation**, **Virtualization**, and **Multithreading**. \nI excel in building microservices and crafting CI/CD pipelines, ensuring efficient and secure software delivery practices. Additionally, I have an in-depth understanding of performance optimization techniques and network function virtualization (**NFV**), enabling me to deliver solutions that meet strict compliance standards. Alongside this, I have hands-on experience with embedded systems and software forwarding, enriching my capability to contribute effectively in complex technical environments. \nI am committed to fostering innovation through integration of cutting-edge technologies and methodologies in my work.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained scalable, microservices-based architectures focusing on **Python**, utilizing tools such as **Docker** and **Kubernetes** to enhance deployment strategies.\n- Designed and implemented CI/CD pipelines leveraging **AWS**, **Azure DevOps**, and **GitHub Actions** to streamline software development and deployment processes.\n- Collaborated on projects to integrate **C/C++** and **Golang** into existing systems for improved performance and efficiency.\n- Utilized **Linux** for deploying and managing embedded systems, ensuring reliability and consistent performance across various applications.\n- Employed **Terraform** for infrastructure as code, automating resource provisioning and improving deployment speed by **50%**.\n- Developed robust network segmentation and virtualization solutions enhancing security protocols in cloud environments such as **AWS**, **Azure**, and **GCP**.\n- Leveraged multithreading and software forwarding techniques to optimize performance in high-load scenarios, reducing processing times by **30%**.\n- Implemented comprehensive testing strategies using tools like **PyTest** and **Postman**, achieving a code coverage of **95%** to ensure stability and quality in delivered software.\n- Designed and managed enterprise-level applications with a focus on advanced communication protocols, ensuring efficient data transfer and system interoperability.\n- Contributed to the evolution of security measures utilizing **IPSec** and **DPI**, fortifying infrastructures against potential threats.\n- Engaged in extensive network function virtualization (NFV) projects, boosting system agility and manageability.\n- Enhanced existing systems with deep packet inspection capabilities for better analysis of communication patterns and network traffic."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Golang** to develop microservices architectures, enhancing performance and scalability in financial systems for high-volume transactions.\nDesigned and implemented CI/CD workflows and automated deployments using **Terraform** and **AWS**, achieving a deployment frequency increase of **60%** while reducing errors.\nConducted rigorous testing and adherence to **Linux** protocols to ensure system reliability and performance, regularly monitoring with a **99.9%** uptime.\nLeveraged **Azure** services for event-driven architecture and real-time processing, integrating **Kafka** and **RabbitMQ** to facilitate asynchronous communication for transaction alerts.\nCollaborated in a high-performance team to enhance existing financial applications, driving feature releases on a weekly basis, improving customer satisfaction by **30%**.\nDeveloped and orchestrated ETL processes using **Python** and **Apache Airflow**, ensuring efficient batch and real-time data ingestion, with processing times reduced by **45%**.\nImplemented advanced analytics and machine learning features with **scikit-learn** and **XGBoost**, improving fraud detection accuracy by **25%** through proactive transaction monitoring.\nMaintained adherence to best practices in **multithreading** and **network segmentation**, ensuring secure and efficient software deployment across platforms.\nDrove innovation through technologies such as **Microservices**, **Virtualization**, and **Embedded Systems**, leading cross-functional teams to deliver cutting-edge solutions."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Golang** to design and optimize high-performance microservices for a scalable global e-commerce platform, ensuring low latency and high availability in critical areas such as checkout and order processing.\nImplemented **C/C++** for performance-sensitive applications, leveraging Linux environments to enhance system reliability and efficiency.\nDeveloped CI/CD pipelines utilizing **Terraform** and **AWS** for efficient deployment and infrastructure management, achieving 90% deployment success with zero-downtime.\nEngineered and deployed high-traffic applications in cloud environments across **AWS**, **Azure**, and **GCP**, effectively implementing cloud-native architectures to ensure elasticity and scalability under varying loads.\nApplied **Linux** and virtualization techniques to optimize server resource utilization, leading to a 30% reduction in infrastructure costs.\nImplemented multithreading strategies in service components to enhance performance, reducing response times for user interactions by up to 40%.\nLeveraged communication protocols and **DPI** techniques for real-time data analysis and optimization, improving application responsiveness and user experience.\nDeveloped and maintained robust data storage solutions using cloud services and technologies, ensuring fast and fault-tolerant access to application data through efficient network segmentation.\nEmphasized secure coding practices and identity management through the integration of **OAuth 2.0** for safeguarding user data across the application, achieving GDPR compliance and enhanced privacy protection.\nParticipated in strategic planning sessions for product roadmaps, delivering innovative software solutions aligned with business objectives."
    }
  ],
  "skills": "**Programming Languages:**\n\tC/C++, Python, Golang, JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP, NFV, Network Segmentation, Virtualization\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Multithreading, Software Forwarding, DPI, IPSec, Embedded Systems, Communication",
  "apply_company": "Arista Networks"
}