{
  "name": "Patryk Zaslawski",
  "role_name": "Senior AI Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a Senior AI Engineer, I bring 8+ years of software engineering experience with a proven track record in developing high-performance AI solutions. Skilled in leveraging **Langchain** and **Langgraph**, I specialize in building secure and efficient applications tailored to complex business needs. My technical expertise includes **Python** (FastAPI, Django, Flask, SQLAlchemy) and frontend frameworks such as **Angular**, **Vue**, **React**, and **Next.js**. I am also experienced with cloud platforms like **AWS** and **Azure**, and adept in database optimization using **PostgreSQL**, **MySQL**, and **MongoDB** to enhance system performance and reliability. With a strong focus on microservices architecture and REST/gRPC API development, I consistently deliver enterprise-grade solutions aligned with industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Leveraged **Langchain** and **Langgraph** to develop cutting-edge AI-driven features for the Healthcare Experience Platform, enhancing data processing capabilities and user engagement.\n- Designed and implemented innovative text processing workflows using **Langchain** to achieve efficient integration of large language models for real-time patient interactions, improving query response times by **30%**.\n- Created dynamic and adaptive AI models that integrate seamlessly with existing Python microservices, improving scalability and performance across the platform.\n- Enhanced user experience through AI-driven recommendations using **Langgraph**, increasing patient engagement metrics by **25%**.\n- Promoted best practices in AI development by mentoring a team of **10+ engineers**, focusing on leveraging frameworks like **Langchain** within a cloud-native architecture.\n- Spearheaded the integration of AI capabilities into **Python** microservices, ensuring compliance with HIPAA and other regulatory requirements.\n- Collaborated with cross-functional teams to integrate **Langchain** and **Langgraph** with other technologies, optimizing system architecture and performance.\n- Conducted thorough testing and validation of AI-driven features using Python's **unittest** and **PyTest**, ensuring reliable performance across various user scenarios.\n- Managed deployment processes for AI features using CI/CD pipelines in **Azure DevOps**, ensuring efficient releases and updates within a three-week cycle.\n- Established performance benchmarks for AI functionality, leading to continuous improvements and optimizations resulting in **40%** faster data processing times."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Leveraged **Langchain** and **Langgraph** to develop and optimize AI-driven solutions, enhancing natural language processing capabilities and improving overall system efficiency for senior-level projects.\n- Executed the transition to a Python (FastAPI, Django, Flask) microservices-based backend architecture, enhancing scalability by **30%**, maintainability, and performance, while integrating services with SQL Server, PostgreSQL, and MongoDB for seamless data management.\n- Crafted and deployed RESTful and gRPC APIs in Python, reinforcing secure communication between internal applications and services, achieving **real-time transaction updates**.\n- Refactored legacy systems leveraging .NET/VB.NET into Python microservices, ensuring compatibility with contemporary platforms while preserving critical functionality, impacting over **5** business units.\n- Developed dynamic, user-centric frontends integrated with Python backends using Angular, Vue, React, and Next.js, applying Redux/NgRx to enhance user interface responsiveness by **40%**.\n- Constructed a real-time transaction monitoring dashboard powered by Python APIs with Angular UI, and integrated with Power BI for advanced reporting and analytics, supporting over **1,000** transactions daily.\n- Streamlined system integrations with MuleSoft and Python services to modernize ACH transfers, credit card payments, and wire transfers, improving transaction efficiency by **25%**.\n- Ensured robust data protection in Python services through encryption, RBAC, OAuth 2.0, and JWT, achieving compliance with financial regulations and safeguarding sensitive information.\n- Optimized queries and ensured high availability and reliability for transactional data working with SQL Server, DynamoDB, and Redis accessed via Python services, serving **over 10,000** concurrent users.\n- Employed Kafka and RabbitMQ with Python microservices to construct a high-throughput, event-driven architecture capable of managing large-scale financial operations effectively.\n- Configured and managed Azure Service Bus with Python services to facilitate reliable messaging among microservices, boosting modularity and decoupling significantly.\n- Designed and implemented secure authentication and authorization in Python APIs utilizing OAuth 2.0, OpenID Connect, and JWT, enhancing security measures across services.\n- Developed innovative fraud detection services in Python, integrating Azure Machine Learning models and behavioral data to flag suspicious activities proactively, increasing detection efficiency by **50%**.\n- Architected secure payment gateway integrations in Python, supporting ACH transfers, credit card transactions, and wire transfers while ensuring PCI compliance and interoperability with external providers.\n- Constructed serverless components in Python employing AWS Lambda and Azure Functions for ETL pipelines, minimizing infrastructure overhead and elevating responsiveness.\n- Integrated the ELK stack (Elasticsearch, Logstash, Kibana) with Python services for centralized logging and performance tracking, leading to a **20%** reduction in incident response time.\n- Managed Kubernetes clusters for deploying Python microservices, optimizing rolling updates, auto-scaling, and ensuring high availability for applications.\n- Applied best practices in Python development with automated unit testing using PyTest and integration testing with Selenium, assuring high reliability of backend services.\n- Designed robust integration solutions in Python with MuleSoft for secure and compliant financial data exchange with external partners.\n- Contributed to event-driven architectures in Python using Kafka, RabbitMQ, and Azure Service Bus to decouple systems, enhancing performance across diverse applications.\n- Integrated unit tests, static analysis, and CI/CD pipelines using Azure DevOps, GitHub Actions, and TFS, fostering automated quality assurance and continuous delivery."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Integrated **Langchain** and **Langgraph** into existing AI frameworks to enhance model performance and adaptability, significantly improving user experience in real-time applications.\n- Designed and optimized backend services for an e-commerce platform using **Python** (FastAPI, Django, Flask, SQLAlchemy), with 9% improvement in scalability and performance across checkout, cart, and order fulfillment modules.\n- Developed robust RESTful APIs in **Python** to manage high-volume transactions, achieving 99.9% uptime and facilitating seamless integration between frontend interfaces and backend systems for real-time customer interactions.\n- Leveraged **PostgreSQL**, **SQL Server**, and **MySQL** with Python ORMs (SQLAlchemy, Django ORM) to design, optimize, and manage transactional databases, resulting in a 30% reduction in query latency.\n- Built dynamic, responsive frontends integrated with **Python** backends using **React**, **Next.js**, **Angular**, and **Vue**, applying **Redux/NgRx** to enhance state management and deliver smooth user experiences.\n- Automated builds, testing, and deployments using CI/CD pipelines (**GitHub Actions**, **Azure DevOps**, **Jenkins**), ensuring 100% consistency in feature delivery.\n- Containerized **Python** applications with **Docker**, enabling streamlined deployments and improving scalability by 15% across multiple environments.\n- Worked with NoSQL databases (**MongoDB**, **Cassandra**, **Redis**) alongside **Python** services, ensuring high availability and optimal performance for unstructured data handling.\n- Implemented unit and integration tests in **Python** (**PyTest**, **unittest**) and automated frontend testing with **Selenium**, achieving a code quality score of 90% and reducing manual testing efforts.\n- Conducted UI and E2E tests to validate functionality and performance, securing 95% user satisfaction ratings through consistent business alignment.\n- Developed observability for **Python** services using **Prometheus**, **Grafana**, **Azure Monitor**, and **Sentry** for enhanced performance tracking and system health monitoring.\n- Migrated legacy ASP.NET applications to **Python** microservices, preserving critical workflows and reducing system overhead by 20%.\n- Utilized **HTML5**, **CSS3**, **JavaScript**, and **TypeScript** to develop responsive and interactive frontends integrated with **Python** APIs for cross-device accessibility.\n- Implemented real-time WebSocket/AJAX-based chat functionality in **Python**, improving customer support speed by facilitating instant communication with users and agents.\n- Integrated RBAC and **OAuth 2.0** in **Python** services for secure authentication and personalized access for customers and administrators.\n- Replaced legacy **WCF** services with **Python REST/gRPC** services, achieving a 40% improvement in inter-service communication reliability.\n- Performed performance testing with **Apache JMeter** and **Locust**, identifying bottlenecks which led to a 25% improvement in the ability to handle peak traffic loads.\n- Implemented caching strategies using **Redis** in **Python** services, reducing database load and improving response times for frequently accessed resources by 50%.\n- Optimized e-commerce workflows (cart, checkout, payments) with **Python** backends, ensuring low latency and expedited transaction processing.\n- Developed secure payment integrations in **Python** with payment processors such as **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI compliance in all transactions.\n- Leveraged **RabbitMQ** and **Kafka** with **Python** microservices for an event-driven architecture, facilitating reliable handling of orders, inventory updates, and shipping notifications.\n- Designed and developed SEO-optimized, mobile-friendly websites with **Next.js**, **Angular**, **Vue**, and **React**, ensuring seamless accessibility across devices while integrating with **Python** APIs.\n- Conducted load and stress testing with **JMeter** and **k6**, simulating real-world traffic patterns to validate performance and system stability."
    }
  ],
  "skills": "Programming Languages:\n\tPython\n\nBackend Frameworks:\n\tFastAPI, Django, Flask, Spring Boot\n\nFrontend Frameworks:\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\nAPI Technologies:\n\tREST & gRPC APIs\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQLAlchemy, Pydantic\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\nCloud & Infrastructure:\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\nOther:\n\tLangchain, Langgraph, Celery",
  "apply_company": "Polance"
}