{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Finance Systems Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Senior Finance Systems Engineer with 8+ years of software engineering experience, I bring expertise in **NetSuite**, **Advanced Revenue Management**, and **Zuora**, ensuring seamless integration and optimization of financial systems. I excel in **project management**, **stakeholder management**, and understand **accounting principles** to align technology solutions with business objectives. My technical proficiency includes **GitHub**, which enhances collaboration and version control in software development. Additionally, I possess a strong background in building applications using **Python** (FastAPI, Django, Flask, SQLAlchemy) and frontend frameworks like **Angular**, **Vue**, **React**, and **Next.js**. My cloud experience includes **AWS** and **Azure**, complemented by database management skills in **PostgreSQL**, **MySQL**, and **MongoDB**. I specialize in designing high-performance architectures, employing **microservices** and **REST/gRPC API** development to meet industry standards and deliver enterprise-grade solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Finance Systems Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Managed financial audit processes using **NetSuite** and **Advanced Revenue Management** to ensure compliance and accuracy in reporting.\n- Developed and supported revenue management solutions leveraging **ZoneBilling** and **Zuora**, facilitating seamless invoicing and payment processes.\n- Spearheaded the implementation of contract management systems with **ContractPod AI**, enhancing efficiency in tracking and compliance across multiple stakeholders.\n- Utilized **GitHub** for version control in projects involving financial systems, ensuring robust collaboration and code management practices.\n- Led project management initiatives, effectively coordinating requirements and stakeholder management for finance-related technology implementations.\n- Championed the integration of **Spiff** to streamline commission calculations, ensuring accurate financial reporting across teams.\n- Applied advanced accounting principles to optimize financial processes, ensuring adherence to regulatory standards and enhancing overall system performance.\n- Designed and implemented data workflows within **NetSuite**, enabling efficient revenue recognition and analysis, positively impacting the organization’s financial health.\n- Established proactive financial reporting mechanisms, enhancing audit readiness and accountability through regular performance metrics reporting.\n- Ensured system upgrades and migrations were executed with minimal downtime and maximum scalability, particularly focusing on adapting to new financial models in the enterprise landscape."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Managed financial audit processes while utilizing **NetSuite** and **Advanced Revenue Management**, ensuring compliance and accuracy in financial reporting.\n• Developed and maintained integration solutions using **Zuora** and **ZoneBilling**, improving revenue recognition and billing efficiency by **30%**.\n• Collaborated with stakeholders to enhance **Omnea** and **ContractPod AI** functionalities, resulting in a **20%** increase in operational efficiency.\n• Implemented and optimized financial processes with **Spiff**, streamlining revenue management workflows for real-time analytics.\n• Developed and executed project management strategies within the **SuiteCloud Development Framework**, achieving milestone delivery on schedule for over **10+** projects.\n• Performed system audits and data validation using **GitHub** for version control, ensuring data integrity and compliance with accounting principles.\n• Leveraged **TMS** to oversee financial operations, identifying opportunities for cost reduction and risk mitigation.\n• Designed and implemented system enhancements for financial reporting, improving accuracy and efficiency by **25%** through process automation.\n• Applied project management and stakeholder management skills to lead cross-functional teams in finance system upgrades, ensuring smooth transitions and training for **50+** users.\n• Continuously conducted training sessions for team members on best practices in financial systems management and accounting principles."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Leveraged **NetSuite**, **ZoneBilling**, and **Zuora** to design and implement scalable finance systems, improving transaction management and compliance with accounting principles for financial audits.\n• Developed advanced revenue management solutions using **Advanced Revenue Management** tools, optimizing revenue recognition and ensuring adherence to financial regulations.\n• Managed stakeholder relationships effectively through transparent project management practices, ensuring alignment between business objectives and technical implementations.\n• Streamlined financial operations utilizing **SuiteCloud Development Framework** for customizations and enhancements to existing systems, resulting in increased efficiency and accuracy in financial reporting.\n• Collaborated with cross-functional teams to integrate enterprise software solutions, ensuring robust performance and stability across finance systems.\n• Utilized **GitHub** for version control and collaboration on code changes, enabling a streamlined development cycle and improving team productivity through effective source code management.\n• Automated reporting and auditing processes using tools like **ContractPod AI** and **Spiff**, enhancing the accuracy and speed of financial data analysis and audit preparation.\n• Conducted thorough project management throughout system implementation, ensuring projects were delivered on time and within budget parameters, with a focus on risk assessment and mitigation.\n• Engaged in financial analysis and stakeholder management to enhance operational efficiency, contributing to a reduction in financial discrepancies by **15%** year-over-year.\n• Championed the integration of **TMS** to improve the management of financial transactions and optimize revenue streams, positively impacting overall financial performance.\n• Developed detailed documentation and training materials for end-users, facilitating user adoption and reducing support tickets by **30%**. \n• Implemented comprehensive testing strategies to ensure system integrity and performance, utilizing various **DevOps tools** to enhance the reliability and scalability of finance applications."
    }
  ],
  "skills": "****Programming Languages:****\n\tPython\n\n****Backend Frameworks:****\n\tFastAPI, Django, Flask, Spring Boot\n\n****Frontend Frameworks:****\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n****API Technologies:****\n\tREST & gRPC APIs\n\n****Serverless and Cloud Functions:****\n\tAWS (Lambda), Azure\n\n****Databases:****\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n****DevOps:****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n****Cloud & Infrastructure:****\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n****Other:****\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, GitHub, NetSuite, Advanced Revenue Management, ZoneBilling, Zuora, Omnea, ContractPod AI, Spiff, TMS, SuiteCloud Development Framework, financial audit, project management, stakeholder management, accounting principles"
}