{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a results-driven Senior QA Engineer with 8 years of experience, I possess a strong proficiency in Web Testing and Mobile Testing, utilizing tools like **TestRail** and **Jira** to ensure high-quality deliverables. I am skilled in A/B Testing methodologies to enhance user experience and product performance. My extensive knowledge of the Software Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC) enables me to develop effective testing strategies that align with project requirements.\nIn addition, I have a solid foundation in using **Git** for version control and **SQL** for database querying, ensuring comprehensive test coverage. My background as a Full Stack Developer provides me with unique insights into the development process, allowing for more effective collaboration with development teams. Furthermore, I have substantial experience with APIs and implementing testing frameworks, which supports my ability to deliver robust testing solutions in complex environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted thorough **Web Testing** and **Mobile Testing** for healthcare and financial platforms, ensuring high quality and compliance with HIPAA, FHIR, GDPR, and financial regulatory standards (e.g., PCI DSS, SOX).\nUtilized **TestRail** and **Jira** for test case management, tracking, and reporting on test progress across **SDLC** and **STLC** phases.\nCollaborated with the development team to design and execute A/B Testing strategies, enhancing user experience and performance based on analytics.\nAssisted in the creation and implementation of structured test strategies using **Jest**, **Cypress**, **PyTest**, and **Postman**, ensuring robust unit, integration, E2E, and contract testing coverage across both front-end and backend services.\nParticipated in the establishment of CI/CD pipelines for automated testing processes, facilitating rapid feedback loops and accelerating deployment cycles.\nReviewed and validated API endpoints, ensuring they met both functional and performance criteria using established frameworks and tools.\nConducted data validation and integrity checks, implementing structured querying using **SQL** to analyze data consistency and accuracy throughout the application lifecycle.\nConducted exploratory testing sessions to uncover potential defects and performance issues early in the development cycle, contributing to overall product reliability.\nEngaged in cross-functional collaboration with data scientists and developers to enhance application quality and eliminate discrepancies before production releases.\nProvided guidance on best practices for test automation, fostering knowledge sharing among team members to improve overall testing efficiencies."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Executed comprehensive **Web Testing** and **Mobile Testing** strategies, ensuring the stability and performance of financial platforms with a focus on user experience and software usability.\nUtilized **TestRail** and **Jira** for meticulous documentation and tracking of testing processes, managing over **50** test cases and resulting in a **20%** reduction in critical defects.\nConducted **A/B Testing** on landing pages and user interfaces, analyzing data and optimizing processes based on user interactions, leading to a **15%** increase in user engagement metrics.\nCollaborated cross-functionally with development teams using **Git** for version control, streamlining the integration of quality assurance practices into the **SDLC** for iterative development and product enhancements.\nDesigned and executed **SQL** queries to validate data integrity and report generation for analytical assessments, ensuring accuracy in data handling across platforms.\nTested and validated **API** endpoints for robustness and reliability, employing postman and other automation tools to ensure seamless data communication between modules.\nEngaged in the **STLC** processes, defining test strategies, test planning, and risk assessments to uphold high quality in deliverables throughout the project lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted extensive web and mobile testing to ensure functionality, usability, and performance across multiple platforms.\nUtilized **Jira** and **TestRail** for test management, tracking bugs, and documenting test cases, fostering seamless collaboration with development teams.\nImplemented A/B testing strategies to evaluate feature effectiveness and optimize user experiences, significantly boosting conversion rates by **15%**.\nParticipated in the entire software development lifecycle (SDLC) and software testing lifecycle (STLC), enhancing product quality through rigorous testing methodologies.\nDeveloped automated test scripts and executed manual tests on APIs, ensuring comprehensive coverage of **RESTful** and **GraphQL** services and identifying critical issues pre-release.\nMaintained version control and collaborated effectively using **Git**, streamlining the code review process and enabling quick deployments with minimal disruption.\nEvaluated backend databases using **SQL** for data validation during testing phases, ensuring all data transactions functioned as expected under various conditions.\nDesigned and implemented test cases focused on performance and scalability, contributing to high availability of the system under a load of **10,000+** concurrent users.\nFostered continuous integration practices to integrate testing early in the development cycle, ensuring each build meets quality standards before deployment."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Web Testing, Mobile Testing, TestRail, Jira, A/B Testing, Git, SDLC, STLC",
  "apply_company": "OBRIO"
}