{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Results-driven Senior Software Engineer with 8+ years in software development, specializing in **Go**, **Kubernetes**, and **Python**. Expertise in building and deploying scalable applications with a focus on modern architectures and cloud technologies. Skilled in implementing **CI/CD** practices within **Agile** environments to enhance development workflows and ensure continuous integration. Proficient in utilizing advanced tools such as **Qdrant**, **vLLM**, and optimizing pipeline processes with **tensor parallelism** for high-performance applications on **Nvidia H100** and **Nvidia B200** hardware. My background in e-commerce, finance, and healthcare equips me to deliver tailored, high-performance solutions aligned with business requirements while maintaining exceptional documentation and best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed scalable cloud-native applications using **Python**, implementing effective design patterns and ensuring high-quality documentation to facilitate knowledge sharing.\n• Led Docker and **Kubernetes** deployments, optimizing resource utilization and enhancing scalability with **Nvidia H100** and **Nvidia B200** hardware accelerations.\n• Streamlined CI/CD pipelines for **Python** services using GitHub Actions and Azure DevOps, reducing deployment times by **30%** and ensuring continuous integration.\n• Mentored and guided a cross-functional team in Agile methodologies, fostering an environment of collaboration and innovation among **10+ engineers**.\n• Designed and built robust data processing pipelines using **Qdrant** and other technologies, enhancing the efficiency of machine learning tasks.\n• Applied advanced techniques in **tensor parallelism** within **Python** applications to optimize performance on large-scale data sets.\n• Established best practices and guidelines for documentation, ensuring all code is well-documented and maintainable to support agile development processes.\n• Collaborated on real-time analytics by integrating **Go** microservices with **Python**, improving data retrieval speed by **25%**.\n• Championed the adoption of observability practices leveraging **monitoring** tools to proactively identify performance bottlenecks and enhance system reliability.\n• Played a vital role in transitioning legacy systems to a microservices architecture, significantly improving deployment frequency and system resilience. \n• Engaged in performance tuning and optimization of applications in **Python**, achieving increased throughput and reduced latency for cloud-based services.\n• Drove initiatives to improve overall code quality through rigorous code reviews, adherence to development standards, and promoting automated testing strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Utilized **Go** to develop and optimize microservices, ensuring high performance and scalability, with a focus on using **Kubernetes** for automated deployment and management of containerized applications.\n• Engineered and maintained complex **Python**-based pipelines, ensuring efficient data processing and model training utilizing tools like **vLLM** and **Qdrant**.\n• Employed **Nvidia H100** and **Nvidia B200** for enhanced computational power, facilitating tensor parallelism in machine learning workloads.\n• Designed and implemented CI/CD pipelines with frameworks such as **Azure DevOps** and **GitHub Actions**, enhancing development workflow efficiency by **30%**.\n• Spearheaded Agile methodology adoption within the team, leading to a **25%** increase in project delivery speed.\n• Documented system architecture and processes to maintain clear communication among team members, ensuring knowledge transfer and adherence to best practices.\n• Led the development and migration to a **Python** (FastAPI, Django, Flask) microservices-based backend architecture, improving scalability and performance while integrating services with SQL Server, PostgreSQL, and MongoDB for seamless data management.\n• Developed secure RESTful and gRPC APIs in **Python**, ensuring secure communication between internal banking mobile applications with real-time transaction updates.\n• Refactored legacy **.NET/VB.NET** systems into **Python** microservices, maintaining critical business functionality and compatibility with modern platforms.\n• Built dynamic frontends integrated with **Python** backends using **Angular**, **Vue**, **React**, and **Next.js**, leveraging **Redux/NgRx** for responsive user interfaces.\n• Created a real-time transaction monitoring dashboard powered by **Python** APIs with **Angular** UI and integrated with **Power BI** for advanced reporting.\n• Managed integrations with **MuleSoft** and **Python** services to streamline ACH transfers, credit card payments, and wire transfers, improving transaction efficiency.\n• Applied encryption, RBAC, OAuth 2.0, and JWT in **Python** services, ensuring robust data protection and compliance.\n• Optimized SQL Server, DynamoDB, and Redis queries accessed via **Python** services, ensuring high availability for transactional data.\n• Implemented messaging systems using **Kafka** and **RabbitMQ** with **Python** microservices to build an event-driven architecture capable of handling large-scale transactions.\n• Configured and managed **Azure Service Bus** with **Python** services for reliable message brokering, improving modularity.\n• Designed and implemented secure authentication in **Python** APIs using OAuth 2.0, OpenID Connect, and JWT.\n• Developed secure payment gateway integrations in **Python** supporting ACH transfers, ensuring PCI compliance.\n• Built serverless components in **Python** using **AWS Lambda** and **Azure Functions** for ETL pipelines, enhancing responsiveness.\n• Utilized the **ELK** stack (Elasticsearch, Logstash, Kibana) with **Python** services for centralized logging and monitoring.\n• Managed **Kubernetes** clusters to deploy **Python** microservices, enabling rolling updates and high availability.\n• Applied best practices in **Python** development, including automated unit testing with **PyTest** and integration testing with **Selenium** for reliability.\n• Designed integration solutions in **Python** with **MuleSoft** for secure financial data exchange.\n• Contributed to event-driven architectures in **Python** using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, improving performance and decoupling systems.\n• Integrated unit tests, static analysis, and CI/CD pipelines for automated quality assurance and continuous delivery."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Go** to develop scalable microservices with cloud-native architectures, ensuring robust performance during peak loads.\nImplemented **CI/CD** pipelines to streamline deployment processes, achieving **95%** deployment success rate through automation and version control.\nLeveraged **Kubernetes** for container orchestration, enhancing system scalability and reliability in production with **100%** uptime during traffic surges.\nDesigned and maintained extensive documentation to support the development and operational procedures of applications using **Python**, improving team onboarding time by **30%**.\nIntegrated **Qdrant** for vector search capabilities, optimizing search functions and recommendation systems within applications.\nEmployed **tensor parallelism** techniques to optimize model performance on **Nvidia H100** and **Nvidia B200** GPUs, reducing processing times by **20%**.\nFacilitated Agile development practices, enhancing team collaboration and project transparency while delivering features on time and within budget.\nEnhanced existing Python services with automated testing frameworks to ensure high code quality and reliability across all deployments.\nMastered complex configurations in **Kubernetes**, streamlining resource management and monitoring with tools like Prometheus and Grafana.\nConducted regular performance assessments, applying insights to optimize pipelines and improve overall system reliability and efficiency."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Go\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Qdrant\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile, documentation, pipeline, tensor parallelism, Nvidia H100, Nvidia B200",
  "apply_company": "Edgeless Systems"
}