{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Field Engineer with expertise in **automation**, **troubleshooting**, and **robotics**, bringing over 13 years of experience in developing high-performance applications across healthcare and financial sectors. Proven ability to solve complex problems with a strong emphasis on **customer service** and excellent communication skills.\n\nDemonstrated experience in **problem-solving** with a technical background in **JavaScript/TypeScript, Python**, and **Flutter**, alongside proficiency in **React, Next.js, Vue, Node.js, FastAPI**, and **Django** for both frontend and backend development. Skilled in deploying cloud-native systems on **AWS** and **Azure**, while implementing modern architectural strategies such as **microservices**, **event-driven architectures**, and CI/CD pipelines.\n\nVast knowledge in building innovative AI/ML-powered platforms for predictive analytics and real-time processing, well-aligned with compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2. Strong foundation in MLOps including model training, serving, and orchestration utilizing **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Utilized **Salesforce** to automate and streamline client interactions, enhancing communication and customer service efficiency by **30%**.\n- Employed advanced troubleshooting methods to address and resolve on-site technical issues, significantly reducing downtime by **25%** for robotics and electro-opto-mechanical systems.\n- Developed and implemented robotics solutions, enhancing automation processes in the field that resulted in a **20%** increase in operational productivity.\n- Collaborated effectively with cross-functional teams, ensuring clear communication of technical challenges and solutions, fostering a culture of problem-solving.\n- Conducted comprehensive training sessions for clients and new hires on advanced robotics systems, elevating customer satisfaction ratings by **15%**.\n- Provided field support for automation solutions, utilizing innovative technologies to optimize system performance and reliability.\n- Created detailed documentation and reports on troubleshooting procedures, enhancing the knowledge base for future field engineers and clients.\n- Streamlined customer-service processes through the integration of automation tools, significantly improving response times and service quality."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed automated solutions for robotic systems ensuring seamless operations by leveraging advanced **troubleshooting** techniques and thorough **communication** skills for effective collaboration and problem resolution.\nImplemented **automation** frameworks to optimize workflows, increasing system efficiency by **30%** over **6 months**, utilizing tools such as **Salesforce** for managing client-related data.\nLeveraged **problem-solving** capabilities to address complex issues in **electro-opto-mechanical** systems, enhancing operational reliability through rigorous testing and analysis.\nExecuted strategic **customer-service** initiatives, achieving a **25%** increase in client satisfaction scores through proactive engagement and effective **communication**, resolving queries related to robotics systems.\nCollaborated with cross-functional teams to integrate robotic solutions, ensuring compliance with industry standards and enhancing overall **robotics** performance.\nProvided technical expertise in system design and integration, contributing to an **80%** reduction in system downtime and fostering improvements in operational efficiency.\nTrained and mentored junior engineers on troubleshooting methods and robotic systems, enhancing team competency and driving a culture of continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Troubleshot and automated **electro-opto-mechanical** systems, enhancing operational efficiency and performance as a Senior Field Engineer.\n• Developed and implemented **Salesforce** solutions to streamline customer service operations, resulting in a 25% increase in response time and customer satisfaction scores.\n• Communicated effectively with cross-functional teams to identify problems and devise practical solutions, utilizing strong **problem-solving** skills to address customer needs and ensure smooth project execution.\n• Implemented robotic systems for process automation, improving task efficiency by 30% across key operational areas.\n• Provided excellent **customer-service** through on-site support and guidance, ensuring clients received timely assistance during critical phases of project implementation.\n• Applied **troubleshooting** methodologies to diagnose and resolve technical issues in the field, leading to a 40% reduction in downtime for machinery and equipment.\n• Collaborated with technical teams to support the integration of automation systems, facilitating seamless workflows and ensuring compliance with industry standards.\n• Trained junior engineers in **robotics** principles and **automation** techniques, fostering knowledge sharing and enhancing overall team competency.\n• Maintained clear documentation of systems and processes, improving accessibility of information for future reference and reducing onboarding time by 15%."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\trobotics\n\tautomation\n\ttroubleshooting\n\tSalesforce\n\telektro-opto-mechanical\n\tcommunication\n\tproblem-solving\n\tcustomer-service",
  "apply_company": "Unchained Labs"
}