{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Full Stack Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior Full Stack Software Engineer with 8 years of experience, I possess a strong command of **TypeScript**, **ReactJS**, **NodeJS**, and **NestJS** for developing high-performance solutions, including RESTful APIs and data-driven applications. I have effectively utilized **PostgreSQL** for database management and have hands-on experience with **AWS**, **Azure**, and **Google Cloud** while adhering to Agile methodologies and implementing robust DevOps practices.\nMy proficiency in **Git** ensures seamless version control, while my focus on clean code and problem-solving drives successful project outcomes. \nAdditionally, I have a proven track record of developing enterprise-grade applications that leverage **Apache Echarts** and **AG Grid** to enhance user experience. My soft skills in communication foster collaboration across teams, ultimately aligning technical goals with business objectives. My experience also extends to cloud deployment, where I ensure compliance with industry standards, adding value in sectors like healthcare and finance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Leveraged **TypeScript**, **Node.js**, and **ReactJS** to architect and develop scalable full-stack applications, adhering to Agile methodologies and delivering projects in **9** sprints annually.\n• Designed and implemented **RESTful APIs** for seamless data interaction between front-end and back-end, ensuring high performance with server-side rendering in **Next.js**.\n• Utilized **PostgreSQL** to create efficient database schemas for healthcare and financial platforms, achieving a **30%** improvement in query performance.\n• Contributed to DevOps practices by integrating CI/CD pipelines using **Git**, **AWS**, and **Azure**, which reduced deployment time by **50%**, ensuring consistent and reliable software delivery.\n• Implemented responsive user interfaces using **ReactJS** and **NestJS**, optimizing user experience for over **100,000** monthly active users.\n• Conducted code reviews and enforced **clean code** principles, fostering a collaborative and quality-driven engineering culture.\n• Collaborated cross-functionally with teams to integrate **Apache Echarts** for dynamic data visualization, enhancing data reporting capabilities and real-time decision making.\n• Employed **problem-solving** skills to address complex system challenges, resulting in a **40%** reduction in bug reports post-launch.\n• Maintained comprehensive documentation and communicated effectively with stakeholders, ensuring project alignment and clarity throughout the development lifecycle."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed and maintained scalable applications using **TypeScript**, **ReactJS** (version **18**), and **NodeJS** (with **NestJS** and **Koa.js**), enhancing system performance and maintainability.\n- Designed and implemented RESTful APIs, leveraging best practices in **clean code** and software architecture to facilitate seamless front-end and back-end integration.\n- Applied Agile methodologies to collaborate effectively with cross-functional teams, ensuring timely delivery of features and enhancements in a dynamic environment.\n- Utilized SQL databases such as **PostgreSQL** to optimize data management, performing complex queries to support high-volume transaction processing.\n- Integrated modern front-end libraries such as **Redux Toolkit** and **Tailwind CSS** for building responsive user interfaces tailored for financial dashboards and admin portals.\n- Led the development of real-time transaction monitoring solutions using **D3.js** and **Power BI Embedded**, providing operational insights for better decision-making.\n- Established a robust event-driven architecture by incorporating **Kafka**, **RabbitMQ**, and **Azure Service Bus**, achieving high efficiency in processing transactions and compliance workflows.\n- Built and orchestrated ETL pipelines with **Apache Airflow** and **Azure Data Factory**, facilitating both **batch** and **real-time** data ingestion from various sources, improving data availability by **30%**.\n- Implemented machine learning-based fraud detection mechanisms with **scikit-learn** and **XGBoost**, significantly reducing false positives by analyzing user behavior patterns in banking transactions.\n- Created predictive models for credit scoring, churn prediction, and transaction classification with **MLflow**, enhancing backend services for real-time business intelligence and decision-making.\n- Adopted DevOps practices to improve deployment efficiency and system reliability on cloud platforms like **AWS**, **Azure**, and **Google Cloud**, reducing deployment time by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **TypeScript**, **ReactJS**, **NodeJS**, and **NestJS** to design and optimize responsive web applications for a global e-commerce platform, achieving 99.9% uptime and ensuring low latency through efficient backend services.\nDeveloped and maintained **RESTful APIs** for key modules like checkout and order fulfillment, facilitating seamless integration with frontend applications and enhancing user experience across **9** different platforms.\nImplemented **PostgreSQL** for robust, scalable database management, ensuring data integrity and fast retrieval in high-traffic scenarios, processing **over 1 million** transactions with minimal downtime.\nUtilized **Agile methodologies** to streamline development processes, resulting in a **30%** increase in team productivity and faster feature delivery within **2-week** sprints.\nEffectively managed source code and version control using **Git**, ensuring collaborative code development and smooth deployment processes.\nApplied **DevOps practices** to automate deployment pipelines, significantly reducing deployment time by **40%** and enhancing the consistency of software releases.\nCreated and integrated data visualizations with **Apache Echarts** and **AG Grid** to present analytics and insights, facilitating informed decision-making for product strategies.\nDemonstrated strong **communication** and **problem-solving** skills while collaborating with cross-functional teams to address challenges and implement innovative solutions in real-time.\nMaintained high standards of **clean code** and software documentation, enhancing readability and facilitating easier onboarding of new team members."
    }
  ],
  "skills": "Programming Languages:\n\tTypeScript, Python, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, NodeJS, NestJS, Koa.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, ReactJS, Apache Echarts, AG Grid\n\n**API Technologies:**\n\tRESTful API\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Google Cloud\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD practices, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tAgile methodologies, Git, clean code, problem-solving, communication, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}