{
  "name": "Patryk Zaslawski",
  "role_name": "Python Developer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-driven Python Developer with 8+ years of proven expertise in software engineering. Proficient in **Python**, **Django**, **Postgres**, and **MongoDB**, delivering robust data-oriented applications with a focus on high performance and scalability. Skilled in utilizing **Docker** for containerization, ensuring seamless deployment across environments while maintaining system reliability. Experienced with **AWS** for cloud hosting and **Bitbucket Pipelines** for CI/CD, optimizing workflow efficiency. Knowledgeable in **Linux** environments and adept at implementing **multiprocessing** for improved application throughput. With a strong foundation in building modern applications and a keen understanding of industry best practices, I am committed to delivering solutions that drive business success.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Python Developer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Python** to design and develop efficient data-oriented applications, ensuring seamless performance and scalability in multi-threaded environments.\nDeveloped and maintained **Postgres** and **MongoDB** databases to support high availability and data integrity for various applications, monitoring performance metrics to achieve a 30% improvement in query efficiency.\nImplemented containerization using **Docker**, streamlining the deployment process and achieving a 50% reduction in setup time for development environments.\nCollaborated on a cross-functional team to enhance code quality through automated testing and CI/CD practices with **Bitbucket Pipelines**, ensuring reliable software releases and minimizing bugs by 40%.\nOptimized multiprocessor utilization in application workflows to improve computational efficiency by utilizing Python's built-in capabilities and libraries, ensuring responsiveness and enhanced user experience.\nConducted regular code reviews and implemented coding standards for **Python** projects, fostering a culture of quality and efficiency among a team of 10+ engineers.\nIntegrated complex backend functionalities with dynamic front-end technologies such as React, contributing to improved responsiveness and user engagement metrics.\nMaintained and upgraded existing applications, ensuring compatibility with the latest features of **AWS** and **Docker**, while implementing new features requested by stakeholders, completing enhancements 25% faster than previous cycles.\nEmbraced agile methodologies to deliver high-quality software in 2-week sprint cycles, maintaining consistent feedback loops and adapting to changes effectively.\nDocumented system architecture and development practices for knowledge sharing and onboarding of new team members, resulting in a quicker onboarding process, reducing ramp-up time by 20%."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained enterprise-grade applications using **Python** (including **Django**, **Flask**), demonstrating expertise in **Docker** for containerization and deployment across environments.\n• Engineered solutions leveraging **PostgreSQL** and **MongoDB** to optimize data persistence and retrieval, ensuring performance enhancements exceeding **30%**.\n• Implemented multiprocessing strategies in **Python** to enhance application responsiveness, achieving throughput improvements by **25%**.\n• Designed and executed CI/CD pipelines with **Bitbucket Pipelines** for streamlined deployment processes, reducing deployment times by **40%**.\n• Collaborated on data-oriented applications, architecting solutions that efficiently handle large datasets and improve data processing times.\n• Managed Linux environments to ensure system stability and performance, contributing to operational uptimes of over **99%**.\n• Integrated AWS services to enhance scalability and storage capabilities, improving application availability and operational flexibility.\n• Developed robust unit tests and automated integration testing frameworks for reliable, maintainable software delivery practices.\n• Leveraged modern software development methodologies, ensuring agile practices and continuous improvement within cross-functional teams."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Python** (Django) to design and optimize backend services for an e-commerce platform, achieving **30%** improvement in scalability and performance across checkout and order fulfillment modules.\nManaged containerized applications using **Docker**, enhancing deployment efficiency and enabling smooth operations across **5** different environments.\nLeveraged **PostgreSQL** and **MongoDB** for database management, optimizing queries to improve performance by **25%** and reducing latency in high-volume transaction handling.\nAutomated CI/CD processes with **Bitbucket Pipelines**, ensuring consistent delivery of features and reducing deployment errors by **15%**.\nImplemented data-oriented applications using **Linux** environments, ensuring high availability and efficient resource management.\nDeveloped robust RESTful APIs in **Python** for seamless integration with frontend interfaces, catering to real-time customer interactions with **99.9%** uptime.\nApplied **multiprocessing** strategies within **Python** to enhance application performance for data-intensive operations, significantly improving response times.\nConducted performance testing using Apache JMeter, diagnosing bottlenecks and increasing system throughput to handle peak loads of **2,000+** transactions per hour.\nImplemented caching solutions with **Redis** in Python services, cutting database load and improving response times for frequently accessed resources by **40%**.\nDesigned and developed mobile-friendly websites with **React** and **Next.js**, integrated with **Python** APIs, ensuring cross-device accessibility and SEO optimization.\nExecuted comprehensive unit and integration testing in **Python** using **PyTest**, enhancing code reliability and maintaining a test coverage rate of **90%**.\nMigrated legacy ASP.NET applications into Python microservices, ensuring modern standards while preserving critical business workflows effectively."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tDjango\n\tFastAPI\n\tFlask\n\tSpring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16)\n\tReact (15–18)\n\tNext.js\n\tVue.js (2/3)\n\tBlazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tBitbucket Pipelines\n\n**Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL)\n\tLinux\n\n**Other:**\n\tSQLAlchemy\n\tPydantic\n\tCelery\n\tKeycloak (OIDC, RBAC)\n\tJWT\n\tOAuth2\n\tLet’s Encrypt\n\tNginx\n\tCertbot\n\tData-oriented applications\n\tMultiprocessing"
}