{
  "name": "Patryk Zaslawski",
  "role_name": "Go Developer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-driven Go Developer with 8+ years of experience in software engineering, specializing in high-performance application development. Proficient in **Go**, with a solid understanding of **PostgreSQL** for database optimization, **Git** for version control, and **CI/CD** practices to ensure streamlined development workflows. Experienced in designing microservices architecture and utilizing **Docker** for containerization, alongside cloud platforms such as **AWS**, **GCP**, and **Azure**. Strong advocate of agile methodologies including **Scrum** and **Kanban**, with a focus on **Test Automation** and **Performance Optimization**. My background includes delivering scalable solutions across e-commerce, finance, and healthcare sectors, leveraging my extensive skills in Python frameworks like **FastAPI, Django, Flask, SQLAlchemy**, and frontend technologies such as **Angular, Vue, React,** and **Next.js**.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Go Developer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Designed and implemented **microservices** architecture using **Go**, enhancing scalability and performance for healthcare platforms with a documented increase in response times by **30%**.\n• Developed CI/CD pipelines utilizing **Git** and **Docker** for seamless deployment processes, achieving a **50%** reduction in release times.\n• Automated testing and performance optimization in **Go**, ensuring reliable deliveries with a **95%** test coverage rate through tools like **HTMX**.\n• Led cloud infrastructure provisioning and management on **AWS** and **Azure**, significantly improving system uptime to **99.9%**.\n• Collaborated in a **Scrum** environment with cross-functional teams, enhancing productivity by implementing **Kanban** for tracking workflow efficiencies.\n• Utilized **PostgreSQL** for efficient data storage and retrieval, optimizing database queries and achieving improved latency on large datasets by **40%**.\n• Mentored colleagues in adopting best practices for test automation in **Go**, contributing to a culture of continuous improvement and software quality.\n• Integrated third-party APIs with **Go** based services, expanding application functionalities while ensuring robust error handling and performance measures.\n• Championed container orchestration using **Docker**, facilitating smooth scaling operations for healthcare applications during peak usage periods.\n• Actively participated in code reviews, enhancing team coding standards and fostering collaborative learning among junior developers."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Developed microservices-based architecture using **Go**, ensuring scalability and maintainability of systems aligned with industry best practices.\n- Implemented CI/CD pipelines with **Git**, optimizing the deployment process for improved software delivery efficiency by **30%**.\n- Leveraged **Docker** for containerization of applications, facilitating consistent deployment across environments and reducing configuration issues by **25%**.\n- Utilized **PostgreSQL** for data management, ensuring efficient querying and high availability, maintaining performance under peak loads.\n- Applied performance optimization techniques to enhance application responsiveness, achieving a **40%** reduction in response time for critical services.\n- Collaborated in an Agile environment, employing **Scrum** and **Kanban** methodologies to streamline project management and enhance team productivity.\n- Developed extensive test automation practices to ensure code reliability and quality, integrating tools such as **Ginkgo** and **Gomega** for unit testing in **Go**.\n- Designed and built RESTful API services in **Go**, ensuring seamless integration with frontend applications and third-party systems.\n- Integrated **AWS** and **GCP** cloud services to enhance system architecture and leverage cloud capabilities for storage and scalability.\n- Participated in code reviews and provided mentorship to junior developers, fostering a culture of continuous learning and code quality improvement.\n- Managed application deployments using **Kubernetes**, facilitating rolling updates and maintaining high availability across multiple microservices.\n- Developed performance dashboards to monitor application metrics, significantly improving troubleshooting time and service reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented microservices architecture using **Go** to enhance modularity and scalability in application development.\nLeveraged **PostgreSQL** for database management, optimizing database queries to improve performance by **30%**.\nDeveloped, tested, and deployed applications using **Docker**, ensuring consistent and fast deployments across various environments.\nAutomated CI/CD pipelines with **Git** and supported deployment to **AWS**, **GCP**, and **Azure** to enhance development efficiency and reduce lead time by **40%**.\nEmployed **Test Automation** strategies to ensure high code quality, reducing bugs in production by **25%** through comprehensive testing practices.\nWorked in **Scrum** and **Kanban** methodologies to maintain productivity and align project timelines with team goals while performing optimally under tight deadlines.\nUtilized **HTMX** for enhancing user interactions in web applications, ensuring a responsive experience for end-users.\nParticipated in performance optimization initiatives, identifying bottlenecks using profiling tools and implementing solutions that resulted in improved response times by **50%**.\nDesigned and executed unit tests and integration tests ensuring robust application performance and reliability in production.\nCollaborated with cross-functional teams to integrate applications, focusing on smooth communication and functionality across the board.\nLed initiatives to modernize legacy systems while transitioning them to a microservices architecture, resulting in improved maintainability and scalability."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Go\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor, HTMX\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Microservices, Test Automation, Performance Optimization, Scrum, Kanban"
}