{
  "name": "Tomasz Lee",
  "role_name": "Senior Quality Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Senior Quality Engineer with a strong background in software testing and development, leveraging expertise in tools such as **Git**, **Pytest**, and **Appium**. Proficient in **Python** and **Shell scripting** with a solid understanding of **POSIX** systems and **embedded systems**, bringing 9+ years of experience in delivering high-quality software solutions. Familiar with **Android**, **QNX**, and automotive technologies such as **CAN** and **Ethernet**. Demonstrated analytical skills and problem-solving abilities that enhance product quality, along with effective communication and collaboration skills that drive team success in fast-paced environments.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Quality Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Performed comprehensive **software testing** across multiple platforms, ensuring high-quality delivery and compliance with industry standards.\nUtilized **Python** for automating test scripts and analysis, improving testing efficiency by **30%**.\nEmployed **Shell scripting** for the automation of routine tasks, reducing manual intervention and increasing productivity.\nApplied **QNX** and **embedded systems** knowledge to effectively test automotive software.\nCollaborated with development teams using **Git** for version control, resulting in streamlined workflows and enhanced team communication.\nLeveraged analytical skills to troubleshoot and resolve complex systems issues, enhancing overall product reliability.\nDesigned and executed test cases in **Appium** for mobile applications on **Android**, ensuring full functionality and performance.\nImplemented **HIL** (Hardware-in-the-Loop) testing strategies to validate embedded system interfaces and response times.\nEngaged in continuous communication with cross-functional teams, fostering collaboration and enhancing team synergy.\nDeveloped testing frameworks using **Pytest**, contributing to improved modular test design and reusability.\nUtilized **CAN** and **Ethernet** protocols in automotive systems testing, ensuring compatibility and adherence to standards.\nProvided detailed reporting and documentation of testing results, contributing to project transparency and stakeholder engagement."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented robust **software testing** strategies using **Python** and **Pytest**, ensuring a minimum of 95% test coverage across all new codebases.\nUtilized **Shell scripting** to automate testing workflows, decreasing manual testing time by 40%.\nCollaborated effectively with cross-functional teams to define quality standards and development timelines, leading to a 20% reduction in project timelines.\nConducted comprehensive system validation for **embedded systems** in the **automotive** domain, streamlining the testing process for **Android** applications running on **QNX**.\nUtilized **Git** for version control, managing code repositories for better team collaboration and accountability.\nEmployed **HIL (Hardware-in-the-Loop)** testing techniques to simulate real-world scenarios, identifying critical issues early in the development process.\nTested and validated **CAN** and **Ethernet** communication protocols, ensuring system reliability and compliance with industry standards.\nDeveloped automation scripts for mobile app testing using **Appium**, enhancing automated test coverage by 30%.\nExhibited strong **analytical skills** and **problem-solving** abilities while troubleshooting complex issues during testing phases.\nConducted training and mentorship sessions for junior engineers, fostering continuous skill development within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **Shell scripting** to automate testing processes, enhancing software testing efficiency by **30%**.\nEmployed **Git** for version control and collaborative code management, ensuring seamless integration within the development lifecycle.\nConducted thorough software testing for embedded systems, focusing on **automotive** applications to guarantee compliance with industry standards.\nDeveloped test scripts using **Pytest** and **Appium** for automated testing of mobile applications, improving test coverage by **25%**.\nAnalyzed and debugged system issues in **QNX** and **Android** environments to provide effective problem-solving solutions during the testing phase.\nEngaged in effective collaboration with cross-functional teams to enhance communication and alignment on project requirements.\nParticipated in HIL testing to validate system performance under simulated conditions, ensuring optimal functionality of automotive components.\nWorked closely with POSIX compliance to manage system resources, improving software reliability and stability in embedded systems.\nLeveraged analytical skills to identify potential bottlenecks within existing applications, recommending actionable improvements.\nAuthored detailed technical documentation and test plans to facilitate knowledge sharing and enhance team efficiency."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tEmbedded systems\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Analytical Skills, Problem-Solving, Communication, Collaboration, Software Testing, Shell Scripting, POSIX, Android, QNX, Pytest, Appium, HIL, Automotive, CAN, Ethernet",
  "apply_company": "Unikie"
}