{
  "name": "Patryk Zaslawski",
  "role_name": "Cloud Dev/ Ops Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a skilled Cloud Dev/Ops Engineer with 8+ years of experience in software engineering, I specialize in leveraging **AWS**, **Azure**, **Terraform**, and **Kubernetes** to design and implement robust cloud solutions. My expertise in **Docker**, CI/CD methodologies, and automation tools like **Azure DevOps**, **Git Actions**, and **Bamboo** enables streamlined deployment and continuous integration processes. Proficient in scripting with **PowerShell** and engaging in **ETL/ELT processes**, I possess solid analytical and troubleshooting skills that ensure efficient system performance and reliability. My background in **Python** (FastAPI, Django, Flask, SQLAlchemy) and familiarity with database technologies such as **PostgreSQL**, **MySQL**, and **MongoDB** further complement my cloud capabilities, allowing me to build secure applications tailored to business needs. With a keen attention to detail and the ability to multitask, I consistently deliver innovative and effective solutions in dynamic environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Cloud Dev/ Ops Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **AWS** and **Azure** services to design and maintain cloud infrastructure for scalable applications, ensuring optimal performance and cost-efficiency.\nImplemented **Terraform** for infrastructure as code, automating the provisioning of both **Kubernetes** clusters and **Docker** containers, reducing deployment times by **30%**.\nDeveloped Python-based CI/CD pipelines using **GitHub Actions** and **Azure DevOps**, ensuring seamless integration and delivery of applications with automated testing and security scans.\nLed migration efforts to **Kubernetes**, orchestrating **Docker** containers and improving application scalability and resilience by enabling **high availability**.\nConfigured and maintained secure, efficient **Python** microservices deployed via CI/CD, improving deployment frequency by **50%** through automation and best practices.\nCreated and optimized data workflows using **ETL/ELT processes**, interfacing with **Snowflake** for data analysis and compliance across **healthcare** and **financial** sectors.\nApplied **analytical skills** to streamline operational processes, achieving a **25%** reduction in troubleshooting times through improved monitoring with **DataDog** and **OpenSearch**.\nUtilized **PowerShell** and **scripting** for automation of routine tasks, enhancing operational efficiency and reducing manual effort by **40%**.\nMaintained high attention to detail to ensure integration of industry-standard compliance measures (e.g., SOC 2, ISO 27001) into all cloud services and applications.\nCollaborated with cross-functional teams using **JIRA** for project management, ensuring tasks were tracked, prioritized, and completed efficiently while fostering effective communication.\nDemonstrated multitasking abilities by simultaneously managing multiple deployments, supporting incident management processes, and maintaining documentation for cloud infrastructure."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained **cloud infrastructure** using **AWS**, **Azure**, and **Terraform** to automate deployments, ensuring high availability and efficient resource management.\n• Led the deployment of **Kubernetes** clusters to manage **microservices**, enabling rolling updates and auto-scaling features, ultimately enhancing system reliability.\n• Implemented **CI/CD** pipelines using **Azure DevOps** and **Git Actions** to facilitate continuous integration and delivery, improving deployment speed by **30%**.\n• Designed and developed serverless components using **AWS Lambda** and **Azure Functions** for **ETL** processes, reducing infrastructure overhead by **25%**.\n• Utilized **Python** scripting for infrastructure automation and application deployment, leading to a reduction in manual intervention by **40%**.\n• Collaborated on the optimization of database queries across various systems, including **Snowflake**, improving data retrieval times by **20%**.\n• Monitored system performance and health using **DataDog**, leveraging analytical skills to swiftly troubleshoot issues and improve overall system stability.\n• Integrated logging and observability solutions using the **ELK stack** (Elasticsearch, Logstash, Kibana) for centralized management and performance tracking.\n• Ensured robust security measures, applying best practices for data protection and compliance with regulations in cloud deployments, including secure automation with **PowerShell**.\n• Maintained documentation within **JIRA** for project tracking and version control, ensuring clarity and alignment within the team.\n• Managed and scaled **Docker** containers for applications, leading to better resource utilization and operational efficiency.\n• Automated monitoring and alerting mechanisms with **LogicMonitor**, enhancing the proactive management of system health.\n• Improved version management and deployment processes using **CloudFormation** and **Octopus Deploy**, boosting efficiency by **15%**.\n• Applied attention to detail and organized multitasking to prioritize multiple cloud migration tasks and operational responsibilities effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **AWS** and **Azure** cloud services to design and deploy scalable applications, ensuring high availability and resilient infrastructure.\nImplemented **Docker** and **Kubernetes** for container orchestration and management, streamlining deployments and improving CI/CD processes.\nAutomated infrastructure provisioning using **Terraform** and **CloudFormation**, reducing setup time by **30%** and enhancing deployment consistency.\nLeveraged **Azure DevOps**, **Git Actions**, and **JIRA** for continuous integration and continuous deployment, achieving a **40%** increase in deployment frequency.\nDeveloped scripts in **PowerShell** to automate routine tasks and enhance operational efficiency, ensuring smooth workflow management and reducing manual errors.\nConducted performance monitoring and troubleshooting using **DataDog**, **OpenSearch**, and **LogicMonitor**, effectively enhancing system health visibility and incident response times.\nImplemented efficient ETL/ELT processes for data migration and transformation, leveraging **Snowflake** to optimize data storage and retrieval, resulting in a **25%** reduction in query times.\nDemonstrated strong analytical skills to analyze system performance metrics, implementing optimization strategies that enhanced system efficiency.\nExecuted comprehensive networking setups and storage configurations to maintain a robust cloud infrastructure, adhering to industry best practices.\nMultitasked effectively between multiple projects and tasks, ensuring that deadlines were consistently met without compromising quality or detail. \nDesigned cloud-native applications, improving deployment architecture by utilizing **CI/CD** pipelines, ensuring efficient and reliable release cycles for new features and updates.\nConducted thorough testing and validation procedures, applying attention to detail to ensure all services were functioning optimally before production release."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Cloud & Infrastructure:**\n\tTerraform, Kubernetes, Docker, GitHub Actions, GitLab CI/CD, Azure DevOps, CloudFormation\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Snowflake\n\n**DevOps:**\n\tCI/CD, PowerShell, Git, JIRA, DataDog, OpenSearch, LogicMonitor, Octopus, Bamboo, Git Actions, Networking, Storage\n\n**Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Scripting, Database concepts, ETL/ELT processes, Analytical skills, Troubleshooting skills, Attention to detail, Multitasking"
}