{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior QA Engineer with over 13 years of experience in manual and automation testing, dedicated to delivering high-quality web and mobile applications. Proficient in managing the Software Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC) using tools such as **TestRail** and **Jira**. Expertise in **A/B Testing**, bug reporting, and test case management, ensuring robust quality assurance of applications.\nSkilled in collaborating with development teams utilizing **Git** for version control and **SQL** for database testing. My background includes working closely with APIs to validate end-to-end functionalities.\nAdditionally, I bring a strong foundation in full stack development with hands-on experience in **JavaScript/TypeScript**, **Python**, and frameworks such as **React**, **Node.js**, and **Django**, further enhancing my ability to identify and troubleshoot issues effectively in complex applications.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted **manual testing** of web and mobile applications to ensure high-quality deliverables that align with project specifications and user requirements.\nEmployed **test management** tools like **TestRail** and **Jira** for meticulous tracking of test cases, reporting bugs, and documenting testing progress across a variety of projects.\nFollowed a systematic Software Development Life Cycle (**SDLC**) and Software Testing Life Cycle (**STLC**), applying defined methodologies to maintain testing consistency with project timelines.\nDesigned and executed A/B testing strategies to substantiate design decisions and enhance user experiences, resulting in a **25%** increase in user engagement for web applications.\nExecuted **automation testing** processes using **Git** for version control, facilitating faster feedback cycles and seamless integration with existing CI/CD workflows.\nPrepared SQL scripts for data validation during testing, ensuring data integrity and correctness across database systems including **PostgreSQL** and **MongoDB**.\nReported and tracked defects diligently, prioritizing issues using a data-driven approach, which reduced the defect resolution time by **30%** on average.\nCollaborated with development teams to ensure comprehensive API testing for robust and scalable applications, enhancing system reliability and performance by **15%**.\nLeveraged integration of testing tools (**Cypress**, **Postman**, **Jest**) to create robust test suites that significantly improved test coverage and reduced manual testing efforts by **40%**.\nParticipated in regular Agile ceremonies, fostering clear communication among stakeholders to align on project goals and expedite delivery timelines, ultimately enhancing team efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Performed comprehensive **manual testing** for **web applications** and **mobile applications**, ensuring adherence to quality standards and user requirements across multiple projects.\nUtilized **TestRail** for test case management and tracking, facilitating clear visibility into testing progress and results.\nExecuted **bug reporting** and root cause analysis using **Jira**, collaborating with cross-functional teams to prioritize and resolve defects efficiently, achieving a **20% reduction** in bug turnaround time.\nParticipated in all phases of the **SDLC** and **STLC**, establishing best practices for testing processes and contributing to continuous improvement initiatives, which enhanced overall software quality.\nConducted **A/B testing** to validate new features and user experiences, leveraging data analytics to inform product decisions and optimize performance, resulting in a **15% increase** in user engagement.\nEngaged in proactive **API testing** to ensure seamless integration and functionality across services, employing tools such as **Postman** and **Swagger**.\nImplemented **automation testing** strategies using **Selenium** and **Cypress**, driving efficiency in regression testing processes and reducing test execution time by **30%**.\nCollaborated closely with developers and product managers using **Git** for version control, supporting effective code reviews and integration of quality feedback throughout the development lifecycle.\nAnalyzed and optimized **SQL** queries to validate data integrity and accuracy, ensuring that the applications met the necessary compliance and performance standards."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted thorough **manual testing** for web and mobile applications, identifying and reporting bugs effectively using **Jira** and **TestRail** to ensure high-quality deliverables.\nParticipated in all phases of the **SDLC** and **STLC**, collaborating with cross-functional teams to understand project requirements and contribute to seamless project execution, significantly enhancing overall project efficiency.\nExecuted **A/B testing** frameworks to evaluate user experience and UI changes, utilizing insights to recommend adjustments and maintain optimal product performance.\nDeveloped and maintained test plans and cases, ensuring comprehensive coverage of functional and non-functional requirements in applications, leading to a **30% reduction** in critical bugs before production release.\nLeveraged **SQL** skills for backend data validation, ensuring data integrity across databases by querying and verifying expected outcomes against actual results, contributing to data-driven quality strategies.\nCollaborated closely with development teams to leverage APIs for automated QA processes, ensuring robust integration testing across different components of applications.\nImplemented version control using **Git** to manage test scripts and automation frameworks, promoting collaboration and preventing code conflicts in the test suite development.\nParticipated in QA meetings to discuss project progress and potential blockers, fostering alignment with stakeholders and enhancing the testing process effectiveness through **feedback loops**."
    }
  ],
  "skills": " **Programming Languages:**  \n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular  \n\n **Backend Frameworks:**  \n\tFastAPI, Flask, Django  \n\n **Frontend Frameworks:**  \n\tReact, Vue, Angular  \n\n **API Technologies:**  \n\tAPI  \n\n **Serverless and Cloud Functions:**  \n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database  \n\n **Databases:**  \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL  \n\n **DevOps:**  \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose  \n\n **Cloud & Infrastructure:**  \n\tAWS, Azure  \n\n **Other:**  \n\tManual Testing, Web Applications, Mobile Applications, TestRail, Jira, SDLC, STLC, Bug Reporting, A/B Testing, Git, Automation, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "OBRIO"
}