{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Software Engineer with over 10 years of experience in delivering high-performance, cloud-native software solutions. Expertise in **C#**, **SaaS**, **DevOps**, **CI/CD**, **Agile** methodologies, and **Observability** using tools like **New Relic**, **Splunk**, and **GitHub Actions**. Strong background in implementing **Telemetry** systems for enhanced performance monitoring and troubleshooting. Proven ability to collaborate effectively through **Scrum** practices, ensuring quality through **Code Reviews**, **Unit Testing**, and adherence to **SOLID** principles and **OOP**. Experienced in leading technical teams and providing mentorship by offering **Technical Guidance** and **Coaching**.\n\nAdditionally, skilled in modern technologies including **JavaScript/TypeScript**, **Python**, and **Flutter** with hands-on proficiency across the full stack using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Demonstrated history in developing enterprise platforms that integrate AI/ML capabilities, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow** for MLOps. Committed to building secure, maintainable solutions that meet compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2, all while driving real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tImplemented enterprise-level **DevOps** pipelines using **GitHub Actions** and **Azure DevOps**, ensuring CI/CD practices for both web and API services, achieving a 30% reduction in deployment time.\n•\tCollaborated in an **Agile** environment, participating in Scrum ceremonies and performing **code reviews**, fostering team collaboration and continuous improvement.\n•\tProvided technical guidance and coaching to junior developers in **OOP** and **SOLID** principles, improving code quality and maintainability.\n•\tDesigned scalable SaaS applications using **C#**, delivering robust solutions that enhanced client satisfaction scores by 25%.\n•\tUtilized **observability** and **telemetry** tools, such as **New Relic** and **Splunk**, for monitoring application performance and troubleshooting, reducing incident response time by 40%.\n•\tEstablished and enforced **unit testing** protocols across the codebase using testing frameworks like **Jest** and **PyTest**, increasing test coverage to 85%.\n•\tApplied **debugging** and **troubleshooting** techniques hand-in-hand with the development team to effectively resolve critical blockers, enhancing team productivity.\n•\tFacilitated collaboration with cross-functional teams to integrate **AI** features into applications, enhancing user interaction and insights.\n•\tLed initiatives in implementing observability features, enhancing application performance tracking and operational KPIs, contributing to overall service reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented **DevOps** practices and CI/CD processes using **GitHub Actions** to streamline application deployment and ensure continuous integration for all financial platforms.\nApplied Agile methodologies, collaborating in Scrum teams to prioritize work items and deliver features iteratively, enhancing response time to stakeholder feedback and project needs.\nConducted thorough **unit testing** and debugging sessions to ensure code quality, adopting **SOLID** principles and **OOP** practices in all development efforts, which led to a 30% reduction in bugs reported post-launch.\nProvided **technical guidance** and coaching to junior developers on best practices in software design and development, promoting a culture of learning and collaboration across the engineering team.\nEstablished observability in the production environment using **New Relic**, **Splunk**, and telemetry tools to monitor application performance and transaction data for improved incident response times.\nEnhanced system reliability and uptime by integrating **LaunchDarkly** for feature flagging, enabling safe experimentation in production and allowing for controlled rollouts.\nFacilitated code reviews that fostered team collaboration and knowledge sharing, improving overall team proficiency and adherence to coding standards.\nLed efforts in troubleshooting and resolving critical application issues, leveraging tools such as **Telemetry** to diagnose and address performance bottlenecks proactively.\nDrove initiatives for building scalable **SaaS** solutions by modernizing legacy systems and ensuring compatibility with existing infrastructure for at least **5 major releases** per year."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **C#** in developing scalable and robust SaaS applications, improving service efficiency by **30%** across teams.\nImplemented CI/CD pipelines using **GitHub Actions** to automate deployment processes, increasing deployment frequency by **15%** while ensuring high-quality releases.\nProvided technical guidance and coaching to junior developers, enhancing the team's technical abilities and improving collaboration within an **Agile** framework.\nEnsured observability and telemetry across applications by utilizing **New Relic** and **Splunk**, optimizing performance monitoring and troubleshooting processes, leading to incident resolution times reduced by **20%**.\nConducted thorough code reviews and unit testing to maintain high code quality and adherence to **OOP** and **SOLID** principles, minimizing bugs and enhancing maintainability.\nExecuted feature deployments and controlled rollout strategies with **LaunchDarkly**, allowing for effective A/B testing and risk mitigation during platform updates.\nActively participated in **Scrum** ceremonies, fostering a collaborative environment that contributed to achieving project milestones ahead of schedule by **10%**.\nApplied debugging and troubleshooting expertise to quickly identify and resolve technical challenges, supporting the team in overcoming obstacles and meeting deadlines.\nPromoted a culture of continuous improvement by encouraging best practices in software development and facilitating knowledge sharing among teams."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, C#\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Agile, Observability, Telemetry, LaunchDarkly, New Relic, Splunk, OOP, SOLID, Scrum, Code Reviews, Unit Testing, Debugging, Troubleshooting, Technical Guidance, Coaching, Collaboration",
  "apply_company": "Relativity"
}