{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Automation Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As an experienced Automation Engineer with a strong focus on **Python**, **PowerShell**, and **Bash**, I bring 8 years of expertise in automating complex Microsoft infrastructure environments. My proficiency in managing **Microsoft 365**, **Active Directory**, and **Windows Server** equips me to streamline operations and enhance system performance. I am well-versed in **Git** for version control and utilize tools such as **FreshService** and **ServiceNow** for effective service management. Additionally, I leverage **Azure** cloud services along with **Ansible**, **Terraform**, and **DSC** to create robust automation solutions that boost operational efficiency.\n\nMy experience extends to developing full-stack solutions using **JavaScript**, **TypeScript**, **Flutter**, as well as frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have successfully integrated AI/ML capabilities into enterprise-grade platforms, utilizing predictive analytics and real-time data processing. With a solid foundation in microservices architecture and CI/CD automation, I ensure that applications are not only high-performing but also comply with industry standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Automation Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented and managed automation scripts using **PowerShell**, **Python**, and **Bash** to streamline processes across Microsoft infrastructure, ensuring efficient and consistent deployment.\nDeveloped expertise in **Active Directory** and **Microsoft 365** to manage user access and implement security measures across organizational systems.\nDesigned and configured automated workflows using **Ansible** and **Terraform** for infrastructure provisioning and management, achieving a **40%** reduction in deployment times.\nOptimized **Windows Server** setups and configurations to enhance system performance, resulting in a **15%** increase in overall system reliability.\nUtilized **Git** for version control to maintain robustness of scripts and ensure smooth collaboration within the team, applying best practices in source code management.\nManaged service requests and incidents through **FreshService** and **ServiceNow**, improving response time by **30%** and enhancing user satisfaction with IT services.\nCollaborated with cross-functional teams to analyze and improve automation processes, achieving a **25%** improvement in task completion rates.\nCreated and maintained detailed documentation of automated systems and processes to support knowledge sharing and future troubleshooting activities.\nLeveraged Azure services to create cloud-based automation solutions that enhanced flexibility and scalability for IT operations, leading to better resource utilization.\nConducted training sessions for team members on automation tools and practices, fostering a culture of continuous improvement and technological advancement within the organization."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **PowerShell** and **Bash** scripting to automate deployment processes, enhancing operational efficiency by **30%** across multiple Microsoft infrastructure environments, including **Windows Server** and **Microsoft 365**.\nDeveloped automation scripts for Active Directory management, ensuring user provisioning and de-provisioning processes are executed within **2** minutes, effectively reducing manual administration burdens.\nImplemented CI/CD pipelines using **Git** and integrated with **Azure DevOps**, resulting in a **50%** reduction in deployment times and improving release frequency.\nConfigured infrastructure as code using **Terraform** and **Ansible**, enabling consistent and replicable environments across development and production, achieving compliance with internal standards in **75%** of deployments.\nLeveraged **ServiceNow** and **FreshService** for incident management automation, resolving **90%** of tickets without human intervention, streamlining support workflows.\nDeveloped and maintained automated monitoring scripts across cloud services, enabling proactive identification and resolution of issues before impact on users, decreasing downtime by **40%**.\nEnhanced security posture by automating patches and updates in the **Microsoft infrastructure**, ensuring **100%** compliance with security policies and reducing vulnerabilities significantly."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Automated processes using **PowerShell** and **Bash** scripts, resulting in a **30%** reduction in manual effort within IT operations.\nDeveloped and implemented automation solutions for **Microsoft infrastructure**, improving deployment efficiency by **40%** through the use of **Ansible** and **Terraform**.\nManaged user identity and access management leveraging **Active Directory** and integrated solutions with **Microsoft 365**, ensuring seamless user experience and security compliance across applications.\nAdministered **Windows Server** environments, applying **Git** for version control and collaboration on automation scripts, leading to improved team productivity by **25%**.\nUtilized **Azure** cloud services to deploy automated monitoring solutions, integrating tools like **FreshService** and **ServiceNow** to streamline incident response workflows and reduce mean time to resolution.\nCollaborated with cross-functional teams to develop automation frameworks that enhance system reliability and performance monitoring across diverse environments.\nImplemented Desired State Configuration (**DSC**) for consistent server configuration management, resulting in a decrease of configuration drift issues by **45%** across all managed servers.\nProvided training and support for automation tools and best practices, fostering a culture of automation within the IT team and enabling quicker adaptation to changes in infrastructure requirements."
    }
  ],
  "skills": "Programming Languages:\n\tPython, Bash, PowerShell\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Git, Ansible, Terraform, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tMicrosoft infrastructure, Windows Server, Active Directory, Microsoft 365\n\n**Other:**\n\tFreshService, ServiceNow, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot"
}