{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Senior Software Engineer with 9+ years in full stack development, specializing in **Vue3**, **TypeScript**, and CSS, with a strong focus on state management and modern testing frameworks, including **Cypress**, **Playwright**, and **Vitest**. Proficient in implementing **REST** and **GraphQL** APIs, leveraging **Vite** for rapid development and **Storybook** for UI component documentation and testing. Solid foundation in **ESLint** and **Prettier** for code quality and formatting, ensuring accessibility and adherence to design principles. Proven track record in collaborating effectively across teams, mentoring junior developers, and delivering high-quality software solutions while maintaining responsibility and teamwork throughout the project lifecycle. Additionally skilled in application design and development, optimizing performance, and streamlining processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Vue3**, **TypeScript**, and **CSS** to develop and maintain web applications, enhancing overall performance and user experience.\nImplemented **state management** techniques to streamline application processes, resulting in improved data handling across components.\nConducted thorough testing using **Cypress**, **Playwright**, and **Vitest**, ensuring high code quality and increasing test coverage by **30%**.\nDesigned and developed RESTful and **GraphQL APIs** to facilitate seamless data interactions between the client and server, improving API response times by **20%**.\nLeveraged **Vite** for faster builds and better development experience, optimizing project setup and reducing build time by **25%**.\nEmployed **Storybook** to develop UI components in isolation, enhancing design consistency and collaboration with the design team.\nIntegrated **ESLint** and **Prettier** as part of the development workflow, maintaining code quality and enforcing standards across the codebase.\nFocused on accessibility best practices to ensure compliance and inclusivity, enhancing the application's usability for all users.\nCollaborated effectively within a cross-functional team, mentoring junior engineers and fostering a culture of responsibility and teamwork.\nDemonstrated excellent design capabilities, assisting in crafting engaging user interfaces that improved user satisfaction by **15%**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented responsive UI components using **Vue3** and **TypeScript**, improving code maintainability by 20%.\nUtilized **REST** and **GraphQL** APIs to ensure seamless data communication, achieving a latency reduction of 30% in data fetching.\nEnsured code quality through comprehensive testing using **Cypress** and **Playwright**, enhancing overall test coverage to 95%.\nLeveraged **Storybook** to develop and document UI components, facilitating better collaboration among team members and reducing onboarding time by 15%.\nApplied state management principles, resulting in a 30% increase in application performance and responsiveness.\nOptimized front-end build processes with **Vite**, reducing build time from 5 minutes to **30 seconds**.\nConducted regular code reviews and mentoring sessions, fostering a collaborative team environment and increasing overall productivity by **25%**.\nIntegrated **ESLint** and **Prettier** for consistent code formatting and adherence to coding standards, reducing code-related issues before deployment.\nEnhanced web application accessibility to meet WCAG 2.1 standards, improving user experience for a wider audience.\nCollaborated with design and development teams to ensure the alignment of project goals and timelines, resulting in on-time project delivery with a satisfaction rate of **90%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Vue3** and **TypeScript** to enhance the frontend experience of client-side dashboards, improving user engagement by **15%**.\nImplemented state management strategies across applications to ensure a consistent user experience and enhance performance.\nDesigned and executed automated tests using **Cypress** and **Playwright**, achieving a **30%** increase in test coverage and reliability.\nContributed to the development of reusable components in **Vue3** as part of a modular design approach, accelerating the development timeline by **25%**.\nConducted code reviews and collaborated closely with team members to ensure alignment with best practices in coding standards and accessibility.\nCreated comprehensive technical documentation and user guides, bolstering knowledge transfer and onboarding processes for new team members.\nParticipated in Agile methodologies, including daily standups and sprint planning, fostering collaboration and teamwork.\nMaintained high code quality by implementing **ESLint** and **Prettier** to uphold coding standards across the development team.\nDeveloped and consumed **REST** and **GraphQL** APIs for seamless data interchange, ensuring consistent functionality and performance.\nAided in designing application interfaces that prioritize accessibility, ensuring an inclusive experience for all users and complying with industry standards."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tVue3, HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tREST, GraphQL\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, State Management, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Vite, Storybook, ESLint, Prettier, Accessibility, Design, Collaboration, Teamwork, Responsibility, Mentoring",
  "apply_company": "Sdui"
}