{
  "name": "Patryk Zaslawski",
  "role_name": "Senior BE Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As an accomplished Senior Back-End Engineer with 8+ years of software engineering experience, I excel in designing and implementing robust microservices architectures utilizing **Kotlin**, **Spring Boot**, **Gradle**, and **GraphQL**. My proficiency in cloud technologies, particularly **AWS**, allows me to develop scalable solutions that meet high-performance standards. I have hands-on experience with container orchestration using **Kubernetes** and **Docker**, along with asynchronous messaging via **RabbitMQ**. Additionally, I am skilled in using **Liquibase** for database versioning and enhancements, ensuring reliable data management. My expertise includes monitoring and performance analytics with **ElasticSearch**, **Grafana**, and **Prometheus**. I am an advocate of Agile methodologies, particularly **SCRUM**, and adept in CI/CD practices using **GitLab CI/CD**. Beyond technical skills, I bring strong communication and teamwork abilities, contributing to effective cross-functional collaboration. I am also comfortable working with **Keycloak** for identity management and have experience with **PostGIS** to handle geospatial data.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior BE Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Kotlin** and **Spring Boot** to design and develop scalable microservices architectures that enhance system resilience and performance across **AWS** cloud environments.\nImplemented CI/CD pipelines using **GitLab CI/CD**, ensuring seamless integration and deployment, reducing release times by up to **30%**.\nCreated robust and efficient APIs using **GraphQL**, facilitating optimal data fetching for frontend applications and enhancing user experiences.\nDesigned and orchestrated deployment strategies using **Kubernetes** and **Docker**, increasing deployment efficiency and automating scaling of applications.\nIntegrated messaging services with **RabbitMQ** to facilitate asynchronous communication between microservices, improving system responsiveness and reliability.\nLed the implementation of **Liquibase** for database version control, ensuring smooth migrations and rollback capabilities in production environments.\nDeveloped data storage solutions using **PostGIS** and **ElasticSearch**, optimizing querying speed and enabling efficient geospatial data processing.\nAnalyzed application performance metrics using **Grafana** and **Prometheus**, achieving enhancements in system monitoring and proactive issue resolution.\nChampioned Scrum methodologies in project management and team collaboration, fostering an agile environment conducive to innovation and continuous improvement.\nMentored and collaborated with cross-functional teams, emphasizing effective communication and teamwork to drive exceptional project outcomes.\nEstablished security best practices with **Keycloak** for identity and access management, improving user authentication processes across applications.\nEnhanced legacy systems leveraging **Kotlin** services for back-end functionalities, resulting in an improved user experience and faster response times.\nPromoted team knowledge sharing and growth through detailed code reviews, implementation strategies, and collaborative problem-solving sessions."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Led the development and migration to a **Kotlin**-based microservices architecture using **Spring Boot** and **Gradle**, enhancing scalability and maintainability for a high-performance backend.\n• Designed and implemented **GraphQL** and RESTful APIs, ensuring secure and efficient communication between internal applications while delivering real-time data updates.\n• Migrated legacy systems into a **microservices** architecture using **Kubernetes** and **Docker**, preserving critical functionalities and enhancing compatibility with modern technology.\n• Developed dynamic frontends integrated with backend services utilizing **Grafana** and **ElasticSearch** for advanced analytics and performance tracking.\n• Implemented real-time monitoring and alerting solutions with **Prometheus**, ensuring system reliability and timely response to transaction issues.\n• Streamlined payment processing workflows with integrations to **RabbitMQ** for queuing mechanisms, improving overall transaction efficiency by **30%**.\n• Ensured compliance with financial regulations by applying data protection measures including **Keycloak** for secure authentication and authorization in service communications.\n• Utilized **Liquibase** for managing database changes in **PostGIS**, ensuring version control and consistency across environments.\n• Developed CI/CD pipelines with **GitLab CI/CD**, automating deployment processes and reducing release times by **50%**.\n• Managed **Kubernetes** clusters for deploying and orchestrating microservices, enabling features like rolling updates and auto-scaling for high availability.\n• Fostered teamwork and collaboration in SCRUM environments, effectively communicating technical concepts in **English** to a diverse group of stakeholders.\n• Applied best practices in Kotlin development, including automated testing and continuous integration to ensure code quality and reliability.\n• Integrated **Helm** for managing Kubernetes applications, simplifying deployment and updating processes for complex microservices.\n• Contributed to a collaborative culture of improvement and innovation, driving success in high-impact back-end engineering initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and optimized backend services for an e-commerce platform using **Kotlin**, **Spring Boot**, and **Gradle**, improving scalability, performance, and user experience.\nDeveloped robust **GraphQL** APIs to handle high-volume transactions, ensuring seamless integration between frontend interfaces and backend systems for real-time customer interactions.\nLeveraged **PostGIS** and **ElasticSearch** with **Kotlin** and **Spring Boot** to design, optimize, and manage transactional databases, improving query performance and reducing latency by **30%**.\nBuilt dynamic, responsive frontends integrated with backend services using **React**, **Next.js**, **Angular**, and **Vue**, applying modern state management techniques for seamless user experiences.\nAutomated builds, testing, and deployments with **GitLab CI/CD**, ensuring consistent and reliable delivery of features across multiple environments.\nContainerized applications using **Docker** and orchestrated services with **Kubernetes**, streamlining deployments and enabling scalable operations.\nImplemented message queuing with **RabbitMQ** and **Kafka** to facilitate event-driven architectures, handling high-volume order processing and inventory updates.\nWorked in SCRUM in a cross-functional team to deliver projects on time, fostering teamwork and effective communication in delivering solutions.\nWrote unit and integration tests in **Kotlin** and automated frontend testing, ensuring code quality and reducing manual testing efforts by **25%**.\nConducted load and stress testing with tools like **JMeter** to validate system performance under high traffic loads of **up to 100,000** concurrent users.\nOptimized overall workflows with microservices architecture built with **Spring Boot**, ensuring low latency and fast transaction processing through efficient service orchestration.\nImplemented centralized authentication using **Keycloak** for secure customer and admin access, improving security measures significantly.\nDesigned and developed SEO-optimized, mobile-friendly websites integrated with backend services for enhanced cross-device accessibility, ensuring compliance with latest mobile standards.\nExecuted performance monitoring through **Prometheus** and **Grafana**, enabling real-time insight into system health and performance management, leading to a **40%** reduction in downtime."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Kotlin\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs, GraphQL\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, PostGIS\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Helm\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Liquibase, RabbitMQ, Microservices, SCRUM, ElasticSearch, Grafana, Prometheus, Communication, Teamwork, English",
  "apply_company": "Creative Dock"
}