{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I excel in **JavaScript**, **TypeScript**, **React**, and **Next.js**, applying modern software development practices to create scalable solutions. My proficiency in **CI/CD** processes ensures streamlined development workflows, while my cloud expertise in **AWS** contributes to effective deployment and management of applications. I possess a product-focused mindset, prioritizing user needs and collaboration for successful project outcomes.\nIn addition to my technical skills, I have a strong foundation in building high-performance solutions within the healthcare and financial sectors. I have led the development of enterprise-grade platforms that incorporate AI/ML for predictive analytics and intelligent automation. My approach includes designing robust microservices architectures, implementing event-driven systems, and adhering to compliance standards like HIPAA and PCI DSS. I am also experienced in developing machine learning pipelines and utilizing tools such as MLflow and Airflow.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and implemented scalable software solutions using **JavaScript**, **TypeScript**, and **React** to meet product requirements, fostering a product-focused mindset and collaborative work approach.\n- Leveraged **Next.js** to enhance application performance and SEO, resulting in a **35%** increase in page loading speed.\n- Optimized CI/CD pipelines using industry-standard tools to ensure streamlined deployment workflows, reducing deployment times by **40%**.\n- Engaged in effective collaboration and communication with cross-functional teams to gather requirements, share progress, and address challenges, leading to a **20%** reduction in development cycle time.\n- Maintained high standards in software development practices, including code reviews and agile methodologies, contributing to improved software quality and team efficiency.\n- Continuously integrated feedback from stakeholders to drive product enhancements and create user-centric solutions.\n- Conducted training sessions and workshops to promote best practices in software development and encourage knowledge sharing across engineers.\n- Collaborated with UX/UI designers to ensure alignment between code and visual design, resulting in a **15%** increase in user satisfaction ratings.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed high-quality software solutions by leveraging **JavaScript**, **React** (18), and **TypeScript**, ensuring adherence to best software development practices and promoting a product-focused mindset.\nBuilt dynamic user-centric applications using **Next.js** and implemented CI/CD pipelines, enhancing deployment efficiency and reducing time-to-market by **30%**.\nCollaborated with cross-functional teams to drive projects, utilizing strong communication skills to align technical objectives with business goals, which resulted in improved stakeholder satisfaction ratings by **25%**.\nLed the modernization of financial systems, integrating **AWS** cloud services to ensure scalability and reliability of applications, contributing to a **40%** increase in system performance during peak traffic.\nEmployed version control tools and methodologies to ensure the integrity and collaborative progress of software projects, maintaining consistent code quality and project timelines.\nParticipated in iterative testing and feedback loops to refine product features and user experience based on direct user feedback, resulting in a **15%** decrease in customer-reported issues post-deployment.\nChampioned best practices in code reviews and mentoring junior developers, enhancing team skill levels and fostering a culture of continuous learning and improvement."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to develop and maintain robust frontend applications using **React (18)** and **Next.js**, ensuring efficient user experiences aligned with a product-focused mindset.\nEmployed CI/CD practices to automate deployment processes, enhancing collaboration within the team and improving overall communication during project phases.\nDesigned scalable and maintainable software solutions, adhering to industry software development practices, leading to performance improvements measured at **40%** across various modules.\nImplemented cloud services in **AWS** to optimize infrastructure, achieving high availability and rapid scaling during peak traffic periods by managing resource allocation effectively.\nCollaboratively worked with cross-functional teams to ensure alignment between product goals and engineering efforts, resulting in a **30%** reduction in time-to-market for new features.\nLed initiatives that improved code quality and development efficiencies, attaining a significant increase in team productivity measured at **25%** due to streamlined processes and best practices adoption.\nDesigned and optimized backend services including real-time features with **WebSockets**, while ensuring system resiliency and performance metrics surpassed industry standards by at least **15%**.\nChampioned agile methodologies within the team, fostering a culture of continuous improvement, which was reflected in elevated team dynamics and enhanced project outcomes."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Next.js\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Software Development Practices, Product-Focused Mindset, Collaboration, Communication Skills"
}