{
  "name": "Tomasz Lee",
  "role_name": "Senior ML Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented Senior ML Engineer with 9+ years of extensive experience in MLOps and implementing CI/CD pipelines in cloud environments, particularly utilizing **Google Cloud** services. Proficient in **Python** for developing scalable machine learning solutions. Strong background in stakeholder management, critical thinking, and problem-solving, ensuring successful project delivery and alignment with business objectives. Previously worked as a .NET Full Stack Developer with expertise in **microservices architecture**, leveraging technologies like **ReactJS**, **NextJS**, **.NET**, **C#**, **Apache Kafka**, **RabbitMQ**, and **Redis**. Recognized for delivering robust solutions, optimizing performance, and fostering collaboration across cross-functional teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** for developing robust machine learning models and algorithms to enhance predictive analytics.\nImplemented **CI/CD** pipelines to automate deployment processes, increasing deployment efficiency by **40%**.\nLeveraged **Google Cloud** services for scalable model training and deployment, ensuring high availability and performance.\nApplied **MLOps** practices to streamline model lifecycle management, promoting collaboration between development and operations teams.\nEffectively engaged in **stakeholder management** to align project objectives with business needs and deliver value-added solutions.\nDemonstrated **critical thinking** and **problem-solving** skills to diagnose issues and implement effective solutions in model performance.\nSpearheaded learning sessions on the integration of machine learning models with web applications, enhancing team capabilities.\nResearch and development of data processing pipelines to optimize data flow and management, leading to increased model accuracy by **25%**.\nContributed to project roadmaps, emphasizing timeline adherence and milestone achievements through meticulous planning and execution."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** for data processing and model development, enhancing predictive accuracy by **20%**.\nImplemented **MLOps** practices to automate model deployment and monitoring, streamlining workflow and reducing deployment time by **40%**.\nLed the design and implementation of **CI/CD** pipelines, leveraging **GitHub Actions** to facilitate seamless integration and delivery of machine learning models.\nEngaged in effective **Stakeholder Management** by collaborating with project managers and clients to gather requirements, leading to a **30%** reduction in project delivery time.\nApplied **Critical Thinking** skills to troubleshoot complex machine learning issues, resulting in improved model reliability and performance.\nExecuted advanced **Problem Solving** techniques to optimize algorithms, achieving a **15%** increase in computational efficiency.\nMaintained project documentation and progress tracking tools using **Google Cloud**, ensuring transparency with stakeholders throughout the project lifecycle.\nConducted code reviews and provided mentorship to junior engineers, fostering a culture of continuous improvement and knowledge sharing within the team.\nDelivered presentations to stakeholders on project milestones and outcomes, enhancing overall communication and project alignment."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** for developing machine learning models to enhance predictive analytics, improving forecasting accuracy by **15%**.\nImplemented **CI/CD** pipelines for continuous integration and delivery of machine learning solutions, reducing deployment times by **30%**.\nManaged stakeholder communication to align machine learning initiatives with business goals, ensuring project transparency and collaboration.\nApplied **Google Cloud** services, including **BigQuery** and **Cloud Storage**, for scalable data processing and storage solutions, which handled over **1TB** of data effectively.\nConducted thorough problem solving and critical thinking analyses to address and resolve complex data set challenges, resulting in improved model performance.\nCollaborated with cross-functional teams to design and deploy machine learning models into production environments, leading to a **25%** increase in operational efficiency.\nEngaged in daily stand-ups and agile ceremonies to foster team alignment and progress tracking.\nProduced comprehensive documentation to support machine learning processes, facilitating knowledge sharing across the engineering team."
    }
  ],
  "skills": " **Programming Languages**\n\tPython\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\tAWS, Azure, Google Cloud\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tCI/CD, CI/CD pipelines\n\n **Cloud & Infrastructure**\n\tMLOps\n\n **Other**\n\tUX/UI Design, Git, GitHub, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Stakeholder Management, Critical Thinking, Problem Solving",
  "apply_company": "RE Partners"
}