{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Java Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Java Developer with 13+ years of experience in delivering high-performance applications in the healthcare and financial sectors. Proficient in **Java**, **Spring Boot**, **Spring Framework**, and **Spring Data JPA**, with a solid understanding of **Hibernate** and **PostgreSQL** for robust backend development. Skilled in **CI/CD**, using tools like **Gradle** for efficient project setups and deployment, and experienced with **Jira** for agile project management.\nThough primarily focused on Java, I have gained cross-technology knowledge in **JavaScript/TypeScript**, **Python**, and **Flutter**, along with hands-on experience in frontend and backend frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. \nI have also built AI/ML-powered platforms that facilitate predictive analytics and real-time processing, while implementing compliance-driven development that aligns solutions with regulatory standards, including HIPAA and PCI DSS. With a strong foundation in MLOps, I have focused on model training and orchestration using tools like **MLflow** and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Java**, **Spring Boot**, and **Spring Framework** to design and build robust applications tailored for healthcare and fintech sectors.\nImplemented **Spring Data JPA** and **Hibernate** for efficient database interactions, ensuring seamless integration with **PostgreSQL** and facilitating scalable data management.\nDeveloped CI/CD pipelines using **Gradle** to automate testing, building and deployment processes, ensuring high-quality software delivery across **9** environments.\nLed code reviews that resulted in a **30%** reduction in production bugs by enforcing best practices and improving code quality through collaborative feedback.\nCreated comprehensive technical documentation to enhance team understanding and streamline onboarding processes for the development of applications.\nManaged project tasks using **Jira**, improving workflow efficiency and tracking progress towards project milestones with a focus on completion rates exceeding **95%**.\nContributed to the development of AI-driven features, integrating intelligent functionalities into applications to enhance user experience and operational outcomes.\nFostered team collaboration through active participation in project planning and status meetings, ensuring timely delivery of project objectives in line with client expectations.\nCollaborated with cross-functional teams to define and implement efficient testing strategies, achieving **100%** coverage for critical use cases using advanced testing frameworks and tools."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented robust back-end solutions using **Java**, **Spring Boot**, and **Spring Framework** to enhance performance and reliability of financial applications.\nUtilized **Spring Data JPA** and **Hibernate** for efficient ORM layer, resulting in reduced database query times by **30%**.\nDesigned and maintained PostgreSQL databases ensuring high availability and performance, leading to improved data retrieval speeds of **50%**.\nAutomated database versioning and migrations using **Liquibase**, streamlining the deployment process across different environments.\nLeveraged **Gradle** for build automation, improving the efficiency of build processes by **25%** and ensuring consistent environments.\nAdopted **CI/CD** best practices to facilitate seamless integration and continuous delivery, reducing deployment times to production by **40%**.\nUtilized **Jira** for effective project management and tracking of development tasks, ensuring timely delivery and adherence to project timelines.\nConducted thorough **code reviews** to maintain code quality and performance, thereby reducing bugs in production by **20%**.\nParticipated in the creation of technical documentation to improve team understanding and onboarding of new developers, increasing overall team productivity.\nExplored **AI** methodologies to improve feature implementations and enhance user experience based on data-driven insights."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized complex backend services for scalable applications using **Java**, **Spring Boot**, and **Hibernate**, ensuring robust performance and maintainability.\nEngineered data access layers with **Spring Data JPA** and **PostgreSQL**, implementing Liquibase for database version control and migrations, achieving a **99.9% uptime** for production databases.\nImplemented CI/CD pipelines utilizing **Gradle** and **Jira** to ensure seamless integration and deployment processes, resulting in a **30% reduction** in release time across projects.\nConducted code reviews and provided technical documentation to maintain high code quality and team alignment with best practices, effectively reducing bugs by **20%** in production.\nIntegrated AI-driven features into existing applications, leveraging machine learning libraries for enhanced functionality and user experience, driving conversion rates up by **15%**.\nCollaborated with cross-functional teams to design and implement solutions, ensuring adherence to customer requirements and achieving project milestones in alignment with Agile methodologies.\nMentored junior developers on industry best practices, improving overall team productivity and skill sets through knowledge sharing sessions and collaborative coding.\nEnsured security measures through role-based access controls and OAuth 2.0 implementations, maintaining compliance with GDPR and safeguarding user data throughout the development cycle."
    }
  ],
  "skills": " **Programming Languages:** \n\tJava, Python, JavaScript/TypeScript\n\n **Backend Frameworks:** \n\tSpring Boot, Spring Framework, Spring Data JPA, Hibernate, FastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, ECS\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS: RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Liquibase, Gradle, Jira, Technical Documentation, Code Reviews, Nginx, Let’s Encrypt, Certbot"
}