{
  "name": "Tomasz Lee",
  "role_name": "Senior Cybersecurity Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Accomplished Senior Cybersecurity Engineer with 9+ years of expertise in **Cloud Infrastructure** and **Network Security**. Proven skills in **Risk Management**, **Vulnerability Assessment**, and **Incident Response**, utilizing tools such as **Nmap**, **Nessus**, and **OpenVAS** to enhance security posture. Proficient in implementing **Cybersecurity** frameworks, including **MITRE ATT&CK** and **NIST**, to identify and mitigate threats effectively. Experienced with **AWS** and **Azure** cloud services, ensuring resilient security solutions in diverse environments. Additionally, I possess a strong background in **technical reporting** and mentoring, fostering collaboration and knowledge sharing across teams. I leverage my foundation in **.NET** and full stack development to integrate security protocols from application design through deployment, guaranteeing robust performance and integrity in software solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Cybersecurity Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted vulnerability assessments using **Nessus**, **OpenVAS**, and **Nmap**, leading to the identification and remediation of over 150 critical vulnerabilities across various systems.\nImplemented cybersecurity strategies including penetration testing and incident response protocols compliant with **MITRE ATT&CK** and **NIST** frameworks, enhancing security posture by 30%.\nDeveloped comprehensive technical reports that documented vulnerabilities, risks, and remediation strategies, facilitating informed decision-making for stakeholders.\nDesigned and deployed cloud security measures on **AWS** and **Azure** to safeguard cloud infrastructure, achieving a 20% reduction in potential threats.\nLed incident response activities, effectively managing **over 50** security incidents and minimizing downtime to less than 4 hours per incident.\nMentored junior cybersecurity engineers, providing training on **SIEM** tools and security best practices, increasing overall team competency.\nIntegrated **SOAR** solutions to automate response actions against security alerts, streamlining incident management processes by 50%.\nAssessed and improved network security measures across multiple environments using **EDR** and **UTM** technologies, reducing unauthorized access attempts by 40%.\nImplemented honeypots to analyze attack patterns, contributing to enhanced threat intelligence and proactive security measures."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Executed advanced **Cybersecurity** measures including **Incident Response** and **Vulnerability Assessment** to ensure the integrity and protection of sensitive data.\nUtilized **Cloud Infrastructure** solutions such as **AWS** and **Azure** for deploying security protocols, achieving a 20% increase in operational security.\nImplemented **Risk Management** strategies to assess and mitigate potential threats, improving overall risk posture by 30%.\nDeveloped and maintained **SIEM** and **SOAR** systems for monitoring security incidents, leading to a 40% reduction in response times.\nConducted thorough **Penetration Testing** and vulnerability scanning using tools like **Nessus** and **OpenVAS**, identifying and addressing critical vulnerabilities in the system.\nProvided mentorship and training to junior developers in **Network Security** and **Technical Reporting**, enhancing team skill sets and capabilities.\nLed efforts to integrate **EDR** and **UTM** solutions into existing infrastructures, streamlining threat detection processes.\nAuthored detailed security assessments and reports adhering to **NIST** standards, contributing to compliance and audit success.\nCollaborated effectively using frameworks like **MITRE ATT&CK** to develop actionable security plans, resulting in a 25% enhancement in threat response strategies.\nMonitored and optimized security tools such as **Nmap** for network mapping and analysis, improving detection rates by 15%.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Conducted **Vulnerability Assessment** on internal systems, leveraging tools such as **Nmap**, **Nessus**, and **OpenVAS** to identify and remediate security weaknesses, reducing potential risks by 30%.\n• Developed and implemented **Incident Response** strategies that improved response times to security breaches by **25%**.\n• Managed **Cloud Infrastructure** security across platforms like **AWS** and **Azure**, ensuring compliance with **NIST** standards and reducing unauthorized access incidents.\n• Engaged in **Risk Management** practices, assessing over **100** potential threats and vulnerabilities in network security protocols, leading to the enhancement of security measures.\n• Designed and implemented **SIEM** and **SOAR** solutions to monitor and automate incident detection, achieving a rapid alert response rate.\n• Trained and mentored junior team members on **Mitre ATT&CK** framework to improve organizational knowledge in threat identification and mitigation tactics.\n• Led **Penetration Testing** exercises, simulating attacks to uncover vulnerabilities and strengthen defenses across the organization.\n• Managed **EDR** solutions to proactively detect and respond to endpoint threats, resulting in a significant reduction in malware incidents by **40%**.\n• Utilized **Honeypots** to gather intelligence on potential attacks, aiding in the continuous improvement of network security policies.\n• Created detailed **Technical Reporting** on security findings and strategies, enhancing communication with stakeholders and improving decision-making processes."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, TypeScript, C#, Python, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tCloud Infrastructure\n\n**Cybersecurity**\n\tCybersecurity, Network Security, Risk Management, Vulnerability Assessment, Incident Response, Penetration Testing, SIEM, SOAR, EDR, UTM, Honeypots, NIST, MITRE ATT&CK, Nmap, Nessus, OpenVAS, Technical Reporting\n\n**Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis, UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Mentoring",
  "apply_company": "Arctic Wolf"
}