{
  "name": "Rei Taro",
  "role_name": "Senior QA Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Skilled Senior QA Engineer with over 10 years in software development, now specializing in Test Automation and CI/CD processes. Proficient in using **Playwright**, **JavaScript**, and **TypeScript** to ensure high-quality software releases. Experienced in Agile methodologies, fostering effective communication within cross-functional teams to enhance collaboration and project success. Originally a Senior Backend Developer with a strong background in creating high-performing APIs and scalable services utilizing technologies like **Python** (FastAPI, Django, Flask) and cloud platforms including **AWS** and **Azure**. Proven track record of contributing to impactful projects at leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed and executed test automation frameworks using **Playwright** with **JavaScript** and **TypeScript** to enhance software quality and accelerate release cycles.\nImplemented CI/CD pipelines to streamline testing workflows, achieving a **30%** reduction in deployment time.\nCollaborated effectively with cross-functional teams in an **Agile** environment to ensure seamless integration and comprehensive test coverage.\nEnhanced communication strategies within the team and stakeholders to improve clarity and project visibility, leading to a **20%** increase in team efficiency.\nConducted thorough documentation and reporting of test results to drive continuous improvement and maintain high project standards.\nDrove the adoption of test automation best practices, contributing to a **15%** decline in production defects over multiple releases."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **CI/CD** techniques to streamline deployment processes and enhance automation for testing workflows in the development of backend systems.\nDesigned and implemented **Test Automation** frameworks using **Playwright** and **JavaScript**, achieving a reduction in manual testing time by **75%**.\nFostered collaboration with development teams to integrate testing into the Agile development cycle, enhancing communication and ensuring timely feedback.\nExecuted test strategies for frontend applications built with **TypeScript**, resulting in a **30%** increase in code coverage across critical components.\nConducted performance and security testing to validate compliance with industry standards, reporting findings and recommendations effectively to stakeholders.\nLed retrospectives and reviews to continuously improve testing processes and team performance, adapting methodologies to align with project goals.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Conducted **Test Automation** using **Playwright**, **JavaScript**, and **TypeScript** to ensure high-quality software delivery, achieving a 30% reduction in defect rates.\nImplemented robust **CI/CD** pipelines, improving release frequency from bi-weekly to **weekly** deployments, fostering an Agile development environment.\nCollaborated with cross-functional teams to enhance communication and deliver seamless testing processes, resulting in improved project turnaround times by **25%**.\nMaintained comprehensive documentation of test results and procedures, contributing to better team understanding and knowledge sharing.\nEngaged in Agile methodologies to participate in sprint planning, retrospectives, and daily stand-ups, strengthening team coordination and project visibility.\nUtilized **Python**, **Flask**, and **PostgreSQL** for backend development, ensuring integration between testing frameworks and application performance monitoring.\nDeveloped automated test cases for REST APIs, enhancing coverage by **40%** and ensuring compliance with business requirements."
    }
  ],
  "skills": "**Programming Languages**\n\tJavaScript, TypeScript, Python (3.8+), SQL, Bash\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tPlaywright\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Test Automation, Agile, Communication, PyTest, Git, Kafka",
  "apply_company": "lemlist"
}