{
  "name": "Tomasz Lee",
  "role_name": "Ingeniero/a de Software",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Software Engineer with over 9 years of experience in developing and implementing high-quality software solutions. Proficient in **Java** and cloud services like **AWS**, with a strong focus on API development, ensuring security, and maintaining rigorous code quality standards. Demonstrated ability in collaborating effectively within teams, employing an analytical mindset to tackle complex problems. Original strengths include expertise in software architecture, **microservices** design, and full stack development with a robust tech stack including **.NET**, **C#**, **ReactJS**, **NextJS**, and experience with messaging systems like **Apache Kafka**, **RabbitMQ**, and **Redis**. Committed to delivering performance-optimized applications while leading projects to successful completion, with high proficiency in English.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Ingeniero/a de Software",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and optimized **RESTful APIs** for seamless data access, improving system integrations and enhancing overall functionality.\nExecuted projects on **AWS**, leveraging cloud services for scalability and reliability, achieving a deployment success rate of over **95%**.\nWorked collaboratively in a team environment, employing strong **teamwork and communication skills** to foster relationships and meet project deadlines.\nDemonstrated a strong **analytical mindset** by troubleshooting and resolving complex technical issues efficiently, increasing system uptime by **10%**.\nEmphasized **code quality** through systematic code reviews and adherence to best programming practices, reducing bug rates by **30%**.\nIntegrated cutting-edge technologies such as **Java** to develop applications and support innovative features in the software lifecycle.\nProvided insights on **security** measures for application protection, implementing industry-standard practices to minimize vulnerabilities.\nEngaged in continuous learning and utilized high-level **English proficiency** to collaborate with international teams and documentation effectively.\nParticipated in agile development practices, enhancing the product’s adaptability to changing requirements and feedback.\nLed initiatives to document API behaviors and workflows, resulting in a **20%** decrease in onboarding time for new developers."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Java** and **AWS** to design and develop scalable cloud-based applications, enhancing code quality and system performance.\nImplemented robust **APIs** for seamless integration with existing services, ensuring high standards of **seguridad**.\nEmployed an analytical mindset to evaluate project requirements, optimizing workflows, and improving collaboration within the team.\nParticipated in daily stand-ups and maintained strong **trabajo en equipo** to meet project deadlines effectively.\nConducted regular code reviews, significantly improving the **orientación a la calidad del código** across the development team.\nAchieved a **30%** reduction in deployment errors through the implementation of CI/CD pipelines using **GitHub Actions**.\nMentored junior developers, leading to a measurable increase in team productivity and knowledge sharing.\nDeveloped interactive charts and analytics using **D3.js** to enhance user engagement and data visualization.\nManaged database systems such as **PostgreSQL** and **MySQL**, optimizing query performance for **real-time** data retrieval.\nCommunicated fluently in **inglés alto** with stakeholders to ensure all system requirements were met accurately."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed robust software solutions using **Java** in collaboration with cross-functional teams, enhancing team productivity and cohesion.\n• Integrated **APIs** for seamless data connectivity between various systems, ensuring an efficient data exchange process.\n• Utilized AWS to deploy and manage applications in a scalable environment, improving uptime by **30%**.\n• Employed strong analytical thinking to troubleshoot and resolve software defects, maintaining a high quality of code.\n• Demonstrated teamwork by actively participating in code reviews and standup meetings, fostering a collaborative work atmosphere.\n• Implemented security best practices in software development, ensuring compliance with **CCM** guidelines and policies.\n• Contributed to the enhancement of coding standards, which resulted in a reduction of bugs by **15%** during the QA phase.\n• Facilitated knowledge transfer through technical documentation and user guides, supporting team members in their understanding of the systems and processes.\n• Communicated effectively in high-level **English** during project discussions and presentations, ensuring clarity and mutual understanding among team members."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, Python, JavaScript, TypeScript\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL, APIs\n\n **Serverless and Cloud Functions**\n\tAWS, Azure\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tCI/CD pipelines\n\n **Cloud & Infrastructure**\n\tAWS, Azure\n\n **Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, trabajo en equipo, mentalidad analítica, orientación a la calidad del código, inglés alto, seguridad, CCM"
}