{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior PHP Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior PHP Engineer with 13+ years of experience in full stack development, specializing in PHP and **Symfony** for creating high-performance applications. Proficient in **MySQL** and **PostgreSQL** for robust database management and skilled in developing RESTful APIs utilizing **JSON** for seamless data interchange.\nExperienced in **Git** for version control and implementing **CI/CD** pipelines to enhance project delivery efficiency. Adept in **Docker** for containerization and cloud deployment strategies, ensuring optimal performance and scalability in web applications. \nPassionate about **AI** and implementing testing methodologies to ensure code quality and system reliability. Strong background in teamwork and Agile methodologies, fostering collaborative environments that drive innovative solutions across various industries, including healthcare and finance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained secure web applications using **PHP** and **Symfony**, ensuring compliance with industry standards.\nImplemented robust database solutions utilizing **MySQL** and **PostgreSQL** to optimize data storage and retrieval with a focus on performance enhancements, achieving a **30% reduction** in query times.\nDesigned and executed RESTful APIs using **JSON**, facilitating seamless integration with frontend applications and third-party services, enhancing overall system interoperability.\nExecuted modern CI/CD practices to automate deployment processes, leading to **50% faster** release cycles and improved code quality through consistent testing methodologies.\nUtilized **Docker** containers to streamline application development and deployment, ensuring consistency across various environments and enhancing overall system reliability.\nCollaborated in an Agile manner with cross-functional teams to foster teamwork and drive project success, adapting quickly to changing requirements while maintaining project timelines.\nEnhanced web scalability through effective performance optimization techniques, successfully managing high traffic loads with minimal latency, achieving **99.9% uptime**.\nDeveloped unit and integration tests to ensure software reliability, resulting in a **40% reduction** in post-release defects.\nAdopted cloud technologies to improve application performance and availability, leveraging cloud services to scale resources efficiently during peak demand periods.\nIntegrated third-party e-commerce solutions such as **Shopify**, **Shopware**, and **WooCommerce**, enriching application capabilities and enhancing user engagement."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Employed **PHP** and **Symfony** to develop robust and scalable web applications, significantly enhancing system performance and reliability in high-demand environments.\nUtilized **MySQL** and **PostgreSQL** for efficient database management and optimization, ensuring responsive operations and reduced query times by **30%**.\nImplemented RESTful APIs with **JSON** for seamless integration between backend services and client applications, facilitating enhanced interoperability and client-server communication.\nManaged version control and collaboration via **Git**, delivering features through a continuous integration and deployment (**CI/CD**) pipeline, leading to a **25%** reduction in deployment times.\nConducted comprehensive testing strategies to uphold code quality and enhance application stability, resulting in a decrease of critical bugs by **40%** post-release.\nLeveraged **Docker** for containerization, streamlining development setups and simplifying deployment processes across various environments, improving workflow efficiency by **20%**.\nCollaborated in an **Agile** framework, fostering teamwork to deliver solutions swiftly and adaptively in fast-paced project cycles focused on user feedback and iterative development.\nOptimized application performance through advanced strategies, improving loading times and user experience, achieving **50%** faster response rates under traffic peaks.\nIntegrated AI and machine learning to enhance application capabilities, providing innovative solutions for user engagement and personalization in web applications.\nDeveloped eCommerce functionalities using **Shopify**, **Shopware**, and **WooCommerce**, expanding market reach and driving sales growth through digital transformation initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **PHP** and **Symfony** frameworks to develop and maintain robust backend services for high-demand e-commerce applications, ensuring **performance optimization** and **web scalability** in line with user growth, achieving **99.9% uptime**.\nImplemented RESTful APIs and integrated data exchange protocols using **JSON**, facilitating seamless communication between services and enhancing overall application efficiency.\nCollaborated with cross-functional teams in an **Agile** environment, utilizing tools like **Git** for version control and managing CI/CD pipelines to streamline deployment processes and reduce release times by **30%**.\nDesigned and utilized MySQL and **PostgreSQL** databases for efficient data management and transactional integrity, successfully handling over **10 million** daily transactions with optimized query performance.\nConducted thorough **testing** to ensure high-quality code delivery, improving system reliability through automated tests and reducing production bugs by **40%**.\nLeveraged **Docker** for containerization, enabling easy deployment and environment consistency across development and production setups, thus enhancing collaboration within the **teamwork** framework.\nEngaged in cloud solutions to improve system architecture, providing scalability and resilience through services like AWS, ensuring the platform can handle peaks of user activity seamlessly.\nIntegrated AI-driven features to personalize user experiences and optimize product offerings, applying industry best practices in algorithm development to increase customer engagement rates significantly.\nDeveloped plugins and extensions for e-commerce platforms including **Shopify**, **Shopware**, and **WooCommerce** to enhance site functionality and integrate additional features tailored to business needs."
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Symfony\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST, JSON\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tMySQL, PostgreSQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tCloud, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Shopify, Shopware, WooCommerce, Performance Optimization, Web Scalability, Agile, Teamwork, Testing",
  "apply_company": "brickfox Multichannel eCommerce"
}