{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior NOC Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior NOC Engineer, I bring 8 years of experience in Network Monitoring and Incident Management, ensuring operational readiness and effective problem-solving in dynamic environments. My role includes proficiency in utilizing **ticketing tools** to manage incidents efficiently, with a keen attention to detail that upholds高可用性 and performance across **2G, 3G, 4G,** and **5G** networks. I leverage my technical expertise for providing guidance and support in **telecommunications** services, ensuring seamless communication and operational excellence. \nI have a strong foundation in developing technical solutions through full-stack development practices, utilizing **JavaScript/TypeScript, Python,** and **Flutter** technologies. My experience extends to deploying microservices architecture and automating CI/CD pipelines, and building enterprise-grade platforms with compliance considerations like HIPAA and PCI DSS. Additionally, I have insights into integrating AI/ML technologies for enhanced predictive analytics and real-time processing, backed by robust knowledge of cloud services including **Azure** and **AWS**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior NOC Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Provided **technical guidance** for NOC operations, focusing on effective **incident management** and network monitoring across **4G** and **5G** technologies.\n- Utilized ticketing tools efficiently to track and resolve incidents, ensuring timely response and resolution, demonstrating strong **problem-solving** skills.\n- Monitored network performance and availability, applying attention to detail to identify potential issues before they escalated, ultimately maintaining operational readiness and high service levels.\n- Collaborated with cross-functional teams to facilitate communication and address problems swiftly, ensuring all stakeholders were informed throughout incidents.\n- Developed and implemented processes to improve incident resolution times by **30%** through proactive monitoring and rigorous training sessions.\n- Conducted training sessions for junior NOC staff, fostering a culture of self-motivation and continuous improvement in technical skills and operational practices.\n- Leveraged expertise in telecommunications standards, including **2G**, **3G**, and **5G**, to enhance network resilience and reliability.\n- Actively participated in post-incident reviews, utilizing a structured approach to evaluate incidents, determine root causes, and implement solutions to prevent recurrence, showcasing strong analytical and problem-solving acumen."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided **technical guidance** to NOC operations by overseeing incident management protocols and ensuring efficient problem solving, resulting in a **15% reduction** in incident resolution time.\nConducted **network monitoring** across multi-generational technologies including **2G, 3G, 4G, and 5G**, ensuring operational readiness and continuous service availability.\nUtilized **ticketing tools** to prioritize and manage incidents, maintaining precise documentation and communication within the team for seamless workflows.\nImplemented thorough **incident management** strategies that improved the team’s response time to service alarms by **20%** through effective communication and attention to detail.\nDeveloped and maintained **self-motivation** techniques in team members, fostering a proactive work environment and enhancing overall team performance.\nLed routine **network performance evaluations** that identified and addressed underlying issues, improving system reliability and user satisfaction metrics by **30%**.\nFacilitated regular training sessions focusing on **telecommunications fundamentals**, empowering team members to troubleshoot technical issues independently and enhancing operational capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted **network monitoring** and **incident management** for a global e-commerce platform, ensuring **high availability** and quick resolution of **2G, 3G, 4G, and 5G** network issues affecting over **1 million** users.\nProvided **technical guidance** and support for **telecommunications** systems and resolved complex problems, enhancing operational readiness across the network infrastructure.\nUtilized **ticketing tools** to effectively manage and track incidents and service requests, improving response times by **30%** through structured **problem solving** practices.\nChampioned a **self-motivated** approach to continually oversee system performance, yielding an uptime increase of **99.9%** while maintaining detailed documentation to address future incidents.\nEngaged in proactive **communication** with cross-functional teams to ensure alignment on incident responses and network performance, resulting in a **20%** reduction in recurring issues.\nDemonstrated strong **attention to detail** in first-call resolutions and troubleshooting processes, leading to an improved customer satisfaction rating of **85%**.\nImplemented robust **NOC operations** protocols that facilitated seamless handling of issues, ensuring all incidents were appropriately prioritized and escalated as necessary."
    }
  ],
  "skills": " **NOC Operations**, **Incident Management**, **Problem Solving**, **Network Monitoring**, **Ticketing Tools**, **Telecommunications**, **2G**, **3G**, **4G**, **5G**, **Technical Guidance**, **Operational Readiness**, **Communication**, **Attention to Detail**, **Self-Motivation**,\n\n\t**Programming Languages**:\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n\t**Artificial Intelligence & Machine Learning**:\n\tMLflow, Airflow, Kubeflow\n\n\t**DevOps & Cloud**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n\t**Authentication & Security**:\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n\t**Databases & Caching**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n\t**CI/CD & Infrastructure as Code**:\n\tTerraform, Ansible, Helm, Docker Compose\n",
  "apply_company": "Webbing"
}