{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Security Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Security Engineer with extensive experience in **cloud security**, threat hunting, and SOC operations. Proficient in working with **AWS** and **Azure** cloud environments, implementing security solutions utilizing tools like **Sentinel**, **Splunk**, and **Rapid7**. Well-versed in **SIEM**, **EDR**, and **DLP** strategies to safeguard organizational assets. Strong scripting capabilities in **Python** and **PowerShell** for automating security tasks and processes.\n\nWith 13+ years of experience as a Full Stack Developer, I bring a unique blend of technical acumen and cybersecurity expertise. I've built high-performance applications using **JavaScript**, **TypeScript**, **Python**, and **Flutter**, while leveraging frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My background includes developing AI/ML-powered platforms focused on real-time processing and predictive analytics. I have successfully deployed cloud-native systems while conforming to compliance standards such as HIPAA and PCI DSS. My collaborative communication skills enable me to work effectively within cross-functional teams.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented effective **cloud security** measures across platforms leveraging **AWS** and **Azure**, ensuring compliance with industry regulations and best practices for data protection.\nConducted **threat hunting** operations using advanced **SIEM** solutions such as **Splunk** and **Sentinel**, identifying and mitigating potential threats with a focus on continuous monitoring and incident response.\nDeveloped and maintained **EDR** solutions ensuring endpoint security for over **200** devices through proactive detection and response strategies.\nUtilized data loss prevention techniques (**DLP**) to safeguard sensitive information, achieving a reduction in data leakage incidents by **30%** over **12** months.\nDesigned and executed robust security operations center (**SOC**) processes, improving incident response times by **40%** while enhancing overall team collaboration and communication.\nLeveraged **Python** and **PowerShell** scripting for automated security monitoring and reporting, which improved operational efficiency and reduced manual tasks by **50%**.\nCollaborated cross-functionally to ensure effective security practices across all project teams, facilitating clear communication of security policies and procedures.\nParticipated in regular security assessments and audits using tools like **Rapid7** and **CSPM**, delivering comprehensive reports and actionable insights to senior management.\nCreated and managed incident documentation and action plans, following up on incidents to ensure they are closed with effective preventive measures in place for future occurrences.\nRegularly updated and maintained security training programs for staff, enhancing awareness and compliance with security protocols across the organization.\nConducted security reviews of third-party tools and platforms to evaluate risks, ensuring that all integrations adhere to organizational security standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented and maintained cloud security solutions in **Azure** and **AWS**, ensuring compliance with industry standards and best practices for cloud infrastructure.\nConducted thorough threat hunting and incident response operations utilizing **SIEM** tools like **Splunk** and **Rapid7**, optimizing detection and reaction times to potential security threats.\nDeveloped and automated security scripts using **Python** and **PowerShell** to streamline operational processes and enhance **SOC operations**, improving efficiency by **30%**.\nCollaborated with cross-functional teams to design and deploy data loss prevention strategies (DLP), utilizing **Sentinel** for monitoring and incident management.\nManaged security incidents and breaches, applying advanced knowledge of endpoint detection and response (EDR) solutions to minimize impact.\nDeveloped and executed security policies and protocols to ensure robust protection against vulnerabilities and risks, leading to a reduction in incidents by **15%** over **6 months**.\nEngaged in effective communication across teams to foster a culture of security awareness, enhancing the collaborative aspect of **SOC operations** and improving engagement scores by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented cloud security measures across **Azure** and **AWS** environments to safeguard critical data and applications against emerging threats.\nConducted SOC operations to monitor security incidents, utilizing **SIEM** tools like **Splunk** and **Rapid7** for real-time threat detection and compliance auditing.\nExecuted threat hunting initiatives, analyzing data from **EDR** solutions and **DLP** strategies to proactively identify vulnerabilities and enhance incident response times by **30%**.\nDeveloped security scripts in **Python** and **PowerShell** to automate operational processes, increasing efficiency in threat detection analysis by **25%** and reducing false positives.\nCollaborated with cross-functional teams to enhance security posture, effectively communicating risks and strategies to stakeholders, improving risk management practices and fostering a security-first culture.\nUtilized **CSPM** tools to continuously assess cloud service configurations, ensuring compliance with industry standards and improving security audit readiness.\nConfigured and optimized **Sentinel** for incident response workflows, enhancing investigation capabilities and reducing mean time to resolution (MTTR) by **40%**.\nEngaged in regular training and workshops to stay current with emerging security trends, thus increasing the team's threat intelligence and resilience against evolving cyber threats.\nIntegrated advanced threat protection solutions to bolster the organization’s defenses, ensuring critical systems remain operational during security events.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n\tCI/CD & Infrastructure as Code\n\tcloud security\n\tSOC operations\n\tthreat hunting\n\tSIEM\n\tEDR\n\tDLP\n\tSentinel\n\tSplunk\n\tRapid7\n\tCSPM\n\tscripting\n\tPowerShell\n\tcommunication\n\tcollaboration",
  "apply_company": "Novanta Inc."
}