{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Java Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dynamic Senior Java Engineer with 8 years of full-stack development experience, specializing in building high-performance microservices using **Java**, **Spring Boot**, and **REST** principles. Proficient in creating scalable asynchronous APIs and leveraging databases like **PostgreSQL** and **Redis**. Experienced in containerization and orchestration with **Docker** and **Kubernetes**, ensuring seamless CI/CD workflows with **GitHub Actions**. Demonstrated ability in observability and logging best practices to enhance system reliability.\n\nProficient in agile communication and collaboration, driving successful project outcomes within cross-functional teams. My technical skills extend to **Python**, **FastAPI**, and **Flask**, with a solid foundation in developing machine learning pipelines. Eager to leverage my background in cloud services and CI/CD processes while integrating innovative solutions in tech stacks like **RabbitMQ**, **Terraform**, and **KNative**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and architected microservices-based applications using **Java** and **Spring Boot**, ensuring efficient RESTful and async APIs that support high performance and scalability.\n• Implemented CI/CD pipelines utilizing **GitHub Actions** and **Docker**, overseeing multi-environment deployments and ensuring code quality through automated testing and observability.\n• Integrated and managed databases, including **PostgreSQL** and **Redis**, optimizing data storage and retrieval for enhanced application performance.\n• Led the design and implementation of Kubernetes-based solutions, leveraging **Kubernetes** for container orchestration and management.\n• Collaborated in an agile environment, fostering strong communication and collaboration between development teams to meet project milestones.\n• Utilized tools such as **RabbitMQ** and **Celery** to enhance service communication and task management within microservices architecture.\n• Architected applications with a focus on observability and logging, employing industry-leading practices for monitoring and diagnostics.\n• Developed full-stack solutions using **TypeScript**, ensuring robust front-end experiences with frameworks such as **Angular**.\n• Participated in the design and integration of cloud-native solutions deploying **Terraform** for resource management and orchestration within cloud environments.\n• Established governance and compliance measures through the integration of secure coding practices and the adoption of industry standards.\n• Contributed to cross-functional projects ensuring alignment with business goals and technical feasibility through strategic planning and execution."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring Boot** to design and implement microservices-based architectures, enhancing scalability and maintainability for financial systems and ensuring high transaction throughput.\nEmployed **REST** and **async APIs** to facilitate efficient communication between services, driving faster data retrieval and processing for client-facing applications.\nDesigned databases with **PostgreSQL**, optimizing query performance and ensuring data integrity across financial transactions.\nManaged caching solutions with **Redis** to improve application performance and decrease latency in transaction handling.\nContainerized applications using **Docker** and orchestrated them with **Kubernetes**, contributing to seamless deployment pipelines and improved resource management.\nImplemented CI/CD practices with **GitHub Actions**, automating build, test, and deployment pipelines that improved delivery speed by **30%**.\nLeveraged **observability** tools for logging and monitoring, enabling proactive issue resolution and enhancing the overall system reliability.\nCollaborated effectively with cross-functional teams in an agile environment, ensuring alignment on project goals and prompt resolution of blockers through continuous communication.\nDeveloped microservices with **Python**, using frameworks such as **FastAPI** and **Flask**, allowing for diverse backend support and multi-language integration.\nAutomated task management and workflow processes with **Celery** and integrated third-party services with tools like **Zapier** and **Retool**, streamlining operations across teams.\nEngaged in code reviews and collaborated via agile methodologies, fostering a culture of feedback and continuous improvement in team practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and maintained microservices using **Java** and **Spring Boot**, ensuring high performance and responsiveness in a distributed system architecture, with a focus on **REST** and **async APIs**.\n• Managed data persistence through **PostgreSQL** with optimized queries supporting a high volume of transactions, achieving significant performance improvements in read/write operations (up to **5000 transactions per second**).\n• Integrated **Redis** for in-memory caching, effectively reducing response times by over **30%**, and improving overall application throughput in a high-traffic environment.\n• Designed CI/CD pipelines utilizing **Docker** and **Kubernetes**, enhancing deployment processes to achieve **zero-downtime** deployments with **GitHub Actions** and ensuring consistent observability and logging across all environments.\n• Collaborated in an agile environment with a focus on cross-team communication and collaboration to deliver scalable solutions aligned with business objectives, leveraging tools like **RabbitMQ** for asynchronous message processing.\n• Implemented robust observability practices, incorporating monitoring and logging strategies to track system performance and user activity, facilitating proactive issue resolution with an average response time improvement of **40%**.\n• Engaged in feature flagging and blue-green deployment strategies to minimize risk during releases, employing cutting-edge tools and practices to enhance deployment safety and rollback capabilities.\n• Built user-friendly frontend applications using technologies like **Angular**, **TypeScript**, and **Flask**, achieving an interactive and responsive user experience with optimized load times and accessibility standards compliance.\n• Actively involved in refactoring legacy code and using **Python** frameworks like **FastAPI** to improve application maintainability and performance, achieving a reduction in load times by up to **50%**. \n• Engaged in continuous improvement practices to identify and implement enhancements, driving efficiency and innovation throughout the software development life cycle."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, Rust, C++, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Boot, SQLAlchemy, Celery\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST, async APIs, RabbitMQ\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), KNative\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tCI/CD, observability, logging\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Retool, Zapier, agile communication, collaboration",
  "apply_company": "Protolabs"
}