{
  "name": "Patryk Zaslawski",
  "role_name": "Full Stack Software Engineer (Attack Surface Management)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a seasoned Full Stack Software Engineer with over 8 years of experience, I specialize in full-stack development and crafting efficient, high-performance solutions for diverse sectors. I excel in developing **RESTful APIs** and **gRPC** services, utilizing my deep understanding of **PostgreSQL**, **MySQL**, and **Neo4j** for database optimization. Proficient in implementing modern **CI/CD pipelines** and container orchestration via **Kubernetes**, I ensure smooth and scalable deployments. My technical expertise is complemented by a strong foundation in clean coding practices and automation, enhancing overall software quality. I am driven by a problem-solving mindset, fostering collaboration through active participation in both technical and product discussions, and consistently delivering enterprise-grade solutions aligned with industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Software Engineer (Attack Surface Management)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed and maintained **full-stack** applications leveraging **Python** and frameworks such as **FastAPI**, **Django**, and **Flask** to enhance product functionalities and user experience.\n• Designed and implemented **RESTful APIs** and **gRPC** services with a focus on **clean coding** principles, ensuring robust and maintainable code structures during the development process.\n• Spearheaded the deployment of applications on **Kubernetes** to achieve seamless scalability and improve system resilience, resulting in **30%** faster deployment times.\n• Established and optimized **CI/CD pipelines** using tools like **GitHub Actions** and **Azure DevOps** to automate the build and release processes, achieving **99%** deployment success rate across environments.\n• Collaborated closely with cross-functional teams to address technical challenges and enhance product discussions, contributing to a productive and innovative work environment.\n• Ensured effective database management practices using **PostgreSQL** and **MySQL**, with a focus on performance optimization through indexing and query refining, which improved average query response times by **50%**.\n• Led technical discussions to enhance problem-solving capabilities among team members, fostering a culture of continuous improvement and knowledge sharing.\n• Advocated for effective **automation practices** throughout the development lifecycle, minimizing manual overhead and reducing deployment errors by **40%**.\n• Applied problem-solving methodologies to troubleshoot complex applications, leading to a **20%** reduction in downtime and improved overall system reliability.\n• Mentored junior engineers in full-stack development, emphasizing the importance of code quality and collaboration for ongoing project success."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained **RESTful APIs** and **gRPC** services in **Python** (FastAPI, Django, Flask), ensuring efficient communication and data handling across multiple applications, improving response times by **30%**.\n• Leveraged **Kubernetes** for deploying and managing **Python microservices**, enhancing scalability and reducing downtime during deployments by **20%**.\n• Implemented **CI/CD pipelines** using **Azure DevOps** and **GitHub Actions**, automating testing and deployment processes, leading to a **25%** reduction in release cycles.\n• Engaged in technical and product discussions with cross-functional teams to align development efforts with business objectives, facilitating collaboration and problem-solving initiatives.\n• Conducted code reviews and promoted clean coding standards, resulting in a codebase that meets industry best practices and enhances maintainability.\n• Designed integration solutions using **PostgreSQL**, **MySQL**, and **Neo4j** databases, optimizing query performance and data retrieval times across applications.\n• Spearheaded development of modular frontend components using **Angular**, **Vue**, **React**, and **Next.js**, applying **automation practices** to improve UI efficiency.\n• Applied automated unit testing with **PyTest** and integration testing with **Selenium**, ensuring high-quality outputs and reduced bug rates in the software lifecycle.\n• Collaborated on complex technical discussions focused on architecture decisions, contributing to improved design patterns and development strategies in the team.\n• Emphasized problem-solving and collaboration throughout all project stages, leading to innovative solutions in architecture and user experience."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "● Executed **full-stack development** of an e-commerce platform using **Python** (FastAPI, Django, Flask), enhancing system scalability and performance by **30%**.\n● Developed robust **RESTful APIs** ensuring seamless integration for high-volume transactions, improving user interactions by handling **over 10,000** requests concurrently.\n● Optimized and managed transactional databases with **PostgreSQL** and **MySQL**, reducing query latency by **40%** through effective use of ORMs (SQLAlchemy, Django ORM).\n● Collaborated on architectural design discussions for integrating **gRPC** services, ensuring efficient communication between microservices and enhancing overall system performance.\n● Implemented and maintained **CI/CD pipelines** with **GitHub Actions**, ensuring consistent delivery with automated testing that increased deployment speed by **50%**.\n● Containerized Python applications using **Docker**, facilitating scalable deployments across **5** different environments.\n● Worked with **NoSQL databases** (MongoDB, Redis) to handle unstructured data, achieving **99.9%** availability.\n● Performed thorough unit and integration testing with **PyTest**, achieving **90%** code coverage and enhancing code quality through **clean coding** practices.\n● Conducted performance testing using **Apache JMeter**, identifying bottlenecks and ensuring the system handled peak traffic loads of **3000+** users without degradation.\n● Improved frontend user experiences by using JavaScript frameworks like **React** and **Angular**, achieving a load time reduction to under **2 seconds**.\n● Streamlined communication through the implementation of **gRPC** for microservice interactions, enhancing service response times.\n● Participated in technical discussions to address complex problems effectively, fostering collaboration among cross-functional teams.\n● Contributed to product discussions, ensuring alignment between technical implementations and business objectives."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, RESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Neo4j\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD pipelines\n\n**Cloud & Infrastructure:**\n\tNginx, Certbot\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, clean coding, automation practices, problem solving, collaboration, technical discussions, product discussions"
}