{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior AI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior AI Engineer with 13+ years of experience in developing AI-driven applications, specializing in **Python**, **pandas**, and **automation** techniques. Proven expertise in building AI/ML-powered platforms that incorporate **NLP** and leverage **LLMs** for enhanced predictive analytics and data organization. Skilled in API integration and workflow automation, ensuring seamless communication across systems. Strong background in full stack development, with proficiency in **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, to deliver high-performance applications across the healthcare and financial sectors.\nExperienced in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and event-driven architectures that align with compliance standards, including HIPAA and PCI DSS. Additionally, well-versed in MLOps practices using **MLflow**, **Airflow**, and **Kubeflow** for effective model training, serving, and orchestration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Utilized **Python** with libraries like **pandas** for data cleaning and organization to develop sophisticated AI models that enhance automation in healthcare and finance domains.\n- Designed and integrated robust APIs for seamless communication between AI models and applications, ensuring efficient data flow and user interaction.\n- Applied NLP techniques to process and analyze vast datasets, enhancing the capability of LLMs for improved insights and predictions.\n- Developed automation workflows facilitating the deployment of AI solutions across varied platforms, optimizing productivity and reducing manual intervention by **30%**.\n- Collaborated with cross-functional teams to transform complex data into actionable insights through effective communication, enabling informed decision-making.\n- Implemented advanced AI and NLP features, resulting in a **25%** increase in user engagement and streamlined operations.\n- Ensured rigorous testing and validation of AI scripts and models using frameworks like **pytest** to maintain high quality and reliability of deployed solutions.\n- Streamlined data organization processes using automated scripts, enhancing data accessibility and reducing processing time by **40%**.\n- Spearheaded the adoption of workflow automation tools that expedited project delivery timelines, resulting in overall project efficiency improvements by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed robust AI solutions utilizing **Python** and **pandas** for efficient data cleaning and organization, enhancing the overall accuracy of data handling in financial systems.\nAutomated data workflows and processes, improving efficiency by up to **35%** through innovative use of **API** integrations and **automation** strategies.\nImplemented Natural Language Processing (NLP) techniques to enhance user interaction and communication with financial systems, resulting in a **20%** increase in user satisfaction ratings.\nDesigned and developed machine learning models using **scikit-learn** and **XGBoost** for predictive analytics, ensuring proactive fraud detection and risk management based on user behavior and transaction patterns.\nCollaborated cross-functionally to deploy LLMs, achieving seamless integration into existing workflows and applications, positively impacting transaction processing times by **15%**.\nUtilized advanced data organization techniques to enhance the quality and accessibility of financial datasets, which streamlined data-driven decision-making processes.\nLed the implementation of workflow automation solutions that reduced manual data entry by **50%**, allowing for more focus on strategic initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **pandas** for data cleaning, organization, and manipulation to streamline data preprocessing for AI/ML model training, enhancing workflow automation across the project by **30%**.\nDesigned and implemented AI-driven solutions utilizing Natural Language Processing (**NLP**) techniques for improved interaction with large language models (**LLMs**) to automate customer support workflows, reducing response time by **50%**.\nDeveloped and optimized **APIs** for AI applications, ensuring seamless integration of various data sources and third-party services that improved data accessibility and usability.\nEngineered end-to-end machine learning pipelines to automate data collection, feature extraction, and model evaluation, achieving a **15%** boost in predictive accuracy for key business metrics.\nCollaborated with cross-functional teams to communicate data insights and AI implementations effectively, fostering a culture of data-driven decision-making within the organization.\nImplemented best practices for AI governance and ethical AI deployment, including data privacy considerations to ensure compliance with GDPR and internal standards."
    }
  ],
  "skills": "AI, NLP, automation, data cleaning, data organization, workflow automation, communication,\n\n**Programming Languages:**\n\tPython, pandas\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT",
  "apply_company": "Twine"
}