{
  "name": "Tomasz Lee",
  "role_name": "Senior Security Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Security Engineer with over 9 years of comprehensive experience in security compliance, automation, and vulnerability management. Proficient in **AWS**, **Kubernetes**, **Terraform**, and incorporating **CI/CD** practices to enhance security and operational efficiency. Strong expertise in ISO 27001, SOC 2, GDPR compliance frameworks, along with skills in threat analysis and penetration testing. Adept at implementing security controls and conducting security reporting to ensure adherence to best practices. With a solid background in .NET Full Stack Development, I leverage my knowledge of **microservices architecture**, **ReactJS**, **NextJS**, and **Redis** to integrate security measures throughout the software development lifecycle. Proven track record of effective stakeholder communication and securing collaborative achievements across development teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted threat analysis and vulnerability management to ensure compliance with **ISO 27001** and **SOC 2** standards, enhancing security posture.\nDeveloped and implemented automation scripts in **Python** to streamline security processes and reporting, reducing manual workload by 30%.\nImplemented infrastructure as code using **Terraform** to optimize and secure cloud resources on **AWS**, achieving a 20% increase in efficiency.\nManaged container orchestration and deployment using **Kubernetes**, improving application scalability and infrastructure reliability by 25%.\nLed the design and execution of security compliance frameworks, ensuring adherence to **GDPR** standards across projects.\nPerformed penetration testing and security assessments, identifying critical threats and vulnerabilities, leading to a 40% reduction in security incidents.\nEstablished robust security controls and reporting to enhance stakeholder communication and raise awareness of security initiatives.\nUtilized CI/CD pipelines to automate security checks and integrate security practices into development workflows, reducing deployment risks by 35%.\nCollaborated with cross-functional teams to implement effective security measures and provide guidance on best practices for security compliance."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **AWS** infrastructure solutions, leading to enhanced security compliance and streamlined project deployments.\nAutomated vulnerability management workflows using **Terraform** and **Python**, improving efficiency by **40%** in threat analysis and reporting.\nDeveloped and maintained CI/CD pipelines with **GitHub Actions**, which reduced deployment errors by **30%**, ensuring robust security controls are in place.\nUtilized **Kubernetes** for container orchestration, achieving a **20%** reduction in operational overhead and improving service availability.\nExecuted penetration testing strategies to uncover security weaknesses, ensuring adherence to **ISO 27001** and **SOC 2** standards.\nConducted comprehensive security compliance audits aligned with **GDPR**, enhancing the organization's data protection frameworks.\nCreated and maintained documentation for security reporting, which facilitated better stakeholder communication and transparency.\nLed training sessions on security best practices, resulting in **50%** fewer security incidents and increased awareness among the development team.\nCollaborated with cross-functional teams to integrate security considerations throughout the application development lifecycle, fostering a culture of security-first development.\nRegularly participated in threat analysis meetings to assess risks and develop strategies to mitigate potential vulnerabilities."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Ensured **security compliance** with standards such as **ISO 27001**, **SOC 2**, and **GDPR**, enhancing overall organizational security by implementing key policies and practices.\nUtilized **AWS** for secure cloud infrastructure management, achieving a 30% reduction in overhead costs through automated resource provisioning.\nApplied **Kubernetes** to orchestrate containerized applications, ensuring 99.9% uptime and streamlined deployment processes.\nDeveloped and implemented **Infrastructure as Code** using **Terraform** to automate infrastructure setup and maintenance, reducing deployment times by **40%**.\nExecuted **vulnerability management** processes, identifying and mitigating **20** critical vulnerabilities per month through comprehensive security assessments.\nPerformed **penetration testing** and **threat analysis** to proactively safeguard systems, leading to a **50%** decrease in potential security incidents.\nCollaborated with cross-functional teams to define and implement **security controls**, ensuring alignment with project goals and stakeholder expectations.\nDelivered regular **security reporting** to stakeholders, enhancing visibility into security posture and compliance efforts.\nAutomated routine security tasks and responses, improving operational efficiency by **25%** and enabling faster incident response times.\nConducted training sessions on **security best practices**, improving team knowledge and awareness, which resulted in a **15%** increase in compliance adherence."
    }
  ],
  "skills": " **Programming Languages** \n\t Python, JavaScript, TypeScript, C#, Solidity \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices \n\n **Frontend Frameworks** \n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL \n\n **Serverless and Cloud Functions** \n\t AWS \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n **DevOps** \n\t CI/CD, Kubernetes, Infrastructure as Code, Terraform \n\n **Cloud & Infrastructure** \n\t Azure \n\n **Other** \n\t UX/UI Design, Git, GitHub, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, ISO 27001, SOC 2, GDPR, vulnerability management, threat analysis, penetration testing, security compliance, automation, security controls, security reporting, stakeholder communication",
  "apply_company": "Jimdo"
}