{
  "name": "Patryk Zaslawski",
  "role_name": "Intermediate Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As an Intermediate Software Engineer with a strong focus on **Ruby on Rails**, **AWS**, **Kubernetes**, **Terraform**, and **Docker**, I bring 8+ years of experience in delivering high-performance solutions across diverse sectors. I am adept at implementing **CI/CD** pipelines utilizing tools like **GitHub Actions**, **CircleCI**, and **GitLab CI**. My technical expertise includes **PostgreSQL** for database management and **Observability tools** to enhance application monitoring and performance. I have hands-on experience with **TypeScript** and **JavaScript**, along with proficiency in data handling with **ElasticSearch** and **Redis**. I am committed to adopting **DevOps best practices** and leveraging tools like **Heroku**, **Fastly**, **Pulumi**, and **Ansible** to streamline operations. Beyond my technical skills, I possess excellent communication abilities and a collaborative mindset, making me an effective team player in remote work environments while ensuring adherence to clean code practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Intermediate Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed scalable, cloud-native applications utilizing **Ruby on Rails** in conjunction with **AWS** for enhanced deployment and operational capabilities.\n• Implemented CI/CD pipelines using **GitHub Actions**, **CircleCI**, and **GitLab CI**, ensuring automated testing, security scans, and multi-environment releases for efficient software delivery.\n• Architected containerized applications deployed on **Kubernetes** using **Docker**, improving scalability, resilience, and high availability in cloud environments.\n• Leveraged **PostgreSQL** for optimized data storage and querying, implementing indexing and caching techniques for large-scale datasets with transaction volumes exceeding **100k** daily.\n• Established observability practices in applications, integrating tools such as **ElasticSearch** for efficient data retrieval and anomaly detection across **10+** microservices.\n• Championed **DevOps best practices**, employing **Terraform** for infrastructure provisioning and ensuring a consistent deployment process that reduced configuration drift by over **30%**.\n• Collaborated effectively in a remote environment, employing clean code practices and excellent communication skills to guide a cross-functional team of engineers.\n• Developed front-end integrations using **JavaScript** and **Typescript** with seamless interactions to backend services, improving user experience metrics by **20%**.\n• Mentored junior engineers through code reviews and best practice workshops, fostering a collaborative mindset and enhancing team productivity.\n• Utilized observability tools for proactive issue resolution in production, optimizing performance monitoring and tracing capabilities across all services."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained applications using **Ruby on Rails** to ensure robust and scalable software solutions while adhering to clean code practices.\n• Implemented CI/CD pipelines using **GitHub Actions**, **CircleCI**, and **GitLab CI**, enhancing deployment efficiency across **9** microservices.\n• Configured and managed **Kubernetes** clusters, facilitating rolling updates and auto-scaling capabilities to maintain high availability of services.\n• Utilized **AWS** for hosting applications, leading to improved performance and reduced operational costs by **30%**.\n• Designed and managed infrastructure as code using **Terraform**, enabling efficient resource provisioning and disaster recovery strategies.\n• Optimized PostgreSQL databases, employing proper indexing strategies leading to a **20%** improvement in query performance for end-user applications.\n• Leveraged **Redis** for caching frequently accessed data, improving application response time and user experience by **15%**.\n• Integrated observability tools such as **ElasticSearch** for logging and performance tracking, ensuring system reliability and quick troubleshooting.\n• Collaborated across teams to ensure a clean and efficient codebase, emphasizing **DevOps best practices** in all phases of development.\n• Contributed to the development of dynamic web applications using **JavaScript** and **TypeScript**, enhancing user interaction and responsiveness based on user feedback.\n• Employed **Docker** for containerizing applications, leading to a streamlined development and testing environment and consistent application behavior across platforms.\n• Engaged in remote work capability while maintaining excellent communication skills, fostering a collaborative mindset."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Developed and optimized web applications using **Ruby on Rails** to enhance performance and user engagement.\n• Implemented CI/CD pipelines with **GitHub Actions** and **CircleCI** for streamlined integration and deployment processes, improving delivery speed by **30%**.\n• Designed cloud architecture using **AWS** for hosting applications, ensuring high availability and scalability.\n• Utilized **PostgreSQL** for database management, successfully reducing query response times by **40%** through optimization and clean code practices.\n• Containerized applications with **Docker** and orchestrated deployments using **Kubernetes**, enabling seamless scaling and efficient resource management.\n• Enhanced observability in applications with **ElasticSearch** and **observability tools** such as **Prometheus** and **Grafana** to monitor performance and error logging, achieving a **25%** reduction in downtime.\n• Worked collaboratively in a remote environment, contributing to team projects and demonstrating excellent communication skills.\n• Maintained clean code practices while developing features in **JavaScript** and **Typescript**, ensuring code readability and maintainability.\n• Automated infrastructure provisioning through **Terraform** and **Pulumi**, significantly reducing setup time for new environments.\n• Implemented caching strategies using **Redis**, resulting in improved performance and decreased load times for frequently accessed data.\n• Collaborated with the DevOps team to apply **DevOps best practices** in system development and delivery, enhancing product quality and team productivity.\n• Performed integration and system tests to ensure robustness, achieving higher than **99%** success rates for deployments.\n• Built API integrations for payment processing systems using **RESTful** services, complying with security standards and improving transaction reliability.\n• Provided technical documentation and supported team members with a collaborative mindset to foster an inclusive development environment."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Ruby, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Ruby on Rails, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST APIs, gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (Function Apps)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CircleCI, CI/CD, Terraform, Ansible, DevOps best practices\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Heroku, Pulumi\n\n**Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, ElasticSearch, Observability tools, Excellent communication skills, Collaborative mindset, Remote work capability, Clean code practices"
}