{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Product-Aware Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a detail-oriented Product-Aware Software Engineer, I bring 8 years of experience in full-stack development, leveraging technologies such as **Java**, **Kotlin**, **Groovy**, **Quarkus**, and **Spring Boot** to deliver high-impact solutions. My strong proficiency in **AWS** cloud services, **PostgreSQL** for database management, and CI/CD practices using **Jenkins**, **Docker**, and **Terraform** ensures the creation of efficient, scalable, and maintainable applications.\nI excel in the design and implementation of **Microservices** and **RESTful Web Services**, and I utilize **OpenSearch** for enhanced data retrieval. With hands-on experience in programming languages like **React**, **NodeJS**, and **Python**, I effectively collaborate with cross-functional teams to drive product development using Agile methodologies.\nAdditionally, my proven problem-solving, communication, and leadership skills allow me to guide teams in achieving project goals while maintaining a strong focus on quality and compliance. My background in modern technologies and frameworks positions me to create user-centric solutions that align with both current and future product needs.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Product-Aware Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Java**, **Kotlin**, and **Groovy** within **Spring Boot** and **Quarkus** to architect and develop scalable microservices, contributing to high-quality software delivery aligned with Agile methodologies.\nDeveloped and maintained RESTful Web Services ensuring compliance with industry standards, enhancing communication between services while optimizing performance in a microservices architecture.\nLeveraged **AWS** for deploying applications and managing cloud resources, ensuring seamless integration with local development environments and fostering continuous delivery through **Jenkins**.\nDesigned and managed database schemas using **PostgreSQL** along with **Liquibase** for version control in database schema changes, ensuring data integrity and smooth migrations across the development lifecycle.\nImplemented CI/CD pipelines using **Docker** and **Jenkins**, focusing on automated testing strategies with **JUnit 5** and **Spock** for robust unit and integration testing of microservices.\nDeveloped solutions for real-time data processing and advanced search functionalities using **OpenSearch**, enhancing the efficiency of data retrieval from large datasets.\nCollaborated with cross-functional teams to resolve complex challenges, employing strong problem-solving and communication skills, leading discussions and decision-making processes.\nLed initiatives to integrate **Terraform** and **Ansible** for infrastructure as code, streamlining provisioning and configuration management in cloud deployments.\nEngaged in leadership activities, mentoring junior developers and fostering a culture of collaboration and continuous improvement across teams.\nExplored modern front-end frameworks to develop user interfaces using **React** and **NodeJS**, contributing to a consistent and high-quality user experience in health and finance applications.\nIntegrated mobile development using **Swift** and **SwiftUI** for iOS platforms, delivering exceptional user experiences alongside existing mobile workflows built on **Flutter** and **React Native**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java**, **Kotlin**, and **Groovy** to develop and enhance back-end services within a microservices architecture, ensuring robust scalability and performance for diverse product applications.\nImplemented **Quarkus** and **Spring Boot** frameworks for smooth deployment and orchestration of services, achieving a **30%** reduction in latency and improved system efficiency.\nDesigned and managed CI/CD pipelines using **Jenkins** and **Docker**, facilitating automated testing and deployment processes, resulting in a **25%** increase in development speed.\nDeveloped and integrated databases with **PostgreSQL**, ensuring data integrity and optimized access patterns, leading to a **40%** improvement in query performance.\nApplied **AWS** and **Terraform** for infrastructure automation and management, successfully migrating **70%** of on-premise services to the cloud environment.\nLed agile squads in incorporating **Agile methodologies** and best practices, improving team collaboration and communication, and reducing project delivery timelines by **15%**.\nEnhanced existing applications using **React (18)** for front-end frameworks, ensuring a seamless user experience with a responsive UI for high-traffic applications.\nPromoted effective team collaboration and problem-solving strategies, driving initiatives that increased overall team productivity while fostering a culture of continuous improvement.\nDemonstrated leadership by conducting code reviews and mentoring junior developers, enhancing team skill sets and project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Java**, **Kotlin**, and **Groovy** to develop scalable backend services, enhancing system performance and reliability, with a focus on **Microservices** architecture and **RESTful Web Services** implementation across multiple platforms.\nDesigned and implemented robust applications using **Spring Boot** and **Quarkus**, ensuring high availability and seamless deployment pipelines with **Jenkins** for CI/CD, reducing deployment time by up to **50%**.\nUtilized **AWS** for cloud infrastructure, managing resources efficiently and ensuring application scalability to handle up to **10,000** concurrent users without latency issues.\nBuilt and maintained PostgreSQL databases, using **Liquibase** for version control of database migrations, resulting in a **30%** improvement in deployment reliability and performance.\nEngaged in Agile methodologies, facilitating effective collaboration and communication within cross-functional teams, leading to **20%** increase in project delivery speed.\nImplemented effective caching strategies using **Docker** and **OpenSearch**, drastically improving application response time and supporting high-traffic scenarios.\nApplied testing frameworks such as **JUnit 5** and **Spock** to ensure high-quality code standards, achieving a test coverage of **90%** across all services.\nEncouraged and mentored junior developers, enhancing team skills in **NodeJS** and **React**, promoting a culture of learning and problem-solving.\nDeveloped user-friendly interfaces using **React** and **SwiftUI** for mobile applications, focusing on creating responsive designs that improved user engagement by **25%**.\nProactively identified and resolved technical challenges, showcasing strong leadership and problem-solving abilities throughout the project lifecycle."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, Kotlin, Groovy, Python, JavaScript/TypeScript, Swift, SwiftUI\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Quarkus, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tMicroservices, RESTful Web Services\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Liquibase\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, OpenSearch, Authentication & Security (Keycloak, JWT, OAuth2), Agile methodologies, Collaboration, Problem-solving, Communication, Leadership"
}