{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with 9+ years of experience in designing and developing scalable applications using **Node.js**, **TypeScript**, **REST**, and **GraphQL**. Proficient in both SQL and NoSQL databases to ensure efficient data handling and storage solutions. Demonstrated expertise in cloud services, particularly **AWS**, alongside containerization technologies like **Docker** and **Kubernetes**. Proven track record in optimizing backend performance, implementing microservices architecture, and creating robust APIs. A collaborative team player with strong leadership skills, adept at driving projects to successful outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and maintained RESTful APIs using **Node.js** and **TypeScript**, ensuring efficient data handling and communication between services.\n• Designed and implemented GraphQL services for flexible and efficient querying, resulting in enhanced performance and reduced data transfer by **30%**.\n• Collaborated on architecture decisions for integrating **AWS** services, optimizing cloud infrastructure for scalability and cost-efficiency.\n• Leveraged **Docker** and **Kubernetes** for containerization and orchestration, streamlining deployment processes and increasing system resilience.\n• Worked with both **SQL** and **NoSQL** databases, ensuring robust data storage solutions tailored for specific application needs, improving data retrieval times by **25%**.\n• Spearheaded CI/CD processes, establishing automation pipelines that cut deployment times by **40%**, enhancing team productivity.\n• Developed and executed performance optimization strategies for backend services, achieving an overall system efficiency increase of **35%**.\n• Ensured high standards of code quality through rigorous testing and peer reviews, leading to a **20%** reduction in production bugs.\n• Engaged with cross-functional teams to refine platform requirements, ensuring alignment with user expectations and business goals."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and maintained backend services using **Node.js** and **TypeScript**, ensuring high-quality and efficient code for backend architecture.\nImplemented **REST** and **GraphQL** APIs facilitating seamless communication between client and server, leading to a 20% increase in data retrieval speed.\nDesigned and optimized **SQL** and **NoSQL** databases for data storage solutions, improving query efficiency by 30%.\nLeveraged **AWS** cloud services for deploying applications, resulting in reduced infrastructure costs by 15%.\nContainerized applications using **Docker** and orchestrated them with **Kubernetes**, enhancing the deployment process and reducing runtime errors by 25%.\nMentored junior developers and conducted code reviews, fostering a culture of continuous improvement and increasing team output by 20%.\nCollaborated with cross-functional teams to define system requirements and development timelines, ensuring project deliverables were met within the given **3-month** timeline.\nExecuted CI/CD methodologies for automated testing and deployment workflows, reducing manual coding errors by 45%.\nUtilized performance monitoring tools to track application health, leading to a proactive approach in identifying and addressing system bottlenecks.\nEngaged in sprint planning and retrospective meetings, contributing to a **15%** improvement in team velocity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and maintained RESTful APIs using **Node.js** and **TypeScript** for efficient communication between frontend and backend systems.\nDesigned and implemented scalable database solutions using **SQL** and **NoSQL**, improving data retrieval speeds by **15%**.\nConfigured containerized applications with **Docker** and orchestrated deployment using **Kubernetes**, enhancing system scalability.\nUtilized **AWS** services for hosting applications and managing data, ensuring high availability and performance.\nCreated and maintained GraphQL APIs for seamless data fetching, resulting in a 25% reduction in frontend load time.\nEngaged in code reviews and pair programming sessions to ensure high-quality code delivery and adherence to best practices.\nParticipated actively in Agile ceremonies including daily standups to track progress and align with team objectives.\nDeveloped comprehensive technical documentation and onboarding materials to streamline knowledge transfer across teams.\nImplemented CI/CD pipelines for automated testing and deployment, reducing deployment time by **40%**.\nLed efforts to optimize system performance, achieving a **30%** increase in response times through code refactoring and load balancing."
    }
  ],
  "skills": " **Programming Languages**\n\t TypeScript, Node.js, Python\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\t HTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t REST, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL, NoSQL\n\n**DevOps**\n\t Docker, Kubernetes, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t AWS, Azure\n\n**Other**\n\t UX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Redux",
  "apply_company": "TechTree"
}