{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Experienced Senior Software Engineer with 13+ years in developing high-performance applications, proficient in **TypeScript**, **React**, **AWS**, **Azure**, **CI/CD**, and **Terraform**. Demonstrated expertise in both frontend and backend development, leveraging **.NET**, **C#**, **Go**, and **Rust** to create scalable solutions.\nSeasoned in building digital identity systems including **Verifiable Credentials** and **Open Banking**, as well as utilizing AI to enhance user experiences. Committed to implementing robust architectures with **Kubernetes** and aligning development with user stories and design documents to ensure clear communication and project success.\nProficient in deploying microservices and event-driven architectures, while maintaining compliance with industry standards such as HIPAA and PCI DSS. Strong background in MLOps with skills in model training and orchestration using tools like MLflow and Airflow.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable and secure applications utilizing **TypeScript**, **React** (versions **17–18**), and **C#** within the **.NET** framework to enhance functionality and user experience in healthcare and fintech sectors.\n• Implemented CI/CD pipelines with **Azure DevOps**, ensuring seamless integration and delivery through automated workflows and utilizing tools such as **Terraform** for infrastructure as code.\n• Designed and managed microservices architectures using **Kubernetes** for orchestration, enabling high availability, fault tolerance, and efficient resource management across production environments.\n• Collaborated on user stories and design documents to create clear specifications that guide development, improving communication within the team and stakeholders for agile project execution.\n• Integrated cloud services from **Azure** and **AWS** to enhance application performance and reliability, focusing on **Digital Identity** and **Open Banking** solutions to secure user data and transactions.\n• Construed advanced algorithmic solutions in **Rust** and **Go**, optimizing performance for backend processes, while also incorporating machine learning components using **AI** techniques.\n• Effectively coordinated with cross-functional teams to deliver documentation and reports, ensuring clarity of project status and expectations throughout the development cycle.\n• Utilized testing frameworks such as **Jest** and **Cypress** to validate functionality, enhancing code quality through automated testing strategies across multiple environments.\n• Championed the adoption of best practices in code reviews and architectural discussions, fostering a culture of continuous improvement and technical excellence among peers.\n• Mentored junior developers, sharing expertise in **C++** and robust software design principles, while encouraging effective communication and collaborative development practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Focused on implementing **Azure** solutions to enhance cloud infrastructure for financial applications, improving deployment efficiency by **30%** through **CI/CD** pipelines.\nLed the development of scalable APIs in **TypeScript** and **C#** within the **.NET** framework, resulting in a **25%** increase in transaction throughput.\nUtilized **React** (18) and **Next.js** to build dynamic user interfaces for financial services platforms, increasing user engagement metrics by **40%**.\nEmployed **Terraform** and **Kubernetes** for orchestration and infrastructure as code, streamlining deployment processes and reducing setup time by **50%**.\nExecuted data migration strategies that adopted industry standards for **Digital Identity** and **Open Banking**, ensuring compliance and security in user transactions.\nDeveloped comprehensive design documents and user stories to guide software development lifecycle, facilitating communication across cross-functional teams.\nImplemented machine learning models for enhancing fraud detection capabilities using **AI** technologies, achieving a **20%** reduction in false positives.\nCollaborated on key initiatives, integrating **AWS** services for improved data storage and processing capabilities, optimizing performance of analytics workflows."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** in the development of robust applications, enhancing code quality, maintainability, and team collaboration through clear documentation and thorough user stories.  \nDesigned and optimized backend services with a focus on **C#**, **.NET**, and **Azure** for scalability and performance in enterprise-level solutions, ensuring up to **99.9%** system uptime.  \nEngineered CI/CD pipelines utilizing **Terraform** and **Kubernetes** for streamlined deployments, improving delivery time by up to **40%** while maintaining high standards of code quality.  \nLed the development of microservices in **Go** and **Rust**, catering to high-throughput environments, achieving latency improvements of **25%** on key operations.  \nImplemented and managed digital identity solutions with a focus on **Open Banking** and **Verifiable Credentials**, ensuring secure data management and compliance with regulations.  \nCollaborated with cross-functional teams to create detailed design documents and effectively communicate project updates, fostering an informed team environment and facilitating efficient project delivery.  \nDrove the integration of AI functionalities to enhance system capabilities, utilizing advanced algorithms to improve user experience and decision-making processes.  \nContinuously engaged in code reviews and knowledge sharing to uplift team performance, focusing on best practices in software development and enhancing team communication.  \nActively contributed to building secure systems with role-based access control (RBAC) and OAuth 2.0 protocols ensuring compliance with GDPR and safeguarding user data."
    }
  ],
  "skills": "Programming Languages:\n\tTypeScript, Python, C#, Rust, Go, C++, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOpen Banking, Digital Identity, Verifiable Credentials, OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, CI/CD, Communication, User Stories, Design Documents",
  "apply_company": "Propellerhead"
}