{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Engineer - AI trainer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a proactive Software Engineer with 8 years of experience, I excel in developing and implementing AI models while creating engaging educational content to aid in technical assessments and coding challenges. My robust expertise in **JavaScript**, **TypeScript**, **Python**, and **Flutter** technologies positions me well to integrate AI-driven insights into high-performance solutions across sectors like healthcare and finance. \nI have a strong foundation in software engineering principles and a proven track record in building enterprise-grade platforms with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My experience includes comprehensive cloud services with **Azure** and **AWS** to enhance application deployment and scalability. \nWith a solid background in microservices architecture and event-driven systems, I focus on creating secure, compliant applications while utilizing CI/CD automation to enhance project efficiency. I bring expertise in developing machine learning pipelines and serving models in production environments, leveraging tools such as **MLflow**, **Airflow**, and **Kubeflow**. I possess strong critical thinking, communication, and collaboration skills, enabling me to effectively work with cross-functional teams and deliver impactful results.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer - AI trainer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Showcase expertise in **software engineering** by developing and implementing reliable **AI models** for educational content evaluation and enhancement.\nUtilize **technical assessments** and **rubrics** to create impactful **coding challenges** that improve student learning outcomes and skills in computer science.\nEmploy **critical thinking** to analyze feedback and outcomes from AI assessments, driving iterative improvements in educational strategies.\nDemonstrate strong **communication skills** while collaborating with cross-functional teams to ensure clarity in project objectives and deliverables, effectively integrating insights derived from AI solutions.\nDevelop and maintain comprehensive documentation for all coding challenges and assessments, ensuring alignment with educational standards and outcomes.\nFoster a collaborative environment by engaging with team members to brainstorm and implement innovative solutions for integrating AI into educational content.\nEvaluate the performance of developed AI solutions, tracking metrics and reporting findings to stakeholders for continuous improvement.\nConduct workshops or training sessions to educate team members on new AI-driven methodologies and tools, promoting skill development and knowledge sharing within the organization.\nUtilize programming languages and tools such as **Python**, **TensorFlow**, and **Docker** for building scalable AI applications that support educational services.\nImplemented automated testing frameworks and CI/CD pipelines to ensure high-quality outputs and consistent delivery of educational products and services."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged a strong foundation in **computer science** and **software engineering** to design, implement, and refine AI models for educational content through practical coding challenges and technical assessments.\nUtilized **critical thinking** skills to evaluate and enhance existing AI models, ensuring they meet rigorous educational rubrics and provide valuable learning outcomes.\nCollaborated effectively within a cross-functional team to develop coding challenges that assess knowledge in **software engineering** concepts, promoting best practices and industry standards.\nCommunicated complex technical ideas clearly, facilitating discussions around the implementation of AI solutions and the assessment criteria for student evaluations.\nApplied advanced **collaboration** techniques to gather feedback from stakeholders, enhancing the relevance and quality of educational content tailored for diverse learning environments.\nImplemented coding assessments by using **machine learning** frameworks such as TensorFlow and PyTorch, resulting in a **30% increase** in user engagement and successful challenge completions.\nEvaluated over **100** coding submissions for AI training projects, utilizing tailored rubrics to improve assessment accuracy and student feedback.\nDesigned and launched **5** innovative educational modules focused on AI concepts, directly correlating with enhancements in retention rates by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented AI models to enhance the learning experience for coding challenges and technical assessments, utilizing critical thinking to create tailored rubrics that assess participant performance effectively.\nApplied computer science and software engineering principles to develop educational content that simplifies complex AI concepts for diverse audiences, ensuring clarity and engagement through effective communication skills.\nCollaborated with cross-functional teams to design and evaluate coding challenges that align with industry standards and best practices, fostering a culture of collaboration and shared knowledge.\nConducted comprehensive reviews of technical assessments, providing constructive feedback and iterative improvements to enhance skill evaluation processes for participants.\nEngaged in continuous learning and adaptation of emerging AI technologies to incorporate innovative approaches in trainer methodologies, ensuring high-quality training delivered to all learners.\nUtilized tools and libraries like **TensorFlow** and **scikit-learn** for developing practical examples and explanations that illustrate AI models in a training environment.\nMonitored and analyzed feedback from participants to refine assessment rubrics and improve overall educational effectiveness, directly impacting student engagement and understanding.\nDesigned interactive and engaging assessments that reflect real-world challenges, incorporating strategies that engage learners and foster critical thinking skills.\nEnsured accessibility and inclusiveness in educational content design, aligning with industry standards and compliance guidelines for effective learning experiences."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tComputer Science, Software Engineering, AI Models, Technical Assessments, Rubrics, Coding Challenges, Critical Thinking, Communication Skills, Collaboration, Educational Content"
}