{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Solutions Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Solutions Engineer with 13+ years of full stack development expertise, skilled in delivering innovative solutions for decentralized applications and smart contracts within blockchain technology. Proficient in **Solidity**, **Rust**, and **MOVE**, enabling the creation of tokenized assets and Real World Assets (RWA) while providing architectural recommendations and technical configurations.\nExperienced in technical discovery and product demonstrations that effectively articulate the value of complex solutions to customers, driving sales processes and ensuring customer success. \nStrong proficiency in cloud-native application deployment and microservices architecture using **AWS** and **Azure**. Demonstrated ability in developing AI/ML-powered platforms that enhance predictive analytics and automation, leveraging advanced frameworks like **Python**, **FastAPI**, **Django**, and event-driven architectures. Committed to compliance-driven development with extensive knowledge of HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conduct technical discovery sessions to understand client needs and translate them into solutions involving **blockchain**, **decentralized applications**, and **smart contracts**.\nDevelop and present Proofs of Concept and product demonstrations showcasing the capabilities of **tokenized assets** and **RWA** strategies.\nProvide architectural recommendations to enhance client systems with technologies such as **Solidity**, **Rust**, and **MOVE**, ensuring scalability and security.\nEngage with clients throughout the sales process, ensuring alignment of solutions with customer success metrics and long-term business goals.\nCollaborate with technical teams to configure solutions that utilize **blockchain technology** for robust asset tokenization and decentralized protocol implementations.\nImplement successful strategies to integrate **smart contract** functionalities into existing infrastructures.\nAssess and advise on the technical configuration of **RWA** and **tokenized assets**, focusing on compliance and operational efficiency.\nFacilitate workshops and training sessions to educate clients on the benefits and use-cases of **blockchain** technologies, ensuring they are equipped to leverage their investments.\nSupport customer success initiatives by troubleshooting and resolving technical issues, ensuring a seamless experience with **decentralized applications**.\nAnalyze transaction data and feedback to improve the functionality and user experience of blockchain solutions provided to clients."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted technical discovery sessions to assess client needs and provide architectural recommendations, ensuring alignment with customer requirements for blockchain and decentralized applications.\nDeveloped and demonstrated **Proofs of Concept** for **smart contracts** and **tokenized assets** using **Solidity** and **Rust**, showcasing the functionality and advantages of proposed solutions to stakeholders.\nCollaborated with cross-functional teams to design and implement **decentralized applications**, integrating technical configurations that enhance the user experience and system performance.\nLed product demonstrations highlighting the use of **MOVE** for developing secure and efficient decentralized finance solutions, garnering interest from potential clients.\nEnsured customer success by providing tailored solutions and efficient responses during the sales process, achieving a **30% increase** in project closures over a **6-month** period.\nUtilized expertise in **technical configurations** to reduce deployment times by **40%**, successfully implementing modular architectures that support **RWA** (Real-World Assets) transactions.\nExecuted training sessions for clients to effectively use programmable assets, resulting in a **25% improvement** in user adoption rates and satisfaction scores.\nMaintained strong relationships with key clients, providing ongoing support and gathering feedback to drive product enhancements and future development."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted technical discovery sessions to identify client requirements for **blockchain** solutions, ensuring alignment with business objectives in decentralized applications.\nEngineered **smart contracts** using **Solidity** and **Rust** for various projects, facilitating the seamless execution of transactions and automating workflows associated with **tokenized assets**.\nDeveloped **Proofs of Concept** to demonstrate the viability of solutions, highlighting the advantages of integrating **blockchain** technology into existing systems.\nProvided architectural recommendations for implementing decentralized applications, focusing on scalability and security enhancements tailored to client needs.\nLed product demonstrations showcasing the capabilities of **blockchain** solutions, addressing questions and providing insights to support the sales process and enhance customer success.\nCollaborated with cross-functional teams to conduct technical configuration of **blockchain** systems, ensuring compatibility with existing platforms and alignment with industry standards.\nUtilized **MOVE** as part of client projects to build secure and efficient blockchain applications, maximizing performance and reliability.\nEngaged with clients to provide ongoing support and ensure successful implementation of **blockchain** solutions, resulting in a **30%** increase in customer satisfaction ratings.\nImplemented decentralized application features that improved transaction times by **40%**, successfully meeting client SLAs and expectations.\nAssisted in the development and integration of Real World Assets (RWA) into **blockchain** projects, enabling clients to tokenize physical assets and increase liquidity."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Rust, Solidity, MOVE\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tblockchain, decentralized applications, smart contracts, RWA, tokenized assets, technical discovery, architectural recommendations, technical configuration, Proofs of Concept, product demonstrations, sales process, customer success, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Chainlink Labs"
}