{
  "name": "Tomasz Lee",
  "role_name": "Senior Mobile Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Mobile Engineer with 9+ years of experience in developing innovative mobile applications leveraging **Xamarin**, **C#**, and **.NET** technologies. Proficient in **Git** for version control and skilled in **Agile** methodologies to drive project success. Strong command of **MVVMCross** for improving application architecture and facilitating efficient development workflows, complemented by expertise in **CI/CD** to ensure seamless deployment processes. Adept in applying software design patterns to enhance code quality and performance. Recognized for excellent problem-solving capabilities and effective communication skills, fostering collaboration across teams to achieve project goals.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Mobile Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **.NET** and **C#** to design and implement robust mobile applications using **Xamarin**, enhancing code reusability across platforms by 30%.\nEmployed **Git** for version control and collaboration, ensuring streamlined workflows and enhanced team productivity, maintaining a 98% commit accuracy.\nAdopted Agile methodologies to drive project efficiency, participating in daily stand-ups and sprint reviews to ensure continuous alignment with project goals.\nDeveloped and maintained CI/CD pipelines, significantly reducing deployment times by **40%** using automated testing and deployment strategies.\nImplemented Software Design Patterns to improve code structure and maintainability, reducing technical debt by 25%.\nPartnered with UX/UI designers to create user-friendly interfaces, achieving a user satisfaction score improvement of up to **25%**.\nUtilized MVVMCross for enhanced data binding and separation of concerns, resulting in a more scalable application architecture.\nDemonstrated advanced Problem-Solving skills by troubleshooting and resolving software defects, maintaining a **90%** bug resolution rate.\nFostered effective Communication within cross-functional teams to ensure project alignment and timely delivery of milestones."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **C#** and **Xamarin** to design and develop mobile applications, applying **MVVMCross** for strong architectural patterns enhancing code maintainability.\nImplemented **Git** for version control and collaborated in an **Agile** environment to deliver features in increments, leading to a 20% reduction in development time.\nEstablished **CI/CD** pipelines to automate testing and deployment processes, resulting in a **30%** decrease in production deployment errors.\nExhibited strong **Problem-Solving** skills to troubleshoot application issues, improving software reliability by **15%**.\nCommunicated effectively with cross-functional teams to gather requirements, ensuring alignment with business objectives and timely project delivery.\nApplied **Software Design Patterns** to create scalable and reusable components, improving development efficiency by **25%** for future iterations.\nConducted regular code reviews and provided mentorship to junior developers, boosting team productivity and skill development.\nParticipated in sprint planning and retrospectives, contributing to overall project improvements and team cohesion."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C#** and **.NET** technologies to develop mobile applications, enhancing user experience and achieving a performance increase of **25%**.\nImplemented CI/CD pipelines using **Git** and Azure DevOps to automate deployment processes and reduce bugs by **30%**.\nDeveloped application features with **Xamarin** and **MVVMCross**, ensuring cross-platform compatibility and improving development efficiency.\nCollaborated in an Agile team environment, participating in daily standups and code reviews to streamline project execution and communication.\nApplied Software Design Patterns to create maintainable and scalable code structures, facilitating future enhancements and reducing technical debt.\nEngaged in problem-solving activities to troubleshoot and improve application functionality, contributing to overall product success.\nDelivered comprehensive technical documentation and guides that increased team knowledge transfer and onboarding speed by **50%**.\nContributed to the migration of legacy codebases to more modern frameworks, achieving a reduction in system load and improving maintainability."
    }
  ],
  "skills": "**Programming Languages**\n\tC#, Python, JavaScript, TypeScript\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Git, GitHub\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tAgile, MVVMCross, Software Design Patterns, Problem-Solving, Communication, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis",
  "apply_company": "AMCS Group"
}