{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Java Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Java Engineer with 13+ years of experience in delivering robust microservices-based applications. Proficient in **Java**, **Spring Boot**, **Spring Data JPA**, and **Spring Security** with solid skills in implementing **OAuth2** for secure authentication. Expert in containerization using **Docker** and orchestrating services with **Kubernetes** to ensure scalability and reliability. Strong understanding of relational databases, particularly **PostgreSQL**, along with caching strategies using **Redis**. Familiar with automated testing frameworks including **JUnit** and **Test Containers** to improve code quality.\n\nExperienced in Agile methodologies, utilizing **JIRA** for project management and team collaboration. Proven track record in leading successful development projects while maintaining high standards of communication and leadership. Additionally, adept in frontend frameworks like **Angular**, and well-versed in SOLID principles and design patterns that enhance software architecture. My background includes a comprehensive tech stack that blends innovation with efficiency, aimed at delivering high-performance solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed microservices architectures using **Java**, **Spring Boot**, and **Spring Data JPA**, ensuring maintainable and scalable applications.\n- Integrated secure authentication mechanisms with **Spring Security** and **OAuth2** to protect sensitive data and meet compliance requirements.\n- Utilized **Docker** for containerization, enabling consistent development and production environments, enhancing deployment speed by **40%**.\n- Managed high-performance data storage solutions with **PostgreSQL** and **Redis**, optimizing data retrieval and storage efficiency for improved application performance.\n- Led teams in applying agile methodologies through **JIRA**, focusing on collaboration and iterative development processes, ensuring timely delivery of project milestones.\n- Designed unit and integration tests using **JUnit** and **Test Containers**, achieving over **80%** test coverage to ensure code reliability and robustness against failures.\n- Collaborated in an Agile team to enhance project delivery, demonstrating strong leadership in coordinating tasks and fostering open communication among team members.\n- Advocated SOLID principles and Design Patterns in code reviews, promoting best practices and improving codebase sustainability.\n- Oversaw Kubernetes deployment strategies, resulting in reduced downtime and improved scaling during traffic spikes by **30%**.\n- Spearheaded interactive web application projects using **Angular**, enhancing user experience and interactivity with real-time data features.\n- Engaged in active communication with stakeholders to align project objectives, gather feedback, and implement necessary changes to meet business needs effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented microservices architecture using **Java** with **Spring Boot** and **Spring Data JPA** to modernize core financial platforms, enhancing scalability and performance for high-volume transactional systems.\nDeveloped containerized applications utilizing **Docker** and orchestrated deployments with **Kubernetes**, ensuring seamless scalability and efficient resource management.\nMaintained data integrity and optimized database performance using **PostgreSQL**, and integrated caching strategies with **Redis**, improving data retrieval times by over **50%**.\nLed **Agile** software development initiatives while collaborating with cross-functional teams via **JIRA**, ensuring timely delivery of features and enhancements.\nDesigned authentication and authorization mechanisms with **Spring Security** and **OAuth2**, securing APIs against unauthorized access.\nUtilized proven **SOLID** principles and **Design Patterns** to create maintainable and scalable code, reducing technical debt by **30%**.\nConducted unit and integration testing using **JUnit** and **Test Containers** to ensure code quality and reliability, achieving **90%** test coverage across all services.\nSpearheaded development of interactive front-end applications with **Angular**, ensuring responsive interfaces that improved user experience.\nFacilitated knowledge sharing and mentorship within the team, enhancing communication and strengthening team dynamics."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered robust **Microservices** using **Java** with **Spring Boot** to support scalable backend architecture, enhancing performance across key modules including checkout and order fulfillment processes.\nImplemented **Spring Data JPA** for efficient database interactions with **PostgreSQL**, ensuring seamless data transactions and integrity in high-traffic environments.\nEnforced security through **Spring Security** and **OAuth2**, developing role-based access control (RBAC) for secure platform interactions and GDPR compliance.\nDeveloped containerized applications utilizing **Docker** to ensure consistent environments for development, testing, and production, enhancing deployment efficiency by **30%**.\nExecuted Agile methodologies in project management using **JIRA**, improving team productivity and collaboration through structured sprints and feedback loops.\nLed initiatives to adopt **Kubernetes** for container orchestration, simplifying the management of microservices and automated scaling, thereby reducing downtime by **25%**.\nConducted unit testing with **JUnit** and integration testing using **Test Containers** to ensure high code quality and reliability, achieving a **90%** code coverage rate.\nUtilized caching with **Redis** to enhance performance and responsiveness of data access, optimizing frequently accessed resources to meet user demand effectively.\nPromoted effective leadership and communication within cross-functional teams to align project goals and deliverables, fostering an environment of innovation and accountability.\nDesigned user interfaces using **Angular** aligned with **SOLID principles** and established **Design Patterns**, ensuring maintainability and scalability for future developments."
    }
  ],
  "skills": "Programming Languages:\n\tJava, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tSpring Boot, FastAPI, Flask, Django, Spring Security\n\n**Frontend Frameworks:**\n\tAngular, React, Vue\n\n**API Technologies:**\n\tOAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMachine Learning: MLflow, Airflow, Kubeflow, Microservices, JUnit, Test Containers, SOLID, Design Patterns, Agile, JIRA, Leadership, Communication",
  "apply_company": "Inycom"
}