{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Build Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Build Engineer with a strong focus on project management, resource planning, and risk management, leveraging 13+ years of experience in delivering high-performance applications. Proficient in quality assurance and continuous improvement methodologies to ensure compliance with health and safety standards. Skilled in budgeting and site audits, emphasizing team collaboration and effective problem-solving to drive successful project outcomes.\nDemonstrated expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside hands-on experience in frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept at building AI/ML-powered platforms and deploying cloud-native systems on **AWS** and **Azure**, along with a strong background in microservices architecture and CI/CD pipelines.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Build Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Led project management initiatives focused on fibre and construction, ensuring the delivery of high-quality network activation projects through effective budgeting and resource planning.\nConducted comprehensive site audits to assess health and safety standards, adhering to NRSWA regulations and best practices for risk management in all project phases.\nCollaborated with cross-functional teams to drive continuous improvement in construction processes and quality assurance standards, resolving challenges and enhancing productivity.\nOversaw construction activities, implementing strong civils practices and ensuring compliance with industry safety regulations while managing potential risks throughout the project lifecycle.\nDeveloped and maintained project documentation, tracking budgets and resource allocations to ensure project milestones were met within **9**% of initial estimates.\nFacilitated team collaboration through structured meetings and reporting mechanisms, encouraging open communication and effective problem-solving among team members.\nImplemented strategies for performance metrics and quality checks, resulting in a **15%** improvement in project delivery times and overall team efficiency.\nExecuted detailed risk management plans to identify, analyze, and mitigate potential project issues, thus enhancing the success rate of fibre installations by **25%**.\nMonitored ongoing construction activities, ensuring adherence to timelines and quality benchmarks while addressing any deviations through proactive measures."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Led project management initiatives in the deployment of **fibre** network infrastructure, ensuring adherence to **health and safety** standards and **NRSWA** regulations across all sites.\nExecuted quality assurance processes and **site audits** on at least **20** construction projects, enhancing **resource planning** and minimizing risks by **30%** through continuous improvement strategies.\nSpearheaded budgeting efforts, maintaining project costs within **10%** of projections while ensuring timely completion of **network activation** tasks.\nCollaborated with cross-functional teams to identify problems and implement effective solutions, driving team collaboration and enhancing overall project delivery efficiency by **25%**.\nDeveloped and maintained comprehensive risk management frameworks, resulting in a **40%** reduction in project delays due to unforeseen issues.\nOversaw the integration of civils tasks with network builds, ensuring compliance with all construction standards and timely handover of completed projects to stakeholders.\nManaged multiple teams to drive progress on-site, utilizing problem-solving skills to address challenges and streamline construction operations."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Led project management initiatives focused on **construction** and **network activation**, ensuring timely and budget-efficient delivery while adhering to **health and safety** standards.\n- Conducted comprehensive **site audits** to assess project compliance with **NRSWA** regulations, promoting adherence to industry standards for quality assurance.\n- Collaborated with cross-functional teams to enhance **resource planning** and **budgeting**, achieving project targets within **10%** of planned costs and timelines.\n- Implemented risk management strategies that reduced project-related issues by **25%**, fostering a culture of **continuous improvement** and proactive problem-solving across engineering teams.\n- Developed and maintained **quality assurance** protocols, ensuring all construction modules met or exceeded established expectations for performance and safety.\n- Effectively utilized **team collaboration** tools to facilitate transparent communication among project stakeholders, resulting in improved project outcomes.\n- Championed **fibreglass** technology in network builds, leading to a **30%** increase in installation efficiency and reducing downtime during **network activation** phases.\n- Ensured compliance with civil engineering standards through rigorous **civils** oversight and innovative process adjustments, leading to a **20%** enhancement in project delivery time.\n- Developed and integrated **health and safety** processes that decreased on-site incidents by **15%**, creating a safer work environment for all personnel."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular  \n\n **Backend Frameworks:** \n\t  \n\n **Frontend Frameworks:** \n\t  \n\n **API Technologies:** \n\t  \n\n **Serverless and Cloud Functions:** \n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database  \n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis  \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose  \n\n **Cloud & Infrastructure:** \n\t  \n\n **Other:** \n\tfibre, construction, project management, health and safety, NRSWA, budgeting, resource planning, network activation, quality assurance, continuous improvement, civils, risk management, site audits, team collaboration, problem-solving",
  "apply_company": "GoFibre"
}