{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with expertise in **Go**, **Java**, and **C#**, bringing over 9 years of experience in developing complex applications. Proficient in backend development, utilizing technologies like **Postgres** and **Linux** to build scalable solutions. Strong background in automation and adherence to RFC standards, with hands-on experience in distributed systems and microservices architecture. Committed to enhancing performance and streamlining development processes. Known for effective collaboration across teams and leading projects to successful outcomes, while also possessing a keen interest in advanced technologies.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Exploited expertise in **C#** and **Linux** to spearhead the design and development of a web-based customer management platform using **.NET 7** and **ReactJS**, achieving a **25%** increase in user satisfaction.\nLeveraged **Go** and **Java** to design and implement a microservices architecture using **.NET Core**, enhancing system scalability and maintainability.\nIntegrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, resulting in improved system resilience and throughput.\nUtilized **Redis** for caching frequently accessed data, reducing database load and improving response times by **35%**.\nDeveloped RESTful APIs with **.NET**, integrated with a **MongoDB** database, providing seamless data access for various services.\nImplemented CI/CD pipelines on **Azure DevOps**, which reduced deployment time by **40%**.\nOptimized **MSSQL** database queries and indexing, significantly cutting down average query execution time by **20%**.\nCollaborated with UX/UI designers to improve the platform’s user interface, leading to a substantially enhanced user experience.\nDeveloped a reporting engine using **D3.js** and **Three.js** for interactive data visualizations, facilitating better data insights.\nImplemented JWT-based authentication and authorization protocols to secure the application and protect sensitive data."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed scalable applications using **Go** and **Java**, ensuring high-performance and maintainable codebases.\nImplemented advanced features and functionalities utilizing **C#** and **C++**, achieving a **30%** improvement in processing speed and system reliability.\nMaintained Linux-based environments for effective deployment and management of applications, leading to a **20%** reduction in system downtimes.\nManaged database systems including **PostgreSQL**, optimizing data queries for efficiency and performance, resulting in a **15%** reduction in query execution time.\nAutomated deployment processes using modern tools, improving overall pipeline efficiency and deployment cadence by **25%**.\nConducted thorough code reviews and provided mentorship for junior team members, elevating team proficiency and collaboration.\nAdopted best practices in software design and architecture, ensuring robust, scalable software solutions in line with company standards.\nEngaged with cross-functional teams to gather requirements, ensuring projects align with strategic goals and deadlines.\nUtilized **QEMU** for virtualization, enhancing testing capabilities across different environments and reducing hardware costs significantly.\nExplored and treated malware threats effectively, implementing rigorous security protocols to safeguard systems against vulnerabilities."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Go** and **Java** to develop high-performance backend services, ensuring scalability and reliability in system operations.\nLeveraged **C#** and **Linux** to enhance application performance and streamline development processes, which resulted in a 25% reduction in bug rates.\nImplemented automation strategies for deployment and scaling, reducing manual intervention by 40% using scripting and orchestration tools.\nDeveloped and maintained database systems using **Postgres**, optimizing query performance for complex data retrieval operations, improving response time by **30%**.\nEngaged in system-level simulation using **QEMU** to test new features and validate system integrity, documenting results to inform development team strategies.\nConducted malware analysis to improve security protocols, fortifying applications against vulnerabilities and threat exploits.\nCollaborated on integrating RFC standards into development processes, ensuring compliance and interoperability of services.\nParticipated in agile ceremonies, including daily standups and retrospectives, contributing to refined project goals and improved team cohesion.\nDelivered comprehensive technical documentation and RFC proposals, enhancing team knowledge sharing and coding standards enforcement."
    }
  ],
  "skills": " **Programming Languages**\n\tC#, Java, Go, C++, Python\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Linux\n\n**Cloud & Infrastructure**\n\tAutomation\n\n**Other**\n\tUX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, QEMU, Malware, RFC",
  "apply_company": "Recorded Future"
}