{
  "name": "Patryk Zaslawski",
  "role_name": "QA Automation Engineer (Payments)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a seasoned QA Automation Engineer specializing in Payments, I bring 8+ years of experience in software engineering with a strong focus on **Test Automation Frameworks**, **API Testing**, and **CI/CD Pipelines**. I am proficient in **Java** and **Kotlin**, employing **Test Driven Development (TDD)** and **Behavior Driven Development (BDD)** methodologies to ensure high-quality software delivery. My background includes extensive knowledge of payment systems, including **EMV**, **E-commerce Transactions**, and **Payment Service Provider (PSP) Integrations**. I excel in performance and load testing, with expertise in tools such as **Postman** for API testing. I am well-versed in **Kafka** for handling payment message formats, along with **JSON** and **XML** for data interchange. Leveraging my understanding of **PCI-DSS**, **PSD2**, and **SCA** compliance, I build solutions that meet critical regulatory standards. I thrive in **Agile Methodologies** practices, including **SCRUM** and **KANBAN**. I complement these technical skills with my commitment to delivering secure, efficient, and reliable solutions that align with industry best practices and evolving client needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "QA Automation Engineer (Payments)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed and maintained automated testing strategies for **API Testing** and **E-commerce Transactions**, ensuring compliance with **PCI-DSS** and **PSD2** standards through effective **Test Automation Frameworks**.\n• Conducted comprehensive **Performance Testing** and **Load Testing** on payment platforms, measuring response times, throughput, and scalability under different loads.\n• Integrated **CI/CD Pipelines** using tools like Jenkins and GitHub Actions to streamline testing workflows, ensuring seamless deployment of quality releases.\n• Collaborated with development teams using **Agile Methodologies** such as **SCRUM** and **KANBAN**, fostering a culture of quality and continuous improvement across processes.\n• Created and executed test cases in **Postman** for payment service provider (**PSP**) integrations and **JSON**/**XML** payment message formats to ensure data integrity and functional compliance.\n• Implemented **Behavior Driven Development (BDD)** and **Test Driven Development (TDD)** practices, enhancing collaboration between QA and development teams for better communication of requirements.\n• Worked with event-driven architectures leveraging **Kafka** to ensure reliable message processing, enhancing the overall payment system's robustness.\n• Participated in technical design reviews to ensure testability and quality of payment functionalities, offering insights on potential mitigations against **SCA** risks.\n• Assisted in the management and optimization of payment systems, ensuring security and compliance with the latest industry standards.\n• Actively contributed to the documentation of testing processes, results, and defect reports to maintain clear communication with the development and product teams."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Kotlin** to develop and maintain robust automated test scripts for payment processing systems, ensuring high-quality deliverables across e-commerce transactions.\nDesigned and executed thorough **API Testing** strategies using tools like **Postman** to validate payment gateway integrations with various **Payment Service Providers (PSP)**.\nImplemented **CI/CD Pipelines** for automated testing and deployment, enhancing team efficiency and reducing release cycles by **25%**.\nApplied **Test Driven Development (TDD)** and **Behavior Driven Development (BDD)** methodologies to create comprehensive test scenarios for payment transactions under various scenarios, ensuring compliance with **PCI-DSS** and **PSD2** regulations.\nExecuted load and performance testing to measure system responsiveness and scalability, achieving a **30%** improvement in transaction processing times under heavy loads.\nCollaborated with cross-functional teams using **Agile Methodologies**, including **SCRUM** and **KANBAN**, to ensure a streamlined testing process that aligns with project timelines and requirements.\nConducted thorough tests for **SCA (Strong Customer Authentication)** measures, ensuring secure payment processing and compliance with industry standards.\nDeveloped automated testing frameworks that facilitate integration with **Kafka** to simulate and validate event-driven payment workflows, significantly enhancing our testing capabilities.\nMaintained and updated test scripts for evolving payment message formats such as **JSON** and **XML**, ensuring compatibility with multiple payment processors.\nRegularly reviewed and analyzed test results to identify trends and areas for improvement, leading to a **20%** reduction in post-deployment defects.\nIntegrated security testing into the payment transaction process, focusing on **EMV** compliance and safeguarding sensitive data flow during ecommerce transactions."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented **Test Automation Frameworks** ensuring quality and functionality of payment systems, particularly focusing on e-commerce transactions.\nConducted API Testing using **Postman**, facilitating seamless payment service provider (PSP) integrations with **Java** and **Kotlin**.\nDeveloped and managed CI/CD Pipelines to automate delivery and ensure efficient testing processes, contributing to an overall enhancement of Agile Methodologies (SCRUM, KANBAN).\nExecuted Behavior Driven Development (BDD) and Test Driven Development (TDD) practices, leading to a robust testing framework ensuring compliance with **PCI-DSS**, **PSD2**, and **SCA** guidelines.\nPerformed extensive Performance Testing and Load Testing for payment processing systems, ensuring they can handle peak loads of **9,000** transactions per hour.\nUtilized **Kafka** for managing messaging between services, ensuring reliable event-driven architectures in payment processing workflows.\nCreated and maintained tests for various Payment Message Formats including **JSON** and **XML**, ensuring that systems can accurately process and respond to payment requests.\nExecuted comprehensive automated tests covering end-user functionalities, maintaining a defect rate of under **2%** across multiple releases.\nCollaborated with the development team to enhance user experience with e-commerce transactions, ensuring API stability and performance optimization.\nProvided continuous feedback on development processes, utilizing Agile methodologies to drive improvements in testing efficacy and reporting.\nEngaged in cross-functional collaboration to achieve project targets, adhering to project timelines and ensuring project deliverables met stakeholder expectations."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Kotlin, Python\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs, JSON, XML, API Testing, Postman\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, RDS, S3)\n\n **Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL)\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD Pipelines, Behavior Driven Development (BDD), Test Driven Development (TDD), EMV, E-commerce Transactions, Payment Service Provider (PSP) Integrations, Kafka, Payment Message Formats, PCI-DSS, PSD2, SCA, Agile Methodologies, SCRUM, KANBAN, Performance Testing, Load Testing"
}