{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Cloud Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a knowledgeable Senior Cloud Engineer with 8+ years of experience, I have a strong command of **Cloud Infrastructure** and **Performance Tuning** to ensure high availability and reliability of systems. My expertise in **Linux** environments and **Bash** scripting complements my skills in **Incident Management** and **Network Security** to enhance overall system resilience. I am proficient in **Python**, allowing for effective automation and integration in cloud services. Demonstrated ability in creating clear **Technical Documentation** and offering **Customer Support** during **Emergent Incident Response** situations ensures streamlined operations. In addition to technical skills, I have a background in software engineering that includes building applications in various frameworks such as **FastAPI, Django**, and **Flask**, and integrating with cloud platforms like **AWS** and **Azure**. My multifaceted experience includes optimizing databases like **PostgreSQL, MySQL**, and **MongoDB**, and embracing modern development practices with microservices architecture and REST/gRPC API development, delivering robust solutions tailored to business needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Oversaw the **cloud infrastructure** design and maintenance for the Healthcare Experience Platform using **Python**, ensuring high-performance and reliability in line with organizational standards.\n- Provided technical documentation for system administration processes related to **Linux** environments and **Bash** scripting, facilitating streamlined operations and knowledge transfer.\n- Implemented robust **monitoring tools**, enabling performance tuning and proactive incident management to enhance system availability and user satisfaction.\n- Integrated security protocols including **Network Security** measures into **Python** microservices, enforcing compliance with industry standards while managing emergent incident responses effectively.\n- Championed customer support initiatives by establishing **performance tuning** processes, leading to a **20%** improvement in service response times for cloud services.\n- Automated routine tasks using **Bash** scripts, significantly reducing manual workload and error rates associated with system administration.\n- Engaged in incident management activities, responding to emergent issues with swift troubleshooting strategies, thereby reducing system downtime by **30%**.\n- Conducted thorough performance assessments and audits of **Python** applications and **cloud infrastructure**, identifying bottlenecks and implementing efficiency improvements resulting in a **15%** boost in overall application performance."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Linux** and **Bash** for system administration tasks to ensure robust cloud infrastructure, leading to a **30%** reduction in downtime.\nImplemented **performance tuning** strategies in Python applications, achieving a **25%** improvement in response times while maintaining system integrity.\nDeveloped and maintained technical documentation for cloud-based architecture deployments, creating standardized processes to enhance team collaboration and efficiency.\nManaged incident response for cloud services, effectively handling **90%** of incident tickets within hours and minimizing outage impacts.\nMonitored cloud infrastructure health using **monitoring tools**, ensuring optimal performance and proactive issue resolution.\nProvided customer support for cloud solutions, contributing to a **high satisfaction** rate among stakeholders through efficient troubleshooting and communication.\nDesigned and implemented security protocols for cloud environments, enhancing **network security** measures and achieving compliance with industry standards.\nCollaborated with cross-functional teams to optimize cloud-based applications, leveraging **PHP** and **Python** for seamless integrations and functionality.\nDrove the adoption of best practices in cloud engineering, focusing on reliability, performance, and adherence to technical documentation standards.\nExecuted strategic incident management processes, refining workflows that improved response times and reduced critical incident escalations."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Implemented and administered **Linux** environments for optimal server performance and system stability, leveraging **Bash** scripts for automation and management tasks.\n- Utilized **PHP** and **Python** for developing backend services, focusing on performance tuning and technical documentation to enhance system clarity and usability.\n- Designed and managed **cloud infrastructure**, ensuring efficient resource allocation and scalability under high-demand conditions.\n- Monitored system performance using advanced **monitoring tools**, maintaining service health and ensuring minimized downtime, thus improving overall customer support metrics.\n- Executed incident management protocols for identifying, troubleshooting, and resolving emergent incidents, enhancing operational reliability.\n- Developed comprehensive technical documentation for systems and processes, facilitating better team collaboration and onboarding of new engineers.\n- Implemented system security protocols, focusing on **network security** to safeguard sensitive customer information across platforms, ensuring data integrity and compliance.\n- Conducted performance tuning and optimizations for various backend processes, achieving a **40%** reduction in response time and increased transaction handling capacity.\n- Collaborated with cross-functional teams to streamline operations, enabling a **99.5%** uptime for all deployed services and improving customer support response times.\n- Executed regular reviews and updates of monitoring tools, adapting to new challenges and tech advancements to maintain system robustness.\n- Provided ongoing training and support to junior engineers and technical support teams, fostering a culture of continuous improvement and knowledge sharing."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, PHP, Bash\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tSQLAlchemy, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tLinux, System Administration, Network Security, Performance Tuning, Technical Documentation, Monitoring Tools, Incident Management, Customer Support, Emergent Incident Response",
  "apply_company": "Jamf"
}