{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Frontend Engineer - Angular",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a results-driven Senior Frontend Engineer with 8+ years of software engineering experience, I specialize in creating high-quality applications using **Angular**, **JavaScript**, **TypeScript**, **HTML**, and **CSS**. I am proficient in developing and optimizing user-centric frontend solutions while ensuring accessibility compliance. My technical expertise also includes cloud services such as **AWS**, as well as establishing seamless **REST Web Services** for enhanced application performance. I am adept at utilizing version control with **Git** and implementing **CI/CD** pipelines to streamline development processes. Additionally, my background in **Python** development, including frameworks such as **FastAPI**, **Django**, and **Flask**, equips me with a comprehensive understanding of backend systems, further enhancing my ability to deliver cohesive and efficient solutions. My experience extends to working with microservices architecture and coordinating efforts throughout the software development lifecycle using tools like **Jira**.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer - Angular",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed engaging front-end applications using **Angular** (versions 17–18), enhancing user experience and accessibility compliance for healthcare solutions.\n• Collaborated with cross-functional teams to design scalable **microservices architectures** integrating **Python** and **JavaScript** for seamless functionality across web platforms.\n• Implemented **REST Web Services** to facilitate secure communication between the front-end and back-end components, ensuring data integrity and efficient API consumption.\n• Managed source control and versioning using **Git**, streamlining collaborations and code reviews among a team of 10+ engineers.\n• Automated CI/CD pipelines with tools like **GitHub Actions** and **Azure DevOps**, enhancing deployment efficiency and enforcing testing protocols in delivery processes.\n• Ensured compliance with industry standards including **Accessibility Compliance** and security practices, optimizing the application for diverse user needs.\n• Spearheaded the integration of third-party **JavaScript** libraries, improving functionality for data visualization and patient interaction in healthcare applications.\n• Mentored junior developers on best practices for **TypeScript**, enhancing code quality and maintainability in ongoing projects.\n• Designed and tested front-end components that interacted with backend services built in **Python**, ensuring robust end-to-end functionality.\n• Utilized **Jira** for project management to track progress and streamline workflows within the development team, increasing team productivity by **25%**.\n• Championed responsive design principles using **HTML** and **CSS** to ensure compatibility across devices and accessibility for all users.\n• Participated in code reviews and provided constructive feedback, resulting in reduced bugs and improved application performance by **30%**.\n• Collaborated closely with backend teams to integrate **natural language understanding** capabilities into front-end applications, enhancing user interactions with intelligent functionalities.\n• Maintained an agile development process, adapting quickly to changes and delivering features consistently within sprints."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed dynamic, user-centric frontends with **Angular**, ensuring high-performance interfaces integrated with **Python** backends, utilizing **REST Web Services** for seamless data interaction.\nUtilized **JavaScript** and **TypeScript** to enhance frontend functionality, ensuring alignment with modern web standards and compliance with **Accessibility Compliance** guidelines.\nImplemented CI/CD pipelines using **Git**, **Azure DevOps**, and **GitHub Actions** to facilitate continuous delivery and quality assurance of frontend applications.\nLed the integration of microservices architecture, collaborating closely with backend teams to ensure that **REST Web Services** meet performance and scalability requirements.\nManaged and maintained code quality through automated unit testing using frameworks like Jest, ensuring robust delivery of features leveraging **Angular**.\nCollaborated with cross-functional teams to gather requirements and design user interfaces that align with user experience principles, emphasizing ease of use and accessibility.\nSuccessfully delivered **9** major frontend releases per year, deploying new features and optimizations based on user feedback and testing outcomes.\nParticipated in code reviews and pair programming sessions, contributing to team knowledge sharing and best practices in frontend development using **Angular** and associated technologies.\nOversaw the integration of **Python** services with frontend components, optimizing data flow and performance metrics for end users.\nFostered collaboration with project managers using **Jira** to track tasks, user stories, and development progress, ensuring alignment with project timelines and stakeholder expectations."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed dynamic, responsive frontends using **Angular**, **JavaScript**, and **TypeScript** to provide seamless user experiences and enhance customer engagement on e-commerce platforms.\nUtilized **HTML5** and **CSS3** to design and implement mobile-friendly websites, achieving a **30% increase** in mobile traffic and engagement.\nCollaborated with backend teams to build and integrate **RESTful APIs** in **Python**, ensuring compatibility and performance across all frontend components.\nManaged version control and collaboration efforts using **Git**, streamlining workflow and maintaining code integrity for applications deployed in a **CI/CD** pipeline.\nConducted thorough testing for accessibility compliance, ensuring that all frontend solutions meet industry standards for inclusivity and usability.\nEnhanced system performance by implementing best practices in **Microservices Architecture**, allowing for modular development and deployment across multiple services.\nLeveraged bot platforms and natural language understanding technologies to create interactive features within the frontend applications, improving customer support functionalities.\nImplemented performance and load testing strategies, utilizing tools like **Apache JMeter** and **k6**, which resulted in identifying and resolving bottlenecks that could handle up to **1000 concurrent users**.\nUtilized **AWS** cloud services for hosting and deploying applications, ensuring high availability and scalability to meet fluctuating traffic demands.\nConducted regular code reviews and contributed to the team’s QA process, ensuring high-quality code and timely delivery of features in every release.\nDesigned and optimized workflows for cart, checkout, and payment processes with a focus on low latency and user satisfaction, reducing transaction processing time by **25%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, REST & gRPC APIs, Microservices Architecture\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), HTML, CSS\n\n **API Technologies:**\n\tREST Web Services\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Git\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Jira, Accessibility Compliance, Bot Platforms, Natural Language Understanding"
}