{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of delivering high-performance applications, specializing in **React**, **TypeScript**, and **Next.js**. Proficient in modern frontend technologies including **Contentful**, **Jest**, **React Testing Library**, **Cypress**, **Webpack**, **Vite**, and **GraphQL**. Strong experience in deploying scalable applications on **AWS** and utilizing **Vercel** for hosting. Proven ability to create user-friendly interfaces with frameworks like **Material UI** and **Tailwind**, while maintaining development efficiency through **Storybook**.\nAdditionally, I bring extensive experience in backend development using **Python** with frameworks such as **FastAPI** and **Django**, and have a solid foundation in building AI/ML-powered platforms for predictive analytics. I am committed to compliance-driven development, ensuring alignment with standards including HIPAA, FHIR, PCI DSS, and SOC 2. My expertise also extends to MLOps practices, deploying effective CI/CD pipelines to enhance productivity.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed dynamic user interfaces using **React** (17–18) and **TypeScript**, ensuring seamless user experiences with performance optimization and responsive design.\nImplemented efficient content management solutions leveraging **Next.js** and **Contentful** for rapid deployment and gestion of content across multiple platforms.\nDesigned and executed comprehensive testing strategies utilizing **Jest**, **React Testing Library**, and **Cypress** to ensure high-quality code with a minimum coverage of **90%**.\nCreated modular and scalable frontend components with **Material UI** and **Tailwind** to enhance design consistency and user interaction across web applications.\nOptimized build processes using **Webpack** and **Vite**, improving build performance by over **30%** and reducing load times for end-users.\nCollaborated with backend engineers to create and maintain APIs using **GraphQL**, facilitating efficient data fetching and handling for frontend applications.\nLed the integration of responsive design principles into existing applications, resulting in user satisfaction scores increasing by **25%**.\nUtilized CI/CD practices to streamline frontend deployment workflows on **Vercel**, reducing deployment time to under **5 minutes**.\nWorked closely with cross-functional teams to implement user feedback mechanisms, ensuring continuous improvement and feature alignment with user needs.\nParticipated in code reviews and mentorship of junior developers, fostering a culture of learning and best practices within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed interactive front-end applications using **React (18)**, **TypeScript**, and **Next.js**, ensuring high-quality user experiences in financial tools and admin panels.\n• Implemented testing frameworks such as **Jest** and **Cypress** to enhance code reliability and maintainability, achieving a code coverage of **95%**.\n• Collaborated in the design and deployment of modular UI components leveraging **Material UI** and **Tailwind CSS**, improving design consistency and responsiveness across multiple applications.\n• Utilized modern build tools like **Webpack** and **Vite** to optimize application performance, achieving load times reduced by **30%**.\n• Integrated with **Contentful** for dynamic content management, allowing content updates without developer intervention, which streamlined content deployment by over **50%**.\n• Employed **GraphQL** for efficient data fetching, minimizing over-fetching and enhancing application speed, with a focus on scalable API architecture.\n• Participated in code reviews and maintained high coding standards through the implementation of **Storybook** for UI component documentations and testing. \n• Mentored junior developers, fostering growth and best practices in front-end development, contributing to a **20%** improvement in team efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed high-performance frontend applications utilizing **React (18)**, **TypeScript**, and **Next.js**, ensuring robust and scalable architecture aligned with modern practices and enhancing user experience across devices.\nImplemented unit and integration testing strategies using **Jest** and **React Testing Library** to uphold code quality and application stability, achieving over **90%** test coverage for critical components.\nEngineered responsive UIs following best practices in web accessibility (WCAG 2.1) using **Material UI** and **Tailwind CSS**, resulting in a **50%** increase in engagement metrics on mobile platforms.\nUtilized state management solutions such as **Redux Toolkit** and **GraphQL** to optimize data flow and efficiently fetch and manage application state, reducing load times by **30%**.\nIntegrated continuous integration workflows leveraging **Cypress** for end-to-end testing, ensuring reliable software delivery with a commitment to high-quality outcomes across multiple releases.\nOptimized build processes using **Webpack** and **Vite**, drastically reducing build times and improving developer efficiency, resulting in a **40%** faster deployment cycle.\nHarnessed cloud services including **AWS** and **Vercel** for scalable application hosting and backend services, ensuring high availability and resilience under traffic spikes.\nCollaborated in agile, cross-functional teams to deliver features on time, driving initiatives from concept through to deployment while fostering a culture of innovation and collaboration."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, TypeScript, Next.js, Vue, Angular, Material UI, Tailwind, Storybook, Jest, React Testing Library, Cypress, Webpack, Vite\n\n**Backend Frameworks:**\n\tPython: FastAPI, Flask, Django\n\n**API Technologies:**\n\tGraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Vercel\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Plan A Technologies"
}