{
  "name": "Patryk Zaslawski",
  "role_name": "Senior iOS Developer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a highly skilled Senior iOS Developer with 8+ years of experience in software engineering, I excel in building robust and user-friendly applications, leveraging a deep expertise in **Swift**, **SwiftUI**, **UIKit**, and asynchronous programming with **GCD** and **Operation Queues**. My proficiency in integrating **REST APIs**, **WebSockets**, and utilizing **Core Data** for data persistence ensures seamless functionality and optimized performance. I am well-versed in implementing **biometric authentication** and managing notifications using **Firebase Cloud Messaging** and **APNs**. Committed to software excellence, I adopt design patterns such as **MVVM**, **VIPER**, and **Clean Architecture** to enhance code maintainability and scalability. Alongside technical capabilities, my strong background in system architecture, frontend development, and quality assurance with **XCTest** positions me to deliver innovative and reliable iOS solutions that meet and exceed business objectives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Developer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed and maintained modular **Swift** components using **SwiftUI** and **UIKit** to enhance user experience and improve app performance.\n• Designed REST APIs for data retrieval and interactions, ensuring robust communication between frontend and backend services.\n• Implemented **Core Data** for persistent data storage, optimizing application performance with **GCD** for asynchronous operations.\n• Integrated **WebSockets** for real-time data updates, improving app responsiveness and user engagement.\n• Established secure data handling practices by implementing **Keychain** for sensitive information and **biometric authentication** for enhanced security.\n• Utilized **Combine** framework for reactive programming, enabling seamless data flows and enhancing app maintainability.\n• Developed push notification services using **Firebase Cloud Messaging** and **APNs**, achieving deliverability and enhancing user interaction.\n• Guided architectural decisions by employing **Clean Architecture** and **MVVM** patterns, structuring code for scalability and testability.\n• Conducted unit testing and integration testing using **XCTest**, ensuring reliable code quality and application stability.\n• Mentored junior developers, fostering a culture of learning and continuous improvement in iOS development best practices.\n• Spearheaded the transition to **VIPER** architecture for modularization and separation of concerns, improving code reusability and testability.\n• Collaborated with cross-functional teams to define application requirements, resulting in successful project delivery on time.\n• Achieved a **30%** reduction in app load times through performance optimization techniques and efficient data fetching strategies.\n• Contributed to the implementation of CI/CD pipelines, ensuring efficient deployment processes and quick turnaround on code reviews."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented robust iOS applications using **Swift**, **SwiftUI**, and **UIKit**, ensuring high performance and responsiveness through effective use of **GCD** and **Operation Queues**.\nDeveloped seamless REST APIs and WebSocket communications to enhance real-time functionalities for mobile user experiences, ensuring secure data transfer and interaction.\nUtilized **Core Data** for efficient data management and storage solutions, optimizing app performance and allows for offline capabilities.\nIntegrated biometric authentication and Keychain services to enhance security features ensuring compliance with privacy standards while leveraging **biometric authentication** methods.\nImplemented push notifications using **Firebase Cloud Messaging** and **APNs**, achieving a **25%** increase in user engagement through effective communication strategies.\nFollowed MVVM and VIPER architectural patterns to enhance code maintainability and scalability, resulting in a **30%** reduction in bug reports during the QA phase.\nConducted unit testing with **XCTest** to ensure functionality and reliability of apps, achieving a coverage rate of **85%** on critical components.\nStreamlined app performance through the use of **Clean Architecture**, separating concerns efficiently and enabling easier testing and integration.\nEngaged in regular code reviews and pair programming sessions, enhancing team collaboration and ensuring adherence to best practices in development.\nLeveraged CI/CD pipelines for seamless deployment, improving release cycles and maintaining version control throughout the development process."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed robust REST APIs in Swift utilizing **URLSession** for seamless communication between frontend and backend systems, ensuring high-quality user experiences.\nImplemented **SwiftUI** and **UIKit** to design interactive, responsive user interfaces for iOS applications, adhering to the **MVVM** architecture for better code organization and maintenance.\nUtilized **Core Data** for effective data management on iOS, enhancing app performance and ensuring smooth offline capabilities.\nIntegrated **Firebase Cloud Messaging** to implement reliable push notification services, improving user engagement rates by **20%**.\nDesigned and implemented biometric authentication features leveraging **Keychain** for enhanced security, ensuring user data protection in compliance with industry standards.\nAdopted **Combine** for asynchronous data handling, enabling modern reactive programming techniques that improve responsiveness of the application.\nExecuted efficient background tasks using **GCD** and **Operation Queues**, ensuring smooth app performance while managing resources effectively.\nBuilt real-time chat functionalities utilizing **WebSockets**, enhancing user interaction with instant communication features.\nEnsured high-quality code with automated testing using **XCTest**, achieving a **30%** reduction in post-release bugs through rigorous test coverage.\nEmployed Clean Architecture principles to facilitate maintainability and scalability of application code, effectively managing complex projects with ease.\nConducted performance testing and optimization, achieving a **15%** improvement in app load times by refining APIs and minimizing data retrieval latency.\nMigrated legacy iOS applications to modern **Swift** standards, improving overall performance and user experience while maintaining feature parity.\nOversaw the integration of REST APIs for vital application functionalities, providing a seamless and efficient interface for users and stakeholders.\nCollaborated with cross-functional teams to define project objectives, timelines, and deliverables, successfully launching **3** major app updates within a year."
    }
  ],
  "skills": "Programming Languages:\n\tSwift, Python\n\nBackend Frameworks:\n\tFastAPI, Django, Flask, Spring Boot\n\nFrontend Frameworks:\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor, SwiftUI, UIKit\n\nAPI Technologies:\n\tREST APIs, gRPC APIs, WebSockets, URLSession\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Firebase Cloud Messaging, APNs\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\nCloud & Infrastructure:\n\tAWS, Azure\n\nOther:\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, GCD, Operation Queues, Core Data, biometric authentication, MVVM, VIPER, Clean Architecture, XCTest"
}