{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Experienced Senior Backend Engineer with 8 years of proficiency in **Kotlin**, **Spring Boot**, and **PostgreSQL**. I excel in building high-performance backend solutions that support scalable applications, leveraging my deep knowledge of **AWS**, **CI/CD** practices, and robust software development methodologies. My background in product management allows me to effectively communicate and align technological goals with business objectives. \nAdditionally, I have a solid foundation in full-stack development with **JavaScript**, **TypeScript**, **Python**, and **Flutter**, and an adeptness for cloud environments including **Azure** and **AWS**. Successfully led the creation of enterprise-grade systems incorporating AI/ML for predictive analytics and real-time data processing while ensuring compliance with standards like HIPAA, FHIR, PCI DSS, and SOC 2. I am skilled in microservices architecture and have hands-on experience developing machine learning pipelines with tools such as **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented robust backend solutions using **Kotlin** and **Spring Boot** to support scalable data management in healthcare and financial applications.\nDesigned and maintained cloud infrastructure on **AWS** for high-performance database systems, leveraging **PostgreSQL** for effective data storage and retrieval.\nDeveloped and optimized CI/CD pipelines that enhance software delivery efficiency through automated testing and deployment strategies.\nCollaborated with cross-functional teams to ensure product requirements align with stakeholder needs and maintained clear communication around project progress and hurdles.\nLed initiatives to refactor existing systems, enhancing maintainability and performance metrics by at least **30%**.\nConducted comprehensive code reviews and implemented agile practices that resulted in a **25%** reduction in bug rates during production phases.\nMentored junior engineers in backend development best practices, equipping them with skills to contribute to complex projects effectively.\nEnsured secure development practices were adhered to, focusing on compliance with industry standards and regulations, improving security audit scores by **15%**.\nUtilized **AWS Lambda** for implementing serverless computing functionalities, enabling cost-effective resource usage and reducing server provisioning time by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Kotlin**, **Spring Boot**, and **PostgreSQL** to develop and enhance backend services, increasing system reliability and performance by **30%**.\nImplemented CI/CD practices to streamline the software delivery process, reducing deployment time by **50%** and improving product delivery efficiency.\nEngaged in comprehensive software development life cycle management, ensuring high-quality coding standards and effective product management practices.\nCommunicated effectively with cross-functional teams to align on project goals, resulting in a **25%** improvement in stakeholder satisfaction scores.\nLed modernization initiatives that transitioned legacy systems to a microservices architecture, bolstering maintainability and scalability for financial applications.\nDeveloped backend solutions that leveraged **AWS** cloud services for scalability, enhancing data storage and processing capabilities.\nConducted collaborative planning sessions for product features, significantly contributing to the successful launch of multiple software projects on schedule."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Kotlin** and **Spring Boot** to develop robust backend services for diverse applications, ensuring seamless integration with **PostgreSQL** databases for efficient data management.\nImplemented CI/CD pipelines to streamline software deployment, enhancing development workflows with an emphasis on automation and quality control.\nLeveraged **AWS** for cloud-based solutions to ensure scalability and reliability, facilitating a smooth transition of applications to a production environment.\nCollaborated effectively with cross-functional teams to gather requirements and provide updates, ensuring clear communication throughout the software development lifecycle.\nUtilized Agile methodologies to deliver features on schedule, resulting in a **20%** increase in project efficiency and on-time delivery rate.\nConducted code reviews and provided mentorship to junior developers, fostering a culture of continuous improvement and best practices within the development team.\nDesigned and implemented RESTful APIs to support mobile and web applications, ensuring a **99.9%** uptime during peak traffic periods through rigorous testing and optimization.\nManaged product development stages from concept to deployment, ensuring alignment with business objectives and user needs.\nIntegrated monitoring and logging tools to maintain application health, facilitating rapid response to production issues and minimizing downtime.\nEmployed effective communication strategies to present technical solutions to stakeholders, bridging the gap between technical and non-technical teams."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Kotlin\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Software Development, Product Management, Communication",
  "apply_company": "Huspy"
}