{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience specializing in **AWS**, **Microservices**, and **GitLab CI/CD** implementations. Proficient in **Golang**, **Kotlin**, and **PHP**. Demonstrated expertise in building robust backend systems with a strong understanding of databases and developing collaborative solutions. Adept at problem-solving and taking ownership of projects, ensuring high-performance and compliant applications within healthcare and financial sectors. Additionally skilled in **JavaScript/TypeScript**, **Python**, and frameworks such as **Node.js** and **FastAPI**, with a solid foundation in AI/ML to enhance application capabilities.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained microservices architecture utilizing **Golang** and **Kotlin** for scalable and efficient backend solutions in line with business objectives.\n- Managed CI/CD pipelines with **GitLab CI/CD** to streamline deployment processes and ensure code quality, achieving a deployment frequency increase of **30%**.\n- Collaborated with cross-functional teams to solve complex problems and enhance system capabilities, demonstrating strong problem-solving and ownership skills in project delivery.\n- Designed robust database schemas and optimized queries for various databases such as **PostgreSQL** and **MongoDB**, resulting in performance improvements of up to **25%**.\n- Implemented secure and scalable solutions on **AWS**, leveraging services like EC2, RDS, and Lambda to enhance system resilience and reduce operational costs.\n- Contributed to architectural discussions to ensure alignment with organizational goals while fostering collaboration among team members throughout the development lifecycle.\n- Monitored application performance and optimized them for better efficiency, achieving response time reductions of up to **15%**.\n- Ensured adherence to coding standards and testing protocols, driving quality assurance and maintaining high software standards across the development team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Leveraged **microservices** architecture to enhance scalability and performance of core financial platforms, migrating services using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)** to handle **9 million** transactions daily.\n• Collaborated within cross-functional teams, employing strong **problem-solving** skills to meet project deadlines and deliver high-quality outcomes in an agile environment.\n• Developed and maintained **databases** ensuring optimal data management and retrieval strategies, contributing to a **30%** increase in application efficiency.\n• Implemented **AWS** cloud services for scalable infrastructure, achieving a **99.9%** uptime for core services, thus enhancing reliability for high-volume transaction processing.\n• Utilized **GitLab CI/CD** pipelines for continuous integration and deployment, accelerating development cycles by **25%**.\n• Drove ownership of project delivery, taking charge of backend development processes to ensure alignment with business objectives and stakeholder requirements.\n• Engaged in collaborative brainstorming sessions, emphasizing **collaboration** and effective communication among team members to tackle challenges and refine solutions.\n• Applied strong expertise in various programming languages, encountering **Golang**, **Kotlin**, and **PHP** to expand project capabilities and flexibility."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Golang** and **Kotlin** to design and implement robust microservices, enhancing the platform's scalability and maintainability across a global e-commerce ecosystem.\nOptimized deployment workflows leveraging **GitLab CI/CD** to ensure seamless integration and continuous delivery, improving deployment frequency by **30%**.\nDemonstrated ownership by troubleshooting and resolving backend issues, implementing solutions that reduced response times by **15%**.\nCollaborated with cross-functional teams to gather requirements and provide technical insights, improving project turnaround efficiency by **25%**.\nDesigned and maintained databases using **AWS** managed services, ensuring reliable data access and redundancy for high-traffic e-commerce applications.\nDrove problem-solving initiatives through the enhancement of system performance and user experience, leading to a **20%** increase in customer satisfaction through data-driven decisions.\nDeveloped and optimized backend services with a focus on low latency and high availability, ensuring seamless user experiences across checkout, cart, and order fulfillment modules.\nImplemented secure data handling practices with role-based access control (RBAC) and OAuth 2.0, ensuring compliance with data protection regulations.\nConducted code reviews and mentoring sessions to uphold best practices in coding standards and software design within the team."
    }
  ],
  "skills": "Programming Languages:\n\tGolang, Kotlin, PHP, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMicroservices, Collaboration, Problem Solving, Ownership, MLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "OLX"
}