{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior Software Engineer with 8+ years of experience, I bring a robust skill set in **JavaScript**, **TypeScript**, **Node.js**, and **React** to deliver high-performance solutions. I have expertise in **Express**, **MongoDB**, and **PostgreSQL** for building secure and efficient applications tailored to business requirements. My technical proficiency extends to **Docker**, **Redis**, and **Linux**, ensuring effective deployment and system reliability. Additionally, I leverage **DevOps** practices, including **Continuous Integration** and **Automated Testing**, to streamline software development. I am dedicated to implementing strong **Security Practices** and fostering collaboration with my team through effective **Documentation** and communication. My background also includes building applications utilizing microservices architecture and API development, ensuring adherence to industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed front-end applications using **React** and **TypeScript**, ensuring seamless integration with back-end services for enhanced user experience across 5+ healthcare projects.\n• Designed and implemented scalable RESTful APIs using **Node.js** and **Express**, achieving 99.9% uptime and handling over **10,000** concurrent requests.\n• Optimized database interactions using **MongoDB** and **PostgreSQL**, improving query performance by **30%** through indexing and efficient data structuring.\n• Led the adoption of **Docker** for containerization of applications, streamlining deployments and reducing application setup time by **40%**.\n• Established a robust CI/CD pipeline utilizing **GitHub** and other tools to ensure automated testing and deployment, achieving releases in less than **24 hours**.\n• Collaborated with cross-functional teams for effective communication and documentation, resulting in improved project transparency and team efficiency.\n• Implemented security best practices within development workflows, adhering to established standards and significantly reducing vulnerabilities by **50%**.\n• Mentored junior developers in modern JavaScript frameworks and best practices, fostering a collaborative culture that emphasizes learning and innovation.\n• Utilized **Redis** for caching mechanisms, enhancing application performance and reducing server load during peak usage periods.\n• Conducted automated testing using various tools to ensure high reliability of code, achieving up to **95%** test coverage across critical modules.\n• Employed **Prometheus** for monitoring application health, enabling proactive issue resolution and maintaining system performance above **98%**."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic and responsive web applications using **JavaScript**, **React**, and **Node.js**, ensuring seamless integration with backend microservices.\n• Collaborated with cross-functional teams to document processes and enhance project visibility, utilizing **GitHub** for version control and collaboration.\n• Designed and implemented RESTful APIs with **Express** for efficient client-server communication, focusing on performance and security best practices.\n• Optimized data management using **MongoDB** and **PostgreSQL**, streamlining queries and ensuring high performance across applications with data volumes exceeding **1 million** records.\n• Employed **Redis** for caching mechanisms, significantly reducing latency in data retrieval by up to **50%**.\n• Led the migration of existing services to a **Docker**-based container architecture, improving scalability and simplifying deployments in various environments.\n• Implemented **Prometheus** for monitoring application performance, enabling proactive identification of issues and enhancing system reliability.\n• Spearheaded automation strategies for **Continuous Integration** and **Automated Testing**, reducing deployment times by **30%** and ensuring high-quality code through frameworks like **Jest** and **Mocha**.\n• Maintained Linux-based systems for application hosting, ensuring stability and security compliant with industry standards.\n• Applied strong security practices, including validation, authentication, and encryption to safeguard sensitive user data.\n• Demonstrated expertise in Agile methodologies, participating in sprint planning and retrospectives to drive continuous improvement in team processes."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Developed and optimized backend services using **Node.js** and **Express**, enhancing scalability and performance for an online platform.\n- Created dynamic frontends utilizing **React** and **TypeScript**, implementing state management with **Redux** for an improved user experience, resulting in a **20%** increase in customer interactions.\n- Designed and managed databases with **MongoDB** and **PostgreSQL**, improving data retrieval speeds by **30%** through optimized queries and indexing strategies.\n- Implemented **Docker** for containerization of applications, facilitating consistent deployments across **3** different environments.\n- Employed **Redis** for caching solutions, reducing database load and improving response times by **40%** for frequently accessed resources.\n- Utilized **Prometheus** for monitoring and observability in services, allowing for real-time performance tracking and system health assessment, which resulted in a **25%** decrease in critical issues reported.\n- Developed and maintained CI/CD pipelines using **GitHub** for automated testing and deployment processes, ensuring streamlined delivery of features.\n- Executed thorough automated testing practices including unit and integration tests using frameworks like **Jest** and **Mocha**, improving overall code quality and reducing bugs by **15%**.\n- Collaborated effectively with cross-functional teams in an Agile environment, driving project documentation and ensuring adherence to security best practices in all deployments.\n- Led initiatives to enhance application security by integrating **OAuth 2.0** and secure authentication mechanisms for user data protection."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, Node.js, Express\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Continuous Integration, Automated Testing\n\n**Cloud & Infrastructure:**\n\tLinux, Prometheus, Security Practices\n\n**Other:**\n\tGitHub, Collaboration, Documentation",
  "apply_company": "Overleaf"
}