{
  "name": "Mariusz Jan Skobel",
  "role_name": "Full-Stack Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Proficient Full-Stack Developer with 10+ years of experience in full-stack development, specializing in building RESTful APIs and gRPC-based services. Expert in modern technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**, with deep hands-on expertise in frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in database management using **PostgreSQL**, **MySQL**, and **Neo4j**, and adept at deploying cloud-native applications utilizing **Kubernetes** on **Azure** and **AWS**. Committed to CI/CD practices and implementing clean coding standards alongside automation practices to enhance development workflows.\nDemonstrates strong problem-solving skills and a collaborative attitude, with a solid foundation in data structures and algorithms. Experienced leading development efforts for enterprise platforms that incorporate AI/ML capabilities to facilitate real-time analytics and intelligent decision-making, while ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about delivering high-performance software solutions that have a significant impact on business outcomes.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Full-Stack Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tExecuted full-stack development for healthcare and finance applications, leveraging **TypeScript**, **Python (FastAPI)**, and **Node.js** while ensuring robust RESTful APIs and gRPC communications for seamless data flow.\n•\tImplemented CI/CD practices using **GitHub Actions** and **Azure DevOps** to automate deployment pipelines, enhancing code quality through clean coding standards and thorough testing.\n•\tManaged large-scale databases including **PostgreSQL** and **MySQL**, ensuring optimized transactions and queries for over **1 million** records, while designing responsive data structures.\n•\tLed migration from monolithic to microservices architecture utilizing **Kubernetes (AKS/EKS)** and Docker, achieving a **30%** increase in application performance and availability.\n•\tDeveloped and deployed cross-platform mobile applications with **Flutter** and **React Native** for **iOS** and **Android**, focusing on user experience improvements that reduced load times by up to **50%**.\n•\tCollaborated closely with engineering teams to foster a collaborative attitude, employing problem-solving skills to address complex integration challenges in multi-environment setups.\n•\tDesigned robust data models using **Neo4j** to enhance relationship mapping for client applications, driving insights into user interactions and behavior.\n•\tApplied automation practices to streamline workflows, achieving task efficiency improvements by as much as **40%**, while maintaining a high standard for ability to adapt to new technologies.\n•\tUtilized sophisticated algorithms and data structures to enhance performance in data-intensive applications, ensuring reliable communication and data integrity.\n•\tEngaged in code reviews and knowledge-sharing sessions to refine team coding practices and foster a culture of continuous learning and improvement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Engaged in **full-stack development** by leading the modernization of financial platforms with a microservices-based architecture using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, enhancing scalability and maintainability for systems handling over **1M transactions per day**.\n• Developed and optimized **RESTful APIs** that improved data retrieval speed by **30%**, and ensured robust database interactions with **PostgreSQL** and **MySQL**, facilitating seamless integration with frontend components.\n• Implemented **Kubernetes** for container orchestration, automating deployment processes which reduced downtime during updates by **20%**.\n• Applied clean coding principles and automation practices throughout the development cycle, ensuring high code quality and maintainability with a **95% code coverage** achieved through automated testing.\n• Enhanced user experience by building front-end applications using **React (18)**, **Vue 3**, and **Next.js**, incorporating **TypeScript** and **Tailwind CSS** to deliver responsive design for admin portals processing analytics for over **500K users**.\n• Designed and implemented **gRPC** services for efficient, high-performance communication between microservices, decreasing inter-service latency by **15%**.\n• Collaborated with analytics teams to create dynamic dashboards using **D3.js** and **Power BI Embedded**, providing insights into financial activities with real-time updates, thus improving decision-making speed for operations teams by **40%**.\n• Developed and orchestrated ETL pipelines with **Apache Airflow** and **Azure Data Factory**, achieving successful batch and real-time data ingestion from **10+** internal and third-party sources, increasing data availability for analytical processing.\n• Integrated **CI/CD** practices that automated the deployment of **AI/ML-powered fraud detection systems** utilizing **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, which improved fraud detection rates by **25%** through the analysis of complex transaction patterns.\n• Created scalable ML pipelines for credit scoring and transaction classification using **MLflow** and **Apache Airflow**, enabling real-time decision-making with model inference deployed directly into the backend, impacting over **100K transactions per month**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Executed full-stack development by designing and optimizing both backend and frontend services for a global e-commerce platform utilizing **Python (Django, FastAPI)** and **Node.js (NestJS, Express)**, ensuring high availability and low latency across key modules.\n• Developed and maintained RESTful APIs and gRPC for seamless communication between services, enhancing performance and facilitating integration with various microservices.\n• Leveraged **PostgreSQL** for robust data storage and retrieval, ensuring efficient data management for high-traffic workflows, with careful attention to **data structures** and **algorithms** for optimal performance.\n• Employed **Kubernetes** for container orchestration, facilitating CI/CD pipelines that enabled automated deployments and enhanced application reliability across multiple environments.\n• Collaborated in agile teams, demonstrating a collaborative attitude while solving intricate problems in development efforts, resulting in improved workflow efficiency and team cohesion.\n• Utilized caching practices with **Redis** to enhance application speed by reducing database load, achieving a throughput increase of **30%** in request handling.\n• Implemented clean coding standards and best practices to ensure maintainability and scalability of the codebase, significantly reducing technical debt.\n• Enhanced automation practices that streamlined build and deployment processes, cutting down deployment times by **40%** and reducing rollback incidents.\n• Participated in code reviews, promoting quality assurance and knowledge sharing within the team, resulting in a notable improvement in code quality and adherence to best practices.\n• Analyzed and refactored existing codebases to improve performance and user experience, which led to a **25%** increase in user engagement through optimized functionalities.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tgRPC, RESTful APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Neo4j, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, clean coding, automation practices, data structures, algorithms, collaborative attitude, problem-solving"
}