{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior QA Engineer with 13+ years of experience specializing in Python and JavaScript, skilled in developing and testing high-performance applications within the healthcare and financial sectors. Proficient in utilizing **PyTest** and **Playwright** for thorough testing and automation of applications, while maintaining REST API standards. Expertise in Azure DevOps, including **Azure Pipelines**, and adept at managing project workflows with tools like **Jira** and **TestRail**.\n\nExperienced in ensuring compliance with industry standards such as HIPAA and PCI DSS, bringing a strong understanding of cloud services on **Azure**. Solid background in database management with **Cosmos DB** and **MongoDB**, alongside leveraging **Git** for version control. Committed to implementing continuous integration and delivery (CI/CD) best practices, while proficient in performance monitoring through **Datadog**. Driven to deliver quality assurance in software development processes while optimizing team productivity.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and executed comprehensive testing strategies, ensuring quality and performance across platforms utilizing **Python** and **JavaScript** frameworks.\nImplemented end-to-end testing using **PyTest** and **Playwright**, ensuring robust coverage for **REST APIs** and web applications.\nCollaborated with cross-functional teams to manage and track defects through **Jira** and **TestRail**, enhancing team communication and project transparency.\nDeveloped and optimized automated test scripts using **Azure Pipelines** and integrated version control with **Git** to streamline workflows and maintain code integrity.\nConducted performance and load testing on microservices architectures, leveraging **Cosmos DB** and **MongoDB** for managing test data efficiently.\nUtilized **Azure DevOps** for continuous integration and deployment, ensuring timely feedback and rapid iterations in the development cycle.\nAnalyzed and reported on test metrics using **Datadog**, providing insights into application performance and stability.\nParticipated in peer code reviews and QA team meetings to uphold development standards and foster knowledge sharing among teams.\nVerified functionality and compliance with security standards, working closely with the development team to address vulnerabilities in Active Directory and **Entra ID** integration.\nDefined and enforced effective testing protocols across all applications, maintaining high levels of quality through meticulous test case development and execution."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Executed rigorous testing strategies for applications built with **Python** and **JavaScript**, ensuring seamless functionality and user satisfaction by developing automated test cases.\nUtilized **PyTest** and **Playwright** for efficient validation of REST APIs and user interfaces, achieving a test coverage increase by **30%** within the first **6 months**.\nCollaborated closely with development teams using tools like **Jira** and **Azure DevOps** to streamline QA processes and enhance issue tracking and resolution times by **20%**.\nImplemented continuous integration/continuous deployment (CI/CD) setups using **Azure Pipelines**, facilitating faster release cycles and maintaining high-quality code standards.\nConducted performance and load testing through **Datadog**, ensuring system robustness and identifying bottlenecks, successfully mitigating risks resulting in achieving reliability targets of **99.9%** uptime.\nEngaged in comprehensive testing of databases like **Cosmos DB** and **MongoDB**, validating data integrity and application logic to ensure accurate financial transactions support.\nExecuted user acceptance testing (UAT) in coordination with stakeholders, documenting results using **TestRail** for thorough feedback and product adjustments prior to launch.\nMentored junior QA engineers on best practices for writing efficient tests with **Git** workflows and leveraging tools for collaborative development."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conduct comprehensive testing strategies using **PyTest** and **Playwright** to ensure reliability and performance of **REST APIs** developed in **Python** and **JavaScript**, increasing bug detection rates by **30%**.\nUtilize **Azure Pipelines** for continuous integration and deployment processes, leading to a **40%** reduction in deployment time and enhancing release cycles.\nCreate and maintain detailed test cases in **TestRail**, managing project documentation and tracking test progress in **Jira** to streamline collaboration among cross-functional teams.\nIntegrate automated testing frameworks to validate functionalities of microservices, enhancing coverage to **95%** through rigorous unit and integration testing.\nPerform user acceptance testing (UAT) utilizing feedback loops to refine applications before deployment, ensuring alignment with business requirements and enhancing user satisfaction scores by **25%**.\nLeverage **Git** for version control, enabling efficient tracking of changes and facilitating team collaboration on code reviews and merges.\nMonitor application performance and reliability using **Datadog**, identifying and resolving bottlenecks in real-time to maintain optimal user experience.\nImplement security testing protocols to validate the integrity of user data, focusing on privacy regulations such as GDPR compliance, safeguarding user information effectively.\nAdminister **Azure DevOps** for project management, ensuring timely delivery of quality software by tracking sprint velocities and adjusting workloads based on team capacity.\nUtilize **Cosmos DB** and **MongoDB** for backend testing to ensure efficient dataflows and accessibility, contributing to scalability and reliability of applications."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST API\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Cosmos DB\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, Azure DevOps, Azure Pipelines\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, PyTest, Playwright, TestRail, Jira, Active Directory, Entra ID, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Redis, Datadog",
  "apply_company": "One Identity"
}