{
  "name": "Tomasz Lee",
  "role_name": "Senior Data Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Data Engineer with 9+ years of experience in building efficient data pipelines and managing data governance using **SQL**, **Databricks**, **Google BigQuery**, and **Airflow**. Proficient in **data modeling**, **metadata management**, and performing **data versioning** to ensure smooth schema evolution. Experienced with containerization and orchestration using **Docker** and **Kubernetes** while implementing CI/CD practices to automate workflows. Strong problem-solving abilities and effective communication skills, complemented by a solid foundation in collaboration and project management to drive projects to successful completion. Previous expertise as a .NET Full Stack Developer demonstrates a comprehensive understanding of development processes, ensuring adaptable and robust data solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and optimized data pipelines using **Databricks** and **Google BigQuery** to improve data processing efficiency, achieving a reduction in processing time by **30%**.\nDesigned and implemented data modeling strategies to ensure **data governance**, adhering to compliance standards across various datasets.\nSpearheaded the creation of CI/CD pipelines utilizing **Docker** and **Kubernetes**, resulting in a **50%** increase in deployment efficiency.\nManaged **metadata management** processes to enhance data discoverability and integrity across the organization.\nImplemented **Airflow** for orchestration of complex data workflows, increasing task scheduling efficiency by **40%**.\nWorked extensively with SQL queries to optimize data retrieval and storage on **MSSQL**, enhancing query performance by **25%** through efficient indexing techniques.\nUtilized **dbt** for transformation workflows, improving data quality and allowing for **schema evolution** as project requirements changed.\nCommunicated effectively with stakeholders to align project goals with data strategy, improving overall project management.\nEngaged in continuous problem-solving to enhance data governance strategies, ensuring adherence to industry standards and best practices in data handling.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **SQL** to manage and optimize databases, ensuring efficient data storage and retrieval in various projects, including MSSQL and MySQL.\nDeveloped data pipelines utilizing **Databricks** and **Google BigQuery** for real-time analytics, improving data processing speed by **40%**.\nImplemented **Airflow** for orchestrating data workflows, which simplified scheduling and monitoring, resulting in a **20%** reduction in workflow failures.\nCreated and maintained **Docker** containers and orchestrated with **Kubernetes** for scalable and efficient deployment of data services.\nDesigned CI/CD pipelines using GitHub Actions, leading to a **30%** decrease in deployment errors and faster release cycles.\nConducted data modeling and data governance practices to ensure data integrity and compliance with organizational standards.\nDeveloped and documented version control strategies for data using **data versioning** principles to improve consistency across teams.\nCollaborated with cross-functional teams to ensure alignment on project management goals, enhancing communication and project delivery times.\nLed implementation of **dbt** to manage data transformations and improve data accuracy across the platform.\nManaged metadata through strategic practices to enhance data discoverability and usability while maintaining schema evolution protocols.\n mentored junior developers on problem-solving techniques and effective project management, fostering a collaborative team environment."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **SQL** to design and optimize data models for internal CRM systems, resulting in a **20%** increase in sales team productivity.\nDeveloped data pipelines using **Databricks** to efficiently handle large volumes of customer data, ensuring data consistency across projects.\nImplemented **Google BigQuery** to enhance data querying capabilities, significantly improving query performance by **35%**.\nCreated **Airflow** workflows for orchestrating ETL processes, allowing for automated data ingestion and transformation.\nManaged Docker containers for deployment of data applications, ensuring consistency across different environments and streamlining CI/CD processes.\nUtilized **Kubernetes** for orchestration of containerized applications, improving scalability and reliability of services.\nCollaborated on data governance initiatives, establishing best practices for **metadata management** and ensuring compliance with organizational policies.\nFacilitated project management activities by maintaining timelines and deliverables, ensuring a smooth workflow within the development team.\nConducted regular data versioning and schema evolution review meetings to keep the team aligned and adaptive to changes in data requirements.\nSupported cross-functional teams through effective communication skills, resolving project-related challenges and fostering collaboration."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL, Databricks, Google BigQuery\n\n**DevOps**\n\tDocker, Kubernetes, CI/CD, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tApache Kafka, RabbitMQ, Redis, Airflow, dbt, object storage, data pipeline, metadata management, data versioning, schema evolution\n\n**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, communication skills, problem-solving, project management"
}