{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Platform Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Platform Engineer with 13+ years of experience specializing in delivering high-performance applications in compliance-driven sectors. Proficient in **Go**, **Rust**, **C++**, and **Scala**, with expertise in blockchain technologies including **smart contracts**, **EVM**, **Foundry**, and **Solidity**. Demonstrated ability in designing and implementing **CI/CD** pipelines, enhancing system performance, and ensuring observability in production environments. Experienced in developing technical documentation and optimizing algorithms and data structures for scalable solutions.\nPrior experience includes building AI/ML-powered platforms utilizing JavaScript/TypeScript, Python, and **Flutter**, with hands-on expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in deploying **cloud-native systems** on **AWS** and **Azure**, implementing microservices and event-driven architectures, while maintaining compliance with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong background in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Platform Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and implemented **CI/CD** pipelines utilizing tools like GitHub Actions and CircleCI, ensuring seamless integration and delivery of blockchain applications, significantly enhancing system performance by **40%**.\nConstructed and optimized **release pipelines** for smart contracts using **Foundry** and **Solidity**, leading to a **30%** reduction in deployment times and improved observability of contract interactions.\nDesigned and managed secure, decentralized applications leveraging **Go**, **Rust**, and **C++** to enhance the reliability and scalability of the platform, with an emphasis on robust **cryptography** techniques for safeguarding transactions.\nEngineered advanced algorithms and data structures, implementing **Merkle trees** for efficient data verification, leading to a **25%** improvement in data integrity checks.\nServed as a technical documentation lead, creating comprehensive guides and reference documents that streamlined onboarding and knowledge transfer for the engineering team.\nImplemented observability practices to monitor the performance of blockchain applications, identifying and resolving systemic issues, which resulted in a **50%** decrease in runtime errors.\nUtilized extensive knowledge of the **EVM** to execute optimized smart contract deployments, ensuring adherence to best practices and industry standards.\nCollaborated with multi-disciplinary teams to drive performance enhancements in existing systems while maintaining security and compliance with blockchain protocols.\nMentored junior engineers on best practices in **blockchain** development and **smart contract** creation, fostering a culture of continuous learning and technical excellence."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented blockchain solutions utilizing **Solidity** and **EVM** to enhance transaction security and integrity across financial applications.\nDeveloped smart contracts in **Rust** and **Go** to streamline various workflows, leveraging **Foundry** for smarter deployment processes and automated testing.\nEngineered high-performance systems by optimizing algorithms and data structures in **C++** and **Scala**, ensuring efficient processing of high-volume transactions with a focus on system performance improvements of up to **27%**.\nEstablished CI/CD pipelines for seamless integration and continuous deployment of applications using **GitLab** and **Jenkins**, enhancing release cycles and minimizing downtime.\nProduced comprehensive technical documentation for blockchain components and system architecture, improving team knowledge and onboarding processes.\nUtilized observability tools to monitor system performance, achieving a **15%** reduction in system latencies through proactive identification and resolution of bottlenecks.\nResearched and implemented cryptography techniques including **Merkle trees** to enhance data integrity within distributed systems, ensuring adherence to industry standards.\nDesigned and executed robust test frameworks for validating smart contract functionality with an accuracy rate exceeding **99%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented blockchain strategies to enhance platform security and transparency, utilizing **Solidity** for smart contracts and **EVM** to ensure compatibility across various decentralized applications.\nDesigned and optimized CI/CD pipelines leveraging **Foundry** to streamline deployment processes and enhance observability across the entire platform, ensuring system performance and reliability.\nDeveloped and maintained high-performance backend services using **Go**, **Rust**, and **C++** to facilitate efficient data processing and transaction handling across multiple modules.\nEngineered scalable algorithms and data structures employing **Merkle trees** to ensure data integrity and improve transaction verification processes, achieving an efficiency improvement of **75%** in data handling.\nConducted thorough technical documentation and best practice guidelines to ensure team alignment on blockchain implementation and system architecture.\nUtilized **Scala** to enhance the platform’s capabilities for processing large datasets, focusing on optimizing performance for data-heavy operations.\nApplied cryptographic techniques to secure user data and transaction records, ensuring GDPR compliance and elevating platform security standards.\nCollaborated with cross-functional teams to develop observability frameworks, ensuring real-time monitoring of system performance and quick resolution of issues, reducing downtime by **40%**.\nExecuted feature enhancements through continuous integration practices, facilitating timely releases and feedback loops, resulting in a **30%** improvement in deployment frequency.\nEmployed release pipelines to manage system updates and features efficiently, reducing release-related errors by **50%** and ensuring a robust, scalable architecture."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Go, Rust, C++, Scala\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS\n\tAzure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n **Other:**\n\tArtificial Intelligence & Machine Learning, MLflow, Airflow, Kubeflow, blockchain, EVM, smart contract, Foundry, Yul, Solidity, observability, release pipelines, system performance, cryptography, Merkle trees, algorithms, data structures, technical documentation, Keycloak, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Matter Labs"
}