{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Salesforce Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a proficient Senior Salesforce Engineer, I bring 8 years of full-stack development experience with a strong technical focus on **Salesforce Marketing Cloud**, **SQL**, and **Amscript**. My capabilities extend to implementing **Automation Studio** and **Email Studio**, optimizing processes, and developing custom solutions to enhance performance. I have a proven track record in **Journey Builder**, delivering personalized customer experiences through data-driven strategies and process optimization.\nAdditionally, I excel in Scripting and performance analysis, fostering collaboration across cross-functional teams to ensure continuous improvement and the successful execution of projects. My foundational expertise in full-stack technologies including **JavaScript**, **TypeScript**, **Python**, and frameworks such as **React**, **Next.js**, and **Node.js**, combined with deep cloud experience on **AWS** and **Azure**, allows me to build robust applications that meet compliance standards while integrating innovative solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Salesforce Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Salesforce Marketing Cloud** to architect and implement custom solutions, enhancing client engagement strategy through targeted campaign automation and performance analysis.\nDeveloped and optimized SQL queries to extract and manage data effectively, facilitating precise reporting and analysis of marketing performance across various channels.\nDesigned efficient workflows within **Automation Studio** and **Journey Builder**, increasing user engagement metrics by **25%** while ensuring seamless integration of marketing communications.\nCreated and managed customized email marketing solutions using **Email Studio**, achieving an average open rate improvement of **30%** through A/B testing and performance analysis.\nCollaborated with cross-functional teams to identify areas for process optimization, implementing new strategies that resulted in a **15%** reduction in campaign deployment time across multiple projects.\nLeveraged **Amscript** and scripting technologies to enhance personalized customer experiences, significantly increasing user satisfaction and retention rates.\nConducted comprehensive performance analysis to monitor KPI metrics, driving continuous improvement initiatives that led to enhanced campaign effectiveness.\nFostered collaboration among marketing, sales, and technology teams to align business objectives and ensure successful project execution and innovative solution delivery.\nEstablished best practices for campaign automation, creating documentation and training materials to support team members and enhance capabilities within the organization.\nImplemented quality control measures within all projects to maintain high standards of deliverables, directly contributing to a **40%** decrease in error rates within campaign outputs."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed customized solutions within **Salesforce Marketing Cloud** leveraging **Amscript**, driving process optimization and automation through **Automation Studio**, improving efficiency in marketing campaigns by **20%**.\nImplemented and managed automated email communications utilizing **Email Studio** and crafted effective customer journeys via **Journey Builder**, increasing user engagement by **15%**.\nExecuted performance analysis of marketing strategies, utilizing **SQL** to extract data-driven insights, facilitating continuous improvement and increasing conversion rates by **10%**.\nCollaborated with cross-functional teams to integrate **Salesforce Marketing Cloud** with existing systems, enhancing data synchronization and reporting capabilities, resulting in improved campaign effectiveness.\nUtilized scripting techniques to automate repetitive tasks, significantly reducing manual errors and optimizing workflow processes.\nContinuously assessed and refined custom solutions to align with organizational goals, leveraging best practices in marketing automation and performance analysis to enhance user experience and engagement."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Salesforce Marketing Cloud** and **Amscript** to create and optimize dynamic marketing campaigns, ensuring high engagement and conversion rates while managing over **50** automated journeys per month.\nDeveloped complex SQL queries for data extraction and manipulation, enabling detailed performance analysis and enhancing overall marketing effectiveness by **30%**.\nLed the design and implementation of custom automation solutions utilizing **Automation Studio** and **Journey Builder**, resulting in a **25%** reduction in manual processes and improved operational efficiency.\nChoreographed email marketing strategies using **Email Studio**, crafting compelling templates and effective workflows that contributed to a **40%** growth in open rates.\nApplied robust scripting techniques aligned with **Salesforce** best practices to enhance existing automation processes, driving continuous improvement and seamless marketing operations.\nCollaborated with cross-functional teams to develop innovative solutions and align marketing goals, fostering an environment of teamwork and enhancing project outcomes.\nExecuted performance analysis and optimization strategies, identifying key metrics that informed decisions and further optimized marketing initiatives across the platform.\nOrchestrated process optimizations and the execution of new onboarding workflows, leading to a **20%** increase in customer engagement metrics.\nImplemented and monitored effective A/B testing strategies, ensuring campaign effectiveness and contributing to data-driven marketing evolution."
    }
  ],
  "skills": "Programming Languages:\n\tSQL,\n\n**Backend Frameworks:**\n\tPython(FastAPI, Flask, Django),\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular),\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL),\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis,\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose,\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tSalesforce Marketing Cloud, Amscript, Automation Studio, Journey Builder, Email Studio, Custom Solutions, Process Optimization, Scripting, Collaboration, Performance Analysis, Continuous Improvement",
  "apply_company": "MatchGuru"
}