{
  "name": "Patryk Zaslawski",
  "role_name": "ML Engineer Specialist – AI Trainer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As an accomplished ML Engineer Specialist with 8+ years of experience, I excel in **Python** for developing cutting-edge machine learning solutions, specializing in **ML frameworks** and techniques such as supervised learning, unsupervised learning, deep learning, and reinforcement learning. My strong background in **data science** and **NLP** equips me to design and implement advanced algorithms and probabilistic modeling for various applications. I am adept at integrating cloud-based workflows using platforms like **AWS** and **Azure** to ensure scalable solutions. Furthermore, my skills in effective communication and collaboration foster successful teamwork and project execution. My previous experience as a Senior Python Full Stack Developer enhances my capability to deliver high-performance applications in diverse sectors, reinforcing a commitment to industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "ML Engineer Specialist – AI Trainer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Leveraged **Python** to develop machine learning models utilizing frameworks like **TensorFlow**, **PyTorch**, and **scikit-learn** for supervised and unsupervised learning tasks, achieving model accuracies of over **85%**.\nImplemented **Natural Language Processing (NLP)** solutions to enhance data interpretation and user interaction, leading to a **30%** increase in engagement metrics.\nDesigned and executed deep learning architectures for predictive analytics, reducing prediction time by **40%** using **Keras** and other relevant libraries.\nApplied reinforcement learning techniques to optimize decision-making processes in real-time applications, resulting in a **25%** increase in overall system efficiency.\nConducted exploratory data analysis (EDA) on **large datasets** to identify trends and patterns, accelerating data-driven decision-making.\nCollaborated with cross-functional teams, utilizing strong communication skills to convey technical concepts and results effectively.\nUtilized probabilistic modeling strategies to enhance data forecasting accuracy and minimize risk, contributing to strategic planning decisions.\nDeveloped and maintained **cloud-based workflows** for model training and deployment using services such as **AWS S3** and **Azure Machine Learning**, ensuring scalable infrastructure supporting **10+** simultaneous training processes.\nOptimized existing machine learning pipelines for performance, reducing training times by **50%** and improving model retraining frequency.\nPlayed a key role in mentoring junior data scientists and collaborating with stakeholders to align AI solutions with overall business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** along with **ML frameworks** to design machine learning models incorporating **supervised learning**, **unsupervised learning**, and **deep learning** techniques for advanced data analysis and decision-making.\nCollaborated effectively with stakeholders, leveraging strong **communication skills** to gather requirements and necessary datasets for training machine learning algorithms.\nImplemented natural language processing (NLP) methods to enhance data processing capabilities, achieving a **20%** improvement in model accuracy through effective data representation.\nConducted experiments with various ML models, achieving significant performance improvements; for instance, a **15%** boost in predictive accuracy over baseline models using **reinforcement learning** techniques.\nEmployed probabilistic modeling to ensure robust forecasting capabilities, resulting in more accurate predictions significantly impacting business decisions.\nWorked with cloud-based workflows for efficient model training and deployment on **AWS** and **Azure**, streamlining the integration process and reducing time to market by **30%**.\nIntegrated feedback loops into machine learning models to continuously refine predictions, resulting in ongoing improvements in model outputs.\nDeveloped user-centric dashboards to visualize model predictions and performance metrics using **Python** libraries, facilitating better insights for stakeholders.\nMaintained a version-controlled repository of ML models and training scripts, ensuring reproducibility and collaboration across teams using **GitHub**.\nConducted training sessions and workshops for team members on best practices in machine learning, enhancing overall team's capability to leverage ML technologies effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented machine learning algorithms and models using **Python** to drive data-driven decision-making and enhance predictive analytics.\nDeveloped and validated **NLP** solutions for understanding and processing natural language data, improving user interactions and insights.\nApplied both supervised and unsupervised learning techniques to mine large datasets, delivering scalable models that boost accuracy by **15%** on test data.\nUtilized **deep learning** frameworks such as TensorFlow and PyTorch to build complex neural networks that support various AI use cases, achieving training efficiencies by leveraging **cloud-based workflows**.\nDesigned and executed probabilistic modeling approaches to improve prediction reliability and actionable insights, reducing error margins by **20%**.\nCollaborated effectively with cross-functional teams, enhancing communication skills to translate complex data science concepts to non-technical stakeholders.\nConducted reinforcement learning experiments that demonstrated a **30%** increase in task performance over baseline models through iterative improvements.\nCreated robust data pipelines for training and deploying machine learning models, ensuring seamless integration with existing systems.\nPresented findings and insights clearly to leadership, improving buy-in on data initiatives and driving strategic decisions based on ML outcomes.\nMaintained comprehensive documentation to preserve knowledge on data workflows and machine learning innovation, facilitating team understanding.\nTrained and mentored junior team members in machine learning principles and practices, fostering a culture of continuous learning and improvement."
    }
  ],
  "skills": "Programming Languages:\n\tPython\n\n**Machine Learning & Data Science:**\n\tmachine learning, NLP, data science, supervised learning, unsupervised learning, deep learning, reinforcement learning, probabilistic modeling, ML frameworks\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tcommunication skills"
}