{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Software Developer with 8 years of expertise in building high-performance applications utilizing **Kotlin**, **Spring Boot**, **Java**, **PostgreSQL**, and **Python**. Proficient in developing scalable solutions with **Golang** and **Vue 3**, leveraging AI-assisted development tools to enhance productivity. I have substantial experience in integrating e-commerce platforms like **Shopify**, **Magento**, and **WooCommerce**, along with developing robust ERP and PIM systems.\nMy strong background in data processing and cloud services allows me to contribute effectively to remote teams by ensuring clear communication and collaboration. I am known for my curiosity and initiative, combined with a structured and self-driven approach to project management, ensuring timely and high-quality delivery of solutions. I have successfully led initiatives that incorporate modern technologies and compliant standards in various sectors, achieving significant project milestones and enhancing overall system efficiency.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented scalable software solutions utilizing **Kotlin**, **Spring Boot**, and **Java**, focusing on modern software development best practices and agile methodologies.\nDeveloped and maintained robust data processing and database management systems with **PostgreSQL**, ensuring efficient data storage and retrieval for applications.\nDesigned and integrated user-friendly web interfaces using **Vue 3**, enhancing user experience and engagement across various platforms.\nApplied **Python** and **Golang** for backend service development, emphasizing performance and reliability in response handling.\nUtilized AI-assisted development tools to streamline development processes, increasing team productivity by **30%** and reducing deployment times.\nCollaborated effectively in remote teams, ensuring clear communication and alignment on project goals and timelines across multiple time zones, improving delivery speed by **25%**.\nDemonstrated curiosity and initiative by researching and adopting emerging technologies, resulting in increased project innovation and efficiency.\nLed technical discussions and knowledge-sharing sessions, fostering a structured and self-driven work environment conducive to skill advancement for team members.\nEngaged in the development of e-commerce solutions using platforms like **Shopify**, **Magento**, and **WooCommerce**, contributing to successful launches of **15+** websites with integrated ERP and PIM systems.\nContinuously monitored software performance and operational KPIs, optimizing code and infrastructure to achieve an **uptime of 99.9%** across deployed applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed scalable, maintainable financial platforms leveraging **Node.js** (NestJS/Express) and **Python** (FastAPI, Django) to enhance system throughput and adaptability for high-volume transactions.\n- Built dynamic applications with **Vue 3** for front-end development, utilizing **Redux Toolkit** and **Tailwind CSS** to optimize performance and user experience across **3** financial dashboards and **admin portals**.\n- Created real-time transaction monitoring dashboards using **React**, **D3.js**, and **Power BI Embedded**, enabling operations teams to analyze financial activity and produce actionable insights with a reduction in anomaly detection time by **20%**.\n- Integrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to establish a resilient event-driven architecture that promotes efficient asynchronous communication for transactions and compliance alerts.\n- Designed and orchestrated **ETL** pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory**, resulting in an **80%** increase in data processing efficiency from various sources.\n- Implemented AI/ML-driven fraud detection using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, achieving a **30%** improvement in identifying suspicious activities within the banking system.\n- Developed **ML** pipelines for credit scoring and churn prediction utilizing **MLflow** and **Airflow**, enhancing decision-making capabilities by embedding model inference in real-time backend services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed scalable backend services using **Java** (Spring Boot) and **Kotlin**, ensuring high availability and performance within e-commerce platforms.\nImplemented efficient data processing solutions leveraging **PostgreSQL** for optimal database interactions, enhancing data retrieval times by **30%**.\nEngineered real-time features with an emphasis on seamless user experiences using **Vue 3**, providing dynamic updates and maintaining engagement.\nUtilized **Golang** for building microservices, improving the modularity of the application and supporting deployment scalability with containerization strategies.\nIntegrated AI-assisted development tools to streamline development processes, fostering a culture of **initiative** and continuous improvement.\nCollaborated remotely with cross-functional teams, maintaining clear communication channels that facilitated project alignment and goal attainment, leading to successful project completions ahead of deadlines by **15%**.\nDesigned and developed e-commerce functionalities leveraging platforms like **Shopify**, **Magento**, and **WooCommerce**, with a focus on integrating ERP and PIM systems for superior product management.\nApplied structured methodologies to manage features and enhancements, ensuring that development was driven by curiosity and user feedback captured during testing phases.\nEmphasized best practices in code quality and collaborative software development, introspecting on components to enhance **user accessibility**.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Java, Kotlin, Golang, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Vue 3\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tAI-assisted development tools, Shopify, Magento, WooCommerce, ERP systems, PIM systems, Data processing, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Remote collaboration, Clear communication, Curiosity, Initiative, Structured and self-driven"
}