{
  "name": "Tomasz Lee",
  "role_name": "Senior Innovation Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Innovation Engineer with 9+ years of experience in machine learning, AI, and automated testing. Proficient in **PHP**, **JavaScript**, **Python**, and adept at leveraging open-source technologies to drive innovation. Strong skills in data visualization and UX, complemented by hands-on experience using **Jira**, **Confluence**, and **Slack** for effective collaboration in agile environments. Proven track record in R&D projects, focused on delivering impactful and innovative solutions, while optimizing workflows and enhancing performance. Experienced in full stack development, with expertise in microservices architecture and distributed systems, ensuring robust application deployment.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Innovation Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **JavaScript** frameworks and **Python** for developing innovative solutions that enhance user interaction, leading to a user satisfaction increase by **25%**.\nConducted R&D initiatives utilizing **AI** and **machine learning** strategies to explore new features and capabilities in web applications.\nEngineered dynamic and interactive data visualizations using **data visualization** libraries, significantly improving reporting capabilities.\nImplemented automated testing frameworks to ensure high code quality, resulting in reduced bugs and maintainability.\nCollaborated with cross-functional teams using **Jira**, **Confluence**, and **Slack** to improve project transparency and workflow efficiency.\nRedesigned existing user interfaces following **UX** principles, leading to an improved user experience.\nManaged and optimized multiple **databases** effectively to support application data needs and enhance performance.\nChampioned agile methodologies to facilitate rapid iteration and innovation within project timelines.\nExplored open source technologies to drive innovative solutions, pushing for team-wide adoption of best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **JavaScript** to enhance user interfaces in innovation projects, improving user experience (UX) by **15%**.\nImplemented **PHP** and **Python** scripts for server-side logic in machine learning applications, leading to a **20%** increase in processing speed.\nConducted automated testing with tools ensuring high code quality, reducing bug rates by **30%** in production environments.\nCollaborated with cross-functional teams using **Jira** and **Confluence** for project management, fostering agile development practices.\nEngaged in R&D activities to innovate data visualization techniques, leveraging **open source** libraries to present complex data effectively.\nDeveloped and optimized various databases including MySQL and PostgreSQL to facilitate efficient data retrieval and management.\nLed workshops on **AI** and **machine learning**, disseminating knowledge among team members and enhancing innovation capacity.\nCommunicated effectively through **Slack** to ensure collaborative problem-solving and project alignment.\nProduced impactful visual presentations and interactive dashboards using **data visualization** tools which increased stakeholder engagement by **25%**.\nDrove technology innovation discussions, consistently seeking opportunities for improvements in workflows and processes."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **PHP** and **JavaScript** frameworks to enhance system capabilities, driving innovation in project approaches.\nImplemented **machine learning** algorithms to optimize user experience (UX), improving engagement metrics by **15%**.\nUtilized **automated testing** practices to increase software reliability and decrease bug reports by **30%**.\nManaged data flow and architecture within various **databases**, ensuring robust data handling and visualization, which improved reporting speed by **25%**.\nCollaborated seamlessly via **Jira**, **Confluence**, and **Slack** to maintain clear communication and project tracking within an **agile** environment.\nDeveloped integrated solutions through **open source** contributions, fostering enhanced functionality and user adoption.\nParticipated in **R&D** sessions to explore cutting-edge technologies and innovations to apply to the current projects.\nEngaged in daily standups and retrospectives to align team goals and ensure accountability across project timelines.\nProduced comprehensive technical documentation and data visualization artifacts to improve understanding and facilitate knowledge transfer among cross-functional teams."
    }
  ],
  "skills": "  **Programming Languages**\n\tJavaScript, Python, PHP\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\t\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, automated testing, data visualization, innovation, R&D, agile, open source, Jira, Confluence, Slack, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Matomo"
}