{
  "name": "Tomasz Lee",
  "role_name": "Senior Cloud Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Cloud Engineer with 9+ years of experience in cloud services including **AWS**, **Azure**, and **GCP**. Proficient in **Terraform**, **Ansible**, and CI/CD practices to automate and streamline infrastructure management. Solid background in networking, cybersecurity, and Linux environments, demonstrating expertise in **Bash** scripting and **Python** development. Experienced in building and managing distributed systems, with a solid understanding of microservices architecture. Recognized for optimizing performance and delivering robust cloud solutions while collaborating effectively across teams and leading projects to successful outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **AWS**, **Azure**, and **GCP** for cloud solutions, enhancing infrastructure scalability and reliability by over 50%.\nImplemented **Terraform** for infrastructure as code management, streamlining deployment processes and ensuring consistency across environments.\nAutomated configuration management using **Ansible**, reducing time spent on manual processes by 30%.\nDeveloped secure cloud architectures with a focus on **Cyber Security**, enhancing data protection protocols, achieving compliance with industry standards.\nUtilized **Python** and **Bash** scripting for automation tasks, improving operational efficiency across cloud services.\nDesigned and maintained Linux-based systems for optimized performance and uptime, managing over **100** servers in the cloud environment.\nCollaborated in cross-functional teams to design networking solutions, reducing packet loss and connection latency by **20%**.\nImplemented CI/CD pipelines for continuous deployment within **Azure** environments, cutting deployment time by **40%**.\nConducted infrastructure monitoring and maintained security frameworks utilizing **Palo Alto Networks** solutions, reducing vulnerabilities by **35%**.\nEngaged in daily stand-ups and sprint planning, ensuring alignment with project goals and timelines."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented CI/CD strategies using **Terraform** and **Ansible**, ensuring a streamlined deployment process and reducing production deployment errors by **30%**.\nDesigned and optimized cloud infrastructure on **AWS**, **Azure**, and **GCP**, enhancing the scalability and reliability of services.\nDeveloped automation scripts in **Python** and **Bash** for efficient resource management and monitoring tasks on **Linux** servers.\nManaged secure networking configurations and enforced **Cyber Security** protocols to safeguard cloud environments, resulting in improved data protection.\nCollaborated with cross-functional teams to define requirements for cloud deployment and network architecture, ensuring alignment with business goals.\nUtilized **Golang** for developing microservices, improving service performance and responsiveness.\nConducted infrastructure assessments and implemented best practices for using **Palo Alto Networks** security solutions.\nLed training sessions on cloud services and security strategies for junior engineers, enhancing their skill sets and team capability.\nEngaged in troubleshooting and resolving network-related issues, ensuring minimum downtime and optimal performance.\nDeveloped monitoring solutions using native cloud tools to provide actionable insights and maintain service health."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **AWS**, **Azure**, and **GCP** to deploy and manage cloud infrastructure, enhancing system scalability and reliability.\nImplemented **CI/CD** pipelines using **Terraform** and **Ansible** for automated deployment processes, reducing deployment time by **50%**.\nLeveraged **Python** scripts for cloud resource management, increasing efficiency in operational tasks by **30%**.\nCollaborated on a multi-cloud strategy to ensure seamless integration across services, enhancing data resilience and access.\nConfigured networking solutions with a focus on **Cyber Security** practices, significantly reducing security incidents by **15%**.\nParticipated in regular security audits and reviews of cloud configurations, ensuring compliance with best practices and regulatory standards.\nEngaged in troubleshooting and support for cloud-based applications on **Linux** environments, improving uptime by **25%**.\nDeveloped automated monitoring solutions using **Bash** scripts to ensure system health and immediate alerts for anomalies.\nUtilized **Golang** for lightweight service development, which lowered the resource footprint of applications by **20%**.\nActively participated in team meetings and code reviews to align project goals with industry standards for cloud engineering."
    }
  ],
  "skills": "****API Technologies****\n\tRESTful API, GraphQL\n\n****Backend Frameworks****\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n****Cloud & Infrastructure****\n\tAWS, Azure, GCP, Terraform, Ansible, Networking, Cyber Security, Palo Alto Networks\n\n****Databases****\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n****DevOps****\n\tCI/CD pipelines, Linux, Bash\n\n****Frontend Frameworks****\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, Redux\n\n****Other****\n\tGit, GitHub, Python, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Microservices\n\n****Messaging & Caching****\n\tApache Kafka, RabbitMQ, Redis\n",
  "apply_company": "CodiLime"
}