{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Systems Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Systems Engineer with over 10 years of experience specializing in **JavaScript**, **Python**, and **REST APIs**, adept at integrating webhooks and building robust data architectures that enhance business operations. Proven track record in developing and optimizing **financial systems** and **payment infrastructure**, ensuring compliance with industry standards and successful implementation of **compliance workflows**. Skilled in establishing efficient **data pipelines** and leveraging **analytics platforms** for business intelligence that drive tangible results. Demonstrated problem-solving capabilities and a commitment to improving existing systems, with a depth of expertise in hands-on software development and architecture. Proficient in cloud services including **Azure** and **AWS**, and familiar with modern tools and frameworks like **React**, **Node.js**, **FastAPI**, and **Django**, complemented by experience in leading MLOps initiatives with tools such as **MLflow** and **Airflow**.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Systems Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDesigned and implemented scalable **data architecture** and **API integration** solutions for business operations and financial systems using **Python** and **JavaScript**, ensuring compliance with regulatory workflows.\n•\tDeveloped and optimized **REST APIs** for payment infrastructure and compliance workflows, leveraging **webhooks** to enhance data flow across analytics platforms and financial systems.\n•\tEngineered high-performance **data pipelines** for analytics, providing insights into business operations and enabling data-driven decisions for financial systems.\n•\tImplemented **problem-solving** strategies to streamline **business intelligence** processes, ensuring robust reporting and analytics capabilities.\n•\tCollaborated with cross-functional teams to enhance existing systems with **Zoho**, **Deluge**, and custom integrations, increasing operational efficiency by over **30%**.\n•\tConducted proactive compliance assessments and adjustments for systems involving **payment infrastructure**, ensuring adherence to industry regulations and minimizing risks of non-compliance.\n•\tPlayed a key role in maintaining system integrity by troubleshooting issues within **financial systems** and deploying innovative solutions, resulting in a **25%** reduction in downtime.\n•\tActively engaged in the integration of third-party tools to enhance existing capabilities, successfully reducing runtime by **15%** across various operations.\n•\tOptimized data pipelines for analytics platforms, resulting in a significant increase in processing speeds from **10GB** to **50GB** data sets within a week, ensuring timely data availability for business strategy insights.\n•\tEnhanced overall system performance by conducting regular audits and implementing improvements, leading to a **40%** increase in data retrieval efficacies."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **Python** to enhance financial systems and payment infrastructures, ensuring compliance with business operations and workflows.\nLed the design of **REST APIs** and **webhooks** for seamless **API integration**, facilitating real-time data exchange within financial platforms while improving operational efficiency by 30%.\nConducted in-depth analysis and optimization of **data architecture**, supporting the development of data pipelines that enabled the ingestion of **9 TB** of data annually from various sources.\nApplied advanced problem-solving techniques to implement robust **data pipelines** using **Apache Airflow** and **Zoho**, ensuring data integrity and reliability across **analytics platforms**.\nDeveloped an analytics dashboard leveraging **Python** and **Power BI Embedded**, which provided real-time insights and improved decision-making speed by 25%.\nIntegrated payment infrastructure with existing frameworks to support compliance workflows and enhance transaction processing speed, achieving a throughput improvement of **5x**.\nExecuted strategic enhancements in financial systems through comprehensive testing and bank integration, leading to a **40%** reduction in operational costs and boosting efficiency.\nFostered collaboration between technical teams and business stakeholders, maximizing platform usability and aligning with overall business intelligence goals."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and integrated **REST APIs** using **Python** (Django, FastAPI) and **JavaScript** for efficient communication between systems, enhancing operational efficiencies in accordance with business operations.\n• Designed data architecture and engineered robust **data pipelines** to support analytics platforms, ensuring data quality and facilitating insights for financial systems.\n• Implemented seamless **API integration** with **Zoho** services, utilizing **webhooks** and **Deluge** to automate workflows and improve compliance workflows across business processes.\n• Leveraged **Python** for crafting comprehensive problem-solving solutions tailored to optimize payment infrastructure and enhance transaction processes.\n• Conducted performance tuning and optimization strategies achieving up to **30%** improvement in data query response times across high-traffic backend services.\n• Drove adoption of compliance measures relating to user data protection, conducting audits to ensure GDPR compliance in line with best practices in data security and operations.\n• Spearheaded the transaction processing framework implementing secure payment systems in adherence to PCI standards, resulting in zero compliance issues over **3** years.\n• Collaborated with cross-functional teams to implement new business intelligence tools, achieving a **25%** increase in actionable insights for stakeholders and decision-makers.\n• Championed enhancements in financial systems leading to streamlined operations, significantly reducing manual input requirements by **40%** through automation and integration.\n"
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tREST APIs, webhooks, API integration\n\n **Serverless and Cloud Functions:** \n\tAWS (Lambda), Azure (App Services)\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, problem-solving, data architecture, business operations, financial systems, payment infrastructure, compliance workflows, data pipelines, analytics platforms, business intelligence, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Aajil"
}