{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Site Reliability Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Site Reliability Engineer with 13+ years of experience in building and maintaining high-performance applications, particularly within healthcare and financial sectors. Proficient in **AWS**, **Kubernetes**, **Docker**, **Terraform**, and **Helm** for cloud-native deployment and infrastructure management. Highly skilled in **CI/CD** processes using **Jenkins**, **GitLab CI**, and enabling **IaC** and **GitOps** practices for streamlined operations.\nExpert in scripting with **Bash** and developing robust, efficient systems with **Python** while managing databases and ensuring SQL compliance. Experienced with Linux and Unix environments, utilizing **Prometheus**, **Grafana**, and **ELK** stack for monitoring and performance optimization.\nSolid foundation in **Java**, **JavaScript**, and **HTTP**/DNS/CDN protocols. Committed to leveraging Agile methodologies, and proficient in tools like **Jira** to ensure seamless communication and teamwork. Demonstrates a strong ability to align solutions with compliance standards, including HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Site Reliability Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **CI/CD** pipelines using **Jenkins**, **GitLab CI**, and **AWS** for efficient deployment processes ensuring high reliability and availability of services across multiple environments.\nLeveraged **Docker**, **Kubernetes** for container orchestration and management of microservices, allowing rapid scaling and consistent deployment procedures.\nEnsured system reliability by monitoring performance metrics using **Prometheus** and **Grafana**, addressing issues proactively and enhancing system availability by **99.9%**.\nEmployed **Terraform** for Infrastructure as Code (IaC), enabling reproducible and maintainable infrastructure management across cloud platforms.\nUtilized scripting in **Bash** and **Python** to automate routine tasks, enhancing operational efficiency and reducing error rates.\nCollaborated in an **Agile** environment, taking part in daily stand-ups and sprint planning using **Jira** to manage project timelines and deliverables effectively.\nMaintained databases and managed data integrity using **SQL** and **NoSQL** solutions, optimizing query performance for large datasets.\nFocused on robustness by integrating comprehensive monitoring and logging practices using the **ELK** stack to troubleshoot and resolve issues swiftly.\nSupported the development team by fostering good **communication skills** and **teamwork**, ensuring seamless collaboration during incident response strategies and deployment cycles.\nConducted regular disaster recovery tests and failover procedures to enhance system resilience and recovery times under 5 minutes.\nMentored junior engineers and conducted training sessions to improve team proficiency in **AWS**, **Kubernetes**, and **CI/CD** best practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **AWS** services for deploying microservices, ensuring high availability and fault tolerance across environments.\nLeveraged **Docker** and **Kubernetes** for container orchestration and management, achieving a **50%** improvement in deployment efficiency and reducing downtime.\nUtilized **Terraform** and **Helm** for Infrastructure as Code (IaC), streamlining the provisioning of cloud resources and version control for environments.\nDesigned CI/CD pipelines using **Jenkins** and **GitLab CI**, enhancing deployment frequency by **40%** while maintaining a rollback capability.\nDeveloped automated monitoring and logging solutions using **Prometheus**, **Grafana**, and the **ELK stack**, ensuring system reliability and providing actionable insights for quick problem resolution.\nUtilized **Bash** scripting for automation of system administration tasks across **Linux** and **Unix** environments, achieving a reduction in manual intervention by **30%**.\nCollaborated in an **Agile** environment using **Jira**, fostering effective communication and teamwork to deliver resilient infrastructure and platforms.\nConducted routine database maintenance and performance tuning for SQL-based databases, improving query execution time by **25%**.\nEngaged in proactive troubleshooting of **HTTP**, **DNS**, and **CDN** issues, ensuring minimal service interruptions and maintaining service level agreements (SLAs)."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Managed infrastructure as code (IaC) using **Terraform** and **Helm** for automated deployments, enhancing reliability and reducing setup time by **30%** for multi-environment applications.\nImplemented **CI/CD** pipelines using **Jenkins** and **GitLab CI**, achieving a **50%** reduction in deployment time and improving throughput for feature releases in an Agile environment.\nMonitored application performance and system health using **Prometheus**, **Grafana**, and the **ELK Stack**, ensuring an uptime of **99.9%** across services and quick response to incidents.\nUtilized container orchestration with **Kubernetes** and **Docker** to manage microservices deployment, facilitating scalable architecture and simplifying rollback processes by **40%** in critical updates.\nCollaborated with cross-functional teams using **Jira** for project tracking and agile workflow, fostering strong communication and teamwork to deliver high-quality software solutions.\nLeveraged **AWS** services to ensure scalable infrastructure, achieving cost-saving optimizations that reduced operational expenses by **25%** while maintaining high availability and disaster recovery capabilities.\nEnhanced data storage and retrieval processes using SQL databases within a **Linux** and **Unix** environment, ensuring robust handling of dynamic application data.\nApplied **Bash** scripting for automation tasks, improving operational efficiency and minimizing manual intervention in routine maintenance tasks by **20%**.\nConducted regular performance tuning and optimizations in system architecture, leading to improved response times and overall user satisfaction, backed by comprehensive metric analysis and reporting.\nEngaged in proactive troubleshooting and incident management, ensuring quick resolution to service disruptions and maintaining a customer-first approach to service delivery."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, Java, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tHTTP, OAuth2, JWT\n\n **Serverless and Cloud Functions:** \n\tAWS Lambda\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:** \n\tDocker, Kubernetes, Terraform, Helm, CI/CD, Jenkins, GitLab CI, GitHub Actions, GitOps\n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Linux, Unix\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Prometheus, Grafana, ELK, Bash, Agile, Jira, communication skills, teamwork"
}