{
  "name": "Rei Taro",
  "role_name": "Senior QA Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior QA Engineer with over 10 years of experience in quality assurance and automation frameworks, proficient in **Playwright**, **Cypress**, **WebDriverIO**, and **TypeScript**. Skilled in testing **REST APIs** using tools like **Postman**, **Swagger**, and **curl**, ensuring high-quality deliverables in Agile and Scrum environments. Demonstrates strong expertise in CI/CD processes leveraging **GitHub Actions**, **GitLab CI**, and **Jenkins** for efficient deployment. Proven ability to design automated testing strategies in client-server architectures while focusing on continuous improvement. Additionally, brings a rich background in backend development for financial platforms with hands-on experience in **Python** (FastAPI, Django, Flask), and cloud services like **AWS** and **Azure**. Recognized for delivering impactful solutions in top organizations, leveraging extensive knowledge of QA methodologies and AI testing.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Designed and implemented automated testing frameworks using **Playwright**, **Cypress**, and **WebDriverIO**, enhancing the quality assurance process and ensuring comprehensive test coverage.\nDeveloped and executed test cases for **REST APIs** utilizing **Postman**, **Swagger**, and **curl**, guaranteeing accurate and efficient API functionality.\nCollaborated on CI/CD pipelines with tools like **GitHub Actions**, **GitLab CI**, and **Jenkins** to streamline automated testing and deployment processes, achieving a **30%** reduction in release cycle times.\nUtilized **TypeScript** and the **Page Object Model** to create reusable and maintainable test scripts, increasing test efficiency by **25%**.\nWorked closely with Agile teams, applying Scrum methodologies to integrate testing within development sprints and iterate rapidly based on stakeholder feedback.\nImplemented SQL and NoSQL database tests to validate data integrity and performance under various conditions, significantly enhancing database reliability.\nConducted QA in an environment focused on **client-server architecture** and **HTTP** protocols, ensuring robust applications capable of handling high volumes of transactions.\nExplored AI testing approaches to improve testing accuracy and efficiency, leveraging emerging technologies for innovative QA strategies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented QA strategies for backend systems using **Postman** and **Swagger** for REST APIs to enhance testing robustness and accuracy.\nAutomated testing processes leveraging **Cypress** and **Playwright** for efficient front-end testing across multiple browsers, achieving a **40% reduction** in manual testing time.\nDeveloped test automation frameworks integrating **WebDriverIO** and **TypeScript**, enhancing the maintainability of the testing suite.\nExecuted CI/CD pipelines using **GitHub Actions** and **GitLab CI**, implementing continuous integration that improved deployment frequency by **30%** and maintained software reliability.\nFostered the use of **Agile** and **Scrum** methodologies within teams to improve project visibility and delivery timelines, leading to an increase in team productivity by **25%**.\nConducted thorough QA audits and collaborated with cross-functional teams to ensure the successful validation of new features and compliance with industry standards, mitigating risks associated with production releases.\nUtilized **SQL** and **NoSQL** databases to validate data integrity and performance testing, ensuring seamless integration with client-server architecture."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented rigorous QA practices, ensuring high-quality standards through comprehensive testing frameworks with **Playwright** and **Cypress** for web applications.\nAutomated testing of REST APIs and UI components with **Postman** and **Swagger**, achieving a test coverage of over **90%**.\nDeveloped end-to-end testing strategies using **TypeScript** and the **Page Object Model**, leading to a reduction in regression testing time by **30%**.\nUtilized **WebDriverIO** for browser automation, improving the efficiency of testing cycles and facilitating client-server architecture validation.\nCollaborated with development teams in an **Agile** and **Scrum** environment to deliver robust, scalable solutions with continuous integration and deployment via **GitHub Actions** and **GitLab CI**.\nEngaged in performance testing and monitoring of applications, leveraging tools to ensure compliance with **HTTP** standards and optimal user experience.\nAssisted in integrating AI-driven testing methodologies, enhancing the accuracy of detection for potential issues in the application.\nMaintained and optimized database interactions by leveraging **SQL** and **NoSQL**, ensuring seamless data handling and retrieval during testing processes."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, TypeScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\tAngular\n\n **API Technologies**\n\tREST/gRPC APIs, REST APIs, Postman, Swagger, curl\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, NoSQL\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, GitLab CI, Jenkins\n\n **Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Other**\n\tMicroservices, Kafka, Agile, Scrum, client-server architecture, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, automation, QA, Playwright, Cypress, WebDriverIO, Page Object Model, AI testing",
  "apply_company": "DocuSketch"
}