{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Technical Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Technical Engineer, I leverage my 8 years of experience to drive excellence in **Mechanical Engineering** and **Pressure Vessel Design** projects. I possess strong **Project Management** skills, coupled with a track record of conducting **Production Audits** and performing **Root Cause Analysis** to improve operational efficiency. My effective **Analytical** and **Communication Skills** empower me to engage stakeholders and lead teams towards successful project outcomes. With a background in **Technical Sales**, I excel at negotiating and building strong client relationships across the **Chemical Industry**. Additionally, my experience in **AI/ML** implementation allows me to integrate advanced solutions into existing infrastructures, enhancing decision-making processes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Technical Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted thorough **root cause analysis** of engineering processes, leading to effective solutions and improvements in **pressure vessel design**.\nManaged and executed **production audits** to ensure compliance with industry regulations and standards, enhancing overall production efficiency.\nDemonstrated **strong analytical skills** to assess technical specifications and solve complex engineering problems, contributing to project success.\nCollaborated effectively with cross-functional teams, showcasing exceptional **communication skills** and **negotiation skills** to facilitate project objectives and stakeholder engagement.\nLed multiple engineering projects simultaneously, utilizing **project management** methodologies to deliver on-time results and exceed client expectations.\nProvided technical sales support, leveraging expertise in the **chemical industry** to design client-specific solutions that meet unique needs and requirements.\nDeveloped and documented engineering procedures and best practices, ensuring consistent application of standards across projects in mechanical engineering.\nIncorporated innovative design features into pressure vessels to enhance safety and performance, aligning with industry best practices and regulatory demands.\nMentored junior engineers, fostering a culture of continuous improvement and knowledge sharing within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Oversaw project management initiatives in the design and development of pressure vessels, ensuring adherence to industry standards and optimizing production processes.\nConducted thorough production audits to enhance operational efficiency and quality assurance, identifying areas for root cause analysis and implementing corrective actions into mechanical engineering practices.\nUtilized advanced analytical skills to support technical sales efforts, effectively communicating complex engineering concepts and solutions to clients in the chemical industry.\nLed negotiations with stakeholders and suppliers, optimizing procurement strategies to reduce costs up to **15%** while maintaining quality standards in mechanical designs.\nDeveloped and implemented mechanical design strategies for high-pressure systems, employing knowledge of pressure vessel design to innovate and improve safety measures in engineering projects.\nFacilitated regular communication with cross-functional teams to ensure alignment on project goals, timelines, and deliverables, enhancing collaboration and knowledge sharing.\nUtilized data-driven insights to continually assess and enhance product reliability and performance, leading to a **25%** reduction in reported mechanical failures over a **12-month** period."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized strong **Mechanical Engineering** principles to design and optimize high-efficiency engineered solutions for complex **Pressure Vessel Design** projects, ensuring compliance with industry standards and safety regulations.\nConducted **Production Audits** to assess operational efficiency and recommend improvements, leading to a **20% increase** in overall production productivity.\nImplemented effective **Root Cause Analysis** strategies to troubleshoot mechanical failures, successfully reducing downtime by **15%** through targeted corrective actions.\nEngaged in **Technical Sales** efforts, leveraging in-depth product knowledge to enhance customer relationships and generate a **30% increase** in sales within the chemical industry sector.\nManaged and led cross-functional teams in various **Project Management** initiatives, ensuring timely delivery of projects while adhering to budget constraints and quality standards.\nExhibited strong **Analytical Skills** to evaluate project data and performance metrics, employing detail-oriented approaches to optimize engineering processes.\nDemonstrated exceptional **Communication Skills** while presenting technical information to stakeholders, fostering collaboration among engineering, production, and sales teams.\nExercised **Negotiation Skills** effectively in vendor contracts to secure better pricing and terms, achieving substantial cost savings for the organization.\nLeveraged a comprehensive understanding of mechanical principles to drive innovations in engineering practices, contributing to continuous improvement within the technical division."
    }
  ],
  "skills": "**Other**\n\tMechanical Engineering, Pressure Vessel Design, Production Audits, Root Cause Analysis, Technical Sales, Chemical Industry, Project Management, Analytical Skills, Communication Skills, Negotiation Skills\n\n**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\t\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n",
  "apply_company": "EXSIF OFFSHORE"
}