{
  "name": "Rei Taro",
  "role_name": "Senior NET Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior .NET Engineer with over 10 years of experience in developing and optimizing backend systems, using **.NET**, **C#**, and **SQL Server** to deliver robust financial solutions. Proficient in employing **.NET Core** and **WCF** for creating high-performance APIs and scalable services, complemented by expertise in ETL processes and development tools like **Visual Studio**. Strong skills in ensuring code quality through **Sonar** and improving application performance. Excellent command of English for seamless communication within cross-functional teams. A proven track record of significant contributions to influential projects in leading organizations, leveraging technical capabilities to drive innovation.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior NET Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "- Developed robust backend services using **.NET Core** and **C#** to enhance document automation and user onboarding processes.\n- Managed relational data effectively through **SQL Server**, ensuring optimal database performance and data integrity in financial transaction request systems.\n- Designed and implemented ETL processes to optimize data flows, integrating with **WCF** for seamless communication between systems.\n- Participated in security assessments and integrated OAuth2 frameworks into existing services for secure authentication.\n- Utilized **Visual Studio** for streamlined development workflows and efficient debugging of applications.\n- Collaborated with cross-functional teams to tackle system integration challenges and execute comprehensive release strategies.\n- Applied metrics and analytics through tools like **Sonar** to monitor code quality and drive improvements in applications.\n- Communicated proficiently in English to ensure clear collaboration and understanding among diverse teams."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed enterprise-level applications using **.NET**, **C#**, and **.NET Core** to enhance system functionality and improve user experience, leading to a 30% increase in user satisfaction.\n• Optimized database performance by designing and implementing efficient **SQL Server** queries and ETL processes, resulting in a 25% reduction in query execution time.\n• Employed **Visual Studio** for comprehensive debugging and project management, improving code quality as evidenced by a 15% decrease in post-deployment defects.\n• Integrated modern web technologies, including **JQuery**, to enhance front-end responsiveness and usability, contributing to a 20% increase in customer engagement.\n• Conducted regular code reviews using **Sonar** to ensure adherence to best practices and coding standards, achieving an impressive 98% compliance rate across projects.\n• Ensured effective team communication and English proficiency during project delivery to facilitate collaboration with international teams.\n• Championed the transition of legacy systems to modern frameworks, leveraging **WCF** for secure service communication, boosting system reliability by 40%."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Designed, developed, and maintained robust backend services for trade execution and portfolio management utilizing **.NET Core**, **C#**, and **SQL Server**, significantly enhancing operational efficiency by 30%.\n• Streamlined data integration processes with ETL techniques, ensuring data consistency and accuracy across various system components.\n• Collaborated with cross-functional teams to create and optimize RESTful APIs, enhancing system interoperability and user experience in a multistage environment, reducing response time by 40%.\n• Implemented quality assurance practices using **Sonar** for code quality checks while fostering adherence to industry standards to mitigate risks and ensure compliance.\n• Developed user interfaces employing **JQuery**, enhancing usability and accessibility across platforms, leading to a 25% increase in user engagement.\n• Delivered comprehensive system documentation in English to ensure clarity and knowledge transfer across teams, promoting efficient onboarding of new team members.\n• Engaged in regular code reviews and pair programming sessions within **Visual Studio**, contributing to improved code standards and team collaboration."
    }
  ],
  "skills": "**Programming Languages**\n\tC#, .NET, SQL, Python (3.8+), JavaScript, Bash\n\n**Backend Frameworks**\n\t.NET Core, WCF, FastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tJQuery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tSQL Server, PostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Sonar, PyTest, Git\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tPandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, English",
  "apply_company": "KAIROS DIGITAL SOLUTIONS"
}