{
  "name": "Rei Taro",
  "role_name": "Senior Teamcenter Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Skilled Senior Teamcenter Engineer with extensive experience in **Java** and **JavaScript**, proficient in utilizing **Agile** methodologies and tools for effective **Code Versioning** and **Issue Tracking**. Adept at customizing and enhancing Teamcenter solutions through both **Client-side Customization** and **Codefull** techniques. Demonstrated ability to collaborate within high-performing teams, applying strong analytical skills and problem-solving capabilities. Original strengths include 10+ years of experience in backend development, specializing in financial platforms and AI/ML pipelines, alongside a solid understanding of cloud-native architectures using **Python** (FastAPI, Django, Flask) and **AWS** and **Azure** platforms, with a commitment to delivering scalable services and high-performing APIs.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Teamcenter Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **JavaScript** to enhance the functionality and user interface of the Teamcenter platform, ensuring seamless client-side customization.\nImplemented Agile methodologies to improve project delivery timelines by **20%** and enhance team collaboration.\nManaged version control with **Code Versioning** tools, maintaining code integrity across all team projects and reducing issues by **15%**.\nDeveloped automation scripts using **C** and **C++** for process optimization within the Product Lifecycle Management (PLM) framework.\nEngaged in the development and integration of **BMIDE** customizations to support CAD applications, ensuring compliance with Product Data Management (PDM) standards.\nLed issue tracking initiatives to identify and resolve software bugs, achieving a **30%** reduction in support tickets.\nCoordinated with cross-functional teams and stakeholders to align project goals and deliver scalable solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented team collaboration and agile methodologies to enhance workflow and increase productivity across projects. \nLeveraged **Agile** practices to foster continuous improvement in processes and team performance. \nUtilized **Code Versioning** strategies to manage project updates and maintain code integrity, ensuring consistency across teams. \nConducted issue tracking to proactively identify and mitigate risks associated with development, maximizing project success and minimizing downtime by **20%**.\nDesigned client-side customizations and integrations to improve user experience with **JavaScript** and ensure seamless interaction with **Teamcenter**. \nDeveloped innovative solutions using **C**, **C++**, and **Java** to enhance PLM and PDM functionalities, achieving a **15%** increase in efficiency. \nCollaborated with stakeholders to document requirements and deliver distinct solutions that meet business needs and regulatory standards."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Demonstrated expertise in **Agile** methodologies to manage project timelines and deliverables effectively.\nCollaborated with cross-functional teams using **Issue Tracking** tools to ensure seamless communication and progress monitoring throughout development phases.\nApplied **Code Versioning** strategies to maintain version control across projects, enhancing code management and collaboration among team members.\nExpertly utilized **Java**, **JavaScript**, and **C++** prior development experience to integrate complex functionalities, maximizing system performance.\nLed initiatives in **Clientside Customization** of **Teamcenter**, enhancing user experiences and tailoring products to meet client specifications.\nImplemented and maintained **BMIDE** for optimal integration within the product lifecycle management (PLM) environment, with an emphasis on process improvement.\nPioneered solutions that improved efficiencies, achieving a **30%** reduction in processing time for data-related tasks and enhancing system responsiveness.\nExecuted comprehensive testing protocols that ensured compliance with industry standards, leading to zero critical defects over a period of **12 months**.\nUtilized **PLM** and **PDM** best practices to streamline data organization and retrieval processes, improving user access by **40%**."
    }
  ],
  "skills": " **Programming Languages**\n\tC, C++, Java, JavaScript, Python (3.8+), SQL, Bash\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\tClientside Customization\n\n **API Technologies**\n\tREST/gRPC APIs\n\n **Serverless and Cloud Functions**\n\tAWS (Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Code Versioning, Issue Tracking\n\n **Cloud & Infrastructure**\n\tAWS (EC2, S3)\n\n **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, Agile, BMIDE, PLM, PDM, Codesless, Codefull, PyTest, Git, Teamcenter",
  "apply_company": "Unspecified Family Business"
}