{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Firewall Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a Senior Firewall Engineer with 8+ years of experience in network security and configuration, I excel in managing **Check Point firewalls**, **Cisco ASA**, and **Palo Alto** solutions, ensuring robust and secure network platforms. My technical expertise includes proficient use of **Python** for automation, along with comprehensive knowledge of **Linux** systems and **multi-vendor firewall technologies**. I am skilled in **DevOps tools** such as **Ansible**, **Docker**, and **VMWare**, contributing to efficient CI/CD pipelines for production-grade deployments. Additionally, I bring experience in enterprise network security strategies, understanding **SASE/SSE solutions**, and enhancing operational capabilities through troubleshooting and configuration management. I thrive in customer-facing roles, leveraging strong teamwork and a willingness to learn to address complex challenges in e-commerce, financial, and healthcare sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Firewall Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Ensure enterprise network security by leveraging expertise in **Python** to automate firewall configuration and troubleshooting tasks across multiple platforms.\nImplement and manage secure network architectures utilizing **Cisco ASA**, **Firepower**, **Palo Alto**, and **Fortinet** solutions to protect sensitive data in production grade deployments.\nEnhance security measures through **Check Point firewalls**, applying multi-vendor firewall knowledge to optimize configurations and ensure compliance with security best practices.\nUtilize **Docker** and **CI/CD pipelines** to streamline the deployment of security measures and maintain operational efficiency, reducing deployment times by **30%**.\nDevelop automated scripts for **Ansible** that enable rapid configuration and monitoring of firewalls to strengthen network security and improve incident response times by **25%**.\nLead efforts for network security management, conducting thorough audits and vulnerability assessments across heterogeneous environments involving **Linux** systems.\nProvide expert guidance on **SASE/SSE solutions**, ensuring the organization effectively adopts these frameworks to enhance security and performance.\nFacilitate customer-facing roles to communicate complex security concepts clearly, fostering strong partnerships with clients while showcasing **teamwork** in cross-functional projects.\nMaintain high standards of **flexibility** to adapt to evolving security needs and technologies while ensuring compliance with regulations like SOC 2 and ISO 27001.\nContribute to production-grade deployments of network security measures, leveraging **VMWare** for virtualized environments, leading to improved scalability and resource utilization.\nChampioned DevOps tools and methodologies to enhance the security integration process within the development lifecycle, resulting in more resilient application delivery.\nAchieve and maintain **firewall vendor certifications** to ensure up-to-date knowledge and skills, supporting ongoing professional development and **willingness to learn** new technologies."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Utilized **Python** to develop and maintain secure applications within **network security** frameworks, ensuring data protection against unauthorized access and threats.\n• Executed configuration and troubleshooting of **Check Point firewalls**, **Cisco ASA**, and **Palo Alto** systems in a multi-vendor environment, achieving an uptime of **99.9%**.\n• Managed enterprise network security implementations, integrating **Fortinet** solutions to enhance threat detection and response times by **30%**.\n• Leveraged **Ansible** for automation and orchestration of **production grade deployments**, reducing manual interventions by **50%**.\n• Developed and maintained CI/CD pipelines using tools such as **Docker**, **Azure DevOps**, and **GitHub Actions**, ensuring smooth transitions from development to production.\n• Collaborated with cross-functional teams in customer-facing roles, understanding their requirements and demonstrating the capabilities of different firewall solutions, leading to a **20%** increase in customer satisfaction.\n• Applied best practices for configurations on **Linux** platforms in conjunction with firewall technologies to ensure robust network security and compliance with standards.\n• Implemented **SASE/SSE solutions** to modernize security and accelerate service delivery across the organization.\n• Employed **VMWare** technologies to create secure, isolated environments for development and testing\n• Acquired firewall vendor certification to validate skills and knowledge in market-leading firewall products and configurations.\n• Demonstrated adaptability and willingness to learn new technologies in networking and security to stay current with industry trends, enhancing team capabilities and productivity.\n• Successfully led teams through troubleshooting various **network platforms**, ensuring timely resolution of security incidents and maintaining robust network integrity."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented and configured **Check Point firewalls**, enhancing **network security** and ensuring compliance with enterprise standards in a multi-vendor environment.\nUtilized **Python** for automating network security tasks, improving efficiency and support for **production grade deployments** across various platforms.\nConfigured and troubleshot diverse **network platforms**, ensuring alignment with best practices and enterprise requirements.\nStreamlined operations using **DevOps tools** and **CI/CD pipelines** (including **Docker**, **Ansible**) to automate deployments and reduce lead times by **30%**.\nWorked with **Cisco ASA**, **Firepower**, **Palo Alto**, and **Fortinet** solutions, ensuring a comprehensive approach to **enterprise network security**.\nDesigned and implemented robust **SASE/SSE solutions**, enhancing security posture for remote users and cloud services.\nEngaged in **teamwork** to foster a collaborative environment, simplifying solution delivery in customer-facing roles.\nConducted regular performance audits and configurations to ensure optimal functionality of **firewall** systems and network equipment, achieving a **99% uptime** record.\nLed training sessions on **multi-vendor firewall knowledge** and configuration best practices for team members, boosting overall network security competence.\nParticipated in ongoing learning and professional development to keep abreast of evolving security threats and solutions, demonstrating a **willingness to learn** new technologies.\nSuccessfully navigated flexible hours to provide timely support and troubleshooting during critical network outages or upgrades.\nCollaborated with cross-functional teams to identify and resolve complex network issues, enhancing customer satisfaction and trust in security systems."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQLAlchemy\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Ansible, CI/CD pipelines\n\n **Cloud & Infrastructure:**\n\tVMware\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Check Point firewalls, network security, network platforms, configuration and troubleshooting, Linux, multi-vendor firewall knowledge, Cisco ASA and Firepower, Palo Alto, Fortinet, SASE/SSE solutions, enterprise network security, customer-facing roles, production grade deployments, firewall vendor certification, willingness to learn, teamwork, flexible hours",
  "apply_company": "CodiLime"
}