{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dynamic Senior Engineer, I bring 8 years of comprehensive experience emphasizing high-performance solutions in engineering domains. My core competencies include proficiency in **AutoCAD** for 3D modeling and detailed simulations, alongside expertise in **load calculation**, **rigging**, and **lifting plans**. I have successfully managed projects that require precise **FEA** and developed intricate **load charts** to ensure compliance with safety standards. \nBeyond my technical acumen, I excel in project leadership and team collaboration, ensuring seamless execution of engineering tasks. I possess a solid foundation in **MS Office** for effective documentation and reporting. My analytical skills enable me to develop innovative solutions that enhance operational efficiency while adhering to industry regulations.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Utilized **AutoCAD** to create detailed designs and schematics for civil and mechanical engineering projects, enhancing project accuracy and efficiency.\n- Conducted **3D modeling** and simulations to visualize project outcomes and ensure structural integrity and compliance with engineering standards.\n- Applied **Finite Element Analysis (FEA)** to assess stress and strain on structures, improving safety and performance in line with load calculations.\n- Developed and managed **lifting plans**, including **load calculation** and **load charts**, to ensure safe lifting operations using cranes and other rigging equipment.\n- Collaborated on-site with construction teams to oversee the implementation of projects, ensuring adherence to engineering specifications and safety regulations.\n- Prepared comprehensive reports and presentations using **MS Office**, effectively communicating project progress, challenges, and solutions to stakeholders.\n- Designed and integrated rigging systems tailored to specific project requirements, resulting in improved operational efficiency and reduced project downtime.\n- Led training sessions for junior engineers on **AutoCAD**, load calculation techniques, and safety protocols in rigging and crane operations.\n- Enhanced project workflows through continuous improvement initiatives, leading to a **15%** reduction in project completion times.\n- Conducted site inspections and audits to evaluate operational compliance, directly contributing to quality assurance and risk management strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted detailed **load calculations** and created **lifting plans** to ensure compliance with safety standards and operational efficiency while managing crane operations.\nUtilized **AutoCAD** for producing accurate **3D models** and intricate designs of mechanical components, enhancing project clarity and collaboration with cross-functional teams.\nPerformed Finite Element Analysis (**FEA**) to assess structural integrity and optimize designs, resulting in a **15%** increase in load capacity across various projects.\nDeveloped and maintained project documentation using **MS Office**, ensuring seamless communication and reporting for stakeholders throughout the engineering lifecycle.\nLed rigging operations, overseeing the safe setup and execution of complex lifts, which improved overall project timelines by **20%** through efficient resource allocation.\nProvided expert guidance on mechanical engineering principles, leveraging **mechanical** knowledge to troubleshoot and resolve design and operational issues effectively.\nImplemented advanced **3D modeling** techniques to improve design accuracy, reducing errors in fabrication and contributing to a **30%** decrease in project rework.\nCollaborated with cross-functional teams to align engineering designs with production capabilities, utilizing **load charts** to ensure safe and effective material handling practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **AutoCAD** for creating detailed **3D modeling** and construction documentation, enhancing design accuracy and client collaboration on **9** major projects.\nPerformed rigorous **load calculation** and developed comprehensive **lifting plans**, ensuring safe and efficient operation of cranes and rigging equipment for **10+** construction sites.\nCreated and maintained accurate **load charts** to facilitate seamless communication and workflow among project stakeholders, achieving an operational efficiency improvement of **25%**.\nConducted **Finite Element Analysis (FEA)** to assess structural integrity of designs, ensuring compliance with industry standards and regulations on all **mechanical** components.\nDeveloped and executed design improvements in **mechanical** systems, leading to a **15%** reduction in material costs while maintaining performance and safety.\nCollaborated with cross-functional teams to solve complex engineering problems, enhancing project delivery timelines by **20%** through effective use of **MS Office** tools for documentation and presentations.\nParticipated in the design review process, providing insights and recommendations based on industry best practices to enhance project outcomes and client satisfaction.\nEnsured adherence to health and safety standards during the engineering processes, effectively reducing incident rates and promoting a culture of safety across all operations."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n  **API Technologies:**\n\t\n\n  **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n  **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n  **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n  **Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Civil, Mechanical, AutoCAD, 3D modeling, FEA, MS Office, rigging, crane, load calculation, load charts, lifting plans",
  "apply_company": "Omega Morgan, Inc."
}