{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of expertise in developing high-performance applications, particularly in network systems software and virtualization. Proficient in **C/C++**, **Linux**, and **Python**, with a solid foundation in **Golang** for software development. Demonstrated experience with **Microservices**, **CI/CD**, and **Containers**, implementing robust solutions utilizing **Terraform** for infrastructure as code.\nSkilled in cloud deployment strategies on **AWS**, **Azure**, and **GCP**, fostering scalable solutions in diverse environments. Adept at debugging software to ensure reliability and compliance within various standards. Strong contributor to **network functions virtualization (NFV)** and leveraging advanced technologies to enhance performance. Additionally, experienced in frontend and backend development utilizing **JavaScript/TypeScript**, **React**, **Node.js**, and **Django**, complemented by a proven track record in AI/ML platforms and predictive analytics.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained software solutions utilizing **C/C++** and **Golang** for efficient performance and high scalability in network systems software.\n- Leveraged **Python** to implement strong back-end functionalities, contributing to microservices architectures and ensuring seamless integration with cloud services such as **AWS** and **Azure**.\n- Designed and built robust CI/CD pipelines using **Terraform** and other modern tools, ensuring efficient software deployment and automated testing processes across multiple environments.\n- Enhanced system performance on **Linux** platforms with in-depth debugging and optimization of applications, ensuring compliance with industry standards.\n- Implemented containerization strategies leveraging **Docker** to support microservices in a dynamic and scalable environment.\n- Contributed to NFV (Network Functions Virtualization) solutions to enhance system flexibility and support diverse workloads effectively.\n- Utilized **DPDK** for high-speed packet processing applications, optimizing network throughput in critical systems.\n- Championed the transformation of legacy applications into microservices, focusing on reducing deployment times from **weeks to days**.\n- Ensured high availability and fault tolerance in deployments through effective use of **CI/CD** methodologies, decreasing release cycle times by up to **30%**.\n- Collaborated on projects utilizing **AWS**, **Azure**, and **GCP** to build and maintain distributed systems with a focus on reliability and performance efficiency.\n- Notable involvement in the design and implementation of software debugging processes that resulted in a **25% reduction** in bug reports post-release.\n- Engaged with cross-functional teams to align network system software requirements with business strategies, fostering a culture of continuous improvement and innovation."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python**, **Golang**, and **C/C++** to modernize core financial platforms by migrating to a microservices architecture, successfully enhancing scalability and performance for high-volume transactional systems by **30%**.\nImplemented containerization using **Docker** and orchestration with **Kubernetes** to streamline application deployment and management, achieving a deployment frequency increase of **40%**.\nDesigned and deployed CI/CD pipelines using **Terraform** and **AWS** services, reducing deployment times from **5 hours** to under **1 hour**.\nDeveloped and maintained network systems software on **Linux** and **DPDK**, optimizing data packet processing efficiency, leading to a throughput increase of **25%**.\nBuilt interactive front-end applications with **React (18)**, **Vue 3**, and **Next.js**, utilizing **TypeScript** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels.\nDelivered real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies.\nDesigned and implemented a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing.\nBuilt and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed robust backend components for high-performance applications, utilizing **Python** and integrating with **AWS**, **Azure**, and **GCP** cloud services to ensure scalability and reliability in complex environments.\nEngineered microservices architectures employing **C/C++** and **Golang**, effectively handling up to **500K** concurrent connections while maintaining system efficiency.\nImplemented CI/CD pipelines using **Terraform** and containerization technologies, facilitating seamless deployment and scaling of applications across distributed systems with **minimum downtime**.\nDesigned and maintained network systems software to enhance performance, reducing latency by **30%** across service endpoints, achieving exceptional throughput for data processing.\nLeveraged **Linux** and virtualization techniques to optimize resource allocation and achieve a **99.9%** uptime rate for critical applications.\nPerformed software debugging on multi-threaded applications to elevate reliability and maintainability by reducing defects by approximately **40%**.\nCollaborated in an Agile environment, providing input for cross-functional teams, and ensuring optimal integration of software components with existing network systems.\nDeveloped and optimized data structures and algorithms for efficient data management across high-demand services, improving data retrieval times by **25%**.\nApplied the principles of NFV to enhance the flexibility of software deployment, significantly reducing the onboarding time for new services.\nFostered a culture of knowledge sharing, conducting code reviews and mentoring less experienced team members to maintain high standards of software quality."
    }
  ],
  "skills": "Programming Languages:\n\tC/C++\n\tPython\n\tGolang\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React\n\tJavaScript/TypeScript: Vue\n\tJavaScript/TypeScript: Angular\n\n**API Technologies:**\n\tOAuth2\n\tJWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS\n\tAWS: RDS\n\tAWS: S3\n\tAzure: Blob Storage\n\tAzure: SQL Database\n\tGCP\n\n**Other:**\n\tMLflow\n\tAirflow\n\tKubeflow\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tKeycloak (OIDC, RBAC)\n\tNetwork Systems Software\n\tSoftware Debugging\n\tContainers\n\tVirtualization\n\tDPDK\n\tNFV\n\tMicroservices\n\tCI/CD",
  "apply_company": "Arista Networks"
}