{
  "name": "Tomasz Lee",
  "role_name": "Dynamics 365 Business Central Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Dynamic and results-driven Dynamics 365 Business Central Developer with 9+ years of experience, proficient in **Dynamics 365 Business Central**, **OnPrem Azure Cloud**, **AL reporting**, and **OAuth** integration. Solid understanding of multitenant architecture, allowing for scalable application deployment. Extensive expertise in **.NET** and a proven track record of implementing **AI capabilities** to enhance business processes. Additionally skilled in modern frontend and backend technologies, including **ReactJS**, **NextJS**, and **C#**, with a strong focus on delivering robust solutions, optimizing performance, and streamlining development workflows. Known for effective collaboration across multidisciplinary teams and leading projects to successful outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Dynamics 365 Business Central Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Dynamics 365 Business Central** to design and develop business solutions that enhance user engagement and operational efficiency.\nEngineered a multitenant architecture with **.NET** technologies to support scalable applications, ensuring seamless operation for multiple clients.\nDeveloped and optimized AL reporting tools to facilitate real-time data analysis and reporting, enhancing data-driven decision-making.\nIntegrated **Azure Cloud** services for deployment and application management, ensuring high availability and performance.\nImplemented **OAuth** for secure API authentication across applications, enhancing overall security measures.\nCollaborated with cross-functional teams to infuse **AI capabilities** into applications, delivering innovative features that meet client needs.\nLeveraged **Office Graph API** for enhanced data connectivity and insights across Microsoft applications, driving workflow improvements.\nMaintained detailed documentation of architectural designs and best practices, contributing to knowledge sharing within the team.\nExecuted regular performance assessments and upgrades to the application infrastructure, resulting in a 30% increase in application efficiency.\nFostered strong communication with stakeholders to align project goals and deliverables, resulting in a 15% increase in project delivery satisfaction."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed solutions for **Dynamics 365 Business Central**, leveraging **.NET** for seamless integration and enhanced functionalities.\nDesigned and implemented a multitenant architecture to support multiple clients efficiently, improving system flexibility.\nIntegrated **OnPrem Azure Cloud** services to optimize application performance and ensure robust data management.\nUtilized **AL reporting** capabilities for generating comprehensive reports, resulting in **30%** faster reporting times for stakeholders.\nImplemented **OAuth** for secure user authentication, enhancing data protection within applications.\nEnhanced user experience by collaborating with stakeholders to incorporate **Office Graph API** for improved documentation handling and task insights.\nLed the development of automated solutions that increased operational efficiency by **20%**, employing AI capabilities where applicable.\nConducted regular system performance assessments, leading to a **15%** reduction in response times through optimization techniques.\nMentored team members in Dynamics 365 best practices, fostering a culture of continuous improvement and technical expertise.\nMaintained documentation and provided training sessions on newly developed features, achieving **95%** satisfaction in user feedback."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Dynamics 365 Business Central** to enhance business processes, increasing operational efficiency by **30%**.\nImplemented **OAuth** for secure authentication, ensuring compliance with security standards across applications.\nDeveloped and optimized **AL reporting** for data extraction and analysis, improving reporting accuracy by **25%**.\nMigrated existing applications to **OnPrem Azure Cloud**, resulting in **40%** reduction in infrastructure costs.\nLeveraged **Office Graph API** to integrate and streamline data services across various business systems, enhancing data accessibility.\nDesigned and implemented multitenant architecture for scalability, allowing simultaneous access for up to **100** users without performance degradation.\nCollaborated with cross-functional teams to incorporate **AI capabilities** into applications, improving customer insights and decision-making processes.\nContributed to developing reusable components with **.NET**, accelerating future project timelines by **15%**.\nManaged backend services using SQL Server, optimizing queries for better performance and reducing response times by **20%**.\nEngaged in daily standups and code reviews, fostering a culture of collaboration and continuous improvement."
    }
  ],
  "skills": "**Programming Languages**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, C#, .NET, Python, Solidity, Ether.js, Web3.js, Ethereum\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL, Office Graph API, OAuth\n\n**Serverless and Cloud Functions**\n\tDynamoDB, CosmosDB, OnPrem Azure Cloud, multitenant architecture, AI capabilities\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tDynamics 365 Business Central\n\n**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis"
}