{
  "name": "Tomasz Lee",
  "role_name": "Senior Water Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Senior Water Engineer with a strong background in hydrological and hydraulic modelling, utilizing advanced tools such as **HEC-RAS**, **TUFLOW**, **MIKE SHE**, and **InfoWorks ICM**. Proficient in flood risk management and drainage design, including Sustainable Drainage Systems (**SuDS**) and water resource management strategies. Demonstrated expertise in **GIS**, data analysis, and technical reporting, complemented by a proactive approach to sustainable water management. Excellent collaboration and communication skills, enabling effective teamwork and project leadership. Additionally, I bring 9+ years of experience as a .NET Full Stack Developer, proficient in both frontend and backend technologies including **ReactJS**, **NextJS**, **.NET**, **C#**, alongside significant exposure to microservices architecture and distributed systems, utilizing technologies such as **Apache Kafka**, **RabbitMQ**, and **Redis**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Water Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted hydrological and hydraulic modelling using **HEC-RAS**, **TUFLOW**, and **MIKE SHE**, ensuring compliance with flood risk management protocols.\nDesigned drainage solutions employing **SuDS** principles to enhance sustainable water management practices in urban development, contributing to a **30%** reduction in surface runoff.\nUtilized **InfoWorks ICM** and **Civil 3D** for efficient drainage design and analysis, achieving improved drainage capacity by **20%**.\nPerformed data analysis and GIS mapping for assessing flood risks, leading to precise technical reporting and actionable insights for stakeholders.\nCollaborated with multidisciplinary teams to communicate project findings effectively, ensuring stakeholder needs are met through proactive engagement.\nImplemented remote sensing techniques to gather data for water resource management projects, enhancing decision-making processes.\nProduced technical reports that summarize complex modelling results in an understandable format for non-technical stakeholders.\nChampioned best practices in project management, contributing to on-time project delivery within budget constraints, with a success rate of **95%** on project deadlines.\nPromoted collaboration among engineers and local authorities to develop innovative solutions for water management challenges.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and implemented **HEC-RAS** and **TUFLOW** models for accurate flood risk management, enhancing predictive capabilities by 30%.\n• Executed drainage design strategies utilizing **MicroDrainage** and **Civil 3D**, leading to a 20% reduction in surface water flooding incidents.\n• Conducted hydrological and hydraulic modelling with **MIKE SHE** and **InfoWorks ICM**, improving water resource management and system efficiency by 25%.\n• Analyzed complex datasets through advanced **data analysis** techniques, resulting in actionable insights for sustainable water management.\n• Leveraged **GIS** and remote sensing tools to enhance site assessments and data visualization, improving project reporting accuracy by 40%.\n• Prepared and delivered comprehensive technical reports, ensuring clarity in communication with stakeholders and alignment with project objectives.\n• Demonstrated strong collaboration skills while working with cross-functional teams, contributing to a 15% improvement in project completion timelines.\n• Proactively identified opportunities for sustainable practices in water management, advocating for innovative solutions within project frameworks.\n• Mentored junior engineers and facilitated workshops on best practices in drainage design and flood risk assessment, boosting team knowledge retention by 30%.\n• Engaged with local communities to gather feedback and improve project outcomes, fostering effective communication channels for ongoing collaboration."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Demonstrated expertise in **GIS** and **hydrological modelling** by analyzing and designing flood risk management strategies, resulting in a **15%** reduction in flood-related incidents.\nExecuted comprehensive drainage design projects utilizing **MicroDrainage** and **Civil 3D**, ensuring compliance with environmental regulations and enhancing urban water management.\nApplied **HEC-RAS** and **TUFLOW** software for hydraulic modelling, accurately predicting flood scenarios for improved disaster preparedness.\nDeveloped sustainable urban drainage systems (**SuDS**) that improved water quality and biodiversity, contributing to **25%** better water management outcomes.\nConducted data analysis and technical reporting on water resource management initiatives, presenting findings to stakeholders to facilitate decision-making.\nCollaborated effectively with multidisciplinary teams, enhancing communication and project alignment, while driving proactivity in project execution.\nUtilized **MIKE SHE** for integrated catchment modelling to simulate and optimize water resources in complex environments.\nEngaged in continuous professional development focused on innovative techniques in **remote sensing** to gather critical geographic information.\nFostered collaboration within teams through regular project reviews and strategic planning sessions, enhancing overall project outcomes.\nOutlined best practices for **sustainable water management** in technical documentation, contributing to enhanced organizational knowledge and practices."
    }
  ],
  "skills": " \n**Programming Languages**\n\tJavaScript, TypeScript, Python, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tData analysis, GIS, remote sensing\n\n**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, flood risk management, drainage design, SuDS, HEC-RAS, TUFLOW, MIKE SHE, InfoWorks ICM, Civil 3D, MicroDrainage, hydrological modelling, hydraulic modelling, water resource management, technical reporting, communication, collaboration, proactivity, sustainable water management",
  "apply_company": "Baker Street Recruitment"
}