{
  "name": "Patryk Zaslawski",
  "role_name": "Senior QA Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior QA Engineer with 8+ years in software engineering, I excel in Functional Testing and Agile methodologies, particularly in **JAVA** environments. My proficiency in **Postman**, **Cucumber**, and **RestAssured** enables me to design and execute robust test strategies, ensuring high-quality software delivery. I have extensive experience with CI/CD pipelines and DevOps practices, driving efficiency and reliability in the development process. Additionally, I leverage tools like **Jmeter** for performance testing and **Xray** for management of testing cycles. My background includes mentoring and coaching teams to foster a culture of quality and adherence to best practices. My combined strengths in technical leadership and software engineering with **PostgreSQL**, **MySQL**, and cloud platforms such as **AWS** enhance my ability to provide comprehensive QA solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Led the implementation of **Cucumber** and **RestAssured** for automated functional testing, ensuring high-quality deliverables in agile sprints with a focus on **Agile** and **Scrum** methodologies.\n- Utilized **JMeter** to conduct performance testing of applications, analyzing results for optimal system reliability and scalability.\n- Mentored and coached junior QA engineers, fostering a culture of continuous improvement, technical excellence, and knowledge sharing within the team.\n- Developed and maintained comprehensive test strategies and plans using **Postman** for API testing, enhancing the quality of the software through effective integration testing.\n- Ensured seamless collaboration with development teams on CI/CD pipelines, implementing **DevOps** practices for automated builds, security scanning, and deployment processes to enhance efficiency.\n- Managed testing documentation and reporting using **Xray**, ensuring all test results were meticulously tracked and communicated.\n- Implemented rigorous functional testing across various applications, emphasizing the usage of **JAVA** for scripting test scenarios and enhancing test coverage.\n- Engaged in technical leadership by driving best practices in test automation across teams, resulting in a **20%** increase in delivery speed and quality.\n- Collaborated in sprint reviews and retrospectives to iterate on testing processes, aligning QA strategy with overall project objectives, significantly improving team dynamics and product outcomes.\n- Spearheaded knowledge transfer sessions, enhancing team capabilities in testing frameworks and tools while advocating for adoption of new technologies and frameworks."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Postman** to create and execute automated functional tests, ensuring the quality and reliability of software applications in an Agile environment.\nLed the implementation of CI/CD pipelines using tools like **Jenkins** and **Azure DevOps**, improving deployment efficiency and reducing release time by **30%**.\nCoached team members on effective testing practices, including the utilization of **Cucumber** for behavior-driven development and enhancing overall test coverage by **25%**.\nConducted performance testing using **JMeter**, assessing application responsiveness under varied loads and identifying bottlenecks for optimization.\nManaged test case documentation and execution in **Xray**, collaborating closely with development teams to ensure comprehensive test scenario coverage.\nParticipated in Scrum ceremonies, promoting Agile principles and driving continuous improvement within the QA team.\nDemonstrated technical leadership by defining best practices and establishing testing frameworks for consistent quality in both manual and automated testing processes.\nApplied DevOps methodologies to streamline cross-functional collaboration, effectively reducing feedback loops between development and QA departments.\nFacilitated functional testing for application features across **MS SQL Management Studio**, ensuring data integrity and compliance with business requirements.\nMaintained a robust knowledge of QA methodologies, contributing to the design of effective test strategies and approaches tailored to specific project demands."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Executed functional testing strategies using **Cucumber** and **RestAssured** to ensure the quality and performance of software applications aligned with Agile methodologies.\nDesigned and maintained automated test cases in **JAVA** for robust backend services, enabling comprehensive testing of critical features before deployment.\nLed effective testing discussions and managed test case documentation in **Xray**, facilitating enhanced collaboration within the team and adherence to quality standards.\nUtilized **Postman** for API testing, validating response behaviors and improving reliability across RESTful services.\nIntegrated performance testing into the CI/CD pipeline using **JMeter**, identifying bottlenecks and optimizing applications for peak usage scenarios, contributing to a **40%** improvement in processing speed.\nImplemented Agile and Scrum practices within team workflows, promoting transparency and iterative development for continuous improvement.\nProvided technical leadership by coaching team members on QA best practices and advanced testing frameworks, fostering skills enhancement across the QA team.\nConducted hands-on training sessions on **MS SQL Management Studio** for database management and querying during testing phases, enhancing team proficiency.\nCollaborated with DevOps teams to integrate automated testing within the deployment pipeline, ensuring rapid and reliable software releases resulting in a **30%** reduction in deployment issues.\nPioneered load testing initiatives, simulating user traffic with **JMeter** and **k6**, validating system stability under a controlled load, achieving performance benchmarks set for critical applications.\nEnsured all testing efforts aligned with project timelines and quality standards, verifying that deliverables met customer expectations and business requirements."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JAVA\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, Postman\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, MS SQL Management Studio\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tNginx, Certbot\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Agile, Scrum, Cucumber, RestAssured, Xray, Jmeter, Functional Testing, Technical Leadership, Coaching",
  "apply_company": "RED Global"
}