{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Web Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Web Engineer with 13+ years of experience in delivering high-performance applications, specializing in **JavaScript**, **TypeScript**, **React**, **HTML5**, and **CSS3**. Proficient in modern web development frameworks and tools such as **Node.js**, **Gulp**, **Webpack**, and experienced in Behavior-Driven Development with **Playwright**. Extensive knowledge of frontend technologies and a strong foundation in backend development. Proven track record in building AI/ML-powered platforms that leverage automation and real-time processing, with expertise in deploying cloud-native systems on **AWS** and **Azure**. Adept at implementing microservices, event-driven architectures, and CI/CD pipelines while ensuring compliance with standards like HIPAA, FHIR, PCI DSS, and SOC 2. Strong background in MLOps, encompassing model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable web applications leveraging **JavaScript** (**ECMAScript 6**), **TypeScript**, and **Node.js**, ensuring compatibility with various modern frameworks like **React** (17–18) and **HTML5** technologies.\n• Implemented responsive designs using **CSS3**, **SASS**, and **LESS** to enhance user experience and accessibility across devices.\n• Integrated version control and collaborative development practices using **Git** to maintain code quality and facilitate seamless team collaboration.\n• Employed **Gulp** and **Webpack** for efficient asset management and task automation, optimizing build processes and reducing load times by **40%**.\n• Engaged in Behavior-Driven Development (BDD), writing test cases and scenarios to ensure application functionality meets business requirements and user expectations.\n• Collaborated in cross-functional teams to deliver high-quality features using **Playwright** for automated end-to-end testing across different browsers.\n• Designed and executed comprehensive testing strategies encompassing unit, integration, and E2E tests, resulting in a **20%** reduction in production defects.\n• Maintained and improved legacy codebases as needed to enhance performance and compatibility with newer standards.\n• Participated in code reviews and provided mentorship to junior developers, promoting best practices in coding and design."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized advanced **JavaScript** (including **ECMAScript 6**), **React** (18), and **TypeScript** to develop engaging and responsive web applications, ensuring compatibility across various browsers and devices.\nEnhanced application performance using modern CSS techniques with **HTML5**, **CSS3**, **SASS**, and **LESS**, leading to improved user experience ratings by **25%**.\nImplemented version control and collaborating practices with **Git**, ensuring seamless integration and continuous deployment across development cycles.\nAdopted **Behavior-Driven Development** principles to improve code quality, enabling the identification of critical client-side issues earlier in the development process, reducing bug rates by **30%**.\nIntegrated JavaScript build tools such as **Gulp** and **Webpack** to optimize asset pipelines and automate workflows, reducing build times by **40%**.\nMigrated and modernized core financial platforms leveraging **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability and performance for high-volume transactional systems.\nDelivered real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies.\nDesigned and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing.\nEstablished ML pipelines for real-time credit scoring and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and optimized responsive web applications using **JavaScript**, **React (18)**, **HTML5**, and **CSS3**, ensuring optimal performance across various platforms.\n• Leveraged **TypeScript** for type checking and enhanced code quality while implementing **SASS** and **LESS** for modular styling.\n• Collaborated on Behavior-Driven Development (BDD) processes to enhance product development workflows and meet project deadlines effectively.\n• Utilized **Node.js** for backend integration, ensuring seamless data flow between frontend and backend services, achieving a load response time improvement of **30%**.\n• Assisted in ensuring a consistent build process by implementing **Gulp** and **Webpack** for task automation and module bundling.\n• Coordinated version updates and implemented best practices for source control using **Git**, enhancing team collaboration and code integrity.\n• Conducted thorough testing using **Playwright** to ensure quality and responsiveness across multiple devices and browsers, achieving a **95%** decrease in post-deployment bugs.\n• Engaged in peer code reviews to maintain high standards of coding practices and share knowledge within the team."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS3, SASS, LESS, Gulp, Webpack, Behavior-Driven Development, Playwright\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **API Technologies:**\n\tNginx, OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC)",
  "apply_company": "Aylo"
}