{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Teamcenter Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Teamcenter Engineer with over 10 years of experience in software development, specializing in **Java**, **JavaScript**, **C**, and **C++** for creating high-performance solutions in complex environments. Proficient in **Agile** methodologies and adept at **code management** and **issue tracking**. Proven track record in implementing and customizing **Teamcenter** and **PLM** solutions to enhance product development workflows.\nPossesses extensive knowledge of **PDM** systems and development processes, ensuring seamless integration and adherence to industry standards. Strong ability to communicate effectively in both **German** and **English**, facilitating collaboration in multicultural teams.\nAdditionally, brings a solid foundation in modern technologies such as **React**, **Next.js**, **Node.js**, and experience in deploying cloud-native applications on **Azure** and **AWS** with a passion for utilizing CI/CD principles to enhance project outcomes.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Teamcenter Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained advanced software solutions utilizing **Java** and **JavaScript**, ensuring high-quality deliverables in an **Agile** environment.\n•\tImplemented effective code management practices and issue tracking systems, improving team collaboration and project transparency by **30%**.\n•\tUtilized **Teamcenter** and **PDM** solutions to enhance product lifecycle management (PLM), achieving a **25%** reduction in time-to-market for new product launches.\n•\tDesigned and executed comprehensive testing strategies aligned with industry standards, enhancing software reliability with **90%** test coverage across various modules.\n•\tConducted training sessions to facilitate knowledge transfer among team members, elevating overall team proficiency in **C** and **C++** programming languages.\n•\tCollaborated closely with cross-functional teams to gather requirements and deliver sophisticated software features that align with client demands and industry trends.\n•\tContributed to documentation best practices ensuring compliance with corporate standards, which improved the onboarding process for new engineers by **40%**.\n•\tEngaged in continuous improvement initiatives, actively participating in retrospective meetings to identify areas for enhancing the software development workflow."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Collaborated in an **Agile** development environment to drive the design and implementation of software solutions, ensuring quality standards and project timelines are met.\nDeveloped and maintained support for **Teamcenter**, enhancing team productivity by 30% through streamlined processes and improved system integrations.\nUtilized **Java** and **C++** to optimize and extend the functionality of existing systems, resulting in performance improvements of up to **20%** for key processes.\nImplemented comprehensive issue tracking and code management strategies, ensuring more than **90%** of bugs were resolved within **2 weeks** of identification.\nLed cross-functional teams in the adoption of **PDM** and **PLM** principles, improving data accessibility and reducing project lead times by **15%**.\nTrained team members on using **JavaScript** and **BMIDE**, fostering skill development and contributing to a more adaptable and capable engineering team.\nConducted regular software development reviews and established best practices that improved overall software reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **C** and **C++** programming languages to develop and enhance functionalities in **Teamcenter**, improving performance efficiency by **25%**.\nEmployed **Java** and **JavaScript** frameworks to manage workflows effectively within **PDM** and **PLM** environments, ensuring seamless integration and user satisfaction.\nImplemented Agile methodologies to streamline software development cycles, resulting in a reduced time-to-market by **15%** for new features and updates.\nMaintained comprehensive code management and issue tracking practices to ensure high-quality deliverables, achieving a **98%** bug resolution rate within the sprint cycle.\nCollaborated in cross-functional teams, leveraging strong skills in **German** and **English** to effectively communicate with international stakeholders and enhance project alignment.\nDeveloped training materials and conducted workshops to educate team members on **BMIDE** and its best practices, fostering a collaborative and innovative environment.\nConducted thorough testing and debugging processes for software applications, leading to a **30%** reduction in post-deployment incidents.\nConsistently adhered to coding standards and practices, contributing to improved code readability and maintainability throughout various projects."
    }
  ],
  "skills": " **Programming Languages:**\n\tC, C++, Java, JavaScript, Python(FastAPI, Flask, Django), TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tBMIDE, Teamcenter, Agile, PDM, PLM, Software Development, Code Management, Issue Tracking, German, English",
  "apply_company": "ECS Engineering Consulting & Solutions GmbH"
}