{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior System Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Experienced Senior System Engineer with 8 years of expertise in systems management and IT operations within high-performance environments. Proficient in **Linux**, **Apache**, **MySQL**, and **FTP**, with strong skills in **SMTP**, **DNS**, and **Squid** for integrated systems solutions. Familiar with monitoring tools like **CheckMK** and **Nagios**, underpinned by ITIL practices to ensure seamless service delivery and support. Strong problem-solving abilities combined with solid documentation skills in both English and German enhance operational efficiency.\n\nIn addition to core systems engineering, I bring advanced full-stack development capabilities, leveraging technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**. Well-versed in frameworks including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, with significant cloud experience in **Azure** and **AWS**. I also possess a strong foundation in microservices architecture and CI/CD automation, enabling the creation of robust, compliant applications tailored for sectors like healthcare and finance. My background includes developing enterprise-grade platforms with AI/ML capabilities for predictive analytics and real-time data processing.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior System Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented and maintained critical systems using **Linux**, ensuring optimal performance and security across server environments.\n- Configured and managed **Apache** web servers to host applications with high availability and efficient resource utilization.\n- Developed scripts for automation and system management, enhancing workflow efficiency and operational reliability.\n- Oversaw database management and optimization using **MySQL**, ensuring data integrity and rapid access for applications.\n- Utilized **FTP** for secure and reliable file transfer operations and performed troubleshooting for connectivity issues.\n- Managed email services through **SMTP**, ensuring seamless communication across the organization.\n- Configured **DNS** settings for domain management, ensuring high uptime and accessibility of web applications.\n- Monitored system health and performance using **CheckMK** and **Nagios**, responding promptly to incidents and maintaining SLAs.\n- Adhered to **ITIL** best practices while managing IT service delivery and incident management processes.\n- Conducted detailed documentation of system configurations, processes, and incidents to maintain knowledge transfer and support.\n- Demonstrated effective problem-solving skills to troubleshoot and resolve technical issues impacting system performance.\n- Worked proficiently in English and German, facilitating communication in diverse environments and with international teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Managed Linux-based **Apache** web servers and implemented **MySQL** database solutions, ensuring optimal performance and availability for enterprise applications.\nUtilized **CheckMK** and **Nagios** for comprehensive monitoring and alerting solutions, achieving a 99.9% uptime across all systems and reducing incident response times by **25%**.\nDeveloped and maintained efficient **FTP** and **SMTP** services, improving data transfer processes and email delivery reliability using robust protocols.\nExecuted proactive **DNS** management strategies to enhance domain resolution time, resulting in a **15%** improvement in network latency for internal services.\nLeveraged scripting to automate routine tasks and continuous integration workflows, increasing operational efficiency and reducing manual errors by **40%**.\nProduced thorough documentation for systems architecture, processes, and procedures, ensuring compliance with **ITIL** standards and facilitating knowledge transfer among team members.\nDemonstrated exceptional problem-solving skills, addressing technical issues with a resolution time of under **2 hours** on average.\nFluently communicated in both English and German, collaborating with cross-functional teams and stakeholders across diverse environments."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Managed and optimized system configurations in a **Linux** environment, ensuring high availability and reliability for enterprise applications.\nExecuted file transfer protocols using **FTP** for seamless integration and data exchange between systems, maintaining high security standards.\nConfigured and maintained **Apache** web servers, ensuring optimal performance and service availability for critical applications.\nAdministered **MySQL** databases, implementing effective data management practices and optimizing queries to enhance application performance.\nMonitored system infrastructures with tools such as **CheckMK** and **Nagios**, proactively identifying and resolving issues before they impact operations, achieving a **95%** incident response rate.\nImplemented robust documentation practices for system architecture and processes, ensuring clear knowledge transfer and compliance with **ITIL** frameworks.\nUtilized scripting languages for automating repetitive tasks and streamlining operations, contributing to a reduction in manual intervention by **30%**.\nLed problem-solving initiatives in complex systems environments, successfully addressing and mitigating service disruptions within **1 hour**.\nFacilitated internal training sessions in **English** and **German**, enhancing team capabilities in system management and troubleshooting.\nDeveloped and executed strategies for reliable **DNS** configuration and management, optimizing domain resolution processes and minimizing downtime across services.\nEstablished effective email service configurations through **SMTP**, improving communication efficiency and system reliability for stakeholders."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular) \n\n **Backend Frameworks:** \n\t FastAPI, Flask, Django \n\n **Frontend Frameworks:** \n\t React, Vue, Angular \n\n **API Technologies:** \n\t JWT, OAuth2, Keycloak (OIDC, RBAC) \n\n **Serverless and Cloud Functions:** \n\t AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL) \n\n **Databases:** \n\t PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis \n\n **DevOps:** \n\t Docker, Kubernetes, GitHub Actions, GitLab CI/CD \n\n **Cloud & Infrastructure:** \n\t Terraform, Ansible, Helm, Docker Compose \n\n **Other:** \n\t Linux, Apache, FTP, SMTP, DNS, Squid, CheckMK, Nagios, ITIL, Scripting, Problem Solving, Documentation, English, German",
  "apply_company": "Sycor"
}