{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Sales Engineer with over 10 years of experience in **SaaS** solutions and **APIs** development, specializing in designing **RESTful** services and integrating complex systems. Proficient in handling data formats such as **JSON** and **XML**, and implementing **OAuth** for secure communications. Skilled in technical documentation, collaboration, and delivering comprehensive feedback to drive project success. Proven ability to leverage a strong background in backend development, creating high-performing APIs and automation tools using **Python** (**FastAPI**, **Django**, **Flask**) along with cloud platforms like **AWS** and **Azure**. Demonstrated success in contributing to impactful projects for leading organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Leveraged **APIs** and **RESTful** services to enhance system integrations for **SaaS** solutions, improving workflow efficiency by **30%**.\nCreated and maintained comprehensive **technical documentation** to support integration processes, facilitating communication between cross-functional teams.\nDesigned and implemented security measures using **OAuth** to protect sensitive data in CRM applications, ensuring compliance with industry standards.\nConducted thorough assessments to identify and address integration challenges, providing actionable feedback to stakeholders.\nUtilized **JSON** and **XML** for data interchange formats in integration tasks, optimizing data handling processes by **25%**.\nFostered strong **collaboration** with ad tech partners to align project goals and streamline integration timelines, achieving project delivery on average **2 weeks** ahead of schedule."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Led the integration of **SaaS** solutions, enabling enhanced functionality and streamlined user experiences for clients.\n• Developed and documented **APIs** to facilitate seamless data exchange using **RESTful** principles, ensuring compatibility with both **JSON** and **XML** formats.\n• Implemented authentication protocols using **OAuth** to secure access and improve user management, resulting in a **30%** increase in user satisfaction with security features.\n• Collaborated with sales and technical teams to provide feedback on product enhancements, leveraging strong **communication** and **collaboration** skills to improve customer relations by **25%**.\n• Created comprehensive **technical documentation** to aid in platform understanding for clients and internal stakeholders, increasing support efficiency by **15%**.\n• Engaged in pre-sales technical discussions, translating complex product features into clear solutions for clients in the **ad tech** space, which boosted conversion rates by **20%**.\n• Assisted in the implementation of new **CRM** systems to improve customer tracking and reporting efficiency.\n• Regularly provided training sessions for clients and team members on new product features and system integrations, reinforcing effective **collaboration** across departments."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed and integrated **RESTful APIs** to enhance SaaS initiatives, improving data accessibility and usability for CRM solutions.\n• Collaborated with cross-functional teams to deliver comprehensive technical documentation, ensuring clear communication of product features and integration processes.\n• Utilized feedback from stakeholders to streamline integration efforts with ad tech systems, achieving a **20%** increase in system interoperability.\n• Engineered and maintained systems for seamless integration with **JSON** and **XML** data formats, facilitating efficient data exchange and communication.\n• Conducted technical training sessions on OAuth protocols, enhancing team knowledge and improving security practices across platforms.\n• Leveraged effective collaboration techniques to align product development with client expectations, resulting in a **15%** improvement in customer satisfaction scores.\n• Actively participated in team feedback loops to refine product features, achieving significant performance enhancements in **SaaS** offerings."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, RESTful, JSON, XML, OAuth, APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tSaaS, CRM, ad tech, integration, technical documentation, communication, collaboration, feedback, Kafka, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow",
  "apply_company": "Topsort"
}