{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior IT Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior IT Engineer with over 13 years of experience in delivering high-performance applications, particularly in the healthcare and financial sectors. Proficient in deploying cloud solutions on **AWS**, and **ESXI**, with hands-on experience in **Linux** and **BSD** environments. Strong skills in ITIL practices, troubleshooting, and problem-solving, essential for maintaining robust system infrastructure.\n\nAccomplished in team management with a proven ability to lead cross-functional teams. Experienced in utilizing tools such as **Grafana**, **ElasticSearch**, and **Splunk** for monitoring and logging, ensuring optimal system performance. Skilled in secure networking using **OpenVPN**, **IPSec**, and **WireGuard**, and implementing firewall solutions with **pfSense**. \n\nAdditionally, well-versed in modern software development techniques with a technical background in **JavaScript/TypeScript**, **Python**, and **Flutter**, leveraging frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven expertise in developing AI/ML-driven platforms and deploying microservices architectures, ensuring systems are compliant with standards like HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior IT Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS** for deploying and maintaining scalable cloud infrastructure, enhancing system performance and reliability.\nManaged virtualization technologies including **Proxmox** and **ESXI** to optimize resource allocation and improve system efficiency across multiple environments.\nImplemented monitoring and visualization solutions using **Grafana** to provide real-time visibility into system performance and incident management, ensuring high uptime.\nConfigured and maintained secure networks using **OpenVPN**, **IPSec**, and **WireGuard** for secure communications across remote locations, mitigating security risks.\nLed a team of IT professionals in adopting **ITIL** practices to improve service management and deliver high-quality IT services, resulting in a **25%** increase in customer satisfaction ratings.\nConducted troubleshooting and problem-solving sessions that reduced incident resolution times by **40%**, significantly enhancing operational efficiency.\nDeveloped and enforced incident response strategies, integrating **Splunk** for advanced log analysis, which improved root cause identification during outages and breaches.\nFacilitated cross-departmental collaboration to improve process management and documentation, ensuring compliance with industry standards and best practices.\nPromoted knowledge sharing and mentorship within the team, leading to improved technical skills and professional development among junior staff members.\nExecuted strategic planning sessions that resulted in a **15%** reduction in operational costs through improved resource management and technology investments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **AWS** for cloud infrastructure management, ensuring high availability and scalability of applications by migrating legacy systems to a cloud-native setup.\nImplemented advanced monitoring and visualization solutions using **Grafana** and **ElasticSearch** to improve system performance monitoring and troubleshooting processes.\nDeveloped and maintained virtual environments using **Proxmox** and **ESXI**, facilitating effective resource allocation and reducing overhead costs by **20%**.\nManaged Linux and BSD server environments, applying ITIL best practices in system administration, leading to improved uptime metrics by **15%**.\nExecuted sophisticated network security protocols using **OpenVPN**, **IPSec**, and **WireGuard** to protect sensitive financial data, achieving a **99.9%** security compliance rate.\nLed a team of engineers in troubleshooting and problem-solving efforts, enhancing operational efficiency and reducing resolution times by **30%**.\nSpearheaded training programs focusing on system management and security best practices, improving team productivity and knowledge by **50%**.\nCollaborated effectively with cross-functional teams to implement IT solutions that align with business goals, ensuring timely project delivery and stakeholder satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **AWS** services for scalable deployments, ensuring applications maintained **99.9%** uptime and optimal performance across diverse workloads.\nPerformed extensive troubleshooting and problem-solving for complex systems on both **Linux** and **BSD** platforms, reducing incident resolution times by **30%**.\nImplemented monitoring and visualization strategies using **Grafana** to maintain real-time insights into system performance and application health, achieving immediate detection of anomalies.\nConducted migrations to **Proxmox** and **ESXi** environments, enhancing operational efficiency and resource management.\nManaged **OpenVPN**, **IPSec**, and **WireGuard** configurations for secure remote access, achieving compliance with organizational security policies.\nDesigned and maintained network security solutions using **pfSense**, significantly reducing unauthorized access attempts by **40%**.\nPerformed capacity planning and infrastructure scaling in line with ITIL best practices to support a user base exceeding **10,000** concurrent users.\nCollaborated with cross-functional teams to enhance team management efficiency, promoting a cooperative work environment that streamlined project delivery.\nUtilized **ElasticSearch** and **Splunk** for comprehensive log management and analysis, enhancing problem resolution and system monitoring capabilities.\nLed training sessions on troubleshooting best practices, increasing team competence and responsiveness regarding system issues by **25%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob Storage, SQL Database), Proxmox, ESXI, Grafana, Linux, BSD\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Authentication & Security, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, ElasticSearch, Splunk, OpenVPN, IPSec, WireGuard, pfSense, ITIL, troubleshooting, problem-solving, team management",
  "apply_company": "Social Discovery Group"
}