{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Fullstack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Full Stack Engineer with 10+ years of experience in developing high-performance software solutions. Expertise in **HTML5**, **Git**, **GitLab**, **Docker**, **AWS**, **GCP**, and **Azure**, ensuring efficient CI/CD processes and effective version control. Proven ability to lead projects using **Scrum** and **Kanban** methodologies, driving team performance and delivering quality results. Skilled in developing and maintaining robust applications across the full stack utilizing modern frameworks and languages, including **Go**, alongside strong foundational knowledge of **PostgreSQL**. Extensive hands-on experience in building cloud-native applications and deploying solutions that meet industry compliance standards. Recognized for a deep understanding of microservices architecture and event-driven systems, coupled with a passion for leveraging technology to create systems that generate real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Leveraged **Go** and **HTML5** to design and implement scalable, full-stack solutions for healthcare and finance, ensuring compliance with regulatory standards such as HIPAA, FHIR, GDPR, PCI DSS, and SOX.\n• Developed and maintained **PostgreSQL** databases for large-scale data ingestion, storage, and querying, optimizing performance for healthcare and financial applications, managing over **500,000** records in production.\n• Implemented CI/CD pipelines utilizing **Git**, **GitLab**, and **Docker** to streamline deployments for both web and API services, achieving a **40%** reduction in deployment times.\n• Applied Agile methodologies, specifically **Scrum** and **Kanban**, to enhance team collaboration and deliver software components with a demonstrated **30%** increase in project throughput.\n• Designed responsive front-end interfaces utilizing HTMX and Templ, effectively improving user engagement metrics by over **25%**.\n• Transitioned monolithic applications to microservices architecture using **Docker** and **AWS** for improved scalability and management of production workloads, achieving **99.99%** uptime.\n• Collaborated with cross-functional teams to integrate advanced search capabilities using **Azure** and **GCP** to handle millions of healthcare records and financial documents, enhancing search efficiency.\n• Established and maintained comprehensive test strategies across the stack, covering unit, integration, and end-to-end tests, ensuring robust application reliability and quality assurance."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Go** and **HTML5** to develop and modernize scalable financial platforms, enhancing throughput and maintainability for a user base of over **10,000** clients.\nEngineered full-stack applications with a microservices architecture, implementing best practices in **CI/CD** and version control using **Git** and **GitLab**, reducing deployment times by **30%**.\nLeveraged **PostgreSQL** for robust database management, optimizing query performance by **25%** and ensuring data integrity across transactional systems.\nImplemented agile methodologies such as **Scrum** and **Kanban** for project management, leading sprints that resulted in a **40%** increase in deliverable output over a **6-month** period.\nDesigned and built responsive user interfaces using modern frameworks and libraries, while conducting performance tuning and optimizations to support concurrency for **1,000+** simultaneous users.\nManaged containerized applications with **Docker**, streamlining application deployment across multiple cloud environments including **AWS** and **GCP**.\nAdopted **HTMX** and **Templ** for dynamic client-side interactions, enhancing user experience and engagement metrics by **15%**.\nCollaborated with cross-functional teams and stakeholders to align application features with business requirements, contributing to a **20%** increase in user satisfaction in annual surveys."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed scalable and high-performing backend services using **Go**, ensuring robust architecture that handles significant workloads, optimized for **PostgreSQL** and other data stores for **99.99%** uptime.\nImplemented CI/CD pipelines using **GitLab** to automate testing and deployments, resulting in a **30%** reduction in release time and improved deployment reliability.\nUtilized **Docker** containers to streamline the development environment, ensuring consistent deployment across **AWS**, **GCP**, and **Azure**, enhancing system reliability and reducing setup time by **50%**.\nDesigned user-friendly and responsive web applications using **HTML5** and **HTMX**, ensuring accessibility and improved user experiences compliant with **WCAG 2.1** standards.\nCollaborated using **Scrum** and **Kanban** methodologies, participating in regular sprints and retrospectives to foster transparency, accountability, and continuous improvement in team performance.\nManaged version control effectively with **Git**, promoting best practices for code quality and collaboration within the development team.\nEnhanced application security and compliance utilizing **OAuth 2.0** for user authentication and role-based access control (RBAC), safeguarding sensitive user data.\nEnsured real-time data handling and optimized performance through aggregating and managing data flows with efficient caching strategies."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, Go, JavaScript, TypeScript\n\n**Frontend Frameworks**\n\tReact, Vue, Angular, HTMX, Templ\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**API Technologies**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Git, CI/CD\n\n**Cloud & Infrastructure**\n\tTerraform, Ansible, Helm, Docker Compose, Scrum, Kanban\n\n**Other**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot",
  "apply_company": "Not specified"
}