{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Lead/Staff Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "Results-driven Lead Backend Engineer with 8 years of extensive experience in building high-performance, reliable applications within the healthcare and financial sectors. Proficient in **Python**, relational database management, and data modeling, leveraging cloud services like **AWS** for robust infrastructure and system reliability. Experienced with distributed systems, infrastructure-as-code, and container orchestration techniques, ensuring high availability and performance optimization.\n\nSkilled in DevOps pipelines and observability practices, I implement software design patterns that promote maintainable and scalable software architecture. My background includes strong testing practices that enhance product quality and software reliability. I have a proven track record of leadership, fostering collaboration and clear communication among cross-functional teams to drive project success.\n\nIn addition, I bring solid expertise in developing enterprise-grade platforms with advanced technologies like **React**, **Next.js**, **Node.js**, **Docker**, and CI/CD processes, while ensuring compliance with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Lead/Staff Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged expertise in **Python** for developing robust backend services and APIs, ensuring optimal software design patterns and **performance optimization** techniques for scalability.\nEngineered scalable, fault-tolerant distributed systems utilizing **AWS** cloud services, ensuring platform reliability and efficient resource management for high-demand applications.\nDesigned and implemented relational databases with data modeling best practices, utilizing databases such as PostgreSQL and MongoDB for efficient data storage and retrieval, increasing query performance by **30%**.\nSpearheaded the adoption of **infrastructure-as-code** methodologies using tools like Terraform, streamlining deployment processes, reducing setup time by **50%**, and enhancing collaboration across development teams.\nManaged container orchestration with **Docker** and **Kubernetes**, ensuring high availability of services while implementing DevOps pipelines for automated testing and deployment, achieving a **99.9% uptime** metric.\nEnsured observability and continuous monitoring of systems, which led to a **40%** decrease in incident resolution time by integrating advanced logging and alerting mechanisms.\nFostered collaboration across multi-disciplinary teams, utilizing effective communication to lead projects to completion within deadlines, enhancing team performance and morale.\nConducted extensive testing practices including unit, integration, E2E, and contract testing to guarantee system reliability, implementing strategies that reduced bugs in production by **70%**.\nImplemented leadership initiatives that involved mentoring junior engineers, promoting best practices, and conducting knowledge-sharing sessions to uplift team skill sets in backend development.\nCollaborated with cross-functional teams to design and maintain efficient cloud-native architectures, enhancing project alignment with business goals, and delivering high-quality solutions to clients."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Led the modernization of financial platforms leveraging **Python** and **AWS**, optimizing platform reliability and implementing **infrastructure-as-code** practices, resulting in a **40% increase** in system scalability.\n• Designed and developed distributed systems with a focus on data modeling, utilizing advanced software design patterns to enhance maintainability and performance optimization, achieving over **99% uptime** in critical application areas.\n• Championed DevOps pipelines to facilitate continuous integration and deployment, ensuring efficient collaboration and communication across teams, reducing deployment times by **30%**.\n• Executed container orchestration strategies using **Docker** and **Kubernetes**, streamlining application deployment processes and improving incident response times by **50%** through enhanced observability practices.\n• Fostered a culture of testing practices within the team, driving adherence to best practices in software development, which contributed to a **20% reduction** in production bugs.\n• Led cross-functional teams in the development of microservices and event-driven architectures, integrating technologies like **Kafka** and **RabbitMQ** to improve system resilience and efficiency.\n• Applied leadership skills to mentor junior developers, promoting collaboration and knowledge sharing which resulted in enhanced team performance and project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Led backend architecture design and optimization for a global e-commerce platform using **Python** (FastAPI, Django) and **Node.js** (NestJS, Express), achieving **99.9%** uptime and enhancing scalability across key modules like checkout, cart, and order fulfillment.\n• Championed the development of robust and scalable **distributed systems**, utilizing **AWS** cloud services for dynamic resource allocation, ensuring responsive user interactions with less than **150ms** latency.\n• Directed the creation of insightful data models and efficient **relational databases** leveraging **MongoDB**, **PostgreSQL**, and **Cassandra**, which improved data retrieval speeds by over **30%**.\n• Spearheaded implementation of **DevOps pipelines** and **infrastructure-as-code** for streamlined development, deploying robust features across **10+** microservices using **Kubernetes** for optimal container orchestration.\n• Fostered team collaboration through clear communication and agile leadership, mentoring junior engineers in best practices of software design patterns and efficient testing practices to enhance overall code quality.\n• Drove performance optimization efforts that reduced server response time by **40%** through efficient caching strategies using **Redis**, improving user experience during peak traffic times.\n• Enhanced observability of the e-commerce platform’s services using logging and monitoring tools, contributing to a proactive reliability approach that minimized downtime by addressing issues preemptively.\n• Advocate for security best practices, implemented **role-based access control (RBAC)** and **OAuth 2.0**, ensuring **GDPR** compliance and safeguarding user data with rigorous data handling procedures.\n• Collaborated cross-functionally to integrate AI/ML recommendation engines using **scikit-learn** and **TensorFlow**, positively impacting conversion rates by personalizing product offerings based on real-time user behavior."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, relational databases, data modeling\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose), DevOps pipelines, container orchestration\n\n **Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL)\n\n **Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, distributed systems, observability, platform reliability, software design patterns, testing practices, performance optimization, leadership, communication, collaboration"
}