{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Build Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Build Engineer with a strong emphasis on compliance and risk management, leveraging 13+ years of technical expertise. Proven ability in project delivery with a focus on continuous improvement and resource planning. Proficient in conducting site audits and ensuring adherence to health & safety regulations. Excellent problem-solving skills and a collaborative approach to network activation and civil works, supported by comprehensive documentation and invoicing capabilities.\nTechnically adept with a diverse skill set including **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside frontend frameworks such as **React**, **Next.js**, and **Vue**. Experienced in backend development with **Node.js**, **FastAPI**, and **Django**, and knowledgeable in deploying cloud-native systems on **AWS** and **Azure**. Strong background in compliance-driven development aligned with standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Build Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Ensured compliance with health & safety regulations and industry standards by conducting comprehensive site audits and risk management assessments, enhancing overall project delivery efficiency.\nExecuted thorough resource planning and documentation processes to streamline project execution, maintaining high standards of compliance.\nLed collaboration efforts with cross-functional teams to enhance traffic management strategies for optimal site operations and resource allocation.\nImplemented continuous improvement initiatives through effective problem-solving techniques and strategic communication with project stakeholders, driving project success.\nManaged cabling and network activation tasks, ensuring reliable connectivity and adherence to NRSWA regulations in all build projects.\nOversaw invoicing and budgeting processes to ensure financial transparency and accountability throughout the project's life cycle.\nUtilized advanced project management tools to track progress and optimize workflow, achieving a **35%** increase in project delivery timelines.\nConducted civil engineering assessments and facilitated traffic management plans to ensure minimal disruption during build processes, scoring an **85%** satisfaction rate in post-project evaluations.\nCollaborated with compliance teams to maintain documentation accuracy, supporting effective audits and ensuring adherence to health and safety standards in all projects.\nDrove innovations in project delivery by integrating best practices, resulting in a **40%** reduction in operational issues, thereby enhancing overall build quality."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Executed project delivery by overseeing robust network activation processes, ensuring compliance with health & safety regulations and NRSWA standards for successful build outcomes.\n- Conducted thorough site audits to assess risks and implement risk management strategies, contributing to continuous improvement of project workflows and site safety.\n- Planned and managed resources efficiently, coordinating between teams to ensure timely completion of cabling and civils work within **9** weeks on multiple concurrent projects.\n- Developed comprehensive documentation for all project phases, delivering clear and precise invoicing that aligns with industry standards and organizational policies.\n- Led traffic management initiatives on site, ensuring minimal disruption to ongoing operations while promoting a safe environment for both workers and the public.\n- Fostered collaboration and communication across diverse teams, problem-solving effectively to address challenges encountered during project execution.\n- Maintained organizational compliance through regular audits and adherence to regulatory requirements, enhancing operational integrity and accountability."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Executed comprehensive site audits and compliance checks adhering to health & safety regulations, ensuring all projects align with **NRSWA** standards.\nLed risk management initiatives to identify potential issues and mitigate risks associated with project delivery, enhancing overall project success rates by **20%**.\nCollaborated with cross-functional teams to drive continuous improvement in operational efficiency, optimizing resource planning through real-time data analysis.\nDocumented all processes meticulously, leading to a **15%** increase in team efficiency by providing clear and accessible project guidelines.\nManaged cabling and network activation projects, ensuring adherence to protocols while handling complexities of civil works with minimal disruption to existing infrastructure.\nOversaw invoicing processes to ensure alignment with project deliverables, improving cash flow metrics by **10%** through timely and accurate billing.\nImplemented effective traffic management strategies during site operations, reducing congestion and ensuring safety compliance.\nExecuted projects within budget constraints and scheduled timelines through strategic resource allocation, achieving a **95%** on-time delivery rate.\nFostered collaboration among engineers and contractors, enhancing communication lines to streamline project workflows and enhance overall team performance.\nUtilized problem-solving skills to address on-site challenges swiftly, leading to enhanced project outcomes and client satisfaction."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code:\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tfibre\n\thealth & safety\n\trisk management\n\tproject delivery\n\tcabling\n\tnetwork activation\n\tNRSWA\n\tsite audits\n\tresource planning\n\tcompliance\n\tcontinuous improvement\n\tdocumentation\n\tinvoicing\n\tcivils\n\ttraffic management\n\tproblem solving\n\tcollaboration\n\tcommunication",
  "apply_company": "GoFibre"
}