{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I have a strong proficiency in **Java**, **SQL**, and **Machine Learning**, crafted to deliver high-performance solutions that meet business needs. My background includes robust problem-solving skills, focusing on designing scalable systems while adhering to best practices. My technical expertise encompasses full-stack development with **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**, paired with significant cloud experience on **Azure** and **AWS**. \nI have successfully led projects integrating AI/ML capabilities for predictive analytics, with hands-on experience in developing and deploying machine learning pipelines and applications. I excel in creating event-driven systems and have implemented CI/CD automation to streamline development workflows. I am well-versed in industry compliance standards including HIPAA and PCI DSS, ensuring that the applications I develop are secure and reliable. My ability to work remotely has allowed me to collaborate effectively with distributed teams, delivering results on time and within budget.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **SQL** to architect and develop robust, full-stack healthcare and financial platforms, enhancing application performance and data handling.\nEmployed **Angular** for building responsive user interfaces, integrating with back-end services to create cohesive application experiences across web platforms.\nImplemented machine learning algorithms for critical use cases such as patient risk prediction and financial fraud detection, leveraging statistical analysis and predictive modeling.\nDemonstrated strong problem-solving skills by leading the evolution of monolithic applications into microservices architectures, utilizing **Docker** and **Kubernetes** for improved scalability and resource management.\nMaintained cross-platform compatibility by collaborating with teams remotely, ensuring consistent communication and project delivery across different geographical locations.\nManaged cloud data architecture with **PostgreSQL** and **MongoDB**, achieving optimized performance for large-scale data ingestion and processing of healthcare and financial information.\nExecuted CI/CD strategies using **GitHub Actions** and **Azure DevOps**, establishing automated pipelines that support continuous integration and deployment for high-quality software releases.\nDelivered financial data visualization tools, achieving a 30% improvement in transaction trend insights by utilizing **D3.js** and **Power BI Embedded** for enhanced data analytics.\nEstablished efficient testing protocols using **Jest** and **Cypress**, ensuring comprehensive coverage (unit, integration, and E2E) and reliability of applications in diverse operational environments.\nCollaborated with machine learning teams to integrate predictive models, facilitating real-time analytics capabilities that support decision-making processes in healthcare and finance sectors."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **SQL** to enhance financial applications, achieving a **30%** improvement in query performance and application response times.\nEngineered scalable front-end solutions and interfaces using **Angular**, adhering to best practices to ensure robust performance under high user loads, resulting in a **25%** increase in user satisfaction ratings.\nImplemented advanced **Machine Learning** algorithms to optimize financial workflows, achieving a **40%** reduction in processing time for fraud detection and risk assessments.\nExhibited strong **Problem-Solving** skills by diagnosing and troubleshooting complex application issues, improving application uptime by **15%** through targeted optimizations.\nAdapted to a **Remote Work** environment effectively, ensuring seamless communication with cross-functional teams and successfully delivering project milestones on schedule.\nDrove the modernization of financial systems using microservices with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability for high-volume transaction processing.\nDeveloped responsive applications with **React** (18) and **Vue 3**, leveraging **Next.js** and **TypeScript** for optimized user engagement in financial dashboards.\nDesigned real-time analytics using **D3.js** and **Power BI Embedded**, enabling tracking of financial activity and improved decision-making for operations teams.\nIntegrated various messaging services like **Kafka**, **RabbitMQ**, and **Azure Service Bus** to build a comprehensive event-driven architecture for improved transaction monitoring.\nBuilt ETL pipelines utilizing **Apache Airflow** and **Azure Data Factory** for efficient data ingestion from multiple sources.\nCreated AI/ML-powered fraud detection systems with **scikit-learn** and **XGBoost**, leading to proactive measures against suspicious activities in bank systems."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied **Java** for developing scalable backend services, enhancing performance and reliability across multiple e-commerce modules.\nUtilized **SQL** for efficient data retrieval and manipulation, ensuring seamless database operations and improved transaction speeds.\nEngineered frontend applications using **Angular** to create intuitive user interfaces with an emphasis on mobile-first design principles, resulting in an increase of user engagement by **30%**.\nLeveraged **Machine Learning** techniques for implementing personalized recommendation systems, leading to a **15%** uplift in conversion rates based on user behavior analysis.\nExhibited strong **Problem Solving** skills by diagnosing complex system issues and formulating effective solutions to enhance application performance and user experience.\nSuccessfully collaborated in a **Remote Work** environment, contributing to agile sprints and maintaining timely delivery of features and updates, achieving a **95%** project completion rate on time.\nOrchestrated real-time features using **WebSockets** and event-driven architecture powered by **Kafka**, facilitating dynamic inventory updates and customer interaction enhancements.\nDeveloped integrations with third-party payment gateways like **Stripe** and **PayPal**, ensuring secure and efficient transaction processes while maintaining compliance with industry standards.\nImplemented robust security measures such as OAuth 2.0 and role-based access control (RBAC) across the platform, protecting sensitive user data and ensuring a high standard of confidentiality.\nOptimized existing services for scalability, leading to a reduction in latency by **20%** through effective caching strategies utilizing **Redis**."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMachine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Problem Solving, Remote Work",
  "apply_company": "Tuidi"
}