{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior QA Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior QA Engineer with over 10 years of experience in software quality assurance, specializing in **Selenium**, **JUnit**, **API testing**, and **UI testing**. Proficient in a range of programming languages including **Java**, **C#**, **Golang**, **JavaScript**, **HTML**, and **CSS**, with strong skills in **test-driven development** and **continuous integration**. Experienced in agile methodologies, leveraging **Git** for effective version control and collaboration. Additionally, possess excellent communication skills and task management abilities to coordinate cross-functional teams effectively.\nDemonstrated expertise in full stack development with a solid background in **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**, along with a profound understanding of cloud-native solutions on **Azure** and **AWS**. Proven track record in leading the development of enterprise platforms that integrate AI/ML for enhanced analytics and automation. Passionate about driving impact through quality software while adhering to compliance standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tConducted comprehensive **API testing** using Selenium, JUnit, and various other tools, ensuring high quality across healthcare and fintech applications at scale.\n•\tLed **UI testing** initiatives utilizing a combination of **JavaScript**, **CSS**, and **HTML** frameworks to enhance user experience and validate functionality across platforms.\n•\tEmployed **Golang**, **Java**, and **C#** for automated testing scripts to ensure robustness and performance standards are met within applications.\n•\tImplemented continuous integration practices by integrating automated tests into pipelines with **Git** and **agile methodology**, enhancing deployment efficiency by **30%**.\n•\tDeveloped and maintained test-driven development practices that improved code quality and reduced bugs in production by **25%** over a year-long period.\n•\tManaged task prioritization and communication within the QA team, fostering collaboration and ensuring timely delivery against project milestones.\n•\tCreated comprehensive test strategies using tools like Jest, Postman, and used automated frameworks to achieve **95%** test coverage across critical application components.\n•\tCollaborated with development teams to establish effective feedback loops, ensuring that testing outcomes accurately informed development cycles.\n•\tSupported the shift-left testing approach by integrating testing activities earlier into the development lifecycle, promoting a culture of quality across teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Conducted rigorous **API testing** and **UI testing** to ensure the reliability and performance of financial applications, utilizing **Selenium** and **JUnit** to automate test cases and enhance quality assurance processes.\nCollaborated effectively with development teams, applying **agile methodology** to streamline project workflows and improve communication throughout the software development lifecycle.\nUtilized **Git** for version control, managing code changes across multiple branches and facilitating continuous integration to maintain code integrity across projects.\nParticipated in **test-driven development** practices, ensuring that test cases are defined before coding to lead to cleaner, more maintainable code in financial platforms.\nImplemented comprehensive test strategies for applications built in **Java**, **C#**, and **JavaScript**, ensuring high-quality deliverables that meet industry standards for usability and performance.\nCoordinated task management among team members to efficiently prioritize testing activities and meet project deadlines, resulting in a **20%** reduction in bug turnaround time.\nFostered effective communication skills in cross-functional teams to promptly address issues and ensure a thorough understanding of quality expectations across **3** financial platforms undergoing modernization."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Conducted comprehensive **API testing** for various backend services utilizing **Java**, **Golang**, and **JavaScript**, ensuring robust functionality and seamless integration within the global e-commerce platform.\nExecuted end-to-end **UI testing** on web applications using **Selenium** and **JUnit** to validate user interfaces across multiple devices and browsers, achieving a **95%** test coverage.\nImplemented and maintained **test-driven development** practices to support high-quality code delivery, ensuring reliability and performance with minimum disruption to ongoing operations.\nCollaborated within an **agile methodology** framework to efficiently manage and prioritize testing tasks in alignment with team objectives, contributing to a **30%** reduction in release times.\nDeveloped automated test scripts using **Selenium** and **Java** that integrated with **Git** for version control, significantly improving the development and testing processes.\nFacilitated continuous integration efforts by integrating test automation into the pipeline, ensuring immediate feedback for developers and maintaining project standards during the development lifecycle.\nUtilized **JavaScript**, **CSS**, and **HTML** to create user test cases that reflect real-world usage patterns, improving the effectiveness of the test suite.\nEnhanced communication skills for cross-team collaboration, ensuring all stakeholders are informed about testing progress and results, resulting in improved project transparency.\nMonitored application performance and user feedback post-deployment, iterating on test strategies to address any emerging issues proactively and ensuring user satisfaction."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, Golang, JavaScript, TypeScript, C#, CSS, HTML\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI testing\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, continuous integration\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, agile methodology, test-driven development, communication skills, task management, Selenium, JUnit, UI testing, DOM",
  "apply_company": "Consensus"
}