{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Sales Engineer with a comprehensive understanding of CRM, DMS, and Decision Support Tools, leveraging 9+ years of experience in the tech field. Skilled in utilizing Condition Monitoring and Plant Asset Management systems to enhance sales productivity. Proficient in MS Office suite and adept at developing Strategic Account Plans to drive B2B sales. Proven track record of collaborating effectively with diverse teams to deliver tailored solutions that meet client needs. Original strengths include a solid foundation as a .NET Full Stack Developer with extensive knowledge of **microservices architecture**, **distributed systems**, and technologies such as **ReactJS**, **NextJS**, **.NET**, and **C#**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Enhance customer experience in the CRM sector by leveraging a web-based customer management platform, leading to an increase in user satisfaction by **25%**.\nDemonstrated expertise in Decision Support Tools and data-driven solutions in the customer management domain.\nUtilized **MS Office** to prepare strategic account plans and enhance B2B sales productivity.\nSpearheaded the integration of advanced Plant Asset Management functionalities into the CRM platform, improving operational efficiency.\nCollaborated with cross-functional teams to design and refine Condition Monitoring systems, increasing sales support effectiveness.\nImplemented and optimized reporting mechanisms that enhance decision-making processes for strategic account planning.\nEngaged in extensive user feedback collection and analysis to drive product enhancements and ensure alignment with client needs.\nFostered relationships with key clients through strategic account plans, contributing to an increase in overall sales productivity.\nLeveraged data analytics tools to monitor sales performance and identify opportunities for improvement.\nSynthesized technical knowledge with sales skills to tailor solutions that meet customer requirements effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and implemented strategic account plans utilizing CRM systems to enhance client relationship management and sales productivity.\nLeveraged MS Office tools to create detailed reports and presentations for decision support, driving informed strategic decisions.\nCollaborated with cross-functional teams to optimize plant asset management solutions, improving condition monitoring processes by 20%.\nDesigned and executed comprehensive condition monitoring strategies for CRM and DMS integration, significantly improving asset reliability.\nConducted in-depth analysis to identify opportunities for B2B sales enhancements, leading to a **15%** increase in key account revenue.\nProvided expert insights on leveraging decision support tools for improved operational efficiency across sales teams.\nEngaged with clients to understand their needs, facilitating tailored solutions that aligned with their business objectives.\nTrained and mentored team members on best practices in sales processes and MS Office efficiency, resulting in a **25%** boost in team performance.\nUtilized data analytics to track project effectiveness and client engagement metrics, ensuring continuous improvement in sales strategies.\nPresented findings and recommendations to senior management using advanced presentation skills, leading to the adoption of new sales initiatives."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Enhanced CRM functionalities and contributed to the internal CRM system development with **.NET Framework** and **Angular**, improving sales team productivity by **20%**.\n• Developed a Decision Support Tool for strategic account plans while implementing **RabbitMQ** for effective message queue management, resulting in reduced system load during peak usage.\n• Engineered reusable components using **Angular** and **C#**, accelerating the development cycle for future B2B sales projects.\n• Optimized customer information retrieval through efficient SQL queries with **SQL Server**, leading to improved query performance by **30%**.\n• Successfully migrated legacy code from **ASP.NET WebForms** to **.NET Core**, enhancing overall system performance and maintainability by **15%**.\n• Collaborated with the DevOps team on Azure to set up **automated build and release pipelines**, reducing deployment time by **40%**.\n• Integrated third-party APIs to create seamless data sharing capabilities, significantly enhancing plant asset management effectiveness.\n• Leveraged **Vue.js** to improve the client-side dashboard experience, boosting user engagement metrics by **25%**.\n• Participated in daily standups and code reviews to align project goals and uphold coding standards.\n• Provided comprehensive technical documentation and user guides for internal systems, facilitating improved knowledge transfer among teams."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**DevOps**\n\tCI/CD pipelines\n\n**Other**\n\tUX/UI Design, Git, GitHub, Python, Redux, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Testing Tools, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, CRM, DMS, Decision Support Tool, Condition Monitoring, Plant Asset Management, MS Office, B2B Sales, Strategic Account Plans, Sales Productivity\n\n**Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis",
  "apply_company": "Emerson"
}