{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Frontend Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a dedicated Senior Frontend Engineer with 8 years of experience, I have a proven track record in leveraging **React**, **Next.js**, and **TypeScript** to create engaging and high-performance user interfaces. My technical proficiency includes extensive work with **UI/UX**, **animation**, and tools like **Figma** and **Framer** to enhance user experience and interactivity. I am skilled in utilizing **WebGL**, **Three.js**, and **React Three Fiber** for innovative visual solutions. Additionally, I have hands-on experience with **Playwright**, **Vitest**, and **Cypress** for end-to-end testing to ensure application reliability.\n\nI thrive in environments that utilize modern technologies such as **AI** frameworks, including **OpenAI**, **Hugging Face**, **LangChain**, **Stable Diffusion**, **ComfyUI**, and **Midjourney**, implementing intelligent features that elevate the user experience. My background also includes robust knowledge of **Node.js**, **Python**, and **Docker**, ensuring seamless integration with back-end processes. My ability to create functional applications while adhering to best practices and standards has consistently resulted in successful project outcomes, particularly in dynamic sectors like healthcare and finance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained modern front-end applications using **React** (17-18), **Next.js**, and **TypeScript**, ensuring responsive and high-performance user interfaces, while integrating **REST** and **GraphQL** APIs for seamless data flow.\nImplemented cutting-edge UI/UX designs using **Figma** for user-centered applications, including animations and transitions leveraging **WebGL**, **Three.js**, and **React Three Fiber**.\nCollaborated with cross-functional teams to design AI-driven features utilizing **OpenAI**, **Hugging Face**, and **LangChain**, enhancing user experience through personalized recommendations and advanced data visualization.\nExecuted testing strategies employing **Cypress**, **Vitest**, and **Playwright** for comprehensive unit, integration, and end-to-end testing, ensuring robust application functionality.\nArchitected and optimized CI/CD pipelines using **Docker** and deployed applications on cloud infrastructure to enable rapid development cycles and iterative releases.\nDelivered a library of UI components with **Radix UI** and **Tailwind**, adhering to standards and best practices for maintainability and style consistency across projects.\nRegularly updated applications to leverage the latest frameworks, improving performance and user engagement metrics by up to **30%**.\nEngaged in agile development processes, participating in daily stand-ups and sprint planning to ensure timely delivery of product features and enhancements, achieving over **95%** sprint completion rates."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused front-end applications leveraging **React (18)**, **Next.js**, and **TypeScript**, enhancing UI/UX for financial dashboards and admin portals, achieving a **30%** improvement in user engagement metrics.\n• Collaborated in a cross-functional team to implement innovative animations using **Three.js**, resulting in a **25%** increase in user retention through enhanced visual interactivity.\n• Led integration of **Tailwind CSS** and **Radix UI** to create responsive designs, ensuring cross-browser compatibility and a consistent user experience across **90%** of tested devices.\n• Designed and implemented RESTful APIs and **GraphQL** services for seamless data communication between front-end applications and backend systems, reducing data fetch times by **40%**.\n• Utilized **WebSocket** technology for real-time updates in user interfaces, significantly enhancing responsiveness and user satisfaction during critical financial transactions.\n• Developed and maintained unit and integration tests using **Cypress** and **Vitest**, ensuring a code quality score of **95%** and reducing bugs in production.\n• Engaged in UI/UX testing with **Playwright** to optimize the user journey based on analytics, improving overall usability scores by **20%**.\n• Integrated AI components utilizing **OpenAI** and **Hugging Face** for enhanced user interactions, achieving a **15%** rise in user conversion rates directly attributed to personalized experiences.\n• Worked with design tools like **Figma** and **Framer** to iterate on prototypes, ensuring timely delivery of features ahead of schedule by at least **10%**."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Utilized **React (18)** and **Next.js** to design and implement dynamic frontend applications, ensuring high responsiveness and usability across web and mobile platforms.\nDeveloped interactive and engaging **UI/UX** elements, enhancing user experience with **animation** techniques and tools like **Figma** and **Framer**.\nIntegrated state management solutions such as **TypeScript** and **Redux Toolkit** to create scalable applications, optimizing performance and maintainability.\nCreated and maintained highly efficient WebSocket connections to enhance dynamic data fetching, providing real-time features for user interactions and notifications.\nImplemented RESTful and **GraphQL** APIs to facilitate seamless data communication between the frontend and backend, fostering improved application performance and enhanced data management.\nCollaborated with backend teams to integrate AI features using **OpenAI** and **Hugging Face** models, enhancing application capabilities with personalized user experiences based on behavioral data.\nDeveloped comprehensive testing strategies utilizing **Cypress**, **Vitest**, and **Playwright** to ensure reliable application performance and user experiences across varying conditions.\nUtilized **Tailwind CSS** for responsive designs, ensuring adherence to accessibility standards (WCAG 2.1) and fostering an inclusive user environment.\nParticipated in code reviews and contributed to the project documentation to maintain coding standards and share knowledge effectively across the team.\nMentored junior developers by sharing expertise in modern JavaScript frameworks and best practices, contributing to a collaborative and growth-oriented team culture."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, React Three Fiber, Storybook, Radix UI, Tailwind\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **API Technologies:**\n\tREST, GraphQL, WebSocket\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tAI, Machine Learning, OpenAI, Hugging Face, LangChain, Stable Diffusion, ComfyUI, Midjourney, WebGL, Three.js, animation, UI/UX, Playwright, Vitest, Cypress, Figma, Framer",
  "apply_company": "Noxx"
}