{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Data Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Data Engineer with 10+ years of experience in delivering high-performance data solutions in the healthcare and finance sectors. Proficient in **Python**, **TypeScript**, and expert in data analytics using **Google Cloud Platform** and **BigQuery**. Skilled in utilizing **React** and **Vue** for building user interfaces, and adept in ETL processes to ensure efficient data processing. Deep understanding of **OAuth 2.0** and **OpenID Connect** for secure authentication and authorization in data handling.\nExperienced in implementing security best practices to comply with industry standards. A strong foundation in full-stack development enhances my ability to integrate data-driven applications seamlessly, while my hands-on practice in designing and deploying scalable solutions fosters real-world impact. Passionate about leveraging data analytics and BI tools to drive informed decision-making in organizations.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Utilized **Python** and **TypeScript** to design and implement data solutions on **Google Cloud Platform** for real-time data processing and analytics, optimizing ETL workflows for large datasets.\n• Leveraged **BigQuery** for efficient data warehousing and querying, reducing query times by **30%** compared to previous solutions.\n• Developed interactive dashboards using **BI tools** like Power BI, delivering actionable insights and advanced data visualizations for business users, enhancing decision-making processes.\n• Implemented robust security measures following best practices, ensuring data integrity and compliance with standards such as OAuth 2.0 and OpenID Connect across data applications.\n• Collaborated with cross-functional teams to define data requirements and analytics strategies, contributing to enhanced data-driven decisions across multiple departments.\n• Created and managed cloud-based data processing pipelines designed for scalability, reliability, and maintainability using modern frameworks.\n• Analyzed and optimized data models, improving performance and storage efficiency by **40%**, leveraging tools for data analytics to extract meaningful patterns from complex datasets.\n• Established continuous integration and deployment (CI/CD) processes within data projects, utilizing version control strategies to streamline development and reduce errors.\n• Engaged in regular code reviews to maintain high code quality and ensure alignment with organizational standards, applying secure coding practices.\n• Conducted training sessions for team members on the usage of **React** and **Vue** for data visualization and interactive reporting, fostering a culture of knowledge sharing within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Leveraged **Python** and **TypeScript** to enhance data processing capabilities and drive analytics initiatives in the financial sector.\nDesigned and implemented **ETL** processes using **Apache Airflow** and **Google Cloud Platform**, facilitating efficient data ingestion and transformation from various sources.\nUtilized **BigQuery** for scalable data storage and analytics, enabling rapid query execution on large datasets and supporting data-driven decision-making.\nDeveloped interactive dashboards and reporting tools using **React**, **Vue**, and BI tools, enhancing data visualization and accessibility for stakeholders.\nEnsured compliance with security best practices including **OAuth 2.0** and **OpenID Connect**, safeguarding user data and transaction security across all applications.\nOptimized data workflows to improve efficiency by **30%**, resulting in faster access to real-time insights for operational teams.\nEngaged in regular performance tuning, achieving a **20%** reduction in processing time for ETL jobs through pipeline optimization and resource management.\nCollaborated with cross-functional teams to implement data analytics solutions that improved fraud detection accuracy by **25%**, safeguarding financial transactions."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **TypeScript** to design and optimize data solutions, ensuring seamless integration with **Google Cloud Platform** for enhanced data processing capabilities.\nImplemented robust ETL processes using **BigQuery**, leading to a 30% increase in data retrieval efficiency and enabling real-time analytics for business intelligence.\nDeveloped interactive dashboards and reporting tools utilizing **React** and **Vue**, improving data visualization and accelerating decision-making processes by up to 40%.\nApplied security best practices and protocols such as **OAuth 2.0** and **OpenID Connect** to safeguard data access, achieving compliance with GDPR throughout project deliverables.\nEngineered data pipelines capable of processing over **1 million** records daily, speeding up data transformation tasks with a focus on scalability and performance.\nCollaborated with cross-functional teams to establish data governance policies, ensuring proper usage and ownership of data across all platforms.\nConducted thorough data analysis and provided insights using **BI tools**, driving strategic initiatives that resulted in a 20% increase in revenue year-over-year.\nExecuted regular audits of security frameworks, reducing vulnerabilities by **25%** through proactive monitoring and enhancements.\nUtilized cutting-edge data modeling techniques that brought down data retrieval times by **15%**, directly benefiting the operational efficiency of analytics tools."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tOAuth 2.0, OpenID Connect\n\n**Serverless and Cloud Functions:**\n\tGoogle Cloud Platform\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, BigQuery\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence & Machine Learning, MLflow, Airflow, Kubeflow, Data Analytics, BI tools, Security best practices, Keycloak (OIDC, RBAC), JWT, Let’s Encrypt, Nginx, Certbot, ETL",
  "apply_company": "Signify"
}