{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer (Ruby on Rails)",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience specializing in **Ruby on Rails**, APIs, and third-party integrations to deliver high-performance chat-driven experiences. Proven ability to design and implement security by design principles, ensuring compliance with industry standards. Adept at cross-functional collaboration and technical strategy, with extensive background in conducting code reviews and providing mentorship to junior developers.\n\nSkilled in both frontend and backend development utilizing a wide range of technologies, including **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in deploying cloud-native systems across **AWS** and **Azure** environments and implementing microservices, event-driven architectures, and CI/CD pipelines. Demonstrated expertise in building AI/ML-powered platforms that support predictive analytics, automation, and real-time processing while ensuring robust compliance with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong MLOps background, proficient in model training and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer (Ruby on Rails)",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained **Ruby on Rails** applications following **security by design** principles to ensure compliance with industry standards, enhancing overall system security.\nLed **APIs** design and integration, focusing on **third-party integrations** with services such as **Slack API** and **Teams API**, creating seamless **chat-driven experiences**.\nCollaborated with cross-functional teams to define and implement **technical strategy** and **architecture design**, enabling efficient workflows and robust application performance.\nConducted code reviews and provided mentorship to junior engineers, fostering a culture of excellence and continuous improvement.\nImplemented **background jobs** and managed **event flows** to optimize app performance, resulting in a **20%** increase in response times across key functionalities.\nDesigned and integrated webhooks for real-time data processing, generating efficient and scalable data flow between systems.\nDeveloped automated testing strategies to ensure quality and reliability, covering unit, integration, and E2E tests, thereby reducing bugs by **30%** post-deployment.\nActively participated in designing and refining **IdP integration** for streamlined user authentication processes, improving user experience and security compliance.\nSpearheaded collaboration efforts that utilized **AI Agents Runtime** to enhance processing capabilities, focusing on intelligent data handling and decision-making.\nSupported long-term vision and tactical execution by implementing AI-driven features that serve unique client needs through innovative solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged advanced technical strategy by modernizing core financial platforms through backend enhancements using **Ruby on Rails**, ensuring compliance and security by design.\nImplemented robust APIs and third-party integrations, including **Slack API** and **Teams API**, to facilitate seamless communication and collaboration across teams.\nDesigned architecture for event flows to manage background jobs effectively, enhancing system performance and reliability in high-volume transaction environments.\nLed cross-functional collaboration efforts, providing mentorship and conducting code reviews to uphold coding standards and foster a culture of continuous improvement.\nDeveloped and maintained chat-driven experiences utilizing **webhooks** to enhance user engagement while ensuring seamless integration with existing systems.\nFacilitated compliance measures in code execution and system architecture, ensuring alignment with industry best practices and regulatory requirements.\nSuccessfully implemented AI-driven features, driving innovation in financial applications and enabling chat interactions via **AI Agents Runtime**.\nOrchestrated development initiatives that resulted in a **30%** increase in application performance across key modules through strategic enhancements and optimization of workflows.\nChampioned the transition to **event-driven architecture** for sustained scalability, enabling improved response times and higher throughput in processing transactions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented technical strategy and architecture design for scalable backend services in **Ruby on Rails**, collaborating cross-functionally to integrate third-party services and APIs, ensuring compliance and security by design.\nEngineered and optimized chat-driven experiences by utilizing **Slack API** and **Teams API** for real-time communication features, improving user engagement by **30%** through integration of intuitive chatbot functionalities.\nDeveloped and maintained background jobs and event flows using **event-driven architecture** to ensure seamless data processing and responsiveness in high-demand scenarios, achieving uptime of **99.9%**.\nConducted regular code reviews and provided mentorship to junior developers, fostering best practices and maintaining code quality across all projects while supporting a culture of learning.\nDesigned secure IdP integration and webhooks to facilitate smooth user access and data exchange between disparate systems, contributing to enhanced user experience and operational efficiency.\nCollaborated in implementing compliance protocols to align with industry regulations, ensuring all systems met necessary security standards and guidelines, leading to **100%** compliance during audits.\nParticipated in cross-functional project teams to leverage AI agents runtime for creating intelligent solutions, enhancing personalization and user experience in applications.\nLeveraged robust APIs for seamless integration with various platforms, streamlining workflows and facilitating a more efficient data exchange process.\nContributed to the design of responsive user interfaces, promoting accessibility and enhancing overall usability of applications, receiving positive feedback from users on ease of navigation."
    }
  ],
  "skills": "**Backend Frameworks:\n\tRuby on Rails\n\n**Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:\n\tAPIs\n\tSlack API\n\tTeams API\n\tthird-party integrations\n\twebhooks\n\n**Other:\n\tAI Agents Runtime\n\tMLflow, Airflow, Kubeflow\n\tsecurity by design\n\tcompliance\n\tchat-driven experiences\n\tcross-functional collaboration\n\n**DevOps:\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\n**Cloud & Infrastructure:\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**Other:\n\tbackground jobs\n\tevent flows\n\tIdP integration\n\ttechnical strategy\n\tarchitecture design\n\tcode reviews\n\tmentorship\n"
}