{
  "name": "Tomasz Lee",
  "role_name": "Senior Solutions Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Solutions Engineer with 9+ years of experience in developing and implementing advanced applications, focusing on **APIs**, **cloud platforms**, **Docker**, and **Kubernetes**. Proficient in **speech-to-text**, **text-to-speech**, and **voice agent** technologies, ensuring seamless integration and self-hosted deployment solutions. Expertise in programming languages including **JavaScript**, **TypeScript**, and **Python**, complemented by strong skills in incident response, post-sales support, and performance tuning. Proven track record in collaborating across teams, providing exceptional customer communication, and leading development projects from concept to completion. Demonstrated ability to enhance system performance through automation, thorough documentation, WER analysis, model selection, and adherence to data privacy and enterprise security standards.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **APIs** to integrate speech-to-text and text-to-speech functionalities into existing solutions, enhancing user interaction and accessibility by 30%.\nDesigned and deployed scalable applications on **Docker** and **Kubernetes** to ensure seamless operations and effective resource management, achieving a reduction in downtime by 15%.\nImplemented performance tuning strategies by optimizing algorithms in **JavaScript**, **TypeScript**, and **Python**, resulting in a 20% enhancement in application performance metrics.\nCollaborated on post-sales support initiatives, providing technical guidance for a team of 5 engineers, improving customer communication and satisfaction scores by 25%.\nDeveloped a robust incident response plan aligned with **enterprise security** best practices, significantly increasing system reliability during high-demand scenarios.\nLed documentation efforts related to **self-hosted deployment** processes and user guides, decreasing onboarding time for new team members by 50%.\nConducted **WER analysis** and model selection to improve the accuracy of our voice agent deployments, achieving 90% recognition accuracy.\nEmployed automation techniques for repetitive tasks, reducing manual effort by 35% and contributing to efficient team collaboration across projects.\nEnsured compliance with **data privacy** regulations while delivering cloud solutions on **cloud platforms**, maintaining confidentiality and integrity of client data.\nEnforced effective customer communication protocols, leading to a significant improvement in response rates during support incidents."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to develop and enhance APIs for a cloud-based project management tool, aligning with the requirements for effective **cloud platforms** integration.\nImplemented **Docker** and **Kubernetes** for self-hosted deployment of microservices, resulting in a 15% increase in scalability and resource management efficiency.\nDesigned and developed a **speech-to-text** and **text-to-speech** voice agent feature, contributing to a 25% improvement in user experience.\nLed performance tuning initiatives which included integration of **Redis** as a caching layer, reducing API call latency by **25%**.\nConducted robust incident response measures during system outages, maintaining service reliability and ensuring compliance with **enterprise security** standards.\nCreated comprehensive documentation for **data privacy** protocols, significantly improving awareness and adherence during system deployments.\nCollaborated with cross-functional teams to define requirements and timelines, ensuring a **30%** reduction in project delivery timelines.\nManaged and optimized **MSSQL** and **MySQL** databases, improving query performance metrics by **40%**.\nFacilitated post-sales support, ensuring customer satisfaction and rapport while addressing technical concerns effectively.\nMentored junior developers on coding best practices, fostering team collaboration and enhancing overall productivity.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **APIs** to integrate voice capabilities such as **speech-to-text** and **text-to-speech**, enhancing user interaction in internal systems.\nImplemented **Docker** and **Kubernetes** for seamless **self-hosted deployment**, leading to a **30%** increase in deployment efficiency.\nLeveraged **cloud platforms** to optimize service scalability, achieving a **40%** reduction in infrastructure costs.\nOptimized application performance through **performance tuning**, directly contributing to a **15%** improvement in response times.\nDeveloped and maintained technical documentation to ensure data privacy and **enterprise security** compliance, enhancing knowledge transfer within the team.\nCollaborated with cross-functional teams for incident response and post-sales support, ensuring customer issues are resolved in a timely manner.\nManaged customer communications effectively, leading to improved client satisfaction and feedback.\nContinuous collaboration in team environments fostered enhancement of development processes and project alignment.\nAssisted in the selection and implementation of suitable models for better service automation, ensuring high-quality deliverables.\nFacilitated code reviews and shared best practices in **JavaScript** and **TypeScript**, reinforcing code quality across projects."
    }
  ],
  "skills": "***** Programming Languages\n\tJavaScript, TypeScript, Python\n\n***** Backend Frameworks\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n***** Frontend Frameworks\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n***** API Technologies\n\tRESTful API, GraphQL, APIs\n\n***** Serverless and Cloud Functions\n\tcloud platforms, self-hosted deployment\n\n***** Databases\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n***** DevOps\n\tAWS, Azure, Docker, Kubernetes, CI/CD pipelines, incident response\n\n***** Cloud & Infrastructure\n\tcloud platforms, enterprise security, data privacy\n\n***** Other\n\tUX/UI Design, Git, GitHub, Redux, performance tuning, WER analysis, model selection, automation, documentation, customer communication, team collaboration, post-sales support, speech-to-text, text-to-speech, voice agent\n",
  "apply_company": "Deepgram"
}