{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Software Engineer with 13+ years of experience in **frontend development** and **backend development**, specializing in **JavaScript**, **React**, **HTML**, **CSS**, and various testing libraries. Proven track record of optimizing performance and conducting performance profiling for high-demand applications. Exceptional skills in **cross-team collaboration** and **mentoring**, ensuring consistent communication and knowledge sharing across teams.\n\nExpertise in building and delivering scalable applications across healthcare and financial industries with a strong focus on UI/UX. Proficient in modern **tech stack** including **TypeScript**, **Python**, **Flutter**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Committed to aligning development practices with industry standards such as HIPAA and PCI DSS, while leveraging cloud technologies on **AWS** and **Azure**. Experienced in MLOps, employing tools like **MLflow**, **Airflow**, and **Kubeflow** for AI/ML project implementation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and optimized full-stack applications using **React** (17–18), **JavaScript**, **HTML**, and **CSS**, focusing on enhancing the user interface and experience for seamless frontend development.\n• Collaborated cross-functionally with teams to implement innovative solutions, facilitating effective communication that led to performance improvements and optimization of application functions.\n• Mentored junior developers, sharing insights on coding practices and promoting open-source contribution methodologies within the team.\n• Designed and executed robust testing strategies utilizing frameworks like Jest and Cypress to ensure comprehensive coverage of functionalities across various applications.\n• Played a key role in backend development, leveraging **Node.js** and **Python** (FastAPI) for building scalable microservices that meet set specifications.\n• Engaged in performance profiling and optimization techniques to enhance application responsiveness and overall speed.\n• Integrated user-centric features into applications, improving UI/UX and increasing user satisfaction and engagement metrics significantly.\n• Explored and implemented third-party testing libraries to ensure quality assurance across development projects, ensuring adherence to industry standards.\n• Supported the team in defining effective project workflow using Agile methodologies, fostering a culture of cross-team collaboration and continual improvement.\n• Maintained code quality and project integrity through rigorous code reviews and adherence to best practices, significantly reducing the number of bugs and deployment issues."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Collaborated cross-team to enhance **React (18)** applications by implementing performance profiling and optimization strategies to ensure seamless user experience in frontend development.\n- Utilized **JavaScript**, **HTML**, and **CSS** to design and implement intuitive UI/UX for web applications, resulting in a **30%** increase in user satisfaction metrics.\n- Mentored junior developers in modern frontend and backend development practices, enhancing team skill set and project delivery times by **25%**.\n- Spearheaded the integration of testing libraries to ensure robust application performance, reducing deployment issues by **20%**.\n- Contributed to open-source projects, boosting community engagement and strengthening technical skills in **Ruby** and **Go**.\n- Actively participated in code reviews and maintained high standards of written communication to ensure quality deliverables across multiple teams.\n- Optimized backend services for faster transaction processing using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, resulting in a **15%** improvement in performance for high-volume systems.\n- Developed and maintained documentation for features implemented, enhancing team communication and onboarding processes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Spearheaded **frontend development** by creating dynamic applications using **React (18)**, **JavaScript**, **HTML5**, and **CSS3**, ensuring fast, responsive user experiences across web and mobile platforms.\n- Collaborated cross-functionally with teams to ensure seamless integration between **frontend** and **backend development**, enhancing overall system performance and user satisfaction.\n- Conducted thorough **performance profiling** and **optimization** of applications, achieving a **30% reduction** in load time and improved user engagement.\n- Mentored junior developers in best practices of **UI/UX** design and coding standards, fostering a culture of continuous learning and open-source contribution.\n- Designed and optimized backend services using **Python (FastAPI, Django)** and **Node.js (NestJS, Express)**, ensuring scalability and performance across modules such as checkout and cart.\n- Implemented comprehensive testing libraries and practices to enhance application reliability and maintainability, reducing bugs by **25%** in production releases.\n- Developed a robust architecture leveraging **Redis** for caching and **MongoDB** for data storage, significant **20%** performance improvement in data retrieval processes.\n- Engaged in **verbal and written communication** with stakeholders to align on project status, roadmaps, and objectives, ensuring clarity and transparency across teams.\n- Actively participated in open-source initiatives to contribute to community-driven projects, enhancing both personal and organizational visibility within the tech landscape."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, Ruby, Go\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tHTML, CSS, frontend development, backend development, testing libraries, UI/UX, cross-team collaboration, mentoring, performance profiling, optimization, open-source contribution, verbal communication, written communication, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}