{
  "name": "Rei Taro",
  "role_name": "Senior Data Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Data Engineer with over 10 years of experience in ETL processes, Data Warehousing, and cloud-based solutions. Proficient in utilizing **AWS**, **Azure**, and **Snowflake** to build and optimize data pipelines. Skilled in Agile methodologies including **Scrum** and **Kanban**, ensuring timely delivery of high-quality projects. Expertise in Data Modelling techniques such as **Kimball**, **Inmon**, and **Data Vault**. Strong background in automation and deploying scalable data solutions, complemented by a proven ability to collaborate with stakeholders and communicate complex concepts effectively. Previous contributions to significant projects at leading firms, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **AWS** and **Azure** to deploy and manage ETL processes, optimizing data extraction, transformation, and loading in **Snowflake**.\nDesigned and implemented data models using principles from **Kimball**, **Inmon**, and **Data Vault** to support robust data warehousing solutions, facilitating data-driven decision-making.\nEngineered ETL workflows with **Apache Airflow** for automated data pipelines, ensuring consistent data quality with a processing rate of over **1 million** transactions per day.\nApplied Agile methodologies and participated in **Scrum** and **Kanban** processes to improve project timelines and stakeholder engagement.\nDeveloped and maintained relational databases and efficiently integrated with third-party API data sources, fostering a seamless data environment and reducing query times by **30%**.\nLed cross-functional and stakeholder meetings to communicate progress and gather requirements, enhancing collaborative efforts and project outcomes.\nImplemented DevOps practices, leveraging tools like Terraform for infrastructure as code, resulting in a deployment success rate of over **95%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "- Developed and maintained ETL processes for extracting, transforming, and loading data into **Snowflake**, ensuring efficient data warehouse performance.\n- Engineered data engineering solutions on **AWS** and **Azure** platforms, enabling secure and scalable data integrations and analytics.\n- Collaborated within Agile methodologies such as **Scrum** and **Kanban** to enhance team productivity and deliver quality data services on time.\n- Created and optimized data models based on **Kimball**, **Inmon**, and **Data Vault** methodologies, improving data accessibility and reporting capabilities.\n- Implemented automation strategies using **Python**, **FastAPI**, and **Apache Airflow** to streamline data workflows and enhance operational efficiency.\n- Successfully deployed and monitored data pipelines and microservices on **Azure App Services** using **Terraform** for infrastructure as code, achieving a **30%** reduction in deployment times.\n- Conducted regular security audits to maintain compliance with industry standards, integrating **OAuth2** and **Azure AD B2C** for managing authentication and access control securely.\n- Facilitated effective communication and stakeholder management across various teams to ensure alignment on project objectives and successful delivery of data products."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Designed and implemented ETL processes utilizing **AWS** and **Azure** cloud services for integrating data into a robust **Data Warehouse** architecture, enhancing data accessibility by **40%**.\n• Developed data models based on **Kimball** and **Inmon** methodologies to structure data effectively, facilitating improved reporting capabilities and analysis.\n• Leveraged **Snowflake** for scalable storage solutions, optimizing data retrieval speeds by **25%** through efficient querying strategies.\n• Automated data pipelines and workflows, reducing data processing time by **30%** through innovative **DevOps** practices and scripting solutions.\n• Collaborated in agile teams using **Scrum** and **Kanban** methodologies to ensure project milestones are met on time, resulting in a **15%** increase in team productivity.\n• Developed and maintained relational databases with a focus on optimization and performance tuning, resolving database issues, achieving uptime of **99.9%**.\n• Communicated effectively with stakeholders to gather requirements and ensure alignment on project objectives, enhancing stakeholder satisfaction by **20%**.\n• Engaged in problem-solving discussions to address data quality issues and implement solutions swiftly, utilizing critical thinking to enhance data reliability.\n"
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, Data Warehouse, Snowflake, Relational Databases\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Automation, Agile, Scrum, Kanban, DevOps\n\n **Cloud & Infrastructure**\n\tAWS, Azure\n\n **Other**\n\tETL, Data Modelling, Kimball, Inmon, Data Vault, Problem-solving, Communication, Stakeholder Management",
  "apply_company": "Zurich Insurance"
}