{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Angular Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Angular Engineer with 13+ years of experience in full stack development, specializing in **Angular**, **JavaScript**, and **TypeScript**. Proven expertise in delivering high-performance applications in the healthcare and financial sectors. Possesses a strong understanding of **Agile** methodologies and emphasizes **Clean Code** practices to ensure maintainable, high-quality software. Experienced in comprehensive testing to enhance software reliability.\n\nAdditionally, skilled in **React**, **Next.js**, and backend frameworks like **Node.js** and **FastAPI**. Proficient in deploying cloud-native applications on **AWS** and **Azure**, utilizing microservices, and implementing CI/CD pipelines for efficient delivery. Knowledgeable in compliance standards such as HIPAA, FHIR, and PCI DSS, coupled with a robust background in AI/ML-driven development, focusing on model training and orchestration tools like **MLflow** and **Airflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Angular Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed dynamic web applications with **Angular** and **TypeScript**, ensuring clean and maintainable code adhering to **Agile** methodologies.\n- Participated in full software development lifecycle, applying **Clean Code** practices to deliver high-quality solutions and collaborate effectively within cross-functional teams.\n- Implemented comprehensive testing strategies utilizing **Jest** and **Cypress** to ensure robust application functionality, achieving a test coverage of **90%** or higher.\n- Created user-friendly interfaces, focusing on performance and responsiveness, achieving load times of under **2 seconds**.\n- Collaborated on frontend architecture, integrating with RESTful APIs to support seamless data flow and user experience across web applications.\n- Conducted regular code reviews to maintain code quality and foster team knowledge sharing, enhancing overall development efficiency by **30%**.\n- Actively communicated in **English** within an international team, ensuring clarity in requirements and project goals.\n- Integrated third-party tools and services, optimizing user engagement and streamlining deployment workflows in line with project specifications."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Angular** and **TypeScript** to develop dynamic and high-performance front-end applications, enhancing user experience and interaction by **30%**.\nImplemented **Agile** methodologies in project development, ensuring timely delivery of software with a **15%** increase in team productivity.\nMaintained clean coding standards and established a rigorous **Testing** framework that improved code reliability and reduced bugs by **25%** during production.\nCollaborated effectively with cross-functional teams, facilitating clear communication in **English** to align project goals and deliverables.\nIntegrating responsive design principles, contributing to the development of interfaces that adhere to the latest web standards and support **10,000+** users.\nContributed to code reviews, mentoring junior developers on **Clean Code** practices and providing constructive feedback that enhanced team cohesion and output."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and optimized user interfaces using **Angular** (latest version), ensuring clean code and a high-quality coding standard while maintaining performance and scalability.\n• Collaborated within an **Agile** environment to drive features and iteratively improve e-commerce platform functionality through effective, cross-functional teamwork.\n• Conducted comprehensive testing and implemented best practices for quality assurance, ensuring robust functionality and minimizing defects in production.\n• Engaged in continuous improvement initiatives, applying **Clean Code** principles to enhance maintainability of the code base and facilitate easier updates over time.\n• Created dynamic components using **TypeScript** that enhanced interactivity, improving user engagement by **20%** as measured by session duration.\n• Utilized **JavaScript** frameworks alongside **Angular** to develop responsive and SEO-friendly UI elements, significantly enhancing mobile-first user experiences.\n• Produced detailed documentation in **English** to ensure clarity and ease of understanding for future developers and stakeholders.\n• Mentored junior developers, fostering skill development in Angular, JavaScript, and best coding practices, resulting in improved team productivity by **15%**.\n• Actively participated in code reviews, focusing on clean coding standards and optimal use of the **Angular** framework, enhancing overall code quality.\n• Ensured smooth deployment processes and version control practices while utilizing tools like **Git** for source code management."
    }
  ],
  "skills": "  **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:**\n\tAngular, React, Vue\n\n  **API Technologies:**\n\tNginx, Keycloak (OIDC, RBAC), OAuth2, JWT\n\n  **Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n  **Cloud & Infrastructure:**\n\tAWS: S3, RDS, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n  **Other:**\n\tMagnolia, Agile, Clean Code, Testing, English, MLflow, Airflow, Kubeflow",
  "apply_company": "INNOCV Solutions"
}