{
  "name": "Mariusz Jan Skobel",
  "role_name": "Data Scientist",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Data Scientist with 10+ years of experience leveraging advanced analytics and machine learning to drive impactful decisions in healthcare and finance. Proficient in **Python**, specializing in **Machine Learning**, **Data Analysis**, **SQL**, and **Statistics**. Skilled in data manipulation and quantitative analysis, employing techniques such as **Uplift Modeling**, **A/B Testing**, and **Geospatial Analytics** to extract insights from complex datasets. Proven ability to implement machine learning models and conduct thorough data analysis to support strategic initiatives. \n \nExperienced in full stack development with a strong background in modern technologies including **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept at building and deploying cloud-native applications on **Azure** and **AWS**, enhancing the capabilities of enterprise platforms with integrated AI/ML functionalities. Recognized for strong skills in microservices architecture, event-driven systems, and CI/CD automation, delivering secure and compliant solutions aligned with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about developing systems that not only leverage cutting-edge technology but also create a tangible impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Data Scientist",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tApplied **Python** and SQL for conducting comprehensive data analysis, enabling insightful decision-making through robust statistics and quantitative analysis.\n•\tEmployed machine learning techniques for predictive modeling, including **uplift modeling** and **A/B testing**, to evaluate data-driven strategies and optimize outcomes.\n•\tUtilized **data manipulation** techniques to preprocess and analyze datasets, ensuring high-quality input for machine learning algorithms.\n•\tConducted geospatial analysis to derive insights from geographical data, leveraging statistical methods to inform business strategies.\n•\tCollaborated with cross-functional teams to integrate machine learning models into production systems, enhancing the predictive capabilities of applications used in healthcare and finance.\n•\tLed initiatives to establish validation processes for statistical models, ensuring compliance with best practices and regulatory standards.\n•\tImplemented data visualization tools to effectively communicate findings and support strategic decision-making, utilizing **Power BI** and other visualization technologies.\n•\tLeveraged advanced analytics to uncover patterns and trends in complex datasets, establishing a framework for ongoing data-driven analysis and reporting.\n•\tEstablished rigorous testing strategies using tools like **Jest** and **PyTest** to ensure the reliability of machine learning models and data analysis pipelines.\n•\tDelivered insights on various business operations by integrating findings from network analysis, which contributed to enhanced operational efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Applied advanced **Machine Learning** techniques, including **scikit-learn** and **XGBoost**, to enhance financial platforms by analyzing transaction patterns and user behavior for proactive fraud detection.\nConducted **Data Analysis** using **Python** (version 3.8), leveraging **SQL** for efficient data manipulation and extraction from large datasets to provide actionable insights for business decisions.\nUtilized statistical methods and **Geospatial Analytics** to quantify and visualize user interaction trends, resulting in a 15% improvement in user satisfaction scores based on A/B Testing results.\nDeveloped and optimized data workflows by building ETL pipelines using **Apache Airflow** and **Azure Data Factory**, enabling seamless real-time and batch processing of financial data from over 10 external sources.\nImplemented **Uplift Modeling** techniques to predict customer behavior based on historical data, achieving a 20% increase in targeted campaign effectiveness.\nExecuted comprehensive **Quantitative Analysis** by creating interactive dashboards with **Power BI Embedded** and **D3.js** to facilitate real-time monitoring of financial activities for stakeholders.\nEngaged in continuous improvement of models for credit scoring and churn prediction, integrating findings into existing frameworks for better strategic planning and decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Conducted **data analysis** to derive actionable insights using **Python** and SQL, leading to improved decision-making for product strategies in **e-commerce**.\n• Developed and implemented **machine learning** models, including **uplift modeling** and **A/B testing**, enhancing user experience and increasing engagement by up to **25%**.\n• Utilized **geospatial analytics** to analyze user behaviors based on location, influencing marketing campaigns that drove a **15%** increase in conversion rates.\n• Performed rigorous **quantitative analysis** and **data manipulation** to streamline the data pipeline, resulting in a **30%** reduction in processing time for real-time analytics.\n• Collaborated with cross-functional teams to integrate statistical models into **Python** applications, empowering teams with data-driven insights for product feature enhancements.\n• Created visualizations and reports that translated complex data findings into user-friendly formats, improving data accessibility across departments by **40%**.\n• Engaged in statistical evaluations that informed high-stakes decisions, directly impacting project outcomes in line with business objectives.\n• Reinforced data integrity and accuracy through meticulous data validation and cleaning processes, ensuring high-quality data utilization for predictive modeling."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Data Analysis, Statistics, Geospatial Analytics, Network Analysis, Uplift Modeling, A/B Testing, Data Manipulation, Quantitative Analysis, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot"
}