{
  "name": "Rei Taro",
  "role_name": "Lead Android Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Proficient in **Android**, **Kotlin**, and **Java**, with a strong foundation in creating robust **RESTful APIs** and employing **Agile** methodologies. Recognized for technical leadership and team management skills, fostering a collaborative environment to drive high-quality software development. Experienced Senior Backend Developer with over 10 years of expertise in designing and delivering backend systems, particularly in financial platforms and AI/ML pipelines. Proven ability to deliver high-performing services using technologies such as Python (**FastAPI**, **Django**, **Flask**) and cloud platforms like **AWS** and **Azure**. A track record of significant contributions to impactful projects at top-tier organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Lead Android Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Designed and developed high-quality **RESTful APIs** for mobile applications using **Java** and **Kotlin**, enhancing API performance by **25%**.\nLed technical leadership initiatives within an Agile environment, fostering team collaboration and meeting project milestones consistently, achieving **95%** on-time delivery.\nImplemented architectural patterns including **MVC**, **MVVM**, and **MVP** to optimize code maintainability and scalability of Android applications.\nConducted code reviews and provided mentorship to junior developers, resulting in a **30%** decrease in onboarding time for new team members.\nEnhanced application performance through strategic profiling and optimization techniques, leading to an overall **15%** reduction in app crashes.\nCollaborated cross-functionally to align on project goals and executions, ensuring adherence to best practices and compliance across all engineering efforts.\nCoordinated sprint planning and retrospectives, improving team efficiency and output quality by implementing Agile methodologies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Led the design and development of high-performance mobile applications for Android, employing **Java** and **Kotlin** to ensure responsive and intuitive user experiences.\nUtilized **RESTful APIs** for seamless data integration, enhancing application functionality and user engagement by up to **30%**.\nImplemented Agile methodologies to facilitate iterative development and continuous improvement, resulting in a **20%** reduction in project delivery time.\nProvided technical leadership to cross-functional teams, fostering collaboration and innovation to drive project success and maintain quality standards.\nChallenged existing workflows through MVC, MVVM, and MVP design patterns, optimizing performance and code maintainability.\nConducted thorough code reviews and mentoring sessions leading to a **15%** increase in team performance and coding standards adherence.\nManaged project timelines and resources effectively, ensuring on-time milestone achievement and adherence to project budgets."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Led the development of mobile applications using **Android** and **Kotlin** to enhance user engagement and application performance.\nOversaw the implementation of **RESTful APIs** to integrate backend services, ensuring efficient data flow for a seamless user experience.\nManaged the transition of application architecture utilizing **MVVM** and **MVP** patterns, resulting in a 30% increase in maintainability and scalability of applications.\nDirected technical leadership initiatives to foster team collaboration and improve project workflows within an **Agile** framework, increasing project delivery speed by 25%.\nEnsured adherence to coding standards and best practices, conducting regular code reviews to maintain code quality across **Java** and **Android** projects.\nImplemented version control strategies, utilizing **Git** to track and manage code changes, ensuring better team coordination and project history.\nTrained and mentored a team of 15 engineers, promoting a culture of continuous learning and technical proficiency."
    }
  ],
  "skills": " **Programming Languages** \n\t Java, Kotlin, Python (3.8+), SQL, Bash, JavaScript \n\n **Backend Frameworks** \n\t FastAPI, Flask, Django, Celery \n\n **Frontend Frameworks** \n\t Android \n\n **API Technologies** \n\t REST/gRPC APIs, RESTful APIs \n\n **Serverless and Cloud Functions** \n\t AWS (EC2, S3, Lambda), Azure, Docker, Kubernetes, GitHub Actions, Azure DevOps \n\n **Databases** \n\t PostgreSQL, MySQL, MongoDB, Redis \n\n **DevOps** \n\t CI/CD, Git, PyTest \n\n **Cloud & Infrastructure** \n\t AWS (EC2, S3, Lambda), Azure, Docker, Kubernetes \n\n **Other** \n\t Agile, MVC, MVVM, MVP, Technical Leadership, Team Management, Microservices, Kafka, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow "
}