{
  "name": "Tomasz Lee",
  "role_name": "Python Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Python Developer with over 9 years of experience in application maintenance, developing integrations between operating systems, databases, and APIs. Proficient in **Python**, **Apache Airflow**, **Test-Driven Development**, **Pytest**, **Celery**, and **OOP principles**. Knowledgeable in using **Linux** and experienced with **Oracle** and **PostgreSQL** databases. Committed to utilizing best practices, including **SOLID principles** and design patterns to ensure robust, maintainable code. Strong focus on automating scheduler workflows while delivering efficient solutions. Known for a collaborative approach, advanced problem-solving skills, and the ability to lead projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Python Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** for developing robust applications, implementing **Test-Driven Development** and **Pytest** to ensure code quality and reliability.\nDesigned and developed **Apache Airflow** workflows for efficient **Scheduler workflow automation**, optimizing data processing jobs by **15%**.\nImplemented **Celery** for asynchronous task management, enhancing application performance and response times.\nApplied **OOP principles** and **SOLID principles** to create maintainable and scalable software solutions.\nManaged **Oracle** and **PostgreSQL** databases, providing seamless integrations between operating systems, databases, applications, and APIs.\nConducted application maintenance tasks, ensuring system stability and reliability while reducing downtime by **20%**.\nCollaboration with the QA team to perform automated tests, resulting in a **30%** decrease in bug incidence after deployment.\nEmployed various **design patterns** for building efficient and reusable components, improving software architecture.\nFluently communicated in **English**, ensuring effective collaboration with international teams and stakeholders.\nDemonstrated a **'do the things' attitude**, leading initiatives to drive project goals forward efficiently."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and maintained Python applications, ensuring seamless integration with **PostgreSQL** databases for real-time data retrieval, enhancing data access times by **20%**.\n• Implemented **Apache Airflow** for scheduler workflow automation, streamlining data pipeline processes and improving task scheduling efficiency by **30%**.\n• Led efforts in Test-Driven Development (TDD) utilizing **Pytest**, resulting in a **40%** reduction in bugs and improving code quality.\n• Integrated **Celery** for asynchronous task management, optimizing background task processing and decreasing task completion time by **15%**.\n• Applied Object-Oriented Programming (OOP) principles and **SOLID** design patterns to maintain scalable and reusable code architecture, enhancing team collaboration.\n• Managed the application maintenance lifecycle, ensuring optimal performance across various environments, with a focus on **Linux** operations.\n• Collaborated with cross-functional teams to define requirements and establish development timelines, achieving project milestones consistently.\n• Developed custom automation scripts for application deployment and integrations between various systems, databases, and APIs, improving interoperation by **25%**.\n• Conducted mentorship sessions for junior developers on best coding practices and design principles, fostering a productive team environment.\n• Engaged in code reviews and provided constructive feedback, ensuring adherence to coding standards and best practices."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **Apache Airflow** to develop and automate scheduler workflows, enhancing task execution efficiency by **30%**.\nImplemented **Celery** for asynchronous task management, which improved overall system responsiveness during peak operations.\nAdopted **Test-Driven Development (TDD)** practices using **Pytest**, ensuring high-quality code with a **95%** test coverage ratio.\nApplied **SOLID** principles and design patterns to create scalable and maintainable applications, which reduced technical debt by **40%**.\nConducted application maintenance and integration work between **Linux**, **Oracle**, and **PostgreSQL**, streamlining data flow and access across various systems.\nDemonstrated strong **English fluency** in communicating technical concepts and documentation to diverse teams, enhancing collaboration and understanding.\nEngaged in regular code reviews and team stand-ups to align closely with project objectives, fostering a collaborative development environment.\nExhibited a proactive "
    }
  ],
  "skills": "**Programming Languages**\n\tPython\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, CI/CD pipelines\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Oracle\n\n**DevOps**\n\tApplication maintenance, Scheduler workflow automation\n\n**Cloud & Infrastructure**\n\tLinux\n\n**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Apache Airflow, Test-Driven Development, Pytest, Celery, OOP principles, SOLID principles, Design patterns, English fluency, Integrations between operating systems/databases/applications/api, Do the things attitude"
}