{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Threat Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Threat Engineer with 8 years of extensive experience in security solutions, I specialize in leveraging advanced skills in **CI/CD**, **AWS**, **Azure**, **Cloud Security**, **Active Directory**, **Okta**, **SAML**, **OAuth**, **JWT**, **Splunk**, and **CrowdStrike**. My background includes building robust systems to enhance threat detection and incident response through automation, and applying analytical skills for thorough threat investigations and telemetry validation.\nI have a proven track record of developing enterprise-grade platforms across diverse sectors, utilizing **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, and **Node.js**. My deep cloud experience with **Azure**, **AWS**, and **GCP** complements my expertise in compliance standards including HIPAA and PCI DSS.\nAdditionally, I possess strong communication skills that facilitate collaboration across teams to implement effective security measures. My technical acumen includes developing machine learning pipelines and MLOps workflows with tools like **MLflow** and **Kubeflow**, ensuring high-performance and secure applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Threat Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Splunk** and **CrowdStrike** for monitoring and analytics to enhance incident response and threat investigations with a focus on real-time telemetry validation and automation.\nDeveloped and implemented security automation strategies, employing **SOAR** solutions to streamline incident response processes, significantly reducing response time by **30%**.\nDesigned and maintained secure cloud environments on **AWS** and **Azure**, ensuring robust **Cloud Security** measures are in place, and compliance with industry standards such as **CIS** and **NIST**.\nLed integration of multi-factor authentication and identity management solutions using **Okta**, **SAML**, and **OAuth**, enhancing access control security across enterprise applications.\nConducted in-depth forensic investigations utilizing tools like **FTK** and **Encase** to analyze security incidents, providing actionable insights with a **95%** success rate in case resolutions.\nDeveloped CI/CD pipelines for security tooling with a focus on vulnerability assessments, employing **GitHub Actions** and **Azure DevOps** for continuous integration and deployment of security measures.\nCollaborated with cross-functional teams, enhancing communication skills to convey security practices across departments, improving overall security posture by **25%**.\nPlayed a key role in threat detection development, utilizing **Microsoft Defender** and advanced telemetry to create detection rules for emerging threats.\nFacilitated regular security awareness training sessions leading to a **40%** reduction in phishing incidents among employees, demonstrating advanced analytical skills in evaluating training effectiveness.\nIntegrated **ServiceNow** for streamlined incident management, enabling tracking and reporting capabilities for incidents and response measures across the organization.\nImplemented and tested malware prevention strategies to safeguard organizational infrastructure with a **99%** effectiveness rate in blocking threats.\nEngaged in Purple Team exercises to enhance threat detection capabilities and security response, fostering a collaborative approach to cybersecurity incident handling."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Executed comprehensive **Threat Investigations** leveraging tools such as **Splunk** and **CrowdStrike** to identify vulnerabilities and enhance our security posture, ensuring a zero-trust architecture.\nImplemented and monitored **Incident Response** strategies, utilizing platforms like **Azure Sentinel** and **ServiceNow** to effectively manage security incidents across a scale of **9,000+** endpoints.\nDeveloped automated workflows using **SOAR** tools, leading to a **30%** reduction in mean time to resolution (MTTR) for critical security incidents through effective **Automation**.\nConfigured and maintained **Cloud Security** services on **AWS**, **Azure**, and **GCP**, ensuring compliance and adherence to organizational standards while managing resources across multiple environments.\nIntegrated **Active Directory**, **Okta**, and **SAML/OAuth** protocols to streamline identity management for **M365** users, enhancing secure access and improving user experience by **25%**.\nDesigned and implemented telemetry validation frameworks to assess and improve the efficacy of **Malware Prevention** measures, identifying and mitigating threats proactively based on analytics and **EDR** data.\nConducted **Forensic Tool** analyses using **FTK** and **Encase**, leading investigations into security breaches and developing reports that have been pivotal in refining security strategies.\nCollaborated with teams to develop detection rules and enhance monitoring capabilities using industry best practices and tools, significantly increasing threat detection capabilities by **40%**.\nFostered strong communication channels across teams to improve collaboration in **Purple Team** activities, ensuring seamless coordination between offensive and defensive security strategies."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and integrated advanced **SIEM** and **SOAR** solutions using **Splunk** and **Sentinel** for real-time threat detection and incident response, enhancing security posture across the organization.\nLeveraged **CrowdStrike** and **Microsoft Defender** to implement endpoint detection and response (**EDR**) mechanisms, ensuring comprehensive malware prevention and threat mitigation by analyzing over **5,000** incidents per month.\nExecuted effective **Cloud Security** strategies on **AWS**, **Azure**, and **GCP**, resulting in a **30%** reduction in cloud vulnerability exposure and aligning security compliance with industry standards.\nCollaborated with **Active Directory** and **Okta** to streamline identity and access management, facilitating secure authentication using **SAML**, **OAuth**, and **JWT** protocols for over **10,000** users.\nUtilized **M365** security tools and frameworks to conduct thorough threat investigations and make data-driven security improvements, enhancing organizational readiness against cyber threats by **25%**.\nApplied forensic tools like **FTK** and **Encase** to perform in-depth analysis and validation of telemetry data, driving **100%** accuracy rate in incident forensic analyses.\nEnhanced **automation** processes through CI/CD pipelines in collaboration with security and development teams, which reduced manual tasks by **40%** and accelerated threat detection times.\nParticipated in **Purple Team** exercises, honing detection development skills and ensuring knowledge transfer between offensive and defensive teams to strengthen overall incident response capabilities.\nActively engaged in **communication** with stakeholders regarding threat landscapes and incident responses, ensuring transparency and fostering a proactive security environment.\nDeveloped automated reporting and analytical capabilities, leveraging **ServiceNow** for seamless incident tracking and resolution, improving response times by **15%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT, SAML\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, GCP, Cloud Security\n\n **Other:**\n\tSIEM, SOAR, CrowdStrike, Splunk, Sentinel, EDR, Microsoft Defender, Active Directory, Okta, M365, Forensic Tools, FTK, Encase, ServiceNow, Malware Prevention, Telemetry Validation, Incident Response, Threat Investigations, Detection Development, Automation, Analytical Skills, Communication Skills, Purple Team",
  "apply_company": "Reinsurance Group of America, Incorporated"
}