{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Innovative Senior Backend Developer with 9+ years of experience in building high-performance applications utilizing **Java 17**, **Dropwizard**, and **Restler**. Proficient in **MongoDB**, **ClickHouse**, **Redis**, **Apache Kafka**, and **Kafka Streams**, with a strong focus on **Elasticsearch** and **OpenSearch** for data management. Experienced in implementing **CI/CD** pipelines, orchestrating **Airflow** workflows, and applying **Test-Driven Development** alongside A/B testing strategies. Well-versed in distributed systems, leveraging analytical and problem-solving skills to drive project success. A collaborative team player with excellent communication skills and a strong sense of empathy, dedicated to optimizing performance and delivering robust, scalable solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Java 17** and **Dropwizard** to develop robust backend services, enhancing system performance and scalability.\nDesigned and implemented microservices architecture to support distributed systems, ensuring efficient service communication and maintenance.\nIntegrated **MongoDB** and **ClickHouse** for optimal data storage solutions, improving data retrieval times by **30%**.\nLeveraged **Redis** for efficient caching to reduce database load and increase response times by **35%**.\nImplemented **Apache Kafka** and **Kafka Streams** for real-time data processing, improving data handling and processing throughput.\nDeveloped RESTful APIs for seamless integration and interaction with frontend applications.\nExecuted CI/CD pipelines using **Cloud Infrastructure** tools, decreasing deployment times by **40%**.\nDesigned and conducted A/B testing for feature validation, leading to an improvement in user engagement metrics by **20%**.\nApplied test-driven development practices to enhance code quality and reliability across the codebase.\nCollaborated with cross-functional teams to ensure alignment on project goals, enhancing team communication and productivity.\nUtilized **Elasticsearch** and **OpenSearch** for data indexing, resulting in optimized search functionalities.\nImplemented **Airflow** for workflow management, improving operational efficiency and automation of data pipelines."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed a cloud infrastructure leveraging **Java 17** and **Dropwizard** for robust backend services, leading to improved scalability and maintainability.\nImplemented **Restler** for streamlined RESTful API development, enhancing code efficiency and readability.\nArchitected microservices using **MongoDB** and integrated **ClickHouse** for high-performance data storage and retrieval, resulting in a **25%** reduction in data access time.\nUtilized **Redis** for caching to improve application response times, achieving a **30%** boost in user experience.\nDesigned and deployed distributed systems with **Apache Kafka** and **Kafka Streams** for real-time data processing, increasing system throughput.\nIntegrated **Elasticsearch** and **OpenSearch** for enhanced search capabilities, improving data retrieval speed by **40%**.\nLed the implementation of **Airflow** for improving data workflows, reducing processing times by **20%**.\nEstablished CI/CD pipelines to automate testing and deployment processes, decreasing time to market for new features by **15%**.\nCollaborated with cross-functional teams to refine development timelines and systems requirements, fostering a culture of communication and teamwork.\nConducted A/B testing and applied test-driven development (TDD) practices to ensure high code quality and strong user engagement.\nMentored junior developers in analytical thinking and problem-solving skills, enhancing overall team capability."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Java 17** and **Dropwizard** frameworks to design and develop robust backend services, enhancing system performance by **30%**.\nImplemented **MongoDB** and **ClickHouse** for efficient data storage and retrieval, reducing query response time by **40%**.\nIntegrated **Redis** for caching mechanisms that improved application speed and reduced latency during high traffic periods.\nDesigned and executed data pipelines with **Apache Kafka** and **Kafka Streams** to ensure reliable data streaming, handling up to **100,000** messages per second.\nConstructed and maintained metrics and logging systems using **Elasticsearch** and **OpenSearch**, resulting in improved debugging capabilities and operational insights.\nCollaborated cross-functionally with frontend and DevOps teams to establish **CI/CD** pipelines, enhancing deployment frequency by **50%**.\nConducted A/B testing to evaluate feature performance and usability, contributing to data-driven decision making in the product development lifecycle.\nAdvanced skills in **Test Driven Development (TDD)** to ensure code quality and system reliability with a **95%** code coverage.\nDemonstrated strong analytical and problem-solving skills to troubleshoot and resolve production issues efficiently.\nFostered a team-oriented environment by mentoring junior developers and facilitating knowledge sharing, enhancing overall team collaboration."
    }
  ],
  "skills": "*****Programming Languages*****\n\tJava 17, JavaScript, TypeScript, Python\n\n*****Backend Frameworks*****\n\tDropwizard, NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n*****Frontend Frameworks*****\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n*****API Technologies*****\n\tRESTful API, GraphQL\n\n*****Serverless and Cloud Functions*****\n\tAWS, Azure\n\n*****Databases*****\n\tMongoDB, MSSQL Server, MySQL, PostgreSQL, DynamoDB, CosmosDB, ClickHouse\n\n*****DevOps*****\n\tCI/CD, CI/CD pipelines, A/B testing, Test driven development\n\n*****Cloud & Infrastructure*****\n\tCloud infrastructure, Distributed systems\n\n*****Other*****\n\tAnalytical skills, Problem-solving skills, Team player, Communication skills, Empathy, UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Apache Kafka, Kafka Streams, Elasticsearch, OpenSearch, Airflow"
}