{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Mobile Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Mobile Engineer with 13+ years of expertise in **Xamarin**, **C#**, and **.NET** for mobile application development. Proven experience in Agile environments, utilizing **Agile**, **Scrum**, and a solid grasp of CI/CD practices to deliver robust software solutions efficiently. Strong proponent of software design patterns and adept at working in team settings, fostering collaboration and effective communication. Skilled in version control with **Git** and applying problem-solving techniques to overcome challenges in mobile development. Additionally, leveraging a strong foundation in frontend and backend development with **JavaScript/TypeScript**, **Python**, **Flutter**, and frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in AI/ML-powered platforms and cloud-native systems deployment on **AWS** and **Azure**, ensuring compliance with HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Mobile Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed mobile applications using **Xamarin** and **C#**, ensuring smooth integration with **.NET** frameworks and following Agile methodologies to enhance team productivity and project management.\nImplemented CI/CD pipelines for mobile applications through **Git** and automated testing environments to streamline development and reduce deployment time by **30%**.\nEmployed **MvvmCross** and software design patterns to create maintainable and scalable application architectures, significantly improving code reusability and collaboration among team members.\nLed team meetings within **Scrum** frameworks, ensuring effective communication and collaboration that resulted in improved project milestones and deadlines being met **9 out of 10** times.\nConducted thorough problem-solving sessions to address performance issues, enhancing app responsiveness and user experience by **25%**.\nActively contributed to team collaboration efforts, sharing knowledge on best practices and new technologies to foster a culture of continuous improvement.\nDefined and enforced robust testing strategies across mobile applications to ensure high-quality deliverables and maintain a >**95%** code coverage.\nIntegrated responsive UI elements and optimized application performance to ensure a seamless experience across multiple device resolutions and operating systems."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **C#**, **.NET**, and **Xamarin** for developing high-quality mobile applications, ensuring adherence to Agile methodologies in a **Scrum** environment to enhance team collaboration and project transparency.\nImplemented **CI/CD** pipelines to automate the build and deployment process, improving release cycles from weeks to days, achieving a **75%** reduction in deployment time.\nEngaged in thorough software design patterns to produce maintainable and scalable solutions, fostering a culture of problem-solving within the development team to tackle complex technical challenges.\nConducted code reviews and utilized **Git** for version control, which enhanced team communication and coordination while maintaining high-quality standards in the codebase.\nCollaborated closely with cross-functional teams to gather requirements, creating impactful user experiences through effective communication with stakeholders.\nEmployed **MvvmCross** to facilitate the implementation of MVVM design patterns in mobile app development, improving code reuse and testability across platforms.\n</br>Successfully delivered multiple features for mobile applications, leading to a customer satisfaction rate of **90%** and contributing to an annual revenue increase of **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Xamarin** and **C#** to develop cross-platform mobile applications, focusing on **.NET** frameworks to ensure a seamless user experience across multiple devices.\nEmployed **Agile** methodologies and **Scrum** practices to foster **team collaboration**, leading sprints and coordinating tasks effectively to ensure timely delivery of project milestones.\nImplemented CI/CD pipelines using **Git**, enabling continuous integration and deployment which reduced release cycles by **30%** and improved overall product quality.\nApplied software design patterns to enhance maintainability and readability of the codebase, securing a **15%** decrease in bug reports during testing phases.\nFacilitated regular communication within the team and across departments to ensure alignment on project objectives, reducing misunderstandings in project scope by **25%**.\nEngaged in problem-solving sessions to overcome technical challenges, boosting team efficiency and morale, demonstrating strong leadership in crisis management.\nAdopted **MvvmCross** framework for improved UI responsiveness and code sharing, achieving smoother transitions and faster load times in mobile applications.\nConducted code reviews and provided mentorship to junior developers, fostering a culture of growth and improving team skills by conducting knowledge-sharing sessions every **two weeks**."
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tPython\n\t•\tJavaScript/TypeScript\n\t•\tC#\n\n **Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\t•\t.NET\n\n **Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\t•\tXamarin\n\n **API Technologies:**\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\n **Serverless and Cloud Functions:**\n\t•\tAWS: ECS, Lambda\n\t•\tAzure: App Services\n\n **Databases:**\n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\t•\tRedis\n\n **DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\t•\tCI/CD\n\n **Cloud & Infrastructure:**\n\t•\tAWS: RDS\n\t•\tAzure: Blob Storage, SQL Database\n\n **Other:**\n\t•\tAgile\n\t•\tScrum\n\t•\tMvvmCross\n\t•\tsoftware design patterns\n\t•\tproblem-solving\n\t•\tteam collaboration\n\t•\tcommunication",
  "apply_company": "AMCS Group"
}