{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Frontend Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a seasoned Senior Frontend Engineer with 8+ years in software engineering, I bring a robust skill set in modern frontend technologies including **Vue.js**, **React**, **Angular**, **CSS**, **Tailwind CSS**, and **Bootstrap**. I am adept at creating responsive user interfaces utilizing **Figma**, **Sketch**, and design systems with **Storybook**. My proficiency in writing efficient **REST APIs** complements my frontend development expertise, ensuring seamless integration and enhanced user experience. Experienced with testing frameworks such as **Playwright**, **Cypress**, and **Jest**, I ensure the reliability and quality of my code. Additionally, I have experience with **.NET**, **C#**, and cloud platforms like **Azure**, further strengthening my full stack capabilities. My background in Python frameworks (FastAPI, Django, Flask), database management (PostgreSQL, MySQL, MongoDB), and microservices architecture enriches my approach to delivering high-performance solutions within the e-commerce, financial, and healthcare sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed responsive and dynamic user interfaces using **React** and **Vue.js**, ensuring cross-browser compatibility and adherence to modern design principles.\n• Collaborated with UX/UI designers using tools such as **Figma** and **Sketch** to translate wireframes into high-level code with **React** and **Angular**, focusing on performance and usability.\n• Implemented state management solutions using **Redux** and **NgRx** to enhance application performance and maintainability.\n• Created unit tests and integration tests with **Jest** and **Cypress**, resulting in a **30%** reduction in bugs and improved code reliability.\n• Utilized **Tailwind CSS** and **Bootstrap** for building visually appealing and mobile-first designs, improving development speed by **25%**.\n• Integrated **REST APIs** to ensure seamless data flow between frontend components and backend services, improving API response times by **15%**.\n• Spearheaded frontend development in SCRUM teams, collaborating closely with backend engineers to design and integrate microservice architectures within cloud environments, primarily **Azure**.\n• Enhanced application's UI by implementing responsive design using CSS Grid and Flexbox, ensuring optimal viewing experience across various devices.\n• Actively contributed to the repository management using **GitHub**, overseeing version control and collaborative workflows.\n• Participated in peer code reviews, fostering a culture of learning and improving code quality within the development team.\n• Adopted best practices in software development with an emphasis on automation and performance optimization, decreasing loading times by **20%**.\n• Provided mentorship to junior engineers on frontend technologies and design patterns, promoting knowledge sharing and skill enhancement across the team.\n• Conducted A/B testing on UI changes to gather user feedback and refine the user experience, leading to improved user engagement metrics."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed user-centric frontends using **Vue.js**, **React**, and **Angular**, ensuring responsive design with **CSS**, **Tailwind CSS**, and **Bootstrap** that enhanced usability scores by **30%**.\n• Designed and implemented RESTful APIs ensuring secure, efficient communication between frontend applications and backend systems, improving load times by **25%**.\n• Collaborated with design teams using **Figma** and **Sketch** to create engaging UI/UX for multiple applications, leading to a **40%** increase in user engagement.\n• Wrote automated tests using **Playwright** and **Cypress** to ensure frontend reliability and performance, achieving **95%** code coverage and enhancing deployment speed.\n• Leveraged **GitHub** for version control and CI/CD processes, integrating **Storybook** for UI components to streamline collaborative development by **50%**.\n• Refactored legacy **.NET** frameworks code, transitioning to modern frontend technologies while maintaining functionality and reducing technical debt by **60%**.\n• Implemented best practices in component architecture and state management using **Redux** and **NgRx**, improving application maintainability and resource efficiency.\n• Engaged with cross-functional teams to deliver scalable frontend solutions that interact seamlessly with financial services using strict compliance and security measures.\n• Ensured high performance and responsiveness of applications by employing efficient layouts utilizing **Flexbox** and **Grid** techniques, validated by user testing results.\n• Participated in code reviews, contributing to team knowledge and applying company coding standards that reduced bugs reported in production by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and optimized user-facing components using **Vue.js**, **React**, and **Angular**, resulting in a **30%** increase in application performance and user engagement.\nCollaborated with UX/UI designers, utilizing tools such as **Figma** and **Sketch**, to create responsive, mobile-friendly web applications that align with modern design principles.\nImplemented RESTful APIs integration in frontend projects ensuring smooth data transactions and interactions, contributing to a **25%** reduction in page load times.\nUtilized **CSS**, **Tailwind CSS**, and **Bootstrap** frameworks to ensure consistent styling and responsiveness across various device sizes, improving overall user experience.\nConducted testing and quality assurance with tools like **Playwright**, **Cypress**, and **Jest**, achieving **95%** test coverage and significantly enhancing code quality.\nEngaged in version control using **GitHub**, facilitating efficient collaboration and feature-based branching that increased team productivity by **20%**.\nDesigned modular and scalable frontend architectures leveraging **Grid** and **Flexbox** layouts for systematic component organization.\nImplemented cross-browser compatibility strategies to ensure functionality and accessibility on all major browsers, reducing user-reported issues by **15%**.\nContributed to the development of AI-driven features within applications, focusing on improving user interactions and personalized experiences.\nUtilized storytelling frameworks (such as Storybook) to document components, enabling better understanding and reusability across multiple projects.\nConducted regular code reviews to maintain coding standards and mentor junior developers, promoting a culture of continuous learning and improvement within the team."
    }
  ],
  "skills": " **Frontend Frameworks:**\n\tVue.js, React, Angular, Bootstrap, Tailwind CSS, CSS, Figma, Sketch, Playwright, Cypress, Jest, Storybook, Flexbox, Grid\n\n**Backend Frameworks:**\n\tPython (FastAPI, Django, Flask), SQLAlchemy, Pydantic, Celery, Spring Boot\n\n**API Technologies:**\n\tREST APIs, REST & gRPC APIs\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, GitHub\n\n**Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, AI tools, .NET, C#",
  "apply_company": "Neilson Financial Services"
}