{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience in **frontend development**, specializing in the creation of high-performance applications across healthcare and financial sectors. Expert in **modern frontend tooling** with proficiency in **React**, **Next.js**, and **Vue**, ensuring responsive design and an intuitive user experience. Adept in utilizing AI coding tools and prompt engineering for innovative solutions.\n\nDemonstrated capability in leading **code reviews** and providing technical guidance, fostering a collaborative team environment through effective communication and ownership of projects. Strong aptitude for making frontend architecture decisions, contributing to sprint planning, and promoting a culture of respect and authenticity.\n\nAdditionally skilled in backend technologies, including **JavaScript/TypeScript**, **Python**, **Node.js**, and frameworks like **FastAPI** and **Django**, enhancing overall application performance. Experienced in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, and driving innovation through compliance-driven development aligned with HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented responsive design and modern frontend tooling using **React (17–18)**, **Next.js**, and **Vue 3** to enhance user experience for healthcare and fintech platforms.\nConducted comprehensive code reviews to ensure adherence to best practices and maintain high-quality code standards in frontend development, fostering an environment of collaboration and innovation.\nProvided technical guidance on frontend architecture decisions to align with project goals, demonstrating ownership and respect for team contributions.\nParticipated in sprint planning to effectively prioritize tasks and deliver exceptional results in a timely manner, while maintaining clear communication with cross-functional teams.\nIntegrated AI coding tools and prompt engineering techniques into user interfaces to improve functionality and responsiveness, ensuring a seamless user experience.\nCollaborated with backend teams to expose secured REST APIs for document parsing and anomaly detection, leveraging intelligent features in frontend applications.\nDeveloped advanced data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded** to facilitate real-time analysis of financial activities and operational KPIs.\nEnsured scalability and maintainability of frontend applications through ownership of responsive design and implementation of best practices in frontend development.\nFostered an authentic and respectful team environment focused on mutual growth, actively participating in collaborative efforts to drive project success."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Led frontend development initiatives, ensuring **responsive design** and seamless user experiences for financial platforms using technologies such as **React (18)**, **Vue 3**, and **Next.js**.\nImplemented **modern frontend tooling** strategies to enhance the efficiency of development processes, improving delivery timelines by **20%** through effective **code reviews** and **technical guidance**.\nParticipated in **sprint planning** sessions, collaborating with cross-functional teams to address project requirements and optimize workflows, resulting in a **15%** increase in team productivity.\nExecuted innovative architectural decisions for frontend systems to align with best practices, fostering a culture of **ownership** and continuous **innovation** across projects.\nDrove the adoption of **AI coding tools** and **prompt engineering** practices, empowering team members to elevate their coding standards and providing mentorship for junior developers.\nFacilitated effective **communication skills** to engage stakeholders in technical discussions, ensuring clarity in project goals and aligning team efforts with business objectives while maintaining a focus on **collaboration**.\nChampioned **frontend architecture decisions**, balancing performance with maintainability to support high-volume transactional systems, driving a backend reduction in load times by **30%**.\nPromoted a work environment rooted in **respect**, **authenticity**, and open dialogue, enabling a productive and innovative team culture."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Led **frontend development** initiatives by designing and optimizing responsive applications using **React (18)**, **Vue 3**, and **Angular**, ensuring adherence to **WCAG 2.1** accessibility standards and delivering user-friendly experiences across various devices.\nImplemented **modern frontend tooling**, including **TypeScript**, **Redux Toolkit**, and **Tailwind CSS**, which enhanced application performance and maintainability while promoting efficient development workflows.\nFacilitated **code reviews** and provided **technical guidance** to team members, fostering a culture of collaboration and ensuring best practices in **frontend architecture decisions**.\nParticipated in **sprint planning** sessions, aligning project goals with business objectives and ensuring clear communication among stakeholders to drive project success.\nUtilized **responsive design** principles to create SEO-friendly UI components in **Next.js** and **HTML5/CSS3**, simplifying user interactions and improving engagement on both web and mobile platforms.\nExplored **AI coding tools** and engaged in **prompt engineering** for implementing features that enhance user experiences through data-driven insights and personalized content.\nDemonstrated **ownership** through innovations that improve code efficiency and application performance, resulting in measurable improvements in load times by up to **40%**.\nFostered an environment of **respect** and **authenticity** within the team, promoting open communication and encouraging innovative solutions to complex challenges."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, Vue, Angular, responsive design, modern frontend tooling\n\n**Programming Languages:**\n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Terraform, Ansible, Helm, Docker Compose, code reviews, technical guidance, sprint planning, communication skills, collaboration, ownership, innovation, respect, authenticity"
}