{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Backend Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Backend Developer with 13+ years of experience in building high-performance applications, leveraging **Python**, **REST**, **GraphQL**, and **SQL** for efficient data handling and API development. Expertise in **Docker** and container orchestration for scalable deployments, alongside strong capabilities in **Asynchronous Programming** and **Caching** techniques. Proficient in relational databases like **MySQL** to ensure robust data management and retrieval.\n\nSkilled in delivering solutions that align with industry standards and requirements. Experienced in compliance-driven development, focusing on aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Additionally, I possess a strong foundation in full stack technologies, including **JavaScript/TypeScript**, **React**, **Next.js**, **Flutter**, and backend frameworks such as **Node.js**, **FastAPI**, and **Django**. Highly capable of integrating AI/ML technologies into backend systems for enhanced functionality.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained RESTful APIs using **Python** to deliver efficient data communication for frontend applications and services, enhancing performance and responsiveness in line with asynchronous programming best practices.\n• Leveraged **Docker** for containerization of applications, simplifying deployment processes and enabling consistent environments across all stages of development.\n• Employed various SQL databases, including **MySQL** and **PostgreSQL**, to design schema and queries that support complex data retrieval and operations, resulting in optimized data storage and access patterns.\n• Implemented caching strategies to improve application performance, utilizing frameworks that enhance data retrieval speed for frequently accessed information.\n• Collaborated with cross-functional teams to integrate business logic using **C/C++**, ensuring seamless interaction with backend services during development.\n• Maintained code quality through rigorous testing frameworks such as Jest and PyTest, achieving coverage for unit and integration tests to ensure reliability of backend functionalities.\n• Participated in code reviews and knowledge-sharing sessions conducted in English, fostering an inclusive environment for educational growth and technical improvements.\n• Engaged in database optimization efforts resulting in a **30%** reduction in query response times across multiple services.\n• Ensured REST API compliance with industry standards, meeting security requirements such as data encryption and secure authentication methods."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to develop and maintain REST and GraphQL APIs, ensuring efficient data retrieval and manipulation for backend services using modern architectural patterns.\nImplemented caching strategies to enhance database performance, optimizing SQL queries and improving response times by over **40%**.\nDesigned and deployed containerized applications using **Docker** for development and production environments, ensuring consistency and scalability across services.\nCollaborated with cross-functional teams to integrate **C/C++** modules into backend systems, improving computational efficiency in financial calculations.\nEmployed asynchronous programming techniques to handle multiple requests concurrently, resulting in a **50%** increase in request throughput.\nEngaged in database design and management with **MySQL**, optimizing data structures for high-volume queries and transaction handling.\nDeveloped and integrated user interfaces using **HTML5**, ensuring seamless communication between frontend and backend components.\nWrote technical documentation in **English** for APIs and data models, facilitating clear communication across development teams.\nParticipated in code reviews and team meetings, demonstrating the ability to communicate complex technical concepts effectively."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** for developing and optimizing backend services, ensuring efficiency in **REST** and **GraphQL** APIs while meeting performance benchmarks for load handling in a global e-commerce environment.\nLeveraged **Docker** for containerization, enabling consistent deployment across environments and streamlining the development pipeline with **Container-Orchestration** tools.\nImplemented **SQL** databases, focusing on **MySQL** for structured data management, ensuring data integrity and rapid query performance, handling over **1 million** transactions per day.\nApplied asynchronous programming techniques to enhance the responsiveness of backend services, achieving up to **90%** reduction in request processing time.\nIntegrated effective caching mechanisms to boost application performance, reducing database load by **60%** through optimized data access patterns.\nCollaborated in Agile teams, communicating technical concepts effectively in **English**, and contributing to cross-functional project discussions to meet project deadlines.\nConducted code reviews to uphold coding best practices in **C/C++**, ensuring high-quality deliverables aligned with project specifications.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C/C++, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5\n\n **API Technologies:**\n\tREST, GraphQL\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, SQL\n\n **Caching:**\n\tRedis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tAsynchronous Programming, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, English"
}