{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior QA Engineer with 13+ years of experience in software quality assurance and full stack development. Proficient in E2E testing using **Playwright**, **TypeScript**, and various testing tools, ensuring high-quality deliverables through rigorous testing methodologies. Skilled in managing CI/CD pipelines with **GitHub Actions**, **GitLab CI**, and **Jenkins**, while employing **Agile** and **Scrum** practices to enhance team collaboration and efficiency.\nExperienced in developing and testing **REST APIs** and using tools like **Postman** for automated testing, as well as leveraging **SQL** and **NoSQL** databases to validate application data integrity.\nBackground in full stack development with **JavaScript**, **Python**, and **Flutter**, and strong hands-on expertise in frontend frameworks like **React**, **Angular**, **Next.js**, and backend technologies including **Node.js**, **FastAPI**, and **Django**. Knowledgeable in compliance-driven development standards such as HIPAA and PCI DSS, ensuring adherence to industry regulations. Proven ability to integrate AI testing tools for enhanced performance validation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and executed E2E testing strategies leveraging **Playwright** to ensure high-quality deliverables in client-server architecture for healthcare and fintech platforms.\n• Collaborated in Agile and Scrum teams to implement CI/CD practices using **GitHub Actions**, **GitLab CI**, and **Jenkins**, achieving **95%** automation coverage across all pipelines.\n• Created REST APIs with comprehensive test documentation using **Postman** to facilitate smooth integration and ensure reliability.\n• Conducted manual exploratory testing alongside automated frameworks, identifying critical issues throughout the software development lifecycle.\n• Utilized robust testing methodologies, including SQL and NoSQL databases, to validate data integrity and performance for high-traffic applications.\n• Spearheaded the integration of AI testing tools, enhancing test coverage and efficacy for complex business logic and user interfaces.\n• Managed comprehensive test cases and documented results to enhance traceability and facilitate team knowledge sharing across **TypeScript** projects.\n• Executed performance and security tests in alignment with HTTP protocol standards, ensuring compliance and robustness of applications.\n• Championing the use of agile methodologies originating from Scrum practices to optimize workflows and deliver rapid feedback loops during the testing phases.\n• Delivered high-quality, maintainable test scripts for various technologies, including **Angular** frameworks, supporting the evolution of frontend components."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Executed comprehensive **E2E testing** strategies across web applications to ensure robust quality assurance, utilizing **Playwright** and **TypeScript** for automated test case development.\nDesigned and implemented **REST APIs** testing protocols, leveraging **Postman** and **GitHub Actions** to streamline the CI/CD process with **Jenkins**, achieving a **30%** reduction in deployment time.\nCollaborated within **Agile** teams following **Scrum** methodologies to enhance testing efficiency, providing valuable feedback and ensuring alignment with project timelines.\nConducted extensive **manual exploratory testing** and created detailed **test documentation** to guarantee complete coverage of client-server interactions and **HTTP protocol** functionalities.\nDeveloped and maintained automated test scripts for **SQL** and **NoSQL** database interactions, ensuring data integrity and performance across critical applications.\nImplemented and managed CI/CD pipelines within **GitLab CI**, enhancing the efficiency of the build and deployment process, supporting frequent integration of new features.\nParticipated in continuous improvement initiatives, introducing effective **AI testing tools** to the QA process, leading to improved test accuracy and speed.\nMentored junior QA team members on best practices in testing, establishing a culture of quality and thoroughness in project deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented **E2E testing** strategies using **Playwright** and **TypeScript** to ensure robust and user-centered applications, contributing to a **75% reduction** in production bugs.\nDesigned and executed comprehensive **test documentation**, including test plans and cases, covering **REST APIs** and frontend functionalities across **Angular** applications, maintaining an average test coverage of **90%**.\nUtilized CI/CD tools such as **GitHub Actions**, **GitLab CI**, and **Jenkins** to automate testing processes and expedite the deployment pipeline, achieving a **50% faster** release cycle.\nCollaborated in an **Agile** environment and participated in **Scrum** ceremonies to align testing strategies with development timelines, ensuring timely deliverables for high-quality software releases.\nConducted **manual exploratory testing** alongside automated tests to identify edge cases, enhancing product stability and user experience.\nIntegrated **AI testing tools** to assess application performance and reliability, enabling data-driven improvements and adaptation to new technologies.\nDeveloped SQL and NoSQL queries for test data management across various database systems, ensuring comprehensive coverage in both testing and production environments.\nWorked with the **client-server architecture** and analyzed **HTTP protocol** interactions to ensure that all services meet performance and security standards.\nFacilitated communication between Development and QA teams to promote best practices in testing methodologies and standards, leading to an industry-leading bug return rate of **less than 2%** post-release."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Angular\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST APIs, Postman\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, NoSQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tE2E testing, Agile, Scrum, HTTP protocol, client-server architecture, manual exploratory testing, test documentation, AI testing tools",
  "apply_company": "DocuSketch"
}