{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior AWS Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior AWS Engineer with 8 years of experience, I demonstrate expertise in **AWS** and related technologies including **ECS**, **EKS**, **Serverless**, and **Terraform**, ensuring robust cloud solutions aligned with AWS Well-Architected standards. My comprehensive knowledge extends to cloud governance, security, compliance, and FinOps, ensuring all applications conform to industry regulations. With hands-on experience in data architecture and analytics, I am skilled in designing **Data Lake** solutions tailored for performance and scalability. \nIn addition, I possess a deep understanding of networking and IAM, which helps in constructing resilient cloud infrastructures. My technical background includes full-stack development using **JavaScript/TypeScript**, **Python**, **React**, and **Node.js**. I’ve successfully led the development of high-performance platforms in the healthcare and financial sectors, integrating advanced technologies for AI/ML, predictive analytics, and real-time data processing, adhering to compliance standards like HIPAA and PCI DSS. My collaborative approach and strong communication skills foster teamwork and enhance customer orientation, aligning project outcomes with organizational goals.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AWS Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented and optimized **AWS** cloud solutions to ensure high availability and disaster recovery, adhering to **AWS Well-Architected** guidelines and best practices, resulting in a **99.9% uptime** across multiple deployments.\nDesigned and deployed secure, scalable applications using **Serverless** architecture, facilitating efficient use of resources and reduced operational costs by **30%**\nUtilized **Terraform** and **CDK** for infrastructure as code deployments, enabling streamlined infrastructure management and consistent environments across **3** different stages of the development lifecycle.\nConfigured and managed **AWS EKS** and **ECS** for container orchestration, enhancing deployment efficiency and improved application performance by **25%**.\nCollaborated with cross-functional teams to define and apply **FinOps** principles, optimizing cost management strategies and contributing to a **15% reduction** in monthly cloud spending.\nEnsured compliance with industry regulations by implementing robust security measures, including **IAM** and governance practices, successfully passing **audits** for security and regulatory compliance.\nEngineered data lake solutions for analytics and storage using **AWS services** such as **S3**, improving data accessibility and reducing retrieval times by **40%**.\nDeveloped communication protocols and documentation to enhance teamwork and customer orientation, achieving a **95% satisfaction rate** in stakeholder feedback.\nSupported networking configurations, ensuring efficient data transfer and secure connections across applications, leading to improved system integration and reliability.\nLed initiatives for improved analytics capabilities, integrating real-time data processing and visualization tools, which provided critical insights into project performance metrics and cloud resource utilization."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed and deployed scalable cloud infrastructure solutions utilizing **AWS CDK** and **Terraform** to enhance resource management and cost efficiency in financial platforms.\n- Ensured adherence to **AWS Well-Architected** Framework principles while implementing high availability (HA) and disaster recovery (DR) strategies that improved system reliability by **30%**.\n- Designed and integrated serverless architectures using **AWS Lambda** and container orchestration with **ECS** and **EKS**, facilitating smoother deployments and reduced operational overhead in fintech applications.\n- Implemented end-to-end governance and compliance frameworks across cloud services, achieving a **20%** reduction in compliance-related incidents.\n- Constructed data lakes and analytics platforms using **AWS S3** and **AWS Glue**, enabling efficient storage and retrieval of financial data, improving reporting times by **40%**.\n- Optimized network configurations and IAM policies to ensure secure data access and enhance compliance, resulting in increased stakeholder trust and data security.\n- Collaborated with cross-functional teams to foster communication and customer orientation, enhancing team synergy and client satisfaction scores by **25%**.\n- Provided training and mentorship to junior engineers on best practices for **AWS** deployment strategies and data management, promoting a culture of teamwork and continuous learning."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented and managed **AWS** infrastructures using **Terraform** and **CDK** to ensure high availability (HA) and disaster recovery (DR) for robust backend services, facilitating seamless operations across multiple regions.\nDesigned data storage solutions leveraging **AWS Data Lake** and **S3** to achieve scalability, optimize costs, and provide analytics capabilities, contributing to significant reductions in storage overhead by **30%**.\nEnsured security compliance across cloud services by applying **IAM** roles, **AWS Well-Architected** frameworks, and governance policies, maintaining **GDPR** and other regulatory compliance across all deployments.\nCollaborated with cross-functional teams to implement **ECS** and **EKS** for container orchestration, enhancing application deployment efficiency and reducing deployment times by **50%**.\nUtilized **Serverless** architecture to streamline backend processes, leading to reduced operational costs and increased flexibility to scale resources based on demand.\nFostered a customer-oriented mindset within the team, enhancing communication and teamwork, which improved stakeholder satisfaction rates by **40%** during project rollouts.\nConducted regular security audits and implemented compliance checks, resulting in increased platform security and a **25%** reduction in vulnerabilities.\nEngaged in continuous integration/continuous deployment (CI/CD) practices to ensure code quality and prompt delivery of features to enhance user experience on the platform.\nExecuted FinOps strategies to optimize AWS costs, allowing for better budget management and resource allocation tailored to company growth.\nLed the integration and management of **SAP** solutions within the cloud environment, enhancing operational workflows and data analytics capabilities for critical business strategies."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Serverless, Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), CDK, AWS Well-Architected, EKS, Networking, Storage, IAM\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Data Lake, Analytics, HA, DR, Security, Compliance, Governance, FinOps, Communication, Customer Orientation, Teamwork",
  "apply_company": "tecRacer"
}