{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Machine Learning Engineer (GraphRAG & Retrieval Tools)",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-118083397/",
  "profile_summary": "Senior Machine Learning Engineer with 10+ years of experience in delivering innovative software solutions, specializing in **Graph Data Science**, **Knowledge Graphs**, and **Retrieval-Augmented Generation (RAG)**. Proficient in making use of **Cypher**, **Large Language Models (LLMs)**, **Pandas**, and **PyTorch** to drive advanced machine learning initiatives. Expert in **FastAPI** and **Docker** for developing and deploying seamless APIs and containerized applications. Demonstrated success in managing the **ML development lifecycle**, ensuring robust automated querying while fostering collaboration and communication across teams to create customer-centric solutions.\n\nSkilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with extensive hands-on expertise using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building and deploying cloud-native applications on **Azure** and **AWS**, and leading enterprise platform development that incorporates AI/ML capabilities for real-time analytics and automation. Strong background in **microservices architecture**, event-driven systems, and CI/CD automation, focused on delivering secure, maintainable solutions compliant with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about driving real-world impact through technology.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Machine Learning Engineer (GraphRAG & Retrieval Tools)",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable machine learning solutions integrating **Graph Data Science**, **Knowledge Graphs**, and **Text-to-Query models**, leveraging **FastAPI** for seamless API integrations, ensuring efficient client-side data retrieval and processing.\n• Developed and optimized **Retrieval-Augmented Generation (RAG)** systems utilizing **Large Language Models (LLMs)** to enhance information extraction and user query responses, achieving a **30%** improvement in search accuracy.\n• Managed end-to-end ML development lifecycle using **PyTorch**, **scikit-learn**, and **Pandas** for data manipulation, model training, and evaluation, adhering to project timelines with **90%** on-time delivery rate.\n• Collaborated effectively across cross-functional teams, emphasizing strong communication and customer-centric mindset to gather requirements and deliver tailored ML solutions that meet client needs.\n• Built and deployed automated querying tools to streamline data processing workflows and improve operational efficiency by **25%**, enabling quicker access to key insights.\n• Implemented high-quality and maintainable code with **Docker** to build reproducible machine learning environments, facilitating collaboration and deployment across development and production stages.\n• Led the integration of advanced data analytics into business intelligence tools, improving user engagement and operational decision-making through enriched visualizations and interpretable results.\n• Established robust collaboration practices with data scientists to refine models, resulting in the enhancement of predictive capabilities and model performance metrics.\n• Created documentation and best practice resources for internal teams on utilizing machine learning systems, fostering knowledge sharing and continuous learning within the organization."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Led the development and implementation of knowledge graphs to enhance data retrieval and analysis for financial platforms, utilizing **Graph Data Science** principles.\n- Applied **Cypher** language to construct complex queries on graph databases, improving data interaction efficiency by **30%**.\n- Designed and built automated querying systems to facilitate real-time and accurate data retrieval, optimizing performance across data-rich applications.\n- Leveraged **Pandas** for data manipulation and analysis, ensuring high-quality input for machine learning models and significantly reducing preprocessing time by **25%**.\n- Developed and fine-tuned large language models (LLMs) for Text-to-Query functionalities, enabling users to interact with financial data intuitively and effectively.\n- Implemented an end-to-end ML development lifecycle using **PyTorch** and **FastAPI**, ensuring smooth integration from data ingestion to deployment and reducing deployment time by **40%**.\n- Collaborated with cross-functional teams to gather requirements and provide customer-centric machine learning solutions that meet user needs and enhance overall system performance.\n- Developed retrieval-augmented generation (RAG) strategies to improve natural language processing outcomes for financial querying interfaces, enhancing user experience and accuracy of results.\n- Maintained effective communication with stakeholders throughout project lifecycle, ensuring clear understanding of project goals and outcomes.\n- Oversaw productivity and knowledge sharing within the team, fostering a collaborative environment that encouraged innovative thinking and problem-solving."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **FastAPI** to design and implement scalable APIs that support Graph Data Science applications, ensuring performance and reliability in delivering recommendations.\nEngineered intelligent features leveraging **Large Language Models (LLMs)** and **Text-to-Query models** to enhance user interaction and optimize the querying process, improving customer satisfaction through a responsive interface.\nApplied **Pandas** and **scikit-learn** for data manipulation and model training, achieving a 30% increase in accuracy for user personalization algorithms.\nDeveloped and deployed machine learning models using **PyTorch**, focusing on the **ML development lifecycle** to streamline the transition from research to production, ensuring that best practices are followed.\nCreated and maintained knowledge graphs using **Cypher**, enhancing data retrieval processes by 25% through improved data relationships and contextual understanding.\nImplemented **Retrieval-Augmented Generation (RAG)** models to boost the efficiency of information retrieval, thus increasing the reliability of responses in conversational agents.\nCollaborated across teams on automated querying solutions, fostering a customer-centric mindset in product development and ensuring alignment with market needs.\nPromoted seamless integration of machine learning tools within the existing tech stack by utilizing **Docker**, facilitating consistent environment management and deployment.\nStrengthened communication skills to effectively bridge technical details with stakeholder requirements, ensuring transparency in project progress and machine learning outcomes.\nOptimized projects through regular code reviews and architectural discussions, enhancing team collaboration and ensuring high-quality outcomes in projects with timelines exceeding **6 months**."
    }
  ],
  "skills": " \n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Graph Data Science, Knowledge Graphs, Cypher, Text-to-Query models, Retrieval-Augmented Generation (RAG), Large Language Models (LLMs), Pandas, PyTorch, scikit-learn, ML development lifecycle, Automated querying, Collaboration, Communication, Customer-centric mindset, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}