{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Support Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Support Engineer with a solid background in Software Development, I possess a robust understanding of system and application security, encompassing **Cyber Security** protocols and practices. With 8 years of experience in delivering technical solutions across various sectors, I excel in **customer communication**, ensuring seamless project management and comprehensive support for clients. My technical expertise includes proficiency in **Java**, **C**, and **C++**, coupled with hands-on experience in Android and iOS development utilizing **Android Studio** and **XCode**. I bring a unique blend of technical acumen and strategic insight to foster secure software solutions while adhering to industry compliance standards. I am committed to implementing best practices for network and system security, ensuring robust protection of enterprise-level applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided exceptional **customer communication** and **project management** support for **C**, **C++**, and **Java** applications, ensuring optimal performance across **iOS** and **Android** platforms.\nDesigned and implemented secure software solutions, advancing **cyber security** practices while managing application security for healthcare and financial software deployments.\nCollaborated with cross-functional teams to troubleshoot and resolve system security and network security issues, improving overall application stability by **30%** while maintaining compliance with industry standards.\nServed as a key technical resource for all phases of software development, leveraging skills in **Android Studio** and **XCode** to enhance mobile application performance and user experience.\nExecuted comprehensive testing strategies, leading to a **25%** decrease in critical bugs through meticulous unit and integration testing, enhancing software reliability.\nMonitored and analyzed system performance using diagnostic tools, decreasing downtime by **15%** and optimizing response times through continuous improvement practices.\nTrained and mentored junior engineers on best practices for secure software development, elevating team competency in **cyber security** measures.\nDeveloped technical documentation and conducted customer training sessions, ensuring consistent application and adherence to security protocols across systems.\nOversaw regular security audits and assessments, significantly mitigating risks and vulnerabilities in software applications across multiple environments."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Facilitated exceptional **customer communication** by addressing and resolving technical inquiries related to software development, ensuring a seamless customer experience for **C**, **C++**, and **Java** applications.\nSpearheaded **project management** efforts to streamline product support processes, enhancing response times and achieving a **20%** reduction in issue resolution time for customers utilizing **Android** and **iOS** platforms.\nDeveloped robust software security solutions, focusing on **system security**, **network security**, and **application security**, reducing vulnerability exposure by **30%** across supported applications.\nCollaborated with cross-functional teams to implement enhanced **cyber security** measures, achieving compliance with industry standards and mitigating risks in customer-facing applications.\nTrained junior engineers on best practices in **software development** and **security**, contributing to team efficiency and improving overall knowledge retention by **15%**.\nProvided advanced troubleshooting support for mobile applications developed in **Android Studio** and **XCode**, successfully resolving **95%** of tickets in first contact.\nActed as a liaison between development teams and customers, effectively translating technical language and requirements while ensuring alignment with project timelines and goals."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Managed and supported the development lifecycle of software applications, ensuring robust **Cyber Security** measures are in place to protect sensitive data throughout the platform.\nCollaborated with cross-functional teams to enhance customer communication strategies, effectively responding to customer issues with a focus on resolution and satisfaction metrics, targeting a **98%** satisfaction rate.\nUtilized rigorous **Project Management** methodologies to streamline processes, reducing project completion time by **15%** through effective Team and Resource Management.\nReduced system vulnerabilities by implementing software patches and security protocols, achieving a **30%** decrease in security incidents across the platform.\nConducted regular system security audits and assessments, ensuring compliance with the latest **Network Security** standards.\nProvided technical support for both **Android** and **iOS** applications, utilizing **Android Studio** and **XCode** to address bugs, optimize performance, and improve overall user experience.\nContributed to code reviews and optimization of existing software solutions using **C**, **C++**, and **Java**, enhancing application efficiency and reliability.\nDeveloped comprehensive documentation for software deployment and user support processes to facilitate better understanding and usage among team members and end-users.\nEngaged in troubleshooting and debugging across multiple platforms, ensuring the stability and integrity of applications by achieving a resolution time of less than **24 hours** for critical issues.\nFostered a culture of continuous improvement, implementing feedback mechanisms to enhance software quality and team collaboration."
    }
  ],
  "skills": " **Programming Languages:**\n\tC, C++, Java, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Cyber Security, System Security, Network Security, Application Security, Software Development, Customer Communication, Project Management, Nginx, Certbot",
  "apply_company": "Zimperium"
}