{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 8 years of expertise in **TypeScript**, **React**, and **React Native** focused on creating high-performance applications with secure authentication features, including **WebAuthn** and **passkeys**. Proven ability in cross-platform development and crafting user-centric experiences (UX) that align with fintech standards. I am proficient in clean architecture principles and performance optimization techniques, ensuring applications are scalable and efficient.\n\nMy background includes leading teams to develop secure, enterprise-grade solutions, leveraging skills in cloud platforms including **Azure** and **AWS**. I have a solid track record of documenting processes and enhancing collaboration among stakeholders. My strengths extend to building applications that not only meet compliance standards like HIPAA but also incorporate elements of modern development such as CI/CD automation and microservices architecture.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed secure authentication solutions utilizing **WebAuthn** and **passkeys**, ensuring high-level security in cross-platform applications for fintech and healthcare.\nArchitected and implemented scalable, user-friendly front-end components using **TypeScript** and **React** (17-18) for seamless integration with back-end services and enhanced user experience (UX).\nCollaborated closely with UX designers and product teams to optimize front-end performance and standards while maintaining comprehensive documentation.\nLed the development of cross-platform mobile applications using **React Native**, focusing on performance optimization and delivering responsive designs for both iOS and Android devices.\nEmployed clean architecture principles to ensure maintainability and scalability of front-end applications across multiple projects, improving team collaboration and reducing technical debt.\nUtilized performance optimization techniques to ensure applications run efficiently, achieving load times under **2 seconds** and maintaining a smooth user experience.\nIntegrated technical documentation processes into the development workflow, allowing for easier onboarding of new team members and improved knowledge sharing across the team.\nEnhanced collaboration among developers through code review processes and agile methodologies, ensuring adherence to best practices in clean architecture and security protocols."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained dynamic front-end applications using **TypeScript**, **React (18)**, and **Next.js**, ensuring cross-platform compatibility and secure authentication processes using **WebAuthn** and **passkeys**.\n• Collaborated in the design and optimization of user experiences (UX) on financial dashboards and admin portals, implementing clean architecture principles to enhance performance and maintainability.\n• Integrated state management and optimized rendering through libraries like Redux Toolkit to ensure high performance and responsiveness in high-volume fintech applications.\n• Led performance optimization initiatives, achieving a **40%** improvement in load times for key user interfaces and enhancing overall application responsiveness.\n• Documented and facilitated cross-team collaboration throughout the development lifecycle, ensuring alignment with best practices in secure authentication and compliance standards.\n• Fostered knowledge sharing and mentorship among junior developers, enhancing team capabilities in clean architecture and performance optimization techniques."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed dynamic user interfaces and cross-platform applications leveraging **TypeScript**, **React** (18), and **React Native** to ensure seamless user experiences, while adhering to clean architecture principles.\nOptimized performance by implementing state management solutions using Redux Toolkit and enhancing responsiveness through **performance optimization** techniques, resulting in a **30%** improvement in load times across multiple devices.\nCollaborated with design teams to create intuitive UX/UI designs, ensuring compliance with WCAG 2.1 for accessibility and enhancing user engagement, achieving a **15%** increase in user satisfaction scores.\nEngineered secure authentication mechanisms utilizing **WebAuthn** and **passkeys**, adhering to best practices for **secure authentication**, thereby enhancing the platform's security posture.\nDocumented frontend architecture and codebases effectively, fostering collaboration and knowledge sharing among cross-functional teams, resulting in reduced onboarding time by **20%**.\nImplemented efficient build processes and continuous integration using tools such as **Webpack** and **Jest** for automated testing and deployment, improving code quality and reducing manual intervention.\nEnhanced collaboration on cross-platform development projects, applying agile methodologies to improve project delivery timelines and team effectiveness.\nParticipated in code reviews to uphold quality standards and drive technical discussions surrounding best practices in frontend engineering."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Frontend Frameworks:**\n\tReact, React Native, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tWebAuthn, passkeys, secure authentication\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), UX, clean architecture, performance optimization, documentation, collaboration",
  "apply_company": "Career Renew"
}