{
  "name": "Tomasz Lee",
  "role_name": "Senior Product Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Product Engineer with 9+ years of expertise in Mechanical and Electrical Engineering, specializing in Fault Diagnosis and Technical Reporting. Proficient in using **MS Excel** to analyze data and generate comprehensive reports. Possesses strong Organizational and Interpersonal Skills, enabling effective collaboration with cross-functional teams to enhance customer support and product outcomes. Additionally skilled in developing applications using **.NET**, **C#**, **ReactJS**, and **NextJS**, with practical experience in **Apache Kafka**, **RabbitMQ**, and **Redis**. Proven track record of delivering robust engineering solutions and optimizing processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Product Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Provided technical support and fault diagnosis for mechanical and electrical systems, improving resolution times by 30%.\nCrafted detailed technical reports to communicate findings and recommendations, enhancing information dissemination across the team.\nUtilized MS Excel to analyze data trends, optimizing processes and improving reporting accuracy by 25%.\nExcelled in customer support, effectively addressing client inquiries and concerns, resulting in a 15% increase in customer satisfaction ratings.\nDemonstrated exceptional organizational skills, managing multiple projects concurrently, ensuring timely completion within deadlines.\nBuilt and maintained strong interpersonal relationships with cross-functional teams and stakeholders to facilitate seamless collaboration on product development.\nLeveraged innovative engineering principles to optimize product designs and processes, directly contributing to a **10% reduction** in production costs.\nImplemented quality control measures into the engineering process, leading to a **20% decrease** in product defects.\nStandardized training materials and technical documentation, enhancing onboarding processes for new engineers."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "- Demonstrated strong **Technical Reporting** skills by documenting engineering processes and product specifications accurately, leading to improved project clarity.\n- Leveraged **MS Excel** for analytical reporting, resulting in enhanced data interpretation and decision-making efficiency.\n- Employed **Organizational Skills** to manage multiple projects simultaneously, delivering on time and ensuring optimal resource allocation, which improved project turnaround by **20%**.\n- Applied **Interpersonal Skills** to collaborate with cross-functional teams, facilitating effective communication and alignment between engineering and product managers, contributing to a seamless product development cycle.\n- Conducted fault diagnosis on mechanical and electrical systems, utilizing a systematic approach to problem-solving that resulted in a **95%** success rate for troubleshooting.\n- Provided exceptional **Customer Support**, addressing technical queries and resolving issues effectively, which increased customer satisfaction ratings by **15%**.\n- Developed training materials and conducted sessions on product usage and maintenance, improving client onboarding experience by **30%**.\n- Utilized expertise in **Mechanical Engineering** and **Electrical Engineering** principles to enhance product design, resulting in a **10%** reduction in manufacturing costs.\n- Successfully led initiatives that merged engineering insights with consumer feedback, driving product enhancements and market fit, resulting in a **50%** increase in user adoption.\n- Collaborated with quality assurance teams to ensure all products met compliance standards and performance benchmarks pre-launch."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **MS Excel** for data analysis and fault diagnosis, increasing reporting accuracy by **30%**.\nApplied strong **organizational skills** to streamline project workflows and improve team communication.\nDelivered comprehensive **technical reporting** that facilitated decision-making processes for product enhancements.\nProvided exceptional **customer support** that resulted in a **15%** increase in client satisfaction ratings.\nEngaged in cross-functional collaboration, leveraging **interpersonal skills** to foster teamwork and drive project goals.\nConducted detailed **fault diagnosis** for engineering products, reducing troubleshooting time by **25%**.\nFocused on continuous improvement initiatives that enhanced operational efficiency and product quality.\nParticipated in engineering design reviews, contributing to the development of innovative solutions.\nMaintained up-to-date documentation practices to improve knowledge transfer among engineering teams."
    }
  ],
  "skills": "•\t**Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n•\t**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n•\t**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n•\t**API Technologies**\n\tRESTful API, GraphQL\n\n•\t**Serverless and Cloud Functions**\n\tDynamoDB, CosmosDB\n\n•\t**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB\n\n•\t**DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n•\t**Cloud & Infrastructure**\n\tMicroservices\n\n•\t**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, Mechanical Engineering, Electrical Engineering, Fault Diagnosis, Customer Support, Technical Reporting, MS Excel, Organizational Skills, Interpersonal Skills",
  "apply_company": "Wabtec Corporation"
}