{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Principal Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Principal Backend Engineer with over 13 years of experience in backend development, specializing in clean code and end-to-end development. Proficient in **Go**, **TypeScript**, **PostgreSQL**, and **Redis**, employing efficient algorithms and data structures to optimize performance. Skilled in building high-performance applications within the healthcare and financial sectors, with hands-on experience in **C++** and **Rust**. Experienced in implementing best practices for software quality and scalability, focusing on maintainable and robust code. \n\nDemonstrated expertise in delivering AI/ML-powered platforms, utilizing **Python** and **Flutter** for full stack development, while leveraging **React**, **Next.js**, and **Vue** for frontend solutions. Proficient in deploying cloud-native architectures on **AWS** and **Azure**, integrating microservices and CI/CD pipelines. Committed to compliance-driven development, aligning solutions with **HIPAA**, **FHIR**, **PCI DSS**, and **SOC 2** standards. Strong background in MLOps, including orchestration and model serving using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Principal Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust backend solutions using **Go** and **TypeScript** to optimize data processing and improve system efficiency, ensuring clean and maintainable code.\n- Designed and implemented complex algorithms and data structures tailored for high-performance applications in health and finance domains, integrating advanced **Graph Algorithms** for optimal data retrieval.\n- Managed data storage and manipulation utilizing **PostgreSQL** and **Redis** to ensure rapid access and real-time updates for end-users.\n- Champion clean code practices throughout the development lifecycle, leading code reviews and enforcing coding standards for consistent quality across projects.\n- Oversaw end-to-end development of microservices architectures, transitioning legacy systems to modern frameworks for improved scalability.\n- Collaborated with cross-functional teams to deliver high-quality software solutions, effectively communicating technical concepts to non-technical stakeholders.\n- Leveraged continuous integration and deployment strategies, enhancing workflow efficiency and reducing time to market by **30%**.\n- Spearheaded projects that resulted in a **25%** reduction in operational costs through optimized resource utilization and performance tuning.\n- Conducted performance tests and utilized profiling tools to diagnose and resolve bottlenecks, achieving runtime improvements by up to **40%**.\n- Mentored junior engineers in backend development best practices, clean code principles, and advanced algorithm design."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented backend development solutions using **Go**, **C++**, and **Rust**, enhancing system performance and efficiency in financial applications through clean code practices.\nOptimized database interactions with **PostgreSQL** and **Redis**, achieving a **30%** improvement in data retrieval times across core services.\nDesigned and implemented complex algorithms and data structures to solve critical business problems, improving application response times by **25%**.\nCollaborated on end-to-end development projects, ensuring seamless integration of microservices and improving deployment frequency by **40%**.\nConducted code reviews and implemented best practices for clean code, increasing maintainability and reducing technical debt in the codebase.\nLed the design and implementation of scalable architecture using containerization and orchestration technologies, improving system reliability and reducing downtime by **15%**.\nMentored junior developers in Go and TypeScript, fostering a collaborative team environment and enhancing overall productivity.\nEngaged in performance tuning and optimization, resulting in a **20%** increase in throughput for key backend services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Led the design and optimization of backend systems as a **Principal Backend Engineer**, focusing on leveraging **Go** and **TypeScript** to enhance performance across key services, achieving a **30% increase** in transaction processing speeds.\nDrove backend development using structured **clean code** principles to create maintainable and scalable codebases, resulting in a **25% reduction** in bug reports post-deployment.\nUtilized **PostgreSQL** for robust data management, ensuring efficient querying processes, which improved data retrieval times by **40%** through optimized indexing strategies.\nImplemented caching solutions with **Redis** to enhance response times, achieving a **50% decrease** in database load during peak shopping periods, thus improving user experience.\nCollaborated on algorithm optimization, applying advanced **Graph Algorithms** and foundational **Algorithms** to solve complex data challenges, ensuring the efficiency of data processing workflows.\nEngineered extensive backend systems using principles of **backend development** to support high-traffic applications, contributing to seamless services capable of handling over **1 million transactions** daily.\nDeveloped and maintained complex **data structures** to optimize data handling and processing efficiency, achieving significant improvements in operational throughput.\nExecuted end-to-end development processes, ensuring that features were delivered on time with comprehensive testing, which led to a **15% increase** in user satisfaction ratings.\nMentored junior developers on best practices in backend engineering, fostering a culture of excellence and knowledge sharing within the team."
    }
  ],
  "skills": "Programming Languages:\n\tGo, TypeScript, C++, Rust, Python, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS; Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Graph Algorithms, Algorithms, Data Structures, Backend Development, Clean Code, End-to-End Development"
}