{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Backend Engineer with extensive experience in delivering high-performance software solutions, specializing in **TypeScript**, **Node.js**, and **PostgreSQL**. Proficient in using **Docker** for containerization and adept with **REST** and **GraphQL** APIs, ensuring seamless communication between services. Experienced in both relational and **NoSQL** databases, utilizing technologies like **rqlite** for efficient data handling. Proven ability to develop robust backend systems with proficiency in **Golang**, contributing to scalable and efficient architectures. Skilled in Agile methodologies, adaptability to **Cloud Services**, and proficient with **WebSockets** for real-time data exchange.\n\nBrings over 10 years of full-stack development experience with hands-on expertise in **JavaScript/TypeScript**, **Python**, and frameworks such as **FastAPI** and **Django**. Known for building and deploying cloud-native applications on **Azure** and **AWS**, while ensuring compliance with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Strong background in microservices architecture and CI/CD automation, with a passion for creating systems that provide real-world impact and seamless collaboration.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped scalable, robust back-end solutions using **TypeScript**, **Node.js**, and **PostgreSQL**, ensuring efficient handling of complex data queries and transactions across 100,000+ records.\n•\tIntegrated **GraphQL** and **REST** APIs to support seamless data interaction between client applications and the server, improving data retrieval speeds by 30%.\n•\tImplemented containerization with **Docker** to standardize deployment processes across different environments, enhancing the development workflow and reducing deployment times by 25%.\n•\tOptimized database performance by leveraging both **SQL** and **NoSQL** strategies, achieving a 40% increase in data access speeds in high-traffic scenarios.\n•\tAdopted an **Agile** methodology to facilitate continuous integration and delivery, improving team productivity by 20% and accelerating project timelines.\n•\tCollaborated effectively with cross-functional teams to ensure clear communication of project goals and expectations, leading to a 15% improvement in stakeholder satisfaction.\n•\tUtilized **WebSockets** for real-time communication capabilities in applications, enhancing user engagement and experience by allowing live data updates.\n•\tMaintained and optimized legacy systems by incorporating **etcd** for distributed key-value storage, ensuring configuration consistency across multiple services.\n•\tParticipated in code reviews and architectural discussions, bringing in fresh perspectives and leading to a refactoring initiative that reduced system complexity by 30%.\n•\tActively engaged with stakeholders to gather requirements and establish collaborative solutions, improving project clarity and execution.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript**, **Node.js** (NestJS/Express), and **Golang** to develop and modernize backend systems, enhancing performance and maintainability for high-volume transaction environments.\nImplemented **PostgreSQL** and **NoSQL** databases for efficient data storage and retrieval, ensuring scalability and reliability in financial applications.\nDesigned and maintained RESTful and GraphQL APIs to support seamless communication between frontend applications and backend services while adhering to best practices in architecture.\nEmployed **Docker** for containerization, achieving consistent deployments across development, staging, and production environments, facilitating a **90% reduction** in configuration-related issues.\nCollaborated in an **Agile** environment, participating in regular sprint planning sessions and code reviews, enhancing team productivity and code quality through effective communication.\nIntegrated **WebSockets** for real-time data transmission and notifications, significantly improving user interaction and responsiveness in financial applications.\nLed initiatives to migrate legacy systems to cloud services, leveraging bare metal servers and virtualized environments to optimize costs and resource utilization, resulting in a **30% reduction** in operational overhead.\nConducted thorough performance tuning and optimization of database queries and application logic, achieving response time improvements of **20%** across key metrics.\nFostered collaboration among cross-functional teams to deliver high-quality software solutions that meet business requirements and regulatory compliance standards."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and maintained robust backend services utilizing **Node.js** and **TypeScript**, ensuring scalability and performance in high-traffic environments.\n• Designed and implemented **PostgreSQL** and **NoSQL** databases to support complex data models, achieving a **30%** reduction in query response times.\n• Collaborated on architecture improvements using **REST** and **GraphQL** APIs, enhancing data retrieval and integration across diverse platforms.\n• Utilized **WebSockets** for real-time communication within applications, boosting user engagement and providing instant updates for transactions.\n• Implemented containerization with **Docker** to streamline development workflows and ensure consistent deployment across environments, leading to a **40%** faster deployment cycle.\n• Worked under **Agile** methodologies, ensuring timely delivery of features and enhancements through efficient collaboration and communication within cross-functional teams.\n• Participated in health-checks and performance tuning of database systems, contributing to **99.9%** uptime and redundancy with a focus on **SQL** and **rqlite**.\n• Actively engaged in code reviews and technical discussions, promoting best practices and knowledge sharing to enhance team performance and collaboration.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Golang\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, NodeJS\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tGraphQL, REST, WebSockets\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, NoSQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCloud Services, Bare Metal Servers\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile, Collaboration, Communication",
  "apply_company": "Prisma"
}