{
  "name": "Tomasz Lee",
  "role_name": "Frontend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-oriented Frontend Engineer with 9+ years of comprehensive software development experience, focusing on **React**, **JavaScript**, **HTML**, and **CSS** to deliver engaging user experiences. Proficient in integrating UI/UX principles with a solid understanding of testing libraries to ensure high-quality deliverables. Experienced in backend development with a solid grasp of **.NET** and **C#**, complemented by a commitment to cross-team collaboration for successful project outcomes. Demonstrated ability in performance profiling and legacy codebase migration, while also mentoring junior developers. Adept at utilizing cloud services and optimizing application performance, with proven success in designing and implementing complex applications.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Frontend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **React**, **JavaScript**, **HTML**, and **CSS** to develop a responsive web interface, leading to enhanced user experience and a **25%** increase in user satisfaction.\nCollaborated effectively with cross-functional teams, including UX/UI designers, to ensure cohesive product design and functionality.\nConducted performance profiling on the front end, resulting in optimized loading times and improved response rates by **35%**.\nImplemented thorough testing protocols utilizing various testing libraries to ensure code reliability and maintainability.\nSpearheaded the migration of legacy codebases to modern frameworks, improving code efficiency and system performance.\nMentored junior developers in best practices for frontend development and effective communication in a team environment, fostering growth and collaboration.\nEmployed strategic feedback mechanisms to bridge gaps between technical and non-technical team members, enhancing project delivery.\nDeveloped interactive components using **D3.js** and **Three.js** for data visualization, ensuring an engaging user interface.\nMaintained high coding standards through code reviews and collaborative programming practices."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "- Developed interactive user interfaces using **React**, **JavaScript**, **HTML**, and **CSS**, enhancing the overall user experience by **25%**.\n- Collaborated across teams to gather requirements and ensure seamless integration between frontend and backend systems, improving **cross-team collaboration** and project delivery timelines.\n- Conducted performance profiling and optimization of legacy codebases, resulting in a **30%** reduction in loading times.\n- Created and executed comprehensive tests using **testing libraries**, ensuring UI/UX standards are consistently met.\n- Mentored junior developers and conducted code reviews to improve coding standards and team productivity, contributing to a more skilled workforce.\n- Led initiatives to enhance frontend application performance, achieving a **25%** boost in user engagement through effective performance profiling.\n- Designed and implemented responsive components adhering to **UI/UX** principles and best practices.\n- Collaborated with backend teams using **Ruby** and **Go** for seamless data interchange, enhancing overall application architecture support.\n- Familiarity with performance monitoring tools to ensure optimal application function and user satisfaction."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **React** and **JavaScript** to enhance user experience and interface design, improving UI/UX quality by **30%**.\nEmployed **HTML** and **CSS** to develop responsive layouts, ensuring cross-browser compatibility and accessibility standards.\nConducted thorough performance profiling and optimization techniques, achieving a **25%** improvement in application load times.\nCollaborated with cross-functional teams to align project objectives and requirements, fostering effective communication and teamwork.\nMentored junior developers in best practices for frontend development, increasing team capability and efficiency.\nPerformed integration testing and utilized various **testing libraries** to ensure code reliability and performance.\nAssisted in the legacy codebase migration process, transitioning to modern frameworks for improved maintainability.\nLeveraged **Ruby** and **Go** for backend integrations, facilitating smooth communication between frontend components and server-side logic.\nEngaged in continuous learning and development of frontend technologies to keep skills updated with industry trends.\nParticipated in agile methodologies, including daily standups and sprint retrospectives, to maintain project momentum and adaptability."
    }
  ],
  "skills": " **Frontend Technologies:** HTML, CSS, JavaScript, React, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **Backend Frameworks:** NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices, Ruby, Go\n\n **API Technologies:** RESTful API, GraphQL\n\n **Serverless and Cloud Functions:** AWS, Azure\n\n **Databases:** MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps:** CI/CD pipelines\n\n **Cloud & Infrastructure:** AWS, Azure\n\n **Other:** UX/UI Design, Git, GitHub, Python, Redux, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Cross-team collaboration, Performance profiling, Legacy codebase migration, Fluent communication in English, Mentoring"
}