{
  "name": "Patryk Zaslawski",
  "role_name": "Senior AI Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Senior AI Engineer with 8+ years in software engineering, I excel in AI integration and developing LLM-based solutions utilizing **Node.js**, **OpenAI**, **Anthropic**, and strategies like prompt engineering. My technical proficiency extends to **LangChain**, **LangGraph**, and **Vector Databases** including **Pinecone**, **Weaviate**, and **Chroma** for optimized data retrieval and processing. I have strong experience in building modern applications with **Python** and leveraging frontend technologies like **React** and **Next.js**. Additionally, my background as a Full Stack Developer empowers me to design and implement high-performance software solutions, ensuring alignment with business objectives across various sectors including e-commerce and healthcare. I am committed to employing best practices in API design and microservices architecture to deliver robust and scalable systems.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed and integrated **AI-based solutions** using **Node.js** and **Python** for enhanced healthcare data processing and patient engagement.\n• Designed and built **APIs** that enable seamless interaction of **LLM-based solutions** with healthcare applications, ensuring reliability and performance.\n• Integrated **AI technologies** from **OpenAI** and **Anthropic** to improve decision-making and patient experiences using **machine learning** frameworks.\n• Leveraged **LangChain** and **LangGraph** for building advanced prompt engineering techniques aimed at improving language model interactions.\n• Utilized **Vector Databases** such as **Pinecone**, **Weaviate**, and **Chroma** to enhance search requests and data retrieval efficiency across large datasets.\n• Spearheaded the architecture and deployment of scalable **Node.js** microservices to support real-time health monitoring applications, resulting in a **30%** improvement in system responsiveness.\n• Championed data optimization strategies involving **MongoDB** and **PostgreSQL** for efficient storage and querying of healthcare data.\n• Conducted comparative analysis of **AI integration** methodologies, leading to a **25%** reduction in processing time for patient insights.\n• Collaborated with cross-functional teams utilizing **React** and **Next.js** for frontend development, applying state management techniques to optimize user experiences.\n• Implemented comprehensive **testing strategies** for **Python** and **Node.js** applications ensuring **99%** uptime and compliance with healthcare regulations.\n• Mentored and guided a team of engineers in best practices of AI integration and cloud-native development on **AWS** and **Azure**, enhancing team capabilities and knowledge.\n• Developed real-time applications that utilized **OpenAI** models for predictive analytics, enhancing operational efficiencies by up to **40%**.\n• Integrated secure **OAuth 2.0** authentication for applications interfacing with sensitive healthcare data while ensuring compliance with **HIPAA** and **GDPR**. \n• Leveraged **observability tools** including **Prometheus** and **Grafana** to monitor system performance alongside AI workloads, enabling proactive issue resolution."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed and integrated AI solutions using **Python** and **Node.js**, employing **OpenAI** and **Anthropic** for advanced machine learning functionalities and enhancing user experiences with LLM-based solutions.\nDesigned and implemented high-performance **API designs** utilizing **React** and **Next.js** frameworks, ensuring scalable interfaces for seamless data interchange and real-time communication.\nConstructed and managed AI applications integrating **LangChain**, **LangGraph**, and **Vector Databases (Pinecone, Weaviate, Chroma)** for structured data storage and retrieval, improving the efficiency of AI-driven processes.\nLed the development of user interfaces with **React** and **Next.js**, focusing on prompt engineering methodologies that enhance user interaction and data handling capabilities.\nImplemented dynamic and responsive web applications through structured development strategies, impacting project delivery timelines by reducing rollout times by **30%**.\nCollaborated on AI integration projects, utilizing up to **3** different AI models, streamlining various workflow processes across the company.\nEnhanced existing services to incorporate AI features by refactoring old modules and developing new, more efficient methods, reducing processing time by **20%**.\nApplied best practices in software development, including automated testing with frameworks like PyTest, and DevOps processes with **CI/CD pipelines** (Azure DevOps, GitHub Actions), ensuring reliable and efficient deployment cycles.\nMonitored and optimized system performance through data analytics and feedback loops, achieving an increase in application responsiveness by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and implemented **AI integration** solutions using **Python** and incorporated features such as **OpenAI** and **Anthropic** for advanced functionalities.\nDeveloped scalable, high-performance backend services using **Node.js** while implementing **API design** strategies to facilitate seamless communication between various systems and applications.\nCreated **LLM-based solutions** utilizing frameworks like **LangChain** and **LangGraph** to enhance data processing capabilities and improve user interaction.\nLeveraged **Vector Databases** such as **Pinecone**, **Weaviate**, and **Chroma** for efficient storage and retrieval of unstructured data, optimizing data management and performance.\nDesigned and optimized RESTful APIs with **Python** to support real-time user interactions, processing more than **9,000** transactions per minute without performance degradation.\nImplemented **prompt engineering** techniques, enabling more relevant and accurate outputs from AI models, improving system responsiveness by **30%**.\nEnhanced frontend interfaces using **React** and **Next.js**, ensuring responsive design and integration with backend services for a user-friendly experience while improving load times by up to **50%**.\nAutomated continuous integration and deployment processes using CI/CD tools like **GitHub Actions** to ensure consistent code quality and reduce deployment time to less than **5 minutes**.\nConducted rigorous performance testing and tuning using **Apache JMeter** and **Locust**, successfully identifying and resolving bottlenecks that resulted in improvements of transaction processing speeds by over **25%**.\nCollaborated on multi-disciplinary projects, integrating various AI technologies and frameworks to deliver innovative solutions that catered to evolving business needs."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, Node.js\n\n  **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n  **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n  **API Technologies:**\n\tREST & gRPC APIs, API design, prompt engineering\n\n  **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Vector Databases (Pinecone, Weaviate, Chroma)\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n  **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n  **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, AI integration, LLM-based solutions, LangChain, LangGraph, OpenAI, Anthropic"
}