{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior Software Engineer with 8 years of experience, specializing in **Java**, **Java EE**, **SQL**, and **JavaScript** for delivering high-performance software solutions. Proficient in developing dynamic web applications using **React**, **Vue.js**, **Angular**, and **HTML/CSS**, with a robust understanding of Object-Oriented Programming principles. Adept at implementing both **REST** and **SOAP** APIs, ensuring seamless data flow and integration.\nFocused on best practices in UX and Quality Assurance to produce user-centric applications, while driving technical documentation and adhering to version control standards. Proven problem-solving skills, coupled with a passion for collaboration and mentoring within cross-functional teams.\nPreviously led full-stack development efforts leveraging **Node.js**, **Flutter**, **FastAPI**, and **Django**, with substantial cloud expertise in **Azure** and **AWS**. Demonstrated experience in microservices architecture, building enterprise-grade platforms that meet compliance standards such as HIPAA and PCI DSS while incorporating Machine Learning capabilities into production environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and developed applications using **Java**, **Java EE**, **SQL**, **JavaScript**, **HTML**, **CSS**, and modern frameworks including **React**, **Vue.js**, and **D3**, adhering to Object Oriented Programming principles and best practices.\nImplemented and maintained **REST** and **SOAP** web services, ensuring seamless communication between systems and integration of third-party APIs through **AJAX** and **JSON**.\nLed the optimization of database performance utilizing **JPA** and **Hibernate** for a robust data persistence layer, enhancing application speed and reliability.\nCollaborated on complex software projects utilizing **Version Control** systems, ensuring effective branching, merging, and documentation of code changes for team transparency.\nMentored junior software engineers, fostering a collaborative learning environment and enhancing team capabilities in software development best practices and problem-solving techniques.\nConstructed high-quality user interfaces with **HTML**, **CSS**, and **JavaScript** that deliver outstanding UX while leveraging frameworks like **Angular**, **Backbone.js**, and **Ember.js** for dynamic content rendering.\nAuthored comprehensive technical documentation to streamline project knowledge transfer and ensure clear communication among stakeholders.\nDeveloped and executed quality assurance testing strategies utilizing tools and frameworks like **Jest**, **Postman**, and **Cypress** to validate software functionalities and enhance reliability.\nManaged multiple projects simultaneously while adhering to Agile methodologies, leading to successful product delivery within estimated timelines. \nEnhanced application analytics and data visualization capabilities using **D3.js**, providing stakeholders with meaningful insights into application performance and user behavior."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained scalable software solutions utilizing **Java** (version **8**), **Java EE**, and **REST**ful web services, ensuring high-quality performance for enterprise-grade applications.\nImplemented Object-Oriented Programming principles and design patterns, enhancing code reusability and maintainability that led to a decrease in bug reports by **20%**.\nCollaborated with cross-functional teams to deliver reliable user interfaces by applying **JavaScript**, **HTML**, **CSS**, and **SQL** for seamless data integration and user interaction.\nGuided the team in utilizing **Version Control** systems to streamline code management processes, achieving a **30%** reduction in deployment time.\nConducted robust Technical Documentation practices to improve onboarding processes and maintain project standards, enhancing team collaboration and minimizing production issues.\nEmployed frameworks and libraries such as **React**, **Vue.js**, and **D3** for dynamic UI development, ensuring good UX practices and responsive design for diverse user bases.\nChampioned best practices in Quality Assurance and software testing, introducing automated test scripts that reduced testing time by **25%**.\nLed mentoring sessions to foster skills in **JavaScript** frameworks and Object-Oriented principles, promoting a culture of continuous improvement and innovation within the team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and maintained robust backend services using **Java (Java EE, JPA, Hibernate)**, ensuring optimal performance and reliability within a global e-commerce platform.\n• Designed RESTful APIs and integrated SOAP services for seamless data exchange, delivering efficient data retrieval and manipulation to enhance application functionality.\n• Engineered responsive frontend solutions utilizing **JavaScript (Angular, Vue.js, React)** along with **HTML5/CSS3** to create engaging and user-friendly interfaces, optimizing for both desktop and mobile platforms.\n• Implemented advanced database solutions with **SQL** and **PL/SQL**, ensuring data integrity and effective querying for high-traffic workflows within the e-commerce ecosystem.\n• Applied Object-Oriented Programming principles to deliver modular, reusable components, improving code maintainability and promoting best practices across software development.\n• Executed UX strategies and conducted Quality Assurance processes for continuous improvement, leading to a reduction in user-reported issues by **30%** after implementing changes.\n• Collaborated with cross-functional teams to drive project management initiatives, enhancing team productivity by **25%** through effective communication and mentoring.\n• Produced comprehensive technical documentation, facilitating knowledge sharing and onboarding for new team members to maintain a high level of project transparency.\n• Utilized version control best practices to manage software code changes, ensuring smooth collaboration through tools like Git.\n• Demonstrated exceptional problem-solving skills, leading to timely project delivery and mitigating risks during development cycles."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, JavaScript, TypeScript, Python\n\n **Backend Frameworks:**\n\tJava EE, Spring, FastAPI, Flask, Django, Hibernate, JPA\n\n **Frontend Frameworks:**\n\tHTML, CSS, JavaScript/TypeScript (React, Vue, Angular, Dojo, D3, jQuery, Backbone.js, Ember.js)\n\n **API Technologies:**\n\tREST, SOAP, AJAX, JSON\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n **Databases:**\n\tSQL, PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tObject Oriented Programming, Version Control, Quality Assurance, Technical Documentation, Problem Solving, Collaboration, Mentoring, Project Management",
  "apply_company": "Advarra"
}