{
  "name": "Damian Franciszek Pospiech",
  "role_name": "PHP Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "PHP Developer with 13+ years of experience in delivering high-performance web applications, leveraging expertise in **PHP** and **APIs**. Proficient in **frontend development** skills, including **React**, **Next.js**, and **Vue**, to create dynamic and responsive user interfaces. Experienced in **DevOps** methodologies to streamline development and deployment processes, ensuring high availability and performance.\nPossesses strong communication skills, facilitating collaboration in **Agile** environments and driving project success. Additionally, has hands-on experience with backend technologies, utilizing **Node.js**, and integrating **cloud services** on **AWS** and **Azure**. Background in healthcare and financial industries enhances the ability to align solutions with compliance standards for secure and robust applications.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "PHP Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed dynamic **web applications** using **PHP**, ensuring seamless integration with existing **APIs** for enhanced functionality and user experience.\n- Utilized **frontend development** frameworks to create interactive user interfaces, ensuring all designs are responsive and user-friendly.\n- Collaborated within an **Agile** framework to deliver features iteratively, contributing to sprint planning and retrospective meetings to streamline workflows and enhance team communication.\n- Implemented **DevOps** principles by creating automated deployment pipelines, facilitating continuous integration and continuous deployment (CI/CD) practices.\n- Ensured high code quality and performance through regular code reviews, leveraging tools like **PHPUnit** for automated testing and bug tracking.\n- Spearheaded the improvement of existing PHP frameworks by analyzing performance metrics, resulting in a **20%** reduction in load times.\n- Created user-friendly documentation and conducted training sessions to improve team members' understanding of system functionalities and enhance overall project communication.\n- Leveraged modern version control systems, such as **Git**, to manage codebase effectively and foster collaborative programming practices.\n- Engaged in regular communication with stakeholders to gather requirements and provide updates on project status, ensuring alignment with business goals."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and maintained robust **RESTful APIs** using **PHP**, facilitating seamless integration with various **web applications**.\n- Collaborated in an **Agile** environment to deliver high-quality features that enhance user experience in **web applications**, driving a 30% increase in user engagement.\n- Contributed to the deployment pipeline, implementing **DevOps** practices that reduced deployment times by **40%** and improved overall system reliability.\n- Designed scalable **frontend applications** utilizing frameworks such as **React** and **Vue.js**, resulting in a **25%** improvement in load times for users.\n- Established clear **communication** channels across cross-functional teams, enhancing project transparency and collaboration to meet timelines and exceed expectations.\n- Integrated third-party services through **APIs**, enabling additional functionalities and reducing development time by **15%** while ensuring code quality.\n- Led retrospectives to identify areas of improvement in **Agile** practices, facilitating a smoother workflow and delivering projects on time with a **20%** increase in team efficiency.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed robust **PHP**-based APIs to enhance backend functionality for web applications, ensuring seamless integration with third-party services and internal systems.\nCollaborated in an **Agile** environment to deliver high-quality web applications, conducting regular sprint meetings and code reviews to ensure continuous improvement.\nOptimized and maintained existing web applications by leveraging best practices in **DevOps** to streamline deployment processes and enhance application performance.\nFocused on **Frontend Development** by collaborating with UI/UX designers to create user-friendly interfaces, enhancing user experience through responsive design principles.\nCommunicated effectively with cross-functional teams to align on project requirements and deliverables, ensuring project milestones are met within set timelines.\nIntegrated APIs for third-party services, achieving a **25%** increase in data retrieval speed, while maintaining application integrity.\nUtilized version control systems such as Git, achieving a **30%** improvement in team collaboration on coding projects.\nLed the migration of legacy systems to a modern **PHP** framework, improving application maintainability by **40%** and reducing downtime during updates.\nEnsured comprehensive documentation for APIs and application workflows, facilitating easier onboarding and understanding for new team members."
    }
  ],
  "skills": "**Programming Languages:**\n\tPHP, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\tWeb Applications, Frontend Development, Agile, Communication"
}