{
  "name": "Andrzej Ito",
  "role_name": "Senior Query Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Query Engineer, I possess extensive expertise in **SQL**, **query planning**, **cost-based optimization**, and **execution engines** with over 9 years of relevant experience. My proficiency in **indexing strategies**, **Apache Spark**, **Trino**, **PrestoDB**, and **Apache Hive** allows me to design and implement efficient database solutions that optimize performance. I have a proven record of enhancing database performance and contributing to open source projects, while leading cross-functional teams and mentoring junior engineers. My passion for driving technical excellence and delivering user-centric projects ensures innovation and high-quality outcomes in every endeavor.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Query Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2022",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Conduct in-depth planning and optimization of SQL queries to enhance database performance across various database systems, including Oracle, MySQL, and PostgreSQL.\n• Implement cost-based optimization strategies to improve query execution in **Apache Hive** and **Trino**.\n• Utilize indexing strategies to ensure quick data retrieval and efficient execution engines across SQL databases.\n• Develop and execute complex queries and leverage **Apache Spark** for large scale data processing, achieving an increase in processing speed by **40%**.\n• Engage in open source contributions, specifically focusing on optimizations and enhancements within **PrestoDB** to improve overall query efficiency.\n• Collaborate with cross-functional teams to diagnose and resolve database performance issues, leading to a **30%** improvement in application response time.\n• Automate workflows for query performance monitoring and optimization using tools like **Jenkins**, ensuring continuous integration and deployment efficiency."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2022",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed and optimized SQL queries for enhanced database performance utilizing **Apache Hive** and **Trino**.\n• Executed query planning and cost-based optimization techniques to streamline data retrieval processes.\n• Collaborated on **Apache Spark** projects to enhance data processing capabilities across the system, improving execution speed by 30%.\n• Implemented indexing strategies which reduced query execution time by 25% on large datasets.\n• Contributed to open source initiatives related to **PrestoDB**, enhancing query efficiency and functionality.\n• Analyzed and fine-tuned execution engines to optimize query performance and resource allocation.\n• Conducted in-depth performance testing and monitored database performance, achieving a reduction in load time from 5 seconds to under 2 seconds.\n• Developed user-friendly interfaces for query performance dashboards using **React 12** and integrated real-time data visualizations via **ChartJS**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Leveraged **SQL** to conduct advanced query planning and performance optimization across **Apache Spark**, **Trino**, and **PrestoDB** for faster data retrieval and processing in web applications.\n• Employed cost-based optimization techniques to improve **database performance**, achieving up to **40%** faster query execution times in high-load environments.\n• Designed and implemented efficient indexing strategies, which resulted in a **30%** reduction in query response times for large datasets.\n• Contributed to open-source projects related to **Apache Hive** enhancing community tools, improving database functionalities, and methodologies.\n• Collaborated with cross-functional teams to enhance implementation strategies for execution engines, providing robust data processing solutions.\n• Developed and maintained automated testing scripts that improved the reliability of the SQL queries, decreasing bug occurrences by **25%**."
    }
  ],
  "skills": " **Programming Languages** \n\t Java, C++, C#, Python, Kotlin \n\n **Backend Frameworks** \n\t Spring, Spring Boot, Hibernate, Struts, JPA \n\n **Frontend Frameworks** \n\t React, Vue, Angular \n\n **API Technologies** \n\t SOAP, REST APIs, Microservices \n\n **Databases** \n\t SQL, MS SQL Server, Oracle, MongoDB, Redis, PostgreSQL, Apache Hive \n\n **Big Data Technologies** \n\t Apache Spark, Trino, PrestoDB \n\n **Performance Optimization** \n\t query planning, cost-based optimization, execution engines, indexing strategies, database performance optimization \n\n **Other** \n\t SOLID, DRY, LINQ, Rabbit MQ, open source contributions",
  "apply_company": "BairesDev"
}