{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Results-driven Senior Software Engineer with 8+ years of experience in software development, proficient in **TypeScript**, **NodeJS**, and **Express** for building high-performance applications. Strong knowledge of **MySQL** and **Redis** for robust database management, alongside experience with **Elasticsearch** for powerful search functionalities. Skilled in modern frontend frameworks such as **Angular**, **React**, and **Vue.js** to deliver dynamic user experiences. Adept at utilizing cloud services like **AWS**, with experience in monitoring and observability tools including **Prometheus** and **Grafana**. Proven ability to work collaboratively using **Git** for version control and **Notion** for project management, while maintaining a focus on best practices in software engineering. Committed to delivering scalable, secure, and efficient software solutions for complex business challenges.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed and optimized scalable applications using **TypeScript**, **NodeJS**, and **Express**, focusing on delivering efficient and maintainable code for complex projects.\n• Integrated databases such as **MySQL** and **Redis** to enhance data storage solutions, improving retrieval times by up to **30%** for large datasets.\n• Designed and developed front-end applications using **Angular**, **React**, and **Vue.js**, ensuring seamless user experiences across various platforms.\n• Collaborated with cross-functional teams to implement CI/CD pipelines with **Git**, automating deployment processes and reducing release times by **40%**.\n• Implemented observability solutions using **Prometheus** and **Grafana** to monitor application performance and ensure uptime, successfully reducing incident response times by **25%**.\n• Conducted code reviews and mentored junior developers in best practices for **TypeScript**, enhancing overall code quality and team productivity.\n• Designed and maintained APIs using **NodeJS** to facilitate communication between front-end applications and back-end services, reducing latency by **20%**.\n• Actively participated in Agile ceremonies, contributing to sprint planning and retrospectives, resulting in improved team workflows and project timelines.\n• Improved search functionality in applications by integrating **Elasticsearch**, reducing query response times significantly for real-time data retrieval.\n• Utilized project management tools like **Notion** to document development processes and collaborate efficiently with team members."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic front-end applications utilizing **Angular**, **React**, and **Vue.js**, ensuring high responsiveness and user engagement across platforms.\n• Collaborated in building server-side applications with **NodeJS** and **Express**, leveraging **MySQL** and **Redis** for robust data management to enhance efficiency by **30%**.\n• Implemented CI/CD pipelines using **Git** and automated testing frameworks, fostering a continuous delivery environment and reducing deployment time by up to **50%**.\n• Conducted system monitoring and performance tracking using **Prometheus** and **Grafana**, providing actionable insights to improve application performance consistently by **25%**.\n• Executed centralized logging and error tracking with the **Elasticsearch** stack to enhance troubleshooting and debugging capabilities in production environments.\n• Designed and developed RESTful APIs in **NodeJS**, facilitating seamless integration and real-time data sharing among applications, increasing system interactivity and performance.\n• Enhanced data handling and processing efficiency by implementing caching mechanisms with **Redis**, resulting in quicker response times for end-users.\n• Spearheaded technological migrations by refactoring legacy systems into modern frameworks with **NodeJS**, improving code maintainability and scalability.\n• Led collaborative team efforts in agile environments, utilizing **Notion** for project management to facilitate communication and efficiency within the development team.\n• Participated in architectural discussions and contributed to code reviews, ensuring the adoption of best practices in software development to maintain high code quality and performance."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Leveraged modern frameworks such as **TypeScript**, **NodeJS**, and **Express** to design scalable backend services for an e-commerce platform, resulting in a performance boost of up to **30%** across transaction processing.\nDeveloped robust RESTful APIs facilitating real-time customer interactions, ensuring seamless integration with frontend frameworks like **React**, **Angular**, and **Vue.js**.\nImplemented optimizations using **MySQL** and **Redis** to improve query performance, achieving a latency reduction of up to **40%**.\nAutomated deployment pipelines with **Git** and integrated monitoring solutions using **Prometheus** and **Grafana**, ensuring operational efficiency and system reliability.\nUtilized **AWS** services for cloud deployment, enhancing application scalability and availability during peak traffic times by **50%**.\nDesigned and executed unit and integration tests in JavaScript with frameworks to ensure code quality and minimize bugs in production environments.\nConducted thorough performance testing and monitoring strategies with **Elasticsearch**, identifying and addressing bottlenecks for improved user experience.\nCollaborated effectively using **Notion** for documentation and project management, facilitating clear communication within the team.\nEngaged in continuous learning of new technologies and frameworks to stay updated with industry standards and improve personal and team performances."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, NodeJS, Express\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3)\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Prometheus, Grafana\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Git, Elasticsearch, Notion",
  "apply_company": "Passport"
}