{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Full Stack Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven Senior Full Stack Software Engineer with 13+ years of experience in designing and developing high-performance applications, particularly in the healthcare and financial industries. Proficient in **C#/.NET**, **React**, SQL Server, and implementing unit testing and automated coverage to ensure quality and reliability within software products. Experienced in API design and development, and deploying cloud-hosted systems on **Azure**, aligning with agile principles and lean delivery methodologies. \n\nSkilled in creating innovative solutions leveraging **JavaScript**, **TypeScript**, **Python**, and **Flutter** for both frontend and backend development, utilizing **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept at building AI/ML-powered platforms with a focus on predictive analytics, automation, and real-time processing. Extensive experience in implementing CI/CD pipelines, microservices, and event-driven architectures. Strong adherence to compliance-driven development standards like HIPAA, FHIR, PCI DSS, and SOC 2, coupled with a solid MLOps background involving model training and orchestration with **MLflow**, **Airflow**, and **Kubeflow**. Excellent communicator with a collaborative mindset, consistently driving team success.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed API design and implementation using **C#/.NET** in alignment with agile principles, ensuring seamless communication and collaboration with cross-functional teams.\n• Led the creation of cloud-hosted systems on **Azure**, facilitating continuous integration and automated coverage for robust and scalable applications.\n• Engineered full-stack solutions utilizing **React** to deliver interactive user interfaces, ensuring adherence to best practices in unit testing and automated quality checks.\n• Spearheaded the adoption of automated testing frameworks like Jest and Cypress, ensuring comprehensive testing across all platforms, maintaining high standards of unit testing and automated coverage.\n• Collaborated on the development of SQL Server-based data architectures, designed for efficient data retrieval and processing to optimize application performance.\n• Implemented CI/CD pipelines within dynamic Agile frameworks, fostering lean delivery methodologies to accelerate project timelines and enhance product quality.\n• Championed design and implementation of secure REST APIs, allowing efficient interaction between various services and systems while ensuring compliance with industry standards.\n• Provided mentorship and guidance on **React** best practices, enhancing team skills and driving a culture of continuous improvement.\n• Analyzed and refined development processes utilizing feedback loops and retrospective analysis, contributing to a higher efficiency in code deployment cycles.\n• Engaged actively in cross-team collaborations to align on project objectives, fostering an environment of communication and teamwork to meet shared goals."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **C#/.NET** for building robust, cloud-hosted systems, ensuring high availability and performance of critical applications.\nImplemented comprehensive **API design and development** practices to facilitate seamless integration and communication between services, enhancing overall system interoperability.\nDeveloped user-centric applications using **React** (18), employing unit testing and automated coverage techniques to ensure code quality and reliability in production environments.\nIntegrated continuous integration and deployment (CI/CD) pipelines using Azure DevOps, optimizing delivery processes and reducing production deployment time by **30%**.\nUtilized **SQL Server** for efficient data management, enhancing query performance and ensuring the integrity of data across platforms.\nAdhered to **agile principles** and **lean delivery** methodologies to promote collaborative work practices and accelerate project timelines by **25%**.\nExecuted effective communication strategies within cross-functional teams, improving collaboration efficiency and fostering a positive work environment.\n\nIn addition to the required skills, contributed to back-end services using **Python** (FastAPI/Django) and other technologies to enhance functionality and performance of applications, driving user engagement and satisfaction.\nSuccessfully developed ETL pipelines utilizing **Apache Airflow** for data ingestion, significantly increasing data processing capabilities and efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- API design and development of backend services using **C#/.NET**, ensuring seamless integration and communication with frontend applications.\n- Developed interactive and performant user interfaces with **React**, implementing unit testing and automated coverage to ensure high-quality code and user experiences.\n- Leveraged **SQL Server** for efficient data storage and retrieval, optimizing queries for better performance in high-traffic scenarios.\n- Applied **continuous integration** practices to streamline deployment processes, enhancing the development lifecycle and reducing time-to-market by **30%**.\n- Designed and managed cloud-hosted systems on **Azure**, ensuring high availability and scalability in line with business objectives.\n- Championed agile principles and lean delivery strategies to improve team workflows and project outcomes, resulting in a **25%** increase in project velocity.\n- Fostered a culture of collaboration and communication within cross-functional teams, ensuring alignment between development, design, and product management for better stakeholder engagement.\n- Conducted performance tuning and optimization for existing applications, leading to a **40%** reduction in load times and improved user satisfaction.\n- Implemented version control practices to manage code changes effectively, ensuring a robust development framework across the team.\n- Developed comprehensive documentation for APIs and software functionalities, facilitating clearer understanding and onboarding processes for new team members."
    }
  ],
  "skills": " **Programming Languages:** \n\tC#/.NET, Python, JavaScript/TypeScript \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n\n **Frontend Frameworks:** \n\tReact, Vue, Angular \n\n **API Technologies:** \n\tAPI design and development \n\n **Serverless and Cloud Functions:** \n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database \n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis, SQL Server \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n\n **Cloud & Infrastructure:** \n\tcloud-hosted systems \n\n **Other:** \n\tMLflow, Airflow, Kubeflow, unit testing, automated coverage, continuous integration, agile principles, lean delivery, communication, collaboration, Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}