{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Integration Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Integration Engineer with 8 years of comprehensive experience, I excel in API development and design, utilizing **Python**, **JavaScript**, and **RESTful** architectures to create scalable solutions that enhance communication systems. My proficiency extends to integrating **AI** and **NLP** technologies into platforms, ensuring robust functionality and intelligent data processing. I also bring expertise in CRM systems, facilitating seamless integration for enhanced customer engagement.\nMy hands-on experience with modern frameworks and libraries, including **Node.js** and machine learning techniques, enables me to build and optimize solutions tailored for diverse environments. I thrive in cloud ecosystems like **Azure** and **AWS**, supporting distributed applications that require video conferencing and VoIP functionalities. With a solid background in microservices architecture and CI/CD automation, I am adept at delivering secure applications aligned with compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Integration Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and integrated RESTful APIs to enhance system interoperability and data exchange between healthcare and financial applications.\n- Utilized **Python** and **JavaScript** to create robust backend services and dynamic client-side functionalities, ensuring seamless user experiences in high-traffic environments.\n- Collaborated with data scientists to deploy **NLP** models, enabling sophisticated document parsing and data extraction which streamlined operations in healthcare and finance.\n- Implemented AI-driven features to optimize user engagement and data utilization, driving significant improvements in customer relationship management within **CRM** systems.\n- Designed and maintained logging and monitoring tools to ensure high availability and performance of integration services, reporting on system metrics to support proactive maintenance.\n- Contributed to the usage of **VoIP** technologies for enabling real-time video conferencing and communication tools for healthcare providers, facilitating remote consultations and meetings.\n- Built and enhanced CI/CD pipelines, significantly reducing deployment times by over **30%** while improving code quality through automated testing and security scanning processes.\n- Led integration projects resulting in a **25%** increase in transaction processing speed through optimized code and infrastructure design practices.\n- Conducted performance testing and optimization for major integrations, achieving response time improvements of **40%** on average for API calls and queries.\n- Provided technical guidance on best practices for coding and integration standards based on industry benchmarks and regulatory compliance requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and integrated robust **APIs** to streamline communication between financial platforms and third-party services, ensuring seamless data exchange and enhancing user experience.\nUtilized **Python** (FastAPI, Django) and **JavaScript** (Node.js, NestJS/Express) to design and implement scalable, maintainable systems for handling financial transactions, resulting in an increase in transaction processing speed by **30%**.\nLeveraged **NLP** and **AI** technologies to develop intelligent features that enhance customer support interactions within CRM systems, improving client satisfaction by **25%**.\nImplemented **RESTful** architectures for the efficient design of web services, allowing for rapid deployment and easy integration with external systems.\nEnhanced video conferencing capabilities by integrating **VoIP** solutions into financial platforms, ensuring high-quality communication for remote teams.\nBuilt dynamic applications with **React** (18), **Vue 3**, and **Next.js**, leading to a reduction in page load times by **40%** through optimized coding and responsive design.\nCreated advanced ETL pipelines utilizing **Python**, Apache Airflow, and **Azure Data Factory** for efficient data processing, successfully handling **2TB** of financial data daily from diverse sources.\nFostered collaboration between cross-functional teams and stakeholders, ensuring the execution of integration projects aligned with business goals and technical requirements."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed APIs for seamless integration and communication between various services and applications, ensuring adherence to **RESTful** principles and optimum performance.\nEngineered backend services using **Python** frameworks (Django, FastAPI) and **JavaScript** technologies (Node.js, Express) to enhance integration capabilities across CRM systems and enhance overall application performance.\nLeveraged **NLP** techniques to optimize data extraction and processing within integrated systems, improving the accuracy of customer data management and real-time interactions.\nIntegrated VoIP and video conferencing solutions using third-party APIs, enhancing customer communications and support functionalities to ensure effective service delivery.\nCollaborated with cross-functional teams to define integration requirements and establish streamlined workflows, contributing to a **25%** increase in operational efficiency.\nImplemented **AI** capabilities by integrating machine learning models for predictive analytics, enhancing data-driven decision-making processes within CRM environments.\nManaged data synchronization tasks using automated scripts, achieving a **99%** accuracy rate in data consistency across multiple systems.\nDesigned and implemented scalable microservices architecture, resulting in improved system modularity and reduced time-to-deployment by **30%**.\nCreated comprehensive documentation for all integration processes and workflows, facilitating better team collaboration and knowledge sharing across departments."
    }
  ],
  "skills": "Programming Languages:\n\t**Python**, **JavaScript**\n\n**Backend Frameworks:**\n\t**FastAPI**, **Flask**, **Django**\n\n**Frontend Frameworks:**\n\t**React**, **Vue**, **Angular**\n\n**API Technologies:**\n\t**APIs**, **RESTful**\n\n**Serverless and Cloud Functions:**\n\t**AWS (ECS, Lambda, RDS, S3)**, **Azure (App Services, Blob, SQL)**\n\n**Databases:**\n\t**PostgreSQL (Fintech)**, **MySQL (Healthcare)**, **MongoDB (Gaming)**, **Redis**\n\n**DevOps:**\n\t**Docker**, **Kubernetes**, **GitHub Actions**, **GitLab CI/CD**, **Terraform**, **Ansible**, **Helm**, **Docker Compose**\n\n**Cloud & Infrastructure:**\n\t**AWS**, **Azure**\n\n**Other:**\n\t**AI**, **MLflow**, **Airflow**, **Kubeflow**, **Nginx**, **Certbot**, **Keycloak (OIDC, RBAC)**, **JWT**, **OAuth2**, **VoIP**, **video conferencing**, **CRM**, **NLP**",
  "apply_company": "8x8"
}