{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Technical Solutions Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Technical Solutions Engineer with extensive experience in developing technical solutions tailored for emergency lighting systems and lighting planning. Proven expertise in managing projects, enhancing customer relationship management, and collaborating with sales teams to deliver exceptional outcomes. Exceptional communication and presentation skills, complemented by active listening and a deep understanding of relevant regulations.\nPossessing strong problem-solving abilities and an entrepreneurial spirit, with a commitment to driving innovative solutions. Skilled in using technologies such as **JavaScript**, **TypeScript**, **Python**, and frameworks like **React**, **Node.js**, and **Django** to build applications. Proficient in cloud services including **AWS** and **Azure**, alongside microservices and CI/CD practices, ensuring successful project execution. Fluent in **German** and **English**, enabling effective stakeholder engagement.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Technical Solutions Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed technical solutions for **emergency lighting systems**, ensuring compliance with relevant regulations in a timely manner, enhancing project management practices to deliver projects on budget.\nCollaborated with sales teams to create tailored presentations, demonstrating the value of **lighting planning** and **technical solution development**, resulting in a **25%** increase in customer engagement during demos.\nManaged customer relationships through effective communication and active listening, leading to a **30%** improvement in customer satisfaction scores based on feedback.\nUtilized **German** and **English language proficiency** to interact with a diverse clientele, ensuring that technical specifics are conveyed clearly to customers and stakeholders.\nImplemented project management methodologies, focusing on stakeholder needs and enhancing project delivery timelines by **15%** on average.\nLed cross-functional teams in creative problem-solving sessions, successfully addressing technical challenges associated with lighting systems and enhancing overall project success.\nConducted thorough presentations on project updates and solutions to clients, utilizing strong presentation skills to reinforce understanding and garner client trust.\nEngaged in collaborative efforts to refine customer support processes, leading to streamlined service delivery and improved project outcomes for lighting solutions.\nFostered an entrepreneurial spirit within teams, encouraging innovative approaches to customer projects and technical challenges, increasing overall project development efficiency by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed and implemented technical solutions for emergency lighting systems, ensuring compliance with relevant regulations while enhancing overall project outcomes.\nManaged and collaborated with sales teams to identify customer needs and provide tailored lighting planning solutions, leveraging **project management** skills to ensure timely delivery of projects.\nCreated and presented detailed technical presentations to clients, effectively communicating complex concepts in both **German** and **English**, enhancing customer relationship management and satisfaction.\nUtilized active listening and creative problem-solving skills to address client challenges and deliver customized solutions, resulting in a **15%** increase in customer retention.\nLed initiatives to improve collaboration among team members, enhancing the effectiveness of project execution and stakeholder engagement.\nDesigned and developed innovative technical solutions within tight deadlines, demonstrating an entrepreneurial spirit to drive business growth and customer success."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and managed **technical solutions** for emergency lighting systems, ensuring compliance with relevant regulations and enhancing **customer relationship management** through effective communication.\nLed **project management** initiatives by planning and executing **lighting solutions** tailored to customer needs, significantly improving project delivery timelines by **25%**.\nUtilized **creative problem-solving** skills to overcome challenges during solution implementation, resulting in a **30%** increase in customer satisfaction scores.\nCollaborated with sales teams to align technical insights with customer requirements, enhancing presentations and technical demonstrations, leading to a **15%** boost in sales conversions.\nConducted presentations in both **German** and **English**, translating complex technical information into easily digestible content for diverse clientele.\nExercised **active listening** to accurately capture client specifications, ensuring tailored solutions that align with customer expectations and regulatory standards.\nCultivated an **entrepreneurial spirit** by identifying opportunities for product improvement within the emergency lighting portfolio, proposing enhancements that led to increased market competitiveness.\nDesigned and implemented customized lighting plans, utilizing industry knowledge to maintain compliance and enhance functionality across installations."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\temergency lighting systems\n\tlighting planning\n\ttechnical solution development\n\tproject management\n\tcustomer relationship management\n\tpresentation skills\n\tcommunication skills\n\tactive listening\n\tGerman language proficiency\n\tEnglish language proficiency\n\tentrepreneurial spirit\n\tcreative problem-solving\n\tcollaboration with sales teams\n\tknowledge of relevant regulations"
}