{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior .NET Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior .NET Engineer with 8 years of full stack development experience, specializing in **.NET**, **C#**, **SQL Server**, and **.NET Core**. Proficient in building and optimizing high-performance applications, leveraging technologies such as Visual Studio and **ETL** processes. My background includes implementing robust architectures and seamless integrations, ensuring compliance with industry standards. I have a solid grasp of software quality through tools like **Sonar** and experience in developing user interfaces with **jQuery**.\nIn addition to .NET expertise, I possess a strong foundation in JavaScript/TypeScript and Python, having built solutions in healthcare and financial sectors with frameworks like **React**, **Next.js**, **Vue**, and server-side technologies like **Node.js**, **FastAPI**, and **Django**. My capabilities extend to cloud services, with hands-on experience in **Azure** and **AWS**. I have led enterprise-grade platform developments incorporating advanced AI/ML capabilities for predictive analytics and intelligent automation, while also implementing CI/CD automation to enhance deployment efficiency.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior .NET Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained robust backend services using **.NET Core**, **C#**, and **SQL Server**, ensuring high performance and reliability in data handling and processing for healthcare and financial platforms.\nArchitected solutions with best practices in **WCF** for service-oriented architecture, enabling seamless communication between distributed systems and data flows.\nImplemented ETL processes for efficient data transformation and loading, utilizing **SQL Server** tools to streamline data integration tasks.\nExecuted code quality checks and improvements using **Sonar**, ensuring adherence to company standards and best practices across all services.\nUtilized **Visual Studio** for efficient development and debugging, enhancing productivity and code maintainability through advanced IDE features.\nDesigned and developed user-friendly web interfaces with **jQuery**, enhancing client-side interactivity and user experience, complying with accessibility standards.\nCollaborated with cross-functional teams to gather requirements, ensuring that delivered software meets business objectives and user needs.\nDocumented processes and systems while providing training and support to junior developers, fostering a culture of knowledge sharing and continuous improvement within the team.\nParticipated in Agile development methodologies, contributing to sprint planning, reviews, and retrospectives to refine project deliverables and improve team efficiency.\nLeveraged expertise in the English language at a B2 level to communicate effectively with international stakeholders and maintain clear project documentation."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained high-performance applications using **.NET**, **C#**, and **.NET Core**, ensuring robust and scalable solutions for financial systems.\nUtilized **SQL Server** for efficient data management, improving query performance by **35%** through optimization techniques and proper indexing.\nImplemented ETL processes to automate data flow using tools and frameworks compatible with **.NET**, driving a **20%** reduction in data processing time.\nLeveraged **Visual Studio** and **Sonar** for continuous integration and code quality checks, resulting in a **15%** increase in code maintainability over the project lifecycle.\nCreated and integrated frontend components with **JQuery** to enhance user interactivity, delivering an optimal user experience across various financial applications.\nCollaborated with cross-functional teams to develop APIs and services using **WCF**, enabling seamless data exchange between systems and applications.\nDocumented technical specifications and code libraries in English, ensuring clarity and accessibility for team and project stakeholders, maintaining a **B2** proficiency level for technical writing and communication."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and developed robust backend services for enterprise-level applications utilizing **.NET Core** and **C#**, ensuring high performance and scalability across multiple modules.\nEngineered ETL processes to efficiently manage and transform large datasets using **SQL Server** while ensuring data integrity and performance optimization.\nCollaborated in a team environment utilizing **Visual Studio** for code development and debugging, achieving a decrease in deployment time by **30%**.\nImplemented best practices for code quality and maintainability using **Sonar** for continuous integration and code analysis, enhancing overall product stability.\nSupported front-end development by integrating **jQuery** for dynamic content updates, resulting in a more interactive user experience.\nWrote comprehensive unit and integration tests, achieving over **85%** test coverage and minimizing the risk of defects through the implementation of continuous testing practices.\nAdhered to Agile methodologies to deliver high-quality software, completing user stories within sprint deadlines with a focus on iterative development and stakeholder feedback.\nParticipated in code reviews and mentored junior developers, fostering a culture of knowledge sharing and continuous improvement within the team.\nUtilized advanced SQL queries for reporting and analytics, providing stakeholders with critical insights that contributed to strategic decision-making.\nMaintained documentation for all code and processes, ensuring clarity and continuity across project cycles, improving onboarding time for new team members by **25%**."
    }
  ],
  "skills": "Programming Languages:\n\tC#, .NET, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET Core, WCF\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, jQuery\n\n**API Technologies:**\n\tMLflow, Airflow, Kubeflow, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, SQL Server, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Sonar\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tKeycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, English B2, ETL",
  "apply_company": "KAIROS DIGITAL SOLUTIONS"
}