{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I excel in observability and telemetry, developing high-performance solutions while promoting community collaboration and open-source contributions. My background encompasses multi-language programming and comprehensive documentation skills, ensuring an improved developer experience and teamwork through active feedback integration. I specialize in full-stack development leveraging **JavaScript**, **TypeScript**, **Python**, and **Flutter**, with extensive knowledge of frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Coupled with robust cloud experience on **Azure** and **AWS**, I have successfully led the creation of enterprise-grade platforms that integrate AI/ML capabilities for predictive analytics, intelligent automation, and real-time data processing. With expertise in microservices architecture, event-driven systems, and CI/CD automation, I build secure applications conforming to compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, I possess hands-on experience in developing machine learning pipelines, serving ML models in production, and implementing MLOps workflows utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Fostered community collaboration and developer experience by contributing to open-source projects and ensuring comprehensive documentation.\n- Enhanced observability and telemetry in applications by integrating **OpenTelemetry**, improving monitoring and debugging processes across development teams.\n- Led the architectural design and development of scalable software solutions, ensuring a high-quality programming environment using **TypeScript** and **Python (FastAPI)**.\n- Implemented effective teamwork strategies to ensure projects met deadlines, leveraging direct feedback mechanisms to drive improvements.\n- Architected and developed scalable, full-stack healthcare and financial platforms using **TypeScript**, **Python (FastAPI)**, **Node.js**, and modern front-end frameworks including **React (17-18)**, **Next.js**, and **Vue (3.x)**, while ensuring compliance with HIPAA, FHIR, GDPR, and financial regulatory standards (e.g., PCI DSS, SOX).\n- Developed and deployed cross-platform mobile applications using **Flutter** and **React Native**, delivering seamless healthcare and fintech user experiences across iOS and Android platforms, with native module integration and state management using Provider and Redux.\n- Implemented mobile-specific CI/CD pipelines using **Fastlane** and **App Center**, with automated testing, release management, and crash/error analytics via **Firebase Crashlytics** and **Sentry**.\n- Led the re-architecture of monolithic applications into microservices-based ecosystems, employing **Docker**, **Kubernetes (AKS/EKS)**, and serverless architectures (**AWS Lambda**, **Azure Functions**), enabling high availability and fault tolerance.\n- Designed and maintained cloud-native data architecture using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, optimizing for large-scale healthcare and financial data ingestion, storage, and querying.\n- Designed and deployed machine learning models for use cases such as patient risk prediction, financial fraud detection, and document classification using **Python (scikit-learn, PyTorch, TensorFlow)**, and integrated real-time inference services into the backend.\n- Built MLOps pipelines using **MLflow**, **DVC**, and **Apache Airflow** for continuous training, validation, versioning, and deployment of models across development and production environments.\n- Integrated AI-based features into client-facing applications, such as smart financial dashboards, personalized health recommendations, and predictive alerts, powered by trained models and APIs hosted on **Azure ML** and **AWS Sagemaker**.\n- Implemented enterprise-level DevOps pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI**, incorporating linting, testing, security scans, and multi-environment deployments for both web and API services.\n- Delivered complex financial data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded**, enabling real-time insights into transaction trends, fraud detection, and operational KPIs.\n- Collaborated with data scientists to integrate NLP models (using **spaCy**, **Hugging Face Transformers**) for healthcare document parsing and financial anomaly detection, embedding them into core services through RESTful APIs.\n- Established test strategies using **Jest**, **Cypress**, **PyTest**, and **Postman**, covering unit, integration, E2E, and contract testing across both front-end and backend services.\n- Integrated **Azure Cognitive Search** and **ElasticSearch** to enable advanced search capabilities across millions of unstructured and structured health records and financial documents."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Enhanced **observability** and **telemetry** for application monitoring and troubleshooting, improving system reliability and developer experience.\n• Collaborated with cross-functional teams, encouraging **community collaboration** and promoting **open-source** practices within the development process.\n• Documented architectural designs and project requirements to ensure clarity and facilitate team **feedback**, enhancing overall **teamwork** and project success.\n• Led the development and modernization of financial platforms by adopting a microservices-based architecture using **Node.js** (**NestJS/Express**) and **Python** (**FastAPI**, **Django**), boosting scalability, maintainability, and throughput for high-volume transaction systems.\n• Built dynamic, user-focused front-end applications using **React** (**18**), **Vue 3**, **Next.js**, and **TypeScript**, applying **Redux Toolkit** and **Tailwind CSS** to create responsive and performant user interfaces for financial dashboards and admin portals.\n• Developed real-time transaction monitoring and analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, enabling operations teams to track financial activity, detect anomalies, and generate actionable insights.\n• Integrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to establish a robust event-driven architecture, supporting asynchronous communication and real-time event processing for transactions, alerts, and compliance workflows.\n• Built and orchestrated ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory**, enabling batch and real-time ingestion of financial data from internal and third-party sources.\n• Implemented AI/ML-powered fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, analyzing transaction patterns and user behavior to proactively flag suspicious activities in banking systems.\n• Created ML pipelines for credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, integrating model inference directly into backend services for real-time decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed robust observability solutions using **OpenTelemetry** to ensure comprehensive monitoring and telemetry for backend services, enhancing system reliability and performance tracking.\n- Collaborated with cross-functional teams to foster community collaboration and improve developer experience, leading to a **30%** increase in team productivity.\n- Contributed to open-source projects, utilizing **multi-language** programming skills to enhance project documentation and support community feedback integration.\n- Designed and optimized backend services for a global e-commerce platform using **Python (FastAPI, Django)** and **Node.js (NestJS, Express)**, ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\n- Engineered real-time features using **WebSockets** and event-driven architecture powered by **Kafka** and **RabbitMQ**, enabling responsive order updates, dynamic inventory tracking, and real-time customer support.\n- Developed frontend applications using **React (18)**, **Vue 3**, and **Angular**, enhanced with **TypeScript**, **Redux Toolkit**, and **Tailwind CSS**, delivering fast, responsive user experiences on both web and mobile platforms.\n- Leveraged **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for distributed data storage, ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows and caching frequently accessed resources for performance gains.\n- Integrated AI/ML-based recommendation engines using **scikit-learn**, **LightGBM**, and **TensorFlow** to personalize product listings, optimize search relevance, and improve conversion rates based on real-time behavioral data.\n- Implemented **Redis** caching for product metadata, shopping cart sessions, and search results, significantly improving application responsiveness and reducing read pressure on databases.\n- Implemented feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes** namespaces, enabling controlled rollouts, A/B testing, and risk mitigation during major platform updates.\n- Created responsive, SEO-friendly e-commerce UIs using **Next.js**, **Vue 3 + Nuxt**, and **HTML5/CSS3**, optimized for mobile-first engagement and accessibility compliance (WCAG 2.1).\n- Built secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, applying tokenized transactions and PCI-compliant handling of sensitive data.\n- Applied role-based access control (RBAC) and **OAuth 2.0** for secure customer and admin access, ensuring GDPR compliance and user data protection throughout the platform."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOpenTelemetry\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, observability, telemetry, programming, community collaboration, open-source, developer experience, multi-language, documentation, teamwork, feedback, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)",
  "apply_company": "honeycomb.io"
}