{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "Accomplished Software Engineer with 8 years of comprehensive experience specializing in **React**, **Python**, **TypeScript**, **FastAPI**, and SQL for building high-performance applications. Proficient in developing dynamic user interfaces with **Redux** and implementing robust automated testing methodologies using **Jest** and **React Testing Library**. Skilled in continuous integration and delivery (CI/CD) processes to ensure seamless software deployment.\n\nExpert in Agile Management methodologies, including **Scrum** and experience using tools like **Jira** and **Confluence** for efficient team collaboration. Demonstrated capability in leveraging **AI-assisted development tools** to enhance productivity. I have successfully led the development of complex solutions that comply with industry standards (HIPAA, FHIR, PCI DSS, SOC 2) while ensuring robust architecture through microservices and event-driven systems.\n\nMy strong communication skills complement my technical expertise, allowing me to effectively collaborate with cross-functional teams. Additionally, I have hands-on experience in developing and implementing MLOps workflows to optimize machine learning operations.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** (17-18) and **TypeScript** to develop and architect scalable web applications in alignment with agile management principles, ensuring rapid delivery through **CI/CD** pipelines.\nEmployed **Python** (FastAPI) for backend services, focusing on automated testing with tools such as **Jest**, **PyTest**, and **React Testing Library** to maintain high code quality and performance.\nLeveraged **SQL** databases for data management, ensuring optimal performance and accessibility of financial and healthcare data across various platforms.\nCollaborated effectively within **Scrum** teams to enhance communication skills and deliver features aligned with project goals, using **Jira** and **Confluence** for project tracking and documentation.\nImplemented automated testing frameworks, improving code reliability and reducing bugs by **30%** in the production environment.\nIntegrated **Redux** for state management in applications, optimizing performance and responsiveness for end-users.\nParticipated in regular code reviews and team meetings to foster a culture of collaboration and continuous improvement within the engineering team.\nActively contributed to **GitHub Enterprise** repositories, ensuring seamless version control and collaboration among team members.\nAdapted to changing requirements while upholding strong communication skills, ensuring that stakeholders were informed of progress and challenges throughout the development cycle."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)**, **TypeScript**, and **Redux** to build dynamic and user-focused front-end applications for financial platforms, ensuring responsive and performant user interfaces for dashboards and admin portals.\nDeveloped robust back-end solutions using **Python (FastAPI, Django)** to enhance system scalability, maintainability, and throughput for high-volume transaction systems, achieving up to **30%** improvement in performance.\nEmployed **SQL** for efficient data management and queries, increasing database response times by **15%** through optimized indexing and query strategies.\nImplemented comprehensive **Automated Testing** strategies using **Jest**, **React Testing Library**, and **PyTest** to achieve at least **95%** code coverage, enhancing software reliability and reducing bugs in production.\nLed CI/CD pipeline setup using tools integrated within **GitHub Enterprise**, promoting Agile Management practices and ensuring features are continuously updated to meet business needs.\nFacilitated Agile Management and Scrum ceremonies using **Jira** and **Confluence**, improving team communication and project visibility, leading to a **20%** reduction in delivery timelines.\nEnhanced communication and collaboration across teams to drive project success and align development efforts with business priorities, showcasing strong communication skills.\nLeveraged AI-assisted development tools to streamline coding processes, further enhancing productivity and code quality across projects."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **React** (18), **TypeScript**, and **Redux** for developing dynamic frontend applications, achieving an uplift in user engagement by **35%** across the e-commerce platform.\nDesigned and implemented backend services in **Python** using **FastAPI** and **Django**, ensuring a high availability rate of **99.9%** and low latency responses for core e-commerce functionalities including checkout and order fulfillment.\nExecuted **automated testing** strategies with **Jest** and **React Testing Library** for frontend and **PyTest** for backend, increasing code reliability and reducing bugs by **40%** during releases.\nManaged project workflows using **Agile Management** principles, focusing on **Scrum** methodologies and tools like **Jira** and **Confluence** for documentation and task tracking, improving team collaboration efficiency by **25%**.\nEmployed CI/CD pipelines with **GitHub Enterprise** and **Git** for streamlined code integration and deployment, resulting in faster release cycles and enhanced product stability post-deployment.\nEngineered scalable and fault-tolerant distributed data solutions using **SQL** databases like **PostgreSQL** and **MongoDB**, achieving sub-second query response times under peak load conditions.\nIntegrated AI-assisted development tools to enhance productivity and code quality, fostering a culture of innovation and continuous improvement within the engineering team.\nFacilitated effective communication across cross-functional teams, driving clarity in project expectations and delivering high-quality software solutions aligned with company objectives."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Angular, Vue, Redux\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tAI-assisted development tools, Automated Testing, Jest, React Testing Library, PyTest, Agile Management, Scrum, Jira, Confluence, GitHub Enterprise, Git, Communication skills, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)"
}