{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Backend Engineer with 8 years of experience, I excel in utilizing **Node.js**, **TypeScript**, and **AWS** to build robust backend systems that drive performance and scalability. My proficiency in API design and event-based systems ensures seamless integration across distributed architectures. I am skilled in performance tuning and developing solutions that meet complex business needs while maintaining high compliance standards.\nAdditionally, my background encompasses full-stack development with frameworks such as **React**, **Next.js**, and **Vue**, alongside a strong foundation in **SQL** and cloud services. My strengths in communication and problem-solving equip me to collaborate effectively with cross-functional teams and deliver high-quality, efficient solutions for the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained distributed systems using **Node.js** and **TypeScript**, ensuring optimal performance tuning for high-load applications.\n- Designed and integrated robust API services, applying event-based systems principles to achieve seamless communication across microservices.\n- Collaborated with cross-functional teams to implement solutions based on AWS, utilizing managed services for scalability and reliability, focusing on cost management and performance efficiency.\n- Implemented advanced SQL query optimization techniques within **PostgreSQL** to ensure fast and efficient data retrieval across large datasets.\n- Architected and deployed solutions within **AWS Lambda** to support event-driven architectures, resulting in a reduction of server costs by **30%**.\n- Led initiatives in problem-solving by addressing critical system issues and providing innovative solutions within tight deadlines during service outages, enhancing overall system reliability.\n- Communicated technical concepts effectively to stakeholders, ensuring alignment and understanding of backend systems and their interactions with frontend applications.\n- Streamlined application performance by conducting rigorous testing and code reviews, incorporating performance benchmarks that improved backend response times by **15%**.\n- Mentored junior developers in mastering **Node.js** and **TypeScript**, fostering a culture of learning and collaboration within the engineering team.\n- Contributed to the design of data-intensive applications that serve millions of end-users, employing best practices in API design for scalability and security."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Leveraged **Node.js** with **NestJS/Express** and **Python** (**FastAPI**, **Django**) to design and modernize financial platforms, enhancing scalability and performance for high-volume transactions by **30%**.\n- Designed and implemented robust **API designs** to support back-end services, ensuring high availability and reliability while maintaining a **99.9% uptime** for distributed systems.\n- Integrated various **event-based systems** such as **Kafka**, **RabbitMQ**, and **Azure Service Bus**, enabling real-time processing and improving response times by **40%** for transaction alerts.\n- Developed and optimized SQL queries for database interactions, leading to a **15%** increase in query performance on financial data retrieval systems.\n- Employed **TypeScript** to build dynamic back-end services, fostering better code maintainability and reducing bug rates by **20%** through strict typing.\n- Spearheaded performance tuning initiatives for backend processes, dramatically improving application throughput for **10,000+** concurrent users, facilitating responsive user experiences.\n- Effectively communicated with cross-functional teams to ensure alignment on technical objectives, presenting solutions that enhanced overall project collaboration.\n- Resolved complex problems in system design and architecture, showcasing advanced problem-solving skills while delivering solutions within the agreed timelines."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services using **Node.js** (NestJS, Express) and **TypeScript** for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules like checkout and order fulfillment.\nEngineered event-driven systems powered by **Kafka** and **RabbitMQ**, enabling responsive order updates and real-time customer support, resulting in a **30%** increase in user engagement.\nDeveloped APIs and integrated with **SQL** databases, leveraging **MongoDB** and **PostgreSQL** to ensure fast, fault-tolerant data access for high-traffic e-commerce workloads, achieving **99.9%** uptime.\nPerformed performance tuning and optimization by implementing **Redis** caching to enhance application responsiveness and significantly reduce read pressure on databases, improving load times by **50%**.\nCollaborated and communicated with cross-functional teams to address problem-solving challenges in the delivery of scalable distributed systems, streamlining deployment processes with **AWS** services and ensuring compliance with cloud standards.\nImplemented effective API design practices to improve interaction efficiency and maintain code quality, while adhering to best practices in developing secure and maintainable backend architectures.\nUtilized analytics for monitoring performance and load, identifying bottlenecks and optimizing workflows through data-driven insights, contributing to an overall **40%** reduction in server response times.\n"
    }
  ],
  "skills": "Programming Languages:\n\tNode.js, TypeScript, Python, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI design\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, event-based systems, distributed systems, performance tuning, communication, problem-solving, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "ClickUp"
}