{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Electrical Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Electrical Engineer with a strong background in Power Distribution, Medium Voltage, and High Voltage systems. Expertise in Protection Relay Programming, Testing, and Commissioning, ensuring high-quality project delivery. Adept in troubleshooting complex electrical systems while providing exceptional customer service and demonstrating flexibility in dynamic environments. With over 10 years of experience, I bring leadership skills gained from directing cross-functional teams in the implementation of cutting-edge technology solutions. I am committed to driving efficiency and innovation in electrical engineering projects.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Electrical Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tLed the design and implementation of medium and high voltage **power distribution** systems, ensuring optimal performance through effective **troubleshooting** and **commissioning** processes.\n•\tUtilized advanced **protection relay programming** techniques to enhance the safety and reliability of electrical systems, resulting in a **30% reduction** in downtime and improved system efficiency.\n•\tConducted extensive testing procedures across various electrical installations, ensuring compliance with industry standards which led to a **15%** increase in overall system reliability.\n•\tDemonstrated strong leadership qualities by managing a team of engineers and technicians, successfully completing **10+** projects under budget and ahead of schedule.\n•\tCollaborated with IT departments to implement innovative technical solutions that improved customer service response times by **20%**, thereby enhancing client satisfaction.\n•\tApplied a flexible approach to problem-solving, adapting project strategies to accommodate changes and unexpected challenges without sacrificing quality.\n•\tActively engaged in ongoing professional development to stay abreast of industry trends, improving team knowledge and capabilities in high voltage systems and modern protection techniques.\n•\tProvided exceptional customer service by addressing client inquiries and concerns promptly while ensuring that all electrical projects met their specifications and requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Led the testing and commissioning of medium and high voltage electrical systems, ensuring adherence to safety standards and operational efficiency.\n- Developed and implemented protection relay programming, enhancing system reliability and minimizing downtime during high voltage operations.\n- Troubleshot complex electrical issues in power distribution systems, utilizing a methodical approach that reduced resolution time by **30%**.\n- Provided leadership to project teams, guiding engineers and technicians through successful execution of electrical projects, improving team productivity by **25%**.\n- Collaborated with IT professionals to integrate advanced monitoring systems, improving customer service through real-time performance analytics and reporting.\n- Fostered a flexible working environment, accommodating client needs while maintaining project timelines, leading to a **15%** increase in customer satisfaction ratings.\n- Managed electrical system voltages effectively, ensuring compliance with medium and high voltage standards throughout all phases of project completion.\n- Conducted comprehensive testing and validation of electrical components, achieving a **99%** success rate in operational readiness prior to system handover."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Oversaw the design and optimization of power distribution systems for medium and high voltage applications, ensuring reliability and efficiency in service delivery.\nLed the commissioning and troubleshooting of protection relay programming, utilizing technical expertise to enhance system performance and meet industry standards.\nManaged and executed extensive testing procedures to confirm the functionality and safety of electrical systems, ensuring compliance with regulatory requirements.\nProvided leadership and direction to cross-functional teams during project execution, fostering collaboration to achieve engineering goals and enhance customer service.\nDemonstrated flexibility in adapting to dynamic project needs while ensuring that all electrical systems maintain high performance in demanding scenarios.\nEngaged in customer service interactions to resolve technical inquiries, effectively communicating complex electrical concepts to clients for enhanced satisfaction.\nUtilized IT solutions to streamline workflows and improve data management in the engineering processes, thus facilitating better project tracking and reporting.\nApplied rigorous troubleshooting techniques to identify and rectify faults in power distribution equipment, ensuring minimal downtime in operations.\nDeveloped and implemented training programs for team members to improve their skills in power distribution, testing, and customer interaction, leading to improved team performance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Power Distribution, Medium Voltage, High Voltage, Protection Relay Programming, Testing, Commissioning, Troubleshooting, Leadership, IT, Customer Service, Flexibility",
  "apply_company": "Eaton"
}