{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Surveyor Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a detail-oriented Senior Surveyor Engineer with 8+ years of experience, I excel in ensuring compliance with regulatory standards and conducting thorough inspections for mechanical systems including **lift** and **crane** operations. My strong documentation skills complement my effective time management and customer interaction abilities, ensuring clarity and satisfaction in every project. With a tech-savvy approach, I utilize **tablets** and **smartphones** to streamline inspections and documentation processes. My background in software engineering enhances my problem-solving capabilities, enabling me to leverage data insights for improved operational efficiency.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Surveyor Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Ensured **Compliance** with regulatory standards and industry guidelines, conducting thorough **inspections** on projects to meet mechanical and structural integrity requirements.\n- Developed comprehensive **documentation** strategies to maintain quality control and project reporting, ensuring clear communication with stakeholders and clients.\n- Managed time efficiently to meet project deadlines without compromising quality, demonstrating excellent **time management** skills.\n- Fostered strong **customer interaction** by delivering construction insights and addressing client inquiries effectively to ensure satisfaction with services provided.\n- Led training sessions on safe operation of **lift** and **crane** equipment to enhance team proficiency and prevent accidents on-site.\n- Conducted detailed risk assessments for mechanical systems, ensuring all operations followed proper **regulatory** protocols.\n- Collaborated with project managers to streamline processes and improve **documentation** workflows, reducing project turnaround times by **15%**.\n- Oversaw inspections on-site involving **tablet** and **smartphone** tools for efficient data collection and real-time reporting, enhancing project transparency.\n- Implemented feedback mechanisms for clients using **tablet** applications to improve engagement and service delivery.\n- Analyzed project requirements, providing solutions that adhered to compliance standards and improving overall project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Ensured compliance with regulatory standards through meticulous inspections and documentation of engineering processes, enhancing operational integrity by **30%**.\n- Managed customer interactions effectively to understand project requirements and provide tailored solutions, achieving a **25%** increase in customer satisfaction ratings.\n- Utilized mechanical knowledge to operate and maintain **cranes** and **lifts**, contributing to timely project completion by minimizing equipment downtime by **15%**.\n- Implemented time management strategies to optimize workflow, leading to the successful delivery of **5+** major surveying projects within budget and on schedule.\n- Conducted detailed inspections with the aid of tablets and smartphones to streamline data collection and reporting processes, reducing the manual entry workload by **40%**.\n- Developed and maintained comprehensive documentation for all surveying activities to ensure transparency and accountability, enhancing team collaboration and communication.\n- Trained junior engineers on mechanical operation of surveying tools, improving team competency and self-sufficiency by **20%**.\n- Advocated for best practices in safety and compliance within the engineering team, significantly reducing incidents and fostering a culture of safety.\n- Assisted in the integration of innovative surveying technologies to enhance measurement accuracy and operational efficiency, being recognized as a key player in the transition to modern tools."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Ensured compliance with mechanical regulations by conducting thorough inspections, utilizing tools and techniques relevant to **Lift** and **Crane** operations, resulting in a **95%** compliance rate.\nMaintained comprehensive documentation of inspection reports and compliance checks, enhancing transparency and accountability by generating over **150** detailed reports annually.\nFostered customer interaction by addressing inquiries regarding safety and operational efficiency related to **Lift** and **Crane** usage, leading to a **30%** increase in customer satisfaction scores.\nExecuted time management skills by effectively scheduling inspections and maintenance, ensuring timely checks were performed on **10+** mechanical systems each week.\nUtilized tablets and smartphones for real-time data entry and inspections, improving data accuracy and accessibility by **40%**.\nCollaborated with regulatory bodies to ensure that all survey processes meet compliance standards, minimizing the risk of penalties and improving overall service rating.\nImplemented best practices in mechanical inspections to optimize operational flows, contributing to an overall reduction in equipment downtime by **20%**.\nPlanned and led training sessions for new surveyor engineers, enhancing team skillsets and increasing overall efficiency through the transfer of knowledge.\nDeveloped and improved inspection methodologies leveraging modern technology, which streamlined documentations and adherence to compliance frameworks. \nEngaged with multi-disciplinary teams to ensure alignment on safety protocols, thereby reinforcing the importance of compliance across all engineering operations."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST, gRPC\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Mechanical, Compliance, Regulatory, Inspection, Documentation, Time management, Customer interaction, Tablet, Smartphone, SQLAlchemy, Pydantic, Celery",
  "apply_company": "Allianz UK"
}