{
  "name": "Patryk Zaslawski",
  "role_name": "Senior QA Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a seasoned Senior QA Engineer, I bring 8+ years of expertise in software engineering, combined with a strong proficiency in **manual testing**, **UI testing**, **regression testing**, and **cross-browser testing**. I have demonstrated success in Agile environments utilizing **Jira** to enhance project management and communication. My technical acumen includes knowledge of **Python** for automation testing, as well as familiarity with **Playwright**, **Cypress**, and **Selenium** for comprehensive test coverage across various platforms, notably iOS and Android. Additionally, I possess advanced analytical skills and attention to detail, ensuring high-quality deliverables in alignment with the **SDLC** and **STLC** methodologies. My ability to collaborate effectively within teams, coupled with a robust understanding of market needs, enables me to provide efficient testing solutions that uphold the highest standards of performance while embracing cutting-edge technologies.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Led manual and automated testing strategies within an Agile framework using **Jira** to ensure adherence to the **SDLC** and **STLC** in the development of cloud-native Python applications.\n- Conducted regression testing and cross-browser testing to validate user interfaces across web and mobile platforms, employing tools like **Selenium**, **Cypress**, and **Playwright** to enhance reliability.\n- Developed comprehensive test cases and test plans that focused on detailed **UI testing** for applications supporting **iOS** and **Android**, ensuring top-notch quality of the healthcare platform.\n- Collaborated with cross-functional teams to engage in iterative feedback cycles, ensuring effective **communication** and addressing defect analysis in a timely manner.\n- Enhanced testing frameworks using **TypeScript** in conjunction with existing Python applications, increasing efficiency in UI testing and cross-platform compatibility.\n- Utilized analytical skills to dissect complex workflows and improve testing coverage, managing over **10+ projects** simultaneously under tight deadlines.\n- Championed quality assurance best practices, embedding comprehensive test strategies throughout the product lifecycle to meet compliance standards, including **HIPAA** and **GDPR**.\n- Trained and mentored junior QA engineers on the use of testing frameworks and Agile methodologies, promoting a culture of continuous improvement and attention to detail across the team.\n- Reported on testing metrics with a **30%** reduction in defect rates and improved testing accuracy under rapidly changing development requirements.\n- Participated in the evaluation and integration of advanced testing tools to streamline processes, achieving a **40%** increase in testing automation coverage using innovative practices."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Conducted thorough **manual testing** and **UI testing** for applications developed with **Python** to ensure high-quality deliverables by implementing **Agile** methodologies and leveraging tools such as **Jira** for issue tracking and project management.\n• Executed **regression testing** and **cross-platform testing** to validate core functionalities across different environments like **iOS** and **Android**, ensuring compatibility and user satisfaction.\n• Developed comprehensive test cases for APIs built with **Python**, leveraging frameworks like **Selenium** and **Cypress** to automate browser testing, achieving an efficiency increase of **30%** in the testing workflow.\n• Demonstrated strong **analytical skills** through detailed analysis of system specifications and effective **attention to detail** in identifying defects, leading to a **25%** reduction in post-production issues.\n• Collaborated with development teams in adopting **SDLC** and **STLC** best practices to streamline the testing process, resulting in quicker time-to-market for software releases by **15%**.\n• Utilized **Playwright** for automated cross-browser testing, ensuring consistent user experience across various platforms while significantly reducing testing cycles.\n• Implemented continuous integration pipelines using **Azure DevOps** and **GitHub Actions** to facilitate automated testing and code review processes, enhancing product delivery agility.\n• Engaged in effective **communication** among cross-functional teams to align on project requirements and resolve issues in real-time, contributing to an improved workflow and project outcome.\n• Actively contributed to sprint planning and retrospective meetings within the **Agile** framework, enabling continuous improvement and team collaboration throughout the development lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Performed comprehensive **manual testing** to ensure product quality and reliability, including **UI testing**, **regression testing**, and **cross-browser testing** to support multiple platforms including **iOS** and **Android**.\nCollaborated in an **Agile** environment using **Jira** to track progress, manage tasks, and enhance communication among team members, resulting in a **20%** increase in project delivery speed.\nConducted detailed **STLC** and **SDLC** activities, documenting test cases, test plans, and ensuring adherence to quality standards throughout the software development lifecycle.\nExecuted end-to-end testing processes using **Selenium** and **Cypress** for UI-level validation of web applications, achieving a defect leakage rate of less than **2%** post-release.\nUtilized **TypeScript** alongside **Python** for test automation, enhancing test coverage and efficiency in various stages of the development process.\nAdopted and implemented **Playwright** for cross-platform testing, ensuring consistent functionality and performance across browsers and devices.\nAnalyzed testing results and communicated findings effectively to development teams, fostering a culture of continuous improvement based on **analytical skills** and **attention to detail**.\nCreated automated test scripts for application functionality with a focus on user experience, utilizing the latest technologies to streamline processes and reduce manual effort by **30%**.\nParticipated in thorough testing of payment integrations, ensuring secure transaction processing compliant with industry standards, achieving **100%** successful test scenarios.\nSupported the implementation of CI/CD pipelines, facilitating continuous integration and delivery which significantly improved overall project efficiency.\nConducted rigorous cross-platform validation, ensuring applications function seamlessly across diverse environments to enhance user satisfaction and performance metrics."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tmanual testing, Agile, Jira, SDLC, STLC, UI testing, regression testing, cross-browser testing, cross-platform testing, iOS, Android, Playwright, Cypress, Selenium, communication, analytical skills, attention to detail",
  "apply_company": "Interactivated Solutions Europe"
}