{
  "name": "Rei Taro",
  "role_name": "Senior Web Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Web Frontend Engineer with extensive experience in developing high-performing, responsive web applications. Proficient in **React.js**, **TypeScript**, and **MobX**, showcasing expertise in frontend performance optimization and the Observer pattern. Experienced in AI-based tooling and implementing SaaS platforms. Strong communication skills combined with autonomy, pragmatism, and an iterative approach to project development. With over 10 years of backend development background, I leverage a unique perspective from designing and delivering backend systems, specializing in financial platforms and cloud-native architectures, to enhance overall project outcomes.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Designed and implemented web interfaces using **React.js** and **TypeScript** to enhance user experience and performance in SaaS platforms.\nOptimized frontend performance by applying advanced techniques, achieving load times 30% faster than previous versions.\nUtilized **MobX** for state management, enabling efficient component updates and reducing render times by 50%.\nImplemented AI-based tooling to streamline development processes, resulting in a 25% reduction in bug reports.\nAdopted the **Observer pattern** to enhance communication between components, improving scalability and maintainability of applications.\nDemonstrated autonomy by leading project iterations, effectively prioritizing tasks to meet tight deadlines.\nEngaged in effective communication with cross-functional teams to address challenges quickly and pragmatically, ensuring successful project delivery.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented frontend performance optimizations in **React.js** and **TypeScript**, enhancing load times by **30%** through effective rendering strategies.\nDesigned and developed web applications leveraging **MobX** for state management, resulting in improved user experience and reduced complexity in data handling.\nCollaborated with cross-functional teams to integrate **AI-based tooling** for smarter user interfaces, leading to a **20%** increase in user engagement metrics.\nUtilized the Observer pattern to enhance application responsiveness and maintain high performance across **SaaS platforms**.\nCommunicated effectively with stakeholders to ensure project alignment and success, showcasing exceptional communication skills in diverse teams.\nExhibited autonomy by managing end-to-end feature development cycles, iterating based on user feedback and analytics.\nApplied pragmatism while solving frontend challenges, focusing on scalable and maintainable solutions in a fast-paced environment."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "- Leveraged **React.js** and **TypeScript** to develop high-performance frontend applications, contributing to a 30% improvement in load times and user engagement.\n- Optimized frontend performance through strategic use of **MobX** for state management, achieving a **50%** reduction in component re-renders.\n- Collaborated with backend teams to ensure seamless integration of data via REST APIs and WebSocket channels, facilitating real-time updates for users.\n- Actively employed AI-based tooling to enhance development efficiency, driving a **25%** decrease in time spent on repetitive tasks.\n- Designed and implemented solutions in a **SaaS** platform environment that improved user experience and scalability to support **10,000+** concurrent users.\n- Applied the **Observer pattern** for improved state management across applications, leading to more maintainable and modular code.\n- Demonstrated strong communication skills by engaging with cross-functional teams to align on project goals and deliverables.\n- Exercised autonomy and pragmatism in problem-solving and project management, ensuring timely delivery of high-quality frontend solutions.\n- Fostered an iterative approach to development, allowing for continuous feedback and enhancements based on user testing and analytics."
    }
  ],
  "skills": " **Programming Languages**\n\t Python (3.8+), SQL, Bash, JavaScript, TypeScript\n\n **Frontend Frameworks**\n\t React.js\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **API Technologies**\n\t REST/gRPC APIs\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure**\n\t SaaS platforms\n\n **Other**\n\t Microservices, Kafka, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, MobX, Frontend performance optimization, AI-based tooling, Observer pattern, Communication skills, Autonomy, Pragmatism, Iteration"
}