{
  "name": "Rei Taro",
  "role_name": "Senior Network Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Network Engineer with over 10 years of experience in cloud infrastructure and network design. Proficient in managing and optimizing networks utilizing **AWS**, **Azure**, and **OCI** services, as well as implementing security protocols with **Palo Alto**, **Fortinet**, **Cisco**, and **F5** technologies. Strong understanding of networking fundamentals including **TCP/IP**, **BGP**, and VPN configurations. Known for delivering reliable, scalable solutions in high-stress environments and contributing to large-scale projects at leading organizations. Adept at technical documentation, change management, and client communication, ensuring seamless knowledge transfer and troubleshooting processes.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **AWS**, **Azure**, and **OCI** to design and implement secure network architectures, ensuring optimal performance and security.\nExecuted change management and troubleshooting strategies for complex network configurations involving **Firewall**, **VPN**, and **TCP/IP** protocols.\nCollaborated with clients to provide exceptional client management and technical documentation, ensuring alignment with business requirements and compliance.\nManaged network protocols such as **BGP** and firewall technologies from **Palo Alto**, **Fortinet**, **Cisco**, **F5**, and **Juniper** to maintain high availability and security standards.\nAchieved **99.9%** system uptime through rigorous monitoring and troubleshooting efforts using best-in-class networking tools.\nLed knowledge transfer sessions, enhancing team capabilities and ensuring smooth transitions during network upgrades and modifications.\nCommunicated technical concepts effectively across cross-functional teams, streamlining project workflows and enhancing overall project execution."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Managed cloud services and network infrastructure using **Azure** to ensure reliable and secure connectivity for backend systems.\nImplemented security protocols including **Firewall** and **VPN** solutions to enhance network security and compliance with industry standards.\nConducted troubleshooting procedures to resolve connectivity issues with technologies such as **TCP/IP**, **BGP**, and other networking protocols, achieving a resolution rate of **95%** on first contact.\nDeveloped technical documentation outlining system architectures and operational procedures, facilitating effective **Knowledge Transfer** among team members and stakeholders.\nLeveraged **AWS** and **OCI** for multi-cloud strategies, ensuring uninterrupted service delivery and redundancy across platforms.\nMaintained and improved **Cisco**, **Fortinet**, and **Palo Alto** firewalls to protect network integrity and prevent unauthorized access.\nExecuted change management strategies to ensure organized deployment of network updates, minimizing downtime to less than **2 hours** for critical upgrades.\nCollaborated with cross-functional teams to provide insights into network capabilities and requirements, enhancing client satisfaction and project execution efficiency.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Leveraged **AWS**, **Azure**, and **OCI** cloud services to enhance backend infrastructure and security, ensuring high availability and reliability for trading operations.\nUtilized **TCP/IP**, **BGP**, and advanced **Firewall** configurations (including **Palo Alto** and **Fortinet**) to optimize network performance and security protocols, achieving 99.9% uptime.\nCollaborated with cross-functional teams to develop comprehensive **Technical Documentation**, improving **Knowledge Transfer** strategies and client communication.\nImplemented secure VPN connections to enable remote access to internal systems, enhancing operational flexibility and workflow efficiency by **30%**.\nConducted thorough **Troubleshooting** and change management processes, promptly resolving technical issues to maintain optimal network performance.\nStreamlined project timelines and resource allocation through effective **Client Management**, ensuring projects were delivered **on time** and within budget by an average of **15%**.\nAchieved certification upgrades and network optimization, contributing to a reduction in latency by **25%** across critical infrastructure."
    }
  ],
  "skills": " **Programming Languages**\n\t Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t \n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure, OCI\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure**\n\t Firewall, VPN, TCP/IP, BGP, Palo Alto, Fortinet, Cisco, F5, Juniper\n\n **Other**\n\t CompTIA Security+, CCNP, Technical Documentation, Change Management, Troubleshooting, Knowledge Transfer, Client Management, Communication",
  "apply_company": "SecureOps"
}