{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Desktop Application Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Desktop Application Developer with 8 years of expertise in C++, **Qt**, **QML**, Ruby, and Python. Proficient in designing and implementing **MVC**, **MVVM**, and **MVP** architectural patterns to create robust and user-friendly desktop applications. Well-versed in Test-Driven Development (TDD), Behavior-Driven Development (BDD), and automated testing methodologies, ensuring high code quality and thread-safe code practices.\nDemonstrated ability to work in Agile environments using **Scrum** and **Kanban** methodologies, fostering strong collaboration and efficient project delivery. Adept at developing software solutions with an emphasis on network security, software security, and comprehensive technical documentation. \nWith a solid foundation in problem solving and user experience principles, I have successfully led projects in the healthcare and financial sectors, integrating effective communication skills to bridge technical and non-technical stakeholders.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Desktop Application Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed thread-safe code in **C++** utilizing **Qt** and **QML** frameworks for high-performance desktop applications, ensuring adherence to **TDD** principles and automated testing protocols.\n- Collaborated within **agile** environments using methodologies such as **Scrum** and **Kanban** to fulfill project requirements efficiently and adaptively.\n- Implemented model-view-controller (**MVC**), model-view-viewmodel (**MVVM**), and model-view-presenter (**MVP**) architectures to enhance user experience, maintainability, and code reusability.\n- Created and maintained technical documentation for software components and APIs, ensuring clarity and ease of use for both technical and non-technical stakeholders.\n- Utilized **Python** for scripting and automation tasks, contributing to overall project efficiency and reliability.\n- Conducted thorough network security assessments, implementing best practices to safeguard applications from vulnerabilities, including IP networking and software security protocols.\n- Established robust automated testing frameworks, employing tools such as Jest and PyTest to cover unit, integration, and end-to-end testing.\n- Collaborated with cross-functional teams to solve complex problems, enhancing communication skills and fostering a collaborative work environment.\n- Developed user-friendly interfaces focusing on user experience principles, resulting in improved customer satisfaction and engagement.\n- Participated in code reviews and pair programming sessions to promote best practices and knowledge sharing within the development team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Ruby** to develop and modernize desktop applications, ensuring high-quality software through Test-Driven Development (TDD) and automated testing practices.\nImplemented an agile development process, including **Scrum** and **Kanban** methodologies, to accelerate project delivery while enhancing team collaboration and communication skills.\nDesigned and developed user interfaces using **Qt**, **QML**, and **MVC/MVVM** principles, resulting in engaging user experiences for 9+ desktop applications.\nEmployed strong problem-solving skills to create thread-safe code, ensuring application stability and performance across multi-threaded environments.\nConducted comprehensive technical documentation for all developed features, enhancing maintainability and facilitating knowledge transfer within the team.\nMaintained a focus on software and network security, integrating best practices to protect sensitive user data and comply with industry standards.\nDeveloped scalable IP networking solutions, enhancing connectivity and communication within enterprise-level desktop applications.\nCollaborated with cross-functional teams to gather user feedback and continuously improve the applications, leading to a **30%** increase in user satisfaction ratings over 12 months.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and optimized desktop applications using **C++**, **Qt**, and **QML**, ensuring a robust and responsive user experience across different platforms.\n- Implemented **TDD** (Test-Driven Development) and **BDD** (Behavior-Driven Development) practices, achieving a **30% reduction** in bugs reported after deployment compared to previous cycles.\n- Leveraged **agile** methodologies including **Scrum** and **Kanban** to enhance team collaboration and project delivery efficiency, resulting in a **25% increase** in sprint deliverables.\n- Designed and maintained **thread-safe code** to ensure high performance and stability in concurrent environments, which improved application responsiveness during peak loads by **40%**.\n- Integrated automated testing frameworks to facilitate reliable application updates, enhancing overall software quality and reducing regression issues by **35%**.\n- Authored comprehensive **technical documentation** to support team onboarding and customer understanding, improving user satisfaction scores by **20%** in feedback surveys.\n- Established strong **communication skills** with cross-functional teams to address project challenges, refining solutions through effective problem-solving strategies.\n- Engaged in continuous learning and adaptation to improve personal skills in **Python**, **Bash**, and **PowerShell**, enhancing versatility in multiple programming environments.\n- Implemented **network security** measures in desktop applications, ensuring protection against vulnerabilities and achieving full compliance with **GDPR** standards."
    }
  ],
  "skills": "Programming Languages:\n\tC++, Ruby, Python, Bash, PowerShell\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tIP networking, network security, software security\n\n**Other:**\n\tTDD, MVC, MVVM, MVP, agile, Scrum, Kanban, thread safe code, automated testing, BDD, MLflow, Airflow, Kubeflow, technical documentation, user experience, communication skills, problem solving, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot"
}