{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a skilled Senior Sales Engineer with 8 years of experience, I excel in leveraging **AWS** and **Azure** to design robust cloud solutions tailored to client needs. My proficiency in cloud networking and security tools ensures secure, compliant, and efficient architectures. With a solid understanding of **Windows** and **Linux**, I effectively troubleshoot and resolve client issues, promoting seamless integration of technology solutions. I am dedicated to problem-solving and solution design, consistently delivering innovative approaches that align with business goals.\nIn addition to my cloud expertise, I have a strong background in full-stack development, utilizing technologies such as **JavaScript**, **TypeScript**, **Python**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My hands-on experience in building high-performance applications is complemented by my knowledge of enterprise-grade platforms that integrate AI/ML capabilities for enhanced analytics. Also, I understand the importance of maintaining compliance with standards like HIPAA, FHIR, PCI DSS, and SOC 2 while developing solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS** and **Azure** solutions to design secure and scalable cloud infrastructures, optimizing storage and networking capabilities for enterprise applications.\nDemonstrated expertise in **cloud networking** and **security tools** to implement robust security measures and identity access management (IAM) protocols, ensuring compliance with organizational policies and regulations.\nExecuted effective problem-solving strategies to diagnose and resolve technical issues, enhancing system performance and reliability during enterprise sales pitches.\nDesigned effective backup and disaster recovery (DR) strategies using both Linux and Windows environments, improving data integrity for client infrastructures.\nDeveloped tailored solutions for clients by integrating **cloud services**, ensuring high availability, security, and cost-effectiveness, effectively addressing unique customer requirements.\nCollaborated with internal teams to outline product offerings and technical specifications, resulting in more efficient sales processes and a **15%** increase in conversion rates.\nLed technical demonstrations and workshops for prospective clients, showcasing capabilities in **cloud networking** and solution design, leading to a **20%** growth in customer engagement across key markets.\nAnalyzed and reported on competitive offerings utilizing **cloud technologies**, offering insights that informed product development and strategic planning efforts.\nMaintained up-to-date knowledge of the latest trends in **cloud security** and solutions, ensuring the company stayed ahead of industry developments and customer needs.\nEnhanced existing client relationships through strategic follow-up and the delivery of tailored solutions, increasing overall customer satisfaction scores by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented cloud solutions on **AWS** and **Azure** to enhance the security and scalability of financial platforms, ensuring compliance with industry standards and improving uptime by **99.9%**.\nUtilized **cloud networking** strategies to optimize connectivity between services, reducing latency in transaction processing by **30%** for better performance and user experience.\nDeveloped robust backup strategies and disaster recovery plans implementing advanced techniques for both **Windows** and **Linux** environments to protect data integrity and ensure business continuity.\nCollaborated closely with cross-functional teams to deliver tailored solutions, employing strong problem-solving skills to tackle complex challenges and enhance client satisfaction by **25%**.\nConducted in-depth solution design workshops to understand client requirements and present innovative architecture options leveraging cloud technologies and integrating security tools to safeguard sensitive financial data.\nDemonstrated expertise in **Identity and Access Management (IAM)** to control permissions and ensure secure access to cloud resources for improved security compliance and risk management.\nPerformed regular system audits on cloud resources, identifying and mitigating potential security vulnerabilities to enhance overall infrastructure security posture.\nProvided technical guidance to clients and internal teams on best practices for cloud usage, storage solutions, and optimization techniques, resulting in overall cost savings of **20%** on cloud expenditures."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **AWS** and **Azure** cloud services to design and implement scalable solutions, ensuring high system availability and redundancy through disaster recovery (DR) strategies for global e-commerce platforms.\nLeveraged **cloud networking** principles to optimize resource allocation and manage storage solutions effectively, ensuring seamless integration across **Windows** and **Linux** environments.\nDeveloped and implemented security measures by employing **IAM** (Identity and Access Management) protocols, enhancing the overall security posture of applications and protecting sensitive user data.\nProvided problem-solving expertise in troubleshooting and resolving technical issues, demonstrating a proactive approach to ensuring client satisfaction and optimal system performance.\nDesigned flexible solutions tailored to client-specific needs, backing them with robust support and documentation to facilitate ease of integration.\nEngineered real-time features using **WebSockets** and event-driven architecture powered by **Kafka** and **RabbitMQ**, enabling responsive order updates, dynamic inventory tracking, and real-time customer support.\nDeveloped frontend applications using **React (18)**, **Vue 3**, and **Angular**, enhanced with **TypeScript**, **Redux Toolkit**, and **Tailwind CSS**, delivering fast, responsive user experiences on both web and mobile platforms.\nLeveraged **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for distributed data storage, ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows and caching frequently accessed resources for performance gains.\nIntegrated AI/ML-based recommendation engines using **scikit-learn**, **LightGBM**, and **TensorFlow** to personalize product listings, optimize search relevance, and improve conversion rates based on real-time behavioral data.\nImplemented **Redis caching** for product metadata, shopping cart sessions, and search results, significantly improving application responsiveness and reducing read pressure on databases.\nImplemented feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes** namespaces, enabling controlled rollouts, A/B testing, and risk mitigation during major platform updates.\nCreated responsive, SEO-friendly e-commerce UIs using **Next.js**, **Vue 3 + Nuxt**, and **HTML5/CSS3**, optimized for mobile-first engagement and accessibility compliance (**WCAG 2.1**).\nBuilt secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, applying tokenized transactions and PCI-compliant handling of sensitive data.\nApplied role-based access control (RBAC) and **OAuth 2.0** for secure customer and admin access, ensuring **GDPR** compliance and user data protection throughout the platform."
    }
  ],
  "skills": "**Cloud & Infrastructure**:\n\tAWS, Azure, Windows, Linux, Cloud networking, IAM, Storage, Security tools, DR, Backup\n\n**Programming Languages**:\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Artificial Intelligence & Machine Learning**:\n\tMLflow, Airflow, Kubeflow\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**API Technologies**:\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Other**:\n\tProblem-solving, Solution design",
  "apply_company": "Cloud Bridge"
}