{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Backend Engineer with 8 years of experience, I specialize in building robust backend solutions using **Kotlin**, **Ktor**, and **Spring** frameworks, along with database management in **PostgreSQL** and integration with messaging services like **Kafka**. My technical proficiency extends to containerization with **Docker** and cloud services on **Google Cloud Platform**. I have a strong foundation in event-driven architecture and API development. \n\nIn addition to my core backend skills, I am adept at leveraging AI capabilities for intelligent automation, driven by my hands-on experience in predictive analytics and real-time data processing solutions. I also embrace best practices in CI/CD automation to enhance development workflow efficiency. My commitment to high-quality standards is reflected in my adherence to compliance frameworks. I am a team player with strong problem-solving skills, initiative, and the ability to communicate effectively in German and English.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Kotlin** and **Ktor** to architect and develop scalable, event-driven backend systems, ensuring high-performance and low-latency API integrations.\nEmployed **Spring** framework in building microservices architectures, facilitating seamless communication and data exchange between services within various projects.\nImplemented robust database solutions using **PostgreSQL**, optimizing queries for enhanced performance and efficient data handling for large-scale applications.\nApplied **Docker** in conjunction with CI/CD pipelines for containerization, enabling consistent and reliable deployments across development and production environments.\nLeveraged **Google Cloud Platform** services to deploy backend applications, ensuring scalability and resilience, and integrating with cloud-native services to meet business requirements.\nDeveloped AI-driven functionalities, integrating machine learning models for predictive analytics, enhancing application capabilities, and providing smarter solutions to end users.\nFostered teamwork and collaboration amongst cross-functional teams to develop innovative solutions and drive initiatives forward, while consistently delivering high-quality outputs.\nConducted thorough problem solving within complex technical challenges, applying analytical approach to debug and optimize backend processes and APIs.\nDemonstrated proficiency in both **German** and **English**, effectively communicating technical concepts and project updates across diverse teams.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Kotlin** and **Ktor** to develop and refine backend services, emphasizing API development and integration for enhanced performance in high-demand applications.\nDesigned and implemented scalable microservices architecture using **Spring** framework, ensuring robust and efficient service interactions aligned with business needs.\nManaged databases utilizing **PostgreSQL**, optimizing performance to support large-scale data storage and retrieval for complex operations.\nEstablished an event-driven architecture featuring **Kafka**, promoting seamless information flow and responsive system behavior for immediate data processing and alert dissemination.\nLeveraged **Docker** for containerization of applications, streamlining deployment processes and enhancing development consistency across various environments.\nAdopted **Google Cloud Platform** services for cloud-based solutions, enabling highly available systems and facilitating easy scalability to accommodate growth.\nFacilitated team collaboration and problem-solving initiatives, exhibiting strong teamwork and taking the initiative to devise strategic solutions for complex backend challenges.\nDemonstrated proficiency in AI technologies, contributing to system improvements through intelligent features and predictive analytics.\nFluently communicated in both German and English, aiding in effective collaboration with diverse teams and stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Designed and optimized scalable backend services using **Kotlin** and **Ktor**, ensuring high availability and low latency in core e-commerce functionalities including checkout and order processing.\n- Developed event-driven architecture with **Kafka** to enable responsive features such as order updates and inventory tracking, achieving a transaction throughput of **10,000 orders/minute**.\n- Engineered high-performance APIs using **Spring** for seamless communication between microservices, improving API response times by **35%**.\n- Leveraged **PostgreSQL** for efficient data storage and querying, successfully managing data for over **1 million** transactions per month and ensuring performance optimization for high-traffic periods.\n- Implemented CI/CD pipelines using **Docker** to facilitate rapid deployment cycles, reducing deployment times by **35%** and enhancing development team productivity.\n- Integrated **Google Cloud Platform** (GCP) services to enhance scalability and reliability, managing cloud resources for **99.9%** system uptime.\n- Collaborated effectively within the engineering team to solve complex problems, demonstrating strong problem-solving and teamwork skills.\n- Proactively took initiative in refining backend processes and improving application performance, resulting in a **20%** increase in overall system efficiency.\n- Developed language support features in both **German** and **English**, broadening user accessibility and enhancing the platform's reach to a diverse customer base."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Kotlin\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Ktor, Spring\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Google Cloud Platform\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Google Cloud Platform\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Kafka, event-driven, problem solving, teamwork, initiative, German, English, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)",
  "apply_company": "bex technologies"
}