{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Python Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Python Developer with 10+ years of experience in delivering high-performance software solutions, particularly in healthcare and finance. Proficient in **Python**, **Django**, **SQL**, and **PostgreSQL**, with a robust understanding of **Docker** and **Kubernetes** for containerization and orchestration. Expert in developing cloud-native applications on **AWS** and **GCP**, ensuring seamless CI/CD processes for efficient deployment and operations. Demonstrated knowledge in data protection and secure data storage solutions, ensuring compliance with industry standards. Strong communication skills enhance remote collaboration and team dynamics.\n\nPossesses hands-on experience across the full stack utilizing **JavaScript**, **TypeScript**, **React**, **Next.js**, **Vue**, **Node.js**, and **FastAPI**. Proven ability to lead development of enterprise platforms integrating AI/ML capabilities for effective real-time analytics and automation. Background in creating microservices architectures and event-driven systems that are secure and maintainable, with a commitment to compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about utilizing MLOps with tools such as **MLflow**, **Airflow**, and **Kubeflow** to enhance machine learning workflows, thereby driving significant real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions for healthcare and finance using **Python** (Django), **SQL**, and **PostgreSQL**, ensuring adherence to regulatory standards such as HIPAA and GDPR.\n• Built and deployed cloud-native applications with containerization using **Docker** and **Kubernetes**, achieving high availability and fault tolerance in production environments.\n• Developed CI/CD pipelines integrating **AWS** services, improving application deployment speed by **30%** compared to previous methods.\n• Collaborated with teams using remote collaboration tools, enhancing communication and project coordination across **9** different time zones.\n• Established robust data storage solutions using **SQL** and **PostgreSQL**, optimizing data retrieval times by **25%**.\n• Facilitated agile project management practices, leading to a **40%** reduction in feedback cycles during the development process. \n• Implemented best practices in data protection strategies in compliance with industry standards, ensuring the integrity and confidentiality of sensitive information.\n• Executed code reviews and conducted team knowledge transfer sessions, improving overall team competency and fostering a continuous learning environment."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Designed and implemented robust data storage solutions leveraging **PostgreSQL** and **SQL** to ensure data integrity and optimized access for high-volume transaction processing.\nUtilized **Python** frameworks such as **Django** to streamline application development, enhancing both scalability and maintainability in complex systems.\nCreated and managed **Docker** containers for development and production environments, facilitating efficient workflow and deployment across platforms.\nImplemented CI/CD pipelines using **AWS** and **GCP**, improving deployment frequency by **30%** and reducing change failure rates significantly.\nDeveloped microservices architectures that adhere to data protection standards, ensuring compliance and security within financial applications.\nEngaged in remote collaboration with cross-functional teams to enhance communication and delivery efficiency, resulting in improved project turnaround time.\nOptimized application performance through effective database queries and indexing strategies, achieving a **20%** reduction in transaction processing time.\nLed the integration of container orchestration with **Kubernetes**, enabling automated scaling and management of applications in a cloud environment."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Leveraged **Python** and **Django** to design and optimize backend services for a global e-commerce platform, ensuring high availability, low latency, and scalability across key modules such as checkout, cart, and order fulfillment.\n• Developed and maintained **SQL** databases including **PostgreSQL**, ensuring fast and fault-tolerant data access for high-traffic e-commerce workflows.\n• Utilized **Docker** and **Kubernetes** for containerization and orchestration, enhancing deployment efficiency and scalability across services.\n• Employed cloud services like **AWS** and **GCP** to host applications, leveraging their capabilities for data storage and processing, which improved performance by **30%** during peak loads.\n• Integrated CI/CD pipelines for automated testing and deployment, ensuring continuous improvement and rapid iterations in project development.\n• Architected data protection strategies including role-based access control (RBAC) and OAuth 2.0, ensuring GDPR compliance and user data protection throughout the platform.\n• Collaborated remotely with cross-functional teams, utilizing effective communication strategies to ensure alignment and project success across teams in different time zones.\n• Implemented Redis caching for product metadata and shopping cart sessions, significantly improving application responsiveness and reducing read pressure on databases by **20%**.\n• Created responsive, SEO-friendly e-commerce UIs using **HTML5/CSS3** optimized for mobile-first engagement, enhancing user experiences also in compliance with **WCAG 2.1**.\n• Developed secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, safeguarding sensitive data through tokenized transactions and PCI-compliant practices.\n• Demonstrated strong problem-solving skills and led initiatives to refine backend architecture, contributing to an increase in order fulfillment speed by **15%**."
    }
  ],
  "skills": "****Programming Languages:****\n\tPython\n\n****Backend Frameworks:****\n\tDjango\n\n****Frontend Frameworks:****\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n****API Technologies:****\n\t\n\n****Serverless and Cloud Functions:****\n\tAWS\n\n****Databases:****\n\tPostgreSQL\n\tSQL\n\n****DevOps:****\n\tDocker\n\tKubernetes\n\tCI/CD\n\n****Cloud & Infrastructure:****\n\tGCP\n\n****Other:****\n\tdata protection\n\tdata storage solutions\n\tremote collaboration\n\tcommunication"
}