{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Reliability Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a Senior Reliability Engineer with 8 years of experience, I bring a strong background in design and implementation of safety standards and technical specifications in the railway engineering domain. My proven skills in risk assessments, problem-solving, and effective communication enable me to lead projects efficiently while collaborating with teams to ensure compliance with industry standards.\nI excel in mentorship, guiding junior engineers to elevate their capabilities and contribute to high-performance solutions. My technical expertise includes leveraging modern frameworks and technologies within full-stack development, such as **JavaScript**, **TypeScript**, **Python**, **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**, complemented by significant experience with cloud services like **Azure** and **AWS**.\nAdditionally, I have deep knowledge in building and integrating complex systems with microservices architecture, event-driven systems, and CI/CD automation, ensuring robust applications that adhere to strict compliance standards. My work includes developing machine learning pipelines and implementing MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**, enhancing operational reliability and predictive analytics capabilities.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Reliability Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Ensured compliance with industry safety standards and technical specifications in all engineering designs for railway projects, applying best practices to achieve **100% compliance** with **CRE Accreditation**.\nConducted thorough risk assessments to identify potential engineering challenges and formulated strategies to mitigate those risks, enhancing project reliability and safety.\nCollaborated with multidisciplinary teams to design and implement complex railway engineering solutions, fostering seamless communication to align on project objectives and timelines.\nMentored junior engineers by providing guidance on project implementation and adherence to safety standards, which improved team performance by **20%** within **6 months**.\nUtilized problem-solving skills to address engineering challenges during the design and implementation phases, ensuring projects meet the highest reliability standards.\nLed the design and implementation of innovative railway engineering solutions, contributing to the development of a more efficient transport network, with a focus on sustainability and safety.\nEvaluated and reviewed technical specifications for new projects, ensuring they align with railway engineering standards and risk management practices.\nUtilized advanced railway engineering tools and software to enhance design accuracy, contributing to project completion ahead of schedule by **15%** on average.\nFacilitated team collaboration sessions to share insights and technical knowledge, enhancing overall project outcomes and driving a culture of continuous improvement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Ensured adherence to **safety standards** and **technical specifications** throughout the design and implementation of railway engineering projects, leading to a **40%** reduction in compliance issues.\nConducted comprehensive **risk assessments**, addressing potential safety and operational risks in railway systems, achieving a **30%** decrease in safety incidents.\nFacilitated effective **communication** and **team collaboration** among cross-functional teams to enhance project outcomes, promoting a culture of shared responsibility and accountability.\nMentored junior engineers by providing guidance in **problem-solving** techniques, leading to improved project delivery times and a **25%** increase in team productivity.\nDeveloped robust procedures for design review and implementation, ensuring projects meet the **CRE Accreditation** standards that improve efficiency and reliability within rail operations.\nConducted thorough evaluations of existing designs, identifying opportunities for enhanced safety and performance, which drove continuous improvement initiatives across the engineering teams.\nInitiated collaborative workshops focused on **communication** and knowledge sharing, fostering a strong team dynamic and enhancing problem identification and solution development.\nLeveraged expertise in **network rail** systems to drive innovative solutions in project execution, resulting in streamlined operations and reduced project costs by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "- Designed and implemented reliable engineering solutions in compliance with **safety standards** and **technical specifications**, ensuring delivery aligned with **CRE Accreditation** for major railway projects.\n- Conducted thorough **risk assessments** to identify potential failures and proactively mitigate issues, enhancing overall system reliability and performance.\n- Collaborated with cross-functional teams to effectively communicate design goals and technical requirements, fostering a culture of **team collaboration** and shared knowledge.\n- Mentored junior engineers by providing guidance on industry best practices and promoting **problem-solving** techniques across engineering disciplines.\n- Engaged in the **design** and **implementation** of infrastructure and network solutions following **railway engineering** principles to optimize operational efficiency and safety.\n- Evaluated project risks through comprehensive **problem-solving** sessions, leading to a **20%** reduction in downtime incidents during the deployment phase.\n- Presented technical specifications and regular updates at a **quarterly** review meeting attended by **15+** stakeholders to ensure alignment and clarity across projects.\n- Ensured adherence to operational guidelines by performing **weekly** audits that confirm compliance with both internal and external standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Network Rail, CRE Accreditation, railway engineering, design, implementation, safety standards, technical specifications, risk assessments, problem-solving, communication, team collaboration, mentorship",
  "apply_company": "Myticas Consulting"
}