{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Java Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "As a Java Developer with 13+ years of experience, I possess strong expertise in **Java**, **Spring**, and **Microservices**, ensuring the delivery of high-performance applications in compliance-driven environments. I am proficient in **AWS** for cloud deployment and have hands-on experience with **Docker**, **Kubernetes**, and **CI/CD** processes. My background includes developing **RESTful APIs**, utilizing version control with **GitLab**, and managing infrastructure as code using **Terraform** and **Skaffold**. Additionally, I am skilled in database management with **MongoDB** and **Atlas** and have a solid foundation in **Python** and **JavaScript** development.\n\nWith a proven track record in the healthcare and financial sectors, I am adept at building innovative solutions that leverage AI/ML capabilities, enabling predictive analytics and automation. My strong communication skills in English, combined with an Agile development approach, further enhance my ability to work collaboratively within cross-functional teams.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Java Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained microservices architectures using **Java** and **Spring** to enhance system scalability and maintainability, facilitating the transition from monolithic applications.\nImplemented CI/CD pipelines leveraging **GitLab**, **Docker**, and **Kubernetes** to ensure seamless deployments and continuous integration, resulting in a reduction of deployment time by **30%**.\nDesigned and consumed **RESTful APIs** for secure and efficient data interchange between microservices, achieving response times under **200ms** for critical endpoints.\nManaged cloud resources on **AWS** to optimize application hosting and storage, applying automation techniques using **Terraform** and **Skaffold** for infrastructure management.\nCollaborated in cross-functional Agile teams to deliver high-quality software solutions, enhancing team productivity and improving project turnaround times by **25%**.\nWorked with **MongoDB** and **Atlas** for data persistence, ensuring high availability and low-latency access to data across distributed systems.\nGuided the integration of monitoring tools and logging practices, ensuring system performance visibility and prompt issue resolution.\nEngaged in code reviews and pair programming to foster a culture of collaboration and continuous improvement within the development team, enhancing code quality and team capabilities.\nDemonstrated strong English communication skills in daily stand-ups and stakeholder meetings, ensuring alignment and transparency throughout the development process."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and maintained robust **Microservices** architectures using **Java** and **Spring**, improving scalability and modularity across applications.\n- Implemented CI/CD pipelines utilizing **GitLab**, **Docker**, and **Kubernetes** to streamline deployment processes, reducing release times by **40%**.\n- Designed and built RESTful APIs to support front-end applications, utilizing **JavaScript** frameworks for seamless integration with client requests.\n- Leveraged **AWS** cloud services to enhance application hosting and reduce infrastructure costs by **30%**.\n- Collaborated in Agile teams, effectively communicating technical concepts and project updates in **strong English** to ensure alignment across multiple departments.\n- Utilized **MongoDB** for database management, optimizing queries to improve data retrieval speed by **50%**.\n- Developed robust unit and integration test suites to maintain high code quality, achieving a **90%** test coverage across critical modules.\n- Automated deployment processes using **Terraform** and **Skaffold**, resulting in consistent and reliable infrastructure management.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Spring** frameworks to develop robust **microservices**, enhancing system modularity and scalability for enterprise-level applications.\nImplemented **RESTful APIs** to facilitate seamless data exchanges between various services, ensuring efficient communication and integration with other systems.\nLeveraged **AWS** cloud services for deploying and managing applications, utilizing features such as **Docker** containers and **Kubernetes** orchestration to improve delivery speed and operational reliability across a **9**-tier architecture.\nEstablished **CI/CD** pipelines using **GitLab** to automate testing and integration processes, resulting in a **30%** reduction in deployment times and increased team productivity.\nDesigned and maintained infrastructure-as-code using **Terraform** to streamline environment setups and manage configurations, achieving consistent deployments across all environments with **70%** less manual intervention.\nCollaborated in an **Agile** environment to deliver high-quality software solutions, ensuring timely product iterations and alignment with stakeholder requirements through effective communication in **Strong English**.\nUtilized **MongoDB** for efficient data storage and retrieval in applications, optimizing performance through fine-tuning of queries and indexing strategies.\nEmployed **Skaffold** for simplified development workflows, allowing for rapid iteration and testing cycles, significantly enhancing integration efforts across development teams.\nDeveloped secure applications by implementing best practices for authentication and authorization, including role-based access control (RBAC) and ensuring compliance with data protection standards.\nParticipated in code reviews and provided mentorship to junior developers, fostering a culture of continuous learning and improvement within the team."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Atlas\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Microservices, Agile, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Strong English communication"
}