{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Support Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Support Engineer with specialized skills in customer support, problem solving, and technical training, complemented by 8 years of experience as a Full Stack Developer in healthcare and financial sectors. Highly proficient in digital printing, inkjet technology, and cross-functional collaboration to deliver exceptional customer experiences. Expertise in software engineering, applying modern technologies such as **JavaScript**, **TypeScript**, **Python**, and **Flutter** for solutions development. Skilled in working with frameworks like **React**, **Next.js**, and **Node.js**, while also maintaining strong cloud deployment proficiency on **Azure** and **AWS**. I possess a robust understanding of compliance standards, including HIPAA and PCI DSS, as well as a solid background in chemistry and electrical engineering. I excel in crafting detailed reports and presentations to convey technical information effectively, ensuring seamless communication with stakeholders.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Provided exceptional **customer support** for digital printing solutions, utilizing strong **problem-solving** skills to troubleshoot and resolve technical issues in a timely manner.\n- Conducted comprehensive **technical training** sessions for clients, enhancing their understanding of **inkjet technology** and operational procedures, contributing to improved client satisfaction by **20%**.\n- Collaborated cross-functionally with **software engineering** and field service teams to address and resolve customer concerns, fostering a cooperative environment that resulted in a **15%** reduction in response time.\n- Created detailed **report writing** documents and presentations on product features and best practices, enabling informed decision-making for clients and stakeholders.\n- Leveraged knowledge in **chemistry** and **fluid physics** to explain the science behind printing processes, thereby enhancing customer understanding and trust in the technology.\n- Applied expertise in **electrical engineering** to support the maintenance and troubleshooting of digital printing equipment, ensuring high operational efficiency and compliance with industry standards.\n- Initiated **cross-functional collaboration** efforts that increased workflow efficiency by **10%**, facilitating a smooth communication channel between sales, support, and engineering departments.\n- Developed a comprehensive knowledge base for frequently encountered problems in inkjet printing, which reduced the average resolution time for issues by **30%**.\n- Presented technical findings and product updates to both technical and non-technical audiences, showcasing strong **presentation skills** that improved client engagement and education."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Provided exceptional **customer support** for complex technical inquiries related to **inkjet technology**, achieving a 95% satisfaction rating based on customer feedback.\n- Delivered **technical training** to cross-functional teams, increasing their understanding of **softwares** and **field services** involved in **digital printing** technologies by 30% as measured by internal assessment scores.\n- Collaborated with engineering and product teams to address customer issues and enhance product features through effective **cross-functional collaboration**, reducing repeated problem tickets by 40% over a period of 6 months.\n- Demonstrated strong **problem-solving** skills by troubleshooting and resolving hardware/software issues, thereby improving service response times by 50%.\n- Prepared comprehensive reports on service metrics and customer feedback, contributing to informed decision-making and product improvements, with a focus on **report writing** and presentation skills for stakeholder reviews.\n- Engaged in continuous learning about **fluid physics** and **electrical engineering** concepts related to printing technology, translating technical knowledge into practical customer solutions.\n- Assisted in the development of CRM strategies that streamlined customer interactions and enhanced service levels, contributing to a 20% increase in customer retention rates."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Provided expert **technical training** to clients and internal teams on the latest **inkjet technology**, enhancing the understanding of **digital printing** solutions and improving customer satisfaction scores by **15%**.\nEnsured high-quality **customer support** by resolving **technical** issues efficiently, achieving a resolution rate of **95%** on first contact, thereby increasing overall customer retention.\nCollaborated cross-functionally with engineering, sales, and product teams to identify and troubleshoot problems, ensuring seamless **field service** delivery and enhancing customer experiences.\nDeveloped comprehensive **reporting** documentation and presentations that highlighted key product features and capabilities, resulting in an increase of **30%** in client engagement during training sessions.\nUtilized **problem-solving** techniques to analyze client requests and issues in **software engineering** contexts, translating complex technical information into user-friendly solutions.\nEngaged in **cross-functional collaboration** for product enhancements by providing feedback from customer interactions, contributing to a **20%** reduction in recurring technical issues.\nImplemented **Customer Relationship Management** practices to track and analyze customer feedback, using insights to drive continuous improvement in service delivery.\nPresented findings and updates on product performance and customer satisfaction to senior management, using strong **presentation skills** to communicate effectively across all levels of the organization.\nLeveraged principles of **fluid physics** and **chemistry** to assist in the technical troubleshooting of printing issues, providing in-depth support for clients utilizing advanced technologies."
    }
  ],
  "skills": " **Programming Languages:**\n\t Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\t FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\t React, Vue, Angular\n\n **API Technologies:**\n\t JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\t AWS (Lambda), Azure (App Services)\n\n **Databases:**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\t Docker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\t AWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n **Other:**\n\t artificial intelligence, machine learning, MLflow, Airflow, Kubeflow, technical training, customer support, problem solving, cross-functional collaboration, presentation skills, report writing, chemistry, electrical engineering, software engineering, fluid physics, digital printing, inkjet technology, Customer Relationship Management, field service",
  "apply_company": "FUJIFILM Dimatix, Inc."
}