{
  "name": "Tomasz Lee",
  "role_name": "Manual Tester / Support Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Detail-oriented Manual Tester and Support Engineer with over 9 years of experience in troubleshooting and resolving issues within complex applications. Proficient in **SQL**, **MySQL**, and adept at using **JIRA** and **GitHub Issues** for efficient project management and bug tracking. Demonstrated expertise in cloud services such as **AWS** and **Azure**, showcasing strong problem-solving capabilities and effective communication skills. Recognized for collaboratively working within teams to enhance product quality and streamline testing processes while ensuring thorough documentation and reporting. Proven ability to deliver results in remote work environments.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Manual Tester / Support Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted **manual testing** of web-based applications to ensure high quality and reliability, achieving a defect rate reduction of 30%.\nCollaborated with development teams using **JIRA** and **GitHub Issues** for efficient issue tracking and resolution, enhancing team productivity by 20%.\nUtilized **SQL** and **MySQL** for database verification and back-end testing, validating data integrity and improving data accuracy by 15%.\nPerformed troubleshooting of application issues in collaboration with developers, resulting in a 25% faster resolution time for critical bugs.\nCommunicated effectively with cross-functional teams to report findings and gather requirements, fostering team collaboration across a fully **remote work** environment.\nEnabled deployment automation practices, leveraging knowledge of **Azure** and **AWS** to support overall CI/CD strategies.\nParticipated in pair testing sessions to enhance understanding of application functionalities, contributing to improved testing coverage by 18%.\nProvided support for end-users, ensuring smooth transitions during software updates and minimizing downtime by implementing proactive user communication strategies.\nActively engaged in problem-solving discussions with stakeholders to refine application requirements and improve overall user satisfaction by 10%."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **SQL** and **MySQL** for database management and optimization, improving data retrieval times by **20%** through effective query strategies.\nConducted thorough manual testing and troubleshooting of applications to ensure functionality and minimize errors, contributing to a **30%** reduction in bug reports post-deployment.\nCollaborated with teams using **JIRA** and **GitHub Issues** for issue tracking and project management, enhancing problem-solving efficiency in remote work settings.\nCommunicated effectively with stakeholders to identify system requirements and testing needs, fostering improved team collaboration and timely project delivery.\nDesigned and executed testing strategies that aligned with development timelines leveraging cloud services like **AWS** and **Azure** for functional and performance testing.\nParticipated in team meetings via remote communication tools, providing insights and feedback to enhance team productivity and project strategies.\nResolved technical issues quickly through effective troubleshooting methods, leading to a **15%** increase in overall system reliability."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented **manual testing** procedures to ensure quality assurance and identify defects, contributing to a 30% reduction in bug reports.\nUtilized **JIRA** for tracking and managing testing progress and issues, improving project visibility and response times by 25%.\nPerformed **SQL** database queries on **SQL Server** and **MySQL** to support testing efforts and validate data integrity, enhancing data accuracy by 15%.\nCollaborated with development teams to troubleshoot and resolve issues efficiently, showcasing strong **problem-solving** skills and achieving a 40% faster resolution time.\nProvided comprehensive documentation on testing processes and troubleshooting steps to enhance team knowledge sharing.\nParticipated in daily standups to maintain effective **team collaboration**, ensuring alignment on project goals and progress.\nEngaged in remote work seamlessly, adapting to challenges and maintaining productivity levels.\nSupported integration testing for applications utilizing **AWS** and **Azure**, ensuring smooth deployment and operation in cloud environments.\nUsed **GitHub Issues** to facilitate issue tracking and manage feedback effectively across teams, enhancing collaboration.\nStrengthened **communication** between QA and development teams to streamline troubleshooting processes and improve project outcomes."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, TypeScript, Python, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Git, GitHub, JIRA, GitHub Issues\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tMicroservices, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, problem-solving, communication, team collaboration, remote work, troubleshooting, manual testing, SQL"
}