{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience developing high-performance applications in the healthcare and financial sectors. Expert in **TypeScript**, **React**, **C#**, **.NET**, and cloud platforms including **Azure** and **AWS**. Proficient in modern development practices such as **CI/CD**, **Terraform**, and **Kubernetes** for scalable and reliable system deployments.\nExtensive knowledge in AI/ML implementations that enhance predictive analytics and automation processes. Adept at transforming user stories into effective design documentation and technical specifications. Demonstrated ability to align solutions with rigorous compliance standards such as HIPAA and FHIR.\nWell-equipped to leverage emerging technologies, with a solid foundation in **Rust**, **Go**, and **C++**, enabling innovative solutions in digital identity and open banking frameworks. Exceptional communication skills foster collaboration across cross-functional teams.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained full-stack applications using **TypeScript**, **React** (17–18), and **C#** in the **.NET** framework, ensuring seamless integration with cloud services like **Azure** and **AWS**.\n• Implemented CI/CD pipelines leveraging **Terraform**, **Kubernetes**, and **GitHub Actions** to enable rapid deployment cycles and efficient infrastructure management across development and production environments.\n• Collaborated with cross-functional teams to gather user stories and design documentation, facilitating effective communication and alignment on project goals, resulting in a 30% increase in delivery speed.\n• Enforced robust testing strategies using Jest, Cypress, and PyTest for unit, integration, and E2E testing, achieving a code coverage of over **85%**.\n• Developed automated workflows for handling verifiable credentials and digital identity solutions, enhancing security and compliance across applications.\n• Integrated cloud-native solutions in **Azure** and **AWS**, deploying applications with scalability in mind, achieving **99.9% uptime** in production environments.\n• Contributed to the design and architecture of microservices initiatives, utilizing **Kubernetes** for orchestration and enhancing service resilience and fault tolerance.\n• Participated in the design and implementation of AI features for applications, focusing on user-driven enhancements that resulted in a **25%** increase in user engagement.\n• Actively contributed to the establishment of open banking APIs, facilitating secure transactions and data sharing in compliance with financial regulations.\n• Engaged with stakeholders to inform design decisions, resulting in user-friendly digital experiences that cater to evolving user needs."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed scalable applications using **TypeScript** and **React (18)**, ensuring high performance and responsiveness in user interfaces.\n• Implemented robust backend systems in **C#** and **.NET**, aligning with best practices and leveraging cloud services such as **Azure** and **AWS** for enhanced deployment and scaling.\n• Designed CI/CD pipelines utilizing **Terraform** and **Kubernetes** to streamline development processes and maintain consistent deployment across environments.\n• Contributed to digital identity solutions by integrating **open banking** features and managing **verifiable credentials**, enhancing security and user trust.\n• Engineered data-driven solutions employing AI techniques for fraud detection, focusing on real-time analytics and predictive modeling, thus reducing false positives by up to **20%**.\n• Participated in Agile methodologies to gather and refine **user stories**, ensuring high-quality design documentation and effective communication across teams.\n• Enhanced system reliability and availability by implementing containerization strategies with **Docker** and **Kubernetes**, achieving **99.9%** uptime across applications\n• Collaborated with cross-functional teams to define functional requirements and provide design strategies for new features, ensuring seamless user experiences.\n• Spearheaded the integration of third-party tools and services, streamlining workflows and improving operational efficiency by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and implemented robust applications using **TypeScript**, **React** (18), and **.NET**, ensuring high code quality and performance across the software lifecycle.\n- Designed CI/CD pipelines for automated testing and deployment in cloud environments like **Azure** and **AWS**, enhancing deployment frequency by over **30%**.\n- Crafted comprehensive design documentation and user stories to facilitate clear communication among cross-functional teams, significantly improving project execution timelines.\n- Leveraged container orchestration with **Kubernetes** and infrastructure as code using **Terraform** to manage deployment environments effectively, achieving a **25%** reduction in environment setup times.\n- Created scalable APIs and microservices using **C#** and **Rust**, ensuring seamless integration and high performance across distributed systems.\n- Integrated digital identity solutions and verifiable credentials within the platform, enhancing security and user trust in transactions.\n- Collaborated with stakeholders to gather requirements and define user stories, leading to the successful delivery of impactful features on schedule.\n- Applied best practices in communication to maintain transparency with client stakeholders and team members, fostering a productive work environment.\n- Engaged in open banking initiatives, expanding the functionality of the platform to support various financial services and customer needs."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, TypeScript, C#, Rust, Go, C++, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, .NET\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tOAuth2, JWT, digital identity, verifiable credentials, open banking\n\n**Serverless and Cloud Functions**\n\tAWS: ECS, Lambda, Azure: App Services\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other**\n\tAI, MLflow, Airflow, Kubeflow, user stories, design documentation, communication",
  "apply_company": "Propellerhead"
}