{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Cloud Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Cloud Engineer with a robust skill set in **Azure**, **M365**, **Identity**, **Security**, and **Compliance**. Expertise in deploying and managing cloud-native systems while ensuring adherence to compliance standards. Proficient in **PowerShell**, implementing Zero-Trust models, and leveraging tools like **Intune**, **Autopilot**, **Exchange**, and **EDR/XDR** for enhanced security posture. Skilled in managing cloud infrastructure using **IaC** methodologies and designing **Azure Landing Zones** for optimized resource management.\n\nBringing over 13 years of experience as a Full Stack Developer, with advanced knowledge in **JavaScript/TypeScript**, **Python**, and **Flutter**. Hands-on experience in both frontend and backend application development utilizing cutting-edge frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven ability to build AI/ML-powered platforms that enhance predictive analytics, automation, and real-time processing, alongside a solid foundation in MLOps using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented innovative security solutions and compliance measures within cloud services, specializing in **Azure** and **M365** environments, ensuring adherence to industry standards like **Zero-Trust** and **EDR**.\nDesigned and deployed Identity and Access Management strategies utilizing **PowerShell** for automation across corporate platforms, enhancing user management efficiency by up to **40%**.\nConfigured and managed device management systems with **Intune** and **Autopilot**, promoting secure and seamless access for over **500** users across various locations.\nDeveloped comprehensive security monitoring solutions leveraging **SIEM** and **XDR** tools to enhance threat detection and response capabilities, resulting in a **25%** reduction in incident response times.\nEstablished and maintained **Azure Landing Zones** to support secure and compliant cloud architecture, guiding teams through best practices for deployment and resource management in scaled environments.\nAutomated infrastructure deployment using Infrastructure as Code (IaC) principles, optimizing resource allocation and maintaining compliance posture across various projects.\nConducted in-depth compliance audits for enterprise applications, correlating findings with necessary changes to align with **MFA** and regulatory requirements.\nCollaborated closely with cross-functional teams to integrate advanced security measures into existing workflows, significantly enhancing overall organizational security posture.\nLed workshops and training sessions focused on best practices for security and compliance within cloud environments, improving team knowledge and readiness for potential threats.\nAnalyzed and generated reports on security incidents, identifying patterns and trends to refine existing protocols and improve future incident response strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Implemented security measures across **Azure** environments, ensuring compliance with **Zero-Trust** architecture and industry regulations, which improved security posture by **40%**.\n- Automated infrastructure deployment using Infrastructure as Code (**IaC**) principles, significantly reducing provisioning time by **60%** and enhancing operational efficiency across **M365** services.\n- Managed identity and access management practices, deploying **MFA** solutions to protect sensitive financial data, increasing user authentication security by **75%**.\n- Integrated **Intune** and **Autopilot** for device management, achieving a seamless user experience while ensuring compliance with corporate security policies.\n- Designed and maintained SIEM solutions for comprehensive security monitoring and incident response, utilizing **EDR** and **XDR** technologies to enhance threat detection capabilities by **50%**.\n- Developed PowerShell scripts for automation of routine tasks, improving operational efficiency by reducing manual intervention time by **30%**.\n- Spearheaded collaboration initiatives between security and compliance teams to streamline processes while ensuring adherence to **security** best practices.\n- Evaluated and implemented advanced security solutions to protect the integrity of cloud-based applications and services, focusing on the continuous improvement of compliance and security frameworks."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented **Azure** services to enhance cloud infrastructure, ensuring compliance with **M365** security protocols and **Zero-Trust** principles across various deployments.\nManaged and automated **Identity** and access governance using **PowerShell**, improving security posture and compliance adherence by approximately **30%**.\nConfigured and deployed **Intune** for device management, streamlining onboarding processes with **Autopilot** for a team of over **100** users.\nEnsured seamless integration and migration of **Exchange** services, enhancing communication efficiency and security for remote teams by achieving uptime of **99.9%**.\nDeveloped solutions leveraging **EDR** and **XDR** technologies to detect and respond to potential security threats, improving incident response times by **40%**.\nMonitored security events using **SIEM** solutions, ensuring adherence to compliance standards and minimizing risks through real-time analysis of incidents.\nDesigned and documented **Infrastructure as Code (IaC)** practices for deploying **Azure Landing Zones**, improving deployment efficiency and reducing setup times by **50%**.\nEngaged in the implementation of **MFA** solutions to enhance security access control for all systems, significantly reducing unauthorized access incidents.\nCollaborated with cross-functional teams to enforce security compliance protocols aligned with industry standards and regulatory requirements, ensuring a secure operating environment.\nDeveloped disaster recovery and business continuity plans leveraging cloud services for improved resilience and compliance with industry regulations."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tNone\n\n**Frontend Frameworks:**\n\tNone\n\n**API Technologies:**\n\tNone\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure\n\tM365\n\tAzure Landing Zones\n\n**Other:**\n\tIdentity\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\tSecurity\n\tCompliance\n\tExchange\n\tIntune\n\tAutopilot\n\tPowerShell\n\tMFA\n\tZero-Trust\n\tEDR\n\tXDR\n\tSIEM\n",
  "apply_company": "SBIT AG"
}