{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior Fullstack Engineer with 13+ years of experience specializing in high-performance applications within the healthcare and financial sectors. Proficient in **React**, **Node.js**, **MongoDB**, **Express.js**, and deploying cloud solutions on **AWS**. Demonstrated expertise in DevOps practices and implementing **CI/CD** using **GitHub Actions**. Skilled in secure coding and cybersecurity principles, ensuring compliance with standards like NIS2, ISO 27001, and SOC2. Proven ability in team collaboration and mentoring, enhancing communication and fostering iterative development processes. Experienced in backend and frontend integration, utilizing frameworks such as **FastAPI** and **Django**, and leveraging tools for AI/ML capabilities in predictive analytics.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed secure full-stack applications using **React**, **Node.js**, and **MongoDB**, ensuring adherence to secure coding practices and compliance with **ISO 27001**, **SOC2**, and **NIS2**.\n• Implemented robust CI/CD pipelines utilizing **GitHub Actions** for streamlined deployment processes with an emphasis on automated testing and quality assurance across environments.\n• Collaborated with cross-functional teams, enhancing team collaboration and communication to achieve project milestones efficiently in iterative development cycles.\n• Mentored junior developers on best practices in secure coding and **cybersecurity** techniques, fostering a culture of knowledge-sharing and continuous improvement.\n• Managed and deployed cloud infrastructure on **AWS**, ensuring fault tolerance and scalability for high-demand applications.\n• Conceptualized and maintained code quality through rigorous adherence to **DevOps** methodologies and practices, including automated linting and security checks.\n• Engaged in continuous education on emerging technologies like **Claude Code** and **Cursor**, integrating them into existing workflows to enhance productivity and coding efficiency.\n• Optimized application performance by refining database interactions in **MongoDB**, enhancing query efficiency by up to **30%** through effective indexing strategies.\n• Spearheaded the transition towards microservices architecture, improving system resilience and maintainability, leading to a **20%** reduction in downtime.\n• Contributed to strategic planning sessions to integrate **ERC standards** into product roadmaps, aligning with regulatory requirements while maximizing feature delivery."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Spearheaded the adoption of **React** (18) for building modern user interfaces, implementing best practices for **secure coding** and ensuring compliance with **ISO 27001** and **SOC2** standards.\n• Developed robust backend services using **Node.js** (Express) and **MongoDB**, applying **DevOps** principles to streamline deployment using **GitHub Actions** and **CI/CD** strategies.\n• Fostered team collaboration through mentoring junior developers in **Iterative development** techniques, improving overall project delivery speed by **30%**.\n• Created a cohesive work environment by enhancing communication between front-end and back-end teams, leading to a **20%** reduction in project turnaround time.\n• Implemented **AWS** cloud services to support application hosting and scalability, ensuring high availability for applications handling millions of transactions.\n• Advocated for best practices in **cybersecurity**, developing protocols to safeguard sensitive financial data and enhance overall platform integrity.\n• Integrated **Claude Code** and **Cursor** for efficient logging and code management, improving code review processes by **25%**.\n• Participated in the design and execution of DevOps strategies, resulting in automated deployment processes that decreased manual intervention by **40%**.\n• Monitored system performance and security, employing tools to assess compliance with **NIS2** regulations, promoting a culture of accountability and continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed responsive applications using **React** (18) and **Node.js** (NestJS, Express), ensuring high-quality front-end user experiences and robust back-end services.\n• Engineered and maintained **MongoDB** databases, implementing data storage solutions that support high-traffic e-commerce workflows and accessible performance metrics.\n• Actively participated in **DevOps** practices through **GitHub Actions**, enabling efficient CI/CD pipelines for seamless deployment and integration.\n• Ensured secure coding practices and **cybersecurity** measures were in place, maintaining compliance with **NIS2**, **ISO 27001**, and **SOC2** standards to protect sensitive user information.\n• Collaborated with the team through effective **communication** and **mentoring**, fostering a culture of knowledge sharing and continuous improvement in efficient software development processes.\n• Designed and implemented feature flags and blue-green deployments using **AWS** and **Kubernetes**, facilitating controlled release strategies and A/B testing.\n• Leveraged **AWS** services for scalable infrastructure, ensuring high availability and performance across all application components.\n• Applied best practices in **Iterative development**, enhancing project outcomes and efficiency across the product lifecycle.\n• Built secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, implementing **tokenized transactions** and maintaining PCI compliance.\n• Enhanced collaboration within the development team, emphasizing the importance of **team collaboration** and adopting **Claude Code** for improved code quality."
    }
  ],
  "skills": " \n**Programming Languages:**\n\tPython, JavaScript/TypeScript, Solidity\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js, Express.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tCI/CD, cybersecurity, secure coding, team collaboration, communication, mentoring, iterative development, Nginx, Let’s Encrypt, Certbot, MLflow, Airflow, Kubeflow, Claude Code, Cursor, NIS2, ISO 27001, SOC2"
}