{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Development Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "Highly skilled Software Development Engineer with 8 years of experience in Agile development, specializing in building robust software solutions. Proficient in **C++**, **C#**, and **Windows APIs**, I leverage advanced **Visual Studio** tools and **GitHub Actions** for streamlined CI/CD processes. Experienced in implementing **Azure Pipelines** for efficient build and deployment strategies, I prioritize high-quality code through unit testing and automated testing practices.\nMy diverse background includes modern full-stack development with technologies such as **JavaScript**, **TypeScript**, **Python**, and **Flutter**. I have a proven track record of developing enterprise-grade platforms with strong compliance adherence to HIPAA, FHIR, and PCI DSS standards. Skilled in applying design patterns and optimizing systems for performance, I create scalable applications that meet dynamic business needs.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Development Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented **Agile development** methodologies to enhance team collaboration and accelerate project delivery, resulting in a **30%** increase in productivity across multiple software projects.\n- Developed high-quality software solutions using **C++** and **C#** while adhering to **design patterns** that ensure maintainability and scalability of applications.\n- Utilized **Visual Studio** for efficient debugging and performance optimization, achieving a **20%** reduction in code-related issues post-deployment.\n- Created and maintained automated testing frameworks, focusing on **unit testing** to ensure high code coverage and quality, which improved software reliability by **25%**.\n- Integrated **GitHub Actions** and **Azure Pipelines** for CI/CD processes, streamlining workflow and enabling faster deployment cycles with **up to 5 deployments per week**.\n- Collaborated with cross-functional teams to enhance Windows APIs, optimizing software interoperability and user experience, thus leading to a **15%** increase in user satisfaction ratings.\n- Conducted code reviews and provided mentorship in best practices which fostered a culture of continuous improvement among junior developers, directly contributing to the overall skill enhancement of the development team.\n- Engaged in comprehensive testing strategies using **automated testing** tools to increase testing efficiency and coverage while aligning with industry standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Applied Agile development methodologies to streamline project execution, improving delivery timelines by **30%**.\nUtilized **C++** to build efficient and robust backend services, enhancing performance for high-load applications by **40%**.\nDeveloped Windows APIs to integrate desktop applications with backend services, ensuring seamless user experiences.\nEmployed **C#** and **Visual Studio** to design and implement new features, adhering to industry best practices in software engineering and design patterns.\nImplemented GitHub Actions and **Azure Pipelines** for CI/CD, reducing deployment times by **50%** and increasing overall software reliability.\nConducted unit testing and automated testing for new features, achieving a code coverage of **85%**, which significantly decreased bug rates in production.\nCollaborated with cross-functional teams to gather requirements and manage project scope, improving stakeholder satisfaction ratings by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied **Agile development** methodologies to foster collaboration and enhance project workflow, delivering software solutions on time and within budget.\nUtilized **C++** for developing robust software applications, ensuring high performance and efficient memory management, thereby achieving a **30%** increase in processing speed over previous implementations.\nEmployed **Windows APIs** to design seamless integration solutions for various applications, enhancing functionality and user experience across different platforms.\nImplemented **C#** with **Visual Studio** to build and maintain high-quality software architecture, successfully completing over **15** projects with zero major bugs.\nLeveraged **GitHub Actions** and **Azure Pipelines** for Continuous Integration and Continuous Deployment (CI/CD) practices, significantly reducing deployment times by **40%**.\nConducted comprehensive **unit testing** to ensure code quality and reliability, achieving a test coverage rate of **90%** across critical modules.\nDesigned and implemented **design patterns** to streamline code and promote maintainability, enhancing team productivity and reducing development time.\nExecuted **automated testing** protocols to ensure application stability and quality assurance, limiting post-launch defects to less than **2%**.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tC++, C#, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tWindows APIs, Keycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure Pipelines, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tAgile development, MLflow, Airflow, Kubeflow, Unit testing, Design patterns, Automated testing, Nginx, Certbot"
}