{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior AWS Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a Senior AWS Engineer with over 8 years of experience, I have a strong expertise in **AWS** cloud services, including infrastructure automation using **Terraform**, **CDK**, **ECS**, and **EKS**. My proficiency in **Data Lake** architecture, **Analytics**, and **IAM** allows me to build scalable, secure cloud solutions that ensure compliance with industry standards such as HIPAA, FHIR, and PCI DSS. I have demonstrated experience in implementing **HA/DR** strategies and effective **Disaster Recovery** solutions. \n\nIn addition, I leverage my background in **CI/CD** automation and **Cloud Consulting** to enhance the reliability and performance of applications. My collaborative approach fosters effective **Communication**, teamwork, and stakeholder engagement, ensuring alignment with customer expectations and project goals. I excel in environments requiring strong governance and security measures as part of my commitment to customer orientation and service excellence. Additionally, I possess solid foundations in microservices architecture, event-driven systems, and emerging technologies which I integrate into solutions across the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AWS Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS** services for infrastructure automation, ensuring high availability and disaster recovery (HA/DR) using **EKS** and **ECS** in large-scale applications.\nDesigned and implemented cloud-native solutions leveraging **Terraform** and **CDK** for efficient provisioning of environments, achieving a deployment time reduction of **30%**.\nDeveloped comprehensive data lakes for analytics and reporting, optimizing data ingestion processes and improving data retrieval times by **25%**.\nImplemented rigorous security and compliance measures, including IAM roles, to adhere to best practices in governance and regulatory standards across projects.\nCollaborated with cross-functional teams to integrate **SAP S/4HANA**, enhancing system workflows and streamlining financial operations with existing infrastructure.\nExecuted enterprise-level CI/CD pipelines using **AWS CodePipeline** and **AWS CodeBuild**, boosting deployment frequency to multiple environments while maintaining code quality and security compliance.\nEngaged with stakeholders to gather requirements and ensure customer orientation throughout the deployment phases, leading to a **40%** increase in project satisfaction scores.\nEstablished monitoring solutions utilizing **AWS CloudWatch** and third-party tools to enhance visibility into application performance and reliability, reducing incident response time by **35%**.\nConducted cloud consulting sessions with clients to advise on cloud migration strategies, optimizing their operational costs and improving overall service delivery.\nCreated comprehensive documentation on governance practices, compliance guidelines, and infrastructure designs to support ongoing team communication and knowledge sharing.\nStrengthened the team’s DevOps culture through effective communication and teamwork initiatives, fostering an environment of collaboration and continuous improvement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "• Leveraged **AWS** technologies, including **ECS** and **EKS**, to develop and modernize data architecture, enhancing **scalability** and ensuring high availability for high-volume transaction systems.\n• Implemented robust **Infrastructure Automation** strategies through **Terraform** and **CDK**, streamlining the deployment process by **40%** and reducing operational overhead.\n• Designed data lake solutions integrating **SAP HANA** and **S/4HANA**, optimizing data storage and analytics for financial transactions with over **99.9%** uptime.\n• Established robust **Disaster Recovery (HA/DR)** plans and practiced **FinOps** principles to manage cloud costs while ensuring data security and compliance.\n• Developed and orchestrated **CI/CD** pipelines using AWS tools that improved deployment frequency by **25%**, achieving faster feature release cycles for financial applications.\n• Collaborated with cross-functional teams to ensure effective **Stakeholder Engagement**, aligning cloud solutions with business objectives and enhancing customer orientation.\n• Maintained governance and security postures to comply with industry standards and regulations while implementing comprehensive **Monitoring** systems for proactive incident management.\n• Fostered open communication and teamwork, sharing insights and best practices with team members to drive continuous improvement in cloud infrastructure and analytics performance."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Implemented **AWS** solutions aligning with architectural best practices, utilizing **Terraform** and **CDK** for Infrastructure as Code (IaC) to automate and manage cloud resources, achieving up to **90%** reduction in deployment time.\nDesigned and managed containerized applications using **ECS** and **EKS**, achieving high availability and scalability for e-commerce services, handling **100K+** concurrent users without degradation in performance.\nEngineered data lakes and analytics pipelines on **AWS**, enhancing data-driven decision-making capabilities, which resulted in a **30%** increase in actionable insights for business strategies.\nExecuted disaster recovery strategies and high availability (HA/DR) planning, ensuring **99.99%** uptime and swift recovery from outages with minimal data loss.\nFacilitated Cloud Consulting services to streamline clients' infrastructures towards **SAP** solutions, particularly **SAP ECC** and **S/4HANA**, improving operational efficiency by **40%**.\nIntegrated governance and compliance frameworks to ensure adherence to regulations, reducing audit findings from **5** to **1** per quarterly review.\nEnhanced security protocols through **IAM** policies and role-based access control (RBAC), ensuring data integrity and regulatory compliance across cloud environments.\nCollaborated effectively with cross-functional teams to refine processes, utilizing strong **communication** and **teamwork** skills to engage stakeholders and prioritize customer orientation in all initiatives.\nDirected initiatives to improve infrastructure monitoring, automating alerts and reporting systems resulting in a **25%** faster response time to incidents, thus elevating overall service reliability."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, EKS, IAM, Disaster Recovery, Infrastructure Automation, CDK, Landing Zones\n\n **Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Communication, Teamwork, Stakeholder Engagement, Customer Orientation, Security, Compliance, Monitoring, Governance, FinOps",
  "apply_company": "tecRacer"
}