{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven **Senior Sales Engineer** with a robust background in **Systemdesign** and **Projektmanagement**, excelling in the development and implementation of **Notbeleuchtungssysteme**. With fluent communication skills in both German and English, I prioritize **Kundenorientierung** through tailored technical presentations that meet client needs. Leveraging over 10 years of experience, I demonstrate a strong ability in **Teamarbeit** and **Eigeninitiative** to drive effective solutions, ensuring project success and customer satisfaction. My collaborative approach and technical expertise foster impactful relationships in competitive environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized technical presentations to effectively communicate solutions and product benefits related to **Elektrotechnik** and **Notbeleuchtungssysteme** to potential clients.\nApplied project management skills to oversee multiple client projects, focusing on customer orientation and ensuring project milestones are met within **9** weeks.\nDesigned tailored system designs to meet specific client needs, demonstrating fluent communication skills in both **Deutsch** and **Englisch** to engage stakeholders effectively.\nCollaborated with cross-functional teams to address system integration challenges, ensuring a **100%** compliance rate with industry standards.\nInitiated proactive follow-ups and feedback loops that resulted in a **20%** increase in customer satisfaction ratings.\nExhibited strong teamwork to coordinate with engineers and clients for the development of customized solutions that meet regulatory requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Conducted technical presentations to clients, showcasing the advantages of advanced **Elektrotechnik** and **Notbeleuchtungssysteme** solutions, leading to a **30%** increase in customer engagement.\nDesigned tailored system solutions to meet unique customer needs, demonstrating exceptional **Kundenorientierung** and effectively communicating complex concepts in both German and English.\nManaged projects with a focus on detail-oriented **Projektmanagement**, ensuring timely delivery of system designs that adhered to industry requirements and standards, achieving a **100%** client satisfaction rate.\nLed team collaboration efforts to enhance communication and support **Teamarbeit**, successfully facilitating project outcomes across various departments.\nDemonstrated **Eigeninitiative** by proactively identifying opportunities for system improvements, resulting in a **20%** increase in operational efficiency.\nUtilized advanced skills in **Systemdesign** to implement innovative solutions that cater to customer specifications, continuously enhancing the value provided to clients."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Delivered technical presentations and demonstrations focused on trade execution and portfolio management solutions, highlighting benefits tailored to client needs.\nDesigned and implemented robust **back-end systems** to facilitate trade execution leveraging **Python** and **Flask**, ensuring seamless integration with client-specific needs and compliance regulations.\nManaged project timelines and stakeholders effectively, using **project management** techniques to ensure adherence to strict deliverables and deadlines.\nProvided expert communication and collaboration with cross-functional teams, utilizing strong **teamwork** skills to enhance the development of **REST APIs** for client engagement.\nConducted in-depth needs analysis for clients to drive customer-oriented designs, especially concerning **portfolio management** and **account tracking** systems.\nProactively identified and resolved system design challenges employing best practices in **system design**, demonstrating **initiative** in addressing potential issues before they escalate.\nFostered a customer-centric approach to all technical projects, aligning system functionalities with clients' **notbeleuchtungssysteme** allocations and expectations.\nCultivated strong relationships with clients to become their trusted advisor, ensuring they receive tailored system solutions that drive their success."
    }
  ],
  "skills": " **Programming Languages** \n\t Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks** \n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks** \n\t \n\n **API Technologies** \n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions** \n\t AWS (EC2, S3, Lambda)\n\n **Databases** \n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps** \n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure** \n\t Azure\n\n **Other** \n\t Elektrotechnik, Notbeleuchtungssysteme, Systemdesign, Kundenorientierung, Technische Präsentationen, Projektmanagement, Kommunikation, Eigeninitiative, Teamarbeit, Fließende Deutschkenntnisse, Englischkenntnisse\n",
  "apply_company": "Eaton"
}