{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Software Engineer with 10+ years of comprehensive experience in developing robust software solutions, emphasizing a strong command of **C**, **C++**, and **Java** within Agile and Scrum frameworks. Proficient in **Linux** environments and experienced in containerization using **Docker** for efficient deployment workflows, along with version control expertise in **Git** and **Subversion**. Skilled in AWS for cloud solutions and capable of system integration, bolstered by a solid foundation in **Python** and other modern technologies. \n\nDemonstrated ability to effectively solve complex problems and enhance team collaboration through excellent communication skills, adept in using **Jira** and **Confluence** for project management. Passionate about leveraging software engineering best practices to create impactful solutions while adhering to industry standards and compliance. \n\nBringing substantial hands-on experience in full stack development, including utilization of **React**, **Node.js**, and **Django**, with a focus on building microservices and event-driven architectures. Committed to continuous improvement and driving real-time analytics capabilities in software systems.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tUtilized **Python** in implementing full-stack solutions for complex systems, focusing on system integration to enhance performance and scalability in healthcare and finance sectors.\n•\tApplied Agile and Scrum methodologies to promote collaboration and continuous improvement, leading cross-functional teams to deliver high-quality software products on time.\n•\tDeveloped and maintained CI/CD pipelines using **Docker**, **Git**, and **AWS**, enhancing deployment efficiency by **30%** through automated workflows.\n•\tConducted system integration projects employing **Apache Camel** and **Apache Kafka**, enabling seamless data flow and interoperability across monolithic and microservices applications.\n•\tWorked with **Linux** environments to build and deploy applications, ensuring high availability and security in production systems.\n•\tLeveraged version control systems like **Git** and **Subversion** to manage codebase and collaboration, fostering effective communication and teamwork among developers.\n•\tChampion problem-solving and communication initiatives to address and adapt to evolving project requirements, achieving a **15%** reduction in critical project bottlenecks.\n•\tParticipated in design reviews and architecture sessions, utilizing **Enterprise Architect** for high-level system design visualizations that guided development strategies.\n•\tStreamlined project tracking and documentation using **Jira** and **Confluence**, ensuring all team members were aligned and informed with project progress and deliverables.\n•\tDesigned technical solutions based on business needs while mentoring junior developers in **Agile practices** and software engineering principles, enhancing team productivity by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Agile** and **Scrum** methodologies to lead the development and modernization of financial platforms, enhancing team collaboration and project delivery speed by **20%**.\nExpertly developed scalable, maintainable microservices using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), resulting in a **30%** increase in system throughput for high-volume transaction environments.\nDesigned and implemented user-friendly front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, achieving a **15%** improvement in user experience on financial dashboards and admin portals.\nDeveloped real-time transaction monitoring and analytics dashboards leveraging **React**, **D3.js**, and **Power BI Embedded**, empowering operations teams to track financial activity and generate actionable insights.\nIntegrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to establish robust event-driven architecture, facilitating real-time processing and communication for transactions and compliance workflows.\nConstructed and managed ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, enabling seamless batch and real-time data ingestion from both internal and external financial systems.\nExecuted AI/ML-driven fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, successfully analyzing transaction patterns to proactively flag suspicious activities, improving fraud detection rates by at least **25%**.\nCreated machine learning pipelines for credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, integrating model inference directly into backend services for responsive decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized clean and efficient code in **C**, **C++**, and **Java**, ensuring best practices are followed in software design and architecture for high-performance applications in line with Agile methodologies.\nImplemented and maintained CI/CD practices using **Docker**, **Git**, and **Subversion** for streamlined code deployments, enhancing collaboration within the software development team and ensuring timely delivery of features.\nEngineered backend services and integrated systems on **Linux** environments, collaboratively troubleshooting and resolving application issues, thereby improving system stability and availability in a fast-paced e-commerce landscape.\nConducted regular team scrums and utilized **Jira** and **Confluence** for efficient project management and documentation, ensuring clear communication within cross-functional teams and adhering to Agile principles.\nLeveraged **AWS** for cloud services, optimizing resource allocation and reducing operational costs by **30%** while ensuring system scalability and security.\nDeveloped robust, scalable applications utilizing **Apache Camel** and **Apache Kafka** for system integration, achieving **99.9%** uptime for mission-critical services.\nEmployed **Puppet** for configuration management across multiple servers, improving deployment consistency and reducing rollout times by **25%**.\nParticipated actively in team brainstorming sessions, applying strong problem-solving skills to tackle complex software challenges and deliver innovative solutions that meet user needs.\nFostered a culture of teamwork and open communication, providing mentorship and guidance to junior engineers and promoting knowledge sharing across the team."
    }
  ],
  "skills": "**Programming Languages**\n\tC, C++, Java, Python\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies**\n\tNginx, Keycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Puppet, Git, Subversion\n\n**Cloud & Infrastructure**\n\tLinux, Apache Camel, Apache Kafka\n\n**Other**\n\tAgile, Scrum, Jira, Confluence, Enterprise Architect, Camo Systems Modeller, System Integration, Problem Solving, Communication, Teamwork",
  "apply_company": "Leidos"
}