{
  "name": "Andrzej Ito",
  "role_name": "Senior FullStack Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior FullStack Engineer with over 9 years of experience, I specialize in developing scalable software solutions using **Python**, **FastAPI**, **Flask**, and **ReactJs**. My expertise in **RESTful** services and databases including **SQL** and **NoSQL** has enabled me to lead impactful projects that enhance user experience and performance. I am proficient in **Docker**, **Kubernetes**, and cloud platforms like **Google Cloud**, **AWS**, and **Azure**, ensuring efficient deployment and scalability through **CI/CD** and **DevOps** practices. I excel in mentoring junior engineers and fostering collaboration across cross-functional teams while maintaining clear and effective communication. My commitment to enhancing accessibility and driving technical excellence is at the forefront of all my endeavors.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2022",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "- Lead the development and implementation of cloud-based applications using **Python** and **FastAPI**, ensuring adherence to high standards of RESTful API design.\n- Designed and developed Hybrid Single Page Applications (SPAs) with a focus on **ReactJs** (version 17) and **Redux** (version 4.2.1), enhancing user experiences through advanced state management techniques.\n- Collaborated effectively within cross-functional teams, utilizing strong problem-solving and communication skills to deliver high-quality solutions.\n- Developed user interfaces with **React HOC**, **Redux**, and **React-router**, contributing to the seamless flow of the SPAs.\n- Leveraged **Angular** (version 14), HTML5, CSS, and **Bootstrap** to create responsive and user-friendly web pages, resulting in a 25% increase in user engagement metrics.\n- Implemented multithreading, concurrency, and file handling strategies in **Core Java**, showcasing robust knowledge of data structures and collections for effective backend processing.\n- Employed **Docker** for containerization, streamlining the deployment processes through automated image builds and integration into CI/CD pipelines, utilizing tools like **Jenkins** and **Ansible**.\n- Utilized both **SQL** and **NoSQL** databases including **Oracle**, **MySQL**, **PostgreSQL**, and **MongoDB** to manage and optimize data storage solutions efficiently.\n- Managed cloud infrastructure across **Google Cloud**, **AWS**, and **Azure**, leveraging **Kubernetes** for orchestration and better resource management, achieving a 30% reduction in operational costs."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2022",
      "location": "Tokyo, Japan",
      "responsibilities": "- Developed robust RESTful APIs using **FastAPI** and **Flask** to enhance backend communication and integration with front-end applications.\n- Implemented state management using **ReactJS** for efficient UI rendering and performance improvements, leveraging **React 12** and creating reusable components across multiple projects.\n- Designed and maintained databases with both **SQL** and **NoSQL** technologies, ensuring effective data storage and retrieval processes.\n- Utilized **Docker** for containerization to streamline application deployment, ensuring consistency across development, testing, and production environments.\n- Deployed applications on cloud platforms such as **Google Cloud**, **AWS**, and **Azure**, harnessing their services for scalability and reliability in production.\n- Engaged in continuous integration and continuous deployment (CI/CD) practices to enhance development workflows, utilizing tools and pipelines that uphold quality and efficiency.\n- Collaborated with cross-functional teams through effective communication and problem-solving strategies to deliver high-quality software solutions in a timely manner.\n- Employed **Kubernetes** for orchestration of containerized applications, leading to improved application availability and scalability.\n- Maintained version control using **Git**, effectively managing code changes and collaboration across the development team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed and maintained robust web applications utilizing **Python**, **FastAPI**, and **Flask** frameworks for backend services.\n• Designed and implemented **RESTful** APIs to ensure efficient data communication with frontend applications.\n• Collaborated with cross-functional teams using **Git** for version control, enhancing collaboration and communication.\n• Leveraged **ReactJs** for creating dynamic user interfaces, improving user experience and performance by **30%**.\n• Utilized both **SQL** and **NoSQL** databases in application development, ensuring optimal data storage solutions based on project requirements.\n• Implemented containerization with **Docker** and orchestration with **Kubernetes** to streamline application deployment and scale.\n• Engaged in **CI/CD** practices to automate deployment processes, reducing deployment time by **40%**.\n• Deployed applications on various cloud platforms, including **Google Cloud**, **AWS**, and **Azure**, enhancing application reliability and scalability.\n• Engaged in DevOps practices, improving collaboration between development and operations teams.\n• Solved complex problems by leveraging strong analytical and problem-solving skills, resulting in reduced downtime by **25%**."
    }
  ],
  "skills": "Programming Languages:\n\t**Java, C++, C#, Python, SQL, PLSQL, Kotlin**\n\n**Backend Frameworks:**\n\t**Spring, Spring Boot, Hibernate, Struts, JPA, FastAPI, Flask**\n\n**Frontend Frameworks:**\n\t**React, ReactJs, Vue, Angular**\n\n**API Technologies:**\n\t**REST APIs, RESTful, SOAP, Microservices**\n\n**Serverless and Cloud Functions:**\n\t**AWS, Azure, Google Cloud**\n\n**Databases:**\n\t**MS SQL Server, Oracle, MongoDB, PostgreSQL, Redis, NoSQL**\n\n**DevOps:**\n\t**Git, Docker, Kubernetes, CI/CD, DevOps**\n\n**Cloud & Infrastructure:**\n\t**AWS, Azure, Google Cloud**\n\n**Other:**\n\t**LINQ, SOLID, DRY, problem-solving, communication, collaboration**",
  "apply_company": "Ciklum"
}