{
  "name": "Rei Taro",
  "role_name": "Senior Data Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Data Engineer with over 10 years of proficiency in **data modeling** and developing high-quality backend systems for the banking sector. Skilled in **Python** and experienced in **Unix-Scripting** and **SQL** for database management and automation. Expertise in **CI/CD** practices and proficiency with **Azure DevOps** for continuous integration and deployment in cloud environments. Familiar with the principles of **Adobe Experience Platform** and **Real-Time Customer Data Platform** to harness customer data effectively. Proven ability to design scalable solutions, evidenced by a record of impactful contributions at leading organizations, including VISA, Sii Poland, and Reply Polska. Strong command of English enhances collaboration in diverse teams.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Unix-Scripting** to engineer backend data processing services for enhanced data modeling and integration with the **Adobe Experience Platform**.\nDeveloped robust data flows and transformations using **SQL** for analytics, enriched customer insights via a **Real-Time Customer Data Platform**.\nImplemented CI/CD practices with **Azure DevOps** to optimize deployment processes, achieving a deployment frequency increase of **30%**.\nManaged cloud-based solutions on **Azure**, ensuring high availability and performance for data services, reducing latency on processing tasks by **20%**.\nExecuted data pipeline automations for regulatory compliance, leveraging **Azure Functions** and maintaining a data flow accuracy rate of **99.9%**.\nCollaborated with banking sector stakeholders to integrate secure systems and data handling practices, enhancing compliance and security measures during the development cycle.\nFacilitated cross-functional team meetings, ensuring clear communication in **English** to address challenges and ensure project alignment."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Designed and implemented data models for **Adobe Experience Platform** to enhance customer insights and improve data quality.\nUtilized **Python** for building robust backend systems and data processing scripts, ensuring efficient data workflows and transformations.\nExecuted **CI/CD** practices with **Azure DevOps** to automate deployment pipelines, improving deployment speed by **40%**.\nDeveloped SQL queries for data extraction and analysis that reduced data processing time by **30%**.\nImplemented **Unix-Scripting** to create automated scripts for data integration tasks, enhancing data reliability and accuracy.\nCollaborated with stakeholders in the banking sector to ensure compliance and effective data governance strategies.\nLeveraged **Cloud** technologies to optimize data storage solutions and improve system scalability and performance by **50%**.\nConducted regular data quality checks and audits to maintain high standards of data accuracy and integrity."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **SQL** for data modeling and backend service development, significantly enhancing trade execution and portfolio management systems.\nDesigned and improved CI/CD pipelines using **Azure DevOps**, driving deployment efficiency with a 30% reduction in time to production.\nImplemented robust banking sector knowledge to ensure systems align with industry standards and best practices, particularly focusing on regulatory compliance.\nDeveloped shell scripts in **Unix-Scripting** to automate data processing tasks, achieving performance improvements of up to **25%**.\nCreated and maintained a **Real-Time Customer Data Platform** that integrated data from various sources, enhancing insights and analytics capabilities in trading environments.\nCollaborated with cross-functional teams to ensure seamless integration of data across applications, improving user experience and satisfaction.\nExecuted comprehensive testing frameworks with tools such as PyTest and maintained excellent test coverage, contributing to a **40%** decrease in production bugs.\nIntegrated **Cloud** solutions for scalable data storage and processing capabilities, optimizing overall system performance and reliability."
    }
  ],
  "skills": " **Programming Languages** \n\tPython, SQL, Bash, JavaScript\n\n **Backend Frameworks** \n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks** \n\t\n\n **API Technologies** \n\tREST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions** \n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps** \n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure** \n\tCloud\n\n **Other** \n\tAdobe Experience Platform, Real-Time Customer Data Platform, data modeling, banking sector knowledge, English, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, PyTest, Git",
  "apply_company": "Logicalis Spain"
}