{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior AI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Highly skilled Senior AI Engineer with 13+ years of experience specializing in **AI**, **ML**, and **MLOps**, demonstrating strong expertise in **Python** for model development and fine-tuning. Proficient in deploying machine learning models using **AWS Sagemaker** and **GCP Vertex AI**, and skilled in building and optimizing ETL processes supported by **Airflow** and **Kafka** for efficient data pipeline management. \nExperienced in prompt engineering and implementing state-of-the-art solutions using frameworks such as **TensorFlow** and **PyTorch**. Proven track record of mentoring and collaborating with teams to deliver high-performance applications across healthcare and financial industries. Additionally, adept in compliance-driven development aligned with industry standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented AI and ML solutions using **TensorFlow**, **PyTorch**, and **AWS Sagemaker**, developing advanced algorithms for real-time data processing and predictive analysis.\nDesigned and maintained MLOps workflows with **Airflow**, ensuring seamless ETL processes and model management across development stages.\nCollaborated effectively with cross-functional teams to drive prompt engineering initiatives, aligning AI capabilities with business objectives to enhance operational efficiency.\nDelivered high-impact projects leveraging **GCP Vertex AI** for model training and deployment, streamlining workflows for a diverse set of applications.\nConducted mentoring sessions for junior engineers, fostering collaboration and knowledge sharing in AI and machine learning best practices.\nDesigned and built full-stack platforms for both healthcare and fintech, utilizing **Python** (FastAPI), ensuring compliance with industry standards such as HIPAA and GDPR.\nLed the transformation of legacy systems utilizing **Docker** and **Kubernetes** for scalable deployments, enhancing system fault tolerance.\nManaged CI/CD pipelines with **GitHub Actions** and **Azure DevOps**, integrating automated testing and security checks to promote delivery reliability.\nDeveloped visual data analytics tools with **D3.js** for real-time operational insights and fraud detection, with a focus on performance metrics.\nDeployed intelligent features into user-facing applications, enhancing user experience through advanced analytics and secured API integrations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented Machine Learning (ML) solutions leveraging **TensorFlow**, **PyTorch**, and **AWS Sagemaker**, focusing on optimizing algorithms to enhance predictive accuracy for financial applications.\nDeveloped and maintained robust ETL processes using **Apache Airflow** to ensure efficient data ingestion and transformation, improving processing efficiency by **40%**.\nUtilized **Kafka** for real-time data streaming and asynchronous processing, facilitating communication across various services with a **50%** reduction in latency.\nCollaborated with cross-functional teams to integrate AI-driven features into existing applications, enhancing the user experience through advanced recommendations and insights.\nMentored junior engineers in best practices for AI and Machine Learning implementation, fostering a culture of knowledge sharing and continuous improvement.\nDelivered end-to-end Machine Learning pipelines for credit scoring and fraud detection, achieving **95%** accuracy in predictive models through effective prompt engineering and data strategy development.\nDesigned solutions using **GCP Vertex AI** for deploying scalable ML models, improving deployment times by **30%** and maintaining model performance.\nLeveraged **LangChain** technology to enhance natural language processing capabilities in applications, improving user interactions and engagement with financial tools."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leverage AI and ML technologies, specifically **TensorFlow**, **PyTorch**, and **AWS Sagemaker**, to design and implement intelligent systems that enhance e-commerce workflows, improving user engagement and conversion rates by **25%**.\nDevelop MLOps pipelines integrating **Kafka** for real-time data processing, and utilize **Airflow** for efficient ETL operations, ensuring data integrity and consistency across multiple sources for machine learning applications.\nCollaborate effectively with cross-functional teams to identify opportunities for AI-driven improvements, delivering insights that lead to a **30%** reduction in operational costs through automated processes.\nMentor junior engineers in applying ML techniques and best practices, fostering a collaborative environment that promotes knowledge sharing and professional growth.\nUtilize prompt engineering strategies to optimize LLM performance, enhancing user interaction and experience, resulting in an **increase of 15%** in customer satisfaction scores.\nDesign and optimize backend services for e-commerce platforms using **Python** (FastAPI, Django), ensuring low latency and high availability that supports **1M+** monthly transactions.\nCreate and implement features that enhance user experience with AI-driven recommendation systems, effectively personalizing product listings and improving relevance accuracy by **20%**.\nEngage in feature flagging and controlled rollouts using industry-standard tools, ensuring robust deployment strategies that minimize risks associated with new feature releases.\nApply role-based access control (RBAC) and OAuth 2.0 for secure data management, ensuring compliance with GDPR regulations and protecting customer data effectively."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, GCP Vertex AI, AWS Sagemaker\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tAI, ML, LLM, LangChain, TensorFlow, PyTorch, MLOps, Prompt Engineering, ETL, Kafka, MLflow, Airflow, Collaboration, Mentoring, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "aPriori Technologies"
}