{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Rust Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Rust Engineer with 10+ years of software development experience, proficient in **Rust**, **Golang**, and **TypeScript**. Demonstrated expertise in building secure and efficient systems with a strong focus on **Identity Management**, **Access Management**, and **Security** practices, including OAuth and OIDC. Experienced in developing solutions that integrate AI technologies for enhanced performance and real-time analytics. Proven track record in designing and deploying cloud-native applications utilizing modern frameworks, with experience in **microservices** and event-driven architectures. Additionally, skilled in CI/CD automation, ensuring high-quality software delivery aligned with compliance standards. Passionate about leveraging technology for impactful solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Rust Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented secure, high-performance applications using **Rust** and **Golang**, ensuring robust **Identity Management** and **Access Management** practices.\n• Developed security protocols and optimized OAuth and OIDC implementations to enhance system integrity and user authentication.\n• Leveraged **TypeScript** in developing scalable applications, integrating with advanced security measures to protect sensitive data.\n• Built and deployed applications with a focus on **AI** enhancements, delivering smart features that improve user engagement and data insights.\n• Collaborated on projects involving **WASM**, improving code efficiency and performance across various platforms.\n• Streamlined DevOps processes leveraging tools like GitHub Actions for CI/CD, improving deployment speed by **30%**.\n• Implemented security strategies that ensured compliance with industry regulations, reducing vulnerabilities by **45%** across applications.\n• Participated in code reviews and established best practices for secure coding, enhancing team productivity and code quality by **25%**.\n• Engaged with cross-functional teams to integrate feedback and continuously improve application security and performance.\n• Provided technical guidance and mentorship in adopting **Rust** programming practices, fostering a culture of security-aware development."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Rust** to develop secure and efficient backend services, enhancing overall system performance and ensuring **security** protocols were strictly adhered to.\nImplemented **OAuth** and **OIDC** for secure identity and access management, ensuring robust user authentication and authorization across applications.\nDeveloped efficient algorithms in **Golang** that improved data processing speeds by **30%**, optimizing backend processes.\nCreated innovative tools using **TypeScript** that improved code maintainability and reduced bugs by **25%** through better type checking.\nIntegrated **WASM** technology into existing systems to enhance performance and leverage multi-language capabilities for application development.\nDesigned and executed secure access management frameworks to protect sensitive financial data, reducing potential security breaches by implementing **industry-standard practices**.\nConducted research on AI technologies, integrating them into applications to enhance user experience and automate routine tasks for a more efficient workflow."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Applied **Rust** for systems programming and optimizing backend microservices, ensuring high-performance and security across applications.\nIntegrated **OAuth** and **OIDC** protocols for secure authentication and identity management, safeguarding user sessions and data integrity.\nDesigned and implemented secure API endpoints with robust access management strategies to enforce role-based access control (RBAC), enhancing application security.\nLeveraged **TypeScript** for type-safe development, improving code maintainability and reducing runtime errors across frontend and backend components.\nUtilized **WASM** for performance optimization of complex computations in the browser, providing seamless and fast user experiences.\nDeveloped and deployed AI-driven features using **machine learning** frameworks to personalize user interactions and enhance system capabilities.\nImplemented security best practices across the application, ensuring GDPR compliance and minimizing vulnerabilities in the software lifecycle.\nCollaborated with cross-functional teams to ensure compliance with security standards and to instill a culture of security awareness within the engineering team.\nContributed to the ongoing evolution of the tech stack and architecture, ensuring scalability and reliability for future growth and development.\nParticipated in code reviews and technical discussions to refine processes and maintain high code quality, driving performance improvements by up to **40%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Rust, JavaScript, TypeScript, Golang\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, OIDC\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Security, JWT, Let’s Encrypt, Nginx, Certbot, Identity Management, Access Management, WASM, AI",
  "apply_company": "1Password"
}