{
  "name": "Rei Taro",
  "role_name": "Senior Support Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Support Engineer with 10+ years of experience in problem-solving and technical support within SaaS environments. Proficient in SQL for database management and analytics, leveraging tools such as **Metabase** for reporting and insights. Skilled in utilizing **Zendesk** for customer support and ticket management, as well as **JIRA** and **Linear** for project tracking. Known for clear communications and technical writing, ensuring effective collaboration and user acceptance testing (UAT) processes. Strong background in backend development with expertise in creating APIs and automation tools, utilizing a tech stack that includes **Python (FastAPI, Django, Flask)** and cloud platforms such as **AWS** and **Azure**. Proven track record of enhancing customer satisfaction through analytical thinking and responsive support, honed through contributions to major organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Provided exceptional **Customer Support** through effective communication and problem-solving skills, addressing 95% of user inquiries within **24 hours**.\nUtilized **SaaS** solutions such as **Zendesk** and **Metabase** to enhance customer experiences and streamline reporting tasks, achieving a 15% increase in user satisfaction scores.\nEngaged with cross-functional teams using **JIRA** and **Linear** to document issues, manage workflows, and ensure timely resolutions, resulting in a **30%** improvement in response time for support tickets.\nConducted User Acceptance Testing (**UAT**) to validate new features and integrations, ensuring that they align with customer expectations and requirements.\nDeveloped and maintained comprehensive technical documentation to support users and assist in onboarding, reducing training time by **20%**.\nLeveraged **SQL** for data analysis related to customer inquiries, enabling faster identification of trends and proactive issue resolution for common support problems.\nEmployed **Sendgrid** for streamlined email communications, enhancing customer notifications and updates related to support activities."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Provided exceptional **Customer Support**, ensuring user satisfaction and efficient problem resolution across all **SaaS** offerings.\nLeveraged **SQL** to analyze and troubleshoot customer issues, leading to a **15%** reduction in response time and improved service metrics.\nUtilized **Metabase** for data analysis and reporting, facilitating informed decision-making and enhancing overall customer experience.\nManaged ticketing and communication through **Zendesk**, streamlining support processes and increasing user engagement by **30%**.\nCreated detailed **Technical Writing** documentation for internal teams, enhancing knowledge sharing and reducing onboarding time by **20%**.\nConducted **User Acceptance Testing (UAT)**, ensuring that new features met functional requirements and maintained high-quality standards.\nFostered effective **Communications** with cross-functional teams using **JIRA** and **Linear**, ensuring timely issue resolution and project updates.\nImplemented support automations using **Sendgrid**, improving response efficiency by sending out **10,000+** automated emails monthly for common inquiries.\nUtilized strong **Problem Solving** and **Analytical** skills to resolve complex client issues in a fast-paced environment, consistently improving customer satisfaction ratings."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Enhanced customer support by implementing robust **SaaS** solutions for trade execution and portfolio management, leveraging superior **SQL** capabilities to handle data effectively.\nUtilized advanced troubleshooting and **problem-solving** skills to resolve customer queries related to system functionalities and compliance issues with **MiFID II** and **GDPR** regulations.\nMaintained clear and proactive **communications** with stakeholders, utilizing tools like **Zendesk** for tracking support tickets and providing timely updates on issue resolution.\nDeveloped analytical reports using **Metabase** to derive insights from customer interactions, improving overall user experience.\nCollaborated with development teams to facilitate **UAT** (User Acceptance Testing) of new features and enhancements, ensuring alignment with customer requirements and expectations.\nCreated extensive technical documentation and guides for internal teams as well as end-users, improving the knowledge base and reducing support ticket volume by **20%**.\nImplemented workflow management using **JIRA** for tracking support requests and project management, ensuring all customer needs were addressed efficiently.\nDesigned and executed feedback loops using **Linear** to continuously improve support processes based on analyzed data from prior interactions, resulting in a **30%** increase in customer satisfaction ratings."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tCustomer Support, SaaS, Metabase, Zendesk, Linear, JIRA, Sendgrid, UAT, Communications, Problem Solving, Technical Writing, Analytical, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git",
  "apply_company": "Sona"
}