{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Field Engineer with 13+ years of experience in embedded systems and in-vehicle networking, specializing in **C/C++**, **AUTOSAR**, and communication protocols like **DDS** and **SOME/IP**. Proficient in **Python** and **Java**, with a solid understanding of SDLC and web services. Experienced in cloud-native architectures, utilizing **Containers** and deploying on cloud platforms such as **AWS** and **Azure**.\nSkilled in networking technologies including **UDP**, **Multicast**, and **VLANs**, alongside a strong grasp of OSI layered networking. Effective in delivering technical presentations and communicating complex concepts clearly to stakeholders. Leveraging past expertise in **microservices** and **CI/CD pipelines**, I am adept at driving project success through innovative problem-solving and collaboration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented Embedded Systems solutions utilizing **C/C++** for AUTOSAR and In-Vehicle Networking projects, ensuring compliance with industry standards.\nLed the development of cloud-native applications, leveraging **Python** and utilizing **Web Services** for integration with external systems, enhancing vehicle communication.\nDeveloped SDLC processes for efficient project management, including planning, execution, and retrospectives, to streamline software delivery in automotive environments.\nDesigned and integrated DDS and SOME/IP middleware protocols for efficient data communication within vehicular networks, ensuring minimal latency and robust message delivery.\nUtilized virtualization technologies and hypervisors for development and testing, facilitating seamless development of applications across various platforms.\nDesigned and implemented networking solutions using **UDP** and **Multicast** protocols, optimizing data transmission across OSI Layer architectures.\nParticipated in workshops and presentations to communicate technical concepts effectively to stakeholders, showcasing strong presentation skills and communication.\nConducted evaluations and performance testing of embedded systems, ensuring reliability and safety in automotive applications, achieving a **99.9%** uptime rating in deployed systems.\nCollaborated with cross-functional teams to enhance system architecture and design, integrating components to improve overall system performance.\nDeveloped user-friendly interfaces and documentation to accompany automotive software solutions, aiding in user training and adoption within organizations."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Enhanced **Embedded Systems** architecture through integration of **C/C++** for developing reliable in-vehicle applications, optimizing for performance and real-time processing.\n• Led the Software Development Life Cycle (**SDLC**) for various projects, ensuring adherence to best practices while maintaining high-quality deliverables.\n• Implemented **Cloud-Native** solutions to improve operational efficiency and scalability across existing systems, using containers and orchestration tools.\n• Utilized **Python** and **Java** for backend development, streamlining data processing and enhancing communication between microservices.\n• Developed and optimized **Web Services** leveraging **DDS** and **SOME/IP** protocols, enhancing in-vehicle networking capabilities and ensuring interoperability.\n• Designed **Virtualization** solutions that support **Hypervisors** for efficient hardware resource management and increased system reliability.\n• Improved networking solutions through robust **UDP** and **Multicast** strategies, facilitating seamless data exchange in dynamic environments.\n• Directly contributed to the design of custom communication protocols adhering to **OSI Layer** standards, ensuring smooth data routing and integrity.\n• Collaborated with cross-functional teams to enhance **VLANs**, achieving a 30% increase in network performance and reducing latency in controller communications.\n• Delivered presentations and demos with a focus on **Communication** skills, effectively conveying complex technical concepts to stakeholders and driving product adoption."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized embedded systems solutions using **C/C++**, adhering to the **SDLC**, while ensuring high reliability and real-time performance suitable for automotive applications.\nLeveraged **AUTOSAR** standards and **In-Vehicle Networking** protocols such as **DDS** and **SOME/IP** for seamless data communication and interoperability between vehicle components.\nDeveloped innovative cloud-native applications deployed in containerized environments using **Docker** and **Kubernetes**, enhancing deployment efficiency and scalability.\nImplemented **Web Services** utilizing **Python** and **Java** for robust communication between vehicle systems and external applications, ensuring secure data exchange.\nApplied effective networking protocols including **UDP** and **Multicast** to optimize data transport in vehicle communication networks, ensuring minimal latency and maximum reliability.\nExecuted comprehensive testing and validation processes for embedded solutions, achieving a **99%** pass rate in quality assessments and meeting automotive safety standards.\nEngaged in technical presentations and documentation, showcasing complex technical concepts with clarity to diverse stakeholders.\nFostered strong communication channels within teams and with external partners, ensuring alignment and collaboration across projects.\nUtilized virtualization techniques and **Hypervisors** to enhance system resource allocation and improve the responsiveness of embedded applications.\nContributed to routing strategies and **VLANs** configuration, optimizing data traffic flow and ensuring efficient network performance within the automotive infrastructure."
    }
  ],
  "skills": " **Programming Languages:**\n\tC, C++, Python, Java\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tWeb Services, SOME/IP\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCloud-Native, Virtualization, Hypervisors, Networking, VLANs\n\n**Other:**\n\tAUTOSAR, In-Vehicle Networking, SDLC, DDS, Embedded Systems, Presentation Skills, Communication, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Real-Time Innovations (RTI)"
}