{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Consultant",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Accomplished Consultant with 13+ years of experience specializing in **Solidity**, **EVM**, and **Smart Contracts** development, alongside cloud expertise in **AWS**, **Azure**, and **GCP**. Proven ability to design and deploy decentralized systems integrating **Cryptography** and **Tokenomics**, ensuring robust and secure applications within the **DeFi** space. Skilled in leveraging tools such as **MythX**, **Slither**, **Hardhat**, **Foundry**, **Truffle**, **Remix**, and **The Graph** for enhanced project delivery and compliance.\n\nAdditionally, I bring a strong foundation in full stack development with proficiency in **JavaScript/TypeScript**, **Python**, and **Flutter**. Hands-on experience with frameworks and libraries including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Champion of cloud-native system deployment and automation, I have effectively created AI/ML-driven platforms utilizing predictive analytics and CI/CD pipelines. Committed to aligning solutions with standards such as HIPAA, FHIR, PCI DSS, and SOC 2, while enhancing client interactions through hands-on engagement and a strong sense of autonomy.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Consultant",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed **smart contracts** utilizing **Solidity** and **EVM** for decentralized applications, enhancing security and functionality in blockchain-based solutions.\n• Provided expert guidance on implementing **cryptography** techniques to safeguard data in blockchain transactions, ensuring compliance with industry standards.\n• Designed and developed API integrations with blockchain technologies to facilitate seamless data interchange for **DeFi** applications.\n• Led client interactions to gather requirements and deliver tailored **decentralized systems** solutions, ensuring alignment with project goals and user needs.\n• Implemented **GCP** and **AWS** services to enhance cloud infrastructure for blockchain applications, optimizing performance and scalability.\n• Executed comprehensive testing strategies using tools like **MythX**, **Slither**, and **Hardhat** to identify vulnerabilities and ensure the integrity of smart contracts.\n• Collaborated with cross-functional teams to integrate AI capabilities within decentralized applications, leveraging **machine learning** for predictive analytics and decision-making.\n• Created and maintained DevOps integrations for blockchain projects using **Foundry** and **Truffle**, streamlining deployment and version control processes.\n• Enhanced user experiences by facilitating **client interactions** throughout the project lifecycle, building strong relationships and ensuring satisfaction.\n• Devised strategies around **tokenomics** to maximize value propositions and sustainability for new blockchain projects.\n• Engaged in performance optimization and troubleshooting of blockchain applications, ensuring high availability and responsiveness in production environments.\n• Delivered training sessions for clients on utilizing smart contracts and understanding **decentralized finance (DeFi)** applications, promoting self-sufficiency and knowledge transfer."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Azure** and **AWS** cloud services to optimize the performance of decentralized financial applications and ensure seamless integration with various third-party systems.\nDeveloped and implemented **Smart Contracts** using **Solidity** on **EVM** compatible networks, enhancing trust and security in financial transactions.\nUtilized **APIs** to create robust interactions between decentralized systems and traditional financial platforms, facilitating a smoother client experience.\nConducted thorough audits of smart contracts using tools like **MythX**, **Slither**, and **Hardhat**, ensuring compliance and security standards are met across **10+** deployed contracts.\nEngaged with clients to understand requirements and provide tailored financial solutions, maintaining high levels of client satisfaction through effective communication and proactive support.\nDesigned decentralized applications (dApps) following best practices in **Tokenomics** and **DeFi**, driving innovation in the financial sector.\nApplied **AI** methodologies to enhance the functionality of financial tools, focusing on predictive analysis and client behavior modeling.\nExecuted projects autonomously, demonstrating self-sufficiency and the ability to deliver results under tight deadlines while managing multiple initiatives simultaneously.\nEmployed **Remix** and **Truffle** for testing and deploying smart contracts, with a focus on improving programming output efficiency by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Provided strategic consultancy on **Decentralized Systems** and **Smart Contracts** leveraging **Solidity** and **EVM**, ensuring robust implementation aligned with business objectives.\n- Collaborated with clients to design and implement **APIs** using **GCP**, **AWS**, and **Azure**, enhancing operational efficiency and service scalability.\n- Utilized **MythX**, **Slither**, and **Hardhat** for thorough smart contract audits, improving security and compliance for over **30** deployed contracts.\n- Developed and deployed high-performance decentralized applications using **Truffle**, **Remix**, and **The Graph**, making sure they met industry standards and user needs.\n- Engaged in client-facing interactions with a focus on educating stakeholders about **Tokenomics** and **DeFi** opportunities, driving adoption and investment.\n- Applied principles of **Cryptography** and data privacy in system designs, ensuring compliance with regulations and fostering trust among users.\n- Acted autonomously to troubleshoot and optimize solutions across various cloud services, maintaining up to **99.9%** service uptime.\n- Integrated machine learning capabilities to enhance user experiences, akin to traditional AI implementations, based on real-time feedback and behavioral insights.\n- Championed the implementation of secure access protocols such as **OAuth 2.0** to safeguard customer and administrative access, reinforcing data integrity and compliance.\n- Led the development of blockchain-based solutions that empowered over **1000** unique users, enhancing user interaction within decentralized finance systems."
    }
  ],
  "skills": " **Programming Languages**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\tSolidity\n\n **Backend Frameworks**\n\tFlask\n\tDjango\n\n **Frontend Frameworks**\n\tReact\n\tVue\n\tAngular\n\n **API Technologies**\n\tAPIs\n\n **Serverless and Cloud Functions**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tGCP\n\n **Databases**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n **DevOps**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n **Cloud & Infrastructure**\n\tAWS\n\tAzure\n\tGCP\n\n **Other**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n\tMythX\n\tSlither\n\tHardhat\n\tFoundry\n\tTruffle\n\tRemix\n\tThe Graph\n\tCryptography\n\tDecentralized Systems\n\tSmart Contracts\n\tTokenomics\n\tDeFi\n\tClient Interaction\n\tAutonomy\n\tAI"
}