{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in delivering high-performance applications across the healthcare and financial industries. Proficient in **Java**, **Spring**, and RESTful API development, with hands-on expertise in **MySQL** and **Elastic Stack** including **Elasticsearch**. Experienced in cloud-native deployments using **AWS**, and containerization with **Docker**. Skilled in Agile methodologies, including **Scrum**, fostering effective **teamwork** and adaptability in fast-paced environments.\n\nExpertise in building robust applications with **JavaScript/TypeScript**, **Python**, and **Flutter**, while utilizing frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept in developing AI/ML-powered platforms that harness predictive analytics, automation, and real-time processing. Proficient in implementing microservices, event-driven architectures, and CI/CD pipelines.\n\nStrong background in compliance-driven development, ensuring alignment with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Knowledgeable in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**, driving project success through innovative solutions and continuous growth.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained **REST**ful APIs and backend services using **Java** and **Spring**, ensuring high performance and scalability for both health and finance applications.\n• Designed and optimized **MySQL** databases to support efficient data storage and retrieval, enabling scalable applications processing thousands of transactions daily.\n• Utilized **Elasticsearch** for implementing advanced search capabilities, facilitating fast querying and analysis of health and financial datasets.\n• Integrated cloud services on **AWS** to enhance application infrastructure, leveraging services for improved reliability and performance.\n• Leveraged **Docker** for containerization of applications, promoting consistent development and deployment across multiple environments in an **Agile** and **Scrum** setting.\n• Demonstrated exceptional **Teamwork** and **Adaptability** by collaborating with cross-functional teams to deliver projects ahead of schedule, improving team productivity by over **20%**.\n• Participated in **SaaS** product development, focusing on secure and reliable solutions that meet industry compliance and user needs.\n• Led the migration of legacy systems into microservices architectures, resulting in a **50%** reduction in deployment time through the use of container orchestration tools.\n• Ensured robust project management through the implementation of Agile methodologies, contributing to continuous improvement and growth within the software development process.\n• Mentored junior engineers, fostering a culture of learning and collaboration that has resulted in improved team performance and engagement."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and maintained **Java** applications using **Spring** framework, ensuring RESTful APIs are efficiently designed for seamless integration with front-end services.\n- Utilized **MySQL** for database management, optimizing query performance through advanced indexing techniques, leading to a **25%** increase in response time.\n- Designed and implemented solutions using **Docker** for containerization, enabling consistent development and production environments across various deployment platforms.\n- Coordinated Agile development processes and participated in **Scrum** meetings, contributing to a **15%** increase in team productivity and on-time project delivery.\n- Integrated **Elastic Stack** (Elasticsearch, Logstash, Kibana) for enhanced logging and dashboarding capabilities, improving system observability and troubleshooting efficiency by **30%**.\n- Collaborated in a team-oriented environment, leveraging **AWS** cloud services for scalable infrastructure, which facilitated the deployment of SaaS offerings to over **200** clients.\n- Adapted to rapid changes in project requirements and environments, demonstrating a high level of adaptability in delivering high-quality software solutions.\n- Engaged in continuous growth by learning and applying new technologies within finance software development, ensuring alignment with industry standards and best practices."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Spring** frameworks to develop robust backend services for a high-traffic e-commerce platform, ensuring efficient integration with **REST** APIs and real-time processing capabilities.\nDesigned and managed **MySQL** databases to support distributed data storage and retrieval, processing over **100,000** transactions daily with optimized queries for performance.\nLeveraged **Elasticsearch** to implement advanced search functionalities and analytics, enhancing user experience by providing search results in under **200** milliseconds.\nDeployed and maintained services on **AWS**, utilizing **Docker** for containerization, enabling a microservices architecture that supports seamless scalability during peak periods.\nCollaborated effectively in an **Agile** development environment, participating in **Scrum** ceremonies to ensure on-time delivery of features and fostering a culture of **Teamwork** and **Adaptability** among cross-functional teams.\nImplemented logging and monitoring solutions using the **Elastic Stack**, ensuring application reliability and system performance for over **500** concurrent users.\nEngaged in continuous improvement initiatives that led to a **25%** increase in deployment frequency and a **30%** decrease in production incidents by applying **SaaS** best practices.\nDeveloped and integrated custom APIs and microservices in compliance with industry standards, ensuring secure authentication using OAuth 2.0 protocols and maintaining compliance with GDPR regulations."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tSpring, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services\n\n**Databases:**\n\tMySQL, PostgreSQL, MongoDB, Redis, Elasticsearch\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Agile, SaaS, Scrum, Teamwork, Adaptability, Growth",
  "apply_company": "Brightflag"
}