{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with 9+ years of comprehensive experience in developing and implementing high-performance applications leveraging **Java**, **Kotlin**, and **Springboot**. Proficient in database management with **Postgres** and skilled in both backend and integrated frontend frameworks like **React**. Strong background in continuous integration tools such as **CircleCI** and deployment strategies utilizing **Spinnaker**. Proven record of delivering scalable solutions, enhancing application efficiency, and optimizing development workflows. An effective collaborator with a history of leading cross-functional teams to drive project success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Java** and **Kotlin** in the backend development of high-performance applications and services, enhancing system functionality and speed.\nUtilized **Spring Boot** to create RESTful APIs, integrating with a **Postgres** database, which improved data handling and response times by **30%**.\nEmployed **React** for frontend components to streamline user interactions while ensuring seamless integration with backend services.\nImplemented CI/CD pipelines using **CircleCI** and **Spinnaker**, achieving a **40%** reduction in deployment times and improving release frequency.\nDesigned web applications focused on scalability, modularity, and performance, achieving a user satisfaction increase by **25%** based on feedback metrics.\nCollaborated with cross-functional teams to deliver robust applications, improving overall project delivery timelines by **20%**.\nOptimized existing database structures and queries for **Postgres**, reducing average query execution times by **20%** and enhancing data retrieval processes.\nDesigned unit and integration tests to ensure code quality and functionality, achieving a **95%** test coverage.\nParticipated in code reviews, ensuring adherence to best practices and maintaining high code quality standards."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Java** and **Kotlin** to design and develop robust backend services, enhancing overall application performance and reliability.\nImplemented microservices architecture using **Springboot**, leading to a 20% increase in service availability.\nDesigned and maintained PostgreSQL databases, ensuring efficient data storage and retrieval processes, which improved data access speed by 30%.\nIntegrated CI/CD pipelines using **CircleCI**, reducing deployment times from 15 minutes to less than 5 minutes, and minimizing errors in production.\nAdopted **Ruby on Rails** for rapid application development, resulting in a 25% decrease in development time for new features.\nCollaborated closely with frontend teams using **React** to ensure seamless integration between the backend and user interface components.\nExecuted performance tuning and optimization of database queries, achieving a 40% boost in overall application efficiency.\nLed a team of developers in code reviews and mentorship initiatives, contributing to a 15% increase in overall productivity and code quality.\nAnalyzed and revised existing codebases for technical debt reduction, enhancing maintainability and robustness of software solutions.\nParticipated in agile methodologies and sprint planning, ensuring projects were delivered on time with a minimum of 98% satisfaction rate from stakeholders."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and maintained backend services using **Java** and **Springboot**, ensuring high performance and scalability to handle **1000+** concurrent users.\nImplemented **Postgres** for database management, optimizing query response times by up to **40%** through efficient indexing strategies.\nCollaborated with frontend teams to create dynamic applications using **React**, enhancing user experience and reducing load times by **25%**.\nAutomated deployment workflows utilizing **CircleCI** and **Spinnaker**, leading to a **30%** reduction in deployment frequency while improving reliability.\nArchitected microservices for modular application development, significantly reducing code duplication and increasing developer efficiency.\nParticipated in code reviews and agile ceremonies, fostering a culture of continuous improvement and adherence to best practices.\nProvided mentorship and guidance to junior developers, facilitating knowledge sharing and skill development within the team.\nDelivered comprehensive technical documentation for systems developed, ensuring seamless onboarding for new team members."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, Kotlin, Python, JavaScript, TypeScript, C#, Ruby\n\n**Backend Frameworks**\n\tSpringboot, NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Rails\n\n**Frontend Frameworks**\n\tReact, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tNone\n\n**Databases**\n\tPostgreSQL, MSSQL Server, MySQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines, CircleCI, Spinnaker\n\n**Cloud & Infrastructure**\n\tNone\n\n**Other**\n\tUX/UI Design, Git, GitHub, Microservices, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Redis, Apache Kafka, RabbitMQ",
  "apply_company": "AlphaSights"
}