{
  "name": "Rei Taro",
  "role_name": "Senior Cloud-Native Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Innovative Senior Cloud-Native Engineer with 10+ years of experience in building robust **micro-services** and **distributed systems** utilizing cutting-edge technologies. Proficient in **Kubernetes** for orchestration and container management, alongside **Golang** for efficient backend development. Expertise in crafting automation solutions and developer tools while leveraging **containers** to deliver scalable architectures. Demonstrated success in developing high-performing APIs and systems for renowned organizations such as VISA, Sii Poland, and Reply Polska. Adept at implementing **cloud-native architectures** and contributing to impactful projects within the financial and AI/ML sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud-Native Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented **Kubernetes** for orchestration of **micro-services**, enhancing scalability and robustness of deployed applications in cloud environments.\nEngineered backend solutions using **Golang** to facilitate communication between **containers**, improving efficiency and resource utilization by over 30%.\nDesigned and developed automated deployment pipelines leveraging developer tools to streamline the integration of open-source technologies, resulting in a **50% reduction** in time-to-production.\nArchitected distributed systems that adhere to **CNCF** standards, optimizing application performance and resilience under high traffic conditions.\nManaged container build systems to ensure consistent application delivery across environments, achieving a **99.9% uptime** in production.\nCollaborated with teams to drive automation initiatives, resulting in a **25% increase** in overall system reliability and decreased manual intervention.\nConducted rigorous assessments for new technologies and tools, incorporating them into the development lifecycle for enhanced development and deployment processes."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Designed and implemented micro-services architecture utilizing **Golang** and **Kubernetes** to enhance scalability and manageability of distributed systems, leading to a **30%** increase in system performance.\n• Leveraged **containers** for packaging and deploying applications, streamlining the development process and reducing deployment times by **50%**.\n• Developed automation scripts and tools using industry-leading **developer tools** to optimize workflows and ensure consistency across environments, achieving a **40%** reduction in manual efforts.\n• Ensured adherence to **CNCF** standards and principles by integrating open-source technologies that enhance system reliability and efficiency.\n• Collaborated with cross-functional teams to drive successful releases and ensure regulatory compliance in every software deployment.\n• Conducted performance assessments and optimizations on container build systems to improve application responsiveness and resource utilization."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Leveraged **Kubernetes** and **Golang** to deploy and manage scalable micro-services for backend trade execution and portfolio management that improved transaction speeds by **30%**.\nDeveloped and maintained containerized applications ensuring operational efficiency within a distributed system architecture using **containers** and **CNCF** standards.\nImplemented automation processes to enhance developer productivity by reducing deployment times by **25%** while ensuring adherence to best practices in container build systems.\nIntegrated open-source tools to optimize service orchestration and streamline CI/CD pipelines, boosting the release frequency to **bi-weekly** updates.\nUtilized developer tools for monitoring and logging, ensuring all services delivered high availability and performance metrics.\nCollaborated cross-functionally with frontend teams to enhance user experience via REST APIs, ensuring seamless integration and data flow using modern communication protocols.\nEnforced compliance with regulatory requirements while implementing robust security measures across all services to protect sensitive user data."
    }
  ],
  "skills": "**Programming Languages**\n\tGolang, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, automation\n\n**Cloud & Infrastructure**\n\tcontainers, distributed systems, CNCF, developer tools, container build systems\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, PyTest, Git, open-source",
  "apply_company": "vCluster"
}