{
  "name": "Tomasz Lee",
  "role_name": "Senior AI Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior AI Engineer with 9+ years of software development experience, focusing on advanced AI and machine learning technologies. Proficient in **Python**, **TensorFlow**, **PyTorch**, and **scikit-learn**, with a deep understanding of machine learning frameworks such as **LangChain**. Demonstrated expertise in deploying applications on **AWS** and **GCP**, with practical knowledge of **MLOps**, **ETL**, **ELT**, and **Airflow** for data pipeline management. Versatile in system integration and high-level architecture with relevant experience in **Kafka** for real-time data processing. A collaborative team player with strong communication skills, known for mentorship and leading projects to success. Proven track record in designing and implementing software solutions that optimize performance and streamline processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Python** for implementing AI/ML algorithms, resulting in a **15%** increase in model accuracy.\nDeveloped and deployed machine learning models using **TensorFlow** and **PyTorch** for predictive analytics, improving decision-making efficiency by **20%**.\nDesigned ETL processes utilizing **Apache Kafka** and **Airflow** to streamline data ingestion and transformation workflows, enhancing data availability by **30%**.\nCollaborated with cross-functional teams, employing strong communication and mentorship skills to guide junior developers in AI initiatives.\nImplemented best practices in MLOps, enabling continuous integration and deployment of machine learning models, reducing deployment times by **25%**.\nUtilized cloud services such as **AWS** and **GCP** to manage scalable AI solutions, optimizing cloud resource utilization by **35%**.\nExecuted data transformation strategies in aligning with ELT principles, resulting in improved data pipeline efficiency.\nConducted comprehensive code reviews and provided feedback to ensure high-quality AI software development.\nDeveloped algorithms utilizing **scikit-learn** for model training and evaluation, achieving refined results for various AI applications."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented AI-driven solutions using **TensorFlow** and **PyTorch** to enhance machine learning model performance, achieving a **20%** increase in accuracy.\nDesigned and executed machine learning pipelines leveraging **MLOps** best practices for streamlined deployment and monitoring, resulting in a **30%** decrease in model retraining time.\nDeveloped and optimized ETL and ELT processes with **Apache Airflow** to improve data flow efficiency, leading to faster retrieval times and a **15%** reduction in data processing latency.\nCreated scalable data architecture on **AWS** and **GCP**, ensuring high availability and reliability for machine learning projects.\nCollaborated effectively with cross-functional teams to clarify project requirements and optimize collaboration, enhancing team productivity by **25%**.\nConducted knowledge transfer sessions and mentorship programs for junior developers, fostering a culture of continuous learning and improvement.\nIntegrated **Kafka** for real-time data processing and event handling, enhancing the responsiveness of applications to user inputs.\nSpearheaded the integration of CI/CD pipelines for machine learning models using **GitHub Actions**, resulting in a **30%** reduction in deployment errors.\nParticipated in rigorous code review processes to maintain high quality standards and support junior team members in their professional development."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "- Designed and implemented AI solutions using **Python** and **TensorFlow**, enhancing predictive capabilities by 30%.\n- Utilized **AWS** and **GCP** cloud services for deploying scalable machine learning models, improving accessibility and performance by **15%**.\n- Developed Machine Learning pipelines using **Airflow**, effectively managing ETL processes for data processing with a reduction in runtime by **25%**.\n- Collaborated with cross-functional teams to integrate AI and machine learning functionalities while ensuring adherence to project deadlines and coding standards.\n- Mentored junior team members on **ML** best practices, fostering a culture of learning and knowledge sharing.\n- Employed **scikit-learn** for model evaluation and optimization, leading to an increase in model accuracy by **10%**.\n- Participated in the deployment of CI/CD pipelines, utilizing **Kafka** for real-time data processing and integration across systems.\n- Conducted code reviews and participated in daily stand-ups to synchronize project milestones and enhance team communication.\n- Contributed to the evolution of internal documentation for AI tools and models, streamlining knowledge transfer and improving team collaboration."
    }
  ],
  "skills": " **Programming Languages** \n\t Python, TypeScript, JavaScript, C#, Solidity \n\n  **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, .NET, Entity Framework \n\n  **Frontend Frameworks** \n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n  **API Technologies** \n\t RESTful API, GraphQL \n\n  **Serverless and Cloud Functions** \n\t AWS, Azure, GCP \n\n  **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n  **DevOps** \n\t CI/CD pipelines, MLOps \n\n  **Cloud & Infrastructure** \n\t AWS, Azure, GCP \n\n  **Other** \n\t AI, ML, LLM, LangChain, TensorFlow, PyTorch, scikit-learn, ETL, ELT, Airflow, Apache Kafka, RabbitMQ, Redis, collaboration, communication, mentorship, UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "aPriori Technologies"
}