{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Integration Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Integration Engineer with 13+ years of experience in healthcare and financial sectors, specializing in **JavaScript**, **Python**, **Cloud Architecture**, **API**, and **Data Migration**. Proficient in developing robust integrations using **HL7**, **XML**, and **JSON**, and skilled in **MS-SQL** for efficient data management. Demonstrated ability to leverage **Mirth** for seamless middleware solutions. Additionally, experienced in building AI/ML-powered platforms and deploying cloud-native systems on **AWS** and **Azure**.\nBackground in compliance-driven development aligned with HIPAA, FHIR, PCI DSS, and SOC 2 standards, ensuring robust, secure solutions. Adept at understanding complex integration challenges and delivering high-performance applications.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Integration Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **JavaScript** to design and implement integration solutions within healthcare systems, ensuring full compliance with **HL7**, **XML**, and **JSON** standards for data interchange.\nDeveloped middleware solutions for data migration processes using **MS-SQL** and **Flat-File** formats, optimizing data flow across various healthcare applications.\nCollaborated with cross-functional teams to create robust APIs for seamless integration with existing systems, leveraging best practices in **Cloud Architecture** for deployment in cloud environments.\nLed efforts in implementing and maintaining integration patterns using **Mirth** for real-time healthcare messaging, enhancing the interoperability of systems.\nConducted data analysis and validation processes to assure data accuracy and integrity during migrations, significantly reducing errors by **30%** and improving system reliability.\nDeveloped detailed documentation for integration workflows and API endpoints, making onboarding of new team members faster and more efficient by **50%**.\nManaged the deployment of integration solutions with an emphasis on scalability and performance, achieving a response time improvement of **40%** in API performance.\nAutomated testing of integration functionalities using industry-standard testing frameworks, ensuring adherence to quality and compliance requirements across all integrations.\nIntegrated monitoring tools to oversee data quality metrics and integration performance, enabling proactive issue resolution and system uptime of **99.9%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Executed **data migration** strategies involving **XML** and **JSON** formats to seamlessly integrate diverse data sources into financial platforms.\nDesigned and implemented **middleware** solutions for data interchange between systems, leveraging **APIs** for improved interoperability.\nDeveloped scalable financial applications using **Python** and **JavaScript**, maintaining code quality and performance for high-volume transactional environments.\nEnhanced data processing capabilities through effective **cloud architecture** on Azure, ensuring reliable and efficient management of financial data.\nUtilized **MS-SQL** for robust database management, optimizing queries for performance to support application demands.\nCollaborated on technical documentation for system architecture, ensuring clarity and usability for future integrations and modifications.\nLed integration projects utilizing **HL7** protocols for health data exchanges, confirming compliance with industry standards.\nConducted thorough testing to validate the integrity and accuracy of migrated data, resulting in a 99.9% data accuracy rate post-migration.\nImplemented real-time data processing solutions, significantly reducing data latency by **30%** through effective use of asynchronous communication protocols."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **JavaScript** to develop and maintain robust integration solutions, ensuring seamless data flow while adhering to **HL7** and **XML** standards for health information exchange.\nImplemented **Mirth** integration engine for managing data transformation and migration processes, facilitating effective **data migration** from legacy systems to modern applications, and supporting **MS-SQL** and **JSON** formats.\nDesigned and optimized APIs to enable efficient communication between various systems, leveraging **Middleware** technologies to enhance system interoperability and resulting in a **30%** increase in response times for data queries.\nDeveloped comprehensive strategies for **SQL** database management, improving data retrieval efficiency by **25%** through optimized query execution plans and proper indexing techniques.\nEnsured successful cloud architecture deployment to support scalable integration solutions, reducing infrastructure costs by **15%** while maintaining high availability and performance.\nCollaborated with cross-functional teams to integrate front-end applications utilizing **JavaScript** frameworks, enhancing user experience through fast, responsive interfaces.\nEnsured compliance with data standards and regulations by implementing effective data governance practices, safeguarding sensitive health information, and achieving a **100%** success rate in audits for data protection compliance.\nWorked on integration projects involving **Flat-File** processing, enhancing legacy data handling through efficient transformation workflows that reduced processing time by **40%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tMirth, HL7, API, JSON, XML, Flat-File\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, MS-SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Cloud Architecture\n\n **Other:**\n\tData Migration, Middleware, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Diagnexia"
}