{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in **Software Development**, delivering high-performance applications across the healthcare and financial industries. Proficient in **JavaScript**, **Python**, and experienced with **Go**, leveraging skills in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept in AI applications, having built platforms that support predictive analytics and real-time processing.\n\nDemonstrated expertise in code analysis and documentation practices, ensuring code quality and maintainability. Experienced in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and event-driven architectures. Strong advocate for CI/CD practices. Knowledgeable in compliance-driven development, aligning solutions with **HIPAA**, **FHIR**, **PCI DSS**, and **SOC 2** standards. Well-rounded background in MLOps, including model training, serving, and orchestration with **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Leveraged **JavaScript**, **Python**, and **Go** to design and build robust full-stack platforms in healthcare and fintech domains, ensuring compliance with industry standards such as HIPAA and PCI DSS.\n• Developed mobile applications for iOS and Android utilizing **React Native** and **Flutter**, achieving a 30% increase in user engagement through efficient state management and real-time functionality.\n• Created automated CI/CD pipelines for mobile applications using **Fastlane** and **App Center**, improving deployment speed by 50% and enhancing release workflows with in-depth analytics integration via **Firebase Crashlytics**.\n• Spearheaded the migration of legacy systems to microservices architectures using **Docker** and **Kubernetes** (AKS/EKS), resulting in a 40% improvement in system performance and scalability.\n• Managed data infrastructure with **PostgreSQL** and **MongoDB**, facilitating processing for over **1 million** data points daily for real-time analytics use cases in both health and finance sectors.\n• Implemented machine learning solutions for fraud detection and risk scoring using **scikit-learn** and **TensorFlow**, seamlessly integrating predictive models into live systems, reducing fraud incidents by **20%**.\n• Established MLOps practices via **MLflow** and **Airflow**, streamlining the model training and deployment pipeline across **3** different environments, ensuring consistent performance.\n• Developed intuitive dashboards and intelligent features powered by models from **Azure ML** and **AWS Sagemaker**, enhancing decision-making processes in financial operations.\n• Built robust DevOps and continuous integration pipelines with **GitHub Actions** and **Azure DevOps**, incorporating full test automation and security checks that reduced vulnerabilities by **15%**.\n• Created advanced data visualizations with **D3.js** and **Power BI Embedded**, enabling end-users to analyze real-time financial activities and key performance indicators effectively.\n• Collaborated with data science teams on deploying NLP models using **spaCy** for document parsing, ensuring secure REST API integrations for various applications.\n• Defined and enforced rigorous testing strategies across the development cycle using **Jest** and **Cypress**, ensuring code quality and adherence to documentation standards while achieving **95%** test coverage.\n• Integrated search functionality utilizing **Azure Cognitive Search** and **Elasticsearch**, enhancing query performance and flexibility across diverse datasets and improving user experience."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and maintained high-performance applications using **JavaScript** with frameworks such as React (18), Vue 3, and Next.js, ensuring efficient user engagement in financial services.\n• Implemented robust backend solutions with **Python** (FastAPI, Django) and **Go**, leveraging microservices architecture to enhance scalability for systems handling over **100,000** transactions daily.\n• Produced quality documentation and conducted code analysis to maintain best practices in software development, improving overall team productivity by **30%**.\n• Engaged in effective communication with cross-functional teams to gather requirements and deliver software solutions, enhancing collaboration across departments.\n• Designed data pipelines for ETL processes, utilizing **Python**, **Apache Airflow**, and **Azure Data Factory**, leading to a **50%** improvement in data processing speed from third-party sources.\n• Developed machine learning models for AI-driven fraud detection using **scikit-learn** and **XGBoost**, improving fraud detection rates by **25%** based on historical user transaction patterns.\n• Spearheaded the creation of machine learning pipelines for real-time credit scoring and transaction classifications, integrating successfully with model inference into backend services through **MLflow** and **Airflow**.\n• Contributed to the migration of legacy systems to modern cloud-based architectures, enhancing system reliability and maintenance through agile practices."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** frameworks for developing dynamic e-commerce applications, enhancing user experience through optimized UI interactions.\nEmployed **Python** for backend services development, delivering robust and scalable solutions in alignment with best practices for **Software Development**.\nIntegrated **AI** components to enable intelligent features, including personalized recommendations and dynamic pricing strategies.\nMaintained comprehensive documentation for software architecture and codebase, ensuring clarity and effective **Communication** within the team and across departments.\nConducted thorough **Code Analysis** to identify bottlenecks and implement performance enhancements, leading to a **30%** improvement in application speed.\nCollaborated in cross-functional teams, leveraging strong **Communication** skills to align project goals with business objectives and engineer holistic software solutions.\nUtilized team feedback to iterate on functionalities, resulting in a **15%** increase in user retention rates and engagement.\nParticipated in Agile ceremonies, fostering a culture of continuous improvement and responsiveness to change within software development cycles."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, Go, C++, Ruby\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tAI, Software Development, Documentation, Code Analysis, Communication",
  "apply_company": "Stellar AI"
}