{
  "name": "Andrzej Ito",
  "role_name": "Senior Data Architect",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Data Architect with over 9 years of experience, I specialize in **Data Architecture**, **Data Engineering**, and the development of robust **Data Pipelines**, **ETL** and **ELT** processes. I have expertise in using **Cloud Platforms** such as **Azure**, **AWS**, and **GCP**, alongside tools like **Snowflake**, **Databricks**, and **BigQuery** to create scalable solutions and **Data Lakes** and **Data Warehouses** that enhance data accessibility and governance. I am skilled in implementing **AI/ML Techniques** to drive innovation and improve business intelligence. My strengths in leadership and team management allow me to effectively oversee cross-functional teams, mentor junior engineers, and ensure projects align with user experience and performance goals while adhering to privacy regulations and enterprise architecture standards. I am committed to collaboration, agile methodologies, and proactive stakeholder management, enhancing technical excellence in every initiative.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Architect",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Lead the design and implementation of **Data Architecture** for cloud-based services on **AWS** and **Azure**, ensuring robust **ETL** and **ELT** processes for seamless data migration across **Data Lakes** and **Data Warehouses**.\n• Leverage **Machine Learning** techniques to enhance data-driven decision making, implementing AI/ML features in accordance with privacy regulations and data governance policies.\n• Collaborate cross-functionally with stakeholders to develop and maintain **Data Pipelines** and ensure data quality across platforms like **Snowflake**, **Databricks**, and **BigQuery**.\n• Spearhead the adoption of **Agile Methodologies** to efficiently manage project deliverables and enhance team performance, successfully reducing the development cycle by **30%**.\n• Conduct performance management and coaching sessions for team members, improving overall team output by **25%**.\n• Direct the creation and deployment of data solutions using **Cloud Platforms**, focusing on scalability and compliance with enterprise architecture standards.\n• Oversee complex integrations involving relational databases such as **Oracle**, **MySQL**, **MS SQL**, and **PostgreSQL**, ensuring optimal performance and reliability.\n• Enhance collaboration practices by facilitating regular stand-ups and retrospectives, reinforcing effective communication among team members and stakeholders."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Designed and developed **Data Pipelines** to efficiently manage and process large datasets across **Cloud Platforms** including **Azure**, **AWS**, and **GCP**.\n• Implemented **ETL/ELT processes** for **Data Lakes** and **Data Warehouses** ensuring seamless data integration and accessibility.\n• Led the architectural design for large-scale data solutions employing **Snowflake** and **Databricks**, achieving data retrieval speeds of up to **100x** compared to traditional methods.\n• Managed **Data Governance** initiatives to ensure compliance with **Privacy Regulations**, enhancing data security and quality across systems.\n• Headed cross-functional team collaboration by enforcing **Agile Methodologies**, resulting in a **30%** increase in project delivery timelines.\n• Mentored junior team members in **Machine Learning** techniques and principles, fostering a culture of continuous improvement and innovation.\n• Facilitated stakeholder management meetings to communicate architectural plans and project updates, achieving a **95%** satisfaction rating from business units.\n• Spearheaded the implementation of Business Intelligence tools that provided actionable insights, enhancing decision-making processes for **multiple stakeholders**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Designed and implemented Data Pipelines leveraging **AWS, Azure**, and **GCP** to enhance data architecture efficiency by **30%**.\n• Developed and managed ETL processes to support Data Warehouses and Data Lakes, ensuring data integrity and governance in compliance with privacy regulations.\n• Collaborated with cross-functional teams to optimize data workflows and integrate machine learning models using **Databricks** and **Snowflake**.\n• Provided technical leadership in adopting Agile methodologies, resulting in a **20%** improvement in project delivery timelines.\n• Conducted performance management and coaching for team members to bolster skills in data engineering and architecture.\n• Communicated data strategies effectively to stakeholders, contributing to a **15%** increase in stakeholder engagement in data-driven decisions.\n• Refined enterprise architecture principles to support generative AI and business intelligence initiatives, improving analytical capabilities across the organization."
    }
  ],
  "skills": "Programming Languages:\n\t**Java, C++, C#, Python, SQL, PLSQL, Kotlin**\n\nBackend Frameworks:\n\t**Spring, Spring Boot, Hibernate, Struts, JPA, Node.js**\n\nFrontend Frameworks:\n\t**React, Vue, Angular**\n\nAPI Technologies:\n\t**SOAP, REST APIs, Microservices**\n\nCloud & Infrastructure:\n\t**Azure, AWS, GCP, Cloud Platforms, Data Lakes, Data Warehouses, Snowflake, Databricks, BigQuery**\n\nDatabases:\n\t**MS SQL Server, Oracle, MongoDB, Rabbit MQ, PostgreSQL, Redis**\n\nOther:\n\t**Data Architecture, Data Engineering, ETL, ELT, Data Pipelines, AI/ML Techniques, Data Governance, Privacy Regulations, Enterprise Architecture, Leadership, Team Management, Performance Management, Coaching, Communication, Stakeholder Management, Agile Methodologies, Collaboration, Cross-functional Teamwork, Machine Learning, Generative AI, Business Intelligence, SOLID, DRY, LINQ**"
}