{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Web Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Senior Web Frontend Engineer with 8 years of full stack development experience, specializing in **React.js**, **TypeScript**, and **MobX**. Adept at optimizing frontend performance and implementing AI-based tooling solutions to enhance user experiences. Skilled in fostering collaboration across teams, exhibiting strong communication skills, and driving autonomous project execution with a pragmatic approach, resulting in accelerated iteration speed in development cycles. I leverage my deep understanding of full stack technologies, including **Node.js**, **FastAPI**, **Django**, and cloud services like **Azure** and **AWS**, to deliver scalable and secure applications. Experienced in building enterprise-grade platforms with a focus on modern design principles and emerging technologies like AI/ML, ensuring compliance with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React.js** and **TypeScript** to develop scalable, high-performance frontend solutions for healthcare and financial platforms, ensuring optimal frontend performance and seamless user experience.\nCollaborated with cross-functional teams to enhance mobile applications using **MobX** for state management, delivering iterative updates and maintaining high engagement across both iOS and Android platforms.\nImplemented agile methodologies to drive iteration speed, ensuring efficient development cycles and timely feature releases while maintaining quality standards.\nDesigned and executed performance optimization strategies for frontend applications, resulting in a **30%** increase in load times and user interactions.\nIntegrated AI-based tooling features into web applications, providing dynamic dashboards and personalized recommendations, while enhancing communication and collaboration among team members.\nEstablished effective communication channels to share project updates and gather feedback, fostering an environment of transparency and teamwork.\nDrove autonomy in the development process, leading initiatives to develop modular components and reusable libraries for future projects, reducing time-to-market by **25%**.\nRegularly participated in code reviews and design discussions to ensure the high quality of deliverables and adherence to best practices in frontend development.\nMentored junior developers on using **React.js** and **TypeScript**, promoting knowledge sharing and skills enhancement within the team.\nProduced comprehensive documentation and guides for frontend best practices, streamlining onboarding processes and maintaining project coherence."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic and high-performance front-end applications using **React (18)** and **TypeScript**, ensuring optimized performance and responsiveness for user interfaces in financial dashboards and admin portals.\n• Leveraged state management with **MobX** to enhance application efficiency and maintainability, contributing to a **50%** reduction in load times and improved user satisfaction.\n• Focused on frontend performance optimization techniques, enhancing rendering times by up to **30%**, ensuring smooth user experiences aligned with financial platforms.\n• Collaborated effectively with cross-functional teams to align on project goals and deliver high-quality code, communicating updates and challenges to stakeholders.\n• Employed an iterative development approach to continuously refine and improve user interfaces based on user feedback and testing, leading to a **20%** increase in user engagement.\n• Implemented AI-based tooling in front-end applications to improve user interaction and experience, enhancing the overall functionality of financial applications.\n• Demonstrated autonomy in leading frontend development tasks while pragmatically addressing challenges and adapting solutions as required, significantly improving project delivery timelines.\n• Actively participated in team discussions, bringing innovative ideas that contributed to the overall success of the frontend team and project.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed high-performance frontend applications using **React.js** (version **18**), **TypeScript**, and **MobX**, ensuring optimal user experiences through continuous performance optimization.\n• Collaborated with cross-functional teams to implement AI-based tooling for enhancing product recommendations, improving user engagement by **25%**.\n• Communicated effectively with stakeholders to gather requirements and iterate on user interface designs, reducing project turnaround time by **30%**.\n• Delivered responsive, user-friendly web interfaces optimized for performance, adhering to best practices in frontend performance optimization.\n• Demonstrated autonomy in completing tasks and driving projects forward, while showing pragmatism in addressing real-world challenges and leveraging existing solutions.\n• Ensured effective collaboration within the team, leveraging agile methodologies to maximize iteration speed and maintain a high-quality product delivery.\n• Maintained coding standards and best practices within the **React.js** ecosystem, contributing to enhanced code maintainability and scalability.\n• Implemented accessibility standards (WCAG 2.1) to improve user experience across all devices, ensuring compliance and inclusivity in web applications."
    }
  ],
  "skills": "**Frontend Frameworks**:\n\tReact.js, JavaScript/TypeScript (React, Vue, Angular), MobX, Frontend Performance Optimization\n\n**Artificial Intelligence & Machine Learning**:\n\tMLflow, Airflow, Kubeflow, AI-based Tooling\n\n**Backend Frameworks**:\n\tPython (FastAPI, Flask, Django)\n\n**DevOps & Cloud**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**API Technologies**:\n\tNginx, JWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Cloud & Infrastructure**:\n\tAWS, Azure, Terraform, Ansible\n\n**Other**:\n\tCollaboration, Communication Skills, Autonomy, Pragmatism, Iteration Speed"
}