{
  "name": "Patryk Zaslawski",
  "role_name": "Senior DevOps Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Results-driven Senior DevOps Engineer with 8+ years in software engineering, specializing in cloud infrastructure and automation solutions. Proficient in **Docker**, **Kubernetes**, **Terraform**, **Ansible**, and **AWS**, I design and implement scalable and secure systems that enhance operational efficiency. Experienced with **AzureDevOps** for seamless CI/CD pipelines, I leverage **Linux** and **Windows** systems to optimize deployments and system performance. My technical background includes **Python** programming for scripting and automation, as well as proficiency in **Bash** and **PowerShell** for task automation. I also have skills in monitoring tools such as **Prometheus**, **Grafana**, and **Elastic Stack**, ensuring robust system performance and reliability. A strong collaborator, I excel in delivering enterprise-grade solutions aligned with best practices and industry standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Designed and implemented CI/CD pipelines for **Python** microservices using **Azure DevOps** and **GitHub Actions**, ensuring automated builds, security scans, and **multi-environment** releases.\n- Championed **DevOps** automation for **Python**-based systems, provisioning infrastructure with **Terraform**, **Helm**, and **Kubernetes**, significantly reducing deployment times by **30%**.\n- Spearheaded the migration to **Docker** and **Kubernetes** (AKS/EKS), enhancing scalability and resilience by achieving **99.9%** uptime.\n- Integrated and maintained observability in **Python** services using **Prometheus**, **Grafana**, and the **Elastic Stack**, allowing real-time monitoring and proactive issue resolution to enhance system performance by **25%**.\n- Implemented secure application architectures with **Bash** and **PowerShell** scripts for automated server management on both **Linux** and **Windows** environments.\n- Mentored a team of 10+ engineers in **Python**, **DevOps** practices, and **Kubernetes** patterns, fostering a culture of continuous improvement and high-performance delivery.\n- Enhanced operational insights through integrated logging frameworks with **Grafana** and **Power BI**, improving compliance reporting accuracy by **40%**.\n- Managed cloud resources on **AWS** and **Azure**, optimizing cost and scalability through intelligent workload distribution, achieving a cost reduction of **15%**.\n- Leveraged **Ansible** for configuration management to ensure consistency across environments, thereby minimizing configuration drift across **Dev** and **Prod**.\n- Developed and implemented resource monitoring and alerting strategies using **Prometheus** and **Grafana**, reducing incident response times by over **50%**.\n- Oversaw the deployment of containerized applications, managing clusters for **Kubernetes** and ensuring high availability and low latency for mission-critical applications.\n- Applied agile methodologies to foster team collaboration and efficiency in delivering **DevOps** solutions, continuously iterating based on feedback and performance metrics.\n- Collaborated with cross-functional teams to integrate **Python** services with third-party APIs and cloud platforms, ensuring seamless deployment and scaling of applications."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Implemented and managed container orchestration with **Kubernetes** for deploying Python microservices, ensuring high availability and enabling rolling updates.\nUtilized **Docker** to containerize applications, enhancing the deployment process and maintaining consistent environments across development and production.\nAutomated infrastructure provisioning and management utilizing **Terraform** to streamline setup procedures and enforce infrastructure as code across cloud services.\nConfigured and managed CI/CD pipelines using **Azure DevOps** and **GitHub Actions**, incorporating automated testing to ensure quality and enhance the deployment speed by **30%**.\nDeveloped and maintained configuration management scripts with **Ansible**, improving infrastructure consistency and reducing configuration drift for **Linux** and **Windows** servers.\nMonitored system performance and health using **Prometheus** and **Grafana**, resulting in a **40%** increase in incident response times through proactive monitoring.\nIntegrated logging and monitoring solutions with the **Elastic Stack** (**Elasticsearch, Logstash, Kibana**) to centralize visibility into application performance and system logs.\nDesigned automated backup and recovery procedures for critical services utilizing **AWS** and **Azure**, ensuring data protection and compliance with regulatory standards.\nExecuted security best practices in deployment processes, implementing **RBAC**, encryption, and secure access protocols to safeguard sensitive data within cloud environments.\nDeveloped shell scripts using **Bash** and **PowerShell** for automation tasks, enhancing operational efficiency and reducing manual workloads by **25%**.\nContributed to the operational stability of systems through continuous performance tuning and optimization, achieving an uptime improvement of **99.9%**.\nCollaborated with development teams to adopt a DevOps culture, focusing on seamless integration of tools and processes for enhanced collaboration and efficiency in software delivery.\nManaged performance and resource allocation on cloud platforms ensuring optimal utilization and cost management across deployed resources."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented **Docker** containerization for deploying Python applications, ensuring consistent environments and streamlining operations across **AWS** and **AzureDevOps** by utilizing CI/CD principles.\nManaged Kubernetes clusters to orchestrate container deployments, enhancing application scalability and reliability in multi-cloud ecosystems.\nAutomated infrastructure provisioning using **Terraform**, ensuring quick deployment and reducing manual configuration errors by **30%**.\nConfigured and maintained monitoring and logging solutions using **Prometheus**, **Grafana**, and **Elastic Stack** to provide actionable insights and alerting for system performance.\nDeveloped Bash and PowerShell scripts for automating system tasks and processes, achieving a **40%** improvement in workflow efficiency.\nUtilized **Ansible** for configuration management to ensure consistent application environment setups across Linux and Windows servers.\nConducted system performance evaluations and troubleshooting, decreasing system downtime by **25%** through proactive monitoring and incident response.\nCollaborated with development teams to enable a shift-left approach for DevOps practices, integrating testing into the deployment pipelines and boosting code quality.\nEnsured cloud security by implementing best practices and tools for securing **AWS** and **Azure** resources, improving vulnerability management processes.\nParticipated in the continuous improvement of deployment processes and protocols, enhancing team efficiency by streamlining workflows by **20%**.\nMentored junior team members on best practices for using **Docker**, orchestration tools, and securing application environments."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Bash, PowerShell\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, AWS (ECS, RDS, S3), AzureDevOps\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Helm, Prometheus, Grafana, Elastic Stack, Splunk",
  "apply_company": "Qualitest Group"
}