{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Tech Lead - Backend, Frontend & Beyond",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Proficient in **backend development** and **frontend development**, I am a seasoned Full Stack Developer with 8 years of experience specializing in the creation and coordination of high-performance solutions in the healthcare and financial sectors. I possess a strong grasp of **authorization systems** including **RBAC**, **ABAC**, and **ReBAC**, ensuring seamless access control across applications. My technical expertise extends to building robust internal tooling and improving workflows, complemented by a solid foundation in system documentation and infrastructure scaling.\n\nWith proficiency in a modern tech stack featuring **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, **Django**, and deep cloud knowledge across **Azure** and **AWS**, I have successfully led the development of enterprise-grade platforms that leverage AI/ML for analytics and automation. My experience in **microservices architecture**, event-driven systems, and **CI/CD** automation empowers me to build secure applications compliant with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Additionally, I have practical experience developing machine learning pipelines and implementing MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**, all while maintaining effective communication and proactive organization for successful project outcomes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Tech Lead - Backend, Frontend & Beyond",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Led technical project coordination efforts to architect and develop robust authorization systems (RBAC, ABAC, ReBAC) across scalable healthcare and financial platforms, enhancing access control and security.\n• Spearheaded backend development initiatives using **Python (FastAPI)** and **Node.js**, ensuring compliance with regulations such as HIPAA, FHIR, GDPR, and PCI DSS, resulting in a **30%** improvement in regulatory adherence.\n• Facilitated frontend development using modern frameworks like **React (17-18)** and **Vue (3.x)**, contributing to a user retention increase of **25%** through enhanced user experience and intuitive interfaces.\n• Developed internal tooling solutions and implemented workflow improvement strategies through **technical documentation** that streamlined operations and decreased project overhead by **15%**.\n• Oversaw infrastructure scaling procedures, leveraging **Docker** and **Kubernetes (AKS/EKS)**, resulting in a **50%** increase in deployment efficiency and system responsiveness.\n• Fostered effective communication among cross-functional teams to align project objectives and ensure successful execution of development tasks.\n• Implemented proactive organization techniques to enhance team productivity, maintaining autonomy in overseeing project timelines and deliverables efficiently.\n• Demonstrated exceptional skills in cloud-native database management with **PostgreSQL** and **MongoDB**, supporting large-scale healthcare data ingestion.\n• Optimized performance and reliability of digital applications through hands-on involvement in both backend and frontend code reviews.\n• Championed the development of CI/CD pipelines using **GitHub Actions** and **Azure DevOps**, resulting in a **40%** reduction in deployment times across diverse environments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Focused on **backend development** and **frontend development** through leading modernization initiatives and effectively coordinating technical projects.\n\n- Spearheaded the implementation of **authorization systems**, enhancing system security and access controls using **RBAC** and **ABAC** across financial platforms, impacting over **1M** users.\n- Led efforts to improve workflow efficiency and **internal tooling** in development processes, resulting in a **25%** reduction in project turnaround times.\n- Established robust **infrastructure scaling** mechanisms within microservices architecture, overseeing the deployment of services with a cloud support capacity of **2000+** concurrent transactions.\n- Developed comprehensive system documentation, ensuring project knowledge transfer and streamlining onboarding processes for new team members, increasing team autonomy by **30%**.\n- Continuously improved team communication strategies, fostering an environment that encouraged proactive organization and collaboration across multiple tech stacks including **Node.js**, **Python**, **React**, and **TypeScript**.\n- Engaged in hands-on **frontend development**, utilizing **React (18)** and **Vue 3** to create user-centric interfaces for financial applications, leading to a user satisfaction rate increase of **15%** in feedback surveys.\n- Provided mentorship and guidance to junior developers, fostering an atmosphere of continuous learning and improvement in both **backend** and **frontend** technologies."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Demonstrated effective communication and proactive organization in leading technical project coordination for backend and frontend development teams, ensuring streamlined workflows and timely deliverables.\nLeveraged **RBAC** for implementing secure authorization systems, ensuring compliance with GDPR and enhancing user data protection across the platform.\nDesigned and developed backend services using **Python** (FastAPI, Django) and **Node.js** (NestJS, Express), optimizing for high availability and scalability across **9** key e-commerce modules including checkout and order fulfillment.\nEngineered and integrated frontend applications with **React** (18), **Vue 3**, and **Angular** using **TypeScript** and **Redux Toolkit**, delivering a fast, responsive user experience with an optimization focus for mobile access.\nImplemented advanced **infrastructure scaling** practices through caching strategies using **Redis**, significantly boosting application responsiveness and managing high traffic of **100K** concurrent users effectively.\nSpearheaded the development of **real-time features** utilizing **WebSockets**, along with event-driven architecture supported by **Kafka** and **RabbitMQ**, enhancing order updates and real-time customer interaction.\nIntegrated advanced machine learning algorithms leveraging **scikit-learn**, **LightGBM**, and **TensorFlow** to improve product recommendations and optimize search relevance, resulting in a **15%** increase in conversion rates.\nExecuted feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes**, facilitating controlled rollouts and risk mitigation during major platform updates, improving deployment efficiency by **25%**.\nCrafted responsive and SEO-friendly user interfaces utilizing **Next.js**, **Vue 3** + **Nuxt**, and standard **HTML5/CSS3**, ensuring compliance with accessibility standards (WCAG 2.1) and enhancing mobile-first engagement.\nDeveloped secure payment workflows with **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI compliance for sensitive data handling within a secure transaction framework.\nCreated robust system documentation and internal tooling that aided the workflow improvement, leading to reduced onboarding time for new developers and increasing overall team productivity."
    }
  ],
  "skills": "**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Cloud & Infrastructure:**\n\tNginx, Certbot\n\n**Other:**\n\tABAC, ReBAC, authorization systems, backend development, frontend development, technical project coordination, internal tooling, workflow improvement, system documentation, infrastructure scaling, effective communication, proactive organization, autonomy"
}