{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Full Stack Engineer with 8 years of experience, I specialize in high-performance web applications utilizing **React**, **TypeScript**, **Node.js**, and **Express**. My technical expertise encompasses front-end development with modern libraries like **Redux** and hooks, alongside backend technologies such as **PostgreSQL** and **MongoDB**. Proficient in designing and implementing **REST** and **GraphQL** APIs, I ensure application performance and security requirements are met, leveraging **CI/CD** best practices for streamlined deployment. \n\nI possess strong problem-solving skills and a collaborative approach, consistently striving for excellence in code quality and user experience. My background includes building responsive solutions compliant with security standards, demonstrating a profound understanding of performance metrics using tools like **Lighthouse** and **Axe**. With hands-on experience in **Python** and working in cloud environments like **AWS**, I am adept at tackling complex challenges in software development while maintaining a focus on user-centered design and delivery.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable web applications using **React** (17-18), **TypeScript**, **Node.js**, and **Express**, ensuring performance optimization and security standards compliance.\n• Created API services with **REST** and **GraphQL**, leveraging **PostgreSQL** and **MongoDB** for efficient data retrieval and storage, managing over **1M** records.\n• Implemented state management strategies using **Redux** and **Hooks**, enhancing application scalability and responsiveness for end-users.\n• Designed and executed CI/CD pipelines, utilizing **Firebase** for application performance monitoring and automated testing, achieving deployment frequency increase by **30%**.\n• Engaged in performance audits with tools like **Lighthouse** and **Axe**, resolving issues that improved website load speed by **40%**.\n• Collaborated cross-functionally with product teams to solve complex problems, employing a mix of analytical and creative approaches to drive user engagement.\n• Ensured code quality and security through meticulous code reviews and integration of security practices across all development stages.\n• Employed **Python** for backend services, implementing AI-driven features and machine learning models for enhanced functionality and data processing.\n• Contributed to responsive design implementations, ensuring cross-browser compatibility and usability across devices, meeting user needs effectively.\n• Actively participated in team collaboration and stand-up meetings, fostering a culture of open communication and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Designed and implemented scalable, high-performance full-stack solutions utilizing **React (18)**, **TypeScript**, and **Redux Toolkit** to deliver responsive web applications with a focus on usability and performance metrics above **95%** in Lighthouse scores.\n• Developed backend services using **Node.js** and **Express** to establish robust RESTful APIs, improving response times by **30%** through optimized query handling and integration with **PostgreSQL** and **MongoDB** databases.\n• Collaborated effectively with cross-functional teams to deliver features on time, fostering a culture of **collaboration** and **problem-solving** that resulted in a **25%** increase in project delivery speed.\n• Led the migration of legacy systems to a microservices architecture using **Python (FastAPI, Django)**, enhancing maintainability and scalability for applications handling over **1 million** transactions monthly.\n• Implemented comprehensive performance and security measures ensuring compliance with industry standards, leading to a **40%** reduction in security vulnerabilities found during audits.\n• Utilized **CI/CD** pipelines for continuous integration and seamless deployment, decreasing deployment time by **50%**.\n• Engaged in real-time application monitoring and enhancement using **Hooks**, ensuring a smooth user experience across various devices and platforms.\n• Applied advanced frontend technologies, such as **HTML**, **CSS**, and responsive design principles, to develop visually appealing and accessible interfaces that met **AA** accessibility standards as per **Axe** audits."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Engineering frontend applications using **React (18)**, **TypeScript**, and **Redux**, ensuring responsive user experiences across mobile and web platforms while implementing **Hooks** for better state management.\n• Designing and optimizing backend services with **Node.js (Express)** and **Python** frameworks, focusing on **REST** and **GraphQL** APIs for efficient data handling and integration.\n• Leveraging **PostgreSQL** and **MongoDB** for robust and scalable database solutions, achieving **99.9%** uptime in high-traffic e-commerce environments and ensuring data integrity.\n• Implementing CI/CD strategies for streamlined deployment processes, reducing deployment times by **30%** and increasing operational efficiency through automated testing and integration.\n• Focusing on application performance and security, running **Lighthouse** audits ensuring performance scores above **90** and complying with security best practices to mitigate vulnerabilities.\n• Collaborating effectively within cross-functional teams to solve complex problems and drive project success, achieving project deadlines with a **95%** on-time delivery rate.\n• Designing responsive web interfaces using **HTML5**, **CSS3**, and frameworks for accessibility compliance (WCAG 2.1), aiming to enhance user engagement and meet diverse user needs.\n• Conducting thorough code reviews and troubleshooting to maintain high code quality and foster a culture of collaboration and continuous learning among peers.\n• Utilizing cloud technologies like **AWS** and **Firebase** for scalable application solutions, improving system resilience and reducing data access times by **40%**.\n• Enhancing the user experience through data-driven insights and performance modifications, including the application of **CI/CD** practices for frequent, reliable releases."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Redux, Hooks, Vue, Angular, HTML, CSS\n\n **Backend Frameworks:**\n\tNode.js, FastAPI, Flask, Django, Express\n\n **API Technologies:**\n\tREST, GraphQL\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Firebase\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD, Performance, Security, Responsive, Collaboration, Problem-solving, Lighthouse, Axe",
  "apply_company": "AccessiWay"
}