{
  "name": "Tomasz Lee",
  "role_name": "Senior IoT Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior IoT Engineer with 9+ years of extensive experience in developing and implementing IoT solutions leveraging **Rust**, **C++**, **Java**, **Kotlin**, and real-time communication protocols such as **MQTT** and **Modbus**. Proficient in utilizing cloud services including **AWS IoT**, **Azure IoT**, and **GCP IoT Core** to build scalable and secure applications. Expertise in containerization and orchestration technologies like **Docker** and **Kubernetes**, along with CI/CD workflows for efficient development. Strong background in distributed systems, particularly with **Apache Kafka** and **Pulsar** for data streaming and real-time control applications. Exceptional problem-solving abilities complemented by analytical thinking, collaboration skills, and effective communication to lead cross-functional teams and deliver high-quality solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior IoT Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **AWS IoT** and **Azure IoT** services to develop and deploy IoT applications, enhancing cloud connectivity and reliability.\nSpearheaded the design and implementation of a microservices architecture using **Docker** and **Kubernetes**, allowing modular development and reducing deployment time by **40%**.\nIntegrated **Kafka** for real-time data streaming and **Pulsar** for managing data flow between devices, significantly improving system resilience and throughput.\nLeveraged **React** and **TypeScript** to create an intuitive web interface for IoT devices, leading to a **25%** increase in user satisfaction.\nDeveloped secure communication protocols using **MQTT** and **Modbus**, ensuring data integrity and encryption within IoT devices.\nImplemented CI/CD pipelines with **Azure DevOps**, which expedited deployment processes and minimized downtime.\nOptimized device communication by reducing average query execution time by **20%** using efficient **MSSQL** database queries and indexing techniques.\nCollaborated effectively with cross-functional teams, enhancing communication and fortifying problem-solving efforts within IoT projects.\nDesigned a robust reporting engine with **D3.js** for real-time analytics and device performance monitoring.\nDeveloped authentication and authorization mechanisms using JWT, ensuring secure device interactions and data protection."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **AWS IoT** and **Azure IoT** for developing scalable, cloud-based IoT solutions, achieving a latency reduction of 30% in device communication.\nDesigned and implemented a microservices architecture utilizing **RabbitMQ** for real-time data processing and **Kafka** for high-throughput messaging, enhancing system reliability.\nDeveloped responsive user interfaces using **React** and **TypeScript**, leading to a 25% increase in user satisfaction ratings from client feedback.\nImplemented **CI/CD** pipelines with **Docker** and **Kubernetes** to streamline deployment processes, resulting in a 40% faster time to market for new features.\nConducted rigorous testing and debugging, utilizing **rust** and **C++** to ensure system stability and performance under load, critical for **real-time control** applications.\nOptimized data encryption methods and authentication protocols to safeguard user data and ensure compliance with industry standards, improving security posture by 20%.\nMentored junior developers in **Problem Solving** and **Analytical Thinking** techniques, successfully boosting team performance metrics by 15%.\nCollaborated with cross-functional teams to refine project requirements and delivery timelines, ensuring alignment with overall project goals and facilitating smoother workflows.\nHands-on experience with **Modbus** and **MQTT** protocols for seamless device integration and communication across various platforms.\nCreated dashboards with real-time status tracking functionality using **Kafka** and visualization tools, enhancing project transparency for stakeholders."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Designed and implemented **Cloud**-based IoT solutions using **AWS IoT** and **Azure IoT**, resulting in a **30%** reduction in device connectivity issues.\n• Developed robust applications using **React**, **TypeScript**, and **Rust** to support real-time data processing and visualization, enhancing user engagement by **40%**.\n• Integrated **MQTT** and **Modbus** protocols for efficient data transmission among IoT devices, leading to improved operational reliability.\n• Collaborated with cross-functional teams to design and deploy containerized applications using **Docker** and **Kubernetes**, streamlining the deployment process by **25%**.\n• Leveraged **CI/CD** pipelines to automate testing and deployment, increasing the release frequency to **bi-weekly** updates while maintaining high code quality.\n• Conducted thorough analyses and optimizations of existing systems, employing **C++** and **Java** for performance improvements, ultimately enhancing processing speed by **15%**.\n• Engaged in continuous problem-solving and analytical thinking to identify and mitigate potential security vulnerabilities, implementing data encryption and authentication measures.\n• Communicated effectively with stakeholders to gather requirements and provide updates, ensuring alignment with project objectives and timelines.\n• Provided mentorship to junior engineers, fostering a collaborative environment that encourages knowledge sharing and technical growth."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, C++, Rust, Kotlin, Python, JavaScript, TypeScript, ReactJS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReact, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL, MQTT, Modbus\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, AWS IoT, Azure IoT, GCP IoT Core, Cloud\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tDocker, Kubernetes, CI/CD, Apache Kafka, RabbitMQ, Pulsar, Redis\n\n**Cloud & Infrastructure**\n\tAWS, Azure, CI/CD pipelines\n\n**Other**\n\tUX/UI Design, Git, GitHub, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Data Encryption, Authentication, Real-time Control, Problem Solving, Analytical Thinking, Collaboration, Communication",
  "apply_company": "Sympower"
}