{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Flutter Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Flutter Engineer with 13+ years of experience in developing high-performance applications, specializing in **Flutter**, **Dart**, and **Cross-platform Development**. Expert in implementing **BLoC**, **Cubits**, and **Clean Architecture** to create scalable and maintainable solutions while ensuring seamless user experiences. Strong proficiency in designing **RESTful APIs** and utilizing **Git** for version control, with a proven track record in **Debugging** and **Performance Optimization** to enhance application efficiency.\n\nAdept at collaborating with cross-functional teams, fostering effective **Teamwork** and **Communication** to drive project success. In addition to strengths in application development, I bring hands-on experience in building AI/ML-powered platforms and deploying cloud-native systems on **AWS** and **Azure**, ensuring compliance with regulatory standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Flutter Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Flutter** and **Dart** to design and develop high-performance, cross-platform mobile applications for iOS and Android, implementing **BLoC** and **Cubits** architecture principles to ensure a clean, maintainable codebase.\nCollaborated with cross-functional teams to establish effective **RESTful APIs** for seamless integration with backend services, improving data fetch speed by **30%**.\nEmployed **Clean Architecture** and **Atomic Design** methodologies to enhance UI consistency and user experience, achieving a **25%** reduction in UI defects.\nLed debugging sessions and performance optimization initiatives, identifying and resolving key bottlenecks, resulting in a **40%** improvement in application load times.\nImplemented complex navigation solutions using **Navigator** and **GoRouter** for efficient state management and user experience, ensuring intuitive app flows.\nIncorporated automated unit testing with **Mocktail** to ensure code reliability and maintainability, achieving a **90%** code coverage in critical modules.\nActively participated in team collaboration and communication, fostering a culture of sharing best practices and innovative ideas for continuous improvement.\nMentored junior developers on best practices in **Flutter** development, enhancing team skill set and productivity through knowledge sharing sessions."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and developed cross-platform applications using **Flutter** and **Dart**, ensuring adherence to **Clean Architecture** principles and **Atomic Design** methodologies to create maintainable and scalable code.\nUtilized **BLoC** and **Cubits** for state management, facilitating separation of business logic from UI, which improved the modularity and testability of applications.\nImplemented **RESTful APIs** for seamless integration with back-end services, ensuring efficient data retrieval and management through optimized calls and error handling, while maintaining robust performance.\nCollaborated with cross-functional teams to enhance user interfaces and experiences, making use of tools like **Mocktail** for effective unit testing and debugging processes, which increased code reliability by **30%**.\nUtilized version control with **Git** to manage project repositories, allowing for smooth collaboration across teams and maintaining a clear history of changes and product iterations.\nExecuted performance optimization strategies, achieving a reduction in load times by **25%** through effective coding practices and resource management.\nConducted regular team meetings to discuss project progress, brainstorm solutions, and enhance communication across teams, fostering a collaborative work environment that increased project delivery speed by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed cross-platform mobile applications using **Flutter (2.5)** and **Dart (2.14)**, ensuring high performance and responsiveness through effective use of **BLoC** and **Cubits** state management.\nImplemented clean architecture principles to structure projects, enabling maintainable and scalable codebases aligned with **Atomic Design** methodology for consistent UI components.\nUtilized **GoRouter** for efficient navigation and routing, streamlining user experience across complex application flows.\nCreated and consumed **RESTful APIs** to facilitate seamless communication with backend services, improving application performance and reliability.\nLeveraged **Mocktail** for unit testing, ensuring robust application features with high code coverage and efficient debugging processes.\nParticipated in code reviews and integrated version control practices using **Git** to maintain code quality and facilitate collaborative development.\nApplied performance optimization techniques to enhance application loading times by **30%**, resulting in improved user satisfaction and engagement metrics.\nCollaborated with cross-functional teams, enhancing communication and teamwork competencies to deliver high-quality solutions under tight deadlines.\nEngaged in debugging activities to swiftly identify and resolve critical issues, minimizing downtime and ensuring a smooth user experience.\nPromoted best practices in code documentation and project management, contributing to an organized workflow and expediting the onboarding process for new team members."
    }
  ],
  "skills": "**Programming Languages:**\n\tDart, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tFlutter, React, Vue, Angular\n\n**API Technologies:**\n\tRESTful APIs, Keycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tBLoC, Cubits, Clean Architecture, Atomic Design, Navigator, GoRouter, Mocktail, Debugging, Performance Optimization, Cross-platform Development, Teamwork, Communication",
  "apply_company": "It's Prodigy"
}