{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Desktop Applications Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Desktop Applications Developer skilled in **C++**, **Qt**, **QML**, and Test-Driven Development (TDD) with 13+ years of experience delivering high-performance applications across various industries, including healthcare and finance. Proficient in modern development methodologies including Agile, Scrum, and Kanban, deploying best practices to ensure scalable and efficient software solutions. Highly capable in implementing Design Patterns such as MVC, MVVM, and MVP, focusing on creating maintainable and robust code. Experience in automated testing and ensuring thread-safe code for seamless performance. Additional strengths include strong communication skills and proficient problem-solving abilities. Familiar with **Python**, **Bash**, **Ruby**, and **Powershell** for backend solutions and scripting, ensuring comprehensive software security and effective IP networking.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Desktop Applications Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **Test-Driven Development (TDD)** principles to deliver high-quality desktop applications using **C++**, **Qt**, and **QML**, ensuring robust software architecture and performance.\nApplied **Design Patterns** including **MVC**, **MVVM**, and **MVP** to enhance code maintainability and scalability in large-scale application development.\nEmployed **Agile** methodologies, including **Scrum** and **Kanban**, to foster a collaborative team environment, achieving a **30%** improvement in project delivery timelines.\nDeveloped **thread-safe code** to ensure application stability and performance under concurrent user access scenarios, using **C++** best practices.\nDesigned and executed **automated testing** frameworks to verify application functionality, resulting in a **25%** reduction in post-deployment bugs.\nUtilized advanced **IP networking** techniques to enhance application communication and data exchange reliability.\nCollaborated with cross-functional teams to identify and resolve software security vulnerabilities, implementing resulting solutions utilizing **Python** and **Ruby** as necessary.\nWrote **Bash** scripts for utility and maintenance tasks, enhancing developer productivity and integration workflows.\nMaintained clear communication with stakeholders to gather requirements and feedback, ensuring alignment throughout development phases.\nApplied effective **problem-solving** methodologies to debug and troubleshoot complex issues, maintaining high user satisfaction rates."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Employed **Test-Driven Development (TDD)** to ensure the reliability and maintainability of desktop applications, enhancing code quality and reducing bugs by 30%.\n- Applied **Design Patterns** such as MVC, MVVM, and MVP to structure applications efficiently, improving development speed by 25%.\n- Developed and maintained robust desktop applications using **C++**, **Qt**, and **QML**, delivering user-friendly interfaces and seamless performance.\n- Collaborated in **Agile**, **Scrum**, and **Kanban** environments, facilitating sprint planning and retrospectives to boost team productivity by 15%.\n- Implemented **Automated Testing** frameworks to streamline the testing process, increasing test coverage to 85% and ensuring high software quality.\n- Wrote **Thread Safe Code** to manage concurrent operations effectively, preventing race conditions and deadlocks in multitasking environments.\n- Leveraged **Python** and **Bash** for scripting and automation tasks, accelerating deployment processes by 40%.\n- Demonstrated strong **Communication Skills** in cross-functional teams to clarify project requirements and gather feedback efficiently.\n- Resolved complex technical issues through effective **Problem Solving** techniques, reducing incident response time by 20%.\n- Ensured compliance with **Network Security** and **Software Security** best practices, maintaining application integrity and user data protection."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C++** and **Qt** to design and develop robust desktop applications with a focus on **Test-Driven Development (TDD)** and **Design Patterns** ensuring high-quality code and maintainability.\nImplemented **MVVM** and **MVP** architectural patterns to create scalable and organized systems, enhancing team collaboration through **Agile** methodologies, including **Scrum** and **Kanban**.\nDeveloped automated testing frameworks to streamline quality assurance processes, achieving a **30% reduction** in post-deployment issues via consistent and thorough testing practices.\nCreated thread-safe code to ensure stability and security, facilitating smoother user experiences and reducing application crashes by **25%** in high-load scenarios.\nCollaborated effectively with cross-functional teams, enhancing communication skills to resolve complex problems and drive project timelines forward with minimal delays.\nApplied **Python** and **Bash** scripting for automating deployment and testing processes, increasing deployment efficiency by **15%**.\nEnsured network security and software security best practices were followed, significantly reducing vulnerability risks and maintaining compliance with industry standards.\nEngaged in continuous learning and development within the context of **IP Networking** to troubleshoot connectivity issues and improve application performance.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tC++, Qt, QML, Python, Ruby, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tKeycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot\n\n **Other:**\n\tTest-Driven Development (TDD), Design Patterns, MVC, MVVM, MVP, Agile, Scrum, Kanban, Automated Testing, Thread Safe Code, Communication Skills, Problem Solving, IP Networking, Bash, Network Security, Software Security"
}