{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Data Science and Machine Learning Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "A results-driven Data Science and Machine Learning Engineer with 8 years of hands-on experience specializing in developing machine learning solutions that adhere to healthcare compliance standards. Proficient in **Python**, **scikit-learn**, **TensorFlow**, and **PyTorch**, I bring expertise in data preprocessing, feature engineering, and model validation to ensure the delivery of high-quality predictive analytics systems.\nI leverage version control systems such as **Git** and have extensive experience in CI/CD automation for streamlined deployment of machine learning models. Additionally, my background in statistical methods and data visualization enhances my ability to derive actionable insights from complex datasets.\nIn the full stack realm, I am skilled in utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, further enriching my capabilities to develop robust applications integrated with AI/ML functionalities. My experience spans across cloud environments including **Azure** and **AWS**, ensuring that solutions are scalable and compliant with regulations such as HIPAA, FHIR, and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Data Science and Machine Learning Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** with libraries such as **scikit-learn**, **TensorFlow**, and **PyTorch** to design and deploy machine learning models for patient risk prediction and financial fraud detection, achieving a model accuracy of **95%**.\nEngineered robust data preprocessing and feature engineering strategies to optimize model performance, enhancing predictive capabilities and achieving a reduction in data processing time by **30%**.\nDeveloped comprehensive model validation techniques to ensure reliability and compliance with medical device regulations, encompassing statistical methods and data visualization tools such as **D3.js** and **Chart.js** for insightful presentation of results.\nImplemented version control systems such as **Git** to manage ML project workflows and maintain traceability of model iterations efficiently, reducing deployment time by **20%**.\nCollaborated with cross-functional teams to ensure adherence to compliance standards in **healthcare** and **life sciences**, integrating best practices into machine learning workflows.\nEngineered and maintained cloud-native data architectures, utilizing tools like **PostgreSQL** and **MongoDB**, supporting large-scale data ingestion necessary for training ML models.\nEstablished and optimized DevOps pipelines with tools like **Azure DevOps** and **GitHub Actions**, facilitating seamless integration and continuous deployment of machine learning models across development environments.\nDesigned end-to-end solutions for real-time inference services by integrating trained models into production systems to provide actionable insights in real time.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged advanced **machine learning** techniques to implement AI/ML-powered fraud detection systems using **scikit-learn**, enabling the identification of suspicious activities with an accuracy increase of **15%**.\nApplied statistical methods and data preprocessing skills to develop ML pipelines for credit scoring, churn prediction, and transaction classification, achieving a processing speed improvement of **20%** through optimized algorithms.\nConducted feature engineering and model validation for ML projects, ensuring compliance with regulatory standards and enhancing the reliability of predictive models in financial and banking systems.\nUtilized **Python** for building and orchestrating ETL pipelines with **Apache Airflow** and **Azure Data Factory**, supporting both batch and real-time data ingestion for analytics with an output efficiency gain of **30%**.\nCreated dynamic data visualization tools within financial dashboards using **D3.js** and **Power BI Embedded**, allowing operations teams to track key performance metrics and anomalies in transaction activities effectively.\nImplemented version control practices using **Git** to manage and document code changes, ensuring collaboration and integrity across multiple ML projects.\nIncorporated virtual machines for testing and deploying machine learning models, improving scalability and reducing operational costs by **25%** in resource management."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** for machine learning projects, leveraging **scikit-learn**, **TensorFlow**, and **PyTorch** for building and deploying predictive models, ensuring high standards in **model validation** and **feature engineering**.\nConducted comprehensive **data preprocessing** to clean and prepare datasets, enhancing model accuracy and relevance for practical applications in the **healthcare** and **life sciences** sectors.\nApplied advanced **statistical methods** and **data visualization** techniques to generate insights from complex datasets, supporting decision-making processes and strategic initiatives aligned with compliance standards in medical device regulations.\nImplemented robust **version control systems** using **Git** for version tracking of data science projects, improving collaboration and workflow efficiency across teams.\nEngaged with cloud technologies and **virtual machines** to streamline resource allocation and model deployment, ensuring a scalable and reproducible workflow in machine learning tasks.\nDesigned and developed machine learning proof of concepts in real-world scenarios, measuring outcomes and impact metrics to validate model performance.\nCollaborated with cross-functional teams to integrate machine learning models into existing applications and frameworks, emphasizing robust compliance with regulatory standards and ethical practices in **healthcare** solutions.\nMaintained high documentation standards throughout the model lifecycle, ensuring transparency and clarity for various stakeholders across the organization."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tVirtual machines, Compliance with medical device regulations\n\n**Other:**\n\tMachine Learning, Scikit-learn, TensorFlow, PyTorch, Data preprocessing, Feature engineering, Model validation, Data visualization, Statistical methods, Healthcare, Life sciences, Version control systems, Git"
}