{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Developer Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Developer Engineer with 8 years of experience, I excel in **C#**, **Java**, and **ABL** development, complemented by a strong foundation in **Error Analysis**, **Database** management, and system documentation. My roles have involved working within **Ticket Systems** and **ServiceNow** platforms to enhance communication and teamwork across projects. I am fluent in both **German** and **English**, enabling effective customer orientation and collaboration in diverse environments. \nAdditionally, I have a proven track record of delivering high-performance solutions in the healthcare and financial sectors. My expertise includes full-stack development leveraging **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, along with comprehensive cloud experience on **Azure** and **AWS**. I have led the design of enterprise-grade platforms that integrate AI/ML capabilities for predictive analytics, intelligent automation, and real-time data processing. Strong knowledge in microservices architecture, event-driven systems, and CI/CD automation supports my ability to build robust applications compliant with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Furthermore, I bring hands-on experience in developing machine learning pipelines and implementing MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Developer Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted **error analysis** to troubleshoot and optimize enterprise applications, ensuring high performance and reliability.\n- Leveraged **source code management** practices through version control systems, facilitating collaborative development and maintaining code standards.\n- Designed and implemented highly efficient **database** architectures for scalable applications, utilizing PostgreSQL and MongoDB for structured and unstructured data.\n- Developed microservices using **C#** and **Java**, enhancing system modularity and promoting easier maintenance and updates.\n- Integrated **Ticket System** tools such as ServiceNow for issue tracking and efficient resolution workflows, significantly reducing response times by **30%**.\n- Authored comprehensive **documentation** for code, systems, and processes, fostering knowledge sharing and enhancing onboarding experiences.\n- Communicated effectively with cross-functional teams to gather requirements and deliver solutions aligned with customer needs, improving stakeholder satisfaction ratings.\n- Emphasized **teamwork** in agile development environments, collaborating with members to drive project success and innovation.\n- Maintained a strong focus on **customer orientation**, ensuring that all developed features aligned with user expectations and business goals.\n- Utilized **analytical skills** to analyze performance metrics, leading to a **25%** increase in application efficiency.\n- Fluent in **German** and **English**, enabling effective communication with diverse teams and stakeholders in global projects."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized strong **C#** and **Java** programming skills to enhance database interactions and optimize source code, leading to a reduction in query response time by **30%**.\nCollaborated with cross-functional teams, demonstrating effective communication and teamwork throughout the software development lifecycle to ensure project milestones are met on time.\nPerformed comprehensive error analysis and debugging within applications, effectively addressing issues and minimizing downtime, achieving a **25%** decrease in bug reports.\nManaged and maintained a ticketing system using **ServiceNow**, ensuring timely resolution of technical issues and enhancing customer orientation by achieving a **95%** satisfaction rate in user feedback.\nDocumented software specifications and technical processes, clearly conveying complex concepts to varying audiences, which improved team understanding and project transparency.\nConducted database design and optimization to facilitate high-performance applications, contributing to the successful launch of two major software updates within a year.\nMaintained a high level of bilingual proficiency in **German** and **English**, enhancing collaboration with international teams and stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted rigorous **Error Analysis** on backend services to identify and resolve potential issues, ensuring a robust and functional environment for high-traffic e-commerce applications.\nUtilized **ServiceNow** for efficient **Ticket System** management, facilitating timely resolution of user-reported problems and tracking service performance.\nDeveloped comprehensive **Documentation** for system architecture, APIs, and features, enhancing communication among team members and providing clear insights for future development.\nExercised **Teamwork** to collaborate effectively with cross-functional teams, leveraging shared expertise in **C#**, **Java**, and a variety of database technologies to deliver cohesive solutions.\nMaintained high standards of **Customer Orientation**, addressing client needs promptly and efficiently while ensuring satisfaction through tailored technical solutions.\nApplied strong **Analytical Skills** to assess project requirements and translate them into practical software engineering tasks, enabling timely and successful application releases.\nEngaged in clear and informative **Communication** practices in both **German** and **English**, facilitating collaboration in diverse team environments and enhancing project outcomes.\nAnalyzed and improved existing **Source Code** for increased efficiency and maintainability, leading to a **20%** reduction in technical debt across projects.\nEnhanced database performance through improved indexing and query optimization across multiple databases, increasing data retrieval speed by **30%** and ensuring a seamless user experience."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, C#, Java, ABL\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tError Analysis, Source Code, Ticket System, ServiceNow, Documentation, Communication, Teamwork, Customer Orientation, Analytical Skills, German, English",
  "apply_company": "Proalpha"
}