{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Design Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a results-driven Senior Design Engineer with 8+ years of experience, I excel in UX design and prototyping, utilizing tools like **Figma** to create user-centric interfaces. My technical skill set encompasses **JavaScript**, **React**, and **TypeScript**, which I leverage to build dynamic and responsive applications. I have a strong foundation in **AWS** for cloud deployment and am well-versed in continuous deployment practices to streamline workflow efficiencies. Beyond my technical proficiencies, I possess excellent communication skills, facilitating collaboration between design and development teams. My background also includes using state management libraries like **MobX** to enhance application performance, ensuring that I deliver tailored solutions that meet business objectives effectively.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Design Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Collaborated with cross-functional teams to enhance **UX** through rapid prototyping and effective use of **Figma** for design iterations, ensuring optimal user interaction across both web and mobile platforms.\n• Led interactions and design discussions utilizing **JavaScript**, **React**, and **TypeScript** to create dynamic user interfaces and seamless user experiences.\n• Integrated modern state management solutions like **MobX** to enhance application performance and data management across large-scale projects.\n• Spearheaded the implementation of **Continuous Deployment** strategies, ensuring automated testing and deployment for faster delivery of new features and enhancements in **AWS** environments.\n• Developed and refined UX design workflows, guiding the team in best practices and methodologies to ensure a user-centered design approach.\n• Communicated effectively with stakeholders to gather requirements, providing clear design specifications and addressing feedback throughout the development process.\n• Mentored junior designers and engineers, fostering a collaborative environment to promote innovative design solutions using modern technologies.\n• Optimized user experiences by engaging in extensive usability testing, iterating on designs based on user feedback to ensure high satisfaction rates.\n• Championed the design of responsive applications that perform well on various devices, prioritizing accessibility and inclusivity in all design work.\n• Monitored and reported on design metrics to analyze user engagement, utilizing findings to inform design decisions and development processes in Agile sprints."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Developed intuitive user interfaces using **React** and **TypeScript**, ensuring optimal user experience through rigorous prototyping and effective design communication.\n- Collaborated with cross-functional teams to define design specifications and implementation strategies, utilizing tools such as **Figma** for enhanced design workflows.\n- Facilitated continuous deployment processes in projects leveraging **AWS** to improve software delivery times by **30%**.\n- Applied UX principles to create user-centric designs that align with project goals, resulting in an **18%** increase in user satisfaction metrics.\n- Engaged in effective communication with stakeholders to gather feedback and iterate on design solutions, fostering a collaborative environment.\n- Utilized **MobX** for state management in React applications, enhancing application performance and maintainability.\n- Spearheaded the introduction of design systems to ensure consistency across products, leading to a **20%** reduction in design defects.\n- Implemented advanced prototyping techniques to visualize complex functionalities, reducing development time by **25%**.\n- Maintained awareness of market trends and technologies to propose innovative solutions that align with organizational objectives and enhance overall project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and optimized user experiences (UX) for an e-commerce platform, utilizing **Figma** for prototyping and collaboration, resulting in a **25%** improvement in user engagement.\nCollaborated with cross-functional teams to communicate design concepts, ensuring effective integration of frontend implementations using **JavaScript**, **React**, and **TypeScript** for enhanced interactivity and responsiveness across devices.\nDeveloped dynamic, responsive frontends integrated with Python backends using **React** and **Next.js**, applying modern state management solutions like **MobX** to provide smooth user experiences.\nImplemented Continuous Deployment pipelines using **AWS** and relevant tools to automate the delivery of design features, decreasing deployment times by **40%**.\nBuilt SEO-optimized websites with **JavaScript**, **Next.js**, and **React** that are mobile-friendly, ensuring accessibility and driving increased organic traffic by **30%**.\nUtilized performance testing methodologies to validate the user experience and interface performance, ensuring robust applications that meet business and user satisfaction goals.\nConducted user research and usability testing to gather insights and feedback, iteratively prototyping designs leading to a **15%** reduction in user drop-off rates during the checkout process.\nCreated design assets and specifications for frontend development, fostering collaboration and clear communication between design and development teams to streamline workflows.\nLeveraged advanced tools for visualizing data and user interactions, translating complex user needs into effective design solutions and ensuring high standards of user experience across platforms."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor, MobX, Figma\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n **Cloud & Infrastructure:**\n\tDocker, Kubernetes, AWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **DevOps:**\n\tGitHub Actions, GitLab CI/CD, Continuous Deployment\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Communication, UX, Prototyping",
  "apply_company": "Restream"
}