{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Node.js Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Node.js Engineer with 13+ years of experience in high-performance application development. Proficient in **Node.js**, API design, and **Docker** for containerization, along with a strong background in implementing **CI/CD** pipelines to streamline development processes. Adept in security protocols including **OAuth2**, **SAML**, and **SSO** to ensure robust application access controls.\n\nExpertise in frontend technologies such as **React**, and a solid understanding of module bundling and **infrastructure-as-code** practices. Hands-on experience in building scalable applications using both backend and frontend stacks. Proven ability to integrate AI/ML capabilities within applications and deploy cloud-native systems on AWS and Azure. Strong background in compliance-driven development and MLOps business strategies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Node.js Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed high-performance applications using **Node.js** to build scalable APIs, ensuring seamless integration and user experience across platforms.\n• Maintained CI/CD pipelines utilizing **Docker** and automation tools, optimizing deployment and infrastructure through **infrastructure-as-code** practices while ensuring rapid and reliable releases.\n• Implemented OAuth2, SAML, and SSO protocols for secure authentication across microservices, enhancing data privacy and user security on a platform serving over **100,000** users monthly.\n• Designed and optimized user interfaces with **React**, emphasizing responsive design principles to accommodate various device types, reaching over **95%** user satisfaction in feedback surveys.\n• Spearheaded the transition of monolithic systems to microservices architectures using **Docker** and **Node.js**, resulting in a **50%** reduction in system downtime and increased scalability for diverse applications.\n• Utilized **Golang** for performance-critical backend services, achieving a response time reduction of up to **30%** compared to previous implementations.\n• Collaborated effectively with cross-functional teams to ensure comprehensive API documentation and integration guidelines, facilitating collaboration and speedy onboarding of new developers.\n• Leveraged module bundling techniques to optimize application load times and enhance overall performance, leading to improved user engagement and retention.\n• Monitored and analyzed system performance metrics to fine-tune infrastructure, achieving an **80%** increase in overall system responsiveness due to proactive scaling tactics.\n• Participated in code reviews and technical discussions, fostering a culture of excellence and continuous improvement within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed scalable microservices using **Node.js** (NestJS/Express) to enhance the performance and reliability of core financial applications, processing over **1M** transactions daily.\n• Implemented secure APIs with authentication protocols such as **OAuth2** and **SAML**, ensuring compliance with data protection regulations and enhancing user access management across different platforms.\n• Leveraged **Docker** for containerization, simplifying the deployment process and enabling CI/CD practices that reduced deployment times by **40%**.\n• Created interactive front-end applications with **React** (18), building responsive UIs for financial tools that improved user engagement metrics by **30%**.\n• Designed and managed event-driven workflows using tools like **Kafka** and **RabbitMQ**, boosting system reliability and enabling instantaneous trigger responses for critical operations such as payment processing.\n• Developed and maintained ETL pipelines using **Apache Airflow** and **Azure Data Factory** for real-time data ingestion from various financial sources, enhancing analytics capabilities with a **99%** data accuracy rate.\n• Collaborated on machine learning solutions utilizing **scikit-learn** and **Azure ML** for fraud detection, achieving a model accuracy improvement of **15%** year-over-year in identifying suspicious transactions.\n• Automated machine learning pipelines for processes like credit scoring and churn prediction, improving integration efficiency and model deployment speed via **MLflow** and **Airflow**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust APIs using **Node.js** (with **Express** and **NestJS**), ensuring effective data exchange and integration within various microservices.\n- Implemented infrastructure-as-code strategies using **Docker** to streamline deployment processes, resulting in a **30%** reduction in deployment times.\n- Leveraged **React** (version **18**) and **module bundling** techniques for creating dynamic, modular frontend components, enhancing overall user experiences and maintainability.\n- Standardized authentication and data security protocols using **OAuth2**, ensuring secure access across applications with user-friendly Single Sign-On (SSO) capabilities.\n- Contributed to the CI/CD pipeline, automating testing and deployment procedures, which improved delivery frequency by **25%** and reduced downtime.\n- Collaborated with cross-functional teams to design and implement single sign-on (SSO) integrations, facilitating seamless user experiences across multiple platforms.\n- Actively participated in code reviews and mentoring sessions, elevating team productivity and fostering a culture of continuous improvement.\n- Engineered customized solutions using Golang for backend processes, enhancing performance and reliability in data-intensive applications.\n- Demonstrated adaptability in feature development, incorporating innovative strategies to meet evolving business requirements and technical challenges."
    }
  ],
  "skills": " **Programming Languages:**\n\tNode.js, Python, Golang\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI, OAuth2, SAML, SSO\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Bonapolia"
}