{
  "name": "Mariusz Jan Skobel",
  "role_name": "AI Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "AI Software Engineer with 10+ years of experience specializing in **Python**, **FastAPI**, and **microservices architecture**. Expertise in developing innovative software solutions leveraging **event-driven architecture**, **KafKa**, **SSE**, and **WebSocket** for enhanced communication and scalability. Proficient in integrating **Large Language Models (LLMs)** such as **GPT**, **Claude**, and **Gemini** with hands-on experience in **fine-tuning** and **prompt engineering**. Strong background in deploying **Retrieval-Augmented Generation (RAG)** systems and working with **vector databases** like **OpenSearch** and **FAISS** to optimize information retrieval. Proven ability to lead the development of secure, maintainable solutions with an emphasis on real-time analytics and intelligent decision-making. Demonstrated skills in **AI agents** and **OpenAI Chat Completion**, underpinned by a solid foundation in CI/CD automation and cloud deployment on **Azure** and **AWS**. A collaborative problem solver passionate about leveraging technology to create impactful systems in healthcare and finance.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "AI Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and implemented microservices architecture for AI-driven applications using **Python** and **FastAPI**, ensuring scalability and maintainability in line with industry best practices.\n•\tUtilized **event-driven architecture** and technologies such as **Kafka** and **WebSockets** to enhance real-time data processing and communication between services, achieving system responsiveness in **95%** of use cases.\n•\tFine-tuned and deployed Large Language Models (LLMs) such as **GPT** and **Claude** for various applications including chatbots and intelligent assistance, successfully improving user interaction experiences by over **30%**.\n•\tDesigned and integrated **prompt engineering** strategies to optimize model performance, resulting in improved accuracy rates of **85%+** for specific tasks.\n•\tImplemented Retrieval-Augmented Generation (RAG) systems leveraging **vector databases** like **FAISS** and **OpenSearch** for efficient document retrieval and context generation, enhancing information retrieval speed by **40%**.\n•\tBuilt AI agents to automate repetitive tasks within software applications, significantly reducing operational overhead and increasing productivity by **25%**.\n•\tLed collaborative problem-solving sessions with cross-functional teams to define project requirements and improve system architecture, enhancing communication efficiency across teams.\n•\tAuthored comprehensive documentation for developed features, facilitating better communication among team members and stakeholders, ensuring transparency and clarity.\n•\tConducted code reviews and mentoring for junior developers, fostering a collaborative environment, and aiding their growth within the company."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** alongside **FastAPI** and **Flask** to develop microservices that enhanced system scalability and maintainability, achieving a **20% increase** in throughput for high-volume transactional environments.\nImplemented an **event-driven architecture** using **Kafka**, ensuring robust communication for real-time transaction processes and alerts, thereby improving operational efficiency by **25%**.\nDesigned and developed a system for fine-tuning and leveraging **Large Language Models (LLMs)**, focusing on **prompt engineering** with tools like **GPT**, to enhance user interactions by providing intelligent responses and recommendations.\nPioneered the integration of **vector databases** such as **OpenSearch** and **FAISS** for fast retrieval of large datasets, resulting in a **30% reduction** in response time for analytic queries.\nCollaborated with front-end teams to introduce a seamless **WebSocket** communication layer, boosting user experience by delivering real-time updates, which further increased user satisfaction metrics by **15%**.\nLed meetings to improve communication and foster collaboration within cross-functional teams, enhancing project delivery timelines by **10%**.\nFacilitated effective problem-solving sessions to troubleshoot integration issues, ensuring that stakeholders’ needs are met with effective solutions and timely pushbacks on deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services for AI-driven applications using **Python**, **FastAPI**, and **Flask**, ensuring high availability and scalability across microservices architecture for real-time data processing and model inference.\nEngineered event-driven architecture with **WebSocket** and **Kafka** to support interactive features and responsive communication, supporting at least **1000** concurrent users for AI-powered services.\nIntegrated fine-tuning and prompt engineering for Large Language Models (LLMs) including **GPT** and **Claude**, enhancing model performance and user engagement based on real-time analytics and behavior.\nDeveloped AI agents and implemented **RAG systems** using **OpenSearch** and **FAISS** for efficient information retrieval, optimizing searches and recommendations in the platform with less than **5** seconds response time.\nCollaborated with cross-functional teams to improve communication and problem-solving strategies for implementing AI features effectively, resulting in a **30%** increase in overall project efficiency and team productivity.\nBuilt and integrated secure AI workflows with tokenized transactions, ensuring adherence to GDPR compliance while maintaining data integrity across **microservices**.\nImplemented role-based access control (RBAC) and exploited **AI agents** to enhance security across applications, ensuring secure user data protection and compliant access management for **10,000+** users.\nCreated responsive interfaces for AI solutions using **React** and **Vue 3**, optimized for accessibility compliance and user-friendly engagement, resulting in a **25%** increase in user satisfaction as measured by feedback.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, microservices architecture, event-driven architecture\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tWebSocket, SSE\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, vector databases, OpenSearch, FAISS\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, problem-solving, communication, collaboration, Large Language Models (LLMs), fine-tuning, prompt engineering, GPT, Claude, Gemini, RAG systems, AI agents, OpenAI Chat Completion, Assistant endpoints, Retrieval-Augmented Generation (RAG)"
}