{
  "name": "Tomasz Lee",
  "role_name": "Software Testing Analyst",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Software Testing Analyst with 9+ years of experience in Quality Assurance, Automated Testing, and implementing robust testing strategies. Proficient in **C#**, **Selenium**, and **Cypress** for test automation, ensuring high-quality application delivery through rigorous testing methodologies. Experienced in data collection and managing EMR to EDC conversions, demonstrating strong analytical skills and attention to detail. Strong communication abilities, both verbal and written, complemented by a solid foundation in technical documentation. Adept at collaborating with cross-functional teams and leveraging AI and Federated Learning techniques to enhance risk assessment and streamline testing processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Testing Analyst",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted **Quality Assurance** and **Automated Testing** procedures utilizing **Selenium** and **Cypress** to ensure software reliability and performance, achieving a 30% reduction in post-release defects.\nPerformed thorough **Data Collection** and analysis to streamline **EMR to EDC Conversions**, improving data accuracy by **15%**.\nDeveloped technical documentation to facilitate seamless **Verbal Communication** and **Written Communication** between technical and non-technical team members, enhancing project collaboration by **20%**.\nParticipated in **Risk Assessment** activities to identify potential project risks early, improving project delivery timelines by **10%**.\nImplemented **AI** strategies and contributed to **Federated Learning** projects to enhance machine learning outcomes and data security.\nAssisted in establishing guidelines for testing protocols, improving overall testing efficiency by **25%**.\nCollaborated closely with the development team on technical issues to ensure seamless integration of features and functionality, contributing to a user-centered design approach.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Conducted quality assurance testing with **C#** to ensure software quality and functionality, achieving a 98% pass rate on the first deployment.\nDeveloped and executed automated testing scripts using **Selenium** and **Cypress**, leading to a **30% reduction** in manual testing time.\nCollaborated with developers to implement automated tests for **EMR to EDC conversions**, enhancing the accuracy of data collection processes by **15%**.\nPerformed risk assessment for new features, improving the project's overall stability and user satisfaction by addressing potential issues before release.\nCreated and maintained comprehensive technical documentation, ensuring clarity and effectiveness in communication with stakeholders and team members.\nLeveraged **Data Collection** strategies to gather insights, contributing to informed decision-making that increased system performance by **20%**.\nFacilitated verbal and written communication with cross-functional teams to define testing requirements, resulting in **timely project delivery** within deadlines.\nManaged project timelines effectively, ensuring that all testing phases align with the overall development schedule.\nProvided mentorship and training sessions to junior team members on best testing practices, fostering a collaborative and skilled team environment.\nUtilized federated learning principles to test AI features, ensuring compliance with data security and privacy standards."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Established automated testing frameworks using **Selenium** and **Cypress** to enhance software quality and coverage, resulting in a **30%** increase in defect detection rate.\nConducted thorough quality assurance assessments on applications developed in **C#**, ensuring compliance with project specifications and user requirements.\nDeveloped comprehensive technical documentation to support the integration of **Data Collection** methodologies, improving team understanding by **25%**.\nCollaborated in the execution of **Risk Assessment** protocols, identifying potential failures and implementing actionable solutions.\nFacilitated **EMR to EDC Conversions** through rigorous testing methodologies to ensure data integrity and accuracy.\nImplemented **Automated Testing** strategies that significantly reduced testing time by **40%**, increasing overall productivity.\nEngaged in **Verbal Communication** and **Written Communication** to work effectively with cross-functional teams and stakeholders.\nPlayed a pivotal role in data analysis for emerging AI technologies and participated in projects utilizing **Federated Learning** techniques.\nConducted extensive testing to validate system functionality, performance, and security, consistently meeting project milestones across **9** major releases."
    }
  ],
  "skills": " **Programming Languages**\n\t C#, JavaScript, TypeScript, Python, Solidity\n\n**Frontend Frameworks**\n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t AWS, Azure\n\n**Other**\n\t Quality Assurance, Testing, Selenium, Cypress, Automated Testing, Data Collection, EMR to EDC Conversions, AI, Federated Learning, Risk Assessment, Technical Documentation, Verbal Communication, Written Communication, UX/UI Design, Git, GitHub, Redux"
}