{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Rust Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Rust Engineer with 8 years of experience, I possess strong expertise in **Rust** and **Golang**, and proficiency in **TypeScript**. I focus on developing robust applications grounded in security best practices, including authentication and authorization frameworks like **OAuth** and **OIDC**. My background in building secure, microservices-based architectures has equipped me with the skills necessary for identity and access management, as well as asynchronous workflows.\n\nIn my previous roles, I have demonstrated strong problem-solving abilities, curiosity, and adaptability while collaborating effectively within teams. I am dedicated to continuous learning and mentoring fellow developers, and I actively participate in code reviews to promote best practices. My technical proficiency and strategic approach ensure the successful delivery of high-performance solutions tailored to meet both user needs and compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Rust Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Rust** to develop secure applications focusing on **security**, **authentication**, and **authorization** processes, ensuring compliance with industry standards.\nLed team collaborations to implement effective **identity management** and **access management** strategies, enhancing app security by **30%** over previous frameworks.\nImplemented **asynchronous workflows** to improve application performance, reducing processing time by **20%**.\nConducted code reviews and provided mentorship, fostering a culture of **continuous learning** and improvement among team members.\nArchitected and developed scalable, full-stack platforms using **TypeScript**, while ensuring compliance with HIPAA and financial regulatory standards.\nDesigned and deployed machine learning models using Python libraries such as scikit-learn, optimizing patient risk prediction and financial fraud detection.\nIntegrated advanced **AI-based** features into applications, providing personalized recommendations that improved user engagement metrics by **25%**.\nEstablished comprehensive testing strategies using Jest and Cypress, ensuring that all deployments met high-quality standards through unit, integration, and E2E testing.\nCollaborated with data scientists to enhance healthcare and financial services with NLP integration, improving document parsing efficiency by **40%**.\nEmployed **modern front-end frameworks** like React and Next.js to build intuitive user interfaces, enhancing user experience on both web and mobile platforms.\nIntegrated **OAuth** and **OIDC** for secure user authentication, significantly reducing unauthorized access incidents.\nImplemented **DevOps** pipelines using GitHub Actions, enabling seamless deployments and reducing release cycles by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed high-security applications ensuring robust **authentication** and **authorization** mechanisms, employing **OAuth** and **OIDC** strategies to manage **identity** and **access management** effectively.\n- Led teams in implementing **asynchronous workflows**, enhancing communication and process efficiency, thereby improving overall productivity by **30%**.\n- Collaborated with cross-functional teams, fostering **team collaboration**, and mentoring junior engineers in adopting new technologies and best practices, resulting in a **20%** increase in team output.\n- Employed **Rust** and **Golang** for system-level programming, achieving optimized performance for high-traffic applications with an increase in processing speed by **50%**.\n- Conducted comprehensive **code reviews** to maintain high code quality standards and integrate feedback mechanisms, enhancing the team's coding proficiency.\n- Engaged in continuous learning and exploration of new solutions, which contributed to innovative problem-solving tactics that decreased incident resolution time by **15%**.\n- Built applications using **TypeScript**, ensuring type safety and reducing runtime errors during application development.\n- Actively participated in adapting new frameworks like **WASM**, leading to increased application interoperability and integration capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Utilized **Rust** for developing high-performance components while ensuring robust **security** measures across applications, including **authentication** and **authorization** practices.\n- Implemented **OAuth 2.0** and **OIDC** frameworks for effective **identity management** and **access management**, safeguarding sensitive user data and enhancing security compliance.\n- Collaborated with cross-functional teams to enhance development workflows through **team collaboration**, emphasizing **problem-solving** and **curiosity** for innovative solutions in asynchronous environments.\n- Conducted regular **code reviews** and provided **mentoring** to junior engineers, fostering a culture of **continuous learning** and promoting best coding practices.\n- Designed and integrated responsive user interfaces with **TypeScript**, promoting a smooth user experience across both web and mobile platforms.\n- Established real-time solutions using asynchronous workflows to enhance application responsiveness and enable efficient communication between services, significantly impacting performance metrics.\n- Championed the adoption of **WASM** to optimize application performance, ensuring compatibility and enhancing the scalability of applications across various devices.\n- Developed secure authentication modules leveraging industry-standard practices, substantially reducing vulnerabilities across the application stack.\n- Actively engaged in team collaborations to enhance project outcomes and drive continuous improvements in software development lifecycle."
    }
  ],
  "skills": "**Programming Languages:**\n\tRust, Golang, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth, OIDC, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tSecurity, authentication, authorization, identity management, access management, asynchronous workflows, team collaboration, problem-solving, curiosity, adaptability, continuous learning, code review, mentoring",
  "apply_company": "1Password"
}