{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Solutions Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Solutions Engineer with 8 years of experience, I leverage advanced skills in **cloud technologies** including **AWS**, **Azure**, and **Google Cloud**, essential for developing automated solutions in the GenAI and ConversationalAI domains. My expertise encompasses **NLP**, **CRM** systems, and delivering automation and RPA solutions for seamless integration. Proficient in **REST** and **GraphQL** APIs, I enable dynamic data interaction and enhance user experience through intelligent automation.\n\nIn my previous roles, I have successfully built high-performance applications that cater to healthcare and financial sectors using **JavaScript/TypeScript**, **Python**, and **Flutter**. My experience in full-stack development with frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** ensures robust application lifecycle support.\n\nMy strong foundation in microservices architecture, event-driven systems, and CI/CD automation allows me to construct secure and compliant solutions, adhering to standards such as HIPAA, FHIR, PCI DSS, and SOC 2. I have also developed machine learning pipelines, deploying ML models in production and orchestrating MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**. With effective presentation and communication skills, I excel at relationship building and technical advising, ensuring stakeholder alignment and successful project execution.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS** and **Azure** cloud services to architect and implement scalable solutions for healthcare and financial platforms, ensuring high availability and compliance with security regulations.\nIntegrated **GenAI** and **ConversationalAI** functionalities into applications, enhancing user experience and engagement through natural language processing (NLP) features.\nAutomated deployment processes and workflows using **RPA** and CI/CD pipelines with **GitHub Actions** and **Azure DevOps**, improving the release cycle efficiency by **30%**.\nEngaged with clients to deliver technical advising, ensuring alignment with their business needs while using **Salesforce** and **HubSpot** for relationship management and communication.\nLeveraged **REST** and **GraphQL** APIs for seamless integration and data exchange between services, contributing to the development of responsive client-facing applications.\nDesigned and maintained client relational systems (CRM) to streamline communication and improve relationship-building with stakeholders.\nFacilitated presentations and demos for enterprise clients, effectively communicating technical concepts and solutions to non-technical audiences.\nPioneered the integration of **cloud** technologies for data storage and processing, utilizing platforms such as **GoogleCloud** for additional scalability and performance.\nOptimized workflows through automation, reducing manual efforts by **25%** and increasing overall productivity of the engineering team.\nEstablished protocols for **NLP** applications and tools to enable advanced document parsing and data extraction, improving analytics on healthcare and financial documents.\nCollaborated with cross-functional teams to implement solutions leveraging **NLP**, resulting in higher accuracy in data classification and reporting for enterprise applications.\nDeveloped robust presentation strategies, demonstrating how technical solutions aligned with business objectives to stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented **cloud**-based solutions leveraging **AWS**, **Azure**, and **GoogleCloud** to enhance deployment, scalability, and resilience of financial systems.\nDeveloped conversational AI applications utilizing **NLP** frameworks to automate customer interactions and improve user engagement, leading to a **30%** increase in customer satisfaction rates.\nLed the integration of **REST** and **GraphQL** APIs into CRM systems like **Salesforce** and **HubSpot**, streamlining data access and improving performance up to **40%**.\nImplemented automation workflows with **RPA** tools, reducing manual processing time by **25%**, thereby enhancing operational efficiency.\nConducted presentations and technical advising sessions to key stakeholders, effectively communicating complex technical concepts and fostering strong relationships with clients and team members.\nUtilized **GenAI** to create advanced predictive models that drive business analytics and foster informed decision-making in financial services.\nDesigned solutions that utilize advanced automation to meet industry standards and improve overall system reliability and performance.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **cloud services** including **AWS**, **Azure**, and **GoogleCloud** to architect scalable solutions for client-based applications, enhancing performance by **30%**.\nUtilized **REST** and **GraphQL** APIs to streamline data retrieval processes, resulting in a **25%** reduction in response times and improved client interactions.\nImplemented **automation** strategies through **RPA** tools, optimizing backend processes and increasing operational efficiency by **40%**.\nEngineered CRM integrations with **Salesforce** and **HubSpot**, enhancing client relationship management and personalizing customer experiences based on insights drawn from **NLP**.\nDesigned and presented technical solutions to stakeholders, demonstrating the value of implemented strategies while improving **presentation** and **communication** skills.\nBuilt and maintained strong client relationships through strategic **relationshipBuilding**, ensuring a consistent feedback loop for continuous improvement.\nApplied generative AI techniques for developing innovative solutions in **GenAI** and **ConversationalAI** projects, positioning the company as a leader in AI integrations.\nUtilized dashboard tools for process visualizations, facilitating clear communication of results and progress towards automation goals, ensuring stakeholders remained informed and engaged."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\tREST, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GoogleCloud\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GoogleCloud\n\n**Other:**\n\tGenAI, ConversationalAI, automation, CRM, RPA, NLP, Salesforce, HubSpot, presentation, communication, relationshipBuilding, technicalAdvising",
  "apply_company": "Enterprise Bot"
}