{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Kotlin Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Kotlin Engineer with over 10 years of experience delivering high-performance software solutions, focusing on Android development using **Kotlin**, **Jetpack**, and **Ktor**. Proficient in asynchronous programming and implementing **Coroutines** and **Flow** for efficient application processes. Experienced in developing modern, user-friendly applications with **Jetpack Compose** while ensuring best practices in QA and benchmarking. Adept in creating technical documentation to support efficient collaboration and communication across teams. \n\nPossesses a robust background in full stack development, utilizing modern technologies such as **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven expertise in building and deploying cloud-native applications on **Azure** and **AWS**, leading the development of enterprise platforms with embedded AI/ML capabilities for real-time analytics. Strong understanding of microservices architecture, event-driven systems, and CI/CD automation, while adhering to compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about creating impactful systems that drive innovation.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Kotlin Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented mobile applications using **Kotlin** and **Android** frameworks, focusing on quality assurance and performance benchmarking to deliver optimal user experiences.\n• Developed asynchronous features leveraging **Coroutines** and **Flow** for enhanced responsiveness in applications, ensuring smooth navigation and data handling.\n• Collaborated with cross-functional teams to produce technical documentation that facilitates better understanding and maintenance of the applications, while enhancing communication across developers and stakeholders.\n• Utilized **Ktor** for creating RESTful APIs to facilitate seamless integration of backend services with the mobile front end, thus improving data exchange efficiency.\n• Implemented UI components with **Jetpack Compose**, ensuring modern design practices and adherence to Android’s Material Design guidelines effectively.\n• Leveraged **Gradle** to manage dependencies and streamline build processes, minimizing build time by **30%** in the project lifecycle.\n• Integrated Machine Learning features in applications using **ML** techniques to enhance functionalities, including real-time data analysis and predictive modeling based on user behavior.\n• Established QA practices including unit testing and integration testing with tools such as **JUnit** and **Espresso**, ensuring robust application performance with a target of **95%** test coverage.\n• Benchmarked and optimized application performance, achieving a **20%** increase in app loading times and overall user satisfaction scores.\n• Oversaw mentoring of new team members in asynchronous programming techniques, ensuring high-quality code practices and reinforcing team collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained Android applications using **Kotlin** and **Jetpack Compose**, ensuring high performance and user satisfaction through collaborative, agile methodologies.\nImplemented asynchronous programming patterns with **Coroutines** and **Flow**, enhancing app responsiveness and user interaction speed, resulting in a **30% decrease** in load times.\nCreated technical documentation and conducted QA processes for food delivery applications, enabling a **20% reduction** in post-release bugs and smooth deployment cycles, while ensuring compliance with best practices.\nDesigned, built, and optimized modular architecture utilizing **Ktor** and **Gradle**, improving code reusability and maintainability across multiple projects in a **6-month** timeframe.\nFacilitated collaboration across cross-functional teams, enhancing communication and work efficiency, leading to a significant improvement in project delivery times by up to **15%**.\nExecuted benchmarking strategies to evaluate app performance, making informed improvements that increased overall system throughput by **25%**.\nLeveraged ML models to enhance user experience and personalized features within the app, applying modern libraries and tools to achieve effective machine learning integration and deployment."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed robust mobile applications using **Kotlin** and **Jetpack Compose**, prioritizing performance and user experience for Android platforms with versions **30** and above.\nEngineered scalable backend services using **Ktor** for asynchronous programming, ensuring high throughput and reliability across various application modules, while incorporating **Coroutines** for efficient management of concurrent tasks.\nImplemented advanced features utilizing **ML** techniques for enhanced data processing and algorithm optimization, leveraging tools like **Gradle** for streamlined builds and dependency management.\nCreated comprehensive **Technical Documentation** covering project architecture, APIs, and deployment strategies to facilitate team collaboration and onboarding, ensuring smooth handoffs between developers.\nConducted rigorous **QA** and **Benchmarking** using tools and frameworks to validate performance metrics and maintain the highest quality standards in code deployment.\nCollaborated effectively with cross-functional teams, focusing on clear **Communication** to streamline project objectives and enhance productivity during the software development life cycle.\nEmployed **Flow** for state management in reactive programming paradigms, resulting in seamless UI updates and improved user experience on Android applications.\nEngaged in regular code reviews and sprint planning to foster a culture of continuous improvement and knowledge sharing across the engineering teams, leveraging Agile methodologies.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, Kotlin\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Ktor\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Jetpack Compose\n\n**API Technologies:**\n\tMLflow, Airflow, Kubeflow\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Other:**\n\tTechnical Documentation, QA, Benchmarking, Asynchronous Programming, Collaboration, Communication",
  "apply_company": "Invisible Agency"
}