{
  "name": "Tomasz Lee",
  "role_name": "Senior Web3 Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Senior Web3 Engineer with over 9 years of experience in designing and implementing complex applications in the blockchain space. Proficient in **React**, **Solidity**, **ethers.js**, **wagmi**, **hardhat**, and **Web3** technologies. Expertise in developing decentralized applications (dApps) and understanding Ethereum Virtual Machine (EVM) principles. Solid background in cloud services and optimizing performance for scalable solutions. Strong analytical skills with a proven track record of delivering robust solutions and streamlining developer workflows. Self-motivated and adept at leading cross-functional teams to successfully complete innovative projects in the decentralized finance (DeFi) ecosystem.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Web3 Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and developed decentralized applications incorporating **React**, **Solidity**, and **ethers.js** for seamless user interactions, contributing to improved engagement metrics by **30%**.\nSpearheaded the integration of **Web3** technologies with **wagmi** library for efficient wallet connectivity and transaction handling.\nUtilized **hardhat** for deploying smart contracts on Ethereum Virtual Machine (EVM), ensuring accuracy in contract deployments and reducing errors by **20%** during testing phases.\nImplemented **cloud services** to enhance application scalability and performance, optimizing resource allocation and reducing infrastructure costs by **25%**.\nPossessed strong analytical skills to assess project requirements and streamline development processes, resulting in a reduction of feature rollout time by **15%**.\nEnsured compliance with **HIPAA** regulations while developing DeFi applications, ensuring data protection and trustworthiness of solutions.\nDemonstrated self-motivated leadership by mentoring junior developers on best practices in smart contract development and **Web3** integration, fostering a collaborative environment.\nCollaborated with cross-functional teams to establish robust CI/CD pipelines, which decreased deployment time significantly by **40%**.\nCrafted detailed documentation of development processes and procedures to maintain high standards of code quality and facilitate onboarding of new team members."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **React** to build interactive user interfaces, enhancing user engagement by **25%** on the platform.\nDeveloped decentralized applications using **Solidity** and **ethers.js**, streamlining integration with smart contracts and blockchain interactions.\nLeveraged **wagmi** for improved state management in Web3 applications, increasing efficiency in user connections and transactions.\nImplemented blockchain development best practices with **hardhat**, enabling faster iteration cycles for DeFi projects.\nDesigned and deployed projects on the Ethereum Virtual Machine (**EVM**), ensuring compatibility across various blockchain networks.\nCollaborated with cross-functional teams to translate HIPAA compliance into project requirements, ensuring sensitive data is handled properly.\nConducted rigorous analysis to improve project workflows, applying strong analytical skills for ongoing enhancement and optimization.\nEngaged in continuous learning of **cloud services**, driving technology adoption within the team to enhance scalability and reliability.\nActively mentored junior developers in Web3 technologies, boosting team productivity by fostering a knowledge-sharing environment.\nProduced project roadmaps with clearly defined timelines, ensuring all deliverables were met on schedule."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **React** to build dynamic user interfaces for Web3 applications, enhancing user engagement and interaction.\nDeveloped smart contracts using **Solidity**, ensuring secure and efficient interactions within the **EVM** environment.\nUtilized **ethers.js** and **wagmi** for seamless integration with **Web3** wallet services, improving transaction processing times by **30%**.\nImplemented testing frameworks with **hardhat** to validate contract functionality, maintaining a **95%** test coverage.\nCollaborated within a multi-disciplinary team to ensure compliance with **HIPAA** regulations while developing decentralized finance (DeFi) solutions.\nDesigned and implemented analytical tools to process on-chain data, enhancing operational insights and decisions.\nEngaged in cloud services management for deployment and scaling of applications, reducing infrastructure costs by **25%**.\nExhibited strong self-motivation and analytical skills to identify performance bottlenecks and propose effective solutions.\nContributed to the creation of technical documentation and user guides, facilitating better understanding and maintenance across teams.\nParticipated actively in Agile practices, including daily standups and retrospectives, ensuring continuous improvement in workflows."
    }
  ],
  "skills": "  **Programming Languages**\n\tJavaScript, TypeScript, C#, Python, Solidity\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tcloud services\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tEVM\n\n  **Other**\n\tUX/UI Design, Git, GitHub, analytical skills, self-motivated, wagmi, hardhat, Web3, DeFi, HIPAA",
  "apply_company": "Flourish Health"
}