{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Experienced Senior Engineer with 8 years of expertise in Full-Stack Development utilizing **React**, **TypeScript**, **Next.js**, and **Python** to deliver high-performance healthcare and financial solutions. Proficient in implementing REST and GraphQL APIs, I leverage **CI/CD** practices with **GitHub Actions** to enhance deployment pipelines and facilitate seamless code reviews and debugging processes. My technical skill set is complemented by an extensive background in **AWS** cloud services, A/B Testing, and user-centric design principles. \nIn addition to my core development skills, I possess hands-on experience with modern technologies including **SCSS** for styling applications, and I have successfully led teams in building scalable microservices architectures. I am adept at collaborating with cross-functional teams to produce software solutions that meet compliance standards such as HIPAA and PCI DSS while aligning with best practices in AI/ML integration.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** and **TypeScript** to architect and develop scalable, full-stack healthcare and financial platforms, ensuring compliance with HIPAA, FHIR, GDPR, and financial regulatory standards (e.g., PCI DSS, SOX).\nImplemented CI/CD practices employing **GitHub Actions**, optimizing deployment processes leading to a reduction in release times by **30%**.\nDesigned and integrated **REST** and **GraphQL** APIs, enhancing the communication between front-end and back-end components with a focus on user-centric design and performance.\nCollaborated with cross-functional teams, advancing code reviews and debugging sessions that improved code quality and team productivity by **20%**.\nDeveloped responsive user interfaces with **Next.js** and **SCSS**, focusing on creating seamless user experiences that increased user engagement metrics by **15%**.\nExecuted full-stack development practices, delivering end-to-end solutions using **Python** (FastAPI) and ensuring high performance and scalability.\nDesigned robust testing strategies utilizing Jest and Cypress, achieving **90%** code coverage and enhancing application reliability prior to deployment.\nContributed to collaborative projects involving **Full-Stack Development**, fostering strong teamwork to accomplish project goals efficiently.\nIntegrated data visualization tools like Chart.js and Power BI Embedded for improved financial data insights, supporting decision-making in real time.\nMaintained code quality through regular debugging and refactoring initiatives, thereby significantly reducing application errors and enhancing user satisfaction."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed dynamic, user-focused front-end applications as a **Senior Engineer** utilizing **React (18)**, **Next.js**, and **TypeScript**, implementing **SCSS** and **Redux Toolkit** for responsive and performant user interfaces, achieving a 30% increase in user engagement.\nUtilized **Python** for back-end development, leveraging frameworks such as **FastAPI** and **Django** in the context of **REST** and **GraphQL** APIs to enhance system interoperability and data delivery efficiency, resulting in a 25% reduction in response times.\nLed full-stack development projects that involved integrating CI/CD pipelines using **GitHub Actions**, ensuring code quality through systematic **Code Reviews** and **Debugging** processes, which improved deployment frequency by 40%.\nCollaborated with cross-functional teams to implement **A/B Testing** strategies, informing product decisions that increased the conversion rate by 15% through user-centric design methodologies.\nImplemented robust data handling practices via ETL pipelines, utilizing **Apache Airflow** and **Azure Data Factory** for seamless data integration from various internal and third-party services, which enhanced the accuracy of data analytics by 20%.\nParticipated in ongoing modernization efforts by integrating cloud services such as **AWS** for scalable infrastructure and services, contributing to a 50% growth in system reliability and performance.\nEmployed advanced debugging techniques and collaboration efforts to streamline development processes, fostering a culture of continuous improvement and knowledge sharing across teams."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed frontend applications with **React** (18) and **Next.js**, utilizing **TypeScript** and **SCSS** to create user-centric, responsive designs that enhance user experience across multiple devices.\n• Engineered backend services using **Python** frameworks such as FastAPI and Django, ensuring seamless RESTful and **GraphQL** API integration for full-stack functionality in a high-traffic environment.\n• Implemented **CI/CD** pipelines with **GitHub Actions**, enhancing deployment efficiency and workflow automation, contributing to a **30%** reduction in deployment times.\n• Collaborated with cross-functional teams to ensure effective debugging and code reviews, emphasizing quality control and best practices in software development.\n• Designed and deployed scalable systems on **AWS**, improving system resilience and performance, which supported a **99.9%** uptime for the e-commerce platform.\n• Conducted A/B testing on key features, driving a **20%** increase in user engagement through iterative improvements based on user feedback and analytics.\n• Employed responsive web design principles to optimize applications for mobile-first engagement, ensuring compliance with accessibility standards (WCAG 2.1).\n• Applied user-centric design principles throughout the development process, ensuring interfaces are intuitive and maintain high user satisfaction ratings.\n• Achieved alignment with business goals through effective collaboration across teams to deliver innovative solutions that enhance overall product quality and functionality.\n• Maintained a focus on code quality and reliability through thorough code reviews and adherence to collaborative development methodologies."
    }
  ],
  "skills": " \n\n**Programming Languages:**\n\tPython, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Next.js, Angular, Vue, SCSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tREST, GraphQL\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, A/B Testing, Full-Stack Development, Debugging, Collaboration, Code Reviews, User-Centric Design"
}