{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior QA Engineer with 8 years of experience, I possess extensive expertise in ensuring high-quality software delivery through comprehensive testing strategies and frameworks. Proficient in **C#**, **Selenium**, **Playwright**, **Cypress**, and **SQL**, I have successfully implemented automated testing solutions to enhance software reliability and performance. My experience spans **GitHub Actions**, **Azure DevOps**, **Bitbucket**, and **Jenkins** for CI/CD pipelines, ensuring seamless integration and delivery.\n\nI have a solid foundation in Software Testing Life Cycle (STLC), REST API testing, and utilizing project management tools such as **Jira**, **Monday**, **Xray**, and **TestRail** to streamline task management and reporting. Additionally, my knowledge of containerization with **Docker** and mobile testing frameworks like **Appium**, **XCUITest**, and **Espresso** enhances my capability to deliver robust applications.\n\nMy background includes leading testing efforts in the healthcare and financial sectors, where I leverage my skills to ensure compliance with standards like HIPAA and PCI DSS, while also demonstrating a strong commitment to continuous improvement and quality assurance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and executed robust QA strategies incorporating **C#**, **Selenium**, and **Cypress**, ensuring high-quality software delivery with a focus on both web and mobile applications.\n- Implemented CI/CD pipelines utilizing **GitHub Actions**, **Azure DevOps**, and **Jenkins** for automated testing and deployment processes, improving release cycles by **30%**.\n- Designed and executed various testing methodologies covering unit, integration, E2E, and contract testing using tools like **Playwright**, **Postman**, and **Appium**, resulting in a substantial reduction in critical bugs by **40%** post-release.\n- Collaborated closely with development teams to document and triage defects using **Jira** and **Monday**, while ensuring alignment with the **STLC** and quality benchmarks.\n- Integrated testing frameworks with **REST API** services to optimize performance testing and enhance application reliability across platforms, leading to **25%** faster load times.\n- Maintained comprehensive test cases and documentation in **TestRail** and **Xray**, ensuring clear communication of testing outcomes and facilitating better decision-making.\n- Developed and executed tests for microservices based applications deployed via **Docker**, ensuring continuous integration and smooth operational performance.\n- Participated in regular sprint meetings and retrospectives to ensure testing scope aligned with agile processes and to continuously improve QA methodologies.\n- Leveraged SQL for back-end testing, validating data integrity and accuracy across multiple environments.\n- Pioneered the integration of automated testing for mobile applications using **XCUITest**, and **Espresso**, enhancing mobile QA efforts by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Led the Quality Assurance process for software development in financial platforms with a focus on: \n- Implemented and maintained test automation frameworks using **Playwright**, **Selenium**, and **Cypress** to ensure robust and responsive testing environments.\n- Developed comprehensive test strategies aligned with the Software Testing Life Cycle (STLC) to enhance product quality and accelerate release cycles by **30%**.\n- Collaborated with DevOps to integrate CI/CD processes using **GitHub Actions**, **Azure DevOps**, and **Jenkins**, reducing deployment time by **40%**.\n- Utilized **REST API** testing methodologies to validate API functionalities, achieving a **98%** test coverage on key services.\n- Conducted performance and load testing with **Docker** to simulate real-time transaction scenarios, identifying potential bottlenecks under high-stress conditions.\n- Managed and tracked QA efforts using **Jira**, **Monday**, and **Xray**, ensuring all defects were resolved prior to production deployment.\n- Executed mobile application testing using **Appium**, **XCUITest**, and **Espresso** to ensure seamless user experiences across **iOS (14)** and **Android (11)** platforms.\n- Developed and maintained test documentation using **TestRail**, streamlining knowledge sharing and improving team communication on testing efforts."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **C#** and various testing frameworks like **Selenium**, **Cypress**, and **Playwright** to develop and execute automated test scripts ensuring software quality across different platforms.\nImplemented **REST API** testing procedures, enhancing the STLC by developing comprehensive test cases and scenarios within tools such as **Jira**, **TestRail**, and **Xray** to ensure coverage and traceability of requirements.\nCreated CI/CD pipelines with **GitHub Actions**, **Azure DevOps**, and **Jenkins** to automate testing processes, achieving a **30%** reduction in deployment time and increasing deployment frequency to **20** times per month.\nConducted performance testing utilizing **Docker** containers to simulate real-world scenarios and evaluate application responsiveness under load conditions, achieving a throughput improvement of **15%**.\nExecuted manual and automated tests on mobile applications using **Appium**, **XCUITest**, and **Espresso**, ensuring coverage on **90%** of critical user journeys across both iOS and Android platforms.\nCollaborated cross-functionally with development teams using **Monday** for project management and progress tracking, significantly improving communication and efficiency in test cycles.\nProvided insights and reports on test results and defect metrics, enhancing software development processes based on findings through *metrics-based testing*, which led to a **25%** decrease in post-release defects.\nImplemented code review practices and version control using **Bitbucket** ensuring adherence to coding standards and decreasing defect rates during the initial phases of development.\nParticipated in backlog refinement and sprint planning sessions, establishing test strategies and prioritization to align with key release milestones and customer deliverables."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, C#, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Playwright, Selenium, Cypress, Appium, XCUITest, Espresso\n\n**API Technologies:**\n\tREST API\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, Bitbucket, Jenkins\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, STLC, Jira, Monday, Xray, TestRail",
  "apply_company": "eTeacher Group"
}