{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Fullstack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Fullstack Engineer with 8 years of comprehensive experience, I excel in building high-performance applications using **Java**, **Go**, and modern **JavaScript**/ **TypeScript** frameworks such as **Angular**. I bring extensive knowledge in developing robust solutions leveraging **Docker**, **Kubernetes**, and database management with **Oracle** and **SQL**. My technical skill set includes proficiency in software design and performance testing tools like **JMeter**.\n\nFurthermore, my background includes working with microservices architecture and CI/CD practices, which enables me to deliver secure and scalable applications tailored to meet evolving business needs. I have a solid understanding of networking principles and can integrate cloud services effectively. I pride myself on my capacity to bridge technology and business requirements, ensuring projects are completed with a focus on quality and compliance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Architected and developed scalable, full-stack applications using **Java**, **Go**, **TypeScript**, and modern front-end frameworks including **Angular**, ensuring high-quality software design and performance.\n- Implemented containerization and orchestration solutions using **Docker** and **Kubernetes**, resulting in efficient deployment processes and resource optimization.\n- Collaborated with teams to design RESTful APIs and integrate **Oracle** databases with **PL/SQL** to support robust backend services and seamless data transactions.\n- Developed and maintained software solutions using **Java** on **JBoss** and **Wildfly** application servers, promoting best practices in software design and architecture.\n- Created automated testing frameworks using **JMeter** for performance testing and ensuring application reliability under high load conditions.\n- Employed **SQL** for database management and querying, optimizing data retrieval and storage solutions to handle large-scale applications.\n- Established coding standards and best practices for **JavaScript**, **TypeScript**, and **Angular**, facilitating maintainable and scalable codebases.\n- Provided guidance on systems networking, ensuring robust connectivity and security in multi-tier architectures.\n- Led the development of real-time data processing applications by integrating with tools and technologies aligned with **Jakarta** standards, enhancing overall application efficiency.\n- Conducted design reviews and code audits to ensure adherence to architectural principles and improve software quality."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Docker** and **Kubernetes** for containerization and orchestration, enhancing deployment efficiency and scalability of microservices in large-scale financial applications.\nEngineered robust back-end services in **Java** and **Go**, ensuring high performance and robust architecture adhering to best practices in **Software Design** to support demanding financial workloads.\nDesigned and maintained databases using **Oracle** and **SQL**, optimizing queries and implementing **PL/SQL** procedures for improved data retrieval in transaction processing systems.\nDeveloped interactive front-end applications employing **Angular**, **JavaScript**, and **TypeScript (version 4.4)** for seamless user experiences in financial dashboards, achieving a 30% reduction in page load time.\nImplemented continuous integration and performance testing using **JMeter**, leading to a 25% increase in application stability and decreased deployment time.\nCollaborated in a cross-functional team to leverage networking principles and **JBoss/Wildfly** for enhancing middleware solutions, facilitating better communication between microservices.\nExecuted best practices in software engineering and agile methodologies, leading to an overall project delivery improvement by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized fullstack applications aligning with software design principles and methodologies, utilizing **Java** and **Go** for robust backend service implementation.\nDesigned and deployed scalable microservices architecture using **Kubernetes** and **Docker**, achieving a **99.9% uptime** and facilitating efficient scaling across multiple services.\nCreated and maintained APIs adhering to RESTful standards, integrating with **Oracle** databases and employing **PL/SQL** for advanced data interactions and manipulations, guaranteeing **data integrity and accessibility** for high-volume systems.\nUtilized **Angular** and **Typescript** for frontend development, ensuring cross-platform support and delivering a seamless user experience with a target load time of under **2 seconds**.\nConducted load testing and performance optimization using **JMeter**, achieving significant improvements in response times during peak traffic periods, underscoring the application’s reliability and efficiency.\nImplemented CI/CD pipelines incorporating versions like **1.0** and configurations for automated deployment cycles, drastically reducing rollout times by **50%**.\nApplied advanced networking techniques to enhance inter-service communication, ensuring low latency and high throughput in data exchange across backend services.\nMaintained compliance with security standards, utilizing role-based access control (RBAC) and best practices in **Java** and **Javascript** to protect sensitive data and user credentials.\nCollaborated with cross-functional teams to refine software design processes, contributing to a cohesive development strategy that aligns with business objectives."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Java, Go, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, JBoss, Jakarta, Wildfly\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Oracle, SQL, PL/SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Helm, Terraform, Ansible, Docker Compose, JMeter\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Networking, Software Design",
  "apply_company": "Dedalus"
}