{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Test Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a seasoned Senior Test Engineer with 8+ years of experience, I specialize in **test planning**, **test case design**, and **manual testing** within Agile and Scrum environments. Proficient in **Azure DevOps** and various **test management tools**, I ensure high-quality software delivery through rigorous **defect tracking** and comprehensive computer system validation processes. My technical background as a Senior Python Full Stack Developer has equipped me with skills in **FastAPI**, **Django**, **Flask**, **Angular**, **Vue**, **React**, and **Next.js**, alongside cloud service expertise in **AWS** and **Azure**. This unique blend of testing and software development enhances my ability to contribute to enterprise-grade solutions in e-commerce, financial, and healthcare sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Test Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Conducted manual testing, ensuring thorough coverage of healthcare applications and Python microservices to validate functionality and performance.\n- Developed comprehensive test plans and designed test cases for automated and manual testing using tools integrated with **Azure DevOps**.\n- Managed defect tracking processes to maintain high-quality standards in accordance with Agile and Scrum methodologies, improving release cycles by **30%**.\n- Collaborated with cross-functional teams of developers and product owners to ensure test case designs effectively addressed user stories and acceptance criteria.\n- Ensured computer system validation protocols are met through rigorous testing procedures, maintaining compliance with industry standards like HIPAA and SOC 2.\n- Implemented test management tools for documenting and tracking tests and results, leading to improved test coverage and defect identification by **25%**.\n- Designed and executed validation strategies for **cloud-native** applications, leveraging experience with **Azure** services to align testing with deployment workflows.\n- Participated in Agile ceremonies, promoting continuous integration and delivery of features using **CI/CD pipelines** on platforms like **GitHub Actions** and **Azure DevOps**.\n- Actively contributed to improving testing processes and toolsets by mentoring junior engineers in best practices for test case design and execution.\n- Supported coverage of multiple environments by configuring quality assurance processes, ensuring seamless integration between **Azure**, **Kubernetes**, and Python deployments.\n- Championed the enhancement of testing efficiency through the adoption of automated testing frameworks and tools **(e.g., PyTest, Selenium)**, resulting in **40% faster** test cycles.\n- Executed test case scenarios focused on ensuring the reliability and performance of healthcare experiences, contributing to regulatory compliance and improving user satisfaction ratings by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Developed comprehensive **test plans** and **test cases** for validating backend services, ensuring robust performance through methodologies such as **Agile** and **Scrum**.\n- Conducted **manual testing** for APIs and microservices built using **Python** (FastAPI, Django, Flask), enhancing overall product quality by identifying defects early in the development lifecycle.\n- Collaborated with development teams to ensure **defect tracking** and management through tools like **Azure DevOps**, improving resolution timelines by **30%**.\n- Designed and executed **computer system validation** processes, ensuring compliance with financial regulations and enhancing overall software assurance.\n- Utilized various **test management tools** to maintain organized records of testing efforts and progress towards meeting milestones.\n- Improved testing efficiency by implementing automated tests in **Python**, integrating with CI/CD pipelines via **Azure DevOps** and **GitHub Actions**.\n- Conducted real-time **test case design** for RESTful and gRPC APIs, optimizing performance validation frameworks for high-throughput financial applications.\n- Engaged in continuous feedback cycles with cross-functional teams to iterate on **test plans** and enhance clarity in the **Agile** framework, promoting team alignment.\n- Leveraged insights from **computer software assurance** practices to refine testing strategies, resulting in a **20%** reduction in post-release defects.\n- Championed best practices for **defect tracking**, ensuring all issues were logged in a consistent manner, facilitating effective communication with stakeholders across teams.\n- Trained junior team members on comprehensive testing techniques and effective use of **test management tools**, fostering a culture of quality within the organization."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Developed and executed detailed **test plans** to ensure comprehensive coverage of system functionalities, aligning with **Agile** methodologies and best practices.\n- Designed effective **test cases** for manual testing, focusing on core functionalities to support the overall system validation process while leveraging **defect tracking tools** to document issues.\n- Collaborated with cross-functional teams using **Azure DevOps** to streamline test management and track progress, improving team efficiency by **20%**.\n- Executed rigorous manual tests across various modules in compliance with **computer software assurance** standards, contributing to a **30%** reduction in production defects during quarterly releases.\n- Conducted continuous **defect tracking** and reporting, ensuring timely resolution of all discovered issues to enhance product reliability.\n- Led weekly status meetings to facilitate communication among team members and ensure alignment on testing objectives within the **Scrum** framework.\n- Assisted in the validation of critical computer systems using structured methodologies to ensure compliance with industry standards and regulatory requirements.\n- Participated in **Agile** ceremonies (sprint planning, reviews) to align testing strategies with project goals, promoting a proactive approach to quality assurance.\n- Implemented improvements in **test management tools** workflows, enhancing visibility and traceability of test results and defect information.\n- Fostered a culture of quality by mentoring junior team members in **test case design** and best practices in manual testing, contributing to team skill development.\n- Contributed to the **Azure DevOps** configuration to automate aspects of the testing process, resulting in a **15%** increase in test execution efficiency.\n- Supported build validation processes through manual and automated testing, ensuring the seamless integration of new features into the existing codebase and maintaining software reliability."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Nginx, Certbot\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, manual testing, test planning, test case design, defect tracking, test management tools, computer system validation, computer software assurance, Agile, Scrum",
  "apply_company": "Triumph Research Intelligence"
}