{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Web Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a skilled Senior Web Frontend Engineer with 8 years of experience, I excel in utilizing **React.js**, **TypeScript**, and **MobX** to develop high-performance, responsive web applications. My background in frontend architecture and performance optimization positions me to enhance user experiences while ensuring efficient application functionality. I thrive in collaborative environments, bringing strong communication skills and autonomy to the team, driven by a pragmatic approach to problem-solving. \nAdditionally, my technical expertise includes **Python**, **Flutter**, **Next.js**, **Vue**, and deep familiarity with cloud services such as **Azure** and **AWS**. I have a proven track record in developing enterprise-grade platforms that leverage AI-based tooling for intelligent automation and real-time data processing, as well as integrating compliance standards like HIPAA and PCI DSS. My hands-on experience extends to building robust microservices architectures, event-driven systems, and CI/CD automation workflows.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed scalable and high-performance web applications using **React.js** and **TypeScript**, optimizing frontend performance through strategic architecture and MobX for state management.\n- Collaborated effectively with cross-functional teams, fostering clear communication to align project goals and drive autonomy in achieving deliverables.\n- Designed and implemented advanced AI-based tooling, enhancing user experience with personalized features and predictive analytics, contributing to the innovation of web frontend solutions.\n- Led the optimization of frontend architectures for seamless integration with backend services and improved loading times, achieving up to **40%** faster response rates in applications.\n- Established a strong collaboration framework with UX/UI designers to ensure frontend responsiveness and usability across devices, achieving an improved user satisfaction score of **85%**.\n- Delivered comprehensive documentation and conducted knowledge-sharing sessions, enhancing team understanding and operational pragmatism in frontend development processes.\n- Employed testing strategies using tools such as Jest and Cypress to ensure frontend reliability and performance, achieving a test coverage rate of over **90%**.\n- Implemented innovative MobX solutions, focusing on reducing state management complexity and improving scalability for multi-module applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed dynamic, user-focused front-end applications employing **React.js** (18), **TypeScript**, and **MobX**, optimizing performance and enhancing responsiveness for financial dashboards and admin portals.\n- Applied strong collaboration and communication skills to effectively work within cross-functional teams, ensuring seamless integration between frontend architecture and backend services.\n- Executed frontend performance optimization strategies, resulting in a **30% reduction** in loading times and improved user satisfaction metrics.\n- Led the adoption of **AI-based tooling** in frontend development, enhancing features with predictive insights and improved user interactions.\n- Demonstrated autonomy in project management, overseeing the complete lifecycle of applications from concept through to deployment, consistently meeting project deadlines.\n- Implemented pragmatic approaches to problem-solving, particularly in the area of frontend architecture, ensuring maintainability and scalability of applications.\n- Championed best practices in frontend development, mentoring junior developers and sharing insights on the latest trends in **React.js** and related technologies."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized user interfaces leveraging **React.js** to create fast, responsive, and dynamic applications that enhance user engagement and satisfaction.\nImplemented effective **Frontend architecture** using **TypeScript** for type safety and maintainability, ensuring high-quality code across all projects.\nEnhanced application performance through **Frontend performance optimization** techniques, achieving a **20%** reduction in load times across key components.\nCollaborated effectively with cross-functional teams to drive successful project outcomes, demonstrating strong **collaboration skills** and ensuring alignment across development and design phases.\nCommunicated project milestones and challenges transparently, showcasing excellent **communication skills** to facilitate smooth workflow and stakeholder engagement.\nWorked with **AI-based tooling** to enhance user experiences by personalizing interfaces based on user behavior and preferences, leading to a **15%** increase in user retention rates.\nExercised autonomy in decision-making processes and demonstrated **pragmatism** through evaluating project requirements and adapting to evolving priorities in a fast-paced environment.\nUtilized **MobX** for state management, streamlining application interactions and ensuring data consistency across complex UI components.\nConceived and delivered innovative UI solutions by integrating the latest web technologies, contributing to business objectives and elevating overall user experience."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, React.js, MobX\n\n **API Technologies:**\n\tNone\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tNone\n\n **Other:**\n\tAI-based tooling, Frontend architecture, Frontend performance optimization, Collaboration skills, Communication skills, Autonomy, Pragmatism"
}