{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Fullstack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Fullstack Engineer with over 10 years of experience in delivering high-performance software solutions, specializing in **TypeScript**, **JavaScript**, **React**, and **Angular**. Expert in **microservices** architecture, **CI/CD** processes, and **performance optimization**, with a proven track record of building scalable applications that utilize design patterns and software architecture principles. Adept at developing cloud-native solutions and deploying containers in distributed systems environments.\n\nDemonstrated success in leading cross-functional teams to ensure collaboration and communication throughout the software development lifecycle. Experienced in employing developer tools and IDEs to enhance debugging and monitoring capabilities for improved system performance. Passionate about leveraging innovative technologies to drive real-world impact while ensuring applications meet stringent compliance standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and delivered scalable, full-stack solutions utilizing **TypeScript**, **JavaScript**, and frameworks such as **React** (17–18) and **Angular**, effectively addressing software architecture and design patterns in diverse industry sectors, including healthcare and finance, while ensuring robust performance and optimization.\n•\tArchitected microservices using **Docker**, enhancing system scalability and reliability, thereby reducing deployment times by up to **50%** through effective CI/CD practices with tools like **GitHub Actions** and **Azure DevOps**.\n•\tImplemented a comprehensive monitoring system across services to ensure high availability, utilizing **performance optimization** techniques to achieve a **99.9%** uptime across distributed systems.\n•\tSpearheaded the evolution of traditional applications to microservices architectures, emphasizing the importance of **containers** for continuous integration and delivery, leading to a **30%** reduction in development cycle times.\n•\tCollaborated with cross-functional teams to leverage **developer tools** and IDEs, ensuring efficient code reviews and project management, improving cross-team collaboration and communication by **40%**.\n•\tBuilt and deployed cross-platform mobile applications with **Flutter** and **React Native**, achieving consistent user experiences across **iOS** and **Android** platforms, with a **20%** increase in user engagement.\n•\tEstablished testing strategies using **Jest**, **Cypress**, and **PyTest**, ensuring robust testing frameworks that covered unit, integration, and E2E testing, which resulted in a **25%** reduction in defect rates in production.\n•\tIntegrated advanced debugging tools to enhance code quality and performance, ensuring that software meets rigorous scalability standards and addresses critical bugs promptly.\n•\tOptimized distributed systems for high performance and allocation efficiency, utilizing cloud services like **AWS** and **Azure**, leveraging best practices in software architecture to facilitate seamless deployment.\n•\tDesigned and maintained data structures and APIs that integrate seamlessly with front- and back-end environments, supporting the needs of diverse stakeholders and enhancing the overall user experience."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Focused on software architecture and design patterns by leading the development and modernization of financial platforms using a microservices-based architecture and **Node.js** (NestJS/Express) alongside **Python** (FastAPI, Django), achieving a **40%** improvement in scalability and maintainability for high-volume transaction systems.\nUtilized **TypeScript** to build dynamic, user-focused front-end applications with **React** (18), **Vue 3**, **Next.js**, and enhancing UI responsiveness by employing **Redux Toolkit** and **Tailwind CSS**, resulting in a **30%** increase in user engagement on financial dashboards and admin portals.\nImplemented strong performance monitoring and optimization strategies to develop real-time transaction monitoring dashboards with **React**, **D3.js**, and **Power BI Embedded**, enabling operations teams to track **1M+** transactions daily, detect anomalies, and generate actionable insights for compliance.\nIntegrated messaging systems such as **Kafka**, **RabbitMQ**, and **Azure Service Bus** to establish a robust event-driven architecture, significantly enhancing the throughput of asynchronous communications and real-time event processing for **100,000+** transactions per minute.\nOrchestrated ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory**, improving the efficiency of both batch and real-time data ingestion processes from internal systems and **10+** third-party sources.\nDeveloped AI/ML-powered fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, effectively analyzing transaction patterns to proactively flag suspicious activities, reducing fraud incidents by **25%** in banking systems.\nCreated machine learning pipelines for credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, integrating model inference into backend services for real-time decision-making, leading to a **15%** increase in approval rates for credit applications."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Designed and implemented scalable **microservices** architecture for a global e-commerce platform, ensuring high availability and performance optimization across checkout, cart, and order fulfillment modules.\n\nUtilized **TypeScript** and **JavaScript** for developing responsive frontend applications with frameworks such as **React** (18) and **Angular**, enhancing user interfaces for improved customer engagement and accessibility compliance.\n\nEngineered backend services with **Python** (Django, FastAPI) and **Node.js** (NestJS, Express), ensuring low latency and efficient data handling in a **distributed systems** environment.\n\nOptimized application performance through effective caching strategies using **Redis**, resulting in a **30%** increase in UI responsiveness and reduced database load.\n\nLeveraged **CI/CD** pipelines for seamless deployment processes, ensuring continuous delivery of high-quality code updates with minimal downtime.\n\nImplemented robust monitoring solutions to maintain performance metrics, ensuring the platform operates under desired thresholds and supports **1M+** daily active users.\n\nDeveloped secure payment workflows integrated with third-party services such as **Stripe**, **PayPal**, and **Razorpay**, applying PCI-compliance best practices for data security.\n\nCollaborated with cross-functional teams to define design patterns and architectural strategies that align with business objectives, enhancing team communication and project visibility.\n\nEmploying **design patterns**, contributed to code maintainability and scalability, facilitating future feature enhancements while maintaining development velocity.\n\nParticipated in regular code reviews, fostering a culture of feedback and continuous learning among team members, leading to a **20%** reduction in bugs during production releases.\n\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OIDC, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tsoftware architecture, design patterns, scalability, microservices, containers, monitoring, distributed systems, developer tools, IDEs, performance optimization, debugging, collaboration, communication, continuous delivery",
  "apply_company": "OutSystems"
}