{
  "name": "Tomasz Lee",
  "role_name": "Senior Consultant Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Consultant Engineer with over 9 years of experience in developing and implementing innovative solutions using **Python**, **C#**, **C++**, and **VB.Net**. Proficient in advanced data modeling and analytics with expertise in **PowerBI**, and strong knowledge of AI and ML applications. Demonstrated ability to manage projects, optimize processes, and leverage tools such as **Aspen Plus**, **Aspen HYSYS**, and **Aspen OnLine** to enhance performance and efficiency. Exceptional communicative and analytical skills, with a proven track record in leading cross-functional teams and delivering robust engineering solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Consultant Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python**, **C#**, and **C++** for advanced data modeling and simulation in design protocols, enhancing project efficiency across 9 major engineering projects.\nConducted data analysis and model validation using **ASPEN Plus** and **ASPEN HYSYS**, achieving a 30% increase in accuracy for predictive modeling outcomes.\nImplemented AI and ML techniques to optimize project workflows and improve data insights, resulting in a 25% reduction in project turnaround time.\nDeveloped and managed digital twin simulations, enhancing project visualization and facilitating effective stakeholder engagement.\nCreated and presented analytical reports using **PowerBI**, delivering actionable insights to project teams and clients, which improved decision-making speed by 40%.\nCollaborated with cross-functional teams, showcasing strong communication and project management skills, leading to the successful delivery of 5 critical projects ahead of deadlines.\nIntegrated **ASPEN OnLine** for real-time monitoring and performance assessments, improving operational efficiency by 20%.\nLed training sessions on digital tools and simulation software for junior engineers, fostering knowledge sharing and team capacity building.\nLeveraged strong analytical skills to troubleshoot and resolve project issues swiftly, maintaining project momentum and client satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed AI-driven insights for project management enhancement using **Python** and **PowerBI**, leading to a significant boost in decision-making effectiveness.\n• Designed and implemented data modeling solutions to accurately represent project workflows, improving overall project clarity and communication.\n• Leveraged **C#**, **C++**, and **VB.Net** for software development to create efficient and maintainable codebases, enhancing application performance and reliability.\n• Conducted advanced data analysis and predictive modeling to optimize project outcomes, utilizing AI and ML techniques for future forecasting.\n• Managed multi-faceted projects utilizing **Aspen Plus**, **Aspen HYSYS**, and **Aspen OnLine** for simulation and analysis, ensuring alignment with project goals and timelines.\n• Coordinated closely with cross-functional teams to communicate system requirements effectively, leading to a 30% reduction in project delivery time.\n• Led the integration of digital twin technology into project processes, optimizing resource management and project visibility.\n• Provided mentorship and technical guidance to junior team members, enhancing team skills and overall productivity.\n• Achieved a 20% improvement in project delivery efficiency through rigorous project management methodologies and tools.\n• Demonstrated strong analytical skills by interpreting complex data sets to identify trends and actionable insights for stakeholders."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **C#** to develop advanced modeling features for process simulations, optimizing operational efficiency by 15%.\nImplemented **Data Modeling** techniques to enhance data analysis and reporting capabilities, using tools like **PowerBI** for visualization.\nHarnessed AI and ML algorithms to drive predictive analytics in simulation processes, leading to a 25% improvement in forecasting accuracy.\nLeveraged **Aspen HYSYS** to conduct process simulations, addressing complex engineering challenges effectively.\nDeveloped integration solutions with **Aspen OnLine**, resulting in a streamlined data flow and improved project communication.\nManaged several large-scale projects, successfully delivering results within budget and timeline constraints, including a **$500,000** project focused on digital transformation.\nFacilitated project management activities that enhanced team collaboration and communication, resulting in a 30% reduction in project turnaround time.\nCreated comprehensive technical documentation and user guides for all developed systems, ensuring clarity and accessibility for future users.\nEngaged in continuous learning to remain current with industry trends and technologies in process engineering, particularly in the areas of **AI**, **ML**, and digital twin technologies.\nParticipated in code reviews and knowledge-sharing sessions, fostering a culture of best practices and continuous improvement within the engineering team."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, C#, C++, VB.Net\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\t\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Aspen Plus, Aspen HYSYS, Aspen OnLine, AI, ML, Data Modeling, APC, PowerBI, Digital Twin, Project Management, Communication, Analytical Skills",
  "apply_company": "Aspen Technology"
}