{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior FullStack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Full Stack Engineer with 8 years of experience, I excel in **TypeScript**, **Docker**, **CI/CD**, and building **RESTful APIs** in high-performance environments. Proficient in the **AWS** cloud ecosystem, I specialize in modern front-end frameworks such as **React**, **Next.js**, and state management tools like **Redux Toolkit** and **Zustand**. My back-end expertise includes **Node.js** and database management with **PostgreSQL** and **Prisma**. I am well-versed in integrating **LLM** technologies, specifically using **OpenAI**, **LangChain**, **PGVector**, and **Pinecone** for intelligent data solutions.\n\nThroughout my career, I have developed enterprise-grade platforms in healthcare and financial sectors, creating robust applications aligned with compliance standards including HIPAA and PCI DSS. My extensive use of microservices architecture, event-driven systems, and automation in CI/CD ensures the delivery of secure and scalable solutions. Additionally, I possess hands-on experience in crafting machine learning pipelines and implementing MLOps workflows using tools like MLflow and Airflow.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** and **Node.js** to architect and develop full-stack applications, enhancing performance and user experience for enterprise-level projects in healthcare and finance.\nImplemented robust CI/CD pipelines using **Docker** and leading tools such as **GitHub Actions** and **Azure DevOps**, achieving 90% automation in deployment processes across environments.\nDesigned and integrated **RESTful APIs** for seamless data interaction and management among microservices, ensuring compliance with industry standards such as HIPAA and PCI DSS.\nLeveraged **React** (17-18) and **Next.js** frameworks to create responsive and dynamic user interfaces, contributing to a 40% increase in user engagement and satisfaction.\nManaged data persistency and retrieval using **PostgreSQL** and **Prisma**, optimizing database queries leading to 50% faster data access times.\nDeveloped state management solutions with **Redux Toolkit** and **React Query** to handle complex application states efficiently, improving data handling by 30%.\nCollaborated in cross-team efforts to enhance application features using **CI/CD** methodologies, leading to a 25% reduction in development cycle time.\nIncorporated advanced AI features and integrations using **OpenAI** and **LangChain** for intelligent data processing and recommendations, facilitating personalized user experiences.\nDelivered high-performance cloud-native solutions utilizing **AWS**, allowing for scalable application deployment and management across multiple services.\nEngaged in continuous collaboration with product teams to define technical specifications and user needs, resulting in successful on-time project deliveries for more than 15 applications over the last year.\nIntegrated testing frameworks like Jest and Cypress to safeguard application quality standards, covering 90% of the codebase in unit and E2E test cases.\nUtilized analytics and monitoring tools to assess application performance, enabling timely optimizations and a 24/7 operational readiness across services."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed scalable and maintainable full-stack applications utilizing **Node.js (NestJS/Express)** and **TypeScript**, implementing **RESTful APIs** to enhance system performance and user experience.\nCreated interactive, dynamic front-end applications with **React (18)** and **Next.js**, utilizing **Redux Toolkit** for state management and **Tailwind CSS** for responsive design, resulting in improved user engagement and satisfaction.\nDesigned and built CI/CD pipelines leveraging **Docker** and cloud platforms such as **AWS**, streamlining deployment processes and reducing time to production by **30%**.\nImplemented real-time data handling features using **React Query** and **Zustand** to manage server state efficiently, enhancing application responsiveness and usability in financial reporting dashboards.\nUtilized **PostgreSQL** and **Prisma** for robust database interactions, ensuring data integrity and enabling efficient query execution for large datasets by optimizing query performance by **25%**.\nIntegrated event-driven architecture employing **Kafka**, **RabbitMQ**, and **Azure Service Bus** to enhance transaction processing, supporting real-time alerts and compliance checks.\nApplied machine learning methodologies leveraging **OpenAI**, **LangChain**, and **scikit-learn** for enhancing fraud detection capabilities and driving predictive analytics solutions, leading to a **40%** reduction in false positives.\nParticipated in code reviews and knowledge sharing sessions, fostering team collaboration and adherence to best practices in software development, contributing to an improved code quality score of **90%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **TypeScript** and **Node.js** to develop and optimize **RESTful APIs**, ensuring robust communication between frontend and backend for high-traffic applications with **99.9%** uptime.\nUtilized **React** (18) along with **Next.js** and **React Query** to create dynamic, user-centric interfaces, achieving a **25%** improvement in user engagement metrics through responsive design and efficient state management using **Redux Toolkit**.\nImplemented **Docker** for containerization, streamlining development processes and enhancing deployment efficiency, resulting in a **40%** reduction in onboarding time for new developers.\nDesigned CI/CD pipelines leveraging **AWS** services, enabling automated testing and deployment processes leading to faster release cycles with improved code quality.\nEmployed **PostgreSQL** with **Prisma** for managing relational data, optimizing queries to achieve an average response time of under **200ms** for key application features.\nIntegrated **LLM** and **OpenAI** technologies to develop intelligent features, enhancing user experiences through personalized content and recommendations based on user behavior.\nUtilized cloud-native technologies, including **AWS**, to enhance application scalability and reliability, resulting in a capacity to handle **10,000** concurrent users without performance degradation.\nDeveloped and maintained Docker-based development environments, facilitating consistent setups that decreased the occurrence of environment-specific bugs.\nApplied real-time state management with **Zustand**, enabling seamless updates to UI in response to user actions, enhancing product interaction during high traffic bursts.\nEnsured best practices in security through implementation of RBAC and OAuth 2.0, achieving full compliance with GDPR data protection regulations."
    }
  ],
  "skills": "  **Programming Languages:**\n\tTypeScript, Python, JavaScript\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n  **Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, React Query, Zustand, Redux Toolkit\n\n  **API Technologies:**\n\tRESTful APIs\n\n  **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n  **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Prisma, PGVector, Pinecone\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n  **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n  **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, LLM, OpenAI, LangChain, Mastra",
  "apply_company": "Akveo"
}