{
  "name": "Tomasz Lee",
  "role_name": "Senior AI Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior AI Engineer with 9+ years of experience specializing in Machine Learning, Big Data, and Cloud Services. Proficient in **Python**, **C#**, and **C++**, with a strong focus on developing and deploying data pipelines and ETL processes. Hands-on expertise in cloud platforms such as **AWS** and **Azure**, and familiarity with modern orchestration tools like **Docker** and **Kubernetes**. Skilled in applying advanced algorithms using frameworks like **TensorFlow**, **PyTorch**, and **scikit-learn** to solve complex problems in computer vision and AI. Adept at utilizing big data technologies like **Hadoop** and **Spark**, and database management with **SQL** and **NoSQL** to drive data-driven decision-making. Consistently delivers robust, efficient solutions while collaborating effectively across multidisciplinary teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **C#** for the development of scalable machine learning models and algorithms to enhance the performance of AI-driven applications.\nImplemented **Cloud Services** on **AWS** and **Azure** for deploying machine learning solutions, improving scalability by **50%**.\nDesigned and maintained data pipelines using **ETL** processes to efficiently manage and process large datasets, reducing data retrieval times by **30%**.\nDeveloped and integrated **Big Data** technologies such as **Hadoop** and **Spark** for processing and analyzing vast amounts of data, improving insights generation.\nLeveraged **Docker** and **Kubernetes** for containerization and orchestration of AI models, streamlining deployment processes by **25%**.\nApplied **Machine Learning** techniques using **TensorFlow**, **PyTorch**, and **scikit-learn** to build predictive models, achieving accuracy improvements of over **20%**.\nOptimized and implemented **Computer Vision** solutions, enhancing image processing speed and accuracy through **CUDA**.\nCollaborated with cross-functional teams to integrate AI models into existing applications, ensuring seamless functionality and user experience.\nDeveloped and maintained **NoSQL** and **SQL** databases for efficient data storage and retrieval, reducing latency by **15%**.\nConducted performance evaluations and tuning of machine learning models, utilizing **MLflow** and **Kubeflow** for model management and deployment."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "● Developed scalable data pipelines and ETL processes using **Python** and **AWS** services, achieving a performance improvement of **40%** in data processing time.\n● Implemented machine learning models using **TensorFlow** and **PyTorch**, enhancing predictive analytics capabilities across various applications by **30%**.\n● Managed databases including **SQL**, **NoSQL**, and **BigQuery**, optimizing data storage and retrieval techniques for large datasets, resulting in a **20%** increase in query efficiency.\n● Built and deployed containerized applications with **Docker** and orchestrated deployments using **Kubernetes**, improving application availability and deployment speed.\n● Leveraged **Hadoop** and **Spark** frameworks for handling big data workloads, successfully processing datasets over **1TB**.\n● Designed and executed cloud-based solutions on **Azure** to facilitate MLOps practices, reducing model deployment times by **25%**.\n● Collaborated with cross-functional teams to gather requirements and define architecture for AI solutions, ensuring project alignment with business goals.\n● Conducted code quality assessments and provided mentorship on best practices for junior team members, elevating overall team skill level.\n● Developed RESTful services for data access, integrating with various databases using **C#** and creating seamless data experiences.\n● Championed the adoption of data visualization tools with **D3.js**, enabling stakeholders to interpret project status and performance effectively."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and optimized data pipelines using **Python** and **PyTorch**, enabling efficient processing of large datasets and improving model training time by **30%**.\n• Designed and implemented machine learning models within **AWS** and **Azure** environments, leveraging technologies such as **TensorFlow** and **scikit-learn** to enhance predictive accuracy by **25%**.\n• Collaborated cross-functionally to integrate AI solutions with existing systems, utilizing **SQL** for data extraction and management.\n• Implemented ETL processes for ingesting and transforming data from various sources into structured formats, decreasing data processing time by **40%**.\n• Utilized **Docker** and **Kubernetes** for containerization and orchestration of machine learning applications, ensuring scalability and reliability in cloud environments.\n• Assisted in migrating legacy systems to cloud-based architecture, enhancing performance and accessibility, reducing operational costs by **15%**.\n• Developed technical documentation for machine learning workflows and AI-driven applications, facilitating knowledge transfer within the team.\n• Participated in code reviews and agile ceremonies to uphold coding standards and ensure project alignment with strategic goals."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, C#, C++, JavaScript, TypeScript\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure, Cloud Services\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL, NoSQL, Elasticsearch, BigQuery\n\n  **DevOps**\n\tCI/CD pipelines, Docker, Kubernetes\n\n  **Cloud & Infrastructure**\n\tMachine Learning, Big Data, Data Pipelines, ETL, MLOps, Hadoop, Spark, Computer Vision, CUDA, TensorFlow, PyTorch, scikit-learn, MLflow, Kubeflow\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Testing Tools, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis",
  "apply_company": "Imnoo"
}