{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Staff Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As a dedicated Staff Software Engineer with 8 years of experience, I excel in **AI**, **Machine Learning**, and **Data Analysis** to drive product development and innovation. My strong technical expertise in **Java**, combined with proficiency in clean and scalable code practices, ensures the creation of high-quality solutions. I have a proven track record collaborating with cross-functional teams to enhance overall project outcomes. Additionally, I possess experience with analytics tools such as **Amplitude** and **Looker**, alongside advanced skills in **Excel** for effective data-driven decision-making.\n\nLeveraging my full stack development skills across **JavaScript**, **Python**, and **Flutter**, I have successfully built robust solutions in the healthcare and financial sectors, utilizing frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. With extensive cloud experience on **Azure** and **AWS**, I develop enterprise-grade platforms that integrate predictive analytics and intelligent automation. My foundation in microservices architecture and CI/CD automation further allows me to deliver secure applications compliant with industry standards such as HIPAA and PCI DSS, all while coaching and mentoring junior developers.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Staff Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable product innovation strategies leveraging **Java** to create clean, maintainable code for financial and healthcare applications.\n• Integrated AI and machine learning capabilities for enhanced data analysis, resulting in improved patient risk predictions and financial fraud detection.\n• Collaborated with cross-functional teams to foster collaboration and mentorship, enhancing overall product development processes and team performance.\n• Utilized powerful data visualization tools such as **Looker** and **Amplitude** to deliver actionable insights into business performance and user interaction.\n• Implemented effective coaching techniques to support junior developers, guiding them in adopting best practices in scalable coding and product development.\n• Applied thorough data analysis practices to identify trends and optimize application performance, achieving a **50% reduction** in average load times.\n• Introduced Agile methodologies to streamline project management and collaboration, resulting in a **30% increase** in project delivery speed.\n• Championed clean code principles across development teams, ensuring high code quality and maintainability standards were adhered to.\n• Spearheaded product development initiatives that enhanced user experience and operational efficiency, contributing to a **20% increase** in user engagement metrics."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Spearheaded product innovation and development by leveraging **Java** to design scalable code solutions, enhancing system performance for financial platforms.\n- Utilized AI and Machine Learning techniques to implement advanced data analysis features, enhancing the fraud detection capabilities of banking systems with precision metrics.\n- Conducted rigorous data analysis using **Amplitude**, **Looker**, and **Excel**, generating actionable insights that transformed financial operations and reporting processes.\n- Fostered collaboration among cross-functional teams to ensure the implementation of clean code principles, enhancing maintainability and reducing technical debt by **30%**.\n- Mentored junior developers, reinforcing best practices in product development and clean code philosophies to elevate team competency and productivity.\n- Orchestrated end-to-end development and monitoring of financial applications, driving product innovations that increased user engagement by **25%** year-on-year.\n- Championed the designs of user-friendly interfaces utilizing **React (18)**, **Vue 3**, and **Next.js**, streamlining admin portal functionalities and optimizing user experience.\n- Drove the integration of machine learning models for credit scoring and churn prediction using **MLflow** and **Airflow**, achieving a **20%** improvement in prediction accuracy.\n- Developed and maintained robust ETL pipelines using **Apache Airflow** and **Azure Data Factory**, enabling seamless data flow and processing from various internal and third-party data sources."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Engineered scalable and efficient backend solutions leveraging **Java** to enhance product innovation and functionality.\nImplemented AI/ML models for data analysis and customer insights, driving product development through actionable intelligence and personalized user experiences.\nCollaborated cross-functionally with product teams to integrate analytics tools such as **Amplitude** and **Looker**, promoting data-driven decision-making and enhancing overall system performance.\nUtilized **Excel** for detailed analysis of system performance metrics and reporting, ensuring continuous improvement and optimal resource allocation.\nCoached and mentored team members on clean code practices and scalable code design, fostering a culture of collaboration and technical excellence.\nDesigned and executed rigorous testing frameworks using tools that enhance quality assurance in product development cycles.\nLed initiatives for continuous integration/continuous deployment (CI/CD) practices, ensuring streamlined updates and minimal downtime with effective collaboration across teams.\nCultivated a mentorship program within the development team, promoting professional growth and technical skill enhancement for junior developers.\nProduced comprehensive documentation for system architecture and design patterns, ensuring easy onboarding for new team members and maintaining project clarity and alignment.\nFostered a results-oriented environment through regular feedback sessions and performance evaluations, driving successful project completions and team morale."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak, Let’s Encrypt, Nginx, Certbot\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tInfrastructure as Code\n\n **Other:**\n\tArtificial Intelligence, Machine Learning, Data Analysis, Amplitude, Looker, Excel, Collaboration, Clean Code, Scalable Code, Product Development, Product Innovation, Coaching, Mentorship"
}