{
  "name": "Rei Taro",
  "role_name": "Senior PHP Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior PHP Engineer with over 10 years of experience in building and optimizing high-performing backend systems. Proficient in **PHP**, **Symfony**, and relational databases such as **MySQL** and **PostgreSQL**. Demonstrated expertise in developing RESTful APIs and utilizing **JSON** for data interchange. Skilled in **Git** for version control and implementing **CI/CD** pipelines for rapid deployment. Familiar with **Docker** for containerization and cloud technologies for scalable solutions. Strong background in e-commerce platforms like **Shopify**, **Shopware**, and **WooCommerce**, focusing on performance optimization. A collaborative team player who thrives in **Agile** and **Scrum** environments, with a proven track record of contributing to successful projects at leading organizations.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered backend services in **PHP** using **Symfony** to enhance document automation, user onboarding, and reporting workflows.\nDeveloped RESTful APIs with **MySQL** and **PostgreSQL** to manage data transactions efficiently, ensuring compliance with regulatory standards.\nImplemented CI/CD pipelines using **Git** and **Docker** for streamlined deployment processes, reducing deployment times by **30%**.\nOptimized application performance by analyzing database queries and implementing caching strategies, achieving a **25%** improvement in response times.\nCollaborated with cross-functional teams using **Agile** and **Scrum** methodologies to address system integration challenges and oversee release strategies.\nUtilized **JSON** for efficient data interchange between services, ensuring seamless communication across platforms.\nConducted code reviews and maintained high-quality standards in delivery, improving overall team productivity by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed backend systems in **PHP** using **Symfony** to automate document workflows, streamline user onboarding, and handle complex reporting processes effectively.\nCreated RESTful APIs utilizing **MySQL** and **PostgreSQL** for robust database management and data integrity.\nImplemented CI/CD pipelines with **Git** and **Docker** to ensure seamless code delivery and integrated testing across environments.\nOptimized performance of web applications, achieving up to **30%** faster response times through code refactoring and best practices.\nManaged cloud-based solutions with experience in platforms such as **Shopify**, **Shopware**, and **WooCommerce** to enhance e-commerce capabilities.\nApplied Agile methodologies and actively participated in **Scrum** ceremonies to ensure on-time delivery and alignment with project goals.\nCollaborated with cross-functional teams to troubleshoot and improve the software development lifecycle, ensuring compliance with industry standards and successful release management."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed robust backend services for trade execution and portfolio management using **PHP** and **Symfony** to enhance trading operations.\n• Designed and maintained efficient database systems with **MySQL** and **PostgreSQL**, ensuring seamless account tracking.\n• Implemented RESTful APIs to deliver high-performance data exchange in **JSON**, enabling effective communication between frontend and backend systems.\n• Collaborated with cross-functional teams in an **Agile** environment, focusing on **Scrum** methodologies to ensure timely delivery of project milestones.\n• Utilized **Git** for version control, ensuring a smooth collaboration workflow across development environments.\n• Streamlined deployment processes through **CI/CD** practices, greatly reducing deployment times by **40%**.\n• Employed **Docker** for containerization, ensuring consistency across environments and significantly improving application portability.\n• Fostered performance optimization techniques to enhance the efficiency of applications, achieving response time reductions of **30%**.\n• Developed and maintained integrations with e-commerce platforms like **Shopify**, **Shopware**, and **WooCommerce**, expanding the service offerings of the company.\n• Spearheaded efforts to enhance data security in compliance with industry regulations, incorporating critical security measures during development."
    }
  ],
  "skills": "Frontend Frameworks: PHP, Symfony, WooCommerce, Shopify, Shopware, REST, JSON\n\n\tLanguages: Python (3.8+), SQL, Bash, JavaScript\n\n\tBackend Frameworks: FastAPI, Flask, Django, Celery\n\n\tAPI Technologies: REST/gRPC APIs, Microservices\n\n\tServerless and Cloud Functions: AWS (EC2, S3, Lambda), Azure\n\n\tDatabases: PostgreSQL, MySQL, MongoDB, Redis\n\n\tDevOps: Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n\tCloud & Infrastructure: Cloud\n\n\tOther: Performance Optimization, Agile, Scrum, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git, Kafka",
  "apply_company": "brickfox Multichannel eCommerce"
}