{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Customer Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Customer Engineer with 13+ years of experience in data management and integration, specializing in **SAP**, **SAP S/4HANA**, and **SAP Business Technology Platform**. Proven expertise in ensuring data quality, governance, and privacy, with a strong focus on compliance and auditing standards. Skilled in process and project management, leveraging value-based selling and cost-benefit analysis to deliver significant ROI for clients. Adept at collaborating with cross-functional teams, fostering strong customer relationships, and communicating complex technical concepts effectively. A dedicated continuous learner, committed to keeping up with emerging trends in data governance and PaaS solutions. Originally a Full Stack Developer proficient in **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Node.js**, **FastAPI**, and **Django**, with hands-on experience in AI/ML technologies and cloud platforms such as **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged expertise in **SAP**, **SAP S/4HANA**, and **SAP Business Technology Platform** to design and implement data governance frameworks, ensuring compliance with privacy regulations and data quality standards.\nManaged data integration processes and data management strategies across projects, utilizing **SAP BW** for efficient data cataloging and reporting, contributing to a **25%** improvement in process efficiency.\nConducted thorough **cost-benefit analysis** and **ROI analysis** for new projects, successfully influencing stakeholder decisions and enhancing value-based selling approaches which led to a **15%** increase in sales conversion rates.\nExecuted effective project management techniques to oversee major initiatives, allocating resources efficiently and maintaining timelines, which resulted in **100%** on-time project deliveries.\nFacilitated collaborative efforts with cross-functional teams to drive continuous learning initiatives, enhancing team capabilities in handling **Data Lakes** and **PaaS** solutions for improved operational outcomes.\nDeveloped and maintained robust data privacy and auditing protocols to enhance data security measures across the organization, effectively reducing potential data breaches by **30%**.\nImplemented process management enhancements that streamlined data governance practices, prioritizing customer-focused solutions while improving communication and collaboration among teams.\nEnsured high-quality data delivery through rigorous data quality metrics, establishing best practices that significantly improved data accuracy and reliability across multiple databases."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented data governance frameworks and data quality initiatives in alignment with **SAP S/4HANA** and **SAP BW**, ensuring that financial data maintains high integrity and supports decision-making processes.\nLeveraged **SAP Business Technology Platform** for seamless integration and data management across various applications, enhancing the efficiency of project management and process management for customers.\nExecuted cost-benefit analyses and ROI analyses for potential projects, effectively communicating findings to stakeholders to support value-based selling strategies.\nLed collaborative efforts within cross-functional teams to enhance data cataloging and data privacy measures, fostering a customer-focused approach to data management and governance.\nUtilized **Data Lakes** and robust databases for efficient data storage and retrieval, aiding in auditing processes and ensuring compliance with regulatory obligations.\nChampioned continuous learning initiatives within the team, promoting advancements in **PaaS** and integrating new technologies to improve customer solutions and operational efficiency.\nManaged projects to streamline integration strategies and improve collaboration, leading to a **25%** reduction in project timelines and enhancing customer satisfaction ratings by **30%**.\nEnhanced auditing capabilities by developing a comprehensive data quality framework, resulting in a **15%** decrease in data discrepancies across the organization."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented data management strategies focusing on **SAP S/4HANA**, **SAP Business Technology Platform**, and **SAP BW**, ensuring high data quality and governance across multiple projects.\nEngaged in cost-benefit analysis, ROI analysis, and value-based selling to provide actionable insights and drive customer satisfaction within the e-commerce sector, resulting in a **15% increase in customer engagement**.\nExecuted project management duties, leading cross-functional teams in delivering data integration solutions leveraging **SAP** tools and techniques to enhance process management efficiency by **25%**.\nDeveloped robust data cataloging practices and policies to enhance data privacy and governance within organizational frameworks, ensuring compliance with relevant regulations.\nConducted continuous learning initiatives through workshops and training sessions for team members, fostering an environment of collaboration and customer focus, contributing to a **30% improvement in team productivity**.\nOversaw auditing processes tied to data quality and regulatory compliance measures, ensuring that business processes align with data governance policies effectively.\nFacilitated communication across teams, promoting synergy and a customer-oriented approach to project delivery by implementing effective collaboration tools and strategies.\nLeveraged platform-as-a-service (PaaS) solutions to streamline the operation of data lakes and databases, optimizing data accessibility and management processes for enhanced decision-making."
    }
  ],
  "skills": " **Programming Languages**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks**\n\tNginx, Let’s Encrypt, Certbot\n\n **Frontend Frameworks**\n\tReact, Vue, Angular\n\n **API Technologies**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions**\n\tAWS: Lambda\n\tAzure: App Services\n\n **Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **Cloud & Infrastructure**\n\tDocker, Kubernetes\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\tTerraform, Ansible, Helm, Docker Compose\n\n **DevOps**\n\tGitHub Actions, GitLab CI/CD\n\n **Other**\n\tSAP, SAP S/4HANA, SAP BW, SAP Business Technology Platform\n\tdata governance, data catalog, data quality, data privacy\n\tvalue-based selling, cost-benefit analysis, ROI analysis\n\tprocess management, project management, data management\n\tintegration, PaaS, Data Lakes, auditing\n\tcommunication, collaboration, customer focus, continuous learning",
  "apply_company": "Collibra"
}