{
  "name": "Tomasz Lee",
  "role_name": "Senior Gameplay Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Proficient Senior Gameplay Engineer with 9+ years of experience in utilizing **C#** for performance optimization and technical documentation. Specialized in **Unity** and **ECS**, with a proven track record in bug fixing and enhancing gameplay performance. Adept at collaborating with cross-functional teams to ensure project success while demonstrating meticulous attention to detail. Committed to proactive learning to stay updated with the latest trends in gameplay engineering, equipped with the skills to deliver high-quality solutions efficiently.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Gameplay Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **C#** within **Unity** to develop and optimize the gameplay mechanics, enhancing performance by 30% across multiple projects.\nCollaborated with cross-functional teams to ensure cohesive game design and functionality, fostering a culture of **Team Collaboration**.\nImplemented **Performance Optimization** strategies that reduced frame drops and improved overall game responsiveness by 25%.\nConducted thorough **Bug Fixing** processes, achieving a reduction in reported issues by 40% pre-launch.\nCreated and maintained **Technical Documentation** for gameplay systems, ensuring clarity and usability for future development.\nApplied **ECS (Entity Component System)** principles to enhance the performance of game modules, facilitating smoother gameplay experiences.\nEngaged in **Proactive Learning** to stay updated with industry trends and best practices, contributing innovative techniques to the team.\nDemonstrated **Attention to Detail** throughout development cycles, ensuring high-quality deliverables and adherence to design standards.\nMentored junior developers in best practices for gameplay engineering, helping foster a knowledge-sharing environment within the team.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and developed gameplay features using **C#** within a **Unity** environment, ensuring high performance and optimization to enhance user experience.\nImplemented **ECS** (Entity Component System) for improved architecture and efficiency in game development, leading to a 20% reduction in runtime issues.\nConducted rigorous performance optimization for gameplay mechanics, resulting in a 30% increase in frame rate and responsiveness.\nProactively identified and fixed bugs, maintaining a 95% bug-free release rate for new game updates.\nCreated and maintained technical documentation for gameplay systems, ensuring clarity and knowledge transfer within the team.\nFostered team collaboration through regular feedback sessions and collaborative problem-solving, enhancing overall project efficiency by 15%.\nEngaged in continuous learning and application of new techniques and technologies in gameplay development, leading to innovative solutions and game features.\nDemonstrated strong attention to detail in code quality and gameplay mechanics, minimizing discrepancies and enhancing user satisfaction.\nLed team workshops focused on best practices in gameplay engineering and optimization strategies, resulting in a 25% improvement in team skill level and productivity.\nMentored junior developers by sharing expertise in **Unity** and **C#**, fostering a culture of learning and development within the team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C#** and **Unity** to develop game features, ensuring optimized performance and enhanced gameplay experience with a focus on **Performance Optimization**.\nCollaborated with cross-functional teams to improve game mechanics and resolve bugs, demonstrating strong **Team Collaboration** and **Attention to Detail**.\nCreated and maintained technical documentation for all gameplay systems, contributing to knowledge sharing and efficiency in **Technical Documentation**.\nImplemented **ECS** (Entity Component System) architecture to streamline development processes and increase frame rates by **15%**.\nProactively identified and addressed bugs in gameplay features, leading to a **30%** reduction in post-release issues.\nConducted code reviews and provided mentorship to junior developers, fostering a culture of **Proactive Learning** and continuous improvement.\nWorked alongside designers to refine user interactions, contributing to an engaging player experience through iterative testing and feedback.\nParticipated in regular sprint planning and standup meetings to ensure alignment with project timelines and objectives, enhancing overall project flow.\nReduced build times by **25%** through effective version control practices and optimized resource management strategies."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Cloud & Infrastructure**\n\tAWS, Azure, CI/CD pipelines\n\n**Other**\n\tUX/UI Design, Git, GitHub, Python, Redux, Solidity, Ether.js, Web3.js, Ethereum, Unity, ECS, Performance Optimization, Bug Fixing, Technical Documentation, Team Collaboration, Proactive Learning, Attention to Detail\n\n**Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n**Testing Tools**\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Fortis Games"
}