{
  "name": "Mariusz Jan Skobel",
  "role_name": "PL/SQL Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "PL/SQL Developer with 10+ years of experience in software solutions, specifically skilled in **PL/SQL**, **Oracle database**, and **Oracle SQL Developer**. Proficient in problem-solving and analytical skills, adept at optimizing database performance and ensuring data integrity. Experienced with **TOAD** for database management and querying, ensuring efficient workflows and robust data handling. Refined fluency in both Italian and English enables effective communication in diverse team environments. Demonstrates original strengths in software development with strong knowledge of full-stack technologies, capable of integrating with modern frameworks, and passionate about delivering secure, high-performance applications that meet compliance standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "PL/SQL Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Utilized **PL/SQL** for developing and optimizing database stored procedures, functions, and triggers on **Oracle database**, ensuring efficient data handling and retrieval.  \n• Conducted data modeling and created complex SQL queries in **Oracle SQL Developer** for enhanced reporting and analytics, significantly improving data access speed by up to **30%**.  \n• Demonstrated strong analytical skills by identifying data patterns and trends, facilitating data-driven decision-making processes that led to operational improvements.  \n• Employed **TOAD** for comprehensive database management, debugging, and performance tuning, achieving a **20%** decrease in query execution times.  \n• Collaborated on cross-functional teams using problem-solving skills to troubleshoot and resolve technical issues, increasing overall system uptime and user satisfaction.  \n• Engaged in peer reviews of code and database structures, offering insights to improve overall code quality and maintainability, while adhering to technical constraints.  \n• Provided support and training for team members on best practices in **Oracle technologies**, fostering a culture of knowledge sharing and continuous improvement.  \n• Served as a liaison between IT and business stakeholders, translating business requirements into technical specifications for database solutions.  \n• Communicated fluently in both **Italian** and **English**, facilitating clear communication with diverse team members and stakeholders, enhancing collaborative project timelines."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **PL/SQL** and **Oracle Database** to design and implement efficient queries and stored procedures, enhancing data retrieval speeds by **45%** in complex financial datasets.\nConducted thorough data analysis and debugging in **Oracle SQL Developer** and **TOAD**, leading to a **30%** reduction in data-related issues and increasing overall reliability of financial applications.\nDemonstrated strong analytical skills by interpreting financial data and deriving actionable insights, contributing to strategic decision-making for stakeholders.\nCollaborated with cross-functional teams to identify and resolve problems, leveraging problem-solving skills to streamline application processes and improve user experience.\nSuccessfully communicated technical details and project updates in both **Italian** and **English**, ensuring clarity and alignment among diverse teams and clients.\nPerformed data modeling and schema design on **Oracle Database** that supported high-volume transactions, ensuring scalability as transaction volumes increased by **20%** yearly.\nEngaged in regular code reviews and optimizations, directly improving the performance of existing PL/SQL scripts and reducing runtime by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **PL/SQL** to design, develop, and optimize complex queries and stored procedures for high-performance data manipulation and retrieval within **Oracle Database**, ensuring efficient data access for key business operations.\nEmployed **Oracle SQL Developer** and **TOAD** for database management and performance tuning, enhancing system responsiveness by **30%** through efficient indexing and query optimization strategies.\nDemonstrated strong analytical skills to troubleshoot and resolve operational issues, contributing to a **25%** reduction in application downtime by swiftly addressing performance bottlenecks.\nLeveraged problem-solving skills to streamline database processes, leading to a **15%** improvement in overall data processing speed, thus supporting better decision-making capabilities for stakeholders.\nCommunicated effectively with both technical and non-technical teams, drafting technical documentation and conducting training sessions in **English** and **Italian** to ensure cross-departmental understanding of database functionalities and best practices.\nCollaborated with other developers to implement robust data models, facilitating seamless integration with existing systems for improved data accuracy and consistency across platforms."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript, PL/SQL\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Oracle database\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tAnalytical skills, Problem-solving skills, Fluency in Italian, Fluency in English, MLflow, Airflow, Kubeflow, Let’s Encrypt, Nginx, Certbot, TOAD"
}