{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience in delivering high-performance web applications, specializing in **ReactNative**, **TypeScript**, and **Tailwind** for developing user-friendly interfaces. Proficient in using **Expo** for building elegant mobile applications and ensuring customer-centric designs to foster product development in the fintech sector.\nDemonstrated expertise in testing and debugging through **Cypress**, as well as implementing performance monitoring with **PostHog** and **Sentry**. Well-versed in full stack development with hands-on experience in **React**, **Next.js**, **Vue**, and backend technologies including **Node.js**, **FastAPI**, and **Django**.\nSkilled in deploying cloud-native systems on AWS and Azure, coupling modern microservices architecture with event-driven designs and CI/CD pipelines. A strong advocate for compliance-driven development, aligning projects with HIPAA, PCI DSS, and SOC 2 standards while leveraging my strong background in MLOps through tools like MLflow, Airflow, and Kubeflow.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and delivered user-centric mobile applications using **React Native** and **TypeScript**, ensuring top-notch performance and seamless interactions.\n• Crafted responsive UI designs with **Tailwind CSS** to enhance user experience in fintech platforms, incorporating components that improve accessibility and customer satisfaction.\n• Implemented robust testing strategies using **Cypress** for end-to-end testing and **Sentry** for error monitoring, achieving a test coverage rate of over **90%**.\n• Collaborated with cross-functional teams in a **product development** environment to ensure alignment with customer needs, reflecting a **25%** increase in user engagement post-launch. \n• Leveraged customer-centric methodologies to gather feedback, iterating on features to align with user expectations and enhance product offerings.\n• Managed project timelines and deliverables, achieving project completion **3 weeks ahead** of schedule through effective sprint planning and agile methodologies.\n• Utilized **PostHog** analytics tools to track user interactions and improve decision-making based on data-driven insights, leading to a **40%** decrease in customer drop-off rates.\n• Participated in code reviews and technical discussions, fostering an environment of continuous improvement and innovation within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed interactive mobile applications using **ReactNative** and **Expo**, focusing on delivering a customer-centric user experience in the **Fintech** sector.\n- Utilized **TypeScript** and **Tailwind CSS** to enhance code quality and styling, ensuring maintainability and responsiveness in UI components.\n- Collaborated on product development initiatives, implementing features that cater to customer needs and improve overall engagement, contributing to a **30%** increase in user retention.\n- Conducted testing and quality assurance with **Cypress** and integrated analytics using **PostHog** to monitor user behavior and improve application performance based on data-driven insights.\n- Implemented error tracking and performance monitoring using **Sentry**, proactively addressing issues and optimizing the user experience in production environments.\n- Designed and executed user feedback loops, directly influencing product iterations based on insights gathered from customer interactions, resulting in a **25%** reduction in user-reported issues.\n- Provided mentorship to junior developers, leading to an overall **40%** improvement in the team's coding standards and project turnaround times.\n- Contributed to the strategic development of fintech products, ensuring alignment with customer-centric goals and maintaining a focus on innovative solutions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized responsive frontend applications using **ReactNative**, **Typescript**, and **Tailwind CSS**, delivering top-notch user experiences across web and mobile devices for fintech products.\nEngineered user interfaces compliant with WCAG 2.1, ensuring accessibility for all users while maintaining a strong focus on customer-centric design principles.\nEnhanced product development processes by implementing A/B testing and feature flags, utilizing tools like **Cypress** for automated testing and **PostHog** for analytics, achieving a **30%** increase in user engagement metrics.\nLeveraged **Expo** for streamlined mobile app development, reducing build times by **40%** and improving deployment efficiency across platforms.\nCollaborated with cross-functional teams to integrate backend services and APIs into frontend solutions, ensuring seamless data flow and user interaction.\nApplied real-time error tracking and performance monitoring through **Sentry**, significantly enhancing application reliability with a **99.9%** uptime record.\nParticipated in product development life cycles, focusing on customer feedback to align features with user needs and drive innovation in the fintech space.\nOptimized application performance using frontend caching strategies, resulting in a **25%** reduction in load times and improved responsiveness for end-users.\n"
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript/TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, ReactNative, Vue, Angular, Tailwind, Expo\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Cypress, PostHog, Sentry, Fintech, ProductDevelopment, CustomerCentric",
  "apply_company": "MoneyGram"
}