{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior DevOps Engineer with 8 years of experience, I am proficient in **AWS**, **Terraform**, **CI/CD**, **Docker**, and **Kubernetes**, driving robust cloud infrastructure and seamless deployment processes. My technical background includes strong programming skills in **Python**, alongside scripting abilities in **Bash** and **PowerShell**, ensuring efficient automation and system integration. I excel in implementing DevOps culture, enhancing collaboration between development and operations teams.\n\nIn addition to my DevOps expertise, I hold substantial full-stack development experience with technologies such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, particularly within the healthcare and financial sectors. I have led teams to develop enterprise-grade platforms that incorporate AI/ML features for predictive analytics and real-time data processing. Furthermore, I possess a solid understanding of compliance standards including HIPAA, FHIR, PCI DSS, and SOC 2, alongside a foundation in microservices architecture and event-driven systems, ensuring the delivery of secure and scalable applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented and maintained robust **CI/CD** pipelines leveraging **AWS**, **Docker**, **Kubernetes**, and **Jenkins**, ensuring smooth deployment processes and infrastructure as code with **Terraform**.\nArchitected scalable microservices architecture for high availability and resilience using **Kubernetes** and **Docker**, leading to **90%** reduction in system downtime.\nDeveloped automation scripts using **Bash** and **PowerShell** for streamlined operations and maintenance processes, enhancing operational efficiency by **30%**.\nPromoted a culture of **DevOps** across teams, facilitating collaboration and integration between development and operations that resulted in a **25%** increase in deployment frequency.\nManaged cloud infrastructure on **AWS**, employing services such as EC2, S3, and RDS, optimizing resource usage and cost-effectiveness by **40%**.\nUtilized **Python** for creating automation scripts and monitoring tools, ensuring system health and performance metrics are adhered to.\nLed migration projects to containerized solutions, successfully transitioning legacy systems to cloud-native environments, improving scalability and management.\nEstablished rigorous monitoring and logging practices with tools like Prometheus and ELK stack, increasing troubleshooting speed by **50%**.\nCollaborated on cross-functional projects to integrate security best practices into the CI/CD pipeline, utilizing automated security scans and compliance checks to ensure regulatory adherence.\nConducted training sessions on **DevOps** methodologies and tools, elevating team skills and knowledge on cloud services and container orchestration frameworks.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **AWS** solutions and infrastructure as code with **Terraform** to automate deployments and manage resources efficiently, resulting in a **30%** reduction in provisioning time.\nEnhanced CI/CD pipelines using **Jenkins** and **Docker**, achieving **95%** automated deployment success rate and significantly improving release cycle times for financial applications.\nManaged container orchestration with **Kubernetes**, ensuring high availability and scalability for microservices deployed on cloud environments, handling real-time traffic with **99.9%** uptime.\nDeveloped and maintained infrastructure scripts in **Bash** and **PowerShell** to streamline configuration management and system maintenance tasks within a collaborative DevOps culture.\nUtilized monitoring and logging tools to ensure infrastructure reliability, allowing teams to quickly identify and resolve issues, leading to a **45%** decrease in operational incidents.\nCollaborated with cross-functional teams to improve system performance, availability, and security, applying DevOps principles to enhance software delivery lifecycle.\nParticipated in regular training sessions to maintain high proficiency in **English C1**, facilitating effective communication across international teams."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented CI/CD pipelines using **Jenkins** and **Docker**, ensuring seamless integration and delivery with an average deployment time reduced by **40%**.\nManaged and provisioned infrastructure on **AWS** utilizing **Terraform** to maintain scalable, cost-effective environments for development, staging, and production, achieving infrastructure deployment speed improvements by **30%**.\nOrchestrated containerized applications and microservices with **Kubernetes** and **Helm**, enhancing the resilience and scalability of deployments across **3** different environments.\nAutomated infrastructure management using scripting languages like **Bash** and **PowerShell**, significantly reducing manual configuration time by **50%** while improving reliability and repeatability.\nUtilized **DevOps culture** principles to foster collaboration between development and operations teams, leading to a **25%** increase in deployment frequency and a decrease in change failure rates.\nLed the creation of monitoring and logging solutions, integrating tools like Prometheus and Grafana, which improved incident response times by **35%** through proactive performance monitoring.\nConducted regular training sessions to enhance team skills in **CI/CD** practices and cloud technologies, contributing to the professional development of over **15** team members.\nDeveloped and maintained comprehensive documentation of infrastructure and deployment processes, ensuring compliance and knowledge sharing within the team.\nEnsured compliance with security best practices in cloud environments, applying role-based access control (RBAC) and adhering to GDPR requirements for user data protection."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tPython(FastAPI, Flask, Django)\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, CI/CD, Jenkins, DevOps culture, Bash, PowerShell\n\n **Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL)\n\n **Artificial Intelligence & Machine Learning:**\n\tMLflow, Airflow, Kubeflow\n\n **Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Other:**\n\tEnglish C1",
  "apply_company": "Onwelo"
}