{
  "name": "Tomasz Lee",
  "role_name": "Senior Google Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Senior Google Engineer with 9+ years of experience in cloud services, IT consulting, and project management. Proficient in **Google Workspace**, **Google Cloud**, and **Microsoft Azure**, with a solid background in networking and Active Directory. Skilled in delivering exceptional customer service and fostering team collaboration. Experienced as a .NET Full Stack Developer with a focus on microservices architecture and distributed systems, utilizing **Apache Kafka**, **RabbitMQ**, and **Redis**. Strong capabilities in front-end and back-end technologies including **ReactJS**, **NextJS**, **.NET**, and **C#**. Proven track record in optimizing development processes and leading projects to successful outcomes. Fluent in German and English.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Google Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Google Cloud** services to enhance customer management solutions, aligning with best practices in **Cloud Services** and **IT Consulting**.\nOptimized collaboration and communication through **Google Workspace**, fostering effective **Team Collaboration** and **Customer Service** strategies.\nImplemented robust project management methodologies, advancing project goals through effective **Project Management** practices.\nEngineered secure connections with **Active Directory** and **Exchange**, ensuring reliable access and integration within existing IT infrastructures.\nDeveloped cloud-based solutions that increased customer satisfaction by 25%, leveraging techniques from **Networking** and **Cloud Services**.\nDesigned scalable architectures that improved operational efficiency, illustrated through metrics such as a **40%** reduction in deployment time and **20%** improvement in system queries.\nCollaborated with cross-functional teams, providing leadership and guidance for project alignment and successful execution.\nNegotiated technical solutions for diverse clientele, addressing needs in both **German** and **English** to enhance **Customer Service** experiences.\nMaintained a focus on continuous improvement, integrating feedback loops for ongoing enhancements in project deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Google Cloud** services to enhance project management capabilities and support team collaboration through effective cloud solutions.\nImplemented **Microsoft Azure** architectures for scalable cloud applications, leading to a 15% increase in project efficiency across teams.\nManaged user authentication and access through **Active Directory**, ensuring secure user management and cloud resource access.\nExecuted project management tasks through **Google Workspace**, improving team collaboration and communication, resulting in 25% increased engagement.\nLed IT consulting initiatives utilizing **Networking** best practices, advising on system improvements and strategies.\nSuccessfully integrated **Exchange** for email services, improving team communication workflows.\nDeveloped and maintained systems in line with cloud service standards, achieving a **30% reduction** in deployment errors.\nConducted performance tuning of cloud applications, leading to an increase in system performance by **25%**.\nCollaborated with teams to define requirements, ensuring on-schedule delivery of projects while maintaining high standards of customer service.\nMentored junior engineers and facilitated code reviews, fostering a collaborative team environment that enhanced overall productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **Google Cloud** and **Google Workspace** for effective collaboration and communication, enhancing team productivity by 30%.\nManaged and maintained user access and permissions through **Active Directory**, improving account security and compliance across the organization by **15%**.\nUtilized **Microsoft Azure** to optimize cloud service deployment, contributing to a **25%** reduction in application downtime.\nProvided IT consulting to ensure seamless integration of cloud services, resulting in improved infrastructure efficiency.\nImplemented project management strategies to align team efforts with business objectives, successfully delivering projects on time **90%** of the time.\nFostered team collaboration by introducing tools and practices that improved communication across diverse teams, facilitating a cooperative work environment.\nTrained staff on the use of **Exchange** for effective email and calendar management, leading to an increase in internal communication effectiveness.\nConducted regular networking assessments to optimize systems, resulting in improved data transfer speed by **40%**.\nSupported customer service initiatives by ensuring technical solutions were aligned with user needs, contributing to an increase in user satisfaction ratings.\nMaintained proficiency in both **German** and **English** to effectively communicate with stakeholders and team members across different regions."
    }
  ],
  "skills": "  **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Database Systems**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure, Google Cloud\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tCloud Services, Active Directory\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Python, Redux, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Project Management, Team Collaboration, Networking, IT Consulting, Customer Service, English, German, Google Workspace, Exchange",
  "apply_company": "PCG DACH"
}