{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Power Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Power Engineer with a robust background in NoCode and LowCode development, proficient in **PowerApps** and **SQL** for building and deploying scalable solutions. Extensive experience in database management and integration of **JSON** for data handling. Bringing over 13 years of expertise in developing high-performance applications across diverse industries, including healthcare and finance. Key strengths include hands-on proficiency in **JavaScript/TypeScript**, **Python**, and **Flutter**, as well as backend frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Demonstrated track record of implementing AI/ML solutions that enhance predictive analytics and automation, while ensuring compliance with industry standards. Highly skilled in cloud deployment strategies utilizing **AWS** and **Azure**, and adept in leveraging microservices architecture and CI/CD pipelines for efficient software delivery.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Power Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and deployed **PowerApps** solutions leveraging **NoCode** and **LowCode** strategies to streamline automotive production processes, driving efficiency improvements of up to **30%**.\nPerformed advanced data manipulation and querying using **SQL**, ensuring seamless integration with existing databases and systems to support diverse automotive applications.\nCreated responsive and interactive applications utilizing **JSON** for data interchange, enabling real-time data updates in both German and English interfaces to cater to bilingual users.\nImplemented data-driven solutions to enhance production workflows, achieving a **15%** reduction in time-to-market for automotive components through optimized database management.\nConducted comprehensive testing and validation of database schemas and queries to ensure data integrity and performance, resulting in a **25%** improvement in operational reliability across all applications.\nCollaborated with cross-functional teams to define requirements and deliver solutions that enhance user experience, particularly in automotive contexts.\nEstablished and maintained documentation for all applications using **PowerApps**, ensuring that both technical and non-technical stakeholders can effectively utilize the developed solutions.\nFacilitated end-user training sessions in both German and English, empowering teams to effectively leverage new applications and tools in their daily operations."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Employed **PowerApps** to design and implement low-code solutions, enhancing operational efficiency through streamlined workflows tailored for the automotive finance sector.\n- Utilized **SQL** to optimize database queries, resulting in a **30%** performance improvement for data retrieval processes across financial applications.\n- Integrated data management solutions using **JSON** to facilitate seamless communication between applications and databases, ensuring consistency and accuracy of financial data.\n- Collaborated with cross-functional teams to develop no-code and low-code platforms, enabling non-technical users to create applications without extensive programming knowledge.\n- Conducted in-depth analysis of automotive production data to identify trends and insights, driving decisions that lead to a **15%** reduction in operational costs.\n- Created robust documentation in both **German** and **English**, supporting team members and stakeholders through clear, comprehensive technical guides and best practices.\n- Led training sessions for team members on the effective use of PowerApps and low-code platforms, enhancing team capabilities and productivity by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and managed **PowerApps** solutions, enhancing user workflows through **NoCode** and **LowCode** platforms, resulting in a 40% reduction in development time for internal applications.\nUtilized **SQL** to design and optimize relational databases, ensuring efficient data retrieval, which improved query performance by over **30%**.\nCreated automation scripts in **JSON** for data manipulation and integration purposes, enhancing data consistency across various platforms and applications.\nCollaborated with cross-functional teams in the **automotive production** sector, ensuring alignment of technical solutions with business objectives, leading to a **25%** increase in project delivery efficiency.\nFacilitated technical sessions in **German** and **English**, improving team communication and project understanding across diverse backgrounds.\nDeveloped comprehensive documentation for user interfaces and backend processes, ensuring clarity in system functionalities for both technical and non-technical stakeholders.\nAnalyzed and streamlined existing workflows, implementing enhancements that lead to a 15% increase in overall operational efficiency, while also ensuring best practices in software development were followed.\nParticipated in code reviews and quality assurance processes, maintaining high standards of code quality and software performance across all developed applications.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, SQL\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJSON\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tPowerApps, NoCode, LowCode, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Terraform, Ansible, Helm, Docker Compose, Automotive, Production, German, English",
  "apply_company": "eFinancialCareers"
}