{
  "name": "Tomasz Lee",
  "role_name": "Senior Frontend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic and detail-oriented Senior Frontend Engineer with 9+ years of comprehensive experience in web development utilizing **JavaScript**, **TypeScript**, **Vue**, **HTML**, and **CSS**. Proficient in modern frontend frameworks and technologies to create accessible and SEO-optimized applications. Adept in using **GIT** for version control and collaborating effectively within **Scrum** teams to deliver quality software solutions. Skilled in streamlining development workflows and enhancing user experience. Previous experience as a .NET Full Stack Developer brings added depth, with a solid foundation in complex application design, cloud services, and microservices architecture.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, **HTML**, and **CSS** to enhance the web-based customer management platform's frontend, leading to a **25%** improvement in user satisfaction.\nCollaborated with UX/UI designers to improve web accessibility and user experience, adhering to the latest **SEO** best practices.\nImplemented version control best practices using **GIT** to manage project codebase effectively across team members.\nAdhered to **Scrum** methodologies to ensure efficient project management and timely delivery of features with a focus on iterative improvements.\nDesigned interactive user interfaces utilizing **Vue** to streamline user interactions, resulting in a **15%** increase in user engagement.\nEngaged in code reviews and pair programming sessions to foster team collaboration and knowledge sharing.\nDeveloped responsive layouts to ensure optimal display across different devices, contributing to a **30%** increase in mobile access.\nIntegrated third-party plugins and libraries to enhance functionality while keeping the codebase clean and maintainable.\nProvided troubleshooting and support, ensuring frontend applications function smoothly as expected."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, **Vue**, **HTML**, and **CSS** to design and implement responsive user interfaces for web applications, contributing to a 25% enhancement in user engagement.\nDisplayed mastery in **Git** for version control, streamlining collaboration within the team by automating workflows and ensuring consistent code quality through rigorous **Scrum** methodologies.\nLed the integration of web accessibility standards into the front-end design, improving usability for all users and elevating the application’s SEO performance by 20%.\nDeveloped components using **ReactJS** and **Tailwind CSS**, increasing development speed by 15% due to reusable design patterns.\nFacilitated regular sprint planning meetings and retrospectives, ensuring alignment with team goals and timely delivery of projects.\nMentored junior developers in best practices of frontend development and introduced them to **Vue** libraries, enhancing the team's overall skill set.\nParticipated in code reviews and provided constructive feedback, which resulted in a 30% decrease in code-related issues post-deployment.\nEmployed agile methodologies to adapt to changing project requirements, maintaining focus on delivering high-quality features on schedule.\nManaged and optimized SEO strategies, leading to a growth in organic traffic by 35% within **6** months.\nPromoted a culture of continuous improvement by implementing tools to enhance web performance metrics and monitoring key KPIs."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed dynamic web applications using **JavaScript**, **TypeScript**, and **Vue.js**, enhancing user experience and accessibility.\n• Implemented robust version control practices using **GIT** to maintain code integrity and collaborate effectively within the team.\n• Ensured web accessibility compliance to improve usability for all users, achieving a 95% accessibility score on key metrics.\n• Collaborated within an agile team environment practicing **Scrum** methodologies, participating in daily standups to drive project success.\n• Created responsive and engaging user interfaces using **HTML** and **CSS**, optimizing for performance and SEO.\n• Developed cross-functional features, ensuring adherence to web standards and browser compatibility, improving load times by 30%.\n• Conducted in-depth code reviews, establishing coding standards and enhancing overall code quality for maintainability.\n• Facilitated knowledge transfer through comprehensive technical documentation and user guides, aiding team onboarding and project transitions.\n• Collaborated with backend developers to integrate APIs and third-party services, streamlining functionality for end-users.\n• Streamlined development processes through the implementation of reusable components, reducing development time for new features by 25%."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines, Git, GitHub\n\n**Cloud & Infrastructure**\n\tCloud Technologies\n\n**Other**\n\tUX/UI Design, SEO, web accessibility, Scrum, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Billennium"
}