{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Software Engineer with 8 years of comprehensive Full Stack Development experience, specializing in robust ERP solutions with a focus on **Odoo** and **PostgreSQL**. Proficient in **Python** and adept in **Docker** for containerization, along with strong expertise in **Git** for version control, delivering clean code and adhering to best practices in software development. My strong analytical skills are complemented by a solution-oriented approach, particularly in integrating AI solutions to enhance functionality. \n\nI have effectively implemented CI/CD pipelines to streamline deployment processes, ensuring high-quality software delivery while maintaining compliance with industry standards. With proven abilities in developing scalable applications using modern frameworks and technologies such as **React**, **Next.js**, and leveraging cloud services, I have successfully led projects that focus on delivering innovative solutions in dynamic, fast-paced environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** for backend development, leveraging **PostgreSQL** for efficient database management in scalable ERP solutions, ensuring clean code practices and solution-oriented engineering methodologies.\nDesigned and maintained automated **CI/CD** pipelines using **Git** and **Docker**, facilitating streamlined deployment processes for productive application environments.\nArchitected Odoo ERP modules, integrating AI functionalities to enhance user experiences and operational efficiencies, with a focus on delivering comprehensive solutions to meet business needs.\nImplemented robust data structures and optimized queries in **PostgreSQL**, managing data integrity and performance for applications handling thousands of transactions daily.\nApplied clean coding principles to develop maintainable and scalable codebases, driving improvements in code quality across multiple projects.\nCollaborated with cross-functional teams to define project requirements and technical specifications, leading to the successful deployment of high-quality software solutions in line with business objectives.\nLeveraged OCA standards and practices to ensure code quality and maintainability in Odoo applications, focusing on best practices in ERP development.\nLed the integration of AI-driven features into existing applications, utilizing **Python** for model development and delivering intelligent insights to end-users.\nProvided mentorship to junior engineers on using **Docker**, effective CI/CD practices, and maintaining high standards in code cleanliness and organization.\nMonitored system performance and reliability, identifying and rectifying issues proactively to minimize downtime and enhance user satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** (Django, FastAPI) to implement clean code principles in scalable and maintainable financial platform development, enhancing efficiency by **30%**.\nDeveloped and integrated solutions using **PostgreSQL** for robust data management, impacting real-time transaction processing time by reducing latency by **25%**.\nLeveraged **Docker** and CI/CD strategies for continuous integration and deployment, ensuring seamless updates and improved project delivery timelines by **40%**.\nCollaborated with cross-functional teams to adopt **Odoo** for efficient ERP integration, optimizing business processes and resource planning across high transaction environments.\nDesigned and constructed AI-driven solutions for fraud detection, utilizing machine learning libraries such as scikit-learn and XGBoost to analyze patterns, increasing detection accuracy by **20%**.\nImplemented comprehensive testing and version control using **Git**, maintaining code integrity and streamlining collaborative aspects of software development.\nContributed to the establishment of a solution-oriented culture by mentoring junior developers on best practices for coding and software design, resulting in enhanced team performance and project outcomes.\nPromoted the use of modern development frameworks and tools including **React** (18), **Next.js**, and **TypeScript** for high-performance front-end applications, improving user engagement metrics by **35%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** (FastAPI, Django) and **PostgreSQL** to implement Odoo ERP solutions, ensuring high-performance integrations that meet business requirements and drive efficiency.\nAdopted clean code practices to enhance code maintainability and readability, applying solution-oriented strategies to tackle complex technical challenges in software development.\nLeveraged **Git** for version control, fostering collaboration among team members and maintaining streamlined development workflows across multiple projects.\nImplemented **Docker** for containerization of applications, optimizing deployment processes and ensuring consistent application behavior across development, staging, and production environments.\nDeveloped and maintained CI/CD pipelines to facilitate automated testing and deployment, ensuring timely delivery of new features and updates while minimizing risks.\nEnhanced existing applications with AI capabilities, utilizing machine learning libraries such as **TensorFlow** and **scikit-learn** to provide intelligent features and improve user engagement.\nFostered a collaborative development environment through regular code reviews and pair programming, emphasizing solution-oriented approaches to problem-solving.\nOptimized system performance by employing best practices in database design and queries with **PostgreSQL**, influencing response times by up to **30%** in high-traffic scenarios.\nExecuted thorough testing practices to ensure the reliability of deployments, reducing production issues by **25%** through proactive error detection and resolution strategies.\nMaintained thorough documentation of code and systems, contributing to a knowledge base that enhances team efficiency and project onboarding processes."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Odoo\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tNginx, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tAI, MLflow, Airflow, Kubeflow, Authentication & Security, Keycloak (OIDC, RBAC), Let’s Encrypt, Certbot, CI/CD, OCA, ERP, clean code, solution-oriented",
  "apply_company": "AlphaPet Ventures GmbH"
}