{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Customer Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Customer Engineer with 8 years of experience, I possess a strong background in **Python** and **SQL**, coupled with extensive cloud expertise in **Azure** and **AWS**. My capabilities include the effective management of customer success initiatives alongside project management, ensuring high-quality delivery in alignment with organizational goals. I leverage my proficiency in **API** and **Web Services** to design seamless integrations while maintaining a strong focus on **Data Privacy**, **DLP**, and compliance with regulations.\nI excel at forging strong interpersonal relationships and fostering collaboration within teams, driving projects forward as a dedicated team player. Additionally, my experience in developing high-performance solutions utilizing **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, arms me with a versatile skill set ideal for addressing complex challenges in dynamic environments. Having led the development of enterprise platforms integrating AI/ML capabilities, I am well-versed in MLOps workflows with tools such as **MLflow**, **Airflow**, and **Kubeflow**, enhancing operational efficiency and customer satisfaction.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **SQL** for data analysis and customer insights to enhance user experience and drive customer satisfaction in technical implementations.\nConducted project management efforts by overseeing healthcare and financial platform deployments, ensuring timely delivery and adherence to regulatory standards.\nDeveloped and maintained secure APIs and web services using **Python** and ensured compliance with **Data Loss Prevention (DLP)** and **Data Privacy** regulations (e.g., HIPAA, FHIR, GDPR).\nCollaborated with cross-functional teams to deliver high-quality solutions while serving as a technical expert in **Cloud Technologies** like **AWS Lambda** and **Azure Functions**.\nDirected customer success strategies to facilitate user onboarding and support for platforms utilizing **Python (FastAPI)** and modern front-end frameworks including **React** and **Next.js**.\nUtilized effective interpersonal skills to communicate technical concepts clearly to clients, ensuring a strong understanding of delivered solutions and fostering long-term relationships.\nImplemented enterprise-level security measures through **CSPM** and **SIEM** technologies to monitor and protect sensitive data within healthcare and financial applications.\nProduced detailed technical documentation to support project deliverables and client education, showcasing proficiency in **Technical Writing**.\nEnsured that all platforms adhered to compliance guidelines, effectively managing risks associated with **Data Security Posture Management (DSPM)** within development and operational processes.\nSynthesized user feedback and project outcomes to refine project management practices, aiming for a **95%** customer satisfaction rate in technical deployments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **Python** to manage and analyze customer data effectively, ensuring high levels of **Data Privacy** and compliance with **DLP** standards, ultimately enhancing customer satisfaction and trust.\nUtilized **SQL** for data retrieval and transformation, providing detailed reports and insights that directly support **Project Management** efforts and informed customer success strategies in a timely manner.\nCollaborated with cross-functional teams to implement **Cloud Technologies**, enhancing the scalability and reliability of service delivery, contributing to improved customer experience and satisfaction levels.\nLed initiatives in **Customer Success**, ensuring that clients' needs were central to project goals and outcomes, resulting in a **20%** increase in customer retention rates year-over-year.\nChampioned the adoption of **Web Services** and **APIs** to facilitate seamless integration between customer platforms and internal systems, improving overall operational efficiency by **30%**.\nDeveloped comprehensive documentation and **Technical Writing** materials to support both internal teams and end-users, enhancing understanding of systems and contributing to a **15%** reduction in support-related inquiries.\nFostered a culture of teamwork and collaboration, leveraging strong **Interpersonal Skills** as a **Team Player** to drive projects forward and achieve company objectives.\nEnsured adherence to **SIEM**, **CSPM**, and other security measures, enhancing the protection of customer data and building confidence in the organization’s commitment to privacy and security."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **SQL** to analyze customer data, ensuring high data integrity and effective reporting, which enhanced customer success metrics by **30%**.\nManaged projects efficiently using **Cloud Technologies** and agile methodologies to deliver complex features on time, increasing team productivity by **25%**.\nImplemented robust **API** solutions, streamlining integration between customer-facing services and backend systems, resulting in a **40%** faster response rate during peak traffic.\nEngineered secure, scalable backend solutions using **Python** and various frameworks, ensuring compliance with **Data Privacy** regulations, leading to a **20%** reduction in potential data breaches.\nCollaborated closely with cross-functional teams, leveraging **Interpersonal Skills** to foster communication and ensure alignment across departments, facilitating faster project approvals and iterations.\nConducted technical writing for internal documentation and customer-facing materials, enhancing user understanding and satisfaction through clear guidance and resources.\nMaintained and monitored system performance using **SIEM** tools, enabling the proactive identification of issues, leading to a **15%** decrease in downtime.\nParticipated as a key team player in delivering client solutions, enhancing customer experience, and driving engagement through effective project management practices.\nImplemented best practices in **DLP** (Data Loss Prevention) to protect sensitive customer information, ensuring full compliance with industry standards and regulations.\nProvided technical support and onboarding for customers, utilizing effective **Web Services** to facilitate seamless integration into their existing workflows with a **95%** satisfaction rating."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI, WebServices\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCloudTechnologies\n\n**Other:**\n\tCustomerSuccess, ProjectManagement, DLP, DataPrivacy, DSPM, CSPM, SIEM, TechnicalWriting, InterpersonalSkills, TeamPlayer",
  "apply_company": "Cyera"
}