{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Development Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Software Development Engineer with 13+ years of experience adept in building robust applications, utilizing skills in **C++**, **C#**, unit testing, design patterns, and Agile methodologies. Proven track record in implementing **automated testing** strategies and utilizing **GitHub Actions** and **Azure Pipelines** for efficient CI/CD processes. Expertise in software development lifecycle and delivering high-performance solutions in compliance-driven environments.\nPreviously excelled as a Full Stack Developer with hands-on experience in **JavaScript**, **TypeScript**, **Python**, and **Flutter** for both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in deploying **cloud-native systems** on **AWS** and **Azure**, and implementing microservices and event-driven architectures. Strong background in developing AI/ML platforms with MLOps skills in model training and orchestration using **MLflow**, **Airflow**, and **Kubeflow**, while ensuring compliance with HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Development Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained robust software solutions utilizing **C++**, ensuring adherence to industry best practices and design patterns for optimal architecture and performance.\nImplemented **unit testing** frameworks to enhance code quality, ensuring reliability and maintainability across various modules and features.\nUtilized **Agile** methodologies to effectively manage the software development lifecycle, participating in daily stand-ups and sprint planning to ensure timely delivery of project milestones.\nBuilt efficient desktop applications leveraging **C#** and **Windows APIs** within the **Visual Studio** environment to enhance user experience and environment integration on Windows platforms.\nConfigured and optimized automated build and deployment pipelines using **GitHub Actions** and **Azure Pipelines**, leading to a streamlined software release process with reduced deployment times by **30%**.\nConducted extensive **automated testing** across various application layers to ensure high standards of quality and performance, achieving over **90%** test coverage for critical functionality.\nImplemented design patterns effectively to enhance code reusability, maintainability, and scalability of applications.\nCollaborated closely with cross-functional teams to refine software requirements, ensuring alignment with business goals and technological advancements through continuous feedback.\nLeveraged data visualization tools to present software metrics and performance indicators, contributing to team retrospectives and project planning sessions.\nMentored junior developers on best coding practices and principles, fostering skill development and a culture of continuous improvement within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **C++** and **C#** to implement robust software solutions while adhering to industry best practices and design patterns to enhance code quality and maintainability.\nContributed to the agile development process by participating in sprint planning, reviews, and retrospectives, fostering a collaborative team environment.\nImplemented automated testing strategies using **unit testing** frameworks to ensure software reliability and reduce defects, achieving a **95%** code coverage.\nManaged source code efficiently using **GitHub Actions** for CI/CD, streamlining the deployment process and reducing release times by **30%**.\nLeveraged **Azure Pipelines** to automate build and release processes, enhancing team productivity through faster feedback loops.\nDeveloped and maintained applications using **Visual Studio**, incorporating **Windows APIs** for seamless integration with the operating system.\nEmployed **Agile** methodologies to deliver high-quality software iteratively and adaptively based on stakeholder feedback."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C++** and **C#** programming languages for robust application development and enhancements within the software lifecycle, ensuring high code quality and performance through effective design patterns.\nImplemented **unit testing** strategies within an **Agile** framework to ensure rapid delivery of high-quality features while facilitating continuous integration using **GitHub Actions** and **Azure Pipelines**.\nDesigned and managed software solutions through tools like **Visual Studio**, enhancing debugging and performance profiling to optimize system efficiency in real-time applications.\nConducted code reviews and collaborative coding sessions focusing on design patterns that improve maintainability and promote best practices across the development team for efficient **Windows APIs** integration.\nDeveloped automated testing processes to increase test coverage by **60%**, significantly reducing regressions and enhancing deployment success rates in varied environments.\nLed projects focused on integrating third-party APIs and services, achieving a project delivery timeline improvement by **30%** through effective sprint planning and execution within the Agile paradigm.\nDrove architectural decisions that resulted in a **25%** reduction in application load times, leveraging effective resource management and optimized algorithms aligned with performance goals."
    }
  ],
  "skills": "**Programming Languages:**\n\tC++, Python, C#, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure Pipelines, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, unit testing, design patterns, Agile, Windows APIs, Visual Studio, automated testing, Nginx, Let’s Encrypt, Certbot"
}