{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer (with overlap into ML Engineer)",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Software Engineer with 10+ years of experience in software development and a robust focus on ML Engineering. Expert in **Python**, **MLOps**, and **CI/CD** practices, leveraging tools such as **Kubeflow**, **Airflow**, and **Prefect** for efficient machine learning pipeline management. Proven capabilities in developing APIs and integrating **TensorFlow**, **Scikit-learn**, and **PyTorch** for ML models. Proficient in utilizing **Google Cloud Platform** services including **GKE**, **BigQuery**, **BigTable**, **GCS**, and **Dataproc** to build scalable, cloud-native solutions. Strong background in maintaining Agile and DevOps methodologies to streamline development workflows using tools like **Gitlab**, **Jira**, and **Productboard**.\n\nDemonstrated success in creating high-performance software in sectors such as healthcare and finance, with hands-on expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept at leading the development of enterprise platforms that embed AI/ML capabilities for real-time analytics, automation, and intelligent decision-making. Experienced in microservices architecture and event-driven systems, ensuring secure and compliant solutions meeting standards like HIPAA, FHIR, PCI DSS, and SOC 2. Committed to building systems that drive meaningful impact through technical excellence.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer (with overlap into ML Engineer)",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and optimized full-stack solutions leveraging **Python**, **TensorFlow**, and **ML models** for healthcare and finance sectors, ensuring compliance with regulatory standards such as HIPAA and GDPR.\n•\tImplemented secure and efficient CI/CD pipelines using **Gitlab**, facilitating seamless deployment and integration of applications across multiple environments.\n•\tDesigned and maintained cloud-native data architectures utilizing **MongoDB**, **Redis**, and **BigQuery**, optimizing data storage and querying for large-scale operations.\n•\tLed the creation of MLOps pipelines with **Airflow** and **Kubeflow**, allowing for continuous training, validation, and deployment of models in production environments, decreasing model deployment time by **30%**.\n•\tDelivered rapid prototyping of machine learning models for healthcare applications, employing **scikit-learn** and **PyTorch**, significantly enhancing prediction accuracy for patient risk evaluation.\n•\tDeployed scalable cloud solutions on **Google Cloud Platform** (GCP), utilizing **GKE**, **Dataproc**, and **VertexAI** to manage complex workloads with reduced operational costs by **20%**.\n•\tEstablished multivariate testing frameworks for application performance using **Grafana** and **Sentry**, achieving a real-time monitoring system that improved system uptime to **99.9%**.\n•\tIntegrated and developed RESTful APIs to connect machine learning models with client applications, creating interactive features like smart dashboards and custom recommendations.\n•\tCollaborated in an Agile team structure, using tools like **Jira** and **Productboard**, to manage project workflows and timelines effectively, reducing delivery timeframes by **25%**.\n•\tSynthesized advanced NLP models using **spaCy** and **Hugging Face Transformers** to enhance data parsing capabilities for financial documentation.\n•\tAutomated testing strategies using **PyTest** and **Postman**, ensuring robust unit, integration, and E2E testing frameworks were in place to maintain software quality.\n•\tIntegrated advanced search capabilities utilizing **ElasticSearch**, enhancing data retrieval from unstructured datasets across healthcare and financial sectors."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained **Python** applications and microservices on **Google Cloud Platform (GCP)** to enhance scalability and performance for financial platforms, increasing system throughput by **30%**.\nImplemented data processing architectures using **BigQuery**, **BigTable**, and **Redis** for efficient handling of large datasets, resulting in improved query response times by **45%**.\nLeveraged **GKE** for container orchestration, enabling seamless deployment and management of applications with a **50%** decrease in downtime.\nBuilt and integrated **APIs** using **FastAPI** and **Django**, ensuring robust communication between services and applications, leading to a **60%** reduction in API response times.\nApplied **ML models** such as **scikit-learn** and **TensorFlow** for real-time fraud detection and analytics, improving detection accuracy by **20%**.\nUtilized **Airflow** and **Prefect** for orchestrating ETL pipelines, facilitating batch processing and real-time data ingestion from various internal and third-party sources, achieving data freshness within **1 hour**.\nEngaged with Agile methodologies and DevOps practices, employing **CI/CD** tools like **GitLab** for automating testing and deployment, increasing deployment frequency by **3x**.\nImplemented monitoring solutions using **Grafana** and **Sentry** for proactive resolution of application issues, reducing incident response times significantly.\nCollaborated effectively with cross-functional teams via **Jira** and **Productboard** to align project priorities and deliverables, resulting in a more streamlined software development lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** (FastAPI, Django) and **Node.js** (NestJS, Express) to design and optimize backend services for a global e-commerce platform, achieving **99.9% uptime** with low latency and scalable architecture across critical modules such as checkout, cart, and order fulfillment.\nEngineered real-time features leveraging **WebSockets** and an event-driven architecture utilizing **Kafka** and **RabbitMQ**, facilitating responsive order updates and dynamic inventory tracking, impacting **>100,000** active users each month.\nDeveloped fast and responsive frontend applications using **React 18**, **Vue 3**, **Angular**, along with **TypeScript**, **Redux Toolkit**, and **Tailwind CSS**, enhancing mobile and web user experiences with a **30% increase** in user engagement.\nEmployed **MongoDB**, **Redis**, **PostgreSQL**, and **Cassandra** for distributed data storage, ensuring **100ms response times** and fault-tolerant data access for high-traffic workflows, while implementing caching strategies that reduced database read pressure by **40%**.\nIntegrated AI/ML-based recommendation engines using **scikit-learn**, **LightGBM**, and **TensorFlow** for personalized product listings and improved search relevance, increasing conversion rates by **15%** based on real-time behavioral data.\nImplemented **Redis** caching for product metadata and shopping cart sessions, significantly enhancing application speed and user experience under heavy loads.\nExecuted feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes**, achieving seamless controlled rollouts and A/B testing during platform updates with minimal disruption.\nCreated responsive, SEO-friendly UI components using **Next.js**, **Vue 3 + Nuxt**, and **HTML5/CSS3**, complying with **WCAG 2.1** for accessibility and optimizing for mobile-first engagement.\nBuilt secure payment processes integrated with **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI compliance and utilizing tokenized transactions to handle sensitive user data.\nApplied **role-based access control (RBAC)** and **OAuth 2.0** safeguards for secure customer and admin access, ensuring strict GDPR compliance and robust user data protection throughout the platform."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Kubeflow, Airflow \n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Google Cloud Platform, GKE\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, BigTable\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), GCS, Dataproc, VertexAI, Grafana, Sentry, PagerDuty\n\n **Other:**\n\tMLOps, ML models, Scikit-learn, PyTorch, Spark, Agile, Jira, Productboard"
}