{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior IT Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Accomplished Senior IT Engineer with 8 years of experience in developing secure and efficient IT solutions. Proficient in **PKI**, **Asymmetrical Cryptography**, and **X.509** standards, with hands-on experience using **EJBCA** and **pkcs#11**. Demonstrated expertise in both **Linux** and **Windows** environments, combined with a solid understanding of **ITIL** practices and **Agile** methodologies. Known for collaborative teamwork and exceptional problem-solving skills, I thrive in structured work environments and am fluent in both German and English. My background includes designing enterprise-level systems that ensure data security and compliance with industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior IT Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Asymmetrical Cryptography** and **PKI** to enhance security protocols for sensitive data management in healthcare and financial applications.\nImplemented **HSM** (Hardware Security Module) solutions to protect cryptographic keys and sensitive information, ensuring compliance with regulatory standards.\nDeveloped strategies for secure document handling via **X.509** certificates while maintaining HIPAA and PCI DSS compliance.\nLed initiatives for effective **ITIL** processes and practices, focusing on continuous improvement in IT service management across teams.\nCollaborated seamlessly within an **Agile** framework to enhance software development processes, ensuring rapid delivery and adaptability to change.\nExcelled in problem-solving by diagnosing and addressing security vulnerabilities using structured working methodologies.\nOperated effectively in both **Linux** and **Windows** environments to ensure a robust IT infrastructure that supports diverse application stacks.\nFacilitated teamwork among cross-functional teams, incorporating best practices in software development and deployment.\nDemonstrated proficiency in both **German** and **English** to support technical documentation and collaboration in multinational teams."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Demonstrated strong problem-solving and teamwork skills while integrating **PKI** and **Asymmetrical Cryptography** frameworks to enhance security protocols across financial platforms.\nUtilized **HSM** for secure key management and implemented **X.509** standards to ensure compliance and trust in digital transactions.\nConducted onboarding and configuration of **EJBCA** to manage digital certificates effectively, resulting in a **30%** improvement in certificate issuance times.\nCollaborated on cross-functional teams applying **Agile** methodologies to refine and deliver IT solutions, contributing to a **20%** reduction in project delivery times.\nManaged platforms and systems on both **Linux** and **Windows**, ensuring cross-environment compatibility and optimized performance for all services.\nCreated comprehensive documentation and structured workflows that facilitated troubleshooting and improved operational efficiency by **15%**.\nFacilitated knowledge transfer sessions conducted in both **German** and **English** to empower team members regarding new technologies and security practices, enhancing overall team competency.\nEmployed ITIL principles to align IT services with business needs, ultimately increasing user satisfaction and operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **PKI** and **HSM** technologies to ensure secure data handling and compliance with industry standards, implementing **Asymmetrical Cryptography** for data encryption across platforms.\nDesigned and managed **X.509** certificates for authentication processes to enhance network security and data integrity in e-commerce applications.\nImplemented **EJBCA** for efficient certificate management and streamlined operations within secure environments, ensuring minimal downtime and enhanced security.\nWorked with **pkcs#11** to manage cryptographic tokens, enhancing secure key management processes in various applications.\nAdministered systems on both **Linux** and **Windows** platforms, ensuring optimal performance and reliability for all backend services, resulting in a **99.9%** uptime record.\nApplied **ITIL** principles to improve IT service management, focusing on efficiency and customer satisfaction.\nAdopted **Agile** methodologies to facilitate rapid development cycles, shortening the project timeline by **25%** and increasing output quality through iterative feedback.\nFostered **teamwork** in diverse groups, encouraging open communication that led to a **30%** increase in productivity and collaboration.\nExhibited strong **problem-solving** skills by addressing critical issues in real-time, ensuring services remained uninterrupted during peak traffic periods.\nMaintained a structured working approach that improved project tracking and deadlines adherence, achieving **100%** on-time delivery across the last **12** projects.\nFluent in **German** and **English**, enabling effective communication within international teams and enhancing collaborations with stakeholders from different regions."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tITIL, Linux, Windows, Agile\n\n**Other:**\n\tPKI, HSM, Asymmetrical Cryptography, X.509, EJBCA, pkcs#11, Problem-solving, Teamwork, Structured Working, German, English",
  "apply_company": "noris network AG"
}