{
  "name": "Damian Franciszek Pospiech",
  "role_name": "back-end leaning full stack engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven Full Stack Developer with 13+ years of experience, specializing in back-end lean development with robust skills in **Node.js**, **TypeScript**, **microservices architecture**, and **REST APIs**. Proficient in utilizing **NoSQL databases** like **MongoDB**, and strong competency in front-end technologies including **JavaScript**, **HTML**, and **CSS**. Demonstrated expertise in deploying **Azure Cloud** solutions and implementing containerized deployments.\nA proactive and solutions-led mindset, I have effectively delivered high-performance applications within healthcare and financial industries. My technical arsenal includes hands-on experiences with frameworks such as **React**, **Next.js**, **Vue**, along with **Python** and **Flutter** for comprehensive application development. With a focus on building AI/ML-powered platforms, I integrate predictive analytics and automation efficiently. Expertise in compliance-driven development ensures alignment with HIPAA, FHIR, PCI DSS, and SOC 2 standards while adeptly navigating MLOps utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "back-end leaning full stack engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust **REST APIs** using **Node.js** and **TypeScript**, ensuring seamless communication between front-end and back-end components.\n- Designed and implemented **microservices architecture** for enhanced scalability, leveraging **Docker** and **Kubernetes** for **containerised deployments** across multiple environments.\n- Utilized **MongoDB** and other **NoSQL databases** to efficiently handle large datasets and improve performance for data-heavy applications.\n- Collaborated with cross-functional teams to deliver high-quality solutions, applying a **proactive** and **solutions-led mindset** to address complex technical challenges.\n- Implemented responsive front-end features using **JavaScript**, **HTML**, and **CSS**, working with modern frameworks to enhance user experience and interface aesthetics.\n- Created dynamic, data-driven applications that integrate comprehensive back-end services with functional front-end design, ensuring compatibility with existing systems.\n- Participated in code reviews and continuous integration processes, fostering a culture of high code quality and accountability within the development team.\n- Championed Agile methodologies to enhance project outcomes, leading to a reduction in delivery time by **20%** on key projects.\n- Maintained documentation and provided technical support for end-users, enhancing the quality of software deliverables and ensuring user satisfaction.\n- Designed and built functionality for real-time data processing and analytics, supporting business-driven insights into operational metrics."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and maintained **REST APIs** using **Node.js** and **TypeScript** within a **microservices architecture**, leading to a **30%** improvement in response time for high-volume transactions.\n• Enhanced scalability by migrating core financial platforms, improving system performance by **25%**, utilizing **JavaScript**, **HTML**, and **CSS**.\n• Implemented and optimized **NoSQL databases** like **MongoDB** for seamless data retrieval and storage, reducing query response time by **40%**.\n• Collaborated on containerised deployments using **Azure Cloud**, ensuring efficient deployment and management of applications, while maintaining a proactive and solutions-led mindset.\n• Engaged in front-end development with frameworks such as React and Vue, creating responsive web applications that improved user engagement metrics by **20%**.\n• Designed and built asynchronous communication channels using technologies like Kafka and RabbitMQ, streamlining payment and compliance workflows.\n• Maintained a proactive mindset in troubleshooting and resolving issues, ensuring high availability of services across all financial tools and admin panels.\n• Contributed to system performance upgrades, achieving reduction in downtime incidents by **50%** through effective monitoring and optimization of service architecture."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services with a focus on **microservices architecture** and **REST APIs** for a global e-commerce platform using **Node.js** (NestJS, Express) and **TypeScript** to ensure high availability, low latency, and scalability.\nDeveloped and integrated **NoSQL databases** like **MongoDB** for efficient data handling across key modules, achieving a **50%** improvement in database response times.\nBuilt client-side applications using **JavaScript** and **HTML/CSS**, applying a **proactive mindset** to deliver engaging and accessible user experiences that drove a **30%** increase in web traffic.\nLeveraged **Azure Cloud** for deployment, enabling **containerized deployments** that improved system reliability and streamlined the development pipeline by **40%**.\nUtilized event-driven architecture with **WebSockets** for real-time features, enhancing customer engagement and increasing order processing efficiency by **25%**.\nImplemented robust data access strategies by employing **NoSQL databases** alongside traditional SQL databases, ensuring rapid access and extended storage capabilities for high-traffic workflows.\nActively participated in architecture discussions with a **solutions-led mindset**, contributing ideas that resulted in the successful implementation of over **5** major features within **6 months**.\nConducted A/B testing and performance monitoring via feature flags and containerized deployments, leading to reduced deployment risks and improved software quality.\nCollaborated with cross-functional teams to ensure seamless integration between backend services and frontend technologies, effectively improving system interoperability and integration speed by **35%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Backend Frameworks:**\n\tNode.js, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n **API Technologies:**\n\tREST APIs\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda; Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, NoSQL databases, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tmicroservices architecture, proactive mindset, solutions-led mindset, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}