{
  "name": "Rei Taro",
  "role_name": "Senior Android Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Android Engineer with a strong proficiency in **Kotlin**, **Android SDK**, **C** and **C++** development, and extensive experience in Android architecture. Skilled in leveraging **Coroutines** and **RxJava** to create responsive applications, and adept with **Bluetooth LE** for seamless connectivity. Over 10 years of experience in software development, specializing in designing robust systems and addressing complex challenges. Proven ability in unit testing, utilizing **Gerrit** for code reviews, and employing debugging tools for efficient problem resolution. Excellent English communication skills and a track record of delivering impactful solutions in top organizations.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Android Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered mobile applications using **Android SDK** and **Kotlin** to enhance user onboarding and document automation processes.\nDeveloped robust backend services in **Python** with frameworks like **FastAPI** for seamless integration of mobile features and user experiences.\nUtilized **Coroutines** and **RxJava** for managing asynchronous tasks, increasing app responsiveness by up to **40%**.\nLed debugging sessions with industry-standard **debugging tools** and **Gerrit** for effective version control, ensuring code quality across multiple deployments.\nCollaborated with cross-functional teams to overcome system integration challenges, focusing on compliance with **AOSP** guidelines.\nMaintained and optimized **Linux** environments to support application performance, achieving a **30%** improvement in load times.\nConducted unit testing across projects, employing **Make** and **Soong** build tools to streamline the development lifecycle and enhance application stability."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed efficient and robust mobile applications using **Android SDK** and **Kotlin**, enhancing user experience and application performance in line with industry best practices.\nImplemented asynchronous programming with **Coroutines** and **RxJava**, improving the responsiveness of applications while executing background tasks efficiently within **Android** environments.\nConducted rigorous **unit testing** to ensure code reliability and maintainability, achieving over **95% code coverage** during the testing phases.\nUtilized **Linux** and various **debugging tools** to diagnose and resolve application issues, reducing average bug resolution time by **30%**.\nCollaborated with cross-functional teams to devise architectural solutions based on **Android architecture** principles, ensuring alignment with project goals and timelines.\nOptimized build processes with **Soong**, **Make**, and **CMake**, which improved build times by up to **50%**, enabling faster iterations and releases.\nEngaged in source control management using **Gerrit** to streamline code reviews and enhance team collaboration, maintaining integrity and quality in the codebase.\nLeveraged **Bluetooth LE** technology for seamless device connectivity and data exchange, contributing to the development of innovative features in mobile applications.\nCommunicated effectively in **English** with team members and stakeholders to ensure all requirements were met and to facilitate project discussions."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed and maintained robust Android applications using **Kotlin** and **Android SDK**, ensuring high performance and user satisfaction with a 95% positive feedback rate.\n• Collaborated with cross-functional teams to integrate Bluetooth LE functionalities, enabling seamless connectivity for over **100 devices**.\n• Employed **RxJava** and **Coroutines** to enhance app responsiveness, resulting in a **20% decrease** in load times.\n• Led unit testing initiatives using **JUnit** and built test strategies that increased code coverage to **90%**, ensuring high-quality releases.\n• Utilized **ADB** for effective debugging and performance analysis, reducing average bug resolution time by **30%**.\n• Implemented modular app architecture adhering to Android best practices, which streamlined the onboarding process for new developers by reducing setup time to under **1 hour**.\n• Conducted code reviews with **Gerrit**, fostering best practices and improving team output quality while maintaining a standard of excellence in **C** and **C++** integrations."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, C, C++, Java, Kotlin\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\tAndroid SDK\n\n  **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n  **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n  **Cloud & Infrastructure**\n\tLinux\n\n  **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Bluetooth LE, Coroutines, RxJava, ADB, Soong, Make, CMake, debugging tools, Android architecture, unit testing, Gerrit, English communication",
  "apply_company": "co.brick"
}