{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Electrical Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a results-driven Senior Electrical Engineer with 8+ years of experience, I excel in Project Leadership and mentoring, leveraging skills in Relay Coordination and Quality Checks to ensure robust designs and implementations. My background includes proficiency in **AutoCAD**, **MicroStation**, and **SCADA**, enabling the seamless execution of complex electrical projects. I have a strong focus on Bus Design and Grounding techniques, fostering communication and collaboration among cross-functional teams. I am dedicated to delivering high-quality, efficient solutions while driving continuous improvement and innovation in the engineering process.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Electrical Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Executed **project leadership** by leading teams in developing engineering solutions for electrical substations using **AutoCAD** and **MicroStation**, ensuring adherence to project timelines and specifications.\nIntegrated **SCADA** systems within substation designs for improved operational efficiency and monitoring, achieving a reduction in downtime by **15%**.\nConducted **quality checks** on designs, ensuring compliance with industry standards and enhancing overall project reliability.\nPerformed **relay coordination** studies to optimize protection systems, reducing faults and ensuring safety, while cutting system response time by **20%**.\nDesigned grounding systems focused on safety and compliance with NEC standards, successfully mitigating electrical hazards in all projects.\nCollaborated with cross-functional teams to synthesize engineering concepts and project requirements, enhancing communication and project deliverables among diverse stakeholder groups.\nProvided **mentoring** to junior engineers in grounding, bus design, and quality assurance practices, facilitating skill development and professional growth.\nLed the adoption of engineering software **Bentley** for advanced simulation and analytical tasks, resulting in improved design accuracy and reduced project errors.\nDeveloped innovative solutions for bus design projects, increasing efficiency in electrical layouts and minimizing material costs by **10%**.\nFacilitated workshops on **relay coordination** and **SCADA**, advancing team knowledge and resulting in quicker project execution timelines.\nOversaw the implementation of critical changes in project design, resulting in a **30%** increase in project completion rates within specified deadlines.\nUtilized strong **communication** skills to present technical reports and project updates to stakeholders, ensuring transparency and alignment throughout all project phases."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Led project leadership initiatives within the electrical engineering domain, ensuring high-quality designs and solutions through **AutoCAD** and **MicroStation** for effective project delivery.\n• Managed grounding and bus design projects, applying extensive knowledge in relay coordination to maximize system efficiency and reliability.\n• Conducted quality checks and mentoring for junior engineers to enhance team capabilities in designing substation layouts and SCADA systems.\n• Collaborated effectively with cross-functional teams, leveraging strong communication skills to convey technical information clearly and manage expectations.\n• Implemented innovative electrical design processes, using **Bentley** software to create efficient and scalable infrastructure solutions.\n• Developed and reviewed comprehensive design plans and specifications for electrical substation components, applying industry-leading practices in compliance with regulations.\n• Directed quality assurance processes during project execution, utilizing automated checks and revisions to ensure adherence to engineering standards.\n• Fostered a collaborative environment through effective mentoring and training sessions, enhancing team proficiency in electrical engineering principles.\n• Managed multiple projects simultaneously while maintaining project timelines and budgets, utilizing advanced project management tools to track progress."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Led project teams and provided **quality checks** on complex electrical designs, ensuring compliance with **AutoCAD** and **MicroStation** standards for substation layouts and bus designs.\nMentored junior engineers in **relay coordination** practices and held regular workshops to enhance team capabilities in **SCADA** systems and grounding techniques.\nCommunicated effectively with stakeholders to define project scopes and deliverables, enhancing project leadership by ensuring timelines are met with a **100% compliance rate** without delays.\nCoordinated with cross-functional teams to develop customized engineering solutions that met client specifications, resulting in a **20% increase** in customer satisfaction through enhanced electrical system designs.\nEvaluated existing designs and implemented improvements, reducing project costs by **15%** while maintaining high-quality standards in project execution.\nOversaw quality assurance processes and checks for electrical infrastructure projects, ensuring that projects adhered to industry standards and best practices.\nUtilized **Bentley** tools for simulation and optimization of electrical systems, leading to the development of safer and more efficient substation designs.\nImplemented project management strategies that improved team workflow efficiency, achieving project milestones **2 weeks ahead** of schedule on average.\nProvided technical support and recommendations during project planning, leveraging advanced knowledge in high voltage systems and design principles to influence project outcomes.\nCollaborated with vendors and suppliers to source high-quality materials and components to meet project specifications without exceeding budget constraints."
    }
  ],
  "skills": " **Other**\n\tSubstation, AutoCAD, MicroStation, Bentley, Relay Coordination, SCADA, Grounding, Bus Design, Quality Checks, Project Leadership, Mentoring, Communication\n\n**Programming Languages**\n\tPython\n\n**Backend Frameworks**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**\n\tSQLAlchemy, Pydantic, Celery, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**\n\tNginx, Certbot, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt",
  "apply_company": "Primera Engineers"
}