{
  "name": "Rei Taro",
  "role_name": "Senior PHP Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior PHP Engineer with over 10 years of extensive experience in software development, focusing on PHP, SQL, and API design. Proficient in Object-Oriented Programming (OOP), SOLID principles, and design patterns, ensuring robust and maintainable code. Skilled in front-end technologies including HTML, CSS, and JavaScript, as well as WordPress development. Committed to best practices such as Test-Driven Development (TDD) and Domain-Driven Design (DDD), and experienced with version control systems for collaborative environments. Previously designed and delivered backend systems within financial platforms and AI/ML pipelines, leveraging a diverse tech stack including **Python (FastAPI, Django, Flask)**, and cloud services like **AWS** and **Azure**. Demonstrated success in leading impactful projects at prestigious organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed and maintained robust PHP applications by applying **OOP** principles and adhering to **SOLID** design patterns.\nUtilized **SQL** for database design and implementation, ensuring efficient data retrieval and storage for user management.\nImplemented well-structured **API** services to enhance system integrations and improve the overall performance by **30%**.\nDesigned and constructed user interfaces using **HTML**, **CSS**, and **JavaScript** to create responsive web applications, improving user experience and engagement by **25%**.\nEngaged in **TDD** (Test-Driven Development) methodologies to create test cases and improve code reliability and maintainability, enhancing the quality assurance process by **15%**.\nApplied **DDD** (Domain Driven Design) approaches to tackle complex business requirements and streamline development processes.\nUtilized **WordPress** as a content management system for client websites, ensuring they remained up-to-date with the latest features and security patches.\nImplemented version control practices using **Git** to track changes in code and facilitate team collaboration across projects."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed robust and scalable web applications using **PHP** (version **7.4**) and **SQL**, adhering to **OOP**, **SOLID** principles, and **design patterns** to ensure maintainable code.\nImplemented and integrated RESTful APIs to enhance application functionality and improve user experience with efficient data handling.\nUtilized **HTML**, **CSS**, and **JavaScript** to create responsive user interfaces that comply with modern web standards and improve user engagement by **30%**.\nAdopted **TDD** and **DDD** practices for effective testing and design, improving code quality and reducing bug rates by **25%**.\nPerformed version control using Git, ensuring smooth collaboration and code management across multiple projects and teams.\nWorked closely with cross-functional teams to deliver high-quality features and enhancements, ensuring all releases met user requirements and timelines."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **PHP** and **SQL** for developing backend services, ensuring robust trade execution and seamless portfolio management with adherence to **OOP**, **SOLID** principles, and design patterns.\nDesigned and implemented RESTful APIs to facilitate smooth interactions and data exchange with frontend applications, leveraging **HTML**, **CSS**, and **JavaScript** for a holistic user experience.\nConducted testing and debugging using **TDD** and **DDD** methodologies, enhancing software reliability and performance metrics by up to **30%**.\nEmployed version control systems for better collaboration across teams and streamlined code integration processes, improving deployment efficiency by **25%**.\nDeveloped comprehensive documentation and conducted knowledge-sharing sessions to elevate team proficiency and adherence to coding standards.\nMaintained system integration with third-party services and ensured compliance with industry standards, particularly focusing on security best practices.\nCollaborated with stakeholders to gather requirements and deliver high-quality software solutions that align with business needs."
    }
  ],
  "skills": "**Programming Languages**\n\tPHP, Python (3.8+), SQL, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tHTML, CSS\n\n**API Technologies**\n\tREST/gRPC APIs, API\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, version control\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tOOP, SOLID, design patterns, Microservices, Kafka, TDD, DDD, testing, PyTest, Git, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow",
  "apply_company": "wecity"
}