{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Software Engineer with 10+ years of experience in delivering high-performance software solutions, specializing in **PHP**, **C#**, and **.NET Core**. Proficient in designing and implementing **RESTful APIs** and building robust web infrastructure, leveraging skills in **OOP**, **SOLID**, and design patterns to ensure maintainable and clean code. Experienced in **Docker** for application containerization and maintaining stringent web security practices. Known for a strong ability in problem-solving and mentoring junior developers within a collaborative environment. Additionally, adept at developing cloud-native applications on **Azure** and **AWS**, with thorough knowledge of microservices architecture, CI/CD automation, and compliance standards such as HIPAA and FHIR. Demonstrates a passion for building systems that not only excel technically but also deliver substantial real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped robust server-side applications using **PHP** and **C#** within **.NET Core** frameworks, focusing on **RESTful APIs**, following **SOLID** principles and **OOP** methodologies to produce maintainable and scalable code.\n•\tDesigned and maintained secure web infrastructures by employing best practices in **web security**, ensuring integrity and availability of sensitive data in compliance with industry standards.\n•\tUtilized **Docker** for containerization, leading to streamlined deployment processes and improved application performance across various environments.\n•\tApplied design patterns and **Clean Code** principles in the development cycle, resulting in enhanced readability and maintainability of codebases for complex projects.\n•\tCollaborated with cross-functional teams to solve complex problems using innovative technology solutions, enhancing the overall efficiency of software development processes.\n•\tMentored junior developers on software design principles, coding standards, and best practices, fostering a strong collaborative environment and continuous improvement within the team.\n•\tImplemented comprehensive testing strategies utilizing automated frameworks such as **Postman** and unit testing tools to ensure high-quality deliverables with **98% test coverage**.\n•\tLed multiple projects to successful completion under tight deadlines, meeting **100%** of project milestones while maintaining high-quality standards and user satisfaction.\n•\tFostered a culture of agile development practices and continuous integration (CI/CD) using tools such as **GitHub Actions** and **Azure DevOps**, increasing team productivity by **30%**. \n•\tEnhanced application performance and user experience by integrating advanced features and functionalities adhering to industry benchmarks and user feedback."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Designed and implemented RESTful APIs and web infrastructure using **PHP** and **C# (.NET Core)**, ensuring secure coding practices and adherence to **SOLID** principles for maintainability and scalability in financial applications.\nDeveloped clean, object-oriented code following established design patterns to improve code quality and facilitate easier debugging and enhancement.\nUtilized **Docker** for containerization and deployment of applications, streamlining development and ensuring consistency across environments.\nMentored junior developers on best practices in **OOP** and **Clean Code**, fostering a culture of collaborative problem-solving and innovation within the team.\nLed the modernization of financial platforms by implementing microservices-based architecture with Node.js (NestJS/Express) and Python (FastAPI, Django), enhancing throughput for high-volume transaction systems by **30%**.\nDeveloped dynamic front-end applications with **React (18)**, **Vue 3**, and **TypeScript**, achieving a **25%** faster load time for financial dashboards.\nOrchestrated ETL pipelines using **Apache Airflow** and **Azure Data Factory**, processing over **500,000** transactions daily from various sources with high efficiency.\nIntegrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to support asynchronous event-driven architecture, improving transaction processing reliability and decreasing latency by **15%**.\nImplemented **AI/ML**-powered fraud detection systems with **scikit-learn** and **XGBoost**, successfully identifying **80%** of potential fraudulent activities in real-time.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **PHP** and **C#** in the implementation of robust **RESTful APIs** to support high-performance web infrastructure for a sophisticated e-commerce platform.\nEmployed **HTTP** protocols to enhance communication security and efficiency, ensuring response integrity across services.\nApplied **OOP** principles and **SOLID** design patterns to write maintainable and extensible code, enhancing code quality and ensuring clean architectures in application development.\nDesigned and executed secure coding practices, mitigating vulnerabilities and adhering to **web security** standards throughout the development lifecycle.\nIntegrated **Docker** for containerization, aiding in consistent deployment across various environments while streamlining development processes.\nFacilitated **collaborative** team efforts and provided **mentoring** to junior developers, fostering an environment of continuous learning and problem-solving.\nDemonstrated strong problem-solving abilities by troubleshooting issues in complex **web infrastructure** components, optimizing both backend services and frontend interfaces.\nContributed to code quality through rigorous adherence to **Clean Code** principles and established **design patterns**, improving code readability and maintainability.\n\nEnhanced efficient application runtime and data handling by leveraging proven strategies for web infrastructure, securing sensitive data and payment workflows aligned with **web security** best practices."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, PHP, C#, \n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET Core\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tHTTP, RESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tweb infrastructure\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, OOP, SOLID, Clean Code, design patterns, secure coding, mentoring, problem-solving, collaborative, web security, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "LastPass"
}