{
  "name": "Rei Taro",
  "role_name": "Senior Webflow Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Webflow Engineer with a strong focus on responsive design and CMS, leveraging 10+ years of experience in backend development to create efficient and engaging web experiences. Proficient in **Webflow**, **Figma**, and **Svelte**, with a solid understanding of SEO and analytics for optimized site performance. Skilled in site integrations, microinteractions, and animations to enhance user engagement. Excellent collaboration and communication abilities, successfully contributing to team goals in dynamic environments. Previously engineered backend systems for financial platforms, using technologies such as **Python** (FastAPI, Django, Flask), and cloud platforms like **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Webflow Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Webflow** and **CMS** for developing responsive designs and implementing microinteractions, ensuring high-quality user experience across various devices.\nCollaborated with cross-functional teams to integrate SEO best practices and site analytics, leading to a **35%** increase in organic traffic.\nDesigned and executed effective site integrations, leveraging **Figma** for robust prototypes, reducing development time by **20%**.\nImplemented responsive design techniques to optimize site performance and compatibility across **9** major browsers.\nFacilitated effective communication among team members to enhance project collaboration and streamline the development process.\nIntroduced innovative animations using **Svelte**, improving user engagement metrics by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed responsive designs and site integrations using **Webflow** and **Svelte**, enhancing user experience and increasing page load efficiency by **30%**.\nCreated and implemented SEO strategies to improve site visibility and achieve a **40%** increase in organic traffic within **6 months**.\nCollaborated with cross-functional teams to streamline content management workflows using **CMS** solutions, ensuring timely content delivery and integration.\nUtilized analytics tools to track user engagement and optimize site performance, resulting in a **25%** improvement in user retention rates.\nDesigned and executed microinteractions and animations in **Figma**, significantly enhancing user interaction and engagement on web applications.\nConducted comprehensive testing to ensure responsive design compatibility across various devices, reducing error reports by **50%** during initial rollout.\nFacilitated effective communication and collaboration among teams to ensure successful project completion and adherence to timelines."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Demonstrated expertise in **Webflow** and responsive design to create user-friendly, visually appealing web applications that enhance user experience.\nUtilized **Figma** for effective collaboration and design implementation, ensuring alignment with stakeholders through polished aesthetics and functionality.\nAnalyzed site performance and implemented optimized **SEO** strategies to boost organic traffic by **20%**.\nIntegrated various **CMS** solutions and third-party tools, ensuring seamless communication between the website and backend services.\nOversaw analytics setup to monitor user interactions, leveraging insights to drive continuous improvements across multiple projects.\nDeveloped engaging user experiences through microinteractions and animations utilizing **Svelte** to attract and retain users on the platform.\nMaintained collaborative communication with cross-functional teams, fostering a productive environment to successfully deliver projects with a satisfaction rate above **90%**."
    }
  ],
  "skills": "*****Frontend Frameworks*****\n\tFigma, Svelte, responsive design, animations, microinteractions, site integrations, CMS, SEO, analytics, collaboration, communication\n\n*****Programming Languages*****\n\tPython (3.8+), SQL, Bash, JavaScript\n\n*****Backend Frameworks*****\n\tFastAPI, Flask, Django, Celery\n\n*****API Technologies*****\n\tREST/gRPC APIs, Microservices, Kafka\n\n*****Serverless and Cloud Functions*****\n\tAWS (EC2, S3, Lambda), Azure\n\n*****Databases*****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n*****DevOps*****\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n*****Cloud & Infrastructure*****\n\tAWS (EC2, S3, Lambda), Azure\n\n*****Other*****\n\tPandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow",
  "apply_company": "HKR"
}