{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Full Stack Engineer with 13+ years of experience in delivering high-performance applications, specializing in **React**, **TypeScript**, **Node.js**, **Express**, **AWS**, and **CI/CD**. Proven expertise in building responsive user interfaces and scalable backend systems while ensuring best practices in compliance, performance, and security. Proficient in managing state with **Redux** and applying **Hooks** for efficient rendering, alongside strong skills in building REST and GraphQL APIs.\n\nAccomplished in databases such as **PostgreSQL** and **MongoDB**, with a keen focus on optimizing application accessibility and usability through testing tools like **Lighthouse** and **Axe**. Demonstrated ability to lead code reviews and foster a detail-oriented, creative, and problem-solving work environment. Experienced in utilizing cloud services, deploying solutions on **AWS EC2**, **AWS Lambda**, and **AWS S3**.\n\nSkilled in enhancing user experiences through well-architected systems aligned with performance metrics and security standards, drawing from a rich background in compliance-driven development within the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed full-stack applications leveraging **React** (17-18), **TypeScript**, **Node.js**, and **Express**, ensuring adherence to best practices for code quality and performance.\n• Utilized **Redux** and **Hooks** for state management in complex interactive applications, enhancing user experience through efficient data flow.\n• Created RESTful and **GraphQL** APIs for seamless communication between frontend and backend systems, enabling robust data handling solutions.\n• Designed and implemented CI/CD pipelines incorporating **Firebase** for real-time monitoring, **AWS** services including **EC2**, **Lambda**, and **S3** for scalable serving of applications.\n• Managed and optimized databases including **PostgreSQL** and **MongoDB**, ensuring reliable data storage and retrieval for intricate application requirements.\n• Conducted thorough code reviews emphasizing performance and security, implementing best practices in application development.\n• Ensured accessibility across applications using tools like **Lighthouse** and **Axe**, promoting usability for diverse user groups.\n• Engaged in problem-solving through detailed debug processes, consistently maintaining high accuracy and reliability in delivery outcomes.\n• Collaborated with cross-functional teams to integrate creative and innovative solutions into projects, aligning with business goals and user needs.\n• Focused on data integrity and system performance, achieving high operational KPIs through meticulous attention to detail."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)** and **TypeScript** combined with **Redux** for state management to build interactive front-end applications, enhancing user experience for financial tools and admin panels.\nImplemented best practices in **Node.js** (Express) to modernize core financial platforms through a microservices architecture, improving scalability and performance to support up to **10,000** transactions per minute.\nDeveloped REST and GraphQL APIs for robust communication between front-end and back-end services, ensuring efficient data retrieval and updates in applications.\nEngineered databases using **PostgreSQL** and **MongoDB** to manage and analyze large volumes of financial data, resulting in reduced query response time by **30%**.\nDeployed CI/CD pipelines for streamlined development and deployment processes, reducing release cycle time by **40%**.\nConducted comprehensive code reviews focused on security, performance, and accessibility, maintaining high-quality code standards and leveraging tools like **Lighthouse** and **Axe**.\nDesigned and implemented innovative features with a strong emphasis on creativity and detail-oriented development, proactively solving problems to improve application functionality.\nCollaborated with cross-functional teams to ensure best practices in system architecture and performance optimization, leveraging cloud services like **AWS** (EC2, Lambda, S3) for scalable infrastructure.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and optimized e-commerce frontend applications using **React (18)**, **TypeScript**, **Redux**, and **CSS**, ensuring adherence to performance and accessibility best practices.\n• Built responsive UIs compliant with WCAG 2.1 employing **HTML5** and **CSS3**, achieving a user-friendly design across devices with a focus on creativity and detail-oriented implementation.\n• Engineered robust backend services utilizing **Node.js (Express)**, ensuring RESTful API functionality and dynamic data handling through **PostgreSQL** and **MongoDB** for efficient data access and storage.\n• Implemented CI/CD workflows leveraging **AWS (EC2, Lambda, S3)** for streamlined deployment processes, increasing deployment frequency by over **50%**.\n• Conducted thorough **code reviews** to maintain high-quality code standards, enhancing team collaboration and skill development, with a focus on security and performance.\n• Employed state management using **Redux** and **Hooks** for seamless application states and improved user experience.\n• Utilized **Firebase** for real-time data syncing, which reduced load times by up to **30%** while enhancing site performance metrics analyzed via **Lighthouse**.\n• Engaged in continuous improvement initiatives by assessing the application with **Axe** for accessibility checks, ensuring compliance and usability for all users.\n• Integrated automated testing strategies to validate application functionality and security, reinforcing best practices in development lifecycle.\n• Collaborated cross-functionally to resolve complex problems through structured problem-solving techniques, enhancing team efficacy and project success."
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tPython\n\t•\tJavaScript\n\t•\tTypeScript\n\n **Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\t•\tRedux\n\t•\tHooks\n\t•\tHTML\n\t•\tCSS\n\n **Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\t•\tNode.js\n\t•\tExpress\n\n **API Technologies:**\n\t•\tREST\n\t•\tGraphQL\n\n **Serverless and Cloud Functions:**\n\t•\tAWS: Lambda, S3\n\t•\tFirebase\n\n **Databases:**\n\t•\tPostgreSQL\n\t•\tMongoDB\n\n **DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\n **Cloud & Infrastructure:**\n\t•\tAWS: ECS, RDS\n\t•\tAzure: App Services\n\t•\tEC2\n\n **Other:**\n\t•\tMLflow\n\t•\tAirflow\n\t•\tKubeflow\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\t•\tNginx\n\t•\tLet’s Encrypt\n\t•\tCertbot\n\t•\tRedis\n\t•\tCI/CD\n\t•\tbest practice\n\t•\tLighthouse\n\t•\tAxe\n\t•\tcode reviews\n\t•\tperformance\n\t•\tsecurity\n\t•\taccessibility\n\t•\tcreativity\n\t•\tdetail-oriented\n\t•\tproblem-solving",
  "apply_company": "AccessiWay"
}