{
  "name": "Rei Taro",
  "role_name": "Senior Network Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Network Engineer with over 10 years of expertise in designing and delivering robust network systems, with a strong focus on **TCP/IP**, **BGP**, **OSPF**, **EIGRP**, and **VLANs**. Proficient in implementing and managing **VPNs**, **firewalls**, **proxies**, and **load balancers**, ensuring high availability and security of network communications. Skilled in troubleshooting complex network issues, leveraging analytical and problem-solving abilities to optimize performance. Previous experience in high-stakes environments, demonstrating a commitment to maintaining cutting-edge standards. Additionally, familiar with backend development and cloud-native architectures, bringing an edge to network integration with insights from **AWS** and **Azure** for enhanced operational efficiency. Proven record of contributing to impactful projects at top-tier organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Executed network configurations and troubleshooting involving **TCP/IP**, **BGP**, **OSPF**, and **EIGRP** to enhance network performance and reliability.\nImplemented and managed **Aruba** and **Infoblox** solutions for efficient IP address management and secure network access.\nDesigned and optimized **VeloCloud** SD-WAN deployments to improve connectivity and reduce latency across **9** branch locations.\nConfigured **VLANs**, **VPNs**, and **firewalls** to ensure robust security measures and optimal traffic management.\nIntegrated **Algosec** for automated security policy management, reducing configuration time by **30%** and improving compliance.\nManaged and monitored network load balancers and proxies to ensure high availability of services and optimal resource utilization.\nCollaborated with cross-functional teams to analyze network performance metrics and resolve complex issues, applying strong problem-solving and analytical skills.\nConducted training sessions for junior engineers on troubleshooting techniques and network optimization strategies, enhancing team effectiveness by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Applied analytical and problem-solving skills to troubleshoot complex network issues and optimize performance across various networking components.\nEngineered robust network configurations using **TCP/IP**, **BGP**, and **OSPF**, ensuring efficient data routing for over **500** concurrent users.\nManaged and configured **firewalls**, **VPNs**, and **load balancers** to safeguard data and enhance functionality in multi-site environments.\nCollaborated with cross-functional teams to ensure regulatory compliance and system integration, which improved operational efficiency by **30%**.\nDeveloped data exchange protocols leveraging **Algosec** for automated security policies that successfully reduced potential vulnerabilities by **25%**.\nImplemented **VLANs** and **EIGRP** to isolate and secure network traffic, resulting in enhanced user experience and reduced latency by **15%**.\nConducted comprehensive network audits and generated detailed reports to inform stakeholders on performance, security, and compliance metrics."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized strong analytical and problem-solving skills to optimize and manage network performance, ensuring reliable trade execution and data transfer across platforms.\nDesigned and implemented robust network architectures incorporating **Aruba**, **Infoblox**, and **VeloCloud** solutions for enhanced security and uptime.\nConfigured and maintained network protocols including **TCP/IP**, **BGP**, **OSPF**, and **EIGRP** to support dynamic routing and efficient traffic flow within the trading environment.\nEngineered advanced segmentation strategies using **VLANs** and secured communications through **VPNs**, contributing to a highly secure and efficient trading platform.\nMonitored network elements like **firewalls**, **proxies**, and **load balancers** to ensure optimal performance and troubleshoot issues effectively, reducing downtime by **15%**.\nCollaborated with cross-functional teams to refine trading strategies through effective network management, facilitating an increase in transaction volume by **20%**.\nConducted regular capacity planning and network assessments, leveraging thorough documentation and analytical skills to support growth and scaling up to **1000+ concurrent connections**."
    }
  ],
  "skills": " **Programming Languages** \n\t Python (3.8+), SQL, Bash, JavaScript \n\n**Backend Frameworks** \n\t FastAPI, Flask, Django, Celery \n\n**Frontend Frameworks** \n\t \n\n**API Technologies** \n\t REST/gRPC APIs, Microservices \n\n**Serverless and Cloud Functions** \n\t AWS (EC2, S3, Lambda), Azure \n\n**Databases** \n\t PostgreSQL, MySQL, MongoDB, Redis \n\n**DevOps** \n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git \n\n**Cloud & Infrastructure** \n\t Aruba, Infoblox, VeloCloud, Algosec, TCP/IP, BGP, OSPF, EIGRP, VLANs, VPNs, firewalls, proxies, load balancers \n\n**Other** \n\t Troubleshooting, Analytical, Problem-solving, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka",
  "apply_company": "emagine"
}