{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with 9+ years of experience in designing and developing robust backend services. Proficient in **API Design**, **Scalability**, and **Software Quality**, with a strong focus on observability and incident response practices. Adept in various programming languages including **Ruby**, **Go**, **Typescript**, and **Elixir**, ensuring high-performance system architecture. Proven track record of implementing complex distributed systems and optimizing backend processes, while collaborating effectively across teams to drive successful project outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Designed and developed robust **backend services** leveraging **Ruby** and **Go**, ensuring high quality and scalability of applications.\n• Conducted detailed **API design** for integrating various services, enhancing interoperability and system performance.\n• Implemented observability tools to monitor application health and performance, addressing incidents in real-time and improving response times by **30%**.\n• Collaborated with cross-functional teams to ensure software quality throughout the development lifecycle, contributing to a **20%** reduction in bugs reported post-deployment.\n• Utilized **Typescript** for type safety in backend logic, leading to cleaner and more maintainable code structures.\n• Fostered incident response strategies that improved system resilience and minimized downtime, which increased overall system uptime to **99.5%**.\n• Developed scalable applications by applying best practices for optimization, achieving load balancing that increased performance metrics by **25%** over previous benchmarks.\n• Engaged in code reviews and mentoring junior developers to uphold software quality standards across the team.\n• Participated in agile ceremonies to promote swift development cycles and effective project management, ensuring timely delivery of features."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Focus on **API Design** and **Backend Services** by designing and developing a cloud-based project management tool using **Angular** and **.NET Core**, leading to a **15%** increase in team collaboration efficiency.\nImplemented **Scalability** by creating a microservices architecture with **RabbitMQ** for task orchestration and **Apache Kafka** for handling event-driven data streams, enhancing system scalability.\nLeveraged **Observability** by integrating **Redis** as a caching layer to reduce latency in frequent API calls, resulting in a **25%** boost in system performance.\nDeveloped **RESTful APIs** with **.NET Core** and integrated with a **PostgreSQL** database for real-time data access, emphasizing best practices in **Software Quality**.\nUtilized **Typescript** to build and maintain **ReactJS** and **Tailwind CSS** components, driving a **25%** improvement in user engagement on the platform.\nLed the effort to implement **CI/CD** pipelines using **GitHub Actions**, reducing production deployment errors by **30%**.\nManaged **MSSQL** and **MySQL** databases for data storage and retrieval, optimizing queries for better performance and ensuring a reliable backend infrastructure.\nCollaboration with stakeholders to define system requirements and development timelines, ensuring timely project delivery while incorporating stakeholder feedback into the development process.\nCreated custom charts and graphs using **D3.js** for interactive project status tracking and reporting, enhancing visibility for project stakeholders.\nConducted code reviews and mentorship sessions with junior developers, improving overall team productivity and craftsmanship."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Designed and implemented scalable backend services using **Go** and **Ruby**, enhancing overall system responsiveness by **30%**.\nDeveloped robust **API Design** practices to facilitate seamless integration with third-party services, improving external data interchange capabilities.\nEnsured high **Software Quality** by integrating automated testing and observability tools, reducing incident response times by **25%**.\nCollaborated with cross-functional teams to enhance observability frameworks, providing insights that led to a **15%** decrease in system downtime.\nParticipated in the architecture and deployment of scalable solutions, contributing to a **50%** increase in system capacity handling.\nEngaged actively in code reviews and daily standups, ensuring strong communication and adherence to coding standards across engineering teams.\nProduced detailed technical documentation and user guides, improving team onboarding processes and access to knowledge resources.\nContinually researched and implemented best practices for incident response to drive improvements in application reliability and performance."
    }
  ],
  "skills": "**Programming Languages**\n\tRuby, Go, TypeScript, Elixir, Python\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL, API Design\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Observability, Incident Response\n\n**Cloud & Infrastructure**\n\tScalability\n\n**Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Software Quality",
  "apply_company": "Gigs"
}