{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Cloud Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Cloud Engineer with a robust background in deploying cloud-native systems on **Azure** and implementing **Zero-Trust** architectures. Expertise in **PowerShell** scripting for automation and configuration management, along with proficient skills in **Intune**, **Autopilot**, and **Entra ID** for identity and access management. Familiar with **M365** suite, including tools like **Teams** and **SharePoint**, and experienced in ensuring security and compliance with standards such as MFA, Exchange Online, and hybrid migrations.\n\nBringing over 13 years of experience as a Full Stack Developer, I have a strong foundation in programming languages including **JavaScript/TypeScript**, **Python**, and frameworks like **React**, **Node.js**, and **Django**. Adept at building intelligent platforms that leverage AI/ML capabilities, skilled in CI/CD pipeline development, and dedicated to delivering high-performance applications in compliance-driven industries.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented cloud solutions utilizing **Azure** services, ensuring compliance with security standards like Zero-Trust and **MFA** to protect sensitive data in healthcare and fintech sectors.\nDesigned and managed infrastructure as code (IaC) using **PowerShell** and automation tools, leading to a 40% reduction in deployment times across environments.\nCollaborated on hybrid migration strategies for **Exchange Online** and implemented **Teams** and **SharePoint** integrations to enhance collaboration, achieving a 30% increase in team productivity.\nLed security audits and compliance assessments to ensure adherence to regulations like HIPAA and PCI DSS, reducing compliance risk by 25% within the first year.\nDeveloped automation scripts for device management using **Intune** and **Autopilot**, streamlining endpoint setup processes and achieving a 50% faster onboarding time.\nImplemented continuous monitoring and incident response strategies leveraging **SIEM**, **EDR**, and **XDR** tools, resulting in a significant decrease in security incidents by 35%.\nDesigned and implemented secure access controls and authentication mechanisms with **Entra ID** and **AAD**, reinforcing data protection measures for all cloud-based applications.\nProvided technical expertise in the deployment and management of **Azure** solutions and services, leveraging best practices to deliver fault-tolerant and scalable cloud infrastructures.\nConducted comprehensive training sessions on security practices and compliance for team members, enhancing overall understanding and adherence to established protocols."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **Azure** solutions with a focus on security, compliance, and Zero-Trust architecture, ensuring robust governance across cloud services including **M365** and **Exchange Online**.\nAutomated deployment processes using **PowerShell** and **IaC** strategies, optimizing the provisioning of cloud resources across **Azure** environments.\nManaged application lifecycle with **Intune** and **Autopilot**, streamlining device management and enhancing user experience through **MFA** and secure access practices.\nConfigured and maintained **Entra ID** and **AAD** for comprehensive identity management, ensuring secure access to applications and resources across the organization.\nDeveloped security monitoring frameworks utilizing **EDR**, **XDR**, and **SIEM** for proactive threat detection and incident response, reducing breach incidents by **30%**.\nCollaborated with cross-functional teams to integrate **Teams** and **SharePoint** for enhanced communication and collaboration, improving team productivity by **25%**.\nExecuted hybrid migrations for on-premises systems to **Azure** cloud solutions, ensuring minimal downtime and compliance with organizational security standards.\nDesigned and implemented automation scripts for routine maintenance and compliance checks, increasing operational efficiency by incorporating automation practices across the cloud infrastructure."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and implemented cloud infrastructure solutions utilizing **Azure** services to enhance system reliability, scalability, and security in alignment with **Zero-Trust** architecture principles.\nManaged and automated workflows using **PowerShell** and Infrastructure as Code (**IaC**) tools to streamline deployment processes, achieving a **30%** reduction in manual configurations and improving operational efficiency.\nIntegrated **Microsoft 365 (M365)** services, such as **Teams** and **SharePoint**, to enhance collaboration and communication across distributed teams, increasing productivity metrics by **25%**.\nConfigured and monitored **Intune** for device management and security compliance, deploying a device enrollment strategy that improved device onboarding time by **40%**.\nImplemented **Entra ID** and **AAD** for identity management, facilitating secure user access and ensuring compliance with **MFA** across all services.\nConducted hybrid migration strategies for **Exchange Online**, maintaining data integrity and service availability with minimal downtime during the transition.\nEstablished a comprehensive security framework by integrating **EDR**, **XDR**, and **SIEM** solutions, improving threat detection capabilities and incident response times by **50%**.\nDeveloped automated compliance reporting tools to ensure adherence to regulatory standards and internal policies, significantly reducing audit preparation time by **70%**.\nApplied best practices for **Automation** with periodic reviews to enhance system performance, ensuring efficient resource management and cost optimization in the cloud environment."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n **Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n **Other:**\n\tM365\n\tPowerShell\n\tIntune\n\tAutopilot\n\tEntra ID\n\tAAD\n\tTeams\n\tSharePoint\n\tZero-Trust\n\tSecurity\n\tCompliance\n\tMFA\n\tExchange Online\n\tHybrid Migration\n\tEDR\n\tXDR\n\tSIEM\n\tIaC\n\tAutomation",
  "apply_company": "SBIT AG"
}