{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Sales Engineer with a proven ability to leverage expertise in **Account Management**, **Sales Strategy**, and **Customer Relationship Management**. Over 10 years of experience in optimizing **pumping systems** and engineering solutions, focusing on enhancing customer relationships and delivering impactful sales results. Highly skilled in delivering technical presentations and collaborating effectively with cross-functional teams. Strong background in problem-solving, time management, and communication, complemented by proficiency in **Microsoft Excel**, **Microsoft Word**, and **Microsoft Outlook**. Demonstrated success in developing strategies that lead to significant revenue growth and client retention in competitive markets.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed and implemented effective **Sales Strategies** to enhance customer relationship management and drive sales performance, contributing to a **15% increase** in quarterly revenue.\nUtilized **Microsoft Excel** for data analysis and reporting, enabling informed decision-making for client proposals, resulting in a **25% improvement** in proposal win rates.\nManaged customer accounts through effective **Account Management**, ensuring consistent communication and collaboration with clients to foster long-term relationships.\nConducted presentations and product demonstrations to clients, enhancing customer understanding of **Pumping Systems**, resulting in **30+ successful implementations**.\nLeveraged **Problem Solving** and **Time Management** skills to address and resolve customer issues efficiently, maintaining a **95% customer satisfaction** rating.\nCollaborated with cross-functional teams to align sales strategies with product development, ensuring a cohesive approach to market needs and enhancing overall operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed and implemented sales strategies to optimize the performance of **progressing cavity pumps** and **pumping systems**, driving a sales increase of **20%** over **6 months**.\nUtilized **Microsoft Excel** for data analysis and forecasting sales trends, enhancing the accuracy of monthly reports by **15%**.\nMaintained customer relationship management (CRM) systems to foster client engagement, improving customer satisfaction scores by **30%**.\nCollaborated with cross-functional teams to address client needs, prioritizing effective communication and collaboration to secure high-value contracts, contributing to a **25%** growth in account management success.\nResearched and identified potential markets for **pumping solutions**, resulting in the acquisition of **5** new major clients in **2023**.\nManaged project timelines effectively through strong time management and problem-solving skills, successfully delivering projects **1 month ahead of schedule** on average.\nProvided expert guidance and technical advice on product specifications to clients, leveraging hands-on experience to close deals efficiently and strengthen customer trust."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized expert communication and collaboration skills to manage customer relationships effectively, ensuring satisfaction and long-term engagement.\nEmployed problem-solving techniques to address client inquiries and customize solutions to specific needs in pumping systems.\nLeveraged **Microsoft Excel** for data analysis and sales forecasting, improving decision-making accuracy by **25%**.\nDeveloped and implemented sales strategies that resulted in a **15%** increase in annual revenue through progressive cavity pump sales.\nCoordinated with cross-functional teams to unify pipeline management and improve service delivery timing, enhancing efficiency by **30%**.\nMaintained comprehensive documentation using **Microsoft Word** and **Microsoft Outlook** to streamline communication with clients and internal teams.\nManaged multiple accounts effectively, displaying strong time management capabilities to prioritize client needs and sales targets.\nConducted training sessions for junior sales staff to foster skill development in using **Customer Relationship Management** tools, elevating team performance."
    }
  ],
  "skills": " **Programming Languages**\n\t Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t  \n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure**\n\t \n\n **Other**\n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Pumps, Pumping Systems, Microsoft Excel, Microsoft Word, Microsoft Outlook, Customer Relationship Management, Progressing Cavity Pump, Sales Strategy, Account Management, Problem Solving, Time Management, Communication, Collaboration",
  "apply_company": "NOV"
}