{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Experienced Senior Frontend Engineer with 13+ years in developing high-performance applications, specializing in **JavaScript**, **TypeScript**, **React**, and **Vue.js**. Proven ability to implement **RESTful APIs**, optimize performance, and enhance user experience through responsive and accessible designs. Skilled in **CI/CD** pipelines and a deep understanding of component-based architecture for scalable applications. Strong organizational and communication skills, adept at stakeholder management and mentoring team members. Background in Unix and version control enhances collaborative development and process improvement capabilities. Familiar with the nuances of frontend testing and usability principles to deliver exemplary software solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and frameworks such as **React** (17–18) and **Vue.js** to build dynamic, high-performance user interfaces for healthcare and fintech platforms, ensuring optimal **frontend testing** and **component-based architecture**.\nEnhanced application accessibility and responsiveness by implementing best practices, leading to improved usability metrics by **30%**.\nCollaborated with backend teams to design robust **RESTful APIs** that simplified data interaction, focusing on scalability and performance optimization of the frontend components.\nImplemented **CI/CD** processes using tools like GitHub Actions and CircleCI to streamline development workflows, achieving a **40%** reduction in deployment times.\nMentored junior developers on best practices in **version control** and **frontend testing**, enhancing the overall team’s coding standards and productivity.\nLed stakeholder engagement to gather requirements and feedback, ensuring project alignment with business goals and improving project delivery timelines by **25%**.\nConducted thorough usability testing sessions, utilizing insights to iterate on the design and improve user engagement by **15%** through iterative process improvements.\nMaintained clear communication with cross-functional teams to refine project processes and foster a collaborative development environment.\nDemonstrated strong organizational skills in project management, tracking tasks and progress using tools like Jira, ensuring timely delivery of features.\nChampioned performance optimization efforts that resulted in a **20%** improvement in load times and overall user satisfaction scores."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed interactive front-end applications using **React (18)**, **Vue 3**, and **Next.js**, applying **TypeScript** and **Redux Toolkit** to enhance code quality and maintainability.\n• Implemented **RESTful APIs** ensuring seamless communication with back-end services, optimizing performance based on **user feedback** and usability testing.\n• Championed **Frontend Testing** practices to uphold high-quality standards and improve **responsiveness** across platforms, resulting in a **30%** reduction in UI bugs.\n• Led the transition to a **Component-based Architecture**, which improved development efficiency by **40%** through reusable UI components.\n• Collaborated closely with stakeholders to gather requirements, enhancing **organizational skills** and ensuring alignment with business goals.\n• Conducted regular mentoring sessions to uplift junior developers, improving team performance and fostering a culture of **communication** and shared knowledge.\n• Drove process improvement initiatives in the front-end development lifecycle, implementing **CI/CD** practices that decreased deployment time by **20%**.\n• Focused on **accessibility** and **usability** best practices to ensure compliance with standards, enhancing the overall user experience.\n• Utilized **Scalable Styling** techniques to create maintainable and visually appealing design systems, while ensuring high **performance optimization** for diverse devices.\n• Employed **Version Control** strategies to maintain project integrity and streamlined collaboration within the team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed high-performing and responsive frontend applications using **React (18)** and **Vue.js (3)**, focusing on component-based architecture and performance optimization to enhance user experience.\n• Implemented RESTful APIs for seamless data interaction between frontend and backend services, ensuring efficient data flow and system interoperability.\n• Conducted frontend testing to maintain high quality and reliability of deliverables, applying best practices in CI/CD for consistent deployment.\n• Leveraged **TypeScript** to enhance code quality and maintainability, facilitating better communication and collaboration within the development team.\n• Optimized UI for accessibility compliance adhering to **WCAG 2.1** standards, creating an inclusive experience for all users while focusing on **responsive design** for various devices.\n• Streamlined styling methodologies through scalable styling practices, ensuring uniformity and reusability across the application.\n• Engaged in stakeholder management and communication to align project objectives with organizational goals, contributing to successful project delivery.\n• Mentored junior developers to enhance team skills and promote best practices in frontend development.\n• Employed version control using **Git** for effective collaboration and project management, maintaining a clean and organized codebase throughout the development lifecycle.\n• Championed process improvement initiatives to enhance efficiency and productivity within the frontend engineering team."
    }
  ],
  "skills": "Programming Languages:\n\t•\tJavaScript\n\t•\tTypeScript\n\n**Frontend Frameworks:**\n\t•\tReact\n\t•\tVue.js\n\t•\tAngular\n\n**API Technologies:**\n\t•\tRESTful APIs\n\n**DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\t•\tCI/CD\n\n**Cloud & Infrastructure:**\n\t•\tAWS: ECS, Lambda, RDS, S3\n\t•\tAzure: App Services, Blob Storage, SQL Database\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\n**Databases:**\n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\t•\tRedis\n\n**Other:**\n\t•\tMLflow\n\t•\tAirflow\n\t•\tKubeflow\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\t•\tNginx\n\t•\tLet’s Encrypt\n\t•\tCertbot\n\t•\tUnix\n\t•\tVersion Control\n\t•\tFrontend Testing\n\t•\tComponent-based Architecture\n\t•\tPerformance Optimization\n\t•\tScalable Styling\n\t•\tAccessibility\n\t•\tResponsiveness\n\t•\tUsability\n\t•\tCommunication\n\t•\tOrganizational Skills\n\t•\tStakeholder Management\n\t•\tMentoring\n\t•\tProcess Improvement",
  "apply_company": "Storyblok"
}