{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a results-driven Senior Sales Engineer with a robust background in business development and project management, I excel in driving CRM initiatives and enhancing customer relationships to optimize sales strategies. With 8 years of experience, I have honed my communication skills and proposal management expertise, enabling me to effectively address client needs in diverse environments including water treatment, filtration, softening, reverse osmosis, dewatering, and wastewater treatment.\nMy technical acumen, combined with a deep understanding of the industry, allows me to leverage data-driven insights to guide customer decision-making processes. I have led successful projects, ensuring alignment with customer requirements, driving both satisfaction and retention. My proactive approach in developing business opportunities has consistently resulted in increased revenue. Beyond my technical knowledge, I am committed to fostering strong partnerships and facilitating solutions that meet compliance and operational standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Streamlined project management processes by developing comprehensive proposals that leverage technical expertise in **water treatment**, **filtration**, **softening**, **reverse osmosis**, and **wastewater treatment**, enhancing the effectiveness of sales initiatives.\nEnhanced customer relationship management strategies through effective communication and tailored presentations to understand client needs and deliver value-driven solutions.\nManaged business development efforts by analyzing market trends and competitor offerings, resulting in a **20% increase** in market penetration within the first **6 months** of implementation.\nCollaborated cross-functionally with engineering teams to ensure alignment of product capabilities with customer requirements, leading to a **15% improvement** in customer satisfaction scores.\nDeveloped and maintained strong client relationships that boosted contract renewals by **30%** and fostered repeat business through exceptional service delivery.\nExecuted strategic filtration and reverse osmosis project deployments, achieving **95% compliance** with industry standards and regulations.\nTrained and supported the sales team in technical product knowledge, leading to a **40% increase** in their ability to effectively communicate product benefits to clients.\nUtilized CRM tools to track sales progress and customer feedback, leading to more informed decision-making and strategic adjustments on a monthly basis.\nImplemented innovative solutions for dewatering processes that improved operational efficiency and reduced costs by **25%**, showcasing commitment to excellence in project execution.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and managed client-facing solutions by leveraging **CRM** systems to streamline communication and enhance customer relationship management, resulting in a **30%** improvement in client satisfaction.\nExecuted strategic project management initiatives for business development, ensuring timely delivery of proposals and successful execution of sales strategies, achieving a **25%** increase in quarterly sales.\nApplied expertise in water treatment processes, particularly in **filtration**, **softening**, **reverse osmosis**, and **wastewater treatment**, to provide customized solutions for clients, leading to **15%** operational cost savings.\nConducted detailed assessments of client needs in the areas of **dewatering** and wastewater treatment, facilitating the development of tailored solutions that align with their operational goals.\nCollaborated with cross-functional teams to drive proposal management processes, ensuring comprehensive technical documentation and effective communication with stakeholders.\nMaintained strong and effective communication with clients throughout the project lifecycle, from initial engagement to post-sale support, enabling repeat business and customer loyalty."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed effective strategies for managing customer relationships within the **CRM** framework, enhancing overall customer satisfaction and loyalty.\nLed proposal management initiatives, resulting in **30%** more successful project bids in **water treatment** solutions, including filtration, softening, reverse osmosis, and dewatering systems.\nManaged key projects in **wastewater treatment**, ensuring timely delivery and compliance with industry standards, achieving project completion rates within **15%** ahead of schedule.\nConducted detailed analysis of customer specifications and needs to provide tailored solutions in water treatment, leading to a **25%** increase in client engagement.\nImplemented business development tactics that identified new market opportunities, contributing to a year-over-year revenue growth of **20%**.\nCollaborated with cross-functional teams to ensure seamless communication and alignment on sales goals and project objectives, fostering a unified approach to customer service.\nTrained junior sales engineers on industry best practices, enhancing team capabilities and knowledge sharing, resulting in a **40%** improvement in team responsiveness to customer inquiries.\nUtilized strong project management skills to oversee multiple concurrent projects, keeping stakeholders informed and ensuring that all customer requirements were met efficiently.\nProvided expert advice and recommendations on filtration and softening technologies, driving more informed decision-making for clients and improving project proposals.\nMaintained robust communication channels with clients, ensuring transparency and trust throughout the sales cycle and post-implementation support."
    }
  ],
  "skills": "**Other**\n\tCRM, water treatment, filtration, softening, reverse osmosis, dewatering, wastewater treatment, proposal management, project management, business development, communication, customer relationship management\n\n**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\t\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**\n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**CI/CD & Infrastructure as Code**\n\tTerraform, Ansible, Helm, Docker Compose",
  "apply_company": "Nijhuis Saur Industries"
}