{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior R&D Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dynamic and detail-oriented Senior R&D Engineer with 8 years of experience in Full Stack Development and a proven record in crafting high-performance solutions. Proficient in **C++**, **C**, and **GIT**, I excel in electronics design and thrive in collaborative team environments, leveraging strong problem-solving and communication skills. My extensive background in cloud technologies, enterprise application development, and compliance standards enhances my capability to deliver robust engineering solutions.\n\nSpecializing in modern web technologies, I also bring expertise in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, along with frameworks including **React**, **Next.js**, and **Node.js**. I have successfully led projects that integrate predictive analytics and intelligent automation while ensuring alignment with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. My hands-on experience with microservices architecture, event-driven systems, and CI/CD processes further empowers my contributions in the R&D space.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior R&D Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C++** and **C** to develop and optimize algorithms for advanced electronics design, enhancing product efficiency by **30%**.\nLed projects within a collaborative team environment, fostering strong **communication** and **teamwork** to achieve project milestones on-time and within budget.\nImplemented version control best practices using **GIT**, ensuring seamless collaboration among team members and maintaining code integrity across **5+** active projects.\nApplied **MFC** for developing user interfaces in embedded systems, improving usability and user experience in consumer electronics.\nConducted rigorous testing and debugging of systems on **STM32**, achieving a **20%** reduction in error rates during initial product launches.\nEmployed problem-solving skills to troubleshoot and resolve complex electronics issues, resulting in faster time-to-market for **3** key product lines.\nParticipated in cross-functional teams to establish processes for effective electronics design, enhancing overall project workflow and efficiency.\nProvided mentorship to junior engineers, sharing knowledge on best practices and driving continuous improvement in engineering processes."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **C++** and **C** for developing efficient algorithms and systems in electronic design, improving product performance and reliability in projects by **30%**.\nCollaborated with cross-functional teams to troubleshoot and resolve technical issues, enhancing problem-solving skills and ensuring seamless communication across departments, leading to a **15%** increase in project delivery speed.\nEmployed **GIT** for version control in collaborative software development, maintaining code integrity and facilitating team collaboration on complex electronics projects.\nDesigned and prototyped innovative electronics components that increased device functionality while reducing production costs by **20%**, showcasing expertise in electronics design.\nApplied **MFC** for creating user interfaces in embedded systems, improving user experience and system interaction by **40%**.\nLed teamwork initiatives within the engineering department, fostering an environment of collaboration and knowledge sharing that resulted in successful project completions ahead of schedule by **25%**.\nLeveraged **STM32** microcontrollers to develop embedded solutions tailored for client specifications, enhancing product features and client satisfaction.\nRegularly conducted technical presentations to communicate project updates and technical concepts effectively to stakeholders, reinforcing strong communication skills."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Demonstrated problem-solving skills by designing and optimizing advanced electronic systems using **C++** and **C**, ensuring high performance and reliability across various applications.\nCollaborated with cross-functional teams using **GIT** for version control, fostering strong communication and teamwork to enhance project efficiency and outcomes.\nApplied deep knowledge of **MFC** for developing user interfaces, improving device interaction functionality and user experiences in various R&D projects.\nEngineered innovative solutions involving **STM32** microcontrollers for embedded systems, delivering projects with performance metrics exceeding industry standards by **30%**.\nUtilized comprehensive electronics design to prototype and test new circuit boards, leading to the successful integration of **5** new sensor technologies in product lines.\nResolved complex technical challenges through meticulous analysis and application of best practices, resulting in reduced development time by **20%**.\nConducted thorough testing and validation on new designs to ensure compliance with specifications, enhancing product reliability by achieving a **99%** pass rate in quality assurance assessments."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, C++, C\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, GIT, MFC, STM32, electronics design, problem-solving, communication, teamwork, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Docker Compose",
  "apply_company": "Kingspan Light + Air"
}