{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Go Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Go Engineer with over 10 years of experience specializing in Linux-based environments and containerized applications. Proficient in **Golang** and experienced with **Kubernetes**, **KVM**, **QEMU**, and **libvirt**, enabling the development and management of scalable, efficient cloud-native systems. Strong expertise in version control using **git** and adept at debugging and resolving software bugs, ensuring high-quality software delivery.\nSkilled in building robust software solutions with a solid foundation in **JavaScript/TypeScript**, **Python**, **Flutter**, and frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Demonstrated track record of leading enterprise platform development, integrating AI/ML capabilities, and ensuring compliance with standards like HIPAA and PCI DSS. Committed to delivering maintainable solutions that drive significant real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Go Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained applications with a focus on **Golang**, enhancing performance and reliability while tackling software bugs effectively across various platforms.\n•\tUtilized **Kubernetes** and **Containers** to deploy scalable, cloud-native applications, enabling efficient resource management and high availability.\n•\tImplemented solutions to monitor and optimize **CPU Architectures**, ensuring application stability and performance on diverse hardware configurations.\n•\tStreamlined development processes by integrating **git** for version control, facilitating seamless collaboration and code management across a team of 9 engineers.\n•\tManaged virtualized environments using **KVM**, **libvirt**, and **QEMU**, resulting in increased flexibility and reduced infrastructure costs by 30%.\n•\tLed initiatives to optimize container orchestration with **Kubevirt**, leveraging its capabilities to enhance virtual machine deployment within Kubernetes clusters.\n•\tRefactored legacy systems, addressing and resolving **software bugs**, which improved overall application reliability by 25%.\n•\tConducted code reviews and implemented best practices for application development, ensuring adherence to high-quality coding standards.\n•\tFacilitated cross-functional collaboration with DevOps teams to optimize CI/CD pipelines, enhancing deployment frequency by 40% through automated testing and integration.\n•\tImplemented monitoring and logging systems using **prometheus** and **grafana** for proactive incident response, reducing issue resolution times by 50%."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Linux** and **Kubernetes** to develop and maintain containerized applications, ensuring seamless deployment and scalability across cloud environments.\nDesigned and implemented distributed systems using **Golang**, enhancing performance and reducing latency by **30%** compared to previous implementations.\nCollaborated in a team environment with **git** for version control, managing codebase effectively and improving collaboration by tracking changes across projects.\nEmployed **KVM**, **libvirt**, and **QEMU** for virtualization solutions, optimizing resource allocation and system performance for various applications.\nDiagnosed and resolved software bugs by applying robust debugging techniques and rigorous testing methodologies, resulting in a **25%** reduction in issue resolution time.\nDeveloped and maintained functionality for container orchestration using **Kubevirt**, improving deployment efficiency and system reliability.\nDesigned solutions to accommodate various **CPU architectures**, ensuring compatibility and performance across diverse environments.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Golang** to develop and maintain scalable backend services, ensuring high performance and reliability in delivery across both cloud and on-premise environments with **Kubernetes** and **Kubevirt**.\nImplemented containerization best practices using **Containers** and managed lifecycle with **KVM**, **libvirt**, and **QEMU** to enhance deployment speed and resource efficiency, achieving a deployment time reduction of up to **40%**.\nConducted extensive performance tuning and bug fixing to optimize system functionality, successfully identifying and resolving **15** software bugs within the first **3 months** of project initiation.\nCollaborated with version control systems using **git** for effective code management, ensuring continuous integration and delivery pipelines are in place for our code base.\nParticipated in architecture reviews and discussions, focusing on efficient **CPU Architectures** and their impact on software performance to provide strategic improvements in product development.\nMentored junior engineers on best practices in code optimization, container orchestration, and performance monitoring within a **Golang** environment.\nDesigned automated testing cycles to ensure code quality and reduce production bugs, leading to a **30%** decrease in post-deployment issues.\nEngaged in cross-functional teams, providing insights on system reliability, enhancing overall system uptime to **99.9%**, and ensuring compliance with security standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tGolang, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tNginx, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tLinux, Containers, Git, Kubevirt, KVM, libvirt, QEMU, libguestfs, CPU Architectures, Software Bugs\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, Let’s Encrypt, Certbot",
  "apply_company": "SUSE"
}