{
  "name": "Mariusz Jan Skobel",
  "role_name": "Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Results-oriented Software Engineer with over 10 years of experience in full stack development, specializing in **React**, **Python**, **FastAPI**, **TypeScript**, and **SQL**. Proficient in building high-performance applications using **Redux**, **Jest**, and **React Testing Library**, while ensuring robust testing with **PyTest**. Experienced in CI/CD practices to streamline deployment processes, leveraging tools such as **Git** and **GitHub Enterprise** within agile methodologies like Scrum and managing documentation in **Jira** and **Confluence**.\n\nDemonstrated ability to lead the development of cloud-native solutions deployed on **Azure** and **AWS**, integrating AI/ML functionalities for intelligent decision-making and real-time analytics. Strong background in microservices architecture and event-driven systems, maintaining compliance with industry standards such as HIPAA, FHIR, and PCI DSS. \n\nPassionate about developing impactful systems and enhancing remote teamwork through clear communication and collaboration. Hands-on experience in MLOps with tools including **MLflow**, **Airflow**, and **Kubeflow**, managing production workflows and creating ML pipelines.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable full-stack applications utilizing **React** and **Python (FastAPI)**, with a focus on efficient data handling using **SQL** for both healthcare and finance sectors.\n• Leveraged **TypeScript** to enhance code quality and maintainability across multiple projects, improving team collaboration and reducing bugs by **30%**.\n• Developed state management solutions with **Redux**, incorporating effective communication with stakeholders to ensure alignment with requirements and timely project updates.\n• Integrated automated testing frameworks such as **Jest** and **PyTest** to guarantee code robustness, achieving a test coverage of over **85%** for critical components.\n• Implemented CI/CD pipelines utilizing **GitHub Enterprise** to automate deployments and streamline workflow, resulting in a **40%** decrease in release times.\n• Actively participated in Scrum ceremonies, utilizing **Jira** and **Confluence** for transparent project tracking and documentation, enhancing remote teamwork efficiency by implementing agile methodologies.\n• Adapted AI-assisted development tools to enhance productivity and code quality, ensuring high standards of deliverables in response to team objectives.\n• Facilitated effective communication across distributed teams, leading to an improved response rate in project feedback cycles and faster decision-making.\n• Mentored junior developers on best practices in using **React** and **Python**, contributing to approximately **5%** increase in team performance metrics through knowledge sharing."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)** and **TypeScript** to develop user-friendly front-end applications with enhanced performance, improving user experience in financial dashboards and admin portals by **30%**.\nEmployed **Python (FastAPI, Django)** for backend development, enhancing the scalability and maintainability of financial platforms with a microservices-based architecture, resulting in a **25%** increase in system throughput.\nImplemented robust testing frameworks including **Jest** and **React Testing Library**, achieving a code coverage of over **85%** for front-end components, ensuring high-quality delivery in a **CI/CD** environment.\nCollaborated with cross-functional teams through **Scrum** methodologies, effectively managing project workflows using tools like **Jira** and **Confluence**, leading to a **15%** improvement in project delivery timelines.\nConducted real-time analytics and transaction monitoring dashboards utilizing **D3.js** and **Power BI Embedded**, empowering operation teams to detect anomalies and provide actionable insights significantly faster.\nIntegrated asynchronous communication strategies using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, establishing a responsive event-driven architecture that improved alert and transaction processing speed by **40%**.\nDeveloped and optimized ETL pipelines using **Apache Airflow** and **Azure Data Factory** for real-time data ingestion, facilitating continuous access to critical financial data.\nImplemented machine learning models for fraud detection with **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, proactively identifying suspicious activity, thereby reducing fraud incidents by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **React (18)**, **TypeScript**, and **Redux** in developing responsive frontend applications, contributing to a 30% increase in user engagement through enhanced interactivity and modern UI patterns.\nEngineered backend services using **Python (FastAPI)**, ensuring high availability and scalability across critical modules by processing over **1M** transactions per day with low latency.\nImplemented CI/CD practices with **GitHub Enterprise** and **Jira**, leading to a **50%** reduction in deployment times and improved collaboration among remote teams.\nConducted rigorous testing using **Jest**, **React Testing Library**, and **PyTest**, achieving a **95%** test success rate that ensured high code quality and reliability.\nCollaborated in a **Scrum** environment, utilizing **Confluence** for documentation and enhancing team productivity by streamlining communication and task management.\nEmployed AI-assisted development tools to optimize coding efficiency, which resulted in a **20%** faster feature implementation cycle.\nContributed to database management using **SQL** with **PostgreSQL** and **Redis**, optimizing query performance and data retrieval times by **40%** in high-traffic scenarios.\nFostered strong communication skills and remote teamwork techniques, leading to successful project deliveries and alignment across cross-functional teams."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript, JavaScript\n\n**Frontend Frameworks:**\n\tReact, Redux, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, SQL, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, PyTest, Jest, React Testing Library, Scrum, Jira, Confluence, GitHub Enterprise, Git, AI-assisted development tools, communication skills, remote teamwork"
}