{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cloud Support Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Cloud Support Engineer with 8 years of experience, specializing in **AWS**, **Azure**, and **GCP** to deliver high-performance solutions. Proficient in implementing **IAM**, **RBAC**, and **data governance** to ensure robust security and compliance with industry standards. Skilled in managing **encryption**, **data privacy**, and maintaining **data quality monitoring** to preserve data integrity.\n\nExpert in **Python**, **Java**, and **NodeJS**, effectively leveraging these programming languages to optimize backend processes and support data replication efforts. Experienced in network protocols such as **TCP/IP**, **HTTP**, **HTTPS**, and **DNS** to troubleshoot and resolve connectivity issues. Well-versed in using diagnostic tools and **load balancers** to enhance system reliability and performance, alongside implementing **firewalls** for enhanced security.\n\nWith a strong foundation in **machine learning** processes, I am adept at developing and serving ML models, utilizing tools like **MLflow**, alongside my full stack experience in frameworks such as **React**, **Node.js**, and **Django**. My commitment to continuous improvement is reflected in my capability to communicate effectively with cross-functional teams to enhance user experience and operational efficiency.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Support Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Provided expert support for cloud services including **AWS**, **Azure**, and **GCP** to facilitate efficient **data governance**, **encryption**, and compliance with industry standards.\n• Managed **IAM**, **RBAC**, and encryption strategies to ensure robust **data privacy** and secure data handling in cloud environments.\n• Monitored and optimized **data quality** and **data lineage** across cloud platforms, implementing automated diagnostics using advanced **diagnostic tools**.\n• Applied strong **communication skills** to collaborate with cross-functional teams in diagnosing and resolving technical issues related to cloud services.\n• Collaborated in maintaining secure environments through management of **load balancers**, **firewalls**, and ensuring adherence to **TCP/IP**, **HTTP**, and **HTTPS** protocols.\n• Implemented **data replication** strategies to enhance data availability and consistency across heterogeneous environments using **ODBC** and **JDBC**.\n• Architected cloud-native solutions leveraging **Python** and **Node.js**, ensuring seamless **data integration** with backend services using RESTful APIs.\n• Led initiatives in applying **MFA** and **Public Key Infrastructure** for enhancing security measures across cloud platforms, adhering to best practices in **data security**.\n• Delivered detailed documentation and training sessions on cloud support processes, enhancing team knowledge and support efficiency.\n• Utilized analytical tools to facilitate real-time monitoring and reporting of cloud service performance metrics, driving improvements in service delivery."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Managed data governance and ensured data quality monitoring across services by implementing **Snowflake** and **AWS** solutions\n• Oversaw identity access management (IAM), role-based access control (RBAC), and data encryption, enhancing security protocols in multi-cloud environments, specifically using **Azure** and **GCP**\n• Developed robust SQL queries for **data replication** and performed diagnostics to ensure high availability and performance across applications\n• Collaborated on implementing multi-factor authentication (MFA), **Public Key Infrastructure (PKI)**, and **SAML** for secure access management within cloud platforms\n• Built resilient data pipelines and integrated command-line tools working with **Python**, ensuring seamless data flow and operational efficiency in cloud infrastructure\n• Provided support and troubleshooting expertise for environments using **Java** and **NodeJS**, improving system stability and user experience\n• Enhanced incident response protocols by leveraging TCP/IP, HTTP, and HTTPS for secure communications, resulting in a **30% reduction** in response time\n• Employed diagnostic tools for real-time monitoring, contributing to a **50% improvement** in system uptime through proactive management strategies\n• Developed comprehensive documentation for operational processes, incorporating data lineage to enhance transparency and compliance within cloud operations\n• Maintained high levels of communication skills within cross-functional teams to ensure alignment and clarity in project objectives and outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **AWS**, **Azure**, and **GCP** to manage cloud infrastructure, ensuring high availability and quick recovery for e-commerce applications across **9** global data centers.\nDesigned and implemented robust **IAM** policies and role-based access control (**RBAC**), ensuring secure and compliant user authentication and data governance policies for over **1000** active users.\nUtilized **Python** and **Node.js** to construct microservices architecture, facilitating seamless data flow and integration with cloud services like **Snowflake** for analytics and reporting, improving data-driven decision-making processes by **30%**.\nConducted performance tuning and optimization of application protocols such as **TCP/IP**, **HTTP**, and **HTTPS** to enhance security and user response times by **25%**, achieving faster data retrieval from databases.\nImplemented data privacy measures, encryption protocols, and secure communications using **Public Key Infrastructure (PKI)**, **SAML**, and **SCIM** to protect sensitive user information and ensure compliance with GDPR standards.\nEstablished monitoring and logging systems using **diagnostic tools**, providing real-time insights and proactive management of application performance, reducing downtime by **15%**.\nCoordinated data replication strategies and quality monitoring to ensure data integrity and lineage, enabling accurate reporting on cloud-hosted solutions, which improved operational transparency significantly.\nCollaborated with cross-functional teams to facilitate problem-solving and enhance service documentation, leveraging strong communication skills to maintain clear team interaction.\nEnsured proper firewall configurations and load balancer setups, guaranteeing resilient service delivery with a maximum system uptime of **99.9%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, JavaScript/TypeScript (React, Vue, Angular), NodeJS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tHTTP, HTTPS, ODBC, JDBC, SAML, SCIM, JWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL, Snowflake\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP, IAM, load balancers, firewalls, network technologies (TCP/IP, DNS)\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), data governance, encryption, data privacy, data quality monitoring, data lineage, MFA, Public Key Infrastructure, diagnostic tools, communication skills, operating systems, data replication",
  "apply_company": "Snowflake"
}