{
  "name": "Tomasz Lee",
  "role_name": "Software Engineer (Back End)",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-oriented Software Engineer with 9+ years of experience in developing and managing **microservices**, **distributed systems**, and **asynchronous communication patterns**. Proficient in **PHP**, **TypeScript**, **JavaScript**, and **RabbitMQ** for backend services, ensuring robust messaging and observability in complex applications. Demonstrated expertise in **infrastructure management** and employing effective **monitoring** strategies to optimize system performance. A collaborative team player skilled in problem-solving and delivering high-quality solutions. Original strengths include deep technical proficiency in both frontend and backend technologies, with hands-on experience in frameworks such as **ReactJS**, **NextJS**, and **.NET**, coupled with a strong dedication to streamlining development processes and leading projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer (Back End)",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **TypeScript**, **JavaScript**, and **PHP** for backend development, ensuring robust and scalable applications.\nDesigned and implemented a **microservices** architecture, enhancing system modularity and supporting distributed systems.\nIntegrated **RabbitMQ** for asynchronous communication, improving task queuing and system reliability.\nDeveloped observability features for real-time monitoring, enhancing problem-solving capabilities and operational efficiency.\nManaged infrastructures to support application deployment and scaling, improving performance metrics by over **30%**.\nSpearheaded the design and development of a web-based customer management platform using **.NET 7** and **ReactJS**, improving user satisfaction by **25%**.\nUtilized **Redis** for caching frequently accessed data, cutting database load and improving response times by **35%**.\nDeveloped RESTful APIs with **.NET**, integrated with a **MongoDB** database for seamless data access across services.\nImplemented CI/CD pipelines on **Azure DevOps**, reducing deployment time by **40%**.\nOptimized **MSSQL** database queries and indexing, lowering average query execution time by **20%**.\nCollaborated with UX/UI designers to enhance the platform’s user interface, leading to an improved user experience.\nDeveloped a reporting engine using **D3.js** and **Three.js** for interactive data visualizations.\nImplemented JWT-based authentication and authorization, securing the application effectively."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **TypeScript** and **JavaScript** to design and develop cloud-based project management tools, leading to a **15%** increase in team collaboration efficiency.\nImplemented a microservices architecture leveraging **RabbitMQ** for task orchestration and handling of **asynchronous communication patterns**, enhancing system scalability.\nOptimized system performance by integrating **Redis** as a caching layer, resulting in a **25%** reduction in latency for frequent API calls.\nDeveloped and maintained RESTful APIs with **PHP** and integrated them with a **PostgreSQL** database for high-performance real-time data access.\nBuilt and enhanced UI components with **ReactJS** and **Tailwind CSS**, leading to a **25%** improvement in user engagement across the platform.\nLed the implementation of CI/CD pipelines via **GitHub Actions**, which cut down production deployment errors by **30%**.\nManaged and optimized **MSSQL** and **MySQL** databases for efficient data storage and retrieval, significantly improving query performance.\nEngaged with stakeholders to define system requirements and development timelines, ensuring timely delivery of projects.\nDeveloped custom charts and graphs with **D3.js** for interactive project status tracking and reporting.\nConducted comprehensive code reviews and mentorship sessions for junior developers, fostering a collaborative team environment and enhancing overall productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and maintained distributed systems using **TypeScript**, **JavaScript**, and **RabbitMQ**, enhancing application performance and reliability.\n• Implemented asynchronous communication patterns to improve system responsiveness, achieving a **20%** increase in throughput.\n• Designed and built microservices architecture, streamlining the deployment and scaling processes across various applications.\n• Collaborated with cross-functional teams to ensure effective infrastructure management and observability within the software development lifecycle.\n• Optimized message brokers for efficient data handling, leading to a **15%** reduction in processing time during peak load scenarios.\n• Engaged in problem-solving initiatives to troubleshoot and refine system performance, delivering solutions under tight deadlines.\n• Employed **PHP** for backend implementations that required seamless integration with existing infrastructures, improving operational efficiency.\n• Participated in continuous monitoring and observability practices, ensuring system reliability and performance metrics are met.\n• Actively contributed to code reviews and team collaborations, enhancing software quality and team synergy.\n• Delivered comprehensive documentation and user guides to improve knowledge transfer and support across teams."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tTypeScript, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tMicroservices, NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Messaging & Caching**\n\tRabbitMQ, Apache Kafka, Redis\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tBlockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Problem-solving, Collaboration, Observability, Monitoring, Infrastructure management, Distributed systems, Asynchronous communication patterns"
}