{
  "name": "Tomasz Lee",
  "role_name": "Senior Data Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Data Engineer with 9+ years of experience in **Data Analytics**, **Data Mining**, and **Data Visualization**. Proficient in **Python** and **SQL** for analysis and data manipulation, alongside strong knowledge of **JavaScript** for developing interactive visualizations. Experienced with tools such as **Looker Studio**, **Tableau**, and **Apache Superset** to effectively communicate insights. Demonstrated problem-solving skills and ownership in delivering impactful data solutions, collaborating with cross-functional teams to streamline processes and drive data-driven decisions. Adept in utilizing statistical methods and techniques to analyze and leverage complex datasets to inform strategy.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** for data analytics and data mining processes to extract insights and optimize system performance.\nDeveloped data visualization dashboards using **Tableau** and **Looker Studio**, enhancing data-driven decision-making across teams.\nCollaborated with cross-functional teams to define data collection strategies, improving data integrity and accuracy by **30%**.\nImplemented SQL for data manipulation and reporting, optimizing database queries to enhance performance by **20%**.\nConducted statistical analysis to support data-driven initiatives and identify key trends, improving project outcomes.\nLed problem-solving sessions to address data discrepancies and system inefficiencies, ensuring seamless data flow.\nFostered strong communication within teams to align technical solutions with business needs, enhancing project ownership.\nSpearheaded training sessions on data best practices and visualization techniques, boosting team skill levels by **40%**.\nDeveloped and maintained robust data pipelines to ensure reliability and efficiency in data processing tasks."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Utilized **Python** and **SQL** for data analytics, enhancing the accuracy of data-driven decision-making processes by over **20%**.\n• Developed data mining algorithms to extract valuable insights from complex datasets, leading to a **30%** reduction in processing time.\n• Employed **JavaScript** for building interactive data visualizations using **Looker Studio** and **Tableau**, improving stakeholder engagement by **25%**.\n• Collaborated with cross-functional teams to drive data integration projects, ensuring timely delivery with a focus on ownership and clear communication.\n• Created statistical models to forecast trends and measure performance, significantly improving strategic project outcomes.\n• Leveraged **Apache Superset** for advanced data visualization and reporting, streamlining data presentation workflows.\n• Conducted comprehensive code reviews and provided mentorship using **JavaScript** and **Python**, resulting in a **15%** increase in team productivity.\n• Implemented robust collaboration tools, fostering an environment of problem-solving and creativity among team members.\n• Led initiatives to optimize data storage solutions using **MSSQL** and **MySQL**, enhancing retrieval speeds by **40%**.\n• Developed engaging dashboards for real-time data monitoring, empowering teams with actionable insights and metrics."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Applied **Data Analytics** techniques to derive insights from large data sets, enhancing operational efficiency.\nLeveraged **Data Mining** methodologies to uncover hidden patterns and trends, driving informed decision-making.\nUtilized **Data Science** practices, including **Python** programming, to implement predictive models and algorithms.\nEmployed **Statistics** to analyze data reliability and accuracy, ensuring robust data underpins business strategies.\nDeveloped intuitive **Data Visualization** solutions using tools like **Tableau** and **Looker Studio**, facilitating clear data communication.\nCollaborated effectively with cross-functional teams, demonstrating strong **Collaboration** and **Communication** skills to align project goals.\nExercised **Problem-Solving** abilities to troubleshoot data discrepancies and optimize data flows, leading to a **15%** reduction in processing time.\nTook ownership of data integration projects, successfully migrating over **5000** records while maintaining data integrity.\nEngaged in regular code reviews and team standups to foster a culture of continuous improvement and maintain high coding standards.\nProvided mentorship to junior engineers, enhancing team capability through knowledge sharing on **SQL** best practices.\n"
    }
  ],
  "skills": "  **Programming Languages**\n\t Python, JavaScript\n\n  **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\t HTML, CSS, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\t RESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\t AWS, Azure\n\n  **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\n  **DevOps**\n\t CI/CD pipelines\n\n  **Cloud & Infrastructure**\n\t Collaboration, Communication, Ownership\n\n  **Other**\n\t Data Analytics, Data Mining, Data Science, Statistics, Looker Studio, Tableau, Apache Superset, Data Visualization, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Redux, Problem-Solving",
  "apply_company": "Canonical"
}