{
  "name": "Marcin Karol Kotlinski",
  "role_name": "C++ Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a skilled C++ Developer with 8 years of extensive experience, I am proficient in designing and implementing high-performance applications using **C++**, **STL**, and **Boost**. My solid understanding of multithreaded applications and network programming ensures robust software solutions that optimize efficiency and performance. I possess strong capabilities in performance analysis, log analysis, and bug fixing, enabling me to deliver reliable and scalable applications across diverse environments including **Windows** and **Linux**. Additionally, I have experience working with **PostgreSQL** and **MS SQL Server** to enhance data management strategies.\n\nBeyond my technical prowess, I have successfully led development projects in the healthcare and financial sectors, focusing on compliance with standards like HIPAA and PCI DSS. I also bring a deep understanding of algorithms and architectures that underpin complex software systems, ensuring quality and operational excellence.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "C++ Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C++** and **STL** to architect and develop high-performance applications for processing large datasets efficiently, improving execution time by **30%**.\nImplemented multithreaded applications, leveraging **C++** for optimized performance and resource management, resulting in enhanced responsiveness and reliability.\nConducted performance analysis and log analysis using **C++** tools and methodologies to identify bottlenecks and bugs, reducing issue resolution time by **25%**.\nDeveloped and maintained backend services with **PostgreSQL** and **MS SQL Server**, ensuring robust data storage solutions and efficient retrieval processes.\nCollaborated on network programming initiatives to enhance client-server architectures, integrating secure communications protocols for improved application security.\nDesigned algorithms for optimization tasks, focusing on efficiency and scalability which led to a **15%** improvement in computation speed.\nPerformed extensive bug fixing and system testing, achieving **95%** defect resolution prior to deployment.\nWorked proficiently in both **Windows** and **Linux** environments, demonstrating adaptability to platform-specific challenges and requirements.\nMaintained documentation and code commenting in English, ensuring clarity and readability for future development and maintenance efforts.\nEmployed **Boost** libraries to accelerate development processes and extend the functionalities of **C++** applications, providing additional tooling to support complex operations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **C++** and **STL** to develop and optimize multithreaded applications, enhancing system performance and reliability for high-traffic environments.\nImplemented advanced algorithms and data structures to improve application efficiency, contributing to a **20%** increase in response times under load.\nLeveraged **PostgreSQL** and **MS SQL Server** for robust data management, ensuring data integrity and accessibility across applications while reducing query processing times by **15%**.\nConducted performance analysis and log analysis to identify bottlenecks and improve application throughput, achieving a **30%** reduction in resource consumption for backend processes.\nEmployed **Windows** and **Linux** environments to ensure cross-platform compatibility and efficient deployment of applications.\nIntegrated **Boost** libraries to enhance development speed and code maintainability, streamlining project workflows and reducing bug incidence by **25%**.\nExecuted thorough bug fixing processes across all code bases, improving overall software quality and stability.\nDemonstrated strong English proficiency in documentation and collaboration with international teams, ensuring seamless communication and project updates."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed optimized and efficient algorithms in **C++** for high-performance applications, focusing on memory management and runtime efficiency in both **Windows** and **Linux** environments.\nUtilized the **Standard Template Library (STL)** to enhance code maintainability and facilitate the development of complex data structures maintaining a high level of performance and scalability.\nImplemented multithreaded applications employing **Boost** libraries to achieve concurrency, enhancing application responsiveness and processing efficiency by up to **30%**.\nConducted thorough performance analysis and log analysis to identify bottlenecks, achieving a performance improvement of **25%** across critical functionalities through bug fixing and code optimization.\nDesigned and maintained **PostgreSQL** and **MS SQL Server** database interactions, ensuring efficient data handling and query optimization to support high-demand application workflows.\nLed the integration of network programming techniques to establish robust communication protocols, significantly improving data transfer speeds by **40%**.\nCollaborated with cross-functional teams to troubleshoot and resolve application bugs, increasing system stability and reliability by **15%**.\nEnsured comprehensive documentation for codebase, promoting knowledge sharing and facilitating onboarding processes for new developers to enhance team efficiency.\nDemonstrated strong English proficiency in technical communications, ensuring clarity and precision in documentation and team discussions."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C++, C#, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, MS SQL Server\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Algorithms, Network Programming, Multithreaded Applications, Performance Analysis, Log Analysis, Bug Fixing, English Proficiency, Let’s Encrypt, Nginx, Certbot"
}