{
  "name": "Tomasz Lee",
  "role_name": "Technical Support Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Technical Support Engineer with 9+ years in troubleshooting complex issues and providing Tier 3 support. Proficient in **Linux**, **Unix**, and cloud platforms including **AWS**, **GCP**, and **Azure**. Experienced in DB analysis and log review to optimize system performance and reliability. Strong knowledge of monitoring tools like **Grafana** and **Prometheus**. Demonstrated ability to self-manage, multitask, and prioritize effectively within fast-paced environments. Excellent communication and teamwork skills, complemented by a commitment to continuous self-learning and professional development.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Technical Support Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Provided **Tier 3 support** and **troubleshooting** for complex technical issues, ensuring timely resolution and customer satisfaction with a **95%** satisfaction rate.\nConducted thorough **DB analysis** and **log review** to identify and resolve performance bottlenecks, enhancing system reliability.\nManaged Linux and Unix systems, ensuring optimal performance and uptime, resulting in a **99.9%** SLA compliance rate.\nUtilized **AWS**, **GCP**, and **Azure** cloud services for deploying and managing critical business applications, ensuring cost-effectiveness and scalability.\nMonitored system metrics using **Grafana** and **Prometheus**, providing real-time insights that improved response times by **30%**.\nDemonstrated exceptional **self-management** and **multitasking** skills while prioritizing competing priorities in a fast-paced environment.\nCommunicated effectively across teams to facilitate knowledge sharing and collaboration, resulting in streamlined workflows and enhanced teamwork.\nEngaged in continuous **self-learning** to keep updated with the latest technologies and best practices, driving innovation in support processes."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Provided Tier 3 support for cloud services on **AWS**, **GCP**, and **Azure**, ensuring high availability and reliability of systems.\nUtilized **Linux** and **Unix** environments to troubleshoot and resolve complex technical issues, achieving a **95%** first-contact resolution rate.\nConducted thorough DB analysis and log review to identify and fix underlying problems, resulting in a **40%** reduction in recurring incidents.\nLeveraged **Grafana** and **Prometheus** for system monitoring and performance metrics, enhancing proactive incident management.\nImplemented self-management strategies to prioritize tasks and manage multiple support requests efficiently, maintaining an average response time of **2 hours**.\nCollaborated with cross-functional teams to communicate progress and updates, fostering strong teamwork and adherence to timelines.\nPromoted a culture of self-learning by mentoring new team members and sharing knowledge on best practices in troubleshooting and system management.\nDemonstrated excellent communication skills, effectively conveying technical information to non-technical stakeholders, which improved user satisfaction scores by **20%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Provided **Tier 3 support** for internal CRM systems, utilizing troubleshooting skills to resolve complex issues, ensuring minimal downtime for sales teams.\nConducted **DB analysis** and log review of SQL Server databases to enhance query efficiency by **30%**, leading to faster access to customer information.\nPerformed system monitoring and troubleshooting on **Linux** and **Unix** environments, ensuring high availability and performance.\nUtilized **AWS** and **Azure** cloud services for deployment and scaling solutions, contributing to robust infrastructure management.\nImplemented monitoring solutions using **Grafana** and **Prometheus** to oversee system health and performance metrics, resulting in a **25%** reduction in incident response time.\nManaged integrations with third-party APIs, allowing seamless data flows and improving inter-system communication.\nDemonstrated self-management and multitasking abilities while prioritizing support tickets and resolving user queries efficiently.\nEngaged in effective communication and teamwork with cross-functional teams to share insights and improve system functionality.\nParticipated in continuous self-learning to stay updated with the latest technologies and support practices in the technical support realm.\nContributed to the development and maintenance of user guides, enhancing documentation standards and knowledge transfer across teams."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n**DevOps:**\n\tCI/CD pipelines, Grafana, Prometheus\n\n**Other:**\n\tUX/UI Design, Git, GitHub, Python, Redux, Solidity, Ether.js, Web3.js, Ethereum, troubleshooting, DB analysis, log review, Linux, Unix, self-management, multitasking, prioritization, communication, teamwork, self-learning"
}