{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Cloud Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Seasoned Senior Cloud Engineer with over 8 years of experience in implementing robust cloud solutions across Microsoft Azure, AWS, and GCP. Expert in **Azure DevOps**, **Terraform**, **Ansible**, and **PowerShell** for efficient cloud infrastructure management and automation. Proficient in **ITIL** principles, cloud IaaS, and disaster recovery planning, ensuring high availability and security of cloud environments. Adept in optimizing backup solutions and handling IT security measures to protect data integrity. Strong communication and problem-solving skills with a proven ability to collaborate effectively in a team setting, while demonstrating initiative and adaptability in fast-paced environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Designed and deployed cloud-native solutions using **Microsoft Azure**, **AWS**, and **GCP**, ensuring robust disaster recovery and backup solutions for high availability.\n• Implemented Infrastructure as Code (IaC) with **Terraform** and **ARM templates**, automating the provisioning of cloud resources and environment configurations.\n• Developed and managed CI/CD pipelines using **Azure DevOps**, **Git**, and **GitHub** to streamline deployment processes and enhance collaboration.\n• Collaborated on IT security initiatives, ensuring compliance with standards like SOC 2, ISO 27001, and HIPAA, while applying security best practices to cloud workflows.\n• Leveraged **PowerShell** and **Ansible** for automated configuration management and orchestration, optimizing the deployment of cloud resources.\n• Engineered storage solutions integrating **Commvault** for effective data backup and recovery capabilities across **Azure** and **AWS** environments.\n• Led a team of 10+ engineers, promoting **problem-solving**, **teamwork**, and **initiative** to foster a culture of collaboration and continuous improvement.\n• Streamlined communication within the team and with stakeholders, applying adaptability and clarity to ensure project success in dynamic environments.\n• Optimized resource utilization and performance through meticulous monitoring and management using **Azure Monitor** and **resource tagging** strategies.\n• Conducted regular assessments of server technologies and cloud services to ensure performance efficiency and cost-effectiveness in solutions.\n• Implemented identity management strategies enhancing security measures across all deployed cloud infrastructures.\n• Proactively addressed potential issues and challenges, showcasing strong **problem-solving** skills and initiative in improving operational resilience.\n• Facilitated knowledge sharing sessions to mentor junior team members, focusing on **cloud IaaS**, security practices, and disaster recovery protocols."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Implemented cloud IaaS solutions utilizing **Microsoft Azure**, ensuring high availability and disaster recovery for critical applications.\n• Developed automated deployment scripts using **Terraform** and **Azure DevOps** to streamline infrastructure provisioning and management, reducing deployment time by **40%**.\n• Configured and managed backup solutions with **Commvault**, achieving a **99.9%** recovery success rate for customer data.\n• Established identity management protocols using **Azure Active Directory**, improving security and user accessibility in compliance with IT security standards.\n• Developed PowerShell scripts for automated tasks, enhancing operational efficiency and reducing manual intervention by **30%**.\n• Conducted infrastructure assessment and migration planning utilizing **Azure ASR**, successfully migrating **5** legacy applications to the cloud within **3 months**.\n• Managed Kubernetes clusters, leveraging **Azure services** to deploy microservices, facilitate rolling updates, and ensure scalability under high loads.\n• Collaborated with cross-functional teams to design and implement disaster recovery plans, ensuring system resilience and continuity during outages.\n• Utilized **Ansible** for configuration management to ensure consistency across cloud environments, reducing configuration drift by **25%**.\n• Engaged in continuous improvement initiatives, promoting adaptability and team collaboration through agile methodologies.\n• Provided technical leadership and mentorship to junior engineers, fostering teamwork and innovation in cloud engineering practices.\n• Analyzed and resolved complex technical issues, demonstrating strong problem-solving skills in high-pressure scenarios, maintaining customer satisfaction at **95%**."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Designed and implemented disaster recovery solutions using **Microsoft Azure** and **Azure ASR**, ensuring business continuity and compliance with ITIL standards.\n- Leveraged **Azure DevOps** for CI/CD pipelines to automate deployments, improving operational efficiency by **30%** and reducing manual error rates.\n- Managed infrastructure as code (IaC) using **Terraform** and **ARM templates** to provision and maintain cloud resources, resulting in consistent and reliable environments.\n- Developed backup solutions with **Commvault**, ensuring data integrity and availability across multiple storage technologies for disaster recovery.\n- Applied **Ansible** for configuration management and automation of server technologies, reducing setup time by **40%** and enhancing deployment speed.\n- Implemented security measures across cloud environments, complying with IT security policies and leveraging **identity management** solutions to protect sensitive data.\n- Collaborated with cross-functional teams to address cloud IaaS challenges, utilizing strong problem-solving and communication skills to drive initiatives.\n- Provided technical leadership and support in **AWS** and **GCP** environments, migrating existing applications and services to cloud platforms when necessary.\n- Established best practices for performance monitoring and server optimization, contributing to improved uptime and application reliability.\n- Fostered teamwork and adaptability through knowledge-sharing sessions, mentoring junior engineers in cloud technologies and operational processes.\n- Spearheaded initiatives for infrastructure optimization, achieving performance gains of up to **25%** without additional costs.\n- Documented technical processes and created user guides for cloud management and disaster recovery processes, enhancing team efficiency and knowledge retention.\n- Engaged in continuous learning and adaptation to new technologies and cloud services to maintain industry competitiveness and improve service offerings."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython (FastAPI, Django, Flask)\n\n**Backend Frameworks:**\n\tSpring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, Terraform, Ansible, PowerShell\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Microsoft Azure, GCP, cloud IaaS, disaster recovery\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Git, ITIL, server technologies, storage technologies, identity management, communication, problem-solving, teamwork, initiative, adaptability",
  "apply_company": "Element Solutions Inc"
}