{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior AI Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior AI Engineer with 10+ years of experience in leveraging **AI**, **ML**, and **deep learning** to deliver impactful software solutions, particularly in healthcare and finance. Proficient in **AWS**, **Azure**, and **Google Cloud** for deploying scalable cloud applications, utilizing **TensorFlow**, **PyTorch**, and **Scikit-learn** for model development. Skilled in building and optimizing **MLOps** processes, from designing ML pipelines to managing production workflows with tools such as **MLflow**, **Airflow**, and **Kubeflow**.\n\nExpert in developing **APIs** and utilizing **microservices** architecture for enhancing system performance. Adept at driving **automation** and supporting **digital transformation** initiatives, with a track record of improving business process efficiency through **business process optimization** strategies. Strong analytical, problem-solving, and communication skills, complemented by hands-on experience with **SQL**, **Apache Spark**, and **Hadoop** for data-driven decision-making.\n\nPassionate about integrating **AI strategy**, focusing on **AI ethics** and **bias mitigation**. Brings a holistic approach to project management, leveraging tools like **Jira** and **Confluence** to ensure successful SDLC practices while meeting compliance standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions for healthcare and finance utilizing **TypeScript**, **Python (FastAPI)**, and **Node.js**, with modern frontends in **React (17–18)**, **Next.js**, and **Vue 3**, ensuring compliance with regulatory standards such as HIPAA, FHIR, GDPR, PCI DSS, and SOX.\n• Developed and deployed cross-platform mobile applications with **Flutter** and **React Native**, enhancing user experiences for healthcare and fintech products on both **iOS** and **Android**, while integrating native modules and managing state effectively with Provider and Redux.\n• Spearheaded the transformation of monolithic applications into microservices-based architectures using **Docker**, **Kubernetes (AKS/EKS)**, and serverless frameworks like **AWS Lambda** and **Azure Functions**, achieving high availability and fault tolerance.\n• Established cloud-native data architecture with **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, specifically optimized for large-scale healthcare and financial data ingestion, storage, and querying, supporting over **1 million** records.\n• Designed and deployed machine learning models addressing use cases such as patient risk prediction, financial fraud detection, and document classification using **Python (scikit-learn, PyTorch, TensorFlow)**, integrating real-time inference services into backend solutions, with models achieving an accuracy of **95%**.\n• Constructed MLOps pipelines with **MLflow**, **DVC**, and **Apache Airflow** for continuous training, validation, versioning, and deployment of models across development and production environments, handling over **10 ongoing projects** simultaneously.\n• Integrated AI-driven features into client-facing applications, including smart financial dashboards, personalized health recommendations, and predictive alerts, powered by trained models and APIs hosted on **Azure ML** and **AWS Sagemaker**.\n• Implemented enterprise-level DevOps pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI**, encapsulating linting, testing, security scans, and multi-environment deployments for both web and API services, reducing deployment times by **30%**.\n• Developed complex financial data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded**, facilitating real-time insight into transaction trends, fraud detection, and operational KPIs, servicing **over 500 users**.\n• Collaborated with data scientists to integrate NLP models (leveraging **spaCy** and **Hugging Face Transformers**) for healthcare document processing and financial anomaly detection, embedding them into core services via **RESTful APIs**.\n• Established robust test strategies utilizing **Jest**, **Cypress**, **PyTest**, and **Postman**, encompassing unit, integration, E2E, and contract testing for both front-end and backend services, achieving a **100% test coverage** on critical components.\n• Integrated **Azure Cognitive Search** and **ElasticSearch** to furnish advanced search capabilities across millions of both unstructured and structured health records and financial documents."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Spearheaded the digital transformation initiatives as a **Senior AI Engineer**, leveraging **AI** and **ML** to develop innovative solutions in a **microservices** architecture for financial services.\n• Engineered comprehensive fraud detection systems utilizing **scikit-learn** and **XGBoost**, successfully analyzing transaction patterns to proactively mitigate risk with a **95%** accuracy rate.\n• Developed and integrated real-time analytics dashboards using **Power BI** and **D3.js**, allowing operations to monitor over **10,000** transactions daily while generating actionable insights with a **15%** improvement in response time.\n• Designed and implemented robust ETL pipelines utilizing **Apache Airflow** and **Azure Data Factory**, achieving **90%** efficiency in data ingestion from multiple sources.\n• Integrated scalable, event-driven architectures through **Kafka** and **RabbitMQ**, supporting seamless communication and processing for fidelity in emergency alerts and compliance workflows, managing **50+** simultaneous events.\n• Constructed dynamic front-end applications using **React (18)**, **Next.js**, and **TypeScript**, creating user interfaces that improved user engagement by **30%** by enhancing the performance and responsiveness of financial dashboards.\n• Optimized back-end services utilizing **Python (FastAPI/Django)** to enhance transaction processing speeds by implementing **machine learning** models through **MLflow** for real-time decision-making.\n• Championed the adoption of cloud technologies **(Azure)**, ensuring compliance and optimization of AI strategies for enterprise-wide deployment, conducting thorough bias mitigation and ethical AI practices.\n• Managed all phases of the **SDLC** while utilizing **Jira** and **Confluence** for effective project management and communication, streamlining team collaboration and increasing delivery throughput by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and optimized AI/ML solutions leveraging **TensorFlow**, **PyTorch**, and **Scikit-learn**, resulting in personalized product recommendations that improved conversion rates by **20%**.\n• Engineered scalable microservices architecture utilizing **Python** for backend services, achieving high availability and low latency in key e-commerce functionalities with an uptime of **99.9%**.\n• Integrated advanced analytics and business intelligence tools such as **Tableau** and **Power BI** to visualize data insights, enhancing decision-making processes in product strategy and performance analysis.\n• Collaborated on deployment processes using **AWS** and **Azure**, ensuring a smooth transition of AI models into production environments while maintaining system robustness and security.\n• Implemented data storage strategies utilizing **SQL** and distributed computing frameworks like **Apache Spark** and **Hadoop**, resulting in significant performance improvements with data processing speeds increased by **30%**.\n• Spearheaded initiatives for digital transformation and business process optimization, introducing automation that streamlined workflows and reduced operational overhead by **25%**.\n• Conducted comprehensive analysis and validation of AI models for ethical compliance, focusing on bias mitigation strategies in line with **AI ethics** guidelines.\n• Led discussions and presentations on AI strategy and MLOps, actively engaging stakeholders to align technology initiatives with business goals and project management methodologies using **Jira** and **Confluence**.\n• Developed RESTful APIs to facilitate seamless integration of machine learning components with existing systems, improving inter-departmental collaboration and data flow efficiency."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs, microservices\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), SQL, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tGoogle Cloud\n\n **Other:**\n\tAI, ML, deep learning, TensorFlow, PyTorch, Scikit-learn, Langchain, Hugging Face, MLflow, Airflow, Kubeflow, distributed computing, Apache Spark, automation, digital transformation, business process optimization, AI strategy, AI ethics, bias mitigation, problem-solving, analytical, communication, presentation, SDLC, project management, Jira, Confluence",
  "apply_company": "Wiser Technology"
}