{
  "name": "Andrzej Ito",
  "role_name": "Semi Senior .NET Developer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Semi Senior .NET Developer with over 9 years of experience, I specialize in **.NET** and **C#** to create robust software solutions. I am adept at **API Integration** and have a proven ability in **Code Review**, ensuring high-quality code and excellent application performance. My problem-solving skills and strong **Project Management** capabilities enable me to drive projects to successful completion while prioritizing user experience. Additionally, I possess experience in mentoring junior engineers and fostering **Cross-Functional Collaboration** to enhance team effectiveness and project outcomes. I am committed to improving accessibility and achieving technical excellence in all my endeavors.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Semi Senior .NET Developer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "- Lead cross-functional collaboration in the development of **.NET** applications, ensuring efficient API integration and adherence to project management best practices.\n- Conduct comprehensive code reviews to enhance code quality and promote best practices within the team.\n- Utilize problem-solving skills to troubleshoot and resolve issues within the application lifecycle.\n- Mentor junior developers, fostering a collaborative team environment to enhance their skills and project contributions.\n- Manage projects effectively, delivering on time and within budget while maintaining high standards of quality.\n- Design and implement robust APIs, ensuring seamless integration with existing systems and services.\n- Ensure codebase consistency and quality by incorporating industry-standard practices in our **C#** development processes."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Spearheaded **API Integration** efforts utilizing **.NET** and **C#** technologies, ensuring seamless communication between front-end and back-end systems within a **Microservices** architecture.\n• Conducted thorough **Code Reviews** to enhance code quality, ensuring compliance with best practices and contributing to team knowledge sharing.\n• Demonstrated effective **Problem-Solving** skills by troubleshooting and resolving issues within existing applications, emphasizing optimization and performance improvement.\n• Assisted in **Project Management** tasks by coordinating with cross-functional teams, ensuring timely delivery of project milestones and facilitating smooth team collaboration.\n• Mentored junior developers, fostering a culture of learning and continuous improvement within the development team.\n• Developed UI components using **React 12** and integrated various **Web APIs** to manage data exchange efficiently.\n• Employed **Spring MVC** & **Spring Boot** frameworks to implement MVC architecture and microservice-based solutions.\n• Integrated real-time features using **Web Sockets** for bidirectional communication in web applications.\n• Created dynamic web pages with multi-browser compatibility utilizing **HTML5**, **CSS3**, **JavaScript**, **jQuery**, and other modern frameworks and libraries."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2024",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "Utilized **.NET** and **C#** to develop scalable web applications, enhancing performance and user experience.\n- Led **API Integration** efforts ensuring seamless communication between multiple systems and services.\n- Conducted thorough **Code Reviews** to maintain high coding standards and foster team collaboration.\n- Demonstrated strong **Problem-Solving** skills by troubleshooting issues and implementing effective solutions in a timely manner.\n- Managed various projects from inception to completion, ensuring deliverables meet **90%** of deadlines.\n- Provided **Mentoring** to junior developers, fostering their growth and enhancing team skills by **20%**.\n- Engaged in **Cross-Functional Collaboration** with design and product teams, resulting in successfully launched products with **99%** uptime.\n- Developed web applications using **Spring MVC**, **jQuery**, HTML, JavaScript, CSS, **Web Forms**, **Material UI**, **Tailwind CSS**, and AJAX controls.\n- Utilized **jQuery** for client-side validation controls, improving user interaction by **30%**.\n- Transformed Photoshop and Figma designs into table-less semantic **XHTML**, CSS.\n- Implemented **CORS** using **Node.js** and developed **REST** services with **Node** and **Express**.\n- Designed **SSIS** packages to export data from flat file source to **MS SQL Server**, leading to a **25%** increase in data handling efficiency.\n- Acquired experience with various web technologies including **Bower**, **NPM**, **Git**, and cloud services like **AWS**, **Azure**, **GCP**, and **Heroku**."
    }
  ],
  "skills": "**Programming Languages**\n\tC++, C#, Java, Kotlin, Python, SQL, PLSQL\n\n**Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA, .NET\n\n**Frontend Frameworks**\n\tAngular, React, Vue\n\n**API Technologies**\n\tAPI Integration, REST APIs, SOAP\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMS SQL Server, MongoDB, Oracle, PostgreSQL, Redis\n\n**DevOps**\n\t\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tCode Review, Cross-Functional Collaboration, Problem-Solving, Project Management, Mentoring, SOLID, DRY, LINQ, Microservices, Rabbit MQ"
}