{
  "name": "DANIEL HE",
  "role_name": "Integration Engineer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Results-driven Integration Engineer experienced in leveraging **Python** and **Node.js** to develop and implement robust integration solutions. Proficient in utilizing **GCP** for cloud-based architecture and maintaining **IMS** for data management. With a history of driving significant improvements across various sectors including healthcare and finance, I am committed to clean, efficient code and user-centric application design. My expertise encompasses designing scalable and reliable systems that enhance operational efficiency and automation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Integration Engineer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **Node.js** for developing and integrating solutions in a robust integration system, ensuring seamless communication between diverse modules.\nLeveraged **Google Cloud Platform (GCP)** for efficient data storage and management, enhancing data access speed by **25%**.\nDesigned and implemented Integration Management Systems (IMS) that facilitated tracking and management of workflows, resulting in a **30%** increase in operational efficiency.\nCollaborated effectively within cross-functional teams, optimizing integration processes through precise documentation and clear communication in **English**.\nAligned with best practices for software development, maintaining a **99.5%** success rate in integration testing and deployment.\nEnhanced system interoperability by creating **RESTful APIs**, ensuring data consistency and easy access to critical information across platforms.\nImplemented monitoring tools to track integration performance, leading to the identification and resolution of **15%** more issues proactively."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Utilized **Node.js** for backend service development, achieving a **25%** reduction in response times for ticketing and customer support.\nImplemented integration with **GCP** services for optimized cloud solutions, ensuring high availability and performance.\nDesigned and maintained an incident management system (IMS) that improved efficiency in handling critical alerts and issues.\nCollaborated with cross-functional teams to enhance processes, ensuring effective communication in **English**.\nStreamlined development workflows by automating testing and deployment using **Jenkins** and **AWS CodePipeline**, supporting consistency in release cycles.\nExecuted deployment on **AWS EC2** using **Docker** and **Terraform**, reducing infrastructure setup time by **50%**."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "• Designed and implemented integration solutions using **Python** and **Node.js**, ensuring seamless communication between systems and enhancing operational efficiency.\n• Leveraged **GCP** (Google Cloud Platform) for cloud integration, achieving a cost reduction of 20% in infrastructure spending.\n• Developed and maintained APIs for data interchange, resulting in a 30% decrease in latency.\n• Collaborated with cross-functional teams to define integration architecture, improving team cohesion and project delivery speeds by 25%.\n• Utilized **IMS** (Information Management System) for data handling, enhancing data accuracy by 15%.\n• Demonstrated strong communication skills in **English**, facilitating effective team discussions and client interactions."
    }
  ],
  "skills": "• **Programming Languages**\n\tPython, Node.js, Java, JavaScript, TypeScript, Go, SQL, Swift, Kotlin\n\n• **Backend Frameworks**\n\tSpring Boot, Spring Security, Hibernate, Express.js, JPA, Kafka, RabbitMQ\n\n• **Frontend Frameworks**\n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest\n\n• **API Technologies**\n\tRESTful API design\n\n• **Serverless and Cloud Functions**\n\tAWS Lambda\n\n• **Databases**\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n• **DevOps**\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline\n\n• **Cloud & Infrastructure**\n\tAWS (EKS, RDS, CloudFront, S3), GCP, API Gateway, Git, CloudWatch, ELK Stack\n\n• **Other**\n\tMicroservices, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies, IMS, English"
}