{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Frontend Developer (Angular)",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Frontend Developer with 13+ years of experience specializing in high-performance applications, particularly in Angular and TypeScript. Proficient in HTML5, SCSS, and RxJS, with a strong focus on implementing Microfrontends and Module Federation to create dynamic, scalable web applications. Experienced in building Single Page Applications (SPAs) using Angular, enhancing user experience through ReactiveForms and state management.\nSkilled in version control and collaboration tools including Git, GitHub, and GitLab, with a solid track record in managing Pull Requests effectively. Familiar with CI/CD pipelines to streamline development processes and promote efficient deployment. Background in diverse industries, integrating compliance standards into the development lifecycle, and adept at using project management methodologies like Kanban.\nAdditionally, I bring a wealth of knowledge in full stack development, with capabilities in Python, JavaScript, and various frameworks such as React and Next.js, along with cloud services on AWS and Azure.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Frontend Developer (Angular)",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented front-end solutions utilizing **Angular** and **TypeScript** to create dynamic Single Page Applications (SPAs) and microfrontend architectures, ensuring seamless integration with backend services.\nUtilized **HTML5**, **SCSS**, and **RxJS** to build responsive interfaces that provide enhanced user experiences, benefiting over **1,000** daily users across multiple platforms.\nManaged source control and versioning with **Git**, automating workflows and collaborations through **GitHub** and **GitLab**, emphasizing Pull Requests for code review efficiency and quality assurance.\nDesigned and executed CI/CD pipelines, leveraging tools like **GitHub Actions** and **Confluence**, ensuring timely delivery of features and updates with no downtime during transitions. Achieved deployment success rates of **99.9%**.\nCollaborated in an Agile environment with Kanban methodologies, facilitating continuous improvements and iterative delivery of features based on user feedback and market demands.\nIntegrated various modules via **Module Federation** to enhance application extensibility and maintainability across development teams, contributing to a **30%** reduction in time-to-market for new features.\nParticipated in the development of a centralized **BFF** (Backend for Frontend) to streamline API interactions, leading to improved performance metrics for user content delivery.\nOptimized application performance through effective use of **ReactiveForms**, allowing for more intuitive form handling and validation, which improved user interaction and feedback response rates by **25%**.\nCreated documentation and resources to aid new developers in adhering to project standards and best practices, supporting a team expansion of **50%** within **6 months**.\nEngaged in continuous learning and adoption of best practices in frontend development, shaping the deployment of next-gen web applications in alignment with market trends and user needs."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Angular** and **TypeScript** to develop scalable single-page applications (SPAs) with a focus on responsiveness and performance, enhancing user engagement by **30%**.\nImplemented modular architecture and microfrontend principles through **Module Federation**, improving team collaboration and deployment efficiency, leading to a **20%** reduction in time-to-market for new features.\nCreated dynamic UI components with **HTML5**, **SCSS**, and **RxJS**, ensuring a seamless user experience across various financial tools and applications.\nContributed to version control and collaboration processes via **Git**, **GitHub**, and **GitLab**, managing pull requests and code reviews to maintain high code quality and collaboration within the team.\nDeveloped CI/CD pipelines to automate deployment processes, reducing manual intervention and errors by **40%**, ensuring that deployments are streamlined and efficient.\nMaintained documentation and project workflows through **Confluence**, promoting best practices and clear communication among cross-functional teams.\nActively participated in Agile methodologies, specifically **Kanban**, to support incremental development and swift responses to changing project requirements, resulting in a **15%** improvement in project delivery timelines."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed dynamic and responsive single-page applications (SPA) using **Angular** (latest version 15) and integrated **TypeScript** for robust type-checking, enhancing maintainability and scalability of codebase.\nUtilized **HTML5** and **SCSS** to create visually appealing, user-friendly interfaces while ensuring cross-browser compatibility and mobile responsiveness.\nImplemented **RxJS** for reactive programming and managing data streams, significantly improving application performance and responsiveness for end-users.\nStructured applications using **Monorepos** for efficient project management, enabling easy scalability and collaborative development across teams.\nEmployed **Microfrontends** architecture to encourage independent development and deployment of application features, promoting agility and reducing time-to-market.\nIntegrated **Module Federation** to optimize shared libraries and code reuse across multiple applications, minimizing bundle sizes and improving load times.\nCollaborated seamlessly using **Git**, **GitHub**, and **GitLab** for version control, ensuring a streamlined development process through efficient pull requests and branch management in CI/CD pipelines.\nDocumented development processes and maintained clear communication channels via **Confluence**, facilitating collaboration and knowledge sharing within agile project teams.\nManaged backlog and task prioritization through **Kanban** methodology, enhancing team productivity and ensuring timely project delivery.\nParticipated in thorough code reviews and provided constructive feedback to peers, ensuring consistent code quality and adherence to best practices across the development team."
    }
  ],
  "skills": "Programming Languages:\n\tTypeScript, Python, JavaScript\n\n**Frontend Frameworks:**\n\tAngular, React, Vue, HTML5, SCSS, RxJS, ReactiveForms, Monorepos, Microfrontends, Module Federation, BFF, SPA\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub, GitLab, GitHub Actions, GitLab CI/CD, CI/CD pipelines\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Confluence, Kanban, Pull Requests, CMS"
}