{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Web Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Dedicated Senior Web Engineer with over 10 years of robust experience in full stack development, specializing in **Angular**, **TypeScript**, and **RxJS** for crafting high-performance web applications. Proficient in **HTML5**, **CSS3**, and **SCSS**, combined with advanced skills in **REST API** development, ensuring seamless integrations and data handling.\n\nExperienced in Agile methodologies, particularly **Scrum**, enabling efficient project management and collaboration within cross-functional teams. Demonstrated expertise in **Unit Testing**, **Integration Testing**, and **Code Review** enhances code quality and fosters a culture of continuous improvement. Strong communication skills and a commitment to producing thorough **Technical Documentation** support team success and client satisfaction.\n\nAdditionally, I possess a solid foundation in DevOps practices, having deployed and managed cloud-native solutions on platforms like Azure and AWS. My background in MLOps with tools like MLflow furthers my capacity to implement intelligent solutions that drive impacts in real-world applications. I am passionate about blending technical excellence with innovative design for sustainable, compliant software solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tUtilized **TypeScript**, **Angular**, and **RxJS** to develop and maintain scalable web applications, ensuring adherence to best practices and modern UI/UX standards in **HTML5** and **CSS3/SCSS**.\n•\tImplemented and maintained robust REST APIs, collaborating with cross-functional teams to ensure seamless integration and communication between frontend and backend services.\n•\tEstablished automated testing frameworks with **Jest** and **Playwright**, focusing on unit testing and integration testing to enhance code quality and reduce bugs in production.\n•\tLeveraged **DevOps** practices by setting up CI/CD pipelines, ensuring rapid deployment cycles while integrating code review processes and security scans.\n•\tConducted regular code reviews and provided mentorship to junior developers, fostering a culture of continuous improvement and excellence within the team.\n•\tParticipated in **Scrum** ceremonies, contributing to sprint planning, retrospectives, and daily stand-ups to ensure alignment and transparency across the team.\n•\tCreated comprehensive technical documentation for projects, ensuring clear communication of technical details and workflow among team members and stakeholders.\n•\tCollaborated in teams to enhance features using **NgRx** for state management, improving application performance and user experience.\n•\tWorked on integrating third-party APIs and services to enhance application functionality and deliver innovative solutions within project timelines.\n•\tDelivered significant performance improvements, reducing page load times by **30%** and enhancing overall user engagement metrics.\n•\tMaintained and optimized applications by implementing best coding standards, leading to a **15%** reduction in bug reports post-deployment."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained dynamic, user-focused front-end applications utilizing **Angular**, **TypeScript**, **RxJS**, **HTML5**, **CSS3**, and **SCSS** to create responsive interfaces that enhance user experience for financial dashboards and admin portals.\nImplemented REST API integrations to streamline data access and improve performance across various applications, ensuring smooth communication between client-side and back-end services.\nConducted unit and integration testing using **Jest** and **Playwright** to ensure high-quality code delivery, achieving a **95%** code coverage rate on critical path applications.\nCollaborated in a **Scrum** environment, participating in sprint planning and retrospectives to drive project timelines and improve team productivity while adhering to DevOps best practices.\nReviewed code through comprehensive **Code Review** processes to maintain a high standard of quality and foster continuous improvement within the team.\nProduced thorough **Technical Documentation** to ensure feature clarity and maintainability, reducing onboarding time for new developers by **40%**.\nDemonstrated strong **Communication Skills** and **Teamwork** to liaise effectively with cross-functional teams, leading to smoother project execution and quicker resolution of issues.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable web applications utilizing **Angular** and **TypeScript** to ensure responsive and dynamic user interfaces for e-commerce platforms.\nImplemented REST API integrations, providing seamless communication between frontend and backend services, enhancing overall system architecture.\nConducted unit and integration testing using **Jest** and **Playwright**, ensuring high-quality code with a focus on robust functionality and user experience.\nExecuted agile methodologies, participating actively in **Scrum** ceremonies, promoting effective teamwork and communication across development teams.\nEngaged in code reviews, providing constructive feedback and upholding coding standards to maintain performance consistency and clarity in the project.\nCreated technical documentation to streamline development processes and improve onboarding for new team members.\nDesigned and executed operations strategies, working with **DevOps** practices to enhance application deployment and management workflows.\nUtilized **HTML5**, **CSS3**, and **SCSS** for crafting visually appealing interfaces while ensuring compatibility and responsiveness across different devices.\nIncorporated state management solutions such as **NgRx** for effective data handling within the Angular framework, enhancing application performance.\nImplemented continuous testing strategies to validate application features, promoting efficiency and reducing the time to market for new functionalities."
    }
  ],
  "skills": "  **Frontend Frameworks**\n\tAngular, JavaScript/TypeScript (React, Vue), HTML5, CSS3, SCSS, RxJS\n\n  **Backend Frameworks**\n\tPython(FastAPI, Flask, Django)\n\n  **API Technologies**\n\tREST API\n\n  **Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n  **Cloud & Infrastructure**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n  **Other**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Communication Skills, Teamwork, Scrum, Code Review, Unit Testing, Integration Testing, Technical Documentation, Playwright, Jest, NgRx",
  "apply_company": "HICRON"
}