{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior System Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior System Engineer with 13+ years of experience in managing and optimizing complex systems across various environments. Proficient in **Linux** (Red Hat, Suse, Ubuntu), **Apache**, **MySQL**, **FTP**, **SMTP**, **DNS**, **Squid**, and monitoring tools such as **Check_MK** and **Nagios**. Demonstrated ability to implement ITIL practices and improve system reliability through effective **scripting** and problem-solving techniques.\n\nOriginally a Full Stack Developer skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on experience in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Expert in developing AI/ML-powered applications to support predictive analytics and real-time processing, and adept at deploying cloud-native systems on **AWS** and **Azure**. Proven track record in compliance-driven development with a keen understanding of standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Strong foundation in MLOps methodologies using **MLflow**, **Airflow**, and **Kubeflow**, fostering collaboration within teams to deliver high-performance applications.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior System Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented effective ITIL practices for incident, problem, and change management, ensuring high availability of services across **Linux** environments (Ubuntu, Red Hat, Suse).\nMaintained and optimized web server environments using **Apache** to ensure robust performance and security across a fleet of servers.\nManaged and administered **MySQL** databases, executing optimization techniques to enhance data retrieval speed by up to **30%**.\nDeveloped and maintained scripts for automation and monitoring, contributing to enhanced operational efficiency and reduced manual workload by up to **40%**.\nConfigured FTP and SMTP services for secure, efficient data transfer and communication, meeting service level agreements for availability.\nMonitored system health and performance with tools like **Nagios** and **Check_MK**, implementing proactive measures to mitigate potential outages, ensuring uptime exceeds **99.9%**.\nUtilized scripting languages to develop custom scripts for server management and automation, significantly reducing troubleshooting times and improving incident resolution.\nEngaged in team collaboration to develop best practices and troubleshooting guidelines, fostering a culture of continuous improvement within the engineering team.\nDemonstrated problem-solving skills in various scenarios, effectively resolving critical system issues in a timely manner, leveraging expertise in network protocols and systems architecture.\nCommunicated fluently in German and English, facilitating effective collaboration with international teams and clients across diverse projects."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Ensured system reliability and performance by implementing monitoring solutions using **Nagios** and **Check_MK** to proactively identify and resolve issues in financial applications.\nImplemented automation scripts in **Bash** and **Python** to streamline system configurations and deployments across multiple environments, including **Red Hat**, **Suse**, and **Ubuntu**.\nManaged MySQL databases, optimizing queries and maintaining data integrity for critical financial applications, handling over **1 million** transactions daily.\nConfigured and maintained **FTP** and **SMTP** services for data transfers and notifications, ensuring secure and efficient communication between systems.\nUtilized **Linux** systems for server management, performing routine updates and troubleshooting to enhance performance and security, achieving a system uptime of **99.9%**.\nCollaborated with cross-functional teams to devise problem-solving strategies that align with ITIL best practices, improving team response times by **30%**.\nLed the integration of financial monitoring tools into existing workflows, enhancing overall system visibility and traceability for financial reporting and audits.\nProvided technical mentorship to team members, fostering collaboration and knowledge sharing in languages, including **German** and **English**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Ensured high availability and reliability of servers on **Linux** distributions (Ubuntu, Red Hat, Suse) by implementing best practices in system administration, disaster recovery, and monitoring, resulting in a **99.9%** uptime across all hosted services.\nOptimized web server performance and security using **Apache**, leading to a **30%** reduction in response times and improved load balancing to handle peak traffic scenarios effectively.\nManaged MySQL databases for application data storage, ensuring data integrity and availability with regular backup schedules leading to **zero data loss** incidents.\nImplemented automated monitoring solutions using **Check_MK** and **Nagios** to proactively detect system issues and reduce downtime by **25%** through responsive incident management.\nDeveloped scripts for automating routine tasks and enhancing system operations, increasing team efficiency and reducing manual workload by **40%**.\nManaged critical IT services including **FTP**, **SMTP**, and **DNS** configurations, ensuring efficient data transfer and reliable domain name resolution for internal and external communication.\nCollaborated with cross-functional teams to troubleshoot and resolve complex technical issues, enhancing problem-solving capabilities and fostering effective team collaboration in both **German** and **English**.\nUtilized ITIL best practices to improve service delivery and support processes, leading to enhanced user satisfaction and aligned IT operations with business needs."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tOAuth2\n\tJWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tLinux\n\tRed Hat\n\tSuse\n\tUbuntu\n\tNginx\n\tLet's Encrypt\n\tCertbot\n\n**Other:**\n\tMLflow\n\tAirflow\n\tKubeflow\n\tCheck_MK\n\tNagios\n\tITIL\n\tScripting\n\tFTP\n\tSMTP\n\tDNS\n\tSquid\n\tProblem Solving\n\tTeam Collaboration\n\tGerman\n\tEnglish",
  "apply_company": "Sycor"
}