{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Platform Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Platform Engineer with 8 years of experience specializing in **Python**, **AWS**, **Azure**, **GoLang**, and **Linux**. Adept at building scalable and high-performance applications utilizing **RESTful API** frameworks and CI/CD practices, ensuring streamlined DevOps processes. Proven ability to implement robust solutions in cloud environments, integrating complex **AI** functionalities and leveraging **Agile** methodologies to enhance team productivity. \n\nMy technical proficiency includes a wide-ranging skill set in **full-stack development** using **React**, **Next.js**, **Node.js**, and frameworks like **FastAPI** and **Django**. I have effectively led the design and implementation of enterprise-grade platforms while maintaining compliance with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, I possess hands-on experience in machine learning, developing production-ready ML pipelines using tools like **MLflow**, **Airflow**, and **Kubeflow** that advance predictive analytics and intelligent automation initiatives.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Platform Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **GoLang** to architect and develop scalable, full-stack healthcare and financial platforms, ensuring compliance with HIPAA, FHIR, GDPR, and financial regulatory standards (e.g., PCI DSS, SOX).\nImplemented robust **RESTful API** services, facilitating seamless integration with front-end frameworks and third-party systems, maintaining high performance metrics of **99.9% uptime**.\nLeveraged **CI/CD** pipelines on platforms like **AWS** and **Azure**, ensuring rapid deployment and integration, enhancing productivity by **30%** through automated testing and release management.\nDesigned and maintained cloud-native environments across **AWS**, **Azure**, and **GCP**, optimizing infrastructure and data management strategies using **Linux**, achieving a **50% reduction** in operational costs.\nCollaborated within an **Agile** framework, leading cross-functional teams to drive innovative solutions, significantly decreasing project delivery times by **25%**.\nIntegrated advanced AI capabilities into client-facing applications, enhancing user engagement through smart financial dashboards and personalized health recommendations.\nDeveloped and hosted machine learning models for various use cases in the healthcare and financial sectors, utilizing established frameworks and ensuring model performance evaluations.\nEstablished modern networking solutions to ensure secure data transfer and compliance, enhancing the system's resilience against threats and breaches.\nUtilized version control systems, especially **Git**, to manage and track code versions effectively across distributed teams.\nConducted rigorous testing strategies with tools such as Jest, Postman, and PyTest, achieving comprehensive coverage and significantly improving software reliability and performance."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **GoLang** to lead the development and modernization of financial platforms, implementing a microservices-based architecture with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), achieving a **30%** increase in scalability and maintainability for high-volume transaction systems.\nDeveloped robust RESTful APIs, employing **Linux** environments and leveraging **AWS** and **Azure** cloud services to ensure high availability and performance, while maintaining **99.9%** uptime in user-focused front-end applications using **React** (v18), **Vue 3**, **Next.js**, and **TypeScript**.\nOrchestrated CI/CD pipelines using **Git** and Agile methodologies to facilitate continuous integration and delivery, significantly reducing deployment times by **40%** for dynamic and performant user interfaces tailored for financial dashboards and admin portals.\nEngineered real-time transaction monitoring and analytics dashboards utilizing **D3.js** and **Power BI Embedded**, allowing operations teams to track financial activity and detect anomalies with a response time of less than **2 seconds**.\nIntegrated messaging systems like **Kafka**, **RabbitMQ**, and **Azure Service Bus** to create an event-driven architecture that supports asynchronous communication and real-time processing for transactions, alerts, and compliance workflows, enhancing system responsiveness.\nDesigned and implemented ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory** for batch and real-time financial data ingestion, achieving a processing capacity of **100,000** records per minute from internal and third-party sources.\nDeveloped AI/ML-powered fraud detection systems employing **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, which analyzed transaction patterns and user behavior to flag suspicious activities with an accuracy rate exceeding **95%** in banking systems.\nCreated machine learning pipelines for credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** for model deployment, enabling real-time decision-making within backend services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **GoLang** for designing robust backend services aligned with the best practices of **RESTful API** development, contributing to a global e-commerce platform with over **1 million** users.\nImplemented CI/CD pipelines using tools like **Git** and multiple cloud services including **AWS**, **Azure**, and **GCP**, leading to improved deployment frequency by **30%** and achieving seamless integration of new features.\nEstablished high-performance, fault-tolerant systems on **Linux** infrastructures, optimizing server response times to under **200ms** for critical user-facing modules.\nDesigned and deployed real-time features with added network efficiencies, leveraging advanced knowledge in networking protocols to support responsive order updates and user interactions, enhancing customer satisfaction.\nApplied Agile methodologies for project management, participating in sprint planning and daily stand-ups to ensure timely deliverables while maintaining high-quality standards.\nIncorporated AI technologies to optimize backend processing and enhance system capabilities, using techniques that improved data analysis speed by **25%**, thus driving informed business decisions.\nImplemented advanced security protocols including role-based access control (RBAC) and OAuth 2.0, fostering a secure environment compliant with GDPR and enhancing user trust.\nUtilized comprehensive monitoring strategies to analyze and extend platform uptime, maintaining a target uptime of over **99.9%** across all services."
    }
  ],
  "skills": "Programming Languages:\n\tPython, GoLang\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tRESTful API\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure, GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Git\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Linux, Networking, Agile, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), AI",
  "apply_company": "Qumulo"
}