{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior AI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior AI Engineer with 8 years of full-stack development and machine learning expertise. Proficient in **Python**, **TensorFlow**, **PyTorch**, **Pandas**, **NumPy**, and **Hugging Face** for creating advanced AI and Machine Learning solutions. Experienced in integrating **LLM** models and implementing **MLOps** workflows, ensuring robust and scalable model deployment. Proven ability in leveraging **LangChain** and **ONNX** for optimized model performance while strictly adhering to data privacy standards and compliance regulations. \n\nMy technical acumen also includes  building high-performance applications using modern frameworks like **React**, **Node.js**, and **Django**, supplemented by extensive experience in cloud services on **Azure** and **AWS**. I have a solid background in agile methodologies and have successfully led the development of enterprise-grade platforms in the healthcare and financial sectors, focusing on intelligent automation and real-time data processing.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and optimized machine learning models using **Python**, **TensorFlow**, **PyTorch**, and **Hugging Face**, focusing on AI-driven solutions such as patient risk prediction and financial fraud detection.\nDesigned and maintained MLOps pipelines utilizing tools like **MLflow** and **DVC** to ensure continuous training, validation, versioning, and deployment of models across development and production environments.\nIntegrated advanced data processing technologies such as **Pandas** and **NumPy** to streamline the manipulation and analysis of large datasets in healthcare and financial sectors.\nImplemented AI-based features in applications, enhancing user experiences with intelligent insights and predictions based on trained models and APIs hosted on platforms like **Azure ML**.\nCollaborated in Agile teams to deliver cutting-edge machine learning applications, ensuring alignment with data privacy regulations and best practices in data security.\nConducted thorough testing using tools such as **Pytest** and integrated test strategies across various stages of development, reinforcing quality assurance in the deployment of AI-driven solutions.\nParticipated in cross-functional projects that required high-level analytical skills and teamwork to meet project milestones and drive innovation in AI and ML technologies."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Utilized **Python** and various ML frameworks such as **TensorFlow** and **PyTorch** to develop AI-driven solutions that enhance data analysis and decision-making for financial applications.\n- Built advanced data processing systems leveraging **Pandas** and **NumPy** to efficiently handle and manipulate large datasets, achieving up to **100%** improvement in data processing time.\n- Developed and deployed machine learning models for predictive analytics and automated decision-making, focusing on model accuracy and A/B testing improvements by **20%**.\n- Implemented MLOps practices to streamline the model lifecycle, ensuring reliable deployment and monitoring of AI models in production environments, contributing to **30%** reduction in deployment errors.\n- Collaborated within agile teams for iterative development, ensuring alignment with project goals and timely delivery of features, resulting in a **25%** faster project turnaround.\n- Applied AI methodologies to enhance data privacy practices, ensuring compliance with regulations while processing sensitive financial data.\n- Conducted research on **LLM** integration through frameworks like **Hugging Face** and **LangChain** for natural language processing, contributing innovative features to user interfaces that support financial analysis.\n- Designed robust data pipelines that integrate machine learning predictions seamlessly with existing systems, improving operational efficiency across departments by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Employed **Python** for designing and optimizing AI models, focusing on **TensorFlow**, **PyTorch**, and **Hugging Face** for robust AI and ML solutions that enhance backend services.\nDeveloped and integrated AI/ML workflows using libraries such as **Pandas** and **NumPy** to analyze datasets, streamline feature engineering, and drive predictive modeling efficiency, achieving a **30%** increase in model accuracy.\nEngineered real-time AI functionalities powered by **LangChain** and **ONNX**, enabling dynamic user interactions with improved response times, achieving **99.9%** uptime in customer interacting modules.\nImplemented MLOps strategies for continuous integration and deployment of AI models, ensuring rapid iteration and delivery of features in an Agile environment, reducing deployment times by **50%** compared to previous standards.\nFocused on data privacy protocols including GDPR compliance, securing sensitive user information within AI applications with role-based access control and security validations.\nCollaborated within Agile teams to fine-tune AI algorithms, achieving real-time data processing speeds, resulting in improved user engagement metrics by over **20%**.\nUtilized modern frameworks to support AI-driven features seamlessly within backend and frontend tech stacks, enhancing user experiences and operational efficiencies across the platform.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, LLM, AI, ML, Pandas, NumPy, TensorFlow, PyTorch, Hugging Face, LangChain, ONNX, MLOps, Data Privacy, Agile, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Resolve To Save Lives"
}