{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior WebTestEngineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Web Test Engineer with 8 years of experience, I excel in leveraging **Playwright**, **Selenium**, and **TypeScript** for comprehensive testing solutions. My background in **Python** enhances my ability to automate tests and integrate them seamlessly into CI/CD pipelines using **GitHub Actions** and **k8s**. I am proficient in **React** and have experience with **Django**, enabling me to effectively collaborate with full-stack development projects while ensuring the robustness of applications.\n\nI am well-versed in utilizing **OpenAPI**, **Celery**, **RabbitMQ**, **SQLAlchemy**, **PostgreSQL**, and **Redis** to facilitate back-end testing strategies, providing thorough validation of data-centric applications. My strong foundation in cloud services including **Azure**, **Heroku**, and **GCP** allows for efficient deployment and testing environments.\n\nIn addition, I bring proven expertise in Agile methodologies, effective communication, and exceptional problem-solving abilities that complement my technical skills, enabling me to deliver high-quality, reliable software solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior WebTestEngineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented end-to-end testing frameworks using **Playwright** and **Selenium** for comprehensive web application testing to ensure the reliability and performance of developed software.\nUtilized **TypeScript** and **Python** for writing test scripts and automation tools, enhancing test coverage and reducing regression times by **30%**.\nCollaborated closely with developers utilizing **React** and Django for creating robust testing strategies that align with Agile methodologies and continuous integration environments.\nDeveloped and maintained automated testing suites with **GitHub Actions** to streamline development workflows and support regular deployment cycles, achieving a **50%** increase in deployment frequency.\nImplemented asynchronous task management using **Celery** and **RabbitMQ** for backend processing to enhance efficiency in test execution and reporting.\nDesigned and executed test scenarios across various database systems including **PostgreSQL** and **Redis**, ensuring data integrity and performance under varied loads.\nEmploying **OpenAPI** standards to generate API documentation that ensures effective communication among developers and enhances the testing processes.\nUtilized **k8s** (Kubernetes) for container orchestration, managing test environments with ease, which enabled more scalable testing solutions.\nConducted test strategy workshops that improved team communication and mitigated technical issues, leading to a **20%** reduction in bug reports post-deployment.\nEnhanced testing frameworks by introducing infrastructure as code practices with **Terraform** and **Helm**, resulting in a more consistent and reliable testing environment.\nFostered a culture of problem-solving within the team by mentoring junior testers in automated testing techniques and best practices, contributing to team growth and capability.\nDelivered detailed, data-driven reports on test results, ensuring support for decision-making processes through clarity and robust communication."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Playwright** and **Selenium** to design and implement comprehensive automated testing frameworks, enhancing test coverage by **40%** and reducing regression defects significantly.\nEmployed **TypeScript** alongside **React** to develop and maintain robust testable web applications, ensuring high-quality code and improved maintainability across critical features.\nCollaborated with cross-functional teams within an **Agile** environment to assess and refine testing strategies, leading to a **30%** reduction in testing cycles.\nImplemented performance testing and monitoring solutions using **Python**, ensuring applications' reliability under peak load conditions with an emphasis on seamless user experience.\nDevised integration test cases by leveraging **Django** and **SQLAlchemy**, facilitating continuous integration and deployment pipelines on **GitHub Actions**, leading to faster delivery times for features and fixes.\nOrchestrated test environments using **k8s** and **Terraform**, enabling automated provisioning and scaling of test resources based on environment needs, achieving consistent testing outcomes.\nDeveloped and executed backend tests for RESTful services based on **OpenAPI** specifications, ensuring that all API endpoints adhere to defined contracts and perform optimally.\nImplemented message queue integration testing with **RabbitMQ** and **Celery**, enabling asynchronous task processing verification and enhancing system reliability for transaction processing workflows.\nAnalyzed and reported on failures and defects with advanced problem-solving techniques, improving overall development communication and response time to issues by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Selenium** and **Playwright** for automated testing of web applications ensuring high quality and reliability across **React** and **Django** frameworks, achieving a testing coverage of over **90%**.\nImplemented and maintained CI/CD pipelines using **GitHub Actions** for seamless integration and deployment, reducing deployment time by **40%**.\nDeveloped and executed comprehensive test plans employing **TypeScript** and **Python** for functional, regression, and performance testing to ensure alignment with business requirements.\nCollaborated with cross-functional teams in an **Agile** environment, effectively communicating testing progress and results, fostering a culture of continuous improvement in the development process.\nDesigned and executed load testing scenarios using **RabbitMQ**, **Celery**, and **PostgreSQL** to assess the application performance under varying loads, ensuring optimal scaling and responsiveness for user demand.\nUtilized **OpenAPI** specifications for creating and validating APIs, ensuring robust API design and documentation, streamlined for client consumption.\nManaged application configurations and infrastructure provisioning using **Terraform** and **Helm**, facilitating deployment across **GCP** and **Azure** environments while ensuring consistency and efficiency.\nCreated and maintained detailed documentation for testing procedures and outcomes in line with best practices, simplifying knowledge sharing and training for new team members.\nEngaged in proactive problem-solving to identify potential issues in web applications early in the development lifecycle, significantly reducing bug resolution time by up to **30%**.\nFostered strong communication within the team and with stakeholders, ensuring alignment on project goals and timelines, enhancing overall project success."
    }
  ],
  "skills": "Programming Languages:\n\tPython, TypeScript\n\n**Frontend Frameworks:**\n\tReact\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies:**\n\tOpenAPI\n\n**DevOps:**\n\tDocker, Kubernetes (k8s), GitHub Actions, GitLab CI/CD, Terraform, Helm\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP, Heroku\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQLAlchemy\n\n**Other:**\n\tPlaywright, Selenium, RabbitMQ, Agile, Communication, Problem-solving, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Ansible, Docker Compose",
  "apply_company": "Sphera"
}