{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience specializing in **Node.js**, **TypeScript**, and **SQL** for high-throughput and distributed systems. Proven expertise in performance tuning and building robust APIs that ensure seamless communication within event-based architectures. Skilled in deploying cloud-native solutions on **AWS**, leveraging microservices to enhance scalability and reliability.\nExperienced in cross-functional collaboration, driving projects that align with product objectives while adhering to compliance standards. Empathetic communicator, adept at bridging technical and non-technical teams to foster a high-performing work environment. A strong advocate for building AI/ML-powered applications, with hands-on knowledge in integrating predictive analytics and automation into backend processes.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Enhanced system performance and scalability for **high-throughput systems** in backend engineering using **Node.js** and **TypeScript** while ensuring robust **APIs** for seamless data access.\nParticipated in cross-functional collaboration to translate product requirements into technical specifications, cultivating an **empathetic communication** approach to meet diverse stakeholder needs effectively.\nUtilized **SQL** databases effectively for data storage and retrieval, optimizing **performance tuning** to improve query response times by **30%**.\nDesigned and implemented **event-based systems** to streamline asynchronous processing, enhancing user experience and system responsiveness.\nContributed to the development of **distributed systems** that support real-time data processing and analytics, ensuring reliability and fault tolerance.\nEngaged in product-minded practices, focusing on building backend solutions that deliver value to end-users, driving a **20%** improvement in application usability.\nArchitected full-stack platforms for healthcare and fintech, ensuring compliance with industry standards including HIPAA, FHIR, and PCI DSS.\nLed the migration of monolithic applications to microservices architecture, utilizing **AWS** for hosted services and scalable deployments.\nBuilt efficient CI/CD pipelines and automated deployments, integrating testing frameworks to ensure code quality and maintainability across projects.\nCollaborated on advanced data processing and visualization tools to facilitate rapid analysis of critical metrics in health and finance domains."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** (NestJS/Express) and **Python** (FastAPI, Django) to modernize core financial platforms, migrating to a microservices architecture that enhanced scalability and performance for high-volume transactional systems, achieving a **70% increase** in processing efficiency.\nImplemented **TypeScript** for building durable APIs, ensuring robust communication in **event-based systems**, supporting distributed architecture to facilitate **high-throughput systems** across multiple services.\nEngaged in cross-functional collaboration to design and develop solutions that address performance tuning in **SQL**, resulting in optimized database queries that improved retrieval times by **30%**.\nProficiently handled real-time data flow and insights by building interactive front-end applications using **React (18)** and **Next.js**, enabling users to access data with a response time under **200ms**.\nDesigned a resilient event-driven architecture with **Kafka** and **RabbitMQ**, ensuring seamless asynchronous communication across critical workflows like payments, alerts, and compliance, effectively reducing operational latency by **40%**.\nDeveloped efficient ETL pipelines using **Apache Airflow** and **Azure Data Factory** for ingesting and processing financial data from various internal and third-party sources, managing over **500GB/month** of data streams.\nConstructed machine learning models for fraud detection leveraging **scikit-learn** and **XGBoost**, significantly improving detection capabilities with accuracy rates above **95%** based on user behavior analysis.\nIntegrated ML pipelines for tasks like real-time credit scoring and churn prediction using **MLflow** and **Airflow**, embedding model inference into backend services to facilitate predictive analytics for proactive decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Designed and optimized **high-throughput systems** using **Node.js (NestJS, Express)**, ensuring high availability, low latency, and scalability across key modules in a global e-commerce platform.\n• Developed and maintained efficient **APIs** that supported real-time features with **event-driven architecture** leveraging **Kafka** and **RabbitMQ** for enhanced order updates and dynamic inventory tracking.\n• Conducted **performance tuning** to significantly improve response times, achieving a latency reduction of up to **40%** in backend processes.\n• Managed data effectively in a **distributed systems** environment utilizing **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** ensuring a fault-tolerant structure that could handle a daily traffic of over **100,000 users**.\n• Collaborated cross-functionally with frontend teams to create responsive applications using modern frameworks such as **React (18)**, **Vue 3**, and **Angular**, focusing on user experience and mobile-first design principles.\n• Integrated and deployed **AWS** cloud services to enhance infrastructure scalability, including the use of **S3** and **EC2** to improve service availability and performance metrics.\n• Built secure payment workflows in compliance with **PCI** standards, integrating with payment processors like **Stripe**, **PayPal**, and **Razorpay** ensuring secure transactions for over **10,000 transactions** per day.\n• Applied **SQL** extensively for data management and retrieval processes while ensuring GDPR compliance and user data protection via **role-based access control (RBAC)** and **OAuth 2.0** strategies.\n• Enhanced team collaboration through **empathetic communication** and ensured product alignment with business objectives using a **product-minded** approach to project management and execution.\n• Implemented feature flags and blue-green deployments leveraging **LaunchDarkly** and **Kubernetes**, facilitating safe rollouts and A/B testing iterations to minimize downtime during upgrades."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\nBackend Frameworks:\n\tFastAPI, Flask, Django, Node.js\n\nFrontend Frameworks:\n\tReact, Vue, Angular\n\nAPI Technologies:\n\tAPIs\n\nServerless and Cloud Functions:\n\tAWS: ECS, Lambda, RDS, S3\n\nDatabases:\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\tAWS, Azure: App Services, Blob Storage, SQL Database\n\nOther:\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, event-based systems, high-throughput systems, distributed systems, performance tuning, cross-functional collaboration, empathetic communication, product-minded",
  "apply_company": "ClickUp"
}