{
  "name": "Tomasz Lee",
  "role_name": "Software Engineer for GPU and CPU accelerated data processing libraries",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Software Engineer with 9+ years of experience in developing high-performance GPU and CPU accelerated data processing libraries. Proven expertise in **CUDA**, **C/C++ programming**, and crafting **high-performance parallel numerical applications**. Strong command in applying **numerical methods** and achieving performance tuning through meticulous **benchmarking**. Demonstrated abilities in technical leadership, adept collaboration, and clear communication, paired with strong project management skills utilizing tools like **JIRA** and **CI/CD systems**. Proficient in **Python**, debugging, profiling, and testing, with a track record of delivering robust, efficient solutions on time while maintaining comprehensive documentation and streamlining workflows.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer for GPU and CPU accelerated data processing libraries",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "- Led the technical direction and architecture for GPU acceleration and high-performance parallel numerical applications using **CUDA** and **C/C++ programming**, ensuring optimal performance and scalability.\n- Implemented performance tuning strategies, reducing execution time by **30%** across critical applications through rigorous profiling and debugging.\n- Conducted thorough benchmarking and testing on numerical methods, validating performance improvements with metrics showing an **increase of 25% in efficiency**.\n- Spearheaded the development of robust CI/CD systems using **JIRA** for project management, cutting deployment times by **40%** and streamlining workflows.\n- Fostered technical leadership and collaboration within the team, enhancing communication and documentation practices that improved project timelines by **15%**.\n- Developed high-performance libraries ensuring compatibility and seamless integration with existing systems, utilizing the latest development tools and methodologies.\n- Trained team members on new technologies, including best practices for debugging and profiling, effectively reducing onboarding time by **20%**.\n- Coordinated with cross-functional teams to align development goals with organizational objectives, resulting in successful project delivery ahead of deadlines."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **C/C++ programming** skills to develop high-performance parallel numerical applications that utilize **GPU acceleration** and **CUDA**, achieving up to a **40% increase** in processing speed.\nImplemented performance tuning strategies, resulting in a **30% reduction** in execution time for complex numerical methods.\nConducted benchmarking using **Python** to assess the efficiency of various algorithms and libraries, ensuring optimal data processing.\nEmployed **debugging** and **profiling** tools to identify performance bottlenecks, enhancing system reliability and effectiveness by **20%**.\nLed technical discussions and provided **technical leadership** to a team of developers, fostering a culture of **collaboration** and **communication**.\nManaged project timelines and deliverables using **JIRA**, ensuring alignment of project goals with business objectives.\nCreated and maintained comprehensive documentation to facilitate knowledge sharing and streamline project management processes.\nImplemented **CI/CD systems** to automate deployment and testing, improving the release cycle efficiency by **25%**.\nMentored junior developers in parallel processing techniques and numerical methods, bolstering team capability in handling complex data processing tasks.\nConducted rigorous testing of applications to ensure adherence to performance standards and identify optimization opportunities."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C/C++ programming** and **CUDA** to develop high-performance parallel numerical applications, boosting processing speed by up to **30%**.\nImplemented performance tuning strategies that enhanced execution efficiency, achieving a **25%** reduction in runtime for critical algorithms.\nConducted benchmarking of various numerical methods, ensuring optimal performance and resource utilization across systems.\nLed technical discussions and documentation efforts, fostering clear **communication** and knowledge sharing within the team to improve collaboration.\nManaged project timelines and deliverables using **JIRA**, ensuring the successful completion of tasks and adherence to deadlines.\nSupported CI/CD systems to automate testing and deployment processes, significantly reducing integration time by **40%**.\nCollaborated effectively with cross-functional teams to gather requirements and provide technical leadership in project development.\nFacilitated debugging and profiling sessions, optimizing existing code and identifying areas for improvement.\nDeveloped comprehensive documentation and user guides, enhancing team understanding and facilitating smoother onboarding processes.\nParticipated actively in code reviews, ensuring adherence to coding standards and best practices."
    }
  ],
  "skills": " **Programming Languages**\n\t C#, .NET, Python, C/C++, JavaScript, TypeScript\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, Microservices\n\n**Frontend Frameworks**\n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS, Azure, CI/CD pipelines\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD systems, JIRA\n\n**Cloud & Infrastructure**\n\t AWS, Azure\n\n**Other**\n\t GPU acceleration, CUDA, high-performance parallel numerical applications, numerical methods, performance tuning, benchmarking, technical leadership, collaboration, communication, documentation, project management, debugging, profiling, testing, Git, GitHub, testing tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Redux"
}