{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Allround Servicemonteur",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Experienced Allround Servicemonteur with a strong foundation in **software** engineering and analytical problem-solving. Bringing over 13 years of full-stack development expertise, particularly in delivering high-performance applications across diverse sectors, with a keen understanding of **robotics**, **software development**, and **vision technology**. Skilled in **teamwork** and demonstrating strong **social skills**, fostering collaboration to drive successful project outcomes.\nTechnical proficiency includes **JavaScript**, **TypeScript**, **Python**, and **Flutter**, with hands-on development experience in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in achieving compliance with industry standards while deploying cloud-native systems on **AWS** and **Azure**. Proven track record in building AI/ML-powered platforms utilizing frameworks like **MLflow**, **Airflow**, and **Kubeflow** for real-time analytics and automation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Allround Servicemonteur",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Utilized **software** and analytical skills to troubleshoot and maintain advanced robotic systems and automation tools in various environments.\n- Collaborated with cross-functional teams to enhance **electrical** and mechanical components, ensuring optimal performance of robotic and vision technology systems.\n- Applied problem-solving skills to resolve complex mechanical issues in real-time, contributing to a **25% increase** in machine uptime during operations.\n- Engaged in teamwork to execute multiple service requests, averaging **15 service visits** per week to maintain high customer satisfaction.\n- Designed and implemented maintenance schedules for robotic systems, proactively identifying potential issues to reduce risk of failure by **30%**.\n- Worked with precision instruments and tools in fine mechanics to ensure all systems adhered to quality standards, skillfully contributing to projects that required a keen eye for detail.\n- Fostered strong interpersonal relationships with clients, demonstrating social skills to enhance communication and deliver solutions tailored to specific needs.\n- Implemented strategic mechanical upgrades, optimizing machinery to increase efficiency by **20%**, while maintaining compliance with current industry regulations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Leveraged **software** skills to modernize core financial platforms, ensuring scalability and performance through the migration to microservices architecture using **Node.js** (**NestJS/Express**) and **Python** (**FastAPI, Django**).\n- Demonstrated strong **problem-solving abilities** by building interactive front-end applications with **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** for responsive financial tools and admin interfaces.\n- Collaborated effectively in a team setting to deliver real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with insights on transactions and anomalies impacting over **100,000** transactions daily.\n- Exhibited **analytical skills** in designing a robust event-driven architecture with **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring efficient asynchronous communication across critical workflows like payments, alerts, and compliance.\n- Developed ETL pipelines for processing financial data from internal and third-party sources, implementing **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting batch and real-time processing for over **5 terabytes** of data each month.\n- Applied **robotica** knowledge to build and deploy machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive identification of suspicious activity based on user behavior and transactional patterns.\n- Created ML pipelines for real-time credit scoring, churn prediction, and transaction classification, utilizing **MLflow** and **Airflow** to integrate model inference into backend services effectively."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized strong analytical skills to diagnose and resolve technical issues related to machinery, implementing efficient solutions to improve performance metrics by **25%**.\nCollaborated effectively within a team setting to carry out maintenance and repairs on various mechanical systems, ensuring equipment reliability and minimizing downtime by **30%**.\nApplied expertise in fine mechanics and robotics during the installation and servicing of robotic systems, enhancing precision in production lines and contributing to a production increase of **15%**.\nEmployed vision technology and electrical systems knowledge to troubleshoot automated equipment, resulting in a **20%** reduction in error rates during operations.\nDesigned and executed preventative maintenance schedules to proactively identify and rectify potential issues, maintaining optimal functioning of systems.\nExercised strong problem-solving capabilities to develop custom solutions tailored to specific mechanical challenges, thereby improving operational efficiency.\nDemonstrated adept social skills while interacting with clients to provide technical support and service updates, fostering strong customer relationships and satisfaction.\nParticipated in cross-functional teams to integrate software solutions that support automated processes, ensuring alignment with service standards and organizational goals."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n  **Backend Frameworks:**\n\t\n\n  **Frontend Frameworks:**\n\t\n\n  **API Technologies:**\n\t\n\n  **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n  **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\t\n\n  **Other:**\n\twerktuigbouwkunde, fijnmechanica, robotica, vision technologie, elektra, software, analytisch vermogen, oplossend vermogen, teamwork, sociale vaardigheden"
}