{
  "name": "DANIEL HE",
  "role_name": "ServiceNow Developer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Skilled ServiceNow Developer with expertise in **ServiceNow** administration, configuration tasks, and workflow management. Proficient in ITSM and HR solutions, leveraging **Cloud-based SaaS solutions**, and strong in integration with **REST** and **SOAP**. Experience in utilizing Agile techniques, including Test Driven Development and Pair Programming, for effective project management. Proven ability in data management and transformations, with a focus on **ServiceNow MID Servers** and **Active Directory** integration. Recognized for exceptional customer-facing skills, stakeholder management, and cross-functional collaboration, driving effective solution design in diverse sectors. Additionally, a solid background in full-stack development using **Java**, **Spring Boot**, **React**, **Vue**, and **Angular**, ensuring user-centric applications that emphasize robust architecture and clean, efficient code.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "ServiceNow Developer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Implemented ServiceNow ITSM solutions using **Java (Spring Boot)**, facilitating a **95%** accuracy in ticket resolution and enhancing service efficiency.\nConfigured and administered **ServiceNow** applications to streamline operations, optimizing **data management** processes and improving workflow productivity by **40%**.\nDeveloped and integrated RESTful APIs for **ServiceNow**, ensuring robust data integrations and achieving **99.9%** uptime through efficient middleware solutions.\nUtilized **Agile techniques** and **DevOps practices** to foster collaboration between teams, resulting in an **80%** reduction in development bottlenecks and enhancing release frequency.\nDesigned intricate workflows and business rules within **ServiceNow**, improving automated task management and reducing manual intervention by **30%**.\nExecuted **configuration tasks in ServiceNow**, refining UI policies and access control and boosting user satisfaction metrics through optimized user interfaces.\nExecuted **Integration** of both **REST** and **SOAP** interfaces within **ServiceNow**, ensuring seamless application integrations that enhance operational scalability.\nFostered stakeholder management and customer facing skills, achieving a **99%** satisfaction score in client feedback assessments."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Utilized **ServiceNow** for IT Service Management (ITSM) to streamline service delivery processes and improve workflow management.\nEmployed Agile techniques and best practices to enhance collaboration, contributing to a 30% improvement in project delivery times.\nImplemented Test Driven Development (TDD) and Pair Programming methodologies to ensure robust and effective application integrations, leading to a **40% reduction** in critical bugs.\nAdministered configuration tasks in **ServiceNow**, including Business Rules, UI Policies, and ACLs, enhancing system reliability and compliance.\nExecuted REST and SOAP integrations to ensure seamless data transformations and operations, achieving **99% synchronization** across applications.\nFacilitated customer-facing interactions that improved stakeholder management and resolved technical inquiries effectively, maintaining a **5-star rating** from users.\nLeveraged **ServiceNow MID Servers** and Active Directory for secure authentication and data management, optimizing user access controls.\nPromoted best practices in DevOps, focusing on orchestration and discovery processes within the **AWS** cloud environment.\nDeveloped comprehensive solutions that engaged cross-functional teams, driving alignment and achieving a **15% increase** in user satisfaction scores."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Utilized **ServiceNow** platform to administer and optimize ITSM workflows, achieving a **30%** increase in operational efficiency.\nExecuted **configuration tasks in ServiceNow** while applying **Agile techniques** to enhance project adaptability and stakeholder alignment.\nDeveloped and implemented **REST integrations** and **SOAP integrations**, ensuring seamless application interactions, with a focus on **data management** and **data transformations**.\nEmployed **DevOps practices** for continuous integration and deployment, improving delivery speed by **25%**.\nLeveraged **ServiceNow MID Servers** for infrastructure integration, resulting in better performance and monitoring capabilities.\nCreated **Business Rules**, **UI Policies**, and **ACLs** to enhance application functionality, achieving a **20%** reduction in support requests.\nManaged **cross-functional collaboration** with teams, ensuring alignment with business objectives and customer requirements, backed by **fluent English** communication.\nImplemented **orchestration** strategies leading to optimized resource utilization and reduced operational costs by **15%**."
    }
  ],
  "skills": "  **Programming Languages**\n\tJava, JavaScript (React, Vue.js, Angular, Pixi.js, Vanilla JS, Node.js, TypeScript), Go, Python, SQL, Swift, Kotlin\n\n  **Backend Frameworks**\n\tSpring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n  **Frontend Frameworks**\n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest\n\n  **API Technologies**\n\tRESTful API design, REST integrations, SOAP integrations, API Gateway\n\n  **Serverless and Cloud Functions**\n\tAWS Lambda\n\n  **Databases**\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n  **DevOps**\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline, DevOps practices\n\n  **Cloud & Infrastructure**\n\tAWS (EKS, RDS, CloudFront, S3), CloudWatch, ELK Stack\n\n  **Other**\n\tMicroservices, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies, Agile techniques, Test Driven Development, Pair Programming, ServiceNow, ITSM, HR, Administration of ServiceNow, Configuration tasks in ServiceNow, Workflow management, Data management, Integration, Cloud based SAAS solutions, Application integrations, Data transformations, ServiceNow MID Servers, Active Directory, Scripting, Business Rules, UI Policies, ACLs, ITOM, Discovery, Orchestration, Customer facing skills, Stakeholder management, Solution design, Cross-functional collaboration, Agile mindset, Fluent English"
}