{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Security Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Security Engineer with 8 years of experience, I excel in **Incident Response**, **Threat Detection**, and **Malware Analysis** within high-performance environments, particularly in the healthcare and financial sectors. My technical proficiency includes **Networking Technologies** and understanding of **TCP/IP** across diverse operating systems such as **Windows**, **MacOS**, and **Linux**. I bring adept skills in **Coding** and **Scripting** to enhance security protocols and streamline operational metrics. \nI have a proven track record of conducting **Security Investigations** and implementing **Threat Intelligence** strategies that significantly mitigate risks. My strong background in **Cross-Functional Collaboration** helps me effectively work with teams to build robust security measures. Additionally, I leverage my expertise in developing machine learning pipelines and MLOps workflows, always ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted **incident response** and implemented **threat detection** strategies for scalable, full-stack healthcare and financial platforms, ensuring compliance with industry regulations.\n- Led **security investigations** by analyzing system logs and network traffic across **Windows**, **MacOS**, and **Linux** systems, enhancing awareness of potential vulnerabilities.\n- Collaborated cross-functionally to develop security protocols leveraging **networking technologies** and **TCP/IP** stack to fortify application architecture against potential attacks.\n- Designed and optimized **operational metrics** for ongoing risk assessment and incident management, integrating continuous monitoring tools into CI/CD pipelines using **Fastlane** and **App Center**.\n- Developed custom scripts to automate **malware analysis** and **digital forensics** processes, enhancing the efficiency of security assessments on applications built with **TypeScript**, **Python**, and modern frameworks like **React** and **Vue (3.x)**.\n- Engaged in proactive **threat hunting** activities to identify vulnerabilities within healthcare and financial data systems, utilizing insights from **threat intelligence** frameworks.\n- Established comprehensive reporting mechanisms for security incidents, ensuring alignment with best practices in risk management and data protection in line with **HIPAA** and **GDPR** regulations.\n- Delivered expertise on advanced security controls within cloud environments featuring **AWS Lambda** and **Azure Functions**, ensuring high availability and security across applications.\n- Collaborated with engineering teams to integrate **security features** within client-facing applications, driving the adoption of secure coding practices.\n- Executed training sessions on security awareness techniques and **incident response** strategies for cross-functional teams, promoting a culture of security vigilance throughout the organization."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted in-depth **incident response** and **security investigations** for financial platforms, identifying vulnerabilities and implementing corrective measures to enhance system security.\nLeveraged **threat detection** tools to monitor and analyze security incidents in a multi-platform environment, which includes **Windows**, **MacOS**, and **Linux**, resulting in a **30% reduction** in response time to potential threats.\nCollaborated cross-functionally with software development and IT teams to ensure security best practices are integrated into the software development lifecycle, boosting overall security posture by **25%**.\nDeveloped and implemented operational metrics to track the effectiveness of security controls, leading to an increase in user awareness and engagement with security protocols.\nEngaged in proactive **threat hunting** initiatives that led to the identification and mitigation of **50+** potential malware threats, thereby fortifying the financial systems against external attacks.\nApplied knowledge of **networking technologies** and protocols like **TCP/IP** in the analysis and investigation of security events to enhance network defense strategies.\nUtilized **coding** and **scripting** to automate security monitoring tasks, reducing manual intervention by **40%** and improving incident response times.\nConducted **digital forensics** on compromised systems to recover critical data and develop actionable intelligence for threat prevention.\nImplemented **threat intelligence** feeds to stay updated on emerging threats and improve overall security strategy.\nProvided detailed documentation and presentations on findings from security investigations to senior management and stakeholders, fostering a culture of security awareness and compliance."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted thorough **security investigations** on potential incidents, utilizing skills in **Threat Detection** and **Malware Analysis** to identify vulnerabilities across various operating systems including **Windows**, **MacOS**, and **Linux**.\nExecuted **incident response** protocols and collaborated cross-functionally with development and operations teams to strengthen application security measures and enhance operational metrics.\nApplied threat intelligence to proactively address security threats by reviewing system logs and analyzing network traffic, demonstrating proficiency in **networking technologies** and **TCP/IP** protocols.\nEngaged in **threat hunting** activities, enabling rapid identification and mitigation of security threats through in-depth analysis and tactical monitoring of security alerts.\nDeveloped and maintained **coding** and **scripting** procedures to automate security checks and streamline incident response workflows, resulting in a **30%** reduction in response times to security incidents.\nUtilized **digital forensics** techniques to analyze compromised systems, providing detailed reports and actionable insights that informed organizational security strategies.\nCollaborated on operational metrics to assess the effectiveness of existing security measures, achieving a **25%** improvement in overall security posture.\nProvided training and support for cross-functional teams to enhance overall security awareness and implement best practices, leading to increased compliance and user data protection.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tIncident Response, Security Investigations, Threat Detection, Cross-Functional Collaboration, Operational Metrics, Networking Technologies, TCP/IP, Windows, MacOS, Linux, Coding, Scripting, Malware Analysis, Digital Forensics, Threat Intelligence, Threat Hunting",
  "apply_company": "Meta"
}