{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior PHP Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior PHP Engineer with 10+ years of experience delivering high-performance software solutions using **PHP** frameworks such as **Laravel**, **Symfony**, and **CodeIgniter**. Proficient in developing robust **RESTful APIs** and managing databases with **MySQL**. Experienced in front-end technologies including **JavaScript**, **HTML5**, and **CSS3**, enabling full-stack development capabilities. Skilled in **Git** for version control and committed to Agile methodologies, ensuring effective collaboration and continuous delivery. Strong problem-solving abilities and excellent communication skills, with a proven track record of teamwork in complex projects.\nFurthermore, I possess a deep understanding of CI/CD practices, effectively streamlining deployment processes. Passionate about leveraging technology to create impactful solutions while ensuring maintainability and compliance.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped scalable web applications using **PHP**, **Laravel**, and **Symfony**, focusing on high-performance back-end architecture while ensuring seamless integration with front-end technologies like **JavaScript**, **HTML5**, and **CSS3**.\n•\tImplemented RESTful APIs to facilitate efficient communication between client and server, driving enhanced user experiences in complex applications.\n•\tUtilized **MySQL** for database management, achieving data accessibility and reliability through optimized queries, improving data retrieval times by **30%**.\n•\tLed an Agile team in adopting **CI/CD** practices to streamline deployment processes, resulting in a **40%** reduction in time-to-market for new features and bug fixes.\n•\tEngineered solutions with a strong focus on problem-solving and collaboration, fostering a culture of teamwork that improved project delivery timelines by **25%**.\n•\tMaintained version control across projects using **Git**, ensuring code quality and streamlined collaboration within cross-functional teams.\n•\tDesigned user interfaces that meet client requirements, implementing responsive design principles resulting in mobile optimization and improved user engagement by **20%**.\n•\tFacilitated effective communication of project updates and technical discussions with stakeholders, enhancing project transparency and alignment of goals.\n•\tIntegrated tools for enhanced team collaboration and productivity, improving workflow efficiencies by regularly adopting new methodologies and technologies."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Developed and maintained robust **RESTful APIs** using **PHP** frameworks such as **Laravel**, **Symfony**, and **CodeIgniter**, enhancing system performance for high-traffic web applications.\n- Implemented database solutions using **MySQL**, improving data integrity and optimizing performance for transactions and user management by **30%**.\n- Collaborated on an Agile team to deliver features on time, utilizing **Git** for version control and continuous integration/deployment (**CI/CD**) processes, facilitating smoother release cycles.\n- Enhanced user interfaces with **JavaScript**, **HTML5**, and **CSS3**, ensuring cross-browser compatibility for **100%** of users and refined responsive layouts.\n- Applied problem-solving skills to troubleshoot and resolve technical issues, reducing bug resolution time by **25%**.\n- Fostered open communication within the team to align on project goals, enhancing teamwork and overall project delivery effectiveness.\n- Contributed to performance tuning of legacy code, successfully increasing system response times by **40%**, thus significantly boosting user experience."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized backend services using **PHP** with frameworks including **Laravel**, **Symfony**, and **CodeIgniter**, ensuring high performance, reliability, and scalability for key functionalities within the e-commerce platform.\nEngineered RESTful APIs to enhance communication between services and improve data retrieval speed, achieving a **30%** reduction in average response time across critical endpoints.\nImplemented MySQL for robust data management, ensuring data integrity, optimal query performance, and disaster recovery strategies that improved uptime by **15%**.\nCollaborated with cross-functional teams in an **Agile** environment, contributing to sprint planning and retrospectives, while honing effective problem-solving and communication skills.\nUtilized **JavaScript**, **HTML5**, and **CSS3** to create dynamic and user-friendly interfaces, ensuring compatibility across devices and adherence to web standards.\nManaged version control using **Git**, promoting collaboration and maintaining code quality through regular code reviews and CI/CD pipelines, enhancing deployment efficiency by **40%**.\nEngaged in continuous integration and deployment (CI/CD) practices to streamline release processes and reduce deployment time by implementing automated testing frameworks and strategies.\nLeveraged teamwork to support and mentor junior developers, fostering a collaborative and innovative team environment, leading to a **25%** increase in overall team productivity.\n\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, PHP\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Laravel, Symfony, CodeIgniter\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS3\n\n**API Technologies:**\n\tRESTful API\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tAgile, problem-solving, communication, teamwork",
  "apply_company": "Imploy"
}