{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Node Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Node Engineer with 10+ years of experience in full stack development, specializing in **Node.js**, **React**, and CI/CD practices. Adept at building secure and scalable applications, leveraging **Docker** for containerization and deploying REST APIs to enhance user experience. Proven expertise in implementing authentication protocols such as **OAuth2** and **SAML** for Single Sign-On (SSO) solutions. Strong understanding of module bundling and infrastructure-as-code methodologies to streamline deployment processes.\n\nHighly proficient in modern technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**, with extensive experience using **FastAPI** and **Django**. Demonstrated ability in developing enterprise-grade platforms that integrate real-time analytics and intelligent decision-making through AI/ML capabilities. Experienced in microservices architecture, and exceptional skills in debugging and technical documentation.\n\nA collaborative communicator who prioritizes delivering high-performance software solutions that meet compliance standards, while being passionate about driving meaningful impact through technology.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Node Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped scalable, full-stack applications leveraging **Node.js** for server-side logic while utilizing **React** (17–18) for dynamic client interfaces, ensuring high performance and responsiveness.\n•\tOrchestrated CI/CD pipelines through **Docker** and **infrastructure-as-code** principles, deploying applications across multiple environments with a focus on reliability and speed, resulting in a **40%** increase in deployment efficiency.\n•\tIntegrated robust authentication mechanisms using **OAuth2**, **SAML**, and **SSO** standards, enhancing application security for over **1000** users by implementing seamless identity management across services.\n•\tDesigned and consumed **REST APIs** to facilitate efficient communication between microservices, improving data interchange and reducing latency by **30%** in data retrieval processes.\n•\tCollaborated with back-end teams to incorporate **module bundling** strategies, optimizing application loading times by **25%** while maintaining adherence to coding standards and best practices.\n•\tConducted thorough debugging sessions utilizing industry-standard tools, improving code quality and minimizing production errors by **15%** over **6** months.\n•\tEnsured comprehensive documentation of all implemented features, fostering clear communication across the development team and streamlining onboarding processes for new members.\n•\tUtilized strong communication skills to collaborate with cross-functional teams, translating complex technical information into understandable terms, thereby enhancing project deliverables and stakeholder satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** to develop and modernize financial platforms, implementing a microservices-based architecture that increased scalability and maintainability for high-volume transactions by **30%**.\nEmployed **Docker** for containerization, achieving streamlined deployment processes and consistent environments across development and production stages.\nDesigned and built REST APIs using **Node.js (Express)**, ensuring seamless integration with front-end applications and third-party services, enhancing data retrieval speed by **25%**.\nCreated dynamic front-end applications with **React (18)** and **TypeScript**, optimizing performance and responsiveness for user interfaces in financial dashboards.\nImplemented CI/CD practices to automate testing and deployment workflows, reducing the time to release new features by **40%**.\nManaged authentication and authorization protocols utilizing **OAuth2** and **SAML**, enhancing system security and enabling Single Sign-On (SSO) functionalities.\nSuccessfully documented and debugged complex application components, fostering clear communication among team members and ensuring timely resolution of issues.\n\"Optimized module bundling using Webpack, decreasing load times for financial applications significantly \"."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Node.js** for backend service design and optimization, enhancing performance and scalability, particularly in systems like REST APIs for checkout and order fulfillment with an uptick in transaction volume by **30%**.\nEmployed **Docker** for containerization, streamlining development and deployment workflows, which reduced time-to-deploy by **25%** compared to traditional methods.\nImplemented **OAuth 2.0** and **SAML** for secure authentication and single sign-on (SSO) solutions, enhancing user experience and security for over **10,000** active users.\nDeveloped robust e-commerce applications using **React** (version **18**) for dynamic user interfaces and improved customer experience that led to a **15%** increase in user engagement on mobile platforms.\nEstablished CI/CD practices leveraging modern module bundling techniques to ensure expedited delivery cycles and improved collaboration within teams, decreasing production bugs by **40%**.\nConducted comprehensive debugging and documentation practices to enhance code quality and ease onboarding, resulting in a **20%** faster ramp-up time for new engineers.\nFacilitated effective communication across cross-functional teams to align project goals and deliverables, ensuring timely and coordinated releases.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tNode.js, Python, Golang, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST APIs, OAuth2, SAML, SSO\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tinfrastructure-as-code\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, Let’s Encrypt, Nginx, Certbot, debugging, documentation, communication, module bundling",
  "apply_company": "Leading Global Management Consulting Firm"
}