{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Sales Engineer with 9+ years of experience in SaaS and Ad Tech environments, specializing in APIs, RESTful APIs, and technical documentation. Proficient in **Sales Engineering** practices, integrating customer requirements with robust solutions and supporting CRM systems. Strong problem-solving skills complemented by effective collaboration and communication abilities to enhance customer interactions. Previously served as a .NET Full Stack Developer, with extensive knowledge of **microservices architecture**, **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, **.NET**, and **C#**. Proven track record of delivering optimized performance and leading development projects to successful outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Engaged in **Customer Interaction** to understand client needs and deliver tailored solutions using **SaaS** technologies.\nDeveloped and integrated **RESTful APIs** to ensure seamless data access for CRM functionalities, enhancing client engagement.\nCollaborated closely with cross-functional teams to provide technical documentation and support for **Integration Tools**, facilitating smoother implementation processes.\nUtilized **JSON** and **XML** formats to optimize data exchange between the application and third-party services.\nApplied **OAuth** protocols to enhance security measures across the application, ensuring secure client data handling.\nEmployed **problem-solving** skills to address integration challenges, achieving a resolution rate of over **90%** in critical scenarios.\nWorked with platforms that incorporated **Ad Tech** solutions, integrating them with existing systems for improved marketing effectiveness.\nConducted regular **collaboration** sessions with stakeholders to align project goals and drive product enhancements, achieving a **20%** increase in stakeholder satisfaction.\nDemonstrated exemplary **communication** skills by presenting technical concepts to non-technical stakeholders, ensuring comprehensive understanding and alignment.\nSpearheaded the design and development of a web-based customer management platform using **.NET 7** and **ReactJS**, improving user satisfaction by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **RESTful APIs** and **APIs** to create seamless integrations for **SaaS** solutions, enhancing customer experience and streamlining processes.\nFacilitated customer interaction with technical documentation and tailored presentations, resulting in a 20% increase in client satisfaction.\nUtilized **JSON** and **XML** for data interchange, ensuring robust compatibility across platforms.\nEmployed **OAuth** for secure access management in applications, improving data security measures.\nCollaborated with cross-functional teams to address and resolve technical challenges, demonstrating strong problem-solving skills and enhancing project outcomes by **15%**.\nDeveloped technical integration tools to improve efficiency and user experience, leading to a **25%** boost in overall system performance.\nConducted regular training sessions to educate sales teams about technical capabilities, improving communication and collaboration within teams.\nActed as a bridge between engineering and sales, providing valuable insights into product capabilities and customer needs, resulting in a better understanding of market requirements.\nGenerated customer feedback reports and used data analytics to inform product development, contributing to a more data-driven approach in decision making.\nSuccessfully managed complex project timelines, ensuring projects met delivery deadlines and quality standards."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and integrated **RESTful APIs** ensuring seamless data exchange with third-party platforms, enhancing the overall functionality of **SaaS** applications for customer relationship management (CRM).\nLeveraged strong **problem-solving** skills to optimize integration processes with external **APIs**, including **OAuth** for secure authentication, improving user access by **30%**.\nCreated comprehensive **technical documentation** for internal tools and workflows, facilitating better communication and collaboration between sales and engineering teams.\nUtilized **JSON** and **XML** for efficient data management and integration, significantly streamlining customer data retrieval processes.\nDrove customer interactions through effective communication and technical demonstrations, resulting in a **15%** increase in customer engagement.\nCollaborated on ad tech projects that optimized sales strategies, contributing to a **25%** rise in overall sales performance.\nSupported the integration of advanced tracking tools to enhance data-driven decision-making, boosting campaign ROI by **40%**.\nEngaged in regular collaboration with cross-functional teams, including product management and engineering, to address client needs and improve service offerings.\nIdentified opportunities for improving operational efficiency through process enhancements and automation strategies, leading to annual savings of **$100K**."
    }
  ],
  "skills": " **Programming Languages**\n\t Python, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful APIs, GraphQL, JSON, XML, OAuth\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t Cloud Technologies\n\n**Other**\n\t UX/UI Design, Git, GitHub, Technical Documentation, Sales Engineering, SaaS, Ad Tech, Integration Tools, Customer Interaction, Problem Solving, Collaboration, Communication",
  "apply_company": "Topsort"
}