{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior/Staff Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Talented Senior Frontend Engineer with 13+ years of extensive experience in developing high-performance applications tailored for the healthcare and financial sectors. Proficient in **React**, **Next.js**, **JavaScript**, and **TypeScript**, with a strong emphasis on creating responsive UIs and implementing accessibility and usability principles. Skilled in integrating and utilizing APIs, ensuring efficient communication and data flow. Highly adept at debugging and employing tools like **Postman** to streamline development processes.\n\nPossessing a pragmatic mindset and strong attention to design details, I excel in product thinking, ensuring user satisfaction while maintaining technical excellence. Driven by curiosity and autonomy, I actively seek innovative solutions and improvements. Additionally, I have demonstrated hands-on expertise in backend development using **Node.js**, and have experience with cloud services such as **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior/Staff Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed responsive user interfaces utilizing **React (17–18)** and **Next.js** to enhance user experience and accessibility, adhering to usability principles and best practices.\nEmployed **TypeScript** for type safety and improved code maintainability across frontend applications, ensuring high-quality deliverables through rigorous debugging and testing practices.\nCollaborated with cross-functional teams to integrate APIs and manage data flow, effectively utilizing **Postman** for API testing and documentation, ensuring seamless communication with backend services.\nLed the design of user-centric features by applying product thinking and attention to design details, resulting in enhanced user engagement and satisfaction metrics.\nContributed to the overall product strategy by employing a pragmatic mindset and curiosity to constantly explore and implement new technologies and frameworks.\nBuilt and maintained RESTful APIs to ensure efficient data handling between the server and client-side applications, facilitating smooth user interactions in real-time.\nParticipated in code reviews and provided mentorship to junior engineers, fostering an environment of autonomy and continuous learning while improving team productivity by **30%**.\nOptimized application performance and responsiveness through effective debugging and troubleshooting techniques, enabling faster load times and enhanced user experience.\nLeveraged user feedback to iterate on product features, applying insights to enhance usability and achieve a **20%** increase in user retention.\nEnsured compliance with best practices in accessibility, designing solutions that enable inclusive access for users with disabilities."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and maintained interactive front-end applications using **React (18)**, **Next.js**, and **TypeScript**, ensuring high standards of usability and responsive UI design.\n- Implemented **APIs** for seamless data integration, leveraging tools like **Postman** for efficient debugging and optimization.\n- Applied **JavaScript** best practices within scalable architectures while adhering to accessibility and usability principles to enhance user experience.\n- Collaborated autonomously within teams, showcasing a pragmatic mindset and curiosity towards resolving complex frontend challenges.\n- Showed attention to design details across applications to achieve a polished and intuitive interface for users of financial tools and admin panels.\n- Enhanced system performance by applying product thinking in feature development and prioritization, ensuring alignment with user needs and business goals.\n- Facilitated performance reviews, leading to an increase in user satisfaction by **30%** within the first **6** months of implementation.\n- Actively participated in code reviews and mentorship, fostering a culture of knowledge sharing and continuous improvement across the frontend team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized **responsive UI** components using **React (18)** and **Next.js**, ensuring high usability and adherence to accessibility standards (WCAG 2.1) for seamless user experiences.\nDeveloped features with **JavaScript** and **TypeScript**, applying **usability principles** to enhance application performance and navigability, which contributed to a **30% increase** in user engagement.\nCollaborated with backend teams to consume and integrate **APIs** efficiently, utilizing tools like **Postman** for debugging and testing the API interactions, ensuring reliability in data exchange.\nImplemented user interfaces that are both functional and visually appealing, with a keen **attention to design details**, leading to a **15% improvement** in overall customer satisfaction scores.\nApplied proactive **product thinking** to identify user needs and deliver impactful frontend solutions with a **pragmatic mindset**, resulting in faster rollout cycles and enhanced user feedback incorporation.\nFostered a culture of **curiosity** and **autonomy** within the team, enabling innovative problem-solving and continuous learning that optimized the development process and team dynamics.\nEngaged in debugging processes effectively to identify and resolve issues swiftly during development cycles, minimizing downtime and ensuring code quality before release.\nLed initiatives to enhance **accessibility**, delivering products that served diverse user needs while complying with industry standards, enhancing the reach and effectiveness of the digital products we launched.\n"
    }
  ],
  "skills": " **Frontend Frameworks:**\n\tReact,\n\tNext.js,\n\tJavaScript,\n\tTypeScript,\n\tResponsive UI,\n\tAccessibility,\n\tUsability principles,\n\n**API Technologies:**\n\tAPIs,\n\tHTTP,\n\tPostman,\n\n**Programming Languages:**\n\tPython: FastAPI, Flask, Django,\n\n**Backend Frameworks:**\n\t\n\n**DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3,\n\tAzure: App Services, Blob Storage, SQL Database,\n\n**Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\n**Other:**\n\tMLflow,\n\tAirflow,\n\tKubeflow,\n\tKeycloak (OIDC, RBAC),\n\tOAuth2,\n\tJWT,\n\tNginx,\n\tLet’s Encrypt,\n\tCertbot,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose,\n\tDebugging,\n\tProduct thinking,\n\tAttention to design details,\n\tPragmatic mindset,\n\tCuriosity,\n\tAutonomy "
}