{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cybersecurity Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Cybersecurity Engineer with 8 years of comprehensive experience, I possess strong skills in **Cloud Security**, **Security Frameworks**, and **Vulnerability Assessment**. My background in **penetration testing**, **incident response**, and risk management supports my ability to safeguard organizational assets effectively. I have a solid understanding of cybersecurity principles and practices to counter threats and protect sensitive data.\nIn addition to my cybersecurity expertise, I am proficient in **JavaScript**, **TypeScript**, **Python**, and **Flutter** for developing secure applications. My experience in the **cloud** with platforms like **Azure** and **AWS** enhances my ability to implement robust security measures in various environments. I am also adept at using security tools for encryption and network security, ensuring compliance with necessary regulations. With a proven track record in analytical thinking, mentoring, and communication, I excel at fostering a culture of security awareness while delivering high-performance solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cybersecurity Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and implemented robust **Cloud Security** strategies to protect healthcare and financial information during application development, ensuring compliance with standards such as HIPAA and PCI DSS.\n- Conducted comprehensive **Vulnerability Assessments** on full-stack applications including those utilizing **TypeScript**, **Python (FastAPI)**, and **Node.js**, identifying and mitigating potential security risks before deployment.\n- Designed and enforced **Security Frameworks** for DevOps pipelines, employing tools like **GitHub Actions** and **CircleCI** to ensure secure coding practices throughout the software development lifecycle.\n- Led incident response activities leveraging experience in **Encryption** techniques to safeguard sensitive data against breaches and vulnerabilities.\n- Mentored junior engineers on **Penetration Testing** methodologies, enhancing team capabilities in identifying security loopholes in healthcare and fintech applications.\n- Integrated cutting-edge **Security Tools** for ongoing monitoring and response, including **Firebase Crashlytics** for error management and services utilizing **Sentry** for performance assessments.\n- Enhanced **Network Security** by architecting microservices-based applications using **Docker** and **Kubernetes (AKS/EKS)** to ensure secure and high-availability deployments.\n- Managed security protocols for cloud environments, focusing on risk management and compliance with services like **AWS Lambda** and **Azure Functions**.\n- Engaged in analytical evaluation of security frameworks adapting to emerging threats and vulnerabilities, leading to a **40% reduction** in reported incidents over **6 months**.\n- Communicated effectively with cross-functional teams to promote a culture of cybersecurity awareness and best practices across development, operations, and data management teams.\n- Maintained clear documentation and reports using analytical skills to interpret data for stakeholders, driving informed decision-making in security posture improvements.\n- Conducted regular training sessions to keep teams updated on the latest in **Cybersecurity** trends and technologies, fostering an environment of continuous learning."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive **vulnerability assessments** on financial platforms to identify and mitigate security risks, enhancing the overall **network security** posture by **30%**.\nImplemented robust **incident response** protocols to efficiently address security breaches, leading to a **20%** reduction in incident resolution time.\nDeveloped and maintained **encryption** strategies to protect sensitive financial data, ensuring compliance with industry standards and regulations.\nCreated and enforced security frameworks aligned with best practices, contributing to the overall **cloud security** strategy by integrating it with existing workflows.\nProvided mentorship to junior team members on cybersecurity best practices, improving team capabilities and fostering a culture of **analytical thinking** and proactive risk management.\nEngineered penetration testing methodologies using advanced **security tools**, enhancing the resilience of the financial infrastructure against potential cyber threats.\nEnhanced organizational **communication** strategies around security protocols, raising awareness among stakeholders and reducing potential vulnerabilities.\nCollaborated with cross-functional teams to integrate cybersecurity measures into the software development lifecycle, ensuring secure coding practices are adopted from the outset.\nConducted regular audits and assessments of security processes, leading to the identification and resolution of **90%** of previously unaddressed vulnerabilities."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted **Vulnerability Assessments** and penetration testing on various applications to identify and mitigate security risks, ensuring compliance with industry standards and best practices.\nDeveloped and implemented robust **Security Frameworks** to safeguard network resources, enhancing overall cyber resilience by creating strategies against threats and breaches.\nLed **Incident Response** efforts by analyzing security incidents and coordinating mitigation actions, reducing security breaches by **30%** within a year through effective communication and analytical strategies.\nMentored junior team members and conducted training sessions on **Cybersecurity** protocols and **Incident Response** procedures, ensuring a well-informed team capable of addressing emerging threats.\nCollaborated with cloud infrastructure teams to enforce **Cloud Security** measures, applying encryption standards to sensitive data, reducing unauthorized access incidents by **25%**.\nApplied analytical thinking to evaluate existing **Security Tools** and recommend enhancements or replacements based on their effectiveness in real-world scenarios.\nParticipated in **Risk Management** initiatives, assessing organizational risk appetite and developing mitigation strategies that led to improved overall security posture, capturing and addressing **50+** identified vulnerabilities in a quarterly cycle.\nPromoted a culture of security awareness by establishing regular communication channels to discuss **Network Security** concerns and updates within the organization, achieving **95%** engagement in training programs.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\n **Other:**\n\tCybersecurity, Network Security, Cloud Security, Security Frameworks, Vulnerability Assessment, Encryption, Penetration Testing, Security Tools, Incident Response, Risk Management, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Analytical Thinking, Communication, Mentoring",
  "apply_company": "Arctic Wolf"
}