{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Backend Engineer with 8 years of experience in designing and developing scalable backend solutions. Proficient in **Java**, **Spring Boot**, and API development, with a strong command of **AWS** and **CDK** for cloud services integration. Experienced in both **SQL** and **NoSQL** databases, leveraging data for optimal system performance. I excel in Test Driven Development (TDD) practices, ensuring high-quality code through rigorous testing. \nMy background also includes robust collaboration skills, enhancing teamwork and project outcomes through effective communication. I bring expertise in **Python** and familiarity with full-stack technologies, enabling a comprehensive understanding of system architecture and functionality. I have successfully led projects that adhere to best practices in documentation and compliance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained robust APIs using **Java** and **Spring Boot**, ensuring seamless integration with front-end applications and enhancing overall system performance.\nDesigned and optimized database schemas utilizing **SQL** and **NoSQL** databases, ensuring efficient data retrieval and storage for applications managing healthcare and financial data.\nImplemented Test Driven Development (TDD) practices, employing testing frameworks to ensure high code quality and reliability across all backend services.\nSkillfully collaborated with cross-functional teams to gather requirements, provide documentation, and ensure alignment on project objectives, facilitating a smooth development process.\nLeveraged **AWS** services and **CDK** for infrastructure as code, streamlining deployment processes and automating infrastructure management for scalable and fault-tolerant applications.\nArchitected solutions that comply with industry standards such as HIPAA and GDPR while implementing strong security features to protect sensitive data.\nConducted regular code reviews and integrated best practices for software engineering, significantly improving team productivity and code maintainability.\nPerformed troubleshooting and debugging to resolve critical issues quickly, maintaining application performance and user satisfaction.\nParticipated in the design and development of data-intensive applications, focusing on high availability and reliability to handle large volumes of transactions.\nMentored junior developers, fostering a collaborative environment and sharing best practices in development and deployment strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained robust **API** services using **Java** and **Spring Boot**, ensuring efficient communication between microservices and external systems to enhance system performance.\nFocused on implementing **SQL** and **NoSQL** databases to optimize data insertion and retrieval processes, achieving a **30%** improvement in database performance.\nCollaborated with cross-functional teams to design and implement **AWS** infrastructure solutions using the **AWS CDK**, streamlining deployment processes and reducing environment setup time by **50%**.\nEmployed **Test Driven Development** (TDD) practices to ensure high-quality code, leading to a reduction in defects by **40%** and enhancing application reliability.\nConducted thorough project documentation for all development processes, promoting transparency and knowledge sharing across the team.\nLeveraged **Python** for scripting and automation tasks, increasing operational efficiency and reducing manual work by **20%**.\nParticipated actively in code reviews and team meetings, fostering a collaborative team environment that promotes continuous learning and innovation."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized RESTful **API** services for high-traffic applications using **Java** and **Spring Boot** to ensure robust performance and scalability.\nCollaborated with cross-functional teams to implement **AWS** solutions using **AWS CDK** for seamless cloud deployment, monitoring, and management of application infrastructure.\nDesigned, constructed, and maintained **SQL** and **NoSQL** databases, ensuring data integrity and optimized query performance for backend services.\nImplemented Test Driven Development (TDD) practices to develop high-quality, maintainable code, enhancing reliability and facilitating easier debugging and updates.\nEngaged in effective collaboration and documentation practices, leading to more streamlined workflows and improved understanding across team members.\nUtilized **Python** for scripting and automation tasks, enhancing operational efficiency within the backend systems.\nEnsured performance testing and scalability assessments to meet demanding application requirements, reporting improvements of **30%** in response times.\nParticipated in agile activities and regular code reviews, fostering a culture of continuous improvement and knowledge sharing within the engineering team."
    }
  ],
  "skills": "Programming Languages:\n\tJava, Python\n\n**Backend Frameworks:**\n\tSpringboot, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS, AWS Lambda, Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, SQL, NoSQL, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Test Driven Development, collaboration, documentation, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Enfuce"
}