{
  "name": "Tomasz Lee",
  "role_name": "Senior GPU Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior GPU Engineer with 9+ years of experience in performance optimization and code profiling, effectively leveraging advanced algorithms and problem-solving skills. Proficient in **C++** and **CUDA**, with a strong focus on enhancing GPU performance in high-demand environments. Proven track record of autonomous work, paired with exceptional communication skills to collaborate across various teams and drive projects to successful outcomes. Originally skilled in complex application design and microservices architecture using technologies such as **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, **.NET**, and **C#**, which underscores a versatile technical foundation.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior GPU Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **C++** and **CUDA** to implement high-performance algorithms, enhancing GPU performance optimization on critical tasks by **30%**.\nConducted thorough code profiling to identify bottlenecks, resulting in a **20%** increase in processing speed across various applications.\nExecuted autonomous work methodologies to independently solve complex problems, introducing innovative techniques that reduced overall project completion time by **15%**.\nCollaborated with cross-functional teams through effective communication to align on technical requirements and deliverables, enhancing project clarity and execution.\nDeveloped and optimized algorithms for GPU computing tasks, ensuring high efficiency and scalability within systems.\nProvided comprehensive documentation and knowledge sharing sessions to improve team competencies in GPU architecture and performance.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Utilized **C++** and **CUDA** to develop high-performance algorithms, achieving a **20%** increase in processing speed for GPU tasks.\n• Conducted rigorous code profiling and performance optimization techniques resulting in a **35%** reduction in resource consumption during peak workloads.\n• Leveraged advanced problem-solving skills to troubleshoot and resolve **GPU** related issues, improving system reliability.\n• Engaged autonomously in various project stages, maintaining efficiency in development while adhering to timelines.\n• Communicated effectively with cross-functional teams to facilitate the integration of GPU processing in existing workflows, enhancing overall system performance.\n• Championed code reviews and provided mentorship to junior developers, fostering a collaborative and productive team environment.\n• Developed algorithms with a focus on optimization, contributing to the enhancement of overall computational performance for complex tasks.\n• Engaged in continuous learning and adaptation of new technologies, ensuring up-to-date practices in GPU engineering."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C++** and **CUDA** for the development of high-performance algorithms, optimizing GPU resource utilization by up to **30%**.\nConducted comprehensive performance optimization and code profiling, successfully reducing processing time by **25%**.\nEngaged in autonomous work to independently solve complex problems, enhancing overall project efficiency.\nCommunicated findings and technical insights through detailed reports, ensuring effective collaboration with cross-functional teams.\nProvided mentorship on **GPU** programming techniques and best practices to junior engineers, fostering skill development within the team.\nDeveloped and maintained efficient algorithms for data processing, achieving significant speed improvements in computational tasks.\nParticipated in code reviews and contributed to best practice documentation, promoting coding standards and software quality.\nCollaborated with stakeholders to identify project requirements and deliver technical solutions aligned with business goals."
    }
  ],
  "skills": "**Programming Languages**\n\tC++, JavaScript, TypeScript, Python, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tGit, GitHub\n\n**Other**\n\tAlgorithms, Performance Optimization, Code Profiling, Problem-Solving, Autonomous Work, Communication, Testing Tools (NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest), Messaging & Caching (Apache Kafka, RabbitMQ, Redis), Blockchain (Ether.js, Web3.js, Ethereum), UX/UI Design",
  "apply_company": "Globaldev Group"
}