{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of extensive experience in developing and implementing robust applications. Proficient in **Python**, **JavaScript**, and frameworks such as **FastAPI**, **Flask**, and **Django**. Skilled in cloud platforms like **GCP** and **AWS**, ensuring seamless deployment and scalability of applications. Strong command of **REST**ful services, **SQL**, and CI/CD tools including **GitHub Actions** and **CircleCI**. Experienced in **Docker** for containerization and cross-platform development. Proven track record of optimizing development processes, conducting data analysis, and maintaining high standards of version control. Adept at fostering collaboration across diverse teams to ensure successful project delivery.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** frameworks such as **Flask** and **Django** to develop and maintain scalable web applications, achieving a user satisfaction increase of 25%.\nIntegrated **FastAPI** for efficient API development, improving response times and reducing server load.\nLeveraged **AWS** and **GCP** for cloud services, enhancing application deployment and scalability across **3** regions.\nImplemented **RESTful APIs** adhering to best practices for seamless integration with **SQL** databases, improving data access efficiency.\nManaged version control and CI/CD processes using **GitHub Actions** and **CircleCI**, resulting in a **40%** reduction in deployment time.\nContainerized applications using **Docker**, ensuring consistent environments across development and production.\nConducted data analysis to derive insights and optimization strategies, leading to a **20%** increase in system performance.\nDesigned cross-platform applications that enhanced accessibility and user engagement through improved UI.\nCollaborated with cross-functional teams to ensure software quality and implementation of best practices, including security measures like JWT for authentication.\nEngaged in code reviews and mentorship, fostering a culture of knowledge sharing and continuous improvement within the development team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Python** frameworks such as **FastAPI**, **Flask**, and **Django** to design and develop scalable web applications, enhancing service delivery by 20%.\nImplemented CI/CD pipelines using **GitHub Actions** and **CircleCI**, streamlining the deployment process and reducing downtime by 30%.\nDeveloped RESTful APIs that integrate seamlessly with **SQL** databases, ensuring real-time data access and management.\nLeveraged **AWS** and **GCP** for cloud solutions, achieving a cost reduction of 15% in infrastructure expenses through optimized resource allocation.\nCreated and maintained Docker containers for cross-platform application deployment, achieving consistency across development and production environments.\nEmployed data analysis techniques to drive decision-making processes, contributing to a 10% increase in project completion speed.\nGuided development teams through version control best practices, improving collaboration and code quality.\nConducted extensive code reviews and mentorship sessions with junior developers, resulting in a measurable improvement in team productivity.\nEngaged with stakeholders to define system requirements and establish development timelines for on-time project delivery.\nLed the design of user-centric interfaces utilizing JavaScript frameworks to enhance user experience, leading to a 25% improvement in user engagement metrics."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop scalable microservices, enhancing application performance by **30%**.\nIntegrated **Django** with **AWS** for deploying applications on the cloud, achieving a **99.9%** uptime.\nImplemented Docker containers for development and production environments, standardizing application deployment across **3** platforms.\nEnhanced data retrieval processes using **SQL** queries, improving query response time by **25%**.\nSet up automated CI/CD pipelines using **GitHub Actions** and **CircleCI**, reducing deployment time by **40%**.\nConducted thorough data analysis to drive informed decision-making, increasing project efficiency.\nCollaborated on cross-functional teams to maintain code quality and adherence to best practices during daily standups and code reviews.\nDelivered comprehensive technical documentation for all developed functionalities, ensuring seamless knowledge transfer across teams.\nEngaged in hands-on coding and mentoring of junior developers, fostering a culture of growth and learning.\nConsistently met project deadlines through effective time management and prioritization of tasks."
    }
  ],
  "skills": "****Programming Languages****\n\tPython, JavaScript\n\n****Backend Frameworks****\n\tFastAPI, Flask, Django, NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n****Frontend Frameworks****\n\tHTML, CSS, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n****API Technologies****\n\tRESTful API, GraphQL, REST\n\n****Serverless and Cloud Functions****\n\tAWS, GCP\n\n****Databases****\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\n****DevOps****\n\tCI/CD, GitHub Actions, CircleCI, Docker, CI/CD pipelines\n\n****Cloud & Infrastructure****\n\tAWS, Azure\n\n****Other****\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Cross-platform, Data analysis, Version control",
  "apply_company": "Mozilla"
}