{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-oriented Senior Field Engineer with a robust background in **software** development and a penchant for **troubleshooting** complex systems. Leveraging 13+ years of experience in the development and maintenance of high-performance applications, focusing on **communication** and **customer service** to effectively address client needs. Adept at integrating **electrotechnics** and **mechatronics** principles into innovative solutions, ensuring operational efficiency and reliability. Skilled in **problem-solving** with a record of successfully implementing systems that support automated processes and enhance user experiences. \nKey strengths include adaptability and **flexibility** in rapidly evolving environments, along with a commitment to compliance and regulatory standards. Strong proficiency in **JavaScript/TypeScript**, **Python**, **Flutter**, and frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Familiar with deploying solutions on cloud platforms like **AWS** and **Azure**, with a focus on microsystem design and modern operational methodologies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Provided exceptional customer service by communicating effectively with clients and addressing technical issues related to electrotechnics and mechatronics.\n• Conducted troubleshooting of complex systems, including hardware and software components, ensuring minimal downtime and efficient operation.\n• Performed routine maintenance on mechanical systems, enhancing their longevity and reliability.\n• Designed and implemented controllers for electromechanical systems, utilizing strong problem-solving skills to optimize performance.\n• Collaborated with cross-functional teams to develop innovative solutions in software and hardware, showcasing flexibility and adaptability in various engineering scenarios.\n• Led training sessions to improve team communication and customer service capabilities, promoting a positive work environment.\n• Monitored and evaluated system performance metrics, achieving a **20%** increase in efficiency through targeted upgrades and modifications.\n• Implemented software-driven solutions to streamline processes, resulting in a **15%** reduction in operational errors.\n• Documented procedures and created user guides to facilitate maintenance and troubleshooting, enhancing overall team knowledge and skills.\n• Resolved customer inquiries related to electrotechnics and mechanical systems within an average response time of **3 hours**, ensuring client satisfaction."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized excellent **communication** skills to liaise with clients, providing top-tier **customer service** and ensuring their needs are met with precision.\nDemonstrated **problem-solving** abilities by **troubleshooting** complex electrical and mechanical issues in field installations, reducing downtime by **30%**.\nExecuted maintenance programs on electromechanical systems, applying **flexibility** to adapt to unexpected challenges and changes in project requirements.\nCollaborated with cross-functional teams to streamline operations, integrating advanced **software** for monitoring and managing **controllers** to optimize system performance.\nApplied **mechatronics** principles to enhance the functionality of systems, improving overall efficiency and effectiveness in field operations by **25%**.\nConducted thorough assessments to ensure compliance with safety standards, resulting in a **40%** decrease in incident reports.\nMaintained a **99%** customer satisfaction rating over **2 years** through diligent follow-ups and proactive communication during field service activities.\nPrepared detailed reports on system performance and maintenance updates, ensuring clear and consistent communication of findings to stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged software engineering skills to develop, troubleshoot, and maintain complex systems, ensuring high efficiency and functionality in mechanical and electromechanical environments.\nUtilized **controllers** and **software** systems to enhance product performance, integrating **communication** protocols for improved customer service and system reliability.\nApplied problem-solving techniques to diagnose and resolve technical issues, resulting in a **30%** reduction in downtime through proactive troubleshooting methods.\nDemonstrated flexibility by adapting to changing project requirements and conditions, successfully handling **15+** concurrent assignments while maintaining quality and performance standards.\nEngaged in effective communication with clients to understand their needs and deliver tailored solutions, enhancing customer satisfaction metrics by **25%**.\nConducted preventive maintenance on systems, utilizing electromechanical skills to ensure optimal operation and lifetime of equipment while decreasing repair costs by **20%**.\nCollaborated with interdisciplinary teams, applying mechatronics principles to identify and implement innovative solutions for complex engineering challenges, leading to streamlined workflows and enhanced service delivery.\nProvided on-site training and support to clients for new **software** and controls, improving user proficiency and operational efficiency across various platforms."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\telectrotechnics, mechatronics, mechanical, software, controllers, troubleshooting, maintenance, customer service, communication, flexibility, problem-solving",
  "apply_company": "Recruitment Team"
}