{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior QA Engineer with 13+ years of experience in software development, emphasizing **test automation**, **functional testing**, **regression testing**, and **end-to-end testing**. Proficient in **JavaScript**, **TypeScript**, **React**, and **Node.js**, leveraging these technologies to ensure high-quality deliverables. Strong expertise in building and maintaining **CI/CD** pipelines that enhance deployment efficiency and software reliability. \nSkilled in using **Playwright** for robust test automation strategies, ensuring comprehensive coverage and performance of applications. Committed to clear communication and collaboration with cross-functional teams to identify potential issues and drive continuous improvement. Background in developing high-performance applications within healthcare and financial industries, utilizing **Python**, **Flutter**, and frameworks such as **FastAPI** and **Django**. Experienced in building AI/ML-powered platforms and proficient in deploying cloud-native systems on **AWS** and **Azure**, including implementing microservices and event-driven architectures. Knowledgeable in compliance-driven development standards, ensuring alignment with HIPAA, FHIR, PCI DSS, and SOC 2. Strong foundation in MLOps, focused on model training, serving, and orchestration with tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented **test automation** frameworks leveraging **Playwright**, ensuring comprehensive **end-to-end testing** and enhancing the reliability of applications across **JavaScript** and **TypeScript** platforms.\n- Developed and maintained **CI/CD** pipelines to streamline testing processes, facilitating automated builds and deployments, resulting in a **25% reduction** in release cycle time.\n- Collaborated with development teams using **React** and **Node.js** to establish effective testing strategies, including **functional testing** and **regression testing**, which improved user experience and product quality by **30%**.\n- Designed robust testing scripts and scenarios to validate application features and functionalities, achieving a **95% test coverage** across critical modules.\n- Coordinated cross-functional communication to identify and resolve quality-related issues, fostering a collaborative environment that enhanced team's overall productivity by **20%**.\n- Participated in code reviews and provided actionable feedback to peers on testing best practices using modern **JavaScript** frameworks, driving improvements in code quality.\n- Conducted regular performance testing and reported insights to the development teams, contributing to a **15% improvement** in application response times.\n- Led knowledge-sharing sessions on emerging **testing tools** and techniques, fostering a growth mindset within the team and enhancing overall skill sets."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **test automation** frameworks utilizing **Playwright** for robust **end-to-end testing** across applications, resulting in a **30% reduction** in regression testing time.\nConducted **functional testing** and **regression testing** to ensure high-quality deliverables in line with specifications, achieving a **99% bug-free** release rate.\nCollaborated cross-functionally with development teams to optimize **CI/CD** pipelines, enabling quicker integration and delivery with **multiple deployments per week**.\nUtilized **JavaScript** and **TypeScript** to extend testing frameworks and tools, enhancing the accuracy of automated tests and user interface validation.\nModernized core financial applications by migrating to microservices architecture using **Node.js** (NestJS/Express) and Python (FastAPI, Django), improving scalability for high-volume transactional systems.\nBuilt interactive front-end applications with **React** (18), **Vue 3**, **Next.js**, and utilized **Redux Toolkit** and **Tailwind CSS** for responsive design in financial tools.\nDelivered real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, enabling operations teams to gain insights into transactions.\nDesigned an event-driven architecture using **Kafka** and **RabbitMQ**, ensuring smooth communication across workflows such as payments and alerts.\nDeveloped ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time data ingestion from various sources.\nCreated machine learning models for fraud detection leveraging **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive monitoring of transactional patterns."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Executed test automation strategies utilizing **Playwright** to create robust functional and end-to-end tests for the web applications, increasing test coverage by **30%** while improving overall product quality.\nDeveloped CI/CD pipelines incorporating **JavaScript** and **TypeScript** to streamline the deployment process, reducing integration time by **50%** and enabling faster feedback on new features.\nCollaborated closely with development teams to identify, analyze, and resolve defects, ensuring seamless integration of testing efforts within the **React** and **Node.js** frameworks used throughout the application stack.\nLed regression testing initiatives to validate software updates, ensuring stability and reliability of the new builds by reducing severe bugs by **40%** post-deployment.\nFacilitated clear and effective communication across teams to promote a testing culture and share best practices in **test automation**, improving collaboration and knowledge sharing.\nDesigned and implemented comprehensive functional testing protocols, leveraging automated tools to guarantee that major use cases are covered and functioning as intended, thus enhancing end-user satisfaction.\n\nApplied risk-based testing methods to prioritize testing efforts based on user impact and business needs, thereby focusing resources on critical features of the application.\nConducted extensive reviews of test cases and documentation, ensuring compliance with industry standards and enhancing the overall effectiveness of the QA processes.\nParticipated in sprint planning and retrospectives, providing insights on improving the QA workflow and integration with agile practices, contributing positively to team velocity."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**CI/CD & Infrastructure as Code:**\n\tGitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**DevOps:**\n\tDocker, Kubernetes\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Playwright, test automation, functional testing, regression testing, end-to-end testing, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, communication",
  "apply_company": "lemlist"
}