{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Nutanix Infrastructure Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Senior Nutanix Infrastructure Engineer with 8+ years of experience, I specialize in optimizing data center infrastructure and ensuring seamless disaster recovery solutions. Proficient in using **Nutanix**, **Citrix**, **NVIDIA**, and **Prism Central**, I excel in leveraging **Nutanix Flow**, **Nutanix CLI**, and **NGT Tools** for efficient management and orchestration of cloud resources. My expertise extends to **AWS** integration, Linux system administration, and implementing role-based access control (RBAC) to enhance security and compliance. With a strong background in networking and infrastructure design, I am adept at delivering reliable, high-performing systems tailored to diverse business needs, while consistently adhering to industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Nutanix Infrastructure Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Designed and implemented disaster recovery solutions utilizing **Nutanix** technologies to enhance system reliability and uptime, achieving a **99.9%** service level agreement.\nConfigured and managed **Nutanix Prism Central** for centralized monitoring and management, streamlining infrastructure operations and optimizing resource allocation.\nIntegrated **Citrix** solutions with **Nutanix** infrastructure to support secure access and enhance user experience, leading to a **30%** increase in operational efficiency.\nDeveloped and managed network configurations using **Nutanix Flow** and **RBAC** for secure and segmented access control, ensuring compliance with organizational security standards.\nAdministered **Nutanix CLI** for efficient management of virtual environments, reducing manual configuration time by **40%**.\nLeveraged **AWS** cloud services to design hybrid cloud infrastructures, improving scalability and reducing costs by **25%**.\nImplemented robust networking solutions across **Nutanix** clusters, enhancing data flow and reducing latency during peak usage periods.\nProvided technical guidance and mentorship to junior engineers on **Linux**, **RBAC**, **Nutanix**, and cloud infrastructure best practices, fostering skills development and knowledge sharing.\nConducted system performance tuning and capacity planning using **Nutanix** metrics, achieving a **20%** improvement in application response times.\nExecuted comprehensive testing and validation of **Nutanix** deployments to ensure alignment with business continuity objectives and disaster recovery protocols.\nFacilitated seamless integration of virtualization technologies with **NVIDIA** GPUs, enhancing performance for compute-intensive applications and workloads.\nDeveloped automated scripts for infrastructure management that reduced operational overhead by **15%**, utilizing **Nutanix CLI** and shell scripting techniques.\nParticipated in regular security audits and compliance checks to ensure adherence to industry standards and regulations, including helping to meet **SOC 2** and **ISO 27001** requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Implemented and managed **Nutanix** infrastructure to ensure seamless operations and disaster recovery processes, enhancing overall system resilience.\nLeveraged **Prism Central** for monitoring and managing virtual environments, ensuring optimal performance and efficient resource utilization within a **Nutanix** architecture.\nUtilized **Nutanix CLI** to automate routine tasks and streamline management operations, resulting in a **30%** reduction in administrative overhead.\nConfigured and maintained virtual desktop infrastructure using **Citrix**, enabling secure remote access and improving user experience for over **1,000** users.\nDeveloped and executed disaster recovery plans, achieving **99.9%** uptime and securing business continuity during critical outages.\nApplied **Linux** operating system principles to optimize server performance and manage system resources effectively.\nExecuted network optimizations and performance tuning strategies, improving data transfer efficiency by **25%** across multiple sites.\nImplemented **RBAC** (Role-Based Access Control) to enforce security protocols, ensuring that only authorized personnel had access to sensitive data and resources.\nUtilized **AWS** services to enhance cloud infrastructure, improving scalability and flexibility of the company's applications.\nCollaborated with cross-functional teams to ensure the integration of **Nutanix Flow** for micro-segmentation, providing enhanced security and control over network traffic.\nContinued education and training in **Nutanix**, **NVIDIA**, and **NGT Tools** to stay abreast of emerging technologies and best practices within the infrastructure landscape."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Leveraged **Nutanix** and **Citrix** technologies to design and optimize infrastructure for scalable e-commerce solutions, improving system performance by **30%**.\n- Implemented disaster recovery strategies utilizing **Nutanix** and **Prism Central**, ensuring data integrity and minimal downtime during system outages.\n- Managed **Nutanix Flow** for network segmentation, thereby enhancing security and compliance in deployment environments by reducing vulnerabilities.\n- Utilized **Nutanix CLI** to automate infrastructure provisioning, leading to a **40%** reduction in deployment time across multiple environments.\n- Configured and maintained **AWS** cloud services to meet high-availability demands, achieving a **99.9%** uptime for critical e-commerce services.\n- Integrated Linux-based systems for backend support, streamlining server management and enhancing performance monitoring through efficient resource allocation.\n- Implemented **RBAC** for user access control in the infrastructure environment, ensuring secure and personalized access based on user roles.\n- Collaborated with development teams to optimize network configurations and troubleshoot issues, resulting in a **25%** improvement in response times.\n- Developed comprehensive documentation and training materials for infrastructure best practices, facilitating knowledge transfer and team efficiency.\n- Engaged with cross-functional teams to conduct performance testing and optimize existing workflows, achieving greater resource utilization and cost efficiency.\n- Utilized monitoring tools to ensure infrastructure health and performance, proactively identifying and resolving potential issues before they impact operations."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython (FastAPI, Django, Flask)\n\n **Backend Frameworks:**\n\tSpring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL), Nutanix, Citrix, NVIDIA, Networking\n\n **Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Disaster Recovery, Prism Central, Nutanix Flow, Nutanix CLI, Linux, NGT Tools"
}