{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Full Stack Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven Senior Full Stack Software Engineer with 13+ years of experience in developing high-performance applications, primarily in the healthcare and financial sectors. Expertise in **TypeScript**, **ReactJS**, **NodeJS**, and **NestJS**, with strong capabilities in RESTful APIs, ensuring seamless integration and end-to-end solutions. Proficient in **AWS**, **Azure**, and **Google Cloud**, with a solid understanding of CI/CD practices and Agile methodologies, ensuring rapid and iteration-driven development.\nSkilled in visualizing data effectively using **AG Grid** and **Apache Echarts**. Proven track record in problem-solving and collaborative communication, fostering efficient team dynamics. Experienced in leveraging modern frontend and backend frameworks while maintaining compliance with industry standards. Strong background in developing scalable architectures that support business growth and innovation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript**, **NodeJS**, and **ReactJS** to design and build robust full-stack web applications that meet client specifications in fast-paced **Agile** environments.\nEmployed **PostgreSQL** for database management, ensuring effective data modeling and seamless integration with RESTful APIs, while optimizing for performance and scalability.\nDeveloped user interfaces using **AG Grid** and **Apache Echarts**, delivering interactive data visualizations that supported real-time analysis and user engagement.\nImplemented **CI/CD** pipelines using Git as the primary version control system, enhancing code quality through automated testing and reliable deployment processes.\nCollaborated effectively with cross-functional teams to solve complex problems, sharing technical insights and solutions to drive project success and meet deadlines.\nUtilized cloud services such as **AWS** and **Azure** to deploy scalable back-end solutions, ensuring high availability and resilience of services.\nEngaged in continuous improvement by adapting to new technologies and methodologies, contributing to the team’s development and knowledge base.\nLed debugging and troubleshooting initiatives for application performance issues, demonstrating strong problem-solving skills to enhance user experiences.\nFacilitated user acceptance testing and provided detailed feedback on application features, maintaining clear communication lines with stakeholders and clients.\nFostered a culture of constant learning through mentoring junior developers and promoting best practices within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed interactive front-end applications with **React (18)**, **TypeScript**, and **Vue 3**, incorporating state management with **Redux Toolkit** and flexible styling using **Tailwind CSS**, which led to a 30% increase in user engagement for financial tools.\n• Engineered robust back-end systems using **Node.js (NestJS)**, delivering over **100,000** transactions per day with optimized performance and scalability.\n• Designed and implemented RESTful APIs and microservices architecture to enhance connectivity and functionality across platforms, ensuring seamless integration with **PostgreSQL** databases.\n• Achieved a 95% reduction in response time by utilizing asynchronous communication frameworks like **Kafka** and **RabbitMQ** to enhance event-driven architectures.\n• Leveraged **Python (FastAPI/Django)** to develop ETL pipelines that process, transform, and manage large datasets from internal and **third-party sources**, improving data accessibility and insights.\n• Constructed real-time analytics dashboards using **D3.js** and integrated **Power BI Embedded**, which provided instant insights to operations teams and reduced reporting time by **50%**.\n• Deployed machine learning models for fraud detection utilizing **scikit-learn** and **XGBoost**, leading to a **20%** increase in the identification of fraudulent activities, thus enhancing security measures.\n• Engaged in Agile methodologies for project management, ensuring timely delivery of features while effectively communicating technical enhancements to stakeholders, resulting in a **40%** increase in project delivery speed.\n• Utilized **Git** for version control and implemented **CI/CD** practices, ensuring seamless deployment of software updates and minimizing downtime across services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** to develop and optimize robust **RESTful API** services for a cutting-edge e-commerce platform, ensuring high performance and seamless integration with frontend applications.\nDesigned and implemented high-quality frontend solutions using **ReactJS** (version **18**) and **NodeJS** (including **NestJS**) to provide engaging user experiences across multiple devices.\nCollaborated with cross-functional teams employing **Agile methodologies** to deliver solutions iteratively, meeting stakeholder requirements and enhancing team productivity through effective **communication skills**.\nEngineered database solutions leveraging **PostgreSQL** for structured data management, enhancing data retrieval performance by up to **30%** for high-traffic workflows.\nDeveloped and maintained data visualizations with **Apache Echarts** and **AG Grid**, improving data representation clarity and enabling data-driven decision-making within the platform.\nExecuted CI/CD pipelines using **Git** to automate deployment processes, resulting in a **50%** reduction in integration issues between development and production environments.\nImplemented cloud solutions on **AWS**, **Azure**, and **Google Cloud**, ensuring infrastructure scalability and reliability for a globally distributed user base.\nConducted thorough problem-solving sessions to tackle complex challenges in software development, leading to innovative feature enhancements and stability improvements.\nMaintained a strong focus on system security by applying best practices, including **OAuth 2.0** for user authentication and strict compliance with GDPR, contributing to user trust and data security in the e-commerce domain."
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tPython\n\t•\tJavaScript/TypeScript\n\t•\tTypeScript\n\n**Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\t•\tNodeJS\n\t•\tNestJS\n\t•\tKoa.js\n\n**Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\t•\tReactJS\n\n**API Technologies:**\n\t•\tRESTful API\n\n**Serverless and Cloud Functions:**\n\t•\tAWS: ECS, Lambda, RDS, S3\n\t•\tAzure: App Services, Blob Storage, SQL Database\n\t•\tGoogle Cloud\n\n**Databases:**\n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\t•\tRedis\n\n**DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\n**Cloud & Infrastructure:**\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\n**Other:**\n\t•\tMLflow\n\t•\tAirflow\n\t•\tKubeflow\n\t•\tAuthentication & Security (Keycloak, OAuth2, JWT)\n\t•\tNginx\n\t•\tLet’s Encrypt\n\t•\tCertbot\n\t•\tAG Grid\n\t•\tApache Echarts\n\t•\tCI/CD\n\t•\tAgile methodologies\n\t•\tProblem-solving\n\t•\tCommunication skills"
}