{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of experience in software development, specializing in **Python**, **FastAPI**, **Postgres**, **Docker**, **Kubernetes**, and **AWS**. Expertise in applying CI/CD practices, automated quality assurance, and rigorous unit and integration testing to ensure reliability and reproducibility in software solutions. Proven track record of designing and implementing complex applications with a focus on performance optimization. Additionally skilled in **Redis**, maintaining a strong foundational knowledge in frontend and backend technologies including **ReactJS**, **NextJS**, **.NET**, and **C#**. Adept at leading cross-functional teams and managing projects from conception through to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "- Developed robust backend services with **Python** and **FastAPI** for high-performance applications, improving response efficiency by **30%**.\n- Designed and maintained a **Postgres** database, optimizing schema and queries, leading to a **25%** boost in database performance.\n- Utilized **Docker** for containerization, ensuring consistent development and production environments, reducing deployment failures by **50%**.\n- Orchestrated containerized applications with **Kubernetes**, achieving automated scaling that enhanced the system's reliability and availability.\n- Implemented **Redis** as an in-memory caching solution, minimizing data retrieval times by **40%**.\n- Established CI/CD pipelines, enhancing deployment frequency and achieving a reduction in time-to-market by **35%**.\n- Conducted unit and integration testing, ensuring code quality and reliability through automated quality assurance processes.\n- Collaborated effectively with cross-functional teams to ensure reproducibility of development workflows and improved efficiency across projects.\n- Participated in code reviews and mentoring sessions, fostering a culture of continuous learning and development within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed scalable applications using **Python** and **FastAPI**, resulting in a 20% increase in response times.\nImplemented containerization strategies with **Docker** and orchestration using **Kubernetes**, ensuring seamless deployment processes across multiple environments.\nDesigned and maintained efficient database systems with **Postgres**, optimizing queries to improve data retrieval times by 30%.\nEstablished robust CI/CD pipelines to enhance deployment speed, achieving a 25% reduction in production rollout times.\nIntegrated **Redis** for caching mechanisms, which decreased API call latency by **15%**.\nEmployed automated quality assurance techniques including **unit testing** and **integration testing**, improving overall software reliability by 40%.\nUtilized **AWS** cloud services for deployment, leading to better resource management and cost efficiency.\nConducted detailed performance monitoring to ensure system reliability and reproducibility, resulting in a **35%** reduction in downtime.\nMentored junior developers in best coding practices and conducted regular code reviews to elevate team standards.\nCollaborated with cross-functional teams to gather requirements and track project progress using agile methodologies."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Leveraged **Python** and **FastAPI** to design and implement robust APIs, resulting in a **30%** reduction in response time compared to previous implementations.\nDeveloped and managed databases using **Postgres**, optimizing data retrieval processes to handle up to **1M** records efficiently.\nConfigured and deployed containerized applications using **Docker** and **Kubernetes**, improving application scalability and reliability by **25%**.\nImplemented caching strategies with **Redis** to reduce database load, leading to faster data access times during peak operations.\nUtilized **AWS** services for cloud deployment, enhancing system reliability and availability with an uptime of **99.9%**.\nEstablished CI/CD pipelines to automate the software delivery process, reducing deployment time from hours to minutes.\nConducted unit and integration testing to ensure code quality and functionality, achieving a test coverage of over **85%**.\nParticipated in automated quality assurance processes to maintain high reliability and reproducibility in the development cycle.\nCollaborated closely with cross-functional teams to align on project requirements and deliverables, fostering a culture of effective communication and teamwork.\nProvided detailed technical documentation and support for internal systems, facilitating smoother transitions during project handoffs."
    }
  ],
  "skills": "Programming Languages:\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI\n\n**Databases:**\n\tPostgres\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tCI/CD\n\n**Cloud & Infrastructure:**\n\tAWS\n\n**Other:**\n\tFrontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\tBackend Technologies: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis\n\tDatabase Systems: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\tCloud & DevOps: AWS, Azure, CI/CD pipelines\n\tTesting Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\tBlockchain: Solidity, Ether.js, Web3.js, Ethereum\n\tUX/UI Design, Git, GitHub, RESTful API, GraphQL, Redux\n\tunit testing\n\tintegration testing\n\tautomated quality assurance\n\treliability\n\treproducibility",
  "apply_company": "blackshark.ai"
}