{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Developer Advocate I",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Dynamic and resourceful Senior Developer Advocate I with over 8 years of experience in software engineering, specializing in cloud computing and developer engagement. Proficient in a diverse tech stack including **Python** (FastAPI, Django, Flask, SQLAlchemy), **JavaScript**, **TypeScript**, **PHP**, **Ruby**, **Java**, **C#**, and **AWS/Azure** cloud platforms. I bring a strong emphasis on mentoring and feedback provision, empowering developers through tailored guidance and support. Adept at creating content for AI and video formats, I excel in written content creation, enhancing knowledge-sharing practices within the developer community. My background in building high-performance applications for e-commerce, finance, and healthcare, combined with a passion for organizing events, positions me uniquely to foster collaboration and learning among developers.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Developer Advocate I",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Promoted developer engagement by mentoring junior engineers in Python, FastAPI, and JavaScript frameworks, ensuring effective learning and adoption of best practices.\n- Designed and developed developer-centric resources utilizing **Python** and **JavaScript** to enhance developer experiences and facilitate feedback provision.\n- Organized and participated in events to engage the developer community, showcasing **cloud computing** innovations and tools, benefiting an audience of 200+ attendees.\n- Created instructional content in written format to aid developers in integrating Python-based services with various technologies, achieving a 40% increase in documentation utilization.\n- Led the architectural design and development of a scalable, cloud-native Healthcare Experience Platform using **Python** (FastAPI, Django, Flask), enabling secure healthcare data exchange.\n- Integrated payment gateways (Stripe, PayPal, Adyen) into **Python** microservices to support secure, multi-currency transactions across platforms.\n- Developed real-time fraud detection services in **Python**, mitigating chargebacks and fraudulent activities by 30%.\n- Designed and implemented RESTful and gRPC APIs in **Python** with JWT-based authentication for secure workflows, supporting compliance with regulations like HIPAA and FHIR.\n- Spearheaded migrations to **Python**-based microservices on **Kubernetes** and **Docker**, enhancing scalability and availability.\n- Architected ETL pipelines with **Apache Airflow**, **Azure Event Hubs**, and **Kafka**, consolidating batch and real-time data processing capabilities.\n- Championed DevOps automation leveraging tooling like **Terraform** and **GitHub Actions**, decreasing deployment times by 50%.\n- Developed front-end integrations with **Python** backends using **React** (17–18) and **Angular**, improving user experience significantly.\n- Utilized components of a sophisticated **cloud computing** infrastructure to create hybrid solutions with **AWS** and **Azure**, optimizing costs.\n- Established CI/CD pipelines for **Python** microservices with integrated automated testing, increasing code reliability and deployment speed.\n- Mentored cross-functional teams of 10+ engineers in adopting **DevOps** practices and **cloud-native** patterns on **AWS**/**Azure**.\n- Integrated search functionality with **ElasticSearch**, reducing query times for large data sets by 20%.\n- Automated healthcare workflows with **Azure Functions**, improving operational efficiency by 25% through Python services. \n- Conducted training sessions on **JavaScript** frameworks, improving developer performance in product integrations.\n- Established test strategies using **Python** libraries (PyTest, unittest), achieving a 90% coverage on critical components."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Advocated for developer engagement by providing feedback, mentoring, and organizing events tailored for the developer community, fostering a culture of collaboration and support.\n• Leveraged **Python** and **JavaScript** technologies, including **FastAPI**, **Django**, **Flask**, **Angular**, **Vue**, **React**, and **Next.js**, to build dynamic user-centric applications promoting seamless developer experiences.\n• Designed and implemented robust integration solutions using **MuleSoft** in **Python**, ensuring secure and compliant financial data exchanges with external partners.\n• Developed and maintained microservices with a **cloud computing** focus, utilizing services such as **AWS Lambda**, **Azure Functions**, and **Azure Service Bus**, enhancing modularity and performance across systems.\n• Constructed APIs in **Python** using RESTful and gRPC principles that facilitated real-time communication and data processing between applications, achieving a response time of less than **200ms** for transaction updates.\n• Built and managed deployment pipelines incorporating **CI/CD** solutions (like **Azure DevOps**, **GitHub Actions**, and **TFS**) leading to a **30%** reduction in deployment time through automation and accuracy.\n• Implemented real-time monitoring and alerting systems with the **ELK Stack** (**Elasticsearch**, **Logstash**, **Kibana**), enhancing application performance tracking and system health visibility.\n• Developed machine learning integration services utilizing **Azure Machine Learning** to facilitate AI-driven fraud detection, successfully reducing false positives by **25%**.\n• Applied best practices for quality software development, including automated unit testing with **PyTest** and integration testing with **Selenium**, ensuring a reliability rating of over **99.9%** for backend services.\n• Managed container orchestration with **Kubernetes**, deploying microservices and ensuring high availability, resulting in minimized downtime to less than **1 hour** per month."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Leveraged **Python** to design engaging technical content and presentations, serving as a bridge between the developer community and internal teams to enhance developer engagement. \nDeveloped comprehensive written and video content using **JavaScript**, **TypeScript**, and **Python**, aimed at simplifying complex concepts and best practices for developers, while focusing on **cloud computing** and emerging technologies. \nProvided mentorship and feedback to junior developers, fostering a culture of growth and continuous improvement within the team. \nOrganized and led developer-focused events and workshops, showcasing industry trends and best practices, aimed at enhancing community participation and knowledge sharing.\nActed as a self-starter, consistently identifying and pursuing opportunities to serve developers and improve their experience with company products.\nUtilized **AI** tools to analyze developer needs and preferences, tailoring content and resources for maximum impact.\nEngaged actively with the developer community through forums, webinars, and social media, ensuring a strong presence and understanding of developer sentiments and requirements.\nCollaborated with cross-functional teams to ensure that developer feedback is effectively integrated into product roadmaps, resulting in improved product offerings.\nMeasured engagement metrics and user feedback to adapt strategies and enhance developer interactions, contributing to a **30%** increase in developer satisfaction over **6** months.\nFacilitated discussions and provided empathetic insights related to developer challenges, establishing trust and rapport with the community."
    }
  ],
  "skills": " **Programming Languages:**\n  Python, JavaScript, TypeScript, PHP, Ruby, Java, C#\n\n **Backend Frameworks:**\n  FastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n  Angular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n  REST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n  AWS (Lambda), Azure (App Services)\n\n **Databases:**\n  SQLAlchemy, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n  Docker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n  AWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n **Other:**\n  Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, cloud computing, AI, video content creation, written content creation, developer engagement, feedback provision, mentoring, event organization, self-starter, empathy, motivated to serve developers"
}