{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Principal-level Individual Contributor (IC)",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Principal-level Individual Contributor (IC) with 8 years of experience, I excel in full-stack development and cloud services, specializing in **PHP**, **Java**, **C#**, and **.NET** technologies. My expertise includes building high-performance applications using **ReactJS**, **AngularJS**, **NodeJS**, and **TypeScript**, along with extensive experience deploying solutions in **AWS**, **Azure**, and **GCP** environments, including services like **EC2**, **ECS**, **S3**, **SQS**, and **IAM**. I have a proven track record of enhancing application observability and automation with tools like **Grafana**, **Datadog**, **New Relic**, and **Terraform**. \n\nAdditionally, my background includes developing enterprise-grade platforms that leverage AI for automation and predictive analytics, supported by sound knowledge of compliance standards such as HIPAA and PCI DSS. I am skilled in architecting microservices and event-driven systems with a strong focus on CI/CD automation, ensuring robust and secure delivery of software solutions aligned with industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Principal-level Individual Contributor (IC)",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged **TypeScript**, **Node.js**, and **ReactJS** to architect and develop robust, full-stack healthcare and financial platforms while ensuring regulatory compliance with standards such as HIPAA and PCI DSS.\n- Designed and implemented automation strategies to enhance application delivery through CI/CD pipelines using **GitHub Actions**, ensuring observability with tools like **Grafana** and **Datadog**.\n- Developed and maintained cloud infrastructure on **AWS**, **Azure**, and **GCP**, utilizing services like **EC2**, **S3**, and **IAM** to optimize cost and performance for applications serving over **10,000** users daily.\n- Collaborated with cross-functional teams to deliver advanced AI-powered features, integrating automated machine learning pipelines and monitoring solutions, enhancing user engagement metrics by **30%**.\n- Built and deployed microservices using **Docker** and **Kubernetes**, improving application scalability and reducing downtime by **40%** through serverless architecture configurations with **AWS Lambda**.\n- Designed and developed data structures in **PostgreSQL** and **MongoDB**, ensuring efficient data retrieval across applications handling millions of transactions per month.\n- Integrated advanced search functionalities into applications using **Elasticsearch**, allowing for real-time data processing and search capabilities for millions of records across **300+** financial and healthcare documents.\n- Established continuous monitoring and observability strategies with **New Relic** to track application performance, error rates, and user behavior, refining development cycles.\n- Employed **PHP** and **C#** in the development of backend services, aligning with existing architecture and maximizing system performance.\n- Implemented enterprise-level testing strategies with **Jest**, **Cypress**, and **Postman** to ensure code quality and reliability across both front-end and back-end components.\n- Drove system-wide enhancements by adopting infrastructure as code principles with **Terraform** and **Ansible**, streamlining deployment processes across multi-cloud environments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Demonstrated expertise in **AI** and automation by implementing AI/ML-powered fraud detection systems using scikit-learn, XGBoost, and **Azure Machine Learning**, analyzing transaction patterns and user behavior to proactively flag suspicious activities in banking systems.\nUtilized **AWS**, **Azure**, and **GCP** technologies to build and orchestrate ETL pipelines using Python, **Apache Airflow**, and **Azure Data Factory**, enabling batch and real-time ingestion of financial data from internal and third-party sources.\nLed the development and modernization of financial platforms by adopting a microservices-based architecture using **Node.js** (NestJS/Express) and Python (FastAPI, Django), boosting scalability, maintainability, and throughput for **high-volume transaction systems** handling over **10,000 transactions per minute**.\nIntegrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to establish a robust event-driven architecture, supporting asynchronous communication and real-time event processing for transactions, alerts, and compliance workflows, achieving a **30% increase** in processing efficiency.\nDeveloped real-time transaction monitoring and analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, enabling operations teams to track financial activity, detect anomalies, and generate actionable insights, which improved operational decision-making speed by **25%**.\nCreated dynamic, user-focused front-end applications using **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, applying **Redux Toolkit** and **Tailwind CSS** to create responsive and performant user interfaces for financial dashboards and admin portals, resulting in enhanced user satisfaction ratings by **15%**.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Engineered and optimized robust backend services for high-traffic e-commerce applications using **PHP**, **Java**, and **C#** to ensure *high availability*, *low latency*, and *scalability*.\n• Designed automated observability solutions utilizing **Grafana**, **Datadog**, and **New Relic** to monitor application performance and enhance incident response times by up to **50%**.\n• Developed dynamic and responsive frontend applications leveraging **AngularJS** and **ReactJS** with **TypeScript**, focusing on creating seamless user experiences across web platforms.\n• Employed **AWS** services including **EC2** and **S3** for scalable cloud infrastructure, improving deployment efficiency by **30%** compared to previous environments.\n• Integrated intelligence features using **AI** technologies and automated workflows, significantly enhancing user engagement metrics by upwards of **40%**.\n• Implemented infrastructure as code with **Terraform** to ensure consistent and repeatable deployments across multiple environments.\n• Utilized **NodeJS** for microservices development, driving down latency in service communication to less than **100 milliseconds** on critical workflows.\n• Collaborated with teams on deployment improvements using **Automation** tools and techniques, enhancing overall team productivity by **25%**.\n• Leveraged **.NET** frameworks for backend solutions while ensuring secure access and compliance through advanced RBAC and OAuth 2.0 implementations.\n• Conducted thorough architecture reviews, enabling successful migration strategies to **AWS**, **Azure**, and **GCP** platforms, leading to increased operational flexibility."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, JavaScript, TypeScript, PHP, C#, .NET\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Symfony, NodeJS\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, AngularJS\n\n **API Technologies:**\n\tREST\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, S3, SQS, IAM), Azure (App Services, Blob, SQL), GCP, EC2\n\n **Other:**\n\tAI, Automation, MLflow, Airflow, Kubeflow, Observability, Grafana, Datadog, New Relic, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)"
}