{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As a dedicated Senior Frontend Developer with 8 years of experience, I specialize in leveraging **TypeScript**, **React**, and **Next.js** to deliver high-quality, high-performance web applications. My expertise encompasses a comprehensive understanding of **CSS**, **HTML**, and modern frontend practices including **micro frontends** and **web components**. I excel in implementing **NPM** for package management and utilize **unit testing frameworks** to ensure code quality and reliability.\n\nIn addition to my frontend skills, I possess hands-on experience with cloud technologies including **Azure Portal** and **infrastructure-as-code** solutions like **Pulumi** and **Terraform**. I am proficient in creating **CI/CD pipelines** within **Azure DevOps** to streamline deployments and enhance delivery processes.\n\nMy background includes building integrated platforms in various domains such as healthcare and finance, ensuring compliance with critical standards like HIPAA and PCI DSS. I am adept at problem-solving, effective communication, and fostering collaboration within cross-functional teams, enabling the delivery of robust digital experiences.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained modern web applications using **TypeScript**, **React** (17-18), **Next.js**, **Node.js**, **CSS**, **HTML**, and **web components**, ensuring optimal user experience and functionality.\n- Implemented CI/CD pipelines leveraging **Azure DevOps** to automate deployment processes, incorporating security measures and infrastructure-as-code using **Pulumi** and **Terraform**.\n- Conducted unit testing utilizing various unit testing frameworks to ensure code quality and reliability across both front-end and backend services.\n- Collaborated with cross-functional teams to enhance communication and problem-solving capabilities, addressing technical challenges efficiently.\n- Integrated accessibility features and best practices in web page security, optimizing applications for all users and safeguarding sensitive information.\n- Built and integrated micro frontends that improved application modularity and enhance performance, leveraging the latest web component technologies.\n- Engaged in regular code reviews to promote best practices and maintain high standards of quality and security in web applications.\n- Championed the adoption of agile methodologies and continuous improvement practices in team workflows, resulting in a **30%** increase in delivery speed.\n- Mentored Junior Developers, fostering skill development in **React**, **Next.js**, and secure coding practices for **Azure Portal**.\n- Contributed to achieving a **99.9%** uptime for web applications through proactive monitoring and performance optimization."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and implemented dynamic user-focused applications using **React (18)** and **Next.js**, leveraging **TypeScript** to enhance performance and maintainability of front-end systems.\n• Spearheaded the transition to a microservices-based architecture utilizing **Node.js** (NestJS/Express), resulting in a **30%** improvement in system scalability and throughput for high-volume transaction processes.\n• Designed and executed responsive UI components with **Tailwind CSS** and **CSS**, enhancing user experience across financial dashboards.\n• Collaborated on building and integrating micro frontends and web components to modularize application capabilities, improving code reuse by **25%**.\n• Conducted rigorous unit testing using popular frameworks, ensuring high-quality deliverables that reduced post-deployment defects by **40%**.\n• Implemented CI/CD pipelines with **Azure DevOps** and **Terraform**, automating deployments and enhancing infrastructure management efficiency, reducing deployment times by **50%**.\n• Effectively communicated solutions and leveraged problem-solving skills to address design challenges in fast-paced project environments, fostering teamwork and collaboration.\n• Maintained a strong focus on web page security and **Azure Portal security**, ensuring applications safeguarded sensitive user data against potential threats."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed high-quality web applications using **TypeScript**, **React**, **Next.js**, and **CSS**, ensuring responsive design and seamless user experiences across devices.\n- Engineered frontend solutions utilizing **micro frontends** and **web components** to enhance modularity and code maintainability.\n- Collaborated with backend teams to integrate **Node.js** services through well-defined APIs, ensuring efficient data exchange and application performance.\n- Implemented **unit testing frameworks** to enhance code quality, achieving over **90% code coverage** and minimizing regression issues during development.\n- Streamlined development processes by setting up **CI/CD pipelines** using **Azure DevOps**, ensuring rapid deployment cycles and effective version control.\n- Developed infrastructure-as-code solutions using **Pulumi** and **Terraform**, establishing a robust deployment pipeline and ensuring consistent environments.\n- Worked on web security best practices, implementing **Azure Portal security** measures to safeguard applications and comply with industry standards.\n- Utilized problem-solving skills to address and resolve complex frontend issues, enhancing application performance and user satisfaction.\n- Actively communicated with cross-functional teams to gather requirements and deliver innovative solutions aligned with product goals."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure Blob, Azure portal security, infrastructure-as-code, Terraform, Pulumi, Ansible, Helm, GitHub Actions, GitLab CI/CD\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, CI/CD pipelines, Azure DevOps, Docker Compose\n\n**Other:**\n\tCSS, HTML, NPM, micro frontends, web components, unit testing frameworks, problem-solving, communication, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow"
}