{
  "name": "Andrzej Ito",
  "role_name": "Staff ML Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Staff ML Engineer with over 9 years of experience, I specialize in leveraging **Machine Learning** techniques and frameworks like **TensorFlow** and **PyTorch** to design and build scalable software solutions. Proficient in **Python**, I utilize **AWS** for cloud services, **Docker** and **Kubernetes** for containerization and orchestration to manage and deploy applications effectively. My strong abilities in **Data Analysis** and **SQL** ensure that I can derive actionable insights from data. I excel in leading cross-functional teams, mentoring junior engineers, and fostering collaboration and communication within teams, driving impactful projects that prioritize user experience, performance, and innovation while maintaining a focus on accessibility and technical excellence.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Staff ML Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Lead the integration of **AWS** cloud services in machine learning applications, ensuring efficient workflows and scalability.\n• Developed and implemented machine learning algorithms using **Python**, **TensorFlow** and **PyTorch** for data analysis, achieving an accuracy improvement of **15%** on predictive models.\n• Collaborated on software development projects, utilizing **Docker** for containerization and **Kubernetes** for orchestration, reducing deployment time by **30%**.\n• Conducted data analysis using **SQL**, enhancing data-driven decision-making processes.\n• Designed and implemented scalable ML models with a focus on best practices in collaboration and communication within the team.\n• Utilized advanced statistical techniques to analyze datasets, delivering insights that improved project outcomes by **20%**.\n• Led knowledge-sharing sessions on algorithms and statistical methods, fostering a culture of continuous learning and development."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed and deployed Machine Learning models using **TensorFlow** and **PyTorch** to drive data analysis and insight generation for applications.\n• Utilized **Python** programming for implementing algorithms and statistical analysis, enhancing model performance by **20%** through iterative testing.\n• Collaborated with cross-functional teams, ensuring effective communication and collaboration on project requirements and deliverables.\n• Implemented Cloud Services, leveraging **AWS** for scalable model deployment, reducing operational costs by **15%**.\n• Containerized applications using **Docker** and orchestrated them with **Kubernetes**, leading to improved deployment efficiency with up to **80%** faster time to market.\n• Conducted thorough data analysis, employing **SQL** for efficient querying and dataset processing, which improved data retrieval times by **30%**.\n• Demonstrated strong software development practices in designing and building software solutions, focusing on performance optimization and maintainability.\n• Developed and maintained comprehensive documentation to support tools and processes, ensuring clarity and knowledge transfer within the team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed machine learning models using **Python**, **TensorFlow**, and **PyTorch** to enhance data analysis and prediction accuracy.\n• Conducted data analysis and implemented algorithms to identify trends and insights, improving decision-making processes by **30%**.\n• Collaborated with cross-functional teams to design and deliver scalable ML solutions, utilizing **Docker** and **Kubernetes** for container orchestration, achieving deployment time reduction by **50%**.\n• Leveraged cloud services including **AWS**, **Azure**, and **GCP** to deploy ML models into production, ensuring high availability and robustness of applications.\n• Utilized SQL to manage and query datasets, enhancing data retrieval efficiency by **25%**.\n• Demonstrated excellent collaboration and communication skills while working with diverse teams to drive project success and meet deadlines."
    }
  ],
  "skills": " **Programming Languages** \n\tJava, C++, C#, Python, Kotlin, SQL, PLSQL \n\n **Backend Frameworks** \n\tSpring, Spring Boot, Hibernate, Struts, JPA \n\n **Frontend Frameworks** \n\tReact, Vue, Angular \n\n **API Technologies** \n\tSOAP, REST APIs, Microservices \n\n **Serverless and Cloud Functions** \n\tCloud Services, AWS \n\n **Databases** \n\tMS SQL Server, Oracle, MongoDB, PostgreSQL, Redis \n\n **DevOps** \n\tDocker, Kubernetes \n\n **Cloud & Infrastructure** \n\tMachine Learning, TensorFlow, PyTorch, Data Analysis, Software Development, Algorithms, Statistics \n\n **Other** \n\tSOLID, DRY, LINQ, Collaboration, Communication"
}