{
  "name": "Tomasz Lee",
  "role_name": "Lead Website Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Lead Website Engineer with 9+ years of experience in front-end development and martech stack integration. Proficient in utilizing **JavaScript** and various **CMS** platforms to create dynamic and responsive web applications. Skilled in leveraging **AI tools** for enhanced user experience, SEO strategies for increased visibility, and tools like **Marketo**, **Wistia**, and **Chili Piper** to optimize marketing efforts. Demonstrated expertise in overseeing architectural decisions and implementing algorithms to improve website performance. Proven ability to coach and lead teams, fostering collaboration and effective communication to drive projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Lead Website Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Led a cross-functional team to successfully integrate a **martech stack** that includes tools such as **Marketo**, **Wistia**, and **Chili Piper** to enhance the website's performance.\n• Directed front-end development efforts utilizing **JavaScript** frameworks including **ReactJS** to boost customer interactions by **25%**.\n• Championed architectural decisions to implement a modular design in web applications, ensuring scalability and maintainability across platforms.\n• Developed an experiment framework, supporting data-driven decisions that improved user engagement metrics significantly.\n• Mentored team members, fostering leadership capabilities and enhancing overall team performance through effective coaching and collaboration.\n• Collaborated effectively with UX/UI designers to ensure seamless integration of design aspects, which improved user satisfaction rates by **25%**.\n• Communicated technical vision and objectives clearly to stakeholders, ensuring alignment on project goals throughout development.\n• Designed effective algorithms for improving SEO strategies, resulting in a measurable increase in organic traffic to the website.\n• Engaged with AI tools to implement innovative features, enhancing user experience and engagement through personalized content delivery.\n• Executed strategies to optimize content management systems (CMS) fueling improved operational efficiency and speed across the website."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Spearheaded front-end development projects utilizing **JavaScript** frameworks, contributing to improved website functionalities and user experience.\n• Implemented martech stack integration with tools such as **Marketo** and **Wistia**, optimizing marketing strategies and enhancing lead generation by **20%**.\n• Leveraged AI tools for analytics and reporting, fostering data-driven decision-making that improved engagement metrics over **15%**.\n• Oversaw algorithm implementation while making architectural decisions, resulting in a more efficient and scalable website infrastructure.\n• Championed leadership and coaching initiatives within the engineering team to develop skills in technical vision and architectural best practices.\n• Drove effective communication and collaboration across departments to ensure alignment on project goals and timelines, facilitating smoother workflows.\n• Utilized **D3.js** for creating custom interactive charts that improved project status tracking, enhancing visibility for stakeholders.\n• Conducted regular code reviews, promoting best practices that improved code quality and reduced technical debt by **30%**.\n• Managed content management systems (CMS) to enhance user experience, leading to a **25%** increase in content engagement.\n• Established and maintained a framework for experimental features, allowing for the successful testing of new ideas and innovations.\n• Built relationships with other departments to promote collaborative solutions that drive project success."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Led front-end development using **JavaScript** and **Vue.js**, enhancing user experience on the client dashboard by 30%.\n• Advanced martech stack integration through collaboration with teams on platforms such as **Marketo** and **Wistia**, optimizing marketing workflows and improving campaign performance by 25%.\n• Designed and implemented algorithms to enhance site performance, leading to a **40%** reduction in load time.\n• Directed technical vision and architectural decisions for the website, driving improvements in scalability and maintainability.\n• Provided coaching and leadership to junior developers, fostering a collaborative environment that increased team productivity by 15%.\n• Spearheaded the integration of AI tools and CMS strategies that aligned with SEO best practices, improving search rankings by **20%**.\n• Facilitated effective communication among cross-functional teams to ensure project goals were met on time and within budget.\n• Documented all processes in technical documentation and user guides, strengthening knowledge transfer and onboarding by **50%**.\n• Contributed to experiment framework setups, encouraging data-driven decisions in feature rollout strategies.\n• Participated in regular standups and code reviews, ensuring adherence to coding standards and improving code quality."
    }
  ],
  "skills": "**Programming Languages**\n\tJavaScript, Python\n\n**Frontend Frameworks**\n\tHTML, CSS, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, front-end development\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, CMS, AI tools, SEO, Marketo, Wistia, Chili Piper, martech stack integration, algorithms, technical vision, architectural decisions, experiment framework, coaching, leadership, communication, collaboration, English proficiency"
}