{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior CVML Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior CVML Engineer with extensive experience in utilizing **Python**, **C++**, and machine learning frameworks such as **TensorFlow**, **PyTorch**, and **Keras**, I excel in developing advanced computer vision and deep learning solutions. My skill set encompasses cutting-edge technologies for **Object Detection**, **Segmentation**, **Tracking**, and **Scene Understanding**, making me adept at solving complex challenges in computer vision. Over my 8 years as a Full Stack Developer, I have successfully implemented high-performance solutions in sectors like healthcare and finance, emphasizing **algorithm optimization** and leveraging **MLLM** and **GenAI** capabilities. My projects include integrating AI-driven algorithms for predictive analytics and real-time data processing. \n\nI also bring a profound understanding of designing and deploying robust systems in compliance with standards including HIPAA, FHIR, and PCI DSS. My background in microservices architecture and CI/CD automation has enabled me to lead the development of secure applications, while my strong analytical thinking and problem-solving abilities facilitate successful project outcomes and enriched team communication.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior CVML Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized expertise in **Python**, **TensorFlow**, and **PyTorch** to develop and implement advanced **MLLM**, **GenAI**, and **Deep Learning** models for computer vision applications, enhancing object detection, recognition, and tracking capabilities in healthcare and financial platforms.\nConducted thorough research and development to optimize algorithms for **Object Detection**, **Segmentation**, and **Scene Understanding**, ensuring high precision and accuracy in real-world applications, with improvements demonstrated in performance metrics by **30%**.\nDesigned and deployed machine learning models for critical use cases, including patient risk prediction and financial fraud detection, integrating these models into backend services for real-time inference, leveraging technical skills in **FastAPI** and **RESTful APIs**.\nCollaborated with cross-functional teams to articulate needs and present findings, driving clarity in communication and problem-solving through analytical discussions, resulting in a **15%** reduction in project turnaround times.\nLed the integration of advanced computer vision and deep learning technologies into existing systems, achieving enhanced capabilities in data parsing and anomaly detection, showcasing robust development practices using **C++** and **Keras**.\nImplemented CI/CD pipelines focused on computer vision model training and deployment, employing modern tools such as **MLflow** and **Apache Airflow** to maintain version control, with training models delivered across **3** different platforms.\nDelivered comprehensive reporting tools that visualize data insights utilizing **D3.js** and **Power BI**, facilitating operational KPIs tracking and improving decision-making accuracy by **25%**.\nEstablished and conducted rigorous testing strategies, including unit and E2E tests using **PyTest** and **Cypress**, bolstering the reliability and performance of computer vision models in production environments.\nIntegrated AI-based features to enhance client applications, providing personalized recommendations and predictive alerts, improving user engagement metrics by **20%** and facilitating stronger client trust.\nEmployed analytical thinking and problem-solving skills to address computing challenges, continually refining processes and methodologies to align with evolving technological standards."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Designed and implemented advanced **computer vision** algorithms leveraging **Python** and **C++** for applications in object detection, recognition, and tracking, improving processing speed by **30%**.\n• Utilized **TensorFlow**, **PyTorch**, and **Keras** to create deep learning models for segmentation and scene understanding, achieving a model accuracy of **95%** on benchmark datasets.\n• Developed and optimized ML pipelines for various use cases including fraud detection, utilizing **MLLM** techniques to enhance model performance and ensure real-time analysis of transaction data.\n• Collaborated with cross-functional teams to integrate **GenAI** solutions into financial platforms, solving complex problems through innovative approaches in deep learning and computer vision.\n• Engaged in research excellence and algorithm optimization, resulting in a **40%** improvement in processing efficiency for real-time applications.\n• Effectively communicated technical concepts and project progress to stakeholders, demonstrating strong analytical thinking and problem-solving capabilities in high-stakes environments.\n• Conducted state-of-the-art research to stay ahead in the field of **computer vision** and **machine learning**, identifying opportunities for incorporating new technologies into existing workflows."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python**, **TensorFlow**, **PyTorch**, and **Keras** for developing and optimizing algorithms for Computer Vision and Deep Learning, focusing on accurate **Object Detection**, **Recognition**, **Tracking**, and **Segmentation** tasks across multiple projects.\nEngineered algorithms for **MLLM** and **GenAI** applications, integrating innovative approaches that enhanced scene understanding and improved data processing efficiency by over **30%**.\nCollaborated with cross-functional teams, applying exceptional **analytical thinking** and **problem-solving** skills to launch cutting-edge solutions in computer vision that led to a **25%** increase in project success rates.\nContributed to research initiatives that drove advancements in algorithm optimization, resulting in improved performance metrics and a **15%** reduction in processing time.\nImplemented **ROS** for robotic process automation, ensuring seamless integration of computer vision systems with existing operational workflows, yielding a **20%** increase in productivity.\nEngaged in proactive **communication** with stakeholders to present findings, explain complex technical concepts, and foster collaborative discussions focused on research excellence and project viability.\nMonitored and refined existing algorithms to enhance precision and efficiency, achieving benchmark results within **3%** of industry standards, and maintained documentation for ease of reference and future development benefits."
    }
  ],
  "skills": "Programming Languages:\n\tPython, C++\n\nBackend Frameworks:\n\tFastAPI, Flask, Django\n\nFrontend Frameworks:\n\tJavaScript/TypeScript (React, Vue, Angular)\n\nAPI Technologies:\n\tJWT, OAuth2\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\tNginx, Certbot\n\nOther:\n\tMLflow, Airflow, Kubeflow, MLLM, GenAI, Computer Vision, Deep Learning, TensorFlow, PyTorch, Keras, ROS, Object Detection, Recognition, Tracking, Segmentation, Scene Understanding, Algorithm Optimization, Research Excellence, Problem-Solving, Analytical Thinking, Communication",
  "apply_company": "Axon"
}