{
  "name": "Tomasz Lee",
  "role_name": "Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Software Engineer with 9+ years of experience in developing and implementing complex applications. Proficient in **React**, **JavaScript**, **HTML**, and **CSS**, with a strong focus on frontend application performance profiling and UI/UX design. Specialized in backend development utilizing **.NET**, **C#**, and experience with modern frameworks. Demonstrated ability in cross-team collaboration and mentoring junior developers, enhancing overall team productivity. Committed to quality with expertise in testing libraries and a solid understanding of application architecture. Adept at delivering robust solutions and optimizing development processes for high-impact results.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed responsive web applications using **React**, **JavaScript**, **HTML**, and **CSS**, enhancing frontend performance and user engagement by 25%.\n• Implemented backend development using **.NET 7** and **.NET Core**, ensuring robust server-side architecture and improved maintainability.\n• Spearheaded cross-team collaboration to align UX/UI designs with functionality, leading to a superior user experience.\n• Optimized frontend application performance through profiling and debugging, achieving a 20% reduction in load times.\n• Mentored junior developers in best coding practices and testing libraries, enhancing team skill sets and productivity.\n• Participated in public speaking events to share knowledge on software engineering best practices and emerging technologies.\n• Conducted thorough testing and quality assurance using modern testing libraries to ensure application reliability.\n• Employed effective writing skills to document processes and technical designs, fostering clear communication across teams.\n• Contributed to the design of architecture for large-scale applications, ensuring scalable and maintainable systems."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed responsive frontend applications using **React**, **JavaScript**, **HTML**, and **CSS**, enhancing user interactions and UI/UX design.\n• Conducted frontend application performance profiling to boost performance metrics by over **25%**.\n• Collaborated cross-functionally to gather system requirements, facilitating development timelines and project delivery, ensuring a **30%** reduction in production deployment errors through effective CI/CD implementation.\n• Participated in backend development using **.NET Core** and integrated with a **PostgreSQL** database for optimized real-time data access.\n• Implemented mentoring sessions for junior developers, fostering a collaborative team environment and improving productivity metrics.\n• Utilized testing libraries to enhance code quality and stability across various projects, contributing to overall project success.\n• Engaged in public speaking and writing to effectively communicate technical concepts and coordinate with stakeholders.\n• Leveraged **RabbitMQ** and **Apache Kafka** for creating a microservices architecture that supports scalable application development.\n• Integrated **Redis** to optimize API response times, achieving a **25%** improvement in system performance.\n• Built and maintained scalable applications with an emphasis on robust performance and user engagement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **React** and **JavaScript** to develop interactive user interfaces, enhancing user engagement and satisfaction by **25%**.\nDesigned and implemented responsive layouts with **HTML** and **CSS**, ensuring a consistent and aesthetically pleasing UI across devices.\nConducted rigorous testing using modern **testing libraries**, achieving a bug reduction rate of **30%**.\nEngaged in cross-team collaboration to gather requirements and execute solutions, improving project delivery timelines by **15%**.\nMentored junior developers, enhancing their skills and contributing to their professional growth within the team.\nOptimized frontend application performance profiling, reducing load times by **40%**.\nDeveloped backend features using **Ruby** and **Go**, maintaining high code quality and adherence to best practices.\nParticipated in public speaking engagements to share insights on software development trends and practices, fostering a culture of learning.\nAuthored technical documentation and writing user guides to ensure clarity and maintainability of systems.\nRegularly conducted code reviews to promote quality standards and knowledge sharing among team members."
    }
  ],
  "skills": "  **Programming Languages**\n\tJavaScript, TypeScript, Python, Ruby, Go\n\n  **Frontend Frameworks**\n\tHTML, CSS, React, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices, backend development\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tCloud & DevOps\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, messaging & caching: Apache Kafka, RabbitMQ, Redis, testing libraries, cross-team collaboration, mentoring, frontend application performance profiling, public speaking, writing"
}