{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Android Security Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Dedicated Android Security Engineer with extensive experience in security analysis and troubleshooting, leveraging skills in mobile security, reverse engineering, and vulnerabilities assessment. Proficient in **C**, **C++**, **Java**, and **assembly**; with hands-on expertise in using tools such as **Frida**, **Ida**, and **Ghindra** for in-depth security evaluations. Proven ability to identify exploits, assess firmware, and manage permissions across various mobile platforms. Combines strong technical foundation with a solid understanding of arm64 architecture and its security implications, ensuring robust protection against potential exploits. Demonstrated success in delivering high-performance applications in compliance-driven environments, including healthcare and finance, with a background in developing applications powered by AI/ML technologies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Android Security Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted thorough **security analysis** on mobile applications built for Android, identifying **vulnerabilities** and applying **troubleshooting** methodologies to mitigate risks.\n- Utilized **reverse engineering** tools like **Frida**, **Ida**, and **Ghindra** to analyze app behavior and uncover security loopholes in **C**, **C++**, and **Java** applications running on Android platforms.\n- Developed exploits for **arm64** architecture to demonstrate weaknesses, enhancing the team's understanding of **firmware** and **permissions** management in mobile security.\n- Designed and implemented security protocols for mobile applications, focusing on **mobile security** best practices, to ensure a robust defense against unauthorized access and exploitation.\n- Collaborated with cross-functional teams to integrate security measures during the **development** phases, ensuring compliance with industry standards and regulations governing application deployment.\n- Conducted penetration testing and vulnerability assessments, leveraging tools to provide comprehensive reports and actionable insights on potential security threats in Android applications.\n- Provided expert guidance in **mobile security** as well as **troubleshooting** issues related to reverse engineering techniques, enhancing team capabilities and knowledge.\n- Led workshops and training sessions on secure coding practices in Android development using **assembly** language techniques to elevate the team's skillset.\n- Strategized solutions for enhanced mobile application security postures in compliance with best practices while optimizing for user experience.\n- Kept abreast of the latest security trends, tools, and methodologies to proactively handle emerging **exploits** and threats in the Android landscape."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted security analyses to identify and remediate vulnerabilities in Android applications, enhancing overall mobile security posture and user trust.\nUtilized **Frida**, **IDA**, and **Ghidra** for reverse engineering tasks to analyze binary exploits and vulnerabilities within Android firmware, improving security protocols for **arm64** architecture.\nDeveloped and executed troubleshooting procedures to assess application permissions and root access, ensuring compliance with security best practices and preventing unauthorized exploits.\nCollaborated with cross-functional teams to implement robust security measures, integrating security protocols seamlessly into the development lifecycle, reducing vulnerabilities by **30%**.\nPerformed in-depth assessments of application source code in **Java**, **C**, and **C++**, identifying potential exploits, and provided remediation strategies to developers.\nEducated teams on mobile security best practices, delivering training sessions that increased awareness and understanding of security vulnerabilities by **50%**.\nExecuted firmware security assessments, leading to the identification of critical vulnerabilities and the enhancement of security measures implemented in applications.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted **security analysis** and performed **reverse engineering** on Android applications to identify and remediate **vulnerabilities** in the code, ensuring robust mobile security practices.\nUtilized **Frida** and **IDA Pro** for dynamic analysis and instrumentation of mobile applications, effectively detecting **exploits** related to **permissions** and **root** access on devices.\nDeveloped and executed troubleshooting procedures to mitigate security weaknesses within firmware and mobile application settings, achieving a reduction of potential exposure by **75%**.\nImplemented **C** and **C++** programming techniques to enhance security protocols in Android applications, resulting in improved application integrity and resistance to tampering.\nAnalyzed and documented security features across various Android versions, focusing on best practices for **arm64** architecture optimization, improving software resilience against malicious attacks.\nUtilized the **Java** programming environment to integrate security mechanisms that protected sensitive user data during application interactions, achieving a user compliance rate of **99%** with security policies.\nCollaborated with cross-functional teams to educate on current **mobile security** trends and insights, which contributed to a **50%** improvement in response times to emerging security threats.\nConducted penetration tests to evaluate the effectiveness of existing security measures, leading to critical updates in application security protocols and minimizing the risk of unauthorized access."
    }
  ],
  "skills": "**Programming Languages:**\n\tC, C++, Java, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, Android, Frida, Ida, Ghindra, arm64, assembly, mobile security, reverse engineering, exploits, vulnerabilities, firmware, permissions, root, security analysis, troubleshooting"
}