{
  "name": "Tomasz Lee",
  "role_name": "Senior React Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior React Engineer with 9+ years of experience in developing high-performance web applications, leveraging expertise in **React.js**, **TypeScript**, **JavaScript**, **Redux**, **Zustand**, and **Context API**. Proven skill in optimizing web performance, implementing Server-Side Rendering (SSR) and Static Site Generation (SSG), and employing CI/CD practices along with automated testing to enhance project efficiency. Strong background in designing REST APIs and integrating **GraphQL** for seamless data management. Experienced in Agile methodologies, with a track record of delivering robust solutions and leading projects to successful completion while effectively collaborating across teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior React Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed highly optimized front-end applications using **React.js**, **TypeScript**, and **Redux** to enhance user interactions and performance.\nLed the implementation of **Server-Side Rendering (SSR)** and **Static Site Generation (SSG)** for improved page load times and SEO, leading to a 30% increase in traffic.\nExecuted **automated testing** strategies to ensure code quality, achieving a **90% test coverage** across key modules.\nArchitected RESTful APIs to facilitate seamless data exchange, improving service integration efficiency by *25%*.\nUtilized **JavaScript** and **Zustand** for state management, resulting in a more streamlined data flow and a significant reduction in bugs.\nCollaborated within an **Agile** framework to drive project completion, enhancing team productivity by *20%*.\nImplemented **CI/CD** pipelines that cut down deployment times by *40%*, ensuring rapid feature releases and updates.\nConducted web performance optimization initiatives that reduced load times across the platform by *35%*, significantly enhancing user experience.\nMonitored and documented application performance metrics, utilizing analysis tools to continuously refine system responsiveness."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **React.js** with **TypeScript** and **JavaScript** to develop interactive user interfaces, enhancing overall user experience and engagement metrics by **25%**.\nImplemented **Redux** and **Zustand** for application state management, ensuring optimal performance and scalability across components.\nConducted **Web Performance Optimization** leading to a **30%** reduction in load times, significantly improving user satisfaction.\nDeveloped and maintained **SSR (Server-Side Rendering)** and **SSG (Static Site Generation)** features to enhance SEO and performance metrics.\nDesigned and implemented **REST APIs** and **GraphQL** endpoints to streamline data interactions between front-end and back-end systems, resulting in a **20%** increase in data retrieval efficiency.\nLed the implementation of **CI/CD** processes that included automated testing, achieving a **30%** decrease in production deployment errors through the use of **GitHub Actions**.\nCollaborated in an **Agile** environment to iteratively define project requirements, ensuring timely delivery of high-quality software products.\nCreated and integrated dynamic visualizations using libraries like **D3.js** for better project status tracking and reporting.\nConducted thorough code reviews and provided mentorship to junior developers, driving an overall increase in team productivity and skill development."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **React.js** and **TypeScript** to develop dynamic, high-performance user interfaces, enhancing user experience by **30%**.\nEmployed **Redux** and **Context API** for state management, improving data flow and consistency across components.\nImplemented web performance optimization strategies, resulting in a **50%** reduction in page load times.\nLed the transition to server-side rendering (SSR) and static site generation (SSG) techniques, increasing SEO performance significantly.\nManaged continuous integration and continuous deployment (CI/CD) pipelines to streamline automated build and release processes.\nConducted automated testing using industry-standard frameworks, ensuring code quality and reliability with a **90%** test coverage.\nDeveloped and integrated REST APIs and **GraphQL** endpoints to facilitate efficient data retrieval and manipulation across services.\nParticipated in Agile development ceremonies, including daily standups and sprint retrospectives, to promote team collaboration and productivity.\nCollaborated closely with cross-functional teams to deliver insightful technical documentation and user guides, enhancing knowledge-sharing processes."
    }
  ],
  "skills": "Front-end Technologies: React.js, TypeScript, JavaScript, Redux, Zustand, Context API, Web Performance Optimization, SSR, SSG, HTML, CSS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks:** Node.js, Express.js, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies:** REST APIs, GraphQL\n\n**Serverless and Cloud Functions:** AWS, Azure\n\n**Databases:** MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:** CI/CD, automated testing\n\n**Cloud & Infrastructure:** CI/CD pipelines\n\n**Other:** Agile, UX/UI Design, Git, GitHub, Python, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis",
  "apply_company": "INNOCV Solutions"
}