{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Frontend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Results-driven Frontend Engineer with over 10 years of experience specializing in **React.js**, **TypeScript**, and **MobX**, delivering high-performance software solutions tailored for healthcare and finance. Proven ability in frontend architecture and state management, optimizing performance to enhance user experience. Demonstrates exceptional collaboration and communication skills, thriving in autonomous environments while maintaining a pragmatic approach to problem-solving and iteration speed. Expertise in integrating AI-based tooling to create innovative applications that not only meet user needs but also drive real-world impact. Familiar with modern development techniques and strong in building maintainable, compliant solutions, leveraging tools such as **Node.js**, **FastAPI**, and cloud platforms like **Azure** and **AWS**. Committed to delivering scalable solutions that adhere to industry standards and improve operational efficiency.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and optimized dynamic, high-performance frontend architectures using **React.js** and **TypeScript**, ensuring rapid iteration speeds and enhanced user experience across digital healthcare and finance platforms.\n• Implemented state management solutions with **MobX** and other libraries, allowing for seamless interactions and real-time updates in user interfaces.\n• Collaborated closely with cross-functional teams to align on project goals, consistently communicating progress and challenges to ensure project autonomy and success.\n• Integrated AI-based tooling to enhance customer-facing applications, driving improved user engagement through smart financial dashboards and personalized health recommendations.\n• Leveraged performance optimization techniques in applications, achieving a **20%** reduction in load times and improving overall responsiveness and reliability.\n• Designed and executed comprehensive test strategies using Jest, ensuring robust frontend feature delivery with minimal defects through effective collaboration and communication.\n• Established frontend architecture that supports modular design, facilitating easier updates and maintenance, which increased iterative capability by **30%**.\n• Enhanced user experience using **state management** strategies to handle complex data flows efficiently, resulting in better usability and engagement metrics.\n• Conducted performance audits and implemented best practices, yielding a **25%** improvement in application performance metrics across multiple projects."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed user-focused front-end applications using **React.js (18)** and **TypeScript**, leveraging **MobX** for state management and performance optimization, ensuring responsive and efficient user interfaces.\nCollaborated with cross-functional teams to establish effective frontend architecture, enhancing communication and iteration speed while maintaining high-quality deliverables.\nImplemented AI-based tooling within front-end applications to improve user experiences and optimize performance, aligning with business objectives and enhancing overall functionality.\nLed efforts in performance optimization and state management to ensure dynamic interaction and seamless operations in financial dashboards and admin portals.\nDemonstrated autonomy and pragmatism in executing tasks independently, while contributing actively to team collaboration and project discussions.\nEmphasized the importance of communication skills in liaising with stakeholders and gathering requirements to refine frontend strategies and solutions.\nAchieved a significant increase in user satisfaction rates by focusing on frontend iteration speed and implementing user feedback into the design process."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and optimized responsive user interfaces using **React.js** (18) and **TypeScript**, focusing on performance optimization and state management techniques to enhance user experience across platforms.\n• Integrated **AI-based tooling** into front-end applications, utilizing machine learning models to enhance user personalization and interaction based on behavioral data, significantly improving engagement metrics.\n• Collaborated with cross-functional teams to ensure alignment on frontend architecture, promoting seamless integration and iteration speed of features in development cycles.\n• Implemented MobX for efficient state management in frontend applications, ensuring smooth data flow and application performance during high user activity periods.\n• Spearheaded the design of SEO-friendly e-commerce UIs using **HTML5/CSS3**, optimizing applications for mobile-first engagement and ensuring compliance with accessibility standards (WCAG 2.1).\n• Fostered a culture of strong communication within the development team, facilitating knowledge sharing and collaborative problem-solving to drive project success.\n• Demonstrated autonomy in managing frontend development tasks, driving projects from concept through deployment while adhering to pragmatic approaches and timelines.\n• Conducted regular performance optimization audits, utilizing tools to enhance loading times and responsiveness, contributing to user retention and satisfaction metrics.\n• Championed regular iterations and feedback loops to refine user interfaces, ensuring rapid adaptation to user needs and market trends."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, React.js, Vue, Angular, MobX, State management, Frontend architecture, Performance optimization\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tCollaboration, Communication, Autonomy, Pragmatism, Iteration speed, AI-based tooling"
}