{
  "name": "DANIEL HE",
  "role_name": "Senior AI Engineer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Results-driven Senior AI Engineer with extensive expertise in **Python**, **PyTorch**, **TensorFlow**, and **ML** for developing advanced machine learning models. Adept in CI/CD practices, utilizing **Git** for version control, and designing effective **API** solutions. Experienced in cloud services including **Azure**, **AWS**, and **GCP** to enhance infrastructure scalability and reliability. Demonstrated proficiency in **Agile** and **Scrum** methodologies to foster collaboration and deliver projects efficiently. Proven track record in implementing automated testing and optimizing relational databases, contributing to project success. Recognized for exceptional communication skills and the ability to develop user-centric applications in diverse sectors including healthcare, eCommerce, and finance, leveraging a commitment to clean and efficient code.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** for developing AI models using **TensorFlow** and **PyTorch**, achieving a model accuracy improvement of **15%** on predictive analytics tasks.\nImplemented robust CI/CD pipelines leveraging **Git** and cloud services including **AWS** and **Azure**, reducing deployment time by **75%**.\nDeveloped and optimized RESTful APIs for seamless integration with machine learning services, enhancing data retrieval speeds by **60%**.\nApplied Agile methodologies and participated in **Scrum** ceremonies to ensure effective team communication and project progress, leading to a **25%** increase in team velocity.\nConducted automated testing using various testing frameworks, improving code quality and reducing bugs in production by **50%**.\nManaged data storage solutions through relational databases, ensuring efficient data handling and longevity in access performance."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Utilized **Python** alongside **TensorFlow** and **PyTorch** to develop AI models, enhancing predictive accuracy by 30%.\nImplemented CI/CD practices with **Git**, **Jenkins**, and **AWS CodePipeline**, streamlining the deployment process and achieving a 40% faster release cycle.\nDesigned and developed RESTful APIs for seamless integration with client applications, ensuring 99% uptime in service availability.\nCollaborated in cross-functional Agile teams to deliver projects in 2-week sprints, fostering effective communication and collaboration.\nEnhanced relational databases performance by optimizing queries, resulting in a 20% increase in data retrieval speed.\nManaged cloud resources on **AWS** and **Azure**, deploying machine learning models to production environments with a 95% success rate."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Utilized **Python** and **TensorFlow** to develop machine learning models, enhancing predictive accuracy by 25%.\nImplemented **PyTorch** for model training, achieving a 50% reduction in training time compared to previous frameworks.\nDesigned and optimized RESTful APIs for machine learning integration, improving data retrieval speeds by **30%**.\nEstablished **CI/CD** pipelines using **Git** and **Azure DevOps**, enabling quicker deployment cycles, with deployment frequency increased to **10 times** per week.\nEngaged in Agile and Scrum methodologies, facilitating communication and collaboration within cross-functional teams to deliver projects ahead of schedule by **15%**.\nPerformed automated testing by integrating tools that increased code coverage to **85%**, significantly lowering the incidence of bugs in production.\nManaged relational databases effectively to handle substantial datasets, ensuring data integrity and availability for machine learning applications."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, Java, JavaScript, Go, SQL, Swift, Kotlin\n\n **Backend Frameworks**\n\tSpring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n **Frontend Frameworks**\n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest\n\n **API Technologies**\n\tRESTful API design, API\n\n **Serverless and Cloud Functions**\n\tAWS Lambda, Azure, GCP\n\n **Databases**\n\tMySQL, PostgreSQL, Redis, MongoDB, relational databases\n\n **DevOps**\n\tDocker, Kubernetes, Jenkins, GitHub Actions, Terraform, AWS CodePipeline, CI/CD, automated testing\n\n **Cloud & Infrastructure**\n\tAWS, Azure, GCP, API Gateway, CloudWatch, ELK Stack\n\n **Other**\n\tMicroservices, Data structures and algorithms, Agile, Scrum, communication",
  "apply_company": "Version 1"
}