{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Lead Sitecore Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Lead Sitecore Engineer with 13+ years of experience in building high-performance applications, specializing in **Sitecore**, **C#**, and the **.NET 8** framework. Proficient in cloud-based solutions using **Azure** services including **Azure Web Apps**, **Azure Functions**, **Azure SQL Databases**, and **Azure DevOps**. Strong command of **PowerShell** for automation and scripting within **Azure** environments.\n\nSkilled in modern frontend technologies including **JavaScript**, **TypeScript**, **Vue3**, and **React**, combined with expertise in backend development using **Node.js**, ensuring robust architectural solutions. Experienced in implementing CI/CD pipelines and **Kubernetes** (AKS) for container orchestration in agile development settings.\n\nDemonstrated ability to create data-driven applications with strong foundations in compliance, aligning with regulatory standards such as HIPAA and PCI DSS. Recognized for leveraging **solr cloud** for advanced search functionalities, and committed to delivering innovative solutions that meet client needs.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Lead Sitecore Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and implemented full-stack solutions leveraging **Azure**, **C#**, and **.NET 8**, ensuring high performance and scalability aligned with Agile methodologies.\n- Designed and maintained Sitecore applications and modules using **TypeScript**, **JavaScript**, **React**, and **Vue3**, ensuring seamless content management and personalized user experiences.\n- Managed deployment and operations of applications on **Azure Web Apps** and **Azure Functions**, achieving a reduction in deployment time by **40%** through streamlined CI/CD processes with **Azure DevOps**.\n- Led the design and optimization of Azure SQL Databases, improving application response time by **30%** through advanced indexing and query optimization techniques.\n- Coordinated with cross-functional teams to integrate **Solr Cloud** for advanced search capabilities, supporting fast and flexible querying across large datasets.\n- Employed **Kubernetes (AKS)** for container orchestration, achieving high availability and fault tolerance, while also reducing infrastructure costs by **25%**.\n- Developed custom PowerShell scripts for automation of routine tasks, enhancing operational efficiency and reducing manual errors significantly.\n- Integrated analytics and reporting functionalities utilizing Azure services, providing actionable insights into user behavior and system performance metrics.\n- Implemented robust testing strategies across the entire technology stack with **Jest**, **Cypress**, and **Postman**, ensuring code quality and reliability.\n- Collaborated with UX/UI designers to enhance frontend designs using **CSS**, focusing on responsiveness and accessibility.\n- Drove the adoption of Agile practices within the team, resulting in improved project delivery timelines and stakeholder satisfaction rates by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Azure**, **.NET 8**, and **C#** to develop and maintain scalable web applications within the **Sitecore** environment, enhancing user experience and performance.\nDesigned and implemented solutions leveraging **Azure Web Apps** and **Azure Functions** to support dynamic content delivery and improve site reliability by 30%.\nOversaw the integration of cloud services, utilizing **Azure SQL Databases** for efficient data storage and retrieval, achieving a 25% reduction in query response times.\nManaged CI/CD pipelines with **Azure DevOps**, allowing for faster deployment cycles (10 deployments per week) and seamless collaboration across teams.\nApplied Agile methodologies to streamline project workflows, enhancing team productivity and ensuring timely deliverables on high-stakes projects.\nDeveloped dynamic front-end applications using **React** (18) and **Vue 3**, crafting engaging interfaces that improved user engagement metrics by over 20%.\nImplemented robust testing frameworks using **JavaScript** and **TypeScript**, ensuring code quality and reliability across all development phases.\nConfigured and managed containerized applications through **Kubernetes** and **AKS**, improving application scalability and resilience to infra issues by up to 40%.\nCollaborated with cross-functional teams to develop custom search solutions using **Solr Cloud**, significantly enhancing search capability and UX.\nLeverage **CSS** and **Tailwind CSS** in UI/UX design, ensuring responsive design that supports various device types and screen sizes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services for Sitecore implementations using **C#**, **.NET 8**, and deployed on **Azure Web Apps**, ensuring high availability and scalability across key modules.\nEngineered real-time features using **Azure Functions** for event-driven processing, enhancing the performance of personalizable content delivery and site responsiveness.\nDeveloped frontend applications leveraging **Vue 3** and **React** with **TypeScript**, delivering fast and responsive user experiences, adhering to Agile methodologies.\nUtilized **Azure SQL Databases** for efficient data storage management, ensuring fast, fault-tolerant access for high-traffic workflows while optimizing for performance.\nImplemented caching strategies using **Azure** services, significantly improving application responsiveness and reducing latency for content-heavy pages by **40%**.\nApplied CI/CD principles utilizing **Azure DevOps** for smooth deployment cycles, enhancing team productivity and ensuring high-quality deliverables with a **30%** reduction in release times.\nCreated responsive, SEO-friendly interfaces using **CSS** and modern JavaScript frameworks, promoting mobile-first design and accessibility compliance in accordance with specifications (WCAG 2.1).\nIntegrated secure payment workflows, ensuring PCI-compliance and robust handling of sensitive customer data across platforms.\nLeveraged **Kubernetes** for container orchestration, ensuring that deployments across **AKS** are reliable and manageable, streamlining the update processes for ongoing platform enhancements.\nApplied role-based access control (RBAC) and **OAuth 2.0** for secure access management across the Sitecore framework, ensuring GDPR compliance and user data protection throughout.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, .NET 8, Python, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Vue3, Angular, CSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Sitecore\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAzure Functions, AWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, Azure SQL Databases, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob Storage), Terraform, Ansible, Helm, Docker Compose, AKS\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Agile, Nginx, Let’s Encrypt, Certbot, Solr Cloud"
}