{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Tools Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Accomplished Senior Tools Engineer with 8 years of experience in **C#**, **Python**, and **Lua** development, specializing in backend automation and CI/CD pipelines using **Jenkins** and **GitLab CI**. I have a proven track record in game development, creating high-performance tools that enhance workflows and streamline processes. My depth of knowledge enables me to integrate complex systems while maintaining compliance and performance standards.\nAlongside my core skills, I bring experience in full-stack development using **React**, **Node.js**, and **FastAPI**, with expertise in integrating cloud services such as **Azure** and **AWS**. I have successfully led enterprise-level projects that utilize predictive analytics and AI/ML capabilities, ensuring robust and scalable solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Tools Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained automation processes for game development environments using **C#** and **Python** to enhance workflow efficiency.\nDesigned and implemented CI/CD pipelines utilizing **Jenkins** and **GitLab CI** for seamless integration and delivery of backend tools, resulting in automated testing and deployment processes.\nCollaborated with cross-functional teams to build tools that support backend game systems, improving overall game performance and reducing load times by up to **30%**.\nCreated and optimized scripts in **Lua** for game mechanics and features, facilitating the rapid prototyping and iteration of new game ideas.\nArchitected backend services leveraging **Unity** for real-time game interaction, enabling scalable architecture that supports multiplayer functionalities.\nOversaw the automation of build processes using **CI/CD** strategies, reducing the deployment time by **50%** compared to previous manual processes.\nEstablished comprehensive documentation for tools and frameworks to facilitate easy onboarding and knowledge transfer within the team.\nImplemented rigorous testing strategies across all tools created, ensuring high reliability and performance standards were met consistently.\nLed technical reviews of new tools and frameworks to maintain quality standards and enhance code maintainability across all projects."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **C#** and **Python** to develop efficient backend solutions, enhancing automated builds and integrations for game development pipelines using **Jenkins** and **Gitlab CI**.\nImplemented CI/CD strategies to streamline the deployment process, significantly reducing deployment time by **30%** and increasing release frequency to **weekly**.\nDeveloped automation scripts in **Lua** to optimize repetitive tasks within the game development workflow, ensuring consistency and reliability across different environments.\nCollaborated closely with cross-functional teams to gather requirements and troubleshoot backend systems, improving overall communication and project delivery timelines by **25%**.\nDesigned tools and features that support scalability in gaming applications, leveraging best practices in software design and architecture while focusing on maintainability.\nContributed to the development of custom tools, enhancing gameplay mechanics and user experience by implementing user feedback effectively into new features.\nMaintained version control and project documentation in **Git** repositories, ensuring a robust codebase management process to facilitate team collaboration and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **Python** to develop and optimize backend tools and services, improving efficiency across the game development process with a focus on automation.\nImplemented **CI/CD** pipelines using **Jenkins** and **Gitlab CI**, enhancing deployment processes and reducing release cycles by **30%**.\nDeveloped automation scripts in **Lua** to facilitate seamless integration and deployment of testing frameworks across multiple gaming platforms, leading to a **25%** increase in testing throughput.\nCollaborated with cross-functional teams to integrate backend systems, ensuring a robust and scalable environment for game tools and development processes.\nDesigned user-friendly interfaces for internal tools using **Unity**, improving user experience and operational efficiency by reducing training time by **40%**.\nManaged version control strategies using **Git**, ensuring stable codebase management and efficient collaboration among team members.\nConducted performance assessments and optimizations for backend tools, resulting in an overall speed increase of over **20%** in tool usability.\nMaintained comprehensive documentation for all tools developed, ensuring compliance and ease of knowledge transfer within teams."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C#, Lua\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n**API Technologies:**\n\tNginx, Keycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Game development, Automation, Let’s Encrypt, Certbot",
  "apply_company": "Voodoo"
}