{
  "name": "Rei Taro",
  "role_name": "Senior Node.js Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Node.js Engineer with 10+ years of experience in building robust APIs and scalable backend systems. Proficient in **Node.js**, **Docker**, **REST**, and cloud technologies, with a strong focus on infrastructure-as-code and CI/CD practices. Skilled in implementing authentication protocols including **OAuth2**, **SAML**, and **SSO** to enhance security across web applications. Proven ability to collaborate effectively and communicate complex concepts clearly, demonstrated through impactful projects at leading organizations. Solid background in **Golang**, **React**, and advanced debugging techniques to deliver high-quality software solutions swiftly.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Node.js Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered scalable and robust **Node.js** APIs to enhance document automation, user onboarding, and reporting workflows, contributing to a **25%** increase in efficiency.\nDeveloped and maintained **Docker**-based containerization solutions, optimizing deployment processes and reducing environmental inconsistencies by **30%**.\nImplemented secure authentication mechanisms using **OAuth2**, **SAML**, and **SSO** in an enterprise environment, improving overall system security and compliance ratings by a significant margin.\nLed efforts in creating seamless **CI/CD** pipelines to streamline the deployment process and improve software release cycles, achieving **95%** automation in our releases.\nCollaborated effectively with cross-functional teams to address system integration challenges and ensure compliance, leading to successful project completions ahead of deadlines by **15%**.\nConducted regular debugging sessions and produced thorough documentation to ensure high-quality code and maintainability, elevating team performance and knowledge sharing across projects.\nWorked with **React** for front-end development to create dynamic user interfaces, enriching user experience and engagement metrics by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Engineered and managed RESTful APIs using **Node.js** to ensure seamless integration with frontend technologies and microservices.\nUtilized **Docker** for containerization of applications, ensuring consistent deployment and scalability across multiple environments.\nImplemented CI/CD pipelines to enhance deployment efficiency by **30%**, allowing for faster delivery of new features and updates.\nIntegrated **OAuth2** and **SAML** protocols for secure authentication and implemented Single Sign-On (SSO) to streamline user access across applications.\nOversaw the documentation of API endpoints and system architecture, facilitating a smoother onboarding process for new team members and stakeholders.\nApplied infrastructure-as-code principles with tools like **Terraform** to automate the deployment and management of cloud resources on platforms such as Azure, achieving **99.9%** uptime.\nCollaborated with cross-functional teams, enhancing communication and debugging efforts to ensure successful and timely project deliveries.\nLeveraged **Golang** for performance-critical modules, improving execution speed by **15%** in processing tasks."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed RESTful APIs with **Node.js** to facilitate seamless integration with frontend applications and external systems, ensuring scalability and maintainability.\nEngineered microservices architecture utilizing **Docker** for containerization, enhancing deployment efficiency by **30%** and ensuring consistency across different environments.\nImplemented robust authentication mechanisms including **OAuth2** and **SAML**, guaranteeing secure user access and streamlined Single Sign-On (SSO) experiences.\nCollaborated with cross-functional teams to design and document APIs, enhancing communication and ensuring alignment on project deliverables.\nIntegrated CI/CD pipelines to automate deployment and testing processes, reducing development time by **40%** and increasing code quality.\nApplied best practices for module bundling to optimize application load times, leading to improved overall performance by **25%**.\nManaged infrastructure-as-code using cloud technologies to deploy and scale applications efficiently, ensuring reliability and availability.\nConducted thorough debugging sessions and performance tuning in **Golang**, resulting in improved system responsiveness and reliability.\n"
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, Node.js, Golang\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tReact\n\n**API Technologies**\n\tREST, REST/gRPC APIs, OAuth2, SAML, SSO\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Docker, cloud\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, infrastructure-as-code, debugging\n\n**Cloud & Infrastructure**\n\tcloud\n\n**Other**\n\tMicroservices, Kafka, PyTest, Git, documentation, communication, module bundling",
  "apply_company": "Bonapolia"
}