{
  "name": "Tomasz Lee",
  "role_name": "Senior Windows Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Proficient Senior Windows Engineer with over 9 years of experience in endpoint management and automation. Expertise in leveraging **Active Directory**, **Microsoft Intune**, and **VMWare Workspace One** for effective systems management and deployment. Skilled in scripting using **PowerShell** and **VBScript**, with a strong foundation in ITIL practices to enhance service delivery and operations. Demonstrated ability to develop customer-oriented solutions while optimizing workflows and processes, ensuring seamless integration and robust performance. Known for collaborating with cross-functional teams to successfully lead projects from inception to completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Windows Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Spearheaded automation efforts using **PowerShell** and **VBScript** to improve scripting efficiency for endpoint management tasks.\nDeveloped efficient deployment scripts utilizing **Microsoft Installer** and **Flexera Admin Studio** to streamline software installation processes across **Windows 11 Enterprise** environments.\nImplemented **Microsoft Intune** for streamlined endpoint management and security compliance, ensuring a customer-oriented approach to device management and support.\nCollaborated with cross-functional teams to integrate **Active Directory** solutions, enhancing user access management and security protocols.\nUtilized **VMWare Workspace One** for comprehensive endpoint and device management, improving user satisfaction ratings by **30%**.\nIntegrated ITIL best practices in daily operations to streamline processes and enhance service delivery.\nAutomated reporting and monitoring scripts to enhance visibility into system performance, leading to a **25%** reduction in manual oversight.\nLed training sessions on endpoint troubleshooting and scripting techniques for team members, contributing to skill development and knowledge sharing.\nEnsured compliance with organizational policies through consistent application of security protocols and procedures."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **PowerShell** scripting to automate Windows 11 Enterprise deployment processes, enhancing operational efficiency by **20%**.\nManaged endpoint management solutions through **VMWare Workspace One** and **Microsoft Intune**, ensuring smooth integration and compliance.\nConfigured and administered Active Directory for user management and security policies, improving access control by **30%**.\nDeveloped scripting solutions using **VBScript** to streamline software installation processes via **Microsoft Installer**, reducing manual intervention by **50%**.\nImplemented automation strategies that led to a decrease in incident resolution time, reflecting customer-oriented service delivery.\nUtilized **Flexera Admin Studio** for application packaging and deployment, significantly reducing setup time for new software releases.\nParticipated in ITIL processes to enhance service management efficiency, aligning with best practices in IT operations.\nConducted training sessions for team members on scripting best practices, resulting in improved skill levels across the team.\nCollaborated with cross-functional teams to gather requirements and ensure stakeholder satisfaction with implemented solutions.\nLed efforts to document and optimize endpoint management processes, facilitating better compliance and audit readiness."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented endpoint management solutions utilizing **PowerShell** and **Microsoft Intune** to enhance productivity within the organization.\nAutomated deployment and configuration tasks through **VBScript** and **scripting**, streamlining IT operations and reducing manual efforts by 30%.\nManaged user access and security protocols using **Active Directory**, successfully provisioning 400+ accounts while ensuring compliance with company policies.\nUtilized **VMWare Workspace One** to provide a unified endpoint management experience, integrating 250 devices to ensure seamless connectivity and security.\nConducted thorough training on **Microsoft Installer**, resulting in a 25% reduction in software deployment time across various teams.\nLed initiatives focused on ITIL best practices, improving incident response times by 15% and enhancing customer satisfaction.\nDeveloped automation scripts that reduced repetitive tasks, contributing to a 40% increase in overall team efficiency.\nPlayed a pivotal role in incident resolution, maintaining a customer-oriented focus and ensuring service availability above 99%.\nCollaborated with cross-functional teams to ensure all technical documentation is up to date, thus improving knowledge transfer and project delivery timelines.\n"
    }
  ],
  "skills": "PowerShell, Windows 11 Enterprise, Microsoft Installer, VBScript, VMWare Workspace One, Microsoft Intune, Active Directory, Flexera Admin Studio, ITIL, scripting, automation, endpoint management, customer-oriented,\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Database Systems**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Testing Tools**\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\n**Serverless and Cloud Functions**\n\t(no specific skills provided)\n\n**Other**\n\tBlockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Python, Redux",
  "apply_company": "PwC Polska"
}