{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Lead Sitecore Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Innovative Lead Sitecore Engineer with 13+ years of experience in developing high-performance applications within the healthcare and financial sectors, leveraging strong skills in **C#**, **.NET 8**, **Azure Web Apps**, **Azure Functions**, **Azure SQL Databases**, and **Azure DevOps**. Adept in client-side and server-side programming using **JavaScript**, **TypeScript**, **Vue3**, and **React**, ensuring seamless user experiences and robust backend functionalities.\nDemonstrated expertise in cloud-native deployment and orchestration on **Azure**, utilizing **Kubernetes** and **AKS**, along with implementation of CI/CD workflows to enhance development efficiency. Proficient in building responsive web applications and managing data with **Solr Cloud**.\nProven track record in compliance-driven development aligned with industry standards, fostering collaboration, communication, and leadership within agile teams. Strong analytical and problem-solving skills, complemented by hands-on experience in building AI/ML solutions powered by frameworks such as **FastAPI**, **Django**, and MLOps tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Lead Sitecore Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Led the design and implementation of **Sitecore** solutions utilizing **C#** and **.NET 8**, ensuring robust integration with **Azure Web Apps** and **Azure Functions** for scalable web applications.\nDeveloped and maintained data solutions using **Azure SQL Databases** to support dynamic content delivery and performance optimization in a fast-paced, agile environment.\nCollaborated effectively with cross-functional teams to define project requirements and ensure clear communication throughout the development lifecycle, implementing agile methodologies for efficiency and rapid iteration.\nUtilized **TypeScript**, **JavaScript**, and modern frameworks like **React** and **Vue3** to enhance user experience, crafting intuitive interfaces tailored to user needs and expectations.\nManaged **Kubernetes** deployments, particularly on **AKS**, ensuring high availability and seamless scaling of applications to meet user demand and enhance performance.\nImplemented CI/CD practices within **Azure DevOps**, facilitating automated testing and deployment pipelines to improve development efficiency and minimize downtime.\nCreated customized solutions employing **PowerShell** scripts for automation, significantly reducing manual efforts and enhancing productivity.\nLed the development of dynamic search functionalities using **Solr Cloud**, delivering optimized search experiences across content-rich applications.\nFostered a culture of collaboration by mentoring team members and promoting problem-solving strategies that enhance productivity and project outcomes.\nEngaged in effective leadership practices, driving project timelines and ensuring stakeholder communication to align goals and expectations throughout the development phase."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Led the modernization of financial platforms utilizing **Sitecore** and **C#** to enhance user experience, ensuring compliance with industry standards on **.NET 8** and **Azure Web Apps**.\nDeveloped and maintained scalable applications using **JavaScript**, **TypeScript**, and **React (18)**, driving responsiveness and performance in admin panels and client-facing tools.\nOversaw deployment strategies through **Kubernetes** and **Azure DevOps**, maintaining CI/CD pipelines to ensure rapid and reliable software releases.\nUtilized **Azure Functions** and **Azure SQL Databases** for building dynamic services that execute on-demand, improving efficiency by enabling automated financial reporting and analytics.\nImplemented real-time data processing with **Azure Data Factory** for ingesting and transforming financial data, achieving a processing rate of **3TB/month**.\nFacilitated agile workflows among cross-functional teams, promoting **Agile methodologies** to enhance team collaboration and project visibility, resulting in a **30%** reduction in project delivery timelines.\nEmpowered team leadership through effective communication, mentoring junior developers in **PowerShell** scripting and best practices of front-end development using **Vue 3** and **CSS**.\nResolved complex issues through innovative problem-solving and critical thinking, driving improvements in system performance and user satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Designed and optimized **Sitecore** solutions leveraging **C#**, **.NET 8**, and **Azure Web Apps**, ensuring efficient delivery and scalability of content across a global e-commerce platform.\n- Spearheaded the integration of **Azure Functions** for serverless compute capabilities, significantly reducing response times and improving resource management by **20%**.\n- Utilized **Azure SQL Databases** to manage large-scale data for high-traffic applications, ensuring robust data integrity and accessibility.\n- Leveraged **PowerShell** for automated deployments and DevOps processes in **Azure DevOps**, achieving a **30%** reduction in deployment times.\n- Championed the implementation of **Kubernetes** and **AKS** for orchestrating containerized applications, embracing Agile methodologies to drive iterative improvements.\n- Developed and maintained responsive web applications using **Vue 3**, **React**, and **TypeScript**, incorporating best practices in CSS for UI/UX design, and improving frontend performance by **25%**.\n- Facilitated cross-functional communication and collaboration among teams, enhancing project visibility and accelerating problem-solving processes.\n- Cultivated a leadership environment focused on mentoring junior engineers while fostering an agile and innovative workplace culture.\n- Applied version control and CI/CD pipelines in **Azure DevOps**, maintaining high code quality through **unit testing** and code reviews.\n- Engaged in ongoing professional development and team training sessions to keep abreast of the latest developments in **Sitecore** and related technologies."
    }
  ],
  "skills": "**Programming Languages**:\n\tC#, JavaScript, TypeScript, Python\n\n**Backend Frameworks**:\n\t.NET 8, FastAPI, Flask, Django\n\n**Frontend Frameworks**:\n\tReact, Vue, Angular, Vue3, CSS\n\n**API Technologies**:\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions**:\n\tAzure Functions, AWS Lambda\n\n**Cloud & Infrastructure**:\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Azure DevOps, Kubernetes, AKS\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), Azure SQL Databases, MongoDB (Gaming), Redis, Solr Cloud\n\n**DevOps**:\n\tDocker, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Other**:\n\tAgile methodologies, MLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, communication, leadership, collaboration, problem-solving"
}