{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Fullstack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Full Stack Engineer with 10+ years of experience in leveraging **Node.js**, **TypeScript**, **React.js**, **Next.js**, and **Nest.js** to deliver top-notch software solutions. Proven expertise in **GraphQL** API development, end-to-end testing, and implementing **Agile** methodologies for efficient team collaboration and problem-solving. Demonstrated ability to optimize performance and adhere to clean code practices while enhancing user experience. Hands-on experience in building and deploying cloud-native applications on **Azure** and **AWS**, with a strong background in microservices architecture and CI/CD automation.\n\nExpert in integrating AI/ML capabilities for real-time analytics and automation, utilizing tools such as **Langchain**, **Pinecone**, and MLOps technologies like **MLflow**, **Airflow**, and **Kubeflow** to drive impactful solutions. Committed to developing secure and maintainable systems that meet industry compliance standards including HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented **API development** using **Node.js**, **TypeScript**, and **Nest.js**, ensuring clean code practices and high performance across scalable applications in healthcare and finance.\n• Developed dynamic user experiences and responsive interfaces leveraging **React.js** and **Next.js**, focusing on user experience design and optimal performance.\n• Integrated **GraphQL** for efficient data retrieval and manipulation, enhancing collaboration between front-end and back-end development teams.\n• Led agile methodology practices within the team to enhance collaboration and improve problem-solving strategies, resulting in a **30%** reduction in development time for feature releases.\n• Established robust end-to-end testing frameworks utilizing tools such as Jest and Cypress, achieving **95%** test coverage and ensuring high-quality deliverables across all services.\n• Enhanced application performance through optimized coding practices and performance optimization strategies, resulting in a **40%** improvement in load times.\n• Collaborated with cross-functional teams to design and deliver a microservices architecture, improving system reliability and facilitating a seamless deployment process.\n• Managed state effectively in applications using **Langchain** and integrations with modern libraries, ensuring efficient data flow and user interactivity.\n• Created comprehensive documentation and maintained clean code practices to improve team onboarding and facilitate knowledge sharing.\n• Participated in code reviews, fostering a culture of continuous improvement and maintaining high standards for clean code and software craftsmanship."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Led the implementation of **Node.js** (Nest.js) and **TypeScript** frameworks to develop scalable microservices architecture for financial platforms, improving system throughput by **30%** for high-volume transactions.\nDesigned and developed responsive and user-friendly front-end applications with **React.js** (18) and **Next.js**, employing Agile methodology and performance optimization techniques, resulting in a **25%** increase in user satisfaction ratings.\nCollaborated with cross-functional teams to enhance user experience design, successfully integrating **GraphQL** for efficient data fetching, which reduced loading times by **15%** across applications.\nEngineered real-time analytics dashboards employing **React.js** and **Power BI Embedded**, facilitating anomaly detection and strategic decision-making for operational teams managing high-value transactions.\nImplemented asynchronous communication using **Kafka** and **RabbitMQ**, establishing an event-driven architecture that streamlined compliance workflows and reduced processing delays by **20%**.\nBuilt ETL pipelines utilizing Python, Apache Airflow, and Azure Data Factory, enabling efficient ingestion and processing of financial data from **3** internal and external sources on a daily basis.\nLeveraged AI/ML tools such as scikit-learn and Azure Machine Learning for the development of advanced fraud detection systems, reducing fraudulent transaction rates by **40%** through proactive monitoring.\nArchitected ML pipelines for credit scoring and churn prediction, integrating with backend services to facilitate real-time decision-making, enhancing the financial service delivery.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and optimized backend services as a **Senior Fullstack Engineer** using **Node.js** (with **Nest.js**) and **TypeScript**, ensuring high performance in e-commerce applications serving up to **1 million** users.\n• Created RESTful and **GraphQL** APIs for seamless data interactions, achieving a response time improvement of **30%** for client requests.\n• Engineered innovative solutions employing **React.js** and **Next.js** to build responsive, fast-loading user interfaces that improved user engagement by **25%**.\n• Collaborated in an **Agile methodology** environment with cross-functional teams to effectively deliver features that meet user needs and project timelines.\n• Implemented rigorous **end-to-end testing** strategies that enhanced application reliability and reduced bug incidences by **40%**.\n• Adhered to clean code practices and conducted code reviews, fostering a culture of maintainability and performance optimization within the development team.\n• Utilized modern design principles to enhance user experience through intuitive UI/UX design, improving customer satisfaction ratings by **15%**.\n• Actively engaged in collaboration with product owners and stakeholders to solve complex technical challenges and deliver valuable solutions in a fast-paced setting.\n• Leveraged **Langchain**, **Pinecone**, and LLM-based development alongside emerging technologies to explore and implement advanced functionalities in projects."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js, Nest.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, React.js, Next.js\n\n**API Technologies:**\n\tGraphQL, API development\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Langchain, Pinecone, LLM-based development, End-to-end testing, Agile methodology, Collaboration, Problem-solving, Performance optimization, Clean code practices, User experience design",
  "apply_company": "Not specified"
}