{
  "name": "Rei Taro",
  "role_name": "Senior PHP Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior PHP Engineer with over 10 years of experience in developing robust **Web Applications** and **Backend Services**. Proficient in building and integrating high-performing **APIs** leveraging **PHP** alongside expertise in **DevOps** practices to streamline deployment and improve collaboration. Adept at working within **Agile** frameworks to deliver solutions that meet user needs effectively. Demonstrated experience with cloud-native architectures and automation tools from previous roles, contributing to high-impact projects at leading organizations such as VISA, Sii Poland, and Reply Polska. Known for a strategic approach to problem-solving and a commitment to delivering quality results.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed and maintained **Web Applications** using **PHP** to enhance user experience and streamline document automation workflows.\nEngineered **APIs** for efficient communication between modules and external services, ensuring robustness and reliability in backend services.\nCollaborated with cross-functional teams to address system integration challenges, optimizing processes with Agile methodologies.\nImplemented DevOps practices for continuous integration and delivery, ensuring high-quality release strategies and deployment.\nLed the development of scalable **Backend Services** that managed dynamic content and user onboarding processes, significantly improving user engagement metrics by **30%**.\nUtilized performance monitoring tools to enhance system efficiency, achieving a reduction in response times by **20%** through effective code optimization.\nConducted regular security assessments and integrated authentication mechanisms for safe user access in compliance with industry standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Designed and developed robust **backend services** in **PHP** to create scalable web applications, enhancing user experiences and streamlining operations.\nImplemented efficient **APIs** to facilitate seamless integrations with third-party services, achieving a **30%** reduction in response times.\nManaged version control and deployment processes with **DevOps** practices, ensuring code quality and reliability with minimum downtime of less than **5 hours per quarter**.\nCollaborated with cross-functional teams in an **Agile** environment to collect feedback and iterate on application features, leading to a **40%** increase in customer satisfaction.\nDeveloped documentation for all web applications, enabling easier **collaboration** and knowledge sharing among team members and stakeholders.\nParticipated in regular code reviews to maintain high standards of software quality and to mentor junior developers in best practices."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed robust **Web Applications** utilizing **PHP** for backend services to enhance trading operations.\nEngineered efficient **APIs** that facilitate seamless data interaction with frontend teams, ensuring smooth user experiences across platforms.\nImplemented Agile methodologies to optimize collaboration between cross-functional teams, promoting continuous improvement in projects.\nDesigned and maintained high-performance **Backend Services** with a focus on scalability and reliability, handling up to **9,000 transactions** per minute.\nApplied **DevOps** practices for streamlined development workflows, reducing deployment times by **30%** through automation.\nCollaborated with stakeholders to define direction and establish clear project requirements, ensuring **100%** regulatory compliance including MiFID II and GDPR.\nIntegrated comprehensive testing strategies using unit tests and code review practices to maintain software quality, impacting release cycles positively by **25%**."
    }
  ],
  "skills": " **Programming Languages**\n\t Python (3.8+), SQL, Bash, JavaScript, PHP\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t Web Applications\n\n **API Technologies**\n\t REST/gRPC APIs, APIs\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, DevOps\n\n **Cloud & Infrastructure**\n\t (No additional skills)\n\n **Other**\n\t Microservices, Kafka, Collaboration, Agile, PyTest, Git, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow",
  "apply_company": "intive"
}