{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior AI Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior AI Engineer with 10+ years of experience refining high-performance software solutions, specializing in **Python** and **ML** technologies including **TensorFlow** and **PyTorch**. Deep expertise in cloud computing with a focus on **Azure**, **AWS**, and **GCP**, complemented by a strong background in CI/CD practices and automated testing strategies. Adept at designing and deploying scalable AI/ML solutions while ensuring seamless integration with existing frameworks and APIs.\n\nA proven track record in developing and leading projects within Agile and Scrum environments, resulting in efficient team collaboration and project delivery. Possesses strong communication skills to convey complex concepts to diverse stakeholders. Additionally, experienced in relational databases, version control using **Git**, and driving development processes that enhance productivity and compliance with industry standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped advanced AI solutions leveraging **Python** and frameworks such as **PyTorch** and **TensorFlow** for machine learning applications, ensuring compliance with healthcare and financial regulations.\n•\tEngineered machine learning models for diverse applications like patient risk prediction and financial fraud detection, achieving **95% accuracy** in real-time inference with services integrated into cloud platforms, particularly **AWS** and **Azure**.\n•\tDesigned and maintained robust cloud infrastructure, utilizing **AWS Lambda** and **Azure Functions** for serverless architecture, enhancing performance and scalability for high-volume data processing.\n•\tImplemented effective **CI/CD** pipelines using **GitHub Actions** and **Azure DevOps**, driving collaborative development practices in Agile/Scrum environments through automated deployments and testing initiatives.\n•\tLed efforts in optimizing relational database management with **PostgreSQL** and **MongoDB**, ensuring efficient data handling for healthcare and financial data ingestion, improving query performance by **30%**.\n•\tCollaborated with cross-functional teams to integrate APIs and microservices architecture, facilitating seamless connections among several applications to improve operational workflows and enhance user experience.\n•\tCoordinated automated testing strategies using **Jest**, **Cypress**, and **Postman**, implementing rigorous quality assurance processes that reduced production errors by **20%**.\n•\tUtilized frameworks such as **GraphQL** for effective data querying in applications, streamlining data access and improving development time.\n•\tDriven research and development of AI features like personalized health recommendations and predictive alerts using advanced algorithms deployed in **Azure Machine Learning** environments.\n•\tProvided leadership and mentorship within the team, enhancing overall communication and project management skills to deliver impactful AI solutions in the healthcare and finance domains."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to develop and implement machine learning algorithms for fraud detection, employing frameworks such as **scikit-learn** and **XGBoost**, improving detection accuracy by **25%** in financial transactions.\nLeveraged cloud services like **Azure** and **AWS** to deploy scalable AI/ML models for real-time analytics, enhancing data processing efficiency by **30%** across multiple systems.\nCollaborated in an **Agile/Scrum** environment, effectively communicating with cross-functional teams to ensure alignment on project goals and timelines, leading to a **15%** reduction in development cycles.\nEstablished best practices for **CI/CD** pipelines using **Git**, facilitating continuous integration and deployment which resulted in faster rollouts of updates by **40%**.\nDesigned and maintained **Relational Databases** to securely store and manage large volumes of transactional data, optimizing query performance and reducing latency by **20%**.\nImplemented thorough **Automated Testing** strategies to enhance code quality and mitigate bugs in production, achieving a **98%** pass rate in regression testing for key applications.\nDeveloped and integrated RESTful **APIs** for seamless interaction between front-end applications and back-end services, ensuring reliable and efficient data exchange.\nPartnered with data engineers to create effective data pipelines and ETL processes, incorporating tools like **Apache Airflow** and **Azure Data Factory**, which accelerated data ingestion by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **TensorFlow** to develop and optimize machine learning models, enhancing predictive analytics capabilities that improved customer engagement by **25%**.\nCreated and maintained CI/CD pipelines leveraging **Git**, ensuring a streamlined deployment process that reduced deployment times by **30%**.\nImplemented automated testing frameworks to ensure code quality and consistency across AI-driven features, reducing bugs by **15%** and improving overall system reliability.\nCollaborated with cross-functional teams using **Scrum** methodology, improving team communication and project transparency, resulting in a **20%** increase in project delivery speed.\nDesigned and built RESTful APIs to integrate machine learning solutions with existing systems using **Python** and **Flask**, supporting high-volume transactions with scalability in mind.\nLeveraged **Azure** and **AWS** cloud services to deploy and maintain scalable AI models, achieving a reduction in infrastructure costs by **10%** while ensuring high availability.\nEngaged in continuous learning and application of state-of-the-art machine learning techniques using **PyTorch** and **TensorFlow**, staying ahead of industry trends and adopting new technologies.\nConducted thorough data analysis and preprocessing with relational databases such as PostgreSQL, ensuring data integrity and efficiency in machine learning training pipelines.\nParticipated in design reviews and technical discussions to continually improve team knowledge on AI/ML best practices and technologies, fostering a culture of collaboration and shared learning."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure, GCP\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Relational Databases\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tML, MLflow, PyTorch, TensorFlow, Airflow, Kubeflow, Git, Automated Testing, Scrum, Agile, Communication, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Version 1"
}