{
  "name": "Rei Taro",
  "role_name": "Senior Security Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Detail-oriented Senior Security Engineer with over 10 years of experience in threat hunting, SIEM implementation, and cloud security. Proficient in **cloud platforms** like **AWS** and **Azure**, implementing **CSPM** strategies to enhance security postures. Skilled in scripting with **Python** and **PowerShell** to automate security processes and develop responsive security tools. Strong familiarity with SOC operations and EDR solutions, ensuring comprehensive coverage against potential threats. Demonstrated capability in high-stakes environments, contributing to security initiatives at renowned organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented cloud security measures utilizing **Azure App Services** and **Terraform**, ensuring robust infrastructure as code practices for deployment and management of security solutions.\nDeveloped and executed scripts in **Python** and **PowerShell** for threat hunting and automation of security processes, improving incident response times by **30%**.\nManaged security information and event management (SIEM) configurations to enhance threat detection capabilities, resulting in a **25%** reduction in false positives.\nConducted comprehensive security assessments aligned with SOC requirements to identify vulnerabilities and threat vectors, providing actionable recommendations.\nCollaborated effectively with cross-functional teams, fostering communication and collaboration to address compliance issues and enhance system integrations.\nUtilized endpoint detection and response (EDR) solutions to monitor security incidents, achieving a detection accuracy of **99%** in real-time alerts.\nDeveloped and implemented data loss prevention (DLP) strategies, ensuring sensitive data protection across cloud platforms and minimizing data breach risks."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented security protocols and compliance measures to protect cloud infrastructure and data by conducting regular security audits, ensuring adherence to SOC standards.\nDeveloped and maintained scripting solutions in **Python** and **PowerShell** for automation of security monitoring tasks leveraging **SIEM** and **EDR** platforms, enhancing threat detection accuracy by **30%**.\nUtilized threat-hunting techniques to identify and mitigate potential vulnerabilities across cloud environments, reducing incident response times by **25%**.\nCollaborated with cross-functional teams to facilitate effective communication and knowledge sharing, resulting in a **15%** improvement in project delivery timelines.\nConfigured and managed **DLP** and **CSPM** solutions to enforce data protection policies, safeguarding sensitive information against unauthorized access.\nParticipated in incident response activities, employing effective communication strategies to coordinate with stakeholders during critical security events, achieving an overall incident resolution time of under **2 hours**.\nDeployed scalable infrastructure solutions on **Azure** using Terraform, enabling automated provisioning and management, which improved resource efficiency by **20%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **PowerShell** scripting to develop automated security processes, enhancing operational efficiency and threat response capabilities.\nEngaged in threat hunting activities to proactively identify vulnerabilities and security incidents, achieving a detection rate improvement of **30%**.\nEmployed **SIEM** tools to monitor and analyze security events, facilitating timely incident response and urgent threat mitigation.\nCollaborated with cross-functional teams to ensure effective communication and integration of security measures within development processes, reducing security risks by **40%**.\nImplemented security protocols and compliance measures in line with industry standards, including **SOC** and **DLP**, ensuring system integrity and data protection for sensitive information.\nLeveraged **cloud** security strategies to secure virtual environments, achieving a compliance score of **95%** on security audits.\nExecuted comprehensive analysis and reports on threat landscape, producing actionable insights for team collaboration and informed decision-making."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython, PowerShell\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\tJavaScript\n\n  **API Technologies**\n\tREST/gRPC APIs\n\n  **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n  **Cloud & Infrastructure**\n\tcloud, CSPM\n\n  **Other**\n\tSOC, threat_hunting, SIEM, EDR, DLP, scripting, communication, collaboration, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, PyTest, Git",
  "apply_company": "Novanta Inc."
}