{
  "name": "Rei Taro",
  "role_name": "Senior Elixir Fullstack Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Results-driven Senior Elixir Fullstack Engineer with over 10 years of experience in delivering high-quality, compliant applications and backend systems. Proficient in **Elixir**, **Phoenix**, **LiveView**, **TailwindCSS**, and **daisyUI**, with a strong focus on **GDPR compliance**, **encryption**, and **data privacy**. Skilled in implementing DevOps practices and agile software development methodologies, ensuring high code quality through collaboration and effective team dynamics. Known for problem-solving and a commitment to reflection and continuous learning. Previous contributions to top-tier organizations, including VISA, Sii Poland, and Reply Polska, have improved project outcomes and streamlined delivery processes.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Elixir Fullstack Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Elixir** and **Phoenix** frameworks to develop robust backend services, ensuring high performance and scalability in line with agile software development practices.\nImplemented real-time features using **LiveView** for dynamic user interfaces, enhancing user engagement and responsiveness in applications.\nDesigned and styled user interfaces with **TailwindCSS** and **daisyUI**, contributing to a clean and modern aesthetic that improves user experience.\nEnsured **GDPR compliance** and implemented **encryption** techniques to protect data privacy across all applications, emphasizing the importance of security in system designs.\nEmployed a **DevOps** approach in development workflows, fostering team collaboration and consistent code quality through automated testing and continuous integration.\nAdapted **Shape Up** methodologies to manage project timelines and deliver results effectively, enhancing team communication and performance.\nEngaged in continuous learning and reflection on best practices, promoting a culture of curiosity and improvement within the team.\nDemonstrated strong problem-solving abilities and effective communication skills to address challenges during software development cycles, leading to a 30% reduction in deployment times.\nOrchestrated successful releases through careful planning and collaboration with cross-functional teams, achieving a 95% compliance rate in system integration processes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Elixir** and **Phoenix** frameworks to design and implement robust full-stack applications, enhancing user experience with **LiveView** to facilitate real-time interactivity.\nDeveloped responsive user interfaces with **TailwindCSS** and **daisyUI**, contributing to an improved visual and functional aspect of applications by ensuring high-quality code standards.\nEnsured compliance with **GDPR regulations** while implementing encryption protocols to safeguard data privacy and enhance user trust.\nAdopted **DevOps** practices to streamline development workflows, incorporating CI/CD pipelines that reduced deployment times by **30%**.\nEngaged in **agile software development** methodologies, participating in sprint planning and daily stand-ups to foster team collaboration and maintain alignment with project goals.\nShowcased problem-solving skills to address complex technical challenges, leading to a **15%** reduction in bug reports through effective code quality measures and peer code reviews.\nDemonstrated a commitment to continuous learning and reflection, encouraging team members to embrace curiosity and stay updated with emerging technologies and best practices."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed and maintained secure backend services for trade execution utilizing **Elixir**, **Phoenix**, and **PostgreSQL** to enhance overall trading operations while ensuring **GDPR compliance**.\n• Designed responsive front-end applications using **LiveView**, **TailwindCSS**, and **daisyUI**, ensuring optimal user experience and adherence to data privacy standards.\n• Collaborated closely with cross-functional teams in an **agile software development** environment to deliver seamless integrations through REST APIs and WebSocket channels.\n• Engineered real-time data processing systems that achieve low latency, leveraging **asyncio**, **WebSockets**, and **Redis** to provide instant trading updates for high-frequency transactions.\n• Implemented rigorous code quality standards and comprehensive test suites using **PyTest**, ensuring the delivery of high-quality software and streamlining CI processes.\n• Introduced effective job queuing and scheduling mechanisms using **Celery** and **RabbitMQ**, improving backend task execution efficiency.\n• Championed best practices in **DevOps** and continuous integration, fostering team collaboration and enhancing problem-solving capabilities to deliver features on time with high code quality."
    }
  ],
  "skills": " **Programming Languages** \n\t Elixir, Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks** \n\t Phoenix, FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks** \n\t TailwindCSS, daisyUI\n\n **API Technologies** \n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions** \n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases** \n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps** \n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure** \n\t AWS, Azure\n\n **Other** \n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, GDPR compliance, encryption, data privacy, Shape Up, code quality, agile software development, team collaboration, problem-solving, communication, curiosity, reflection, learning"
}