{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Network Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Network Engineer with exceptional analytical and problem-solving skills, specializing in network architecture and troubleshooting. Proven expertise in managing and optimizing network performance for complex infrastructures, including proficiency with **TCP/IP**, **BGP**, **OSPF**, **EIGRP**, **VLANs**, **VPNs**, **firewalls**, **proxies**, and **load balancers**. Experienced in implementing and maintaining **SD-WAN** solutions, ensuring seamless connectivity and efficient data flow. \n\nLeveraging over 13 years of full stack development experience, skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**. Adept at building high-performance applications in both frontend and backend environments using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Knowledgeable in cloud-native deployments on **AWS** and **Azure**, as well as integrating AI/ML capabilities for enhanced network operations. Committed to compliance-driven development with understanding of industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented and managed **TCP/IP** networking protocols, ensuring seamless communication and data flow across systems.\n- Configured and optimized **VLANs** and **VPNs** for secure data transmission and network segmentation, enhancing security measures.\n- Led troubleshooting efforts in network disrupted scenarios, utilizing analytical skills to diagnose and resolve issues efficiently, achieving a resolution rate of 95% within **1 hour**.\n- Designed and maintained robust network architectures using **Aruba** and **Infoblox**, improving network performance by **30%**.\n- Deployed **SD-WAN** solutions integrating **VeloCloud** for enhanced connectivity and reduced latency across distributed networks, resulting in **25%** cost savings.\n- Configured and managed firewalls and proxies to protect network boundaries, achieving zero breaches in the past **12 months**.\n- Conducted a comprehensive analysis of **BGP**, **OSPF**, and **EIGRP** protocols to optimize routing strategies for enterprise-level clients, resulting in a **20%** increase in routing efficiency.\n- Developed disaster recovery plans leveraging load balancers, ensuring continuous availability with **99.99%** uptime.\n- Collaborated with cross-functional teams to develop advanced troubleshooting protocols, improving response time to incidents by **15%**.\n- Provided mentorship and training for junior engineers on network architecture principles and best practices in firewall and proxy management."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and implemented robust network configurations incorporating **TCP/IP**, **BGP**, **OSPF**, and **EIGRP** protocols to ensure optimal routing and connectivity for enterprise-level applications.\nEnhanced network security and performance by deploying **firewalls**, **proxies**, and **load balancers**, achieving a **99.9%** uptime across the network infrastructure.\nLed the migration to **SD-WAN** solutions providing scalable connectivity with reduced latency; decreased operational costs by **30%** via efficient bandwidth utilization and traffic management.\nConducted thorough troubleshooting and diagnostics on network issues, resolving **90%** of incidents within an hour, improving operational efficiency significantly.\nImplemented VLANs and VPNs for secure communication across remote sites, ensuring data integrity and compliance with regulatory standards.\nCollaborated on the integration of **Algosec** for security policy management, refining access controls and reducing unauthorized access incidents by **25%**.\nUtilized **Aruba** and **Infoblox** products to enhance network performance tracking and system management, leading to better resource allocation.\nEngaged in analytical assessments and problem-solving initiatives to optimize network performance, successfully enhancing throughput by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Demonstrated expertise in **troubleshooting** and **problem-solving** issues related to network configurations, ensuring optimal performance of e-commerce platforms similar to Aruba and Infoblox environments.\n- Applied **TCP/IP**, **BGP**, and **OSPF** protocols to enhance network stability and throughput across **load balancers** and **firewalls**, ensuring high availability for up to **100,000** concurrent users.\n- Designed and implemented **VPNs** and **VLANs** for secure data traffic segmentation, significantly reducing latency by **15%** during peak usage.\n- Configured and optimized **SD-WAN** solutions to ensure efficient connectivity and bandwidth management across multiple network routes, boosting network efficiency by **20%**.\n- Developed automated monitoring scripts for network traffic analysis and alerting, leading to a **30%** improvement in incident response times through better analytical approaches.\n- Collaborated with cross-functional teams to integrate **Algosec** for security policy management, allowing seamless network changes while ensuring compliance with industry standards.\n- Conducted regular network performance assessments and implemented improvements, contributing to enhanced user experiences and reliable service delivery on a global scale.\n- Provided mentorship and training to junior team members on networking best practices and troubleshooting techniques, fostering a culture of continuous improvement and knowledge sharing.\n- Engaged in rigorous testing and validation of network architecture designs utilizing **VeloCloud** technologies for enhanced cloud service deployments, resulting in a reduction of deployment times by **25%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tAruba\n\tInfoblox\n\tVeloCloud\n\tAlgosec\n\tTCP/IP\n\tBGP\n\tOSPF\n\tEIGRP\n\tVLANs\n\tVPNs\n\tfirewalls\n\tproxies\n\tload balancers\n\tSD-WAN\n\ttroubleshooting\n\tanalytical\n\tproblem-solving",
  "apply_company": "emagine"
}