{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior PHP Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior PHP Engineer with 13+ years of experience in high-performance application development. Highly skilled in **PHP**, with strong knowledge of **HTTP**, **RESTful APIs**, and **Web Infrastructure** principles. Expert in applying **OOP**, **SOLID**, and **Clean Code** principles, alongside proven experience with **Design Patterns** to deliver robust web solutions.\nSolid experience in building and securing web applications with a focus on **Web Security** and **Secure Coding** practices. Proficient in using **Docker** for containerization, enhancing deployment processes. A collaborative team player with proven mentorship skills, committed to fostering problem-solving and knowledge-sharing environments.\nAdditionally, adept in modern technologies such as **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Demonstrated ability to leverage cloud services including **AWS** and **Azure**, while implementing microservices and CI/CD pipelines in rapid development cycles. Strong background in compliance-driven development for healthcare and financial sectors, with a focus on regulatory standards like HIPAA, FHIR, and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented best practices in **Clean Code** and **SOLID** principles while developing robust and maintainable applications with **PHP** for web infrastructure.\nDesigned and developed secure **RESTful APIs** following **Web Security** guidelines to ensure data protection and secure coding practices across the stack.\nApplied object-oriented programming (**OOP**) concepts to enhance code reusability and scalability in complex projects, facilitating optimized team collaboration.\nUtilized **Docker** for containerization, streamlining deployment processes, and ensuring consistency across different development environments.\nMentored junior developers on **PHP** development and architecting patterns, fostering a culture of knowledge-sharing and continuous improvement within the team.\nDemonstrated strong problem-solving skills by addressing critical production issues, leading to a **30%** reduction in downtime through effective incident management and resolution strategies.\nCollaborated closely with cross-functional teams to drive projects forward, achieving a **15%** increase in project delivery speed by implementing Agile methodologies.\nEnsured code quality and integrity by defining and enforcing rigorous testing strategies that included unit tests and integration tests using PHP testing frameworks.\nParticipated in code reviews to uphold standards of **Design Patterns**, resulting in improved code quality and adherence to project requirements.\nDeveloped documentation to support internal and external use of the developed systems, enhancing user experience and facilitating technical onboarding processes."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented best practices in **OOP**, **SOLID** principles, and **Design Patterns** to enhance the code quality of financial applications during the modernization of core financial platforms.\nCollaborated with cross-functional teams to develop and maintain **RESTful APIs** and secure web infrastructure, ensuring compliance with **Web Security** standards and best practices at all application layers.\nMentored junior developers on clean coding practices and modern **PHP** frameworks, fostering a culture of continuous learning and improvement within the team.\nUtilized **Docker** to containerize applications for simplified deployment and scalability, achieving a **30%** reduction in deployment times and environment inconsistencies.\nEngaged in problem-solving sessions to troubleshoot and optimize application performance, contributing to a **50%** improvement in response times for high-volume transactional systems.\nFacilitated collaboration across teams to gather requirements and deliver solutions that align with business objectives, resulting in successful project completions on **time** and **under budget**.\nSpearheaded the integration of web services with **HTTP** protocols to enhance application interoperability and ensure seamless communication among systems."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained robust **PHP** applications using **Laravel** and leveraged **RESTful APIs** to enhance web infrastructure and improve application scalability.\nDesigned and implemented **HTTP** services adhering to **OOP**, **SOLID**, and **Clean Code** principles to ensure high-quality code and maintainable software solutions.\nUtilized **Docker** for containerization, streamlining development workflows and deploying applications in a consistent environment across **9** environments.\nApplied secure coding practices and web security measures to protect user data, reducing vulnerabilities in the application by **30%** through regular code reviews and security assessments.\nCollaborated with cross-functional teams to mentor junior developers, fostering a culture of continuous learning and improving team dynamics, thereby increasing team efficiency by **25%** in project delivery.\nEffectively utilized design patterns to simplify system architecture and enhance code reusability, contributing to a **15%** reduction in technical debt.\nParticipated in problem-solving sessions to troubleshoot and resolve critical issues, leveraging strong collaboration skills to maintain project timelines and achieve set objectives.\nEngaged in code reviews and pair programming to promote clean code practices within the team, enhancing overall code quality and developer productivity."
    }
  ],
  "skills": "**Programming Languages:**\n\tPHP\n\tPython\n\tJavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tHTTP\n\tRESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Other:**\n\tMLflow\n\tAirflow\n\tKubeflow\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tRedis\n\tOOP\n\tSOLID\n\tClean Code\n\tDesign Patterns\n\tWeb Security\n\tSecure Coding\n\tMentoring\n\tProblem-Solving\n\tCollaboration",
  "apply_company": "LastPass"
}