{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Sales Engineer with a strong ability to engage in customer consulting, market analysis, and proposal preparation, utilizing my solid teamwork and customer-focused approach. I possess exceptional communication and negotiation skills, ensuring successful interactions with clients. My background in electrical engineering complements my technical expertise, enabling me to bridge the gap between technology and client needs effectively.\nWith 8 years of experience in high-performance solution development, I leverage my knowledge of **JavaScript**, **TypeScript**, **Python**, and **Flutter** to consult on technology solutions that fit customer requirements. Proficient in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, I also have extensive experience with **Azure** and **AWS** cloud services, providing clients with robust, scalable solutions. My technical foundation supports my ability to convey complex concepts clearly to diverse audiences, fostering strong relationships that drive sales success.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Conducted in-depth customer consulting sessions to understand and analyze client needs within the healthcare and financial sectors, enhancing sales strategies that incorporate technical solutions.\n• Developed and maintained customer relationships through proactive communication and negotiation, leading to a **15%** increase in customer satisfaction and retention.\n• Collaborated with cross-functional teams to ensure smooth integration of technical solutions while providing insights on market analysis and product positioning.\n• Leveraged **MS Office** tools to create compelling proposal documentation that articulated complex technology solutions for clients, effectively showcasing product benefits.\n• Utilized **CRM** systems to track sales metrics and optimize the customer management process, achieving a **20%** improvement in pipeline visibility.\n• Prepared and delivered engaging presentations to clients, explaining technical architecture and integration strategies for solutions based on **TypeScript**, **Python**, and cloud services.\n• Demonstrated strong teamwork by collaborating with engineering and product development teams to tailor solutions that meet market and customer demands, leading to a **30%** faster go-to-market timeline.\n• Provided expert guidance on the integration of healthcare and financial technologies into client operations, increasing operational efficiency and compliance with industry standards.\n• Maintained clear and effective communication with stakeholders to ensure alignment of project goals and customer requirements, resulting in a **10%** growth in sales figures.\n• Conducted training sessions for sales teams on technical products, enhancing their capability to address customer inquiries with confidence and clarity."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained customer relationships, leveraging effective **communication** and **negotiation** skills to ensure client satisfaction and retention.\nConducted **market analysis** to identify customer needs and tailored solutions in collaboration with the engineering team, showcasing **customer focus** through targeted proposals and presentations.\nUtilized **CRM** software to track customer interactions, manage sales pipelines, and prepare detailed **proposal preparation** documents, enhancing customer engagement and sales performance.\nCollaborated with cross-functional teams, emphasizing **teamwork** to achieve sales targets and drive revenue growth by creating synergistic partnerships.\nProvided ongoing technical support and customer consulting services, demonstrating expertise in **electrical engineering** principles to solve complex problems and deliver tailored solutions.\nLeveraged **MS Office** tools to produce persuasive sales materials, reports, and presentations that effectively communicated progress and strategy to stakeholders.\nUtilized strong **sales** skills to close deals, increasing revenue by **30%** over **12 months** through strategic outreach and customer engagement initiatives.\nTrained and mentored junior sales team members in effective sales tactics and customer consulting techniques, enhancing overall team performance and productivity.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized CRM tools to track and analyze customer interactions, enhancing sales processes and providing tailored solutions to meet customer needs.\nConducted market analysis to identify opportunities for sales growth, leveraging insights to inform proposal preparation and negotiation strategies.\nFostered effective communication and teamwork across departments to strengthen customer consulting efforts, ensuring alignment between technical capabilities and client requirements.\nDeveloped and presented detailed sales proposals, utilizing MS Office to create compelling documentation that highlights product benefits and solutions for clients.\nEmployed strong negotiation tactics to close sales deals, achieving a **15%** increase in annual revenue through strategic engagement with key stakeholders.\nFocused on customer satisfaction by delivering responsive support and advanced solutions, leading to a **20%** improvement in customer retention rates.\nCollaborated with electrical engineering teams to bridge the gap between technical jargon and client needs, enhancing the overall customer experience and confidence in our products.\nOversaw the implementation of technology-driven sales initiatives, achieving an increase in lead generation through innovative customer consulting practices.\nStreamlined internal processes to improve sales team efficiency, enabling a proactive approach to address customer needs and drive overall sales performance.\nDemonstrated strong customer focus and commitment to understanding client challenges, consistently adapting strategies to provide tailored engineering solutions."
    }
  ],
  "skills": " **Sales & Consulting**:\n\tcustomer consulting, sales, customer focus, negotiation, communication, teamwork, proposal preparation, market analysis\n\n **Programming Languages**:\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks**:\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks**:\n\tReact, Vue, Angular\n\n **API Technologies**:\n\t\n\n **Serverless and Cloud Functions**:\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases**:\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure**:\n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Other**:\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Personalberatung Rochus Mummert"
}