{
  "name": "Tomasz Lee",
  "role_name": "R&D Senior Software Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven R&D Senior Software Developer with 9+ years of experience in creating, developing, and deploying complex applications. Proficient in **Kubernetes**, **Docker**, **Terraform**, and **AzureDevOps**, with a solid background in **Linux** environments. Expertise in building microservices architectures and distributed systems utilizing **RabbitMQ** alongside a tech stack featuring **Postgres** for database management and **Keycloak** for identity management. Highly skilled in frontend technologies such as **ReactJS** and **NextJS**, as well as backend frameworks including **.NET** and **C#**. Recognized for delivering scalable solutions, enhancing development workflows, and optimizing application performance while leveraging AI tools. Demonstrated ability to collaborate effectively across diverse teams and successfully lead development projects to completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "R&D Senior Software Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Docker** and **Kubernetes** for container orchestration, improving deployment efficiency across **Azure DevOps** environments.\nEmployed **Terraform** for infrastructure as code, reducing provisioning time by **50%** and enhancing consistency across development and production.\nLeveraged **Linux** systems for server management, enhancing performance and security measures in production.\nIntegrated **RabbitMQ** for efficient message queuing, improving communication between services and reducing latency by **30%**.\nImplemented monitoring solutions using **Grafana** and **LOKI**, enabling real-time insights and proactive system maintenance.\nDesigned and developed a web-based customer management platform using **.NET 7** and **ReactJS**, improving user satisfaction by **25%**.\nIntegrated **Apache Kafka** for real-time data streaming, resulting in improved system resilience and throughput.\nUtilized **Redis** for caching frequently accessed data, reducing database load and improving response times by **35%**.\nDeveloped RESTful APIs with **.NET**, integrated with a **Postgres** database to provide seamless data access for various services.\nImplemented CI/CD pipelines on **Azure DevOps**, reducing deployment time by **40%**.\nOptimized **MSSQL** database queries and indexing, reducing average query execution time by **20%**.\nCollaborated with UX/UI designers to enhance the platform’s user interface, leading to an improved user experience.\nDeveloped a reporting engine using **D3.js** and **Three.js** for interactive data visualizations.\nImplemented **JWT**-based authentication and authorization for securing the application."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Kubernetes** and **Docker** to deploy and manage cloud-based project management tools, optimizing container orchestration and configuration management.\nImplemented **Terraform** for infrastructure as code, enhancing deployment efficiency by 40% through automation in the Azure cloud environment.\nDeveloped microservices using **RabbitMQ** for task orchestration and integrated with **Postgres** for data handling, improving reliability and scalability across applications.\nEngineered automated CI/CD pipelines in **AzureDevOps**, resulting in a 30% reduction in deployment errors and improving release cycles.\nManaged data storage solutions leveraging **Postgres** and **Keycloak** for user authentication and data management, leading to a 25% improvement in performance through optimized queries.\nCreated dynamic charting solutions with **D3.js** for real-time project tracking and reporting, contributing to enhanced user engagement by 25%.\nConducted regular code reviews and developer mentorship, fostering a collaborative environment that improved productivity metrics by 15%.\nDeveloped client-side applications using **ReactJS** and **Tailwind CSS** for a responsive user interface, contributing to positive user feedback and increased platform usage.\nImplemented system monitoring and logging solutions using **Grafana** and **LOKI**, enhancing operational visibility and troubleshooting capabilities for the development teams.\nUtilized **Linux** command-line tools and **Powershell** scripting for system administration tasks to optimize the development workflow."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Kubernetes** for container orchestration to streamline application deployment, achieving a reduction in deployment time by **30%**.\nEmployed **Terraform** for infrastructure as code, resulting in more consistent environments and deployment processes across multiple projects.\nImplemented monitoring solutions using **Grafana** and **LOKI** to ensure system reliability and performance, improving issue detection by **25%**.\nLeveraged **Docker** to create isolated development environments which enhanced collaboration across cross-functional teams, leading to a **15%** decrease in environment-related issues.\nManaged PostgreSQL databases, optimizing query performance that reduced data retrieval times by **40%**.\nIntegrated **RabbitMQ** to facilitate asynchronous communication between microservices, improving real-time processing capabilities for customer notifications.\nExecuted CI/CD pipelines using **Azure DevOps** to ensure smooth and efficient code integration and delivery, enhancing deployment frequency.\nDeveloped scripts in **Powershell** and **Bash** to automate routine tasks, resulting in overall time savings of **10 hours per week**.\nUtilized **Keycloak** for identity management solutions, ensuring secure access control for all applications, especially in multitenant environments.\nCollaborated with cross-functional teams to adopt AI tools for enhancing data analytics capabilities, increasing decision-making speed by **20%**.\nParticipated in regular code reviews and technical documentation efforts to uphold coding standards across projects."
    }
  ],
  "skills": "  **Programming Languages**\n\tJavaScript, TypeScript, C#, Python, Solidity\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines, Docker, Kubernetes, Kustomize, Terraform, AzureDevOps, Powershell, Bash\n\n  **Cloud & Infrastructure**\n\tGrafana, LOKI, RabbitMQ\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, AI tools"
}