{
  "name": "Andrzej Ito",
  "role_name": "Talent Lead",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Talent Lead, I excel in **full-cycle recruiting**, **talent acquisition**, and implementing **structured hiring systems**. With over 9 years of experience, I leverage **data-driven decision making** to optimize **candidate experience** and enhance **performance metrics**. My expertise includes **sourcing techniques** and **ATS best practices**, ensuring a streamlined hiring process in **high-growth environments**. I foster strong **stakeholder partnerships** through effective **communication skills** and a commitment to **process improvement**. Additionally, I possess integrity and curiosity, with a proven ability to hire across engineering and AI sectors, including **executive hiring**. My familiarity with **EU/UK and US hiring practices**, combined with experience with **Ashby**, enables me to drive technical excellence and diversity in recruitment.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Talent Lead",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Implement full-cycle recruiting strategies to source and hire top talent across engineering & AI roles, ensuring a seamless candidate experience.\n• Utilize data-driven decision making to enhance the effectiveness of talent acquisition efforts and measure performance metrics.\n• Collaborate with stakeholders to develop structured hiring systems, maintaining integrity throughout the recruitment process.\n• Employ advanced sourcing techniques to discover candidates that align with organizational needs, including expertise in **ATS best practices**.\n• Focus on improving processes through continuous evaluation and innovation, especially in high-growth environments.\n• Foster strong communication skills to effectively articulate job roles and expectations to candidates and stakeholders alike.\n• Leverage technology tools to streamline recruiting processes, with familiarity regarding **Ashby** for talent management.\n• Navigate EU/UK and US hiring practices to ensure compliance and effectiveness in diverse hiring efforts.\n• Partner with teams to advance executive hiring initiatives, utilizing a comprehensive overview of the talent landscape."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Led **full-cycle recruiting** efforts, ensuring a strong **candidate experience** throughout the hiring process for technical roles across **engineering & AI** sectors.\n• Implemented **structured hiring systems** leveraging **data-driven decision making** to enhance talent acquisition strategies.\n• Sourced and engaged with candidates using innovative **sourcing techniques**, achieving a **35%** increase in qualified applicants in **Q2 2023**.\n• Partnered with stakeholders to refine recruiting practices, aligning objectives with organizational needs, resulting in a **20%** reduction in time-to-fill for key positions.\n• Developed and maintained **performance metrics** to evaluate recruiting effectiveness and ensure alignment with business goals.\n• Championed the use of **ATS best practices** to streamline recruiting processes, enhancing team efficiency by **15%** through optimized workflows.\n• Fostered a culture of **integrity** and **curiosity**, encouraging team members to continuously seek process improvement.\n• Navigated **high-growth environments** by adapting recruitment strategies to suit **EU/UK and US hiring practices**, successfully filling **9** executive-level roles in **2023**.\n• Utilized tools like **Ashby** to enhance the efficiency of recruiting processes, contributing to better candidate assessments and hiring outcomes.\n• Maintained clear and open communication with candidates and team members, ensuring transparency and collaboration at all stages of the recruitment process."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2024",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Managed full-cycle recruiting processes, ensuring a structured hiring system that emphasizes candidate experience and ATS best practices.\n• Leveraged data-driven decision making to enhance performance metrics and improve sourcing techniques, achieving a **25%** increase in qualified candidate pipelines.\n• Established strong stakeholder partnerships, facilitating effective communication and collaboration in high-growth environments.\n• Championed process improvement initiatives, reducing time-to-fill by **30%** while maintaining integrity throughout the hiring process.\n• Applied curiosity to stay informed about the latest talent acquisition trends, including familiarity with EU/UK and US hiring practices.\n• Executed executive hiring across engineering & AI sectors, ensuring alignment with organizational goals and culture fit.\n• Implemented hiring strategies using Ashby to optimize talent acquisition processes across diverse teams."
    }
  ],
  "skills": " **API Technologies** \n\t SOAP, REST APIs \n\n **Backend Frameworks** \n\t Spring, Spring Boot, Hibernate, Struts, JPA \n\n **Databases** \n\t MS SQL Server, Oracle, MongoDB, PostgreSQL, Redis, SQL, PLSQL \n\n **Frontend Frameworks** \n\t React, Vue, Angular \n\n **Other** \n\t Java, C++, C#, Python, Kotlin, Node.js, Microservices, SOLID, DRY, LINQ \n\n **Cloud & Infrastructure** \n\t Rabbit MQ \n\n **DevOps** \n\t (No current relevant skills) \n\n **Serverless and Cloud Functions** \n\t (No current relevant skills) \n\n **Job-related Skills** \n\t full-cycle recruiting, talent acquisition, data-driven decision making, structured hiring systems, candidate experience, ATS best practices, sourcing techniques, performance metrics, stakeholder partnership, communication skills, process improvement, integrity, curiosity, high-growth environments, experience with Ashby, hiring across engineering & AI, executive hiring, familiarity with EU/UK and US hiring practices"
}