{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Java Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Experienced Java Developer with 13+ years in delivering high-performance applications, particularly adept in **Java**, **Spring**, and **Microservices** architecture. Proficient in **AWS**, **Docker**, **Kubernetes**, **Terraform**, and **MongoDB**, with proven skills in developing and deploying cloud-native applications. Capable of building and integrating **RESTful APIs** and managing **CI/CD** pipelines, I excel in Agile environments that foster strong communication and team collaboration.\nIn addition to my Java expertise, I have hands-on experience in **Python**, **JavaScript**, and building robust solutions using modern frameworks. My background also includes developing AI/ML-powered platforms and implementing compliance-driven development to align with industry standards. I am committed to delivering scalable and efficient applications while enhancing team synergy and collaboration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Java Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Spring** frameworks to develop and maintain efficient and scalable microservices architecture, enhancing system performance by **30%**.\nImplemented and managed CI/CD pipelines using **GitLab** to automate deployment processes, achieving **95%** deployment success rate.\nLeveraged **AWS** for cloud services, including **Docker** and **Kubernetes**, to orchestrate containerized applications with high availability and scalability across multiple environments.\nCreated and maintained RESTful APIs for seamless service integration, improving data exchange efficiency by **40%**.\nCollaborated with cross-functional teams in an **Agile** environment, fostering strong communication to deliver quality software solutions on time.\nDesigned and documented system architectures, ensuring compliance with industry standards while enhancing maintainability of codes by **20%**.\nParticipated in the migration of legacy systems to microservices, deploying **Terraform** for infrastructure as code, which simplified resource management.\nEngaged in continuous improvement initiatives, resulting in a **15%** reduction in processing times and improved code quality through refined testing strategies.\nMaintained databases using **MongoDB** with a focus on optimizing queries for better performance in data retrieval processes.\nCommunicated effectively with stakeholders to gather requirements, define project goals, and achieve alignment across development efforts."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed and maintained **RESTful APIs** using **Java** and **Spring**, ensuring high performance and responsiveness to requests from front-end applications.\nImplemented and optimized **microservices** architecture on **AWS** platform to improve scalability, deploying with **Docker** and **Kubernetes** to manage container orchestration and maintain service availability.\nCollaborated with cross-functional teams in an **Agile** environment to ensure effective communication and strong team collaboration, leading to successful project deliveries within **3 months**.\nUtilized **MongoDB** for database management, optimizing queries and ensuring data integrity to support application functionality across multiple services.\nAutomated deployment processes using **CI/CD** pipelines with **GitLab**, resulting in a **40%** reduction in deployment time and minimizing downtime during releases.\nCreated and maintained infrastructure as code using **Terraform** and **Skaffold**, enabling reproducible environments and reducing configuration drift.\nDesigned and implemented robust logging and monitoring systems to track application performance and issues, improving overall system reliability by **25%**.\nSupported code reviews and provided mentorship to junior developers, enhancing team skillset and promoting best practices in coding and development."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed robust **Java** applications utilizing **Spring** framework in a microservices architecture, enhancing application modularity and scalability to accommodate **high-traffic** workloads.\nImplemented and optimized **RESTful APIs** that ensured seamless integration with front-end services and third-party platforms, achieving a **90%** efficiency in response times.\nCollaborated effectively within **Agile** teams, participating in daily stand-ups and sprint planning to align development efforts with project objectives, showcasing strong communication skills and team collaboration.\nLeveraged **AWS** for cloud deployment and resource management, ensuring **99.9%** uptime of applications while managing cost efficiency with **Terraform** for infrastructure as code.\nContainerized applications using **Docker** and orchestrated with **Kubernetes**, facilitating smoother deployments and rollbacks, while utilizing **Skaffold** for streamlined development workflow.\nEnhanced databases performance by integrating **MongoDB**, ensuring quick data access and reliability, while also collaborating on CI/CD pipelines within **GitLab** to automate testing and deployment processes.\nEngaged in team-led code reviews and shared knowledge sessions, fostering a culture of continuous improvement and adherence to coding standards, particularly in **Java** and **Python**.\nMonitored and optimized application performance continuously, resulting in a reduction of latency by **30%**, significantly boosting user experience and customer satisfaction.\n"
    }
  ],
  "skills": "Programming Languages:\n\tJava, Python, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB\n\n**DevOps:**\n\tDocker, Kubernetes, Skaffold, GitLab, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMicroservices, Agile, Strong communication skills, Team collaboration, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Redis"
}