{
  "name": "Patryk Zaslawski",
  "role_name": "Senior LLM Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Results-driven Senior LLM Engineer with 8+ years of software engineering expertise, focusing on advanced machine learning technologies and architecting scalable solutions. Proficient in **Python** for building robust applications, with hands-on experience in **AWS** and **Azure** cloud platforms. Skilled in utilizing **event-driven architectures** and implementing **streaming** solutions for real-time data processing. Knowledgeable in **observability** best practices to enhance system reliability and performance. Adept at working with **vector stores** and applying **advanced prompting** techniques for effective data handling and retrieval. Strong advocate for **team collaboration**, fostering a productive environment while delivering innovative solutions tailored to business strategies. My technical toolkit includes frontend frameworks such as Angular, Vue, React, and Next.js, along with backend frameworks like FastAPI, Django, and Flask, ensuring comprehensive expertise in full-stack development.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior LLM Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Python** to architect and develop advanced LLM models leveraging **cloud ML infrastructure** and **event-driven architectures** to optimize performance and scalability in healthcare applications.\nImplemented and managed **observability** tools ensuring real-time monitoring and performance tuning of LLM deployments, enhancing system reliability by **30%**.\nDeveloped integration pipelines using **AWS** and **Azure** services for seamless data flow and orchestration between healthcare data stores and machine learning environments.\nApplied methods of **streaming** data processing and **advanced prompting** techniques to enhance the interaction capabilities of LLMs, achieving exponential improvements in user engagement metrics by **50%**.\nOrchestrated multiple **multi-agent orchestrators** in **Python** for complex healthcare workflows, enabling real-time data sharing and decision-making across systems.\nOversaw the integration of **Vector Stores** for efficient data retrieval, significantly reducing query times and enhancing user experience in healthcare applications.\nMentored and collaborated with a cross-functional team of 10+ engineers to foster best practices in **Python**, building effective machine learning models and ensuring high-quality code through peer reviews.\nPioneered the use of **LLMs** paired with traditional machine learning techniques, resulting in a significant boost in accuracy for healthcare predictive analytics models.\nFacilitated workshops on event-driven architecture and **streaming** technologies to improve team collaboration and knowledge sharing across the engineering department.\nConducted performance testing and analysis using **observability** frameworks to ensure high throughput and low latency of deployed models, maintaining standards for scalability and reliability.\nImplemented CI/CD pipelines to automate model deployment, utilizing tools such as **Azure DevOps** and **GitHub Actions**, streamlining the release process and reducing deployment time by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **LLMs** to develop advanced language models, ensuring integration with **event-driven architectures** for real-time processing and responsiveness.\nLed the design and implementation of **RAG** (Retrieval-Augmented Generation) strategies utilizing **Vector Stores** to enhance model performance through effective data retrieval methods.\nCollaborated with cross-functional teams to deploy solutions on **AWS** and **Azure**, establishing a robust **cloud ML infrastructure** that supports machine learning workflows and scalability.\nEngineered algorithms that facilitate **streaming** data processing, improving the observability of model outputs and system performance.\nPlayed a pivotal role in enhancing **multi-agent orchestrators** for collaborative task execution among AI models, leading to an increase in operational efficiency by **30%**.\nImplemented advanced prompting techniques within machine learning frameworks to optimize user interactions and responses, resulting in a **25%** boost in user satisfaction metrics.\nDesigned systems for comprehensive logging and monitoring using observability tools, ensuring seamless tracking of AI model performance and transaction metrics over time.\nTook charge of developing and maintaining robust unit testing, static analysis, and CI/CD pipelines (using **Azure DevOps** and **GitHub Actions**), achieving automated quality assurance for deployed models.\nFacilitated team collaboration through consistent integration of feedback loops and agile practices, improving project delivery time by **20%** and ensuring adherence to technical standards.\nEngaged in knowledge sharing and mentorship to elevate the team's expertise in **machine learning** and modern technology trends within the organization."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and optimized LLM-based applications leveraging **Python** to enhance machine learning workflows and improve responsiveness across multiple services.\nIntegrated advanced prompting techniques and machine learning methodologies to effectively utilize **AWS** and **Azure** cloud ML infrastructure, ensuring optimal performance and scalability.\nDesigned event-driven architectures using message brokers such as RabbitMQ and Kafka to facilitate real-time data processing in multi-agent orchestrators, enhancing user interactions and system responsiveness.\nImplemented observability practices in Python-based applications using tools like Prometheus and Grafana, enabling proactive monitoring and swift troubleshooting of system performance and stability.\nUtilized **Vector Stores** to enhance data retrieval and storage for Large Language Models (LLMs) while improving query response times by **30%**.\nCollaborated with cross-functional teams to drive integration of advanced **streaming** solutions for data pipelines, improving overall system architecture and reducing latency in workflows.\nApplied techniques for Reinforcement Learning with Augmented Data (RAG) to optimize model training, significantly improving model accuracy by **25%** during testing phases.\nConducted performance testing and load simulations with tools like Apache JMeter and Locust, identifying key bottlenecks and optimizing Python services to handle peak loads of **1000+** concurrent users.\nFostered team collaboration by implementing Agile methodologies within the engineering team, achieving a **40%** reduction in deployment cycle time.\nDeveloped and maintained comprehensive documentation and best practices for leveraging LLMs and related technologies, enhancing team efficiency and knowledge sharing among peers."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython\n\n **Backend Frameworks:** \n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:** \n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:** \n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQLAlchemy\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:** \n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, cloud ML infrastructure\n\n **Other:** \n\tPydantic, Celery, event-driven architectures, streaming, observability, multi-agent orchestrators, advanced prompting, LLMs, RAG, team collaboration",
  "apply_company": "Trileuco Solutions"
}