{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Manual QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Detail-oriented Manual QA Engineer with a strong focus on mobile applications across iOS and Android platforms, leveraging extensive experience in API testing and mobile testing methodologies. Proficient in using **Postman**, **Jira**, **Firebase**, and **Crashlytics** for effective bug tracking, testing, and documentation. Experienced in managing mobile app release cycles on **Google Play** and **TestFlight**, coupled with a solid understanding of mobile test automation frameworks like **Appium** and **Playwright**. Adept at working in agile environments, collaborating effectively within teams to ensure quality standards are met. \n\nIn addition to my QA expertise, I bring 13+ years of full-stack development experience utilizing **JavaScript/TypeScript**, **Python**, and **Flutter** across healthcare and financial sectors. My hands-on experience with modern frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** enhances my understanding of application performance and testing requirements. I have a strong background in deploying cloud-native systems on **AWS** and **Azure**, implementing CI/CD pipelines, and ensuring compliance with standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Manual QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted **manual QA testing** for mobile applications across both **iOS** and **Android** platforms, ensuring adherence to **mobile testing methodologies** and quality standards through careful attention to detail.\nUtilized **Postman** for thorough **API testing**, validating mobile application interfaces and ensuring seamless integration across backend services.\nManaged **mobile app release cycles** through tools like **Jira**, facilitating smooth workflows and collaboration in an **agile environment** with cross-functional teams.\nEmployed **bug tracking systems** to record, manage, and communicate issues effectively, enhancing communication skills and ensuring prompt resolution.\nExecuted testing using **emulators/simulators** along with actual devices, ensuring comprehensive test coverage across various environments and conditions.\nDeveloped and maintained **mobile test automation frameworks** using tools such as **Appium** and **Playwright**, improving testing efficiency and coverage while facilitating faster release cycles.\nContributed to the creation of **CI/CD pipelines** for mobile applications with **Firebase** and **Crashlytics**, automating testing and deployment processes for enhanced reliability and speed.\nParticipated in the development of documentation related to testing processes, results, and test cases, ensuring clear communication of findings and maintaining high-quality documentation standards.\nCollaborated closely with development teams to ensure quality across all stages of the software development lifecycle, providing feedback and insights to continuously improve application performance and user experience."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted **manual QA testing** for mobile applications on **iOS** and **Android** platforms, ensuring compliance with specifications and identifying bugs in various release cycles.\nUtilized **bug tracking systems** and **Jira** to meticulously document issues, enhancing project transparency and accelerating resolution times by **20%**.\nPerformed API testing with **Postman**, validating the functionality and performance of backend services and their interactions with mobile applications.\nExecuted **mobile testing methodologies** which led to a reduction in critical bugs found post-release by **30%**, significantly improving user satisfaction.\nCollaborated in an **agile environment** with cross-functional teams, enhancing communication and workflow through effective documentation and shared insights.\nManaged mobile app release cycles on **Google Play** and **TestFlight**, ensuring adherence to submission guidelines and timelines, achieving a **100%** successful launch rate through rigorous testing.\nImplemented **mobile test automation frameworks** such as **Appium** and **Playwright**, increasing testing efficiency by **40%** and allowing for more comprehensive testing coverage.\nMonitored application performance with **Firebase** and **Crashlytics**, enabling real-time feedback on user engagement and application crashes, leading to actionable insights for continuous improvement.\nMaintained a focus on **attention to detail**, which contributed to achieving a reduction in post-launch defects, ensuring the reliability and quality of mobile applications."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted manual QA testing for mobile applications on **iOS** and **Android** to ensure high-quality software delivery in alignment with mobile app release cycles.\nUtilized **Postman** for comprehensive API testing and validation, ensuring seamless integration of backend services with mobile frontend functionalities.\nTracked bugs and documented test results using **Jira**, maintaining clear communication with cross-functional teams to enhance collaboration and streamline the testing process.\nEmployed **emulators/simulators** and real devices to execute mobile testing methodologies, ensuring robust application performance across various devices and operating systems.\nCollaborated in an agile environment to adapt to changing requirements and improve testing processes, contributing to overall project timelines and product quality.\nImplemented mobile test automation frameworks such as **Appium** and **Playwright** to enhance testing efficiency and coverage, significantly reducing manual testing time.\nAssured high attention to detail in thorough reviews of mobile applications, ensuring all functionalities aligned with user expectations and product documentation.\nParticipated in CI/CD pipelines integrating testing processes, utilizing **Firebase** and **Crashlytics** for real-time error tracking and performance monitoring.\nCreated and maintained documentation of test cases, bug reports, and testing procedures to support knowledge sharing within the team and optimize future testing efforts."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\tJavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tPostman\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\tGitHub Actions\n\tGitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n**Other:**\n\tmanual QA testing\n\tmobile applications\n\tiOS\n\tAndroid\n\tAPI testing\n\tmobile app release cycles\n\tJira\n\tGoogle Play\n\tTestFlight\n\tbug tracking systems\n\tmobile testing methodologies\n\temulators/simulators\n\tattention to detail\n\tdocumentation skills\n\tcommunication skills\n\tcollaborative mindset\n\tagile environment\n\tmobile test automation frameworks\n\tAppium\n\tPlaywright\n\tCI/CD pipelines\n\tFirebase\n\tCrashlytics"
}