{
  "name": "Marcin Karol Kotlinski",
  "role_name": "AI Architect",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As an AI Architect with 8 years of experience, I excel in designing and implementing scalable AI solutions using technologies such as **Azure**, **Azure AI**, **Azure AI Foundry**, **Azure AI Search**, **C#**, **Python**, and **TypeScript**. My background in full-stack development enables me to effectively integrate AI capabilities using frameworks like **LangChain** and **Semantic Kernel** to create intelligent applications. I have extensive experience with **CI/CD** practices, ensuring seamless deployment and integration of AI models into existing systems.\nI bring significant expertise in **MLOps**, leveraging tools such as **Terraform**, **Bicep**, **Docker**, and **AKS** to automate provisioning and manage infrastructure as code. My strong foundation in building and deploying machine learning pipelines includes the use of platforms like **MLflow** and **Airflow**. Additionally, I am proficient in **Azure CLI** and **PowerShell**, which enhances my ability to manage cloud resources efficiently. I am committed to maintaining compliance with industry standards while delivering high-performance solutions tailored to the healthcare and financial sectors. My communication skills allow me to articulate complex concepts effectively, collaborating with stakeholders to drive innovation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "AI Architect",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **Azure** services including **Azure AI** and **Azure AI Search** to architect and develop advanced AI-driven solutions, enhancing client experiences through smart insights and predictive analytics.\nUtilized **CI/CD** best practices with **GitHub Actions**, deploying consistent and reliable updates across environments to ensure the high availability of systems and seamless integration of features.\nImplemented **MLOps** principles using **Azure** tools to facilitate continuous training and deployment of machine learning models, optimizing performance with **Python** and **C#** for various applications, including healthcare and financial predictive analytics.\nDeveloped robust infrastructure as code (IaC) using **Terraform** and **Bicep** to streamline deployments and automate resource provisioning in **Azure** and **Docker**.\nDesigned scalable architectures using **Docker** and **AKS**, ensuring the reliability and efficiency of developed solutions in cloud environments with fault tolerance and horizontal scaling capabilities.\nCollaborated effectively with cross-functional teams to integrate large language models (LLMs) and utilized frameworks like **LangChain** to implement sophisticated **RAG** (Retrieval-Augmented Generation) applications, improving data accessibility and interaction.\nLed the development and deployment of end-user applications that leverage **Azure AI** features for enhanced decision-making processes and intelligent insights within healthcare and financial sectors.\nEnsured compliance with data governance frameworks while designing architectures that effectively manage structured and unstructured data.\nEstablished testing frameworks utilizing **Postman** and other tools to ensure integrity, performance, and reliability across services, contributing to over **99% uptime** of deployed applications.\nEnhanced communication through effective documentation and stakeholder engagement, delivering clear and consistent updates on project progress and AI advancements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Designed and implemented AI/ML solutions leveraging **Azure Machine Learning**, **scikit-learn**, and **XGBoost** to develop sophisticated fraud detection systems that analyze transaction patterns, improving security measures for financial systems.\n• Developed and maintained **CI/CD** pipelines using **GitHub Actions** and **Terraform**, enhancing deployment efficiency and automating infrastructure management for AI and analytics applications.\n• Architected microservices and event-driven architecture using **Python** (FastAPI, Django) and **Node.js** (NestJS/Express), ensuring high scalability and maintainability for applications handling over **1 million** transactions daily.\n• Employed **Docker** and **AKS** for containerization and orchestration of applications, ensuring consistent environments and streamlined deployment processes across development and production.\n• Built real-time analytics dashboards with **React** (18), **D3.js**, and **Power BI Embedded**, enabling stakeholders to visualize and interpret transaction data effectively, with a reporting frequency of less than **1 hour**.\n• Integrated **Azure AI Search**, **Azure Service Bus**, and **RabbitMQ** for efficient data flow and event processing in applications, supporting real-time alerts and compliance workflows.\n• Engaged in advanced algorithm design using **LangChain** and **Semantic Kernel**, enhancing the capabilities of decision-making systems in the financial sector by integrating **Large Language Models (LLMs)** for better context understanding.\n• Implemented Infrastructure as Code (**IaC**) solutions using **Bicep** and **Azure CLI**, establishing baseline configurations for cloud environments to ensure rapid and repeatable deployments across multiple projects.\n• Fostered clear and effective **English communication** across cross-functional teams, ensuring that project requirements and updates are thoroughly understood and executed correctly."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Azure** cloud services and **Azure AI** to design and implement scalable AI-driven solutions, optimizing workflows for high-availability AI functionalities.\nEngineered AI/ML-based applications utilizing **Azure AI Foundry**, **TensorFlow**, and **scikit-learn**, enhancing product recommendations and dynamic customer interactions with real-time behaviors, improving conversion rates by over **30%**.\nDeveloped machine learning models using **LLMs**, **LangChain**, and **RAG** methodologies, applying techniques that increased processing efficiency and reduced latency in AI functions by **25%**.\nCreated and optimized infrastructure as code (IaC) using **Terraform** and **Bicep**, facilitating seamless deployment and scalability of AI applications, striving for optimal performance across all modules.\nCultivated CI/CD pipelines using **GitHub Actions** to ensure smooth deployment of AI features, reducing release times by **40%** and allowing for quick iterations and updates.\nApplied containerization with **Docker** and orchestration through **AKS**, ensuring the robustness and reliability of AI applications in a microservices architecture environment.\nUtilized **C#**, **Python**, and **TypeScript** to code backend logic and integrate AI capabilities with existing systems, ensuring secure interaction and functionality across platforms.\nExecuted rigorous testing and optimization of AI workflows using tools such as **Postman** and **Visual Studio**, leading to a **15%** improvement in performance metrics.\nImplemented monitoring and logging of AI services to maintain high levels of service reliability and performance using **PowerShell** and **Azure CLI** to automate tasks efficiently.\nConducted collaborative project discussions in English to align development activities with strategic business objectives, establishing clear communication and stakeholder engagement."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript, C#\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tPostman\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Azure AI, Azure AI Foundry, Azure AI Search, Azure CLI, PowerShell, GitHub Copilot\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose, Bicep, AKS, IaC\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), LLMs, RAG, LangChain, Semantic Kernel, Nginx, Certbot, JWT, OAuth2, Keycloak (OIDC, RBAC), English communication, Visual Studio, Visio"
}