{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Python Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior Python Engineer with 13+ years of experience in developing high-performance applications, specializing in **Python**, **Django**, and **FastAPI**. Proficient in designing and implementing **REST APIs** and event-driven microservices, with hands-on experience in **AWS** for cloud deployment and scalability. Adept at integrating third-party tools and services, including **Salesforce integrations**. Proven ability to work in **Agile** environments using **Scrum** methodologies, fostering seamless teamwork and communication. Strong problem-solving skills and a data-driven approach to decision making, contributing to project success in compliance-driven sectors like healthcare and finance. Additionally skilled in **Flask**, **message queues**, and enhancing applications with robust back-end solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **Python** (FastAPI) to design and build scalable, event-driven microservices architectures, integrating with **AWS** for cloud deployment and management.\nDeveloped robust **REST APIs** to facilitate seamless communication between services, ensuring high performance and reliability.\nCollaborated with cross-functional teams in an **Agile** environment, applying **Scrum** methodologies to enhance teamwork and improve project delivery timelines by 30%.\nImplemented and maintained data-driven decision-making processes, utilizing **message queues** for enhanced service communication and responsiveness.\nCreated web applications following best practices using **Django**, ensuring compliance with industry standards and improving user engagement by 25%.\nManaged integrations with external systems, including **Salesforce**, facilitating enhanced data flow and operational efficiency for our clients.\nGuided problem-solving sessions to tackle technical challenges, fostering a culture of innovation and collaboration within the team.\nEngaged in code reviews and collaborative design sessions, sharing knowledge to uplift team capabilities and code quality by 40%.\nAutomated deployment processes via CI/CD pipelines leading to a reduction in release times from 2 weeks to 1 week, enhancing feature rollout to clients.\nUtilized teamwork and communication skills effectively in all phases of project development, ensuring alignment with stakeholders and timely project updates."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Django** to modernize core financial platforms by migrating to an event-driven microservices architecture, enhancing scalability and performance for high-volume transactional systems.\nImplemented **REST APIs** with **FastAPI** to ensure efficient communication between services, achieving a **30%** increase in transaction processing speed.\nCollaborated in an **Agile/Scrum** environment to deliver interactive front-end applications using **React (18)** and **TypeScript**, improving user engagement by **25%** and reducing load times.\nDesigned and deployed robust asynchronous communication through **message queues** with **Kafka** and **RabbitMQ**, streamlining workflows for payments and alerts, resulting in a **40%** decrease in system downtime.\nDeveloped ETL pipelines leveraging **Python**, **Apache Airflow**, and **Azure Data Factory**, enabling both batch and real-time data processing, increasing data availability for decision making by **35%**.\nEngaged in problem-solving and teamwork, leveraging **AWS** solutions to facilitate scalable data storage and processing while integrating systems for **Salesforce** applications.\nImplemented machine learning models for fraud detection using **scikit-learn** and **XGBoost**, proactively identifying suspicious activities based on patterns, reducing false negatives by **15%**.\nCreated ML pipelines for real-time applications like credit scoring and churn prediction, utilizing **MLflow** and **Airflow**, effectively integrating model inference into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized REST APIs using **Python** (specifically **Django** and **FastAPI**), ensuring implementation of **event driven microservices** architecture for enhanced scalability and performance in a high-traffic e-commerce environment.\nEngineered robust backend services adhering to **Agile** methodologies, contributing to **Scrum** ceremonies for effective sprint planning and execution, resulting in a **15%** increase in team productivity.\nUtilized **message queues** such as **Kafka** and **RabbitMQ** to create responsive systems for order processing and customer notifications, ensuring real-time data processing and reduced latency to under **200ms**.\nCollaborated on cross-functional teams to integrate **Salesforce** for streamlined Customer Relationship Management (CRM) workflows, improving customer engagement metrics by **30%**.\nDrove **data-driven decision making** by implementing analytics tools to monitor application performance and user interaction, leading to targeted optimizations that enhanced user satisfaction.\nLeveraged teamwork skills to mentor junior developers, improving code quality metrics and reducing bug rates by **25%** through pair programming and code reviews.\nApplied problem-solving strategies to troubleshoot complex issues in production, reducing downtime and maintaining availability above **99.9%** across critical backend services.\nIntegrated with **AWS** to enhance application's cloud infrastructure, utilizing services like **EC2** and **S3** for scalable storage and computation, achieving optimized resource usage and cost reduction by **20%**.\nEngaged in continuous learning and adoption of best practices in software development, keeping abreast of the latest changes in the Python ecosystem and contributing to a culture of innovation."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tDjango\n\tFastAPI\n\tFlask\n\n**API Technologies:**\n\tREST APIs\n\n**Serverless and Cloud Functions:**\n\tAWS\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Other:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\tMLflow\n\tAirflow\n\tKubeflow\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tevent driven microservices\n\tmessage queues\n\tSalesforce integrations\n\tAgile\n\tScrum\n\tteamwork\n\tproblem-solving\n\tdata-driven decision making"
}