{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cloud Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Cloud Engineer, I bring extensive expertise in **K8s**, **OpenShift**, **Terraform**, **GitOps**, **CI/CD**, and **GitLab** with a solid background in automation, reliability, and monitoring. Over 8 years of experience in full-stack development has equipped me with a keen understanding of deploying scalable, secure infrastructures and creating efficient CI/CD pipelines while ensuring compliance with industry standards. I have successfully leveraged **SUSE Rancher**, **ArgoCD**, and **HashiCorp** solutions to streamline operations and enhance collaboration across teams.\nMy experience in cloud environments, particularly using **Azure** and **AWS**, allows me to efficiently troubleshoot issues and implement robust, reliable cloud solutions. I am dedicated to maintaining operational excellence and fostering effective communication within teams.\nAdditionally, I have a proven track record of developing high-performance applications using **JavaScript/TypeScript**, **Python**, and **Flutter**, and implementing event-driven systems and microservices architecture, particularly in sectors such as healthcare and finance. My commitment to continuous improvement and innovation drives me to integrate advanced technologies and frameworks effectively.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **CI/CD** pipelines utilizing **GitLab**, **ArgoCD**, and **Terraform**, ensuring automation, reliability, and rapid deployment of cloud services and applications.\nUtilized container orchestration with **Kubernetes (K8s)** and **OpenShift** for developing scalable microservices architectures, enhancing system reliability and performance for cloud-native applications.\nFocused on collaboration and communication with cross-functional teams to troubleshoot and monitor systems, leading to a **25%** reduction in incident response time.\nDesigned automated monitoring solutions to ensure high availability and performance of cloud infrastructure, enabling a **30%** improvement in system reliability metrics.\nAutomated deployment processes using **HashiCorp** tools, creating infrastructure as code workflows that minimized manual monitoring and oversight.\nLed the integration of enterprise-level **GitOps** practices, enhancing collaboration and streamlined deployment management across multiple environments.\nEstablished best practices for troubleshooting and monitoring in cloud environments, achieving a **40%** increase in operational efficiency.\nConducted problem-solving workshops that improved team dedication and commitment to project timelines and objectives.\nCollaborated closely with development teams to implement **SUSE Rancher** for better management of clustered environments, resulting in reduced deployment times by **50%**.\nEngaged in regular communication with stakeholders and tech leads, ensuring alignment on project goals and fostering a culture of reliability and dedication in cloud migrations and architecture redesigns."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **Kubernetes (K8s)** and **OpenShift** to efficiently orchestrate and manage scalable microservices architecture for the financial platforms, enhancing reliability and consistency across deployment environments.\nImplemented **Terraform** for Infrastructure as Code (IaC), streamlining provisioning and management of cloud resources, ensuring repeatability and reducing deployment times by **30%**.\nUtilized **GitOps** methodologies with **GitLab** to automate CI/CD pipelines, improving deployment frequency and reducing defects in production by **25%**.\nCollaborated with cross-functional teams to troubleshoot and monitor system performance, utilizing **SUSE Rancher** for effective container management, enhancing system reliability and uptime to **99.9%**.\nExecuted automation strategies employing **ArgoCD**, facilitating continuous delivery of applications and reducing manual intervention significantly, leading to improved efficiency.\nEnhanced communication and collaboration processes within teams, ensuring alignment on project goals and technical strategies through dedicated meetings and documentation.\nDemonstrated dedication to improving system reliability by actively researching and implementing monitoring tools, increasing proactive issue resolution and minimizing downtime.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented CI/CD pipelines using **GitLab** and **ArgoCD** to automate deployment processes, achieving a deployment frequency increase of **20%** while ensuring reliability and efficiency in production environments.\nLeveraged **Terraform** for infrastructure as code, enabling rapid provisioning and management of cloud resources, thereby reducing setup time by **30%**.\nUtilized **Kubernetes (K8s)** and **OpenShift** for container orchestration, enhancing application scalability and facilitating seamless rollouts of updates across microservices.\nStreamlined monitoring and troubleshooting processes by integrating advanced monitoring tools, leading to a **15%** reduction in downtime through proactive issue resolution.\nEmployed **SUSE Rancher** for managing multiple clusters, ensuring consistent application performance and efficient resource allocation across different environments.\nFocused on automation practices to enhance reliability and reduce manual interventions, resulting in a **25%** improvement in operational efficiency.\nFostered collaboration across teams through effective communication strategies, emphasizing the importance of cross-functional teamwork in achieving project goals and maintaining dedicated support.\nApplied **HashiCorp** tools for secure environment configurations and secrets management, ensuring compliance and security of sensitive data throughout the operational lifecycle."
    }
  ],
  "skills": "  **Backend Frameworks:**\n\tPython(FastAPI, Flask, Django)\n\n  **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n  **API Technologies:**\n\n  **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n  **DevOps:**\n\tDocker, Kubernetes (K8s), GitHub Actions, GitLab CI/CD, OpenShift, GitOps, ArgoCD, SUSE Rancher, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\tAWS, Azure, Monitoring, Troubleshooting, Reliability\n\n  **Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\tCollaboration, Communication, Dedication, Automation",
  "apply_company": "Adfinis"
}