{
  "name": "Rei Taro",
  "role_name": "Senior Technical Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Technical Engineer with over 10 years of experience in delivering high-quality customer support and technical troubleshooting for SaaS applications. Proficient in managing and optimizing data workflows using **SQL** and tools like **Metabase** for data visualization. Skilled in leveraging project management platforms such as **JIRA** and **Linear** to enhance team coordination and product delivery. Experienced in support tools like **Zendesk** to ensure continuous customer satisfaction. Adept at integrating communication services using **Sendgrid** and optimizing operational processes through effective **Workforce Management**. Additionally, I bring extensive expertise in backend development, with a strong focus on financial platforms, AI/ML pipelines, and cloud-native architectures utilizing **Python** (FastAPI, Django, Flask) and cloud services like **AWS** and **Azure**. Proven track record of contributing to impactful projects at leading organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Technical Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Provided **Customer Support** and **Technical Troubleshooting** to resolve user issues effectively and efficiently.\nLeveraged **SaaS** applications to enhance service delivery and customer satisfaction, contributing to a **20%** increase in client retention.\nUtilized **SQL** for data extraction and analysis, generating reports that improved decision-making and operational strategies by **15%**.\nImplemented data visualization tools like **Metabase** to present actionable insights, improving report generation speed by **30%**.\nManaged customer inquiries through **Zendesk**, streamlining workflow and reducing response time to under **24 hours** on average.\nCollaborated with project management tools like **Linear** and **JIRA** to track tasks and ensure timely project delivery, maintaining an on-time delivery rate of **95%**.\nIntegrated **Sendgrid** for email communications, enhancing customer engagement metrics significantly.\nEmployed **Workforce Management** strategies to optimize team performance and resource allocation, leading to improved departmental productivity by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Provided **Customer Support** by troubleshooting technical issues and offering solutions to enhance user experience with SaaS products.\nUtilized **SQL** for data querying to assist in addressing customer inquiries efficiently and effectively.\nDeveloped and maintained internal reports in **Metabase** to track support metrics and improve service delivery, ensuring a 20% increase in response time over **6** months.\nLeveraged **Zendesk** for ticketing management, successfully resolving over **1,000** customer issues monthly while maintaining a customer satisfaction score above **95%**.\nCollaborated with product management tools such as **JIRA** and **Linear** to document and track technical issues, enhancing communication across teams for increased support efficiency.\nImplemented **Sendgrid** for effective communication and notifications related to ticket statuses, contributing to a **30%** reduction in follow-up inquiries.\nOptimized workforce management processes by developing strategies that reduced response times by **15%** and improved resource allocation through analytical insights."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Provided exceptional **Customer Support** by effectively resolving technical issues and ensuring user satisfaction with the platform.\nUtilized **Technical Troubleshooting** skills to diagnose and resolve backend issues in services, significantly improving system reliability.\nDeveloped and maintained **SaaS** solutions with a focus on user-friendly interfaces and streamlined engagement for clients using **REST APIs**.\nOptimized data access and management through **SQL** databases, ensuring high performance and scalability of trade execution services.\nCreated comprehensive dashboards and reports using **Metabase**, allowing stakeholders to gain insights into trading operations and performance metrics.\nManaged customer inquiries and support tickets through **Zendesk**, improving response times by **30%** and enhancing user experience.\nImplemented project management features using **JIRA** and **Linear**, ensuring efficient tracking of development tasks, resulting in a **20%** increase in team productivity.\nCoordinated communication and scheduled notifications with **Sendgrid**, facilitating timely updates to users about trading activities and account statuses.\nLed initiatives to improve **Workforce Management** processes, optimizing resource allocation and increasing operational efficiency by **15%**."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tGitHub Actions, Azure DevOps, CI/CD, Git\n\n **Cloud & Infrastructure**\n\t\n\n **Other**\n\tCustomer Support, Technical Troubleshooting, SaaS, Metabase, Zendesk, Linear, JIRA, Sendgrid, Workforce Management, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, PyTest",
  "apply_company": "Sona"
}