{
  "name": "Mariusz Jan Skobel",
  "role_name": "Back-end Programmer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Back-end Programmer with 10+ years of experience in developing robust software solutions. Proficient in **PHP**, **SQL**, **JavaScript**, **HTML**, **CSS**, and skilled in **APIs** design and integration. Strong understanding of **Object-Oriented Programming (OOP)**, **SOLID principles**, and **Design Patterns**, ensuring high-quality code maintenance and clarity. Experienced in **Version Control** and applying **Test-Driven Development (TDD)** and **Domain-Driven Design (DDD)** for effective software design. Proven ability to implement **Clean Architectures** to enhance scalability and maintainability of applications.\n\nWell-versed in building and deploying applications on cloud platforms like **Azure** and **AWS** with a focus on performance and security. Recognized for utilizing effective analytical and organizational skills, fostering teamwork through a proactive attitude and a good sense of humor. Known for leading cross-functional teams to deliver projects that create meaningful impacts in healthcare and finance sectors.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Back-end Programmer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and developed back-end solutions in **PHP** and **SQL** following **OOP**, **SOLID**, and **Design Patterns**, ensuring clean architecture and maintainable codebase.\n• Implemented robust RESTful **APIs** for seamless integration with front-end systems, optimizing performance and reliability.\n• Conducted **TDD** practices, employing unit and integration testing strategies to ensure code quality and functionality across all development stages.\n• Leveraged version control systems like Git, establishing workflows that promote collaboration and effective project management among team members.\n• Developed user-centric features using **HTML**, **CSS**, and **JavaScript**, focusing on enhancing the user experience within **WordPress** environments.\n• Led initiatives employing **DDD** principles to align software design with business objectives, promoting a clear understanding of domain logic.\n• Fostered strong teamwork and collaboration within the engineering team, emphasizing clear communication and a proactive attitude towards problem-solving.\n• Contributed to project documentation and knowledge sharing, enhancing organizational skills and improving project transparency and workflow efficiency.\n• Recognized for maintaining a good sense of humor, promoting a positive work environment while delivering high-quality back-end solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Developed and maintained APIs to facilitate seamless data exchange between front-end applications and financial platforms, utilizing **PHP** and **SQL** for robust functionality.\n- Employed Object-Oriented Programming (**OOP**), following **SOLID** principles and **Design Patterns** to create scalable and maintainable codebases, enhancing team productivity by **30%**.\n- Implemented **Version Control** practices using Git to manage code changes efficiently, improving collaboration and tracking versions effectively across the development team.\n- Conducted comprehensive testing (including **TDD** and **DDD**) to ensure robust application stability and performance, resulting in a **25%** decrease in production bugs.\n- Optimized front-end performance through effective use of **HTML**, **CSS**, and **JavaScript**, enhancing user experience in financial applications.\n- Integrated with WordPress for content management functionalities across platforms, supporting dynamic web applications to meet client needs.\n- Utilized strong analytical skills to troubleshoot and debug code, proactively addressing issues before they escalated, fostering a culture of **proactive attitude** and **good humor** within the team.\n- Collaborated with cross-functional teams to ensure cohesive project execution, leveraging **teamwork** to achieve project milestones and deadlines successfully."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed high-quality, maintainable code for backend services utilizing **PHP** while adhering to **SOLID** principles and **Design Patterns** to ensure code reliability and scalability.\nImplemented effective **APIs** for seamless integration with frontend systems, optimizing interactions and data flow while ensuring strong version control practices using **Git**.\nDesigned and maintained relational databases utilizing **SQL**, ensuring efficient data retrieval and storage for dynamic content through well-structured queries and properly normalized tables.\nEmployed **TDD** and **DDD** methodologies to enhance software design and support rigorous testing frameworks, improving overall product quality by achieving over **85% code coverage**.\nCollaborated closely with cross-functional teams, leveraging strong **Organizational Skills** and **Proactive Attitude** to drive project timelines and deliver functionality that met user requirements.\nParticipated in team code reviews and mentorship sessions, fostering a culture of teamwork and **Good Humor**, while promoting best practices in coding and development processes.\nBuilt responsive user interfaces with **HTML**, **CSS**, and **JavaScript**, enhancing customer engagement and optimizing performance metrics, achieving a page load time reduction of **30%**.\nUtilized **WordPress** for content-managed sites, streamlining setups for e-commerce solutions and increasing site deployment speed by **40%**.\nApplied **OOP** principles in all development tasks to maintain well-structured and extensible codebases, resulting in reduced bug rates and enhanced maintenance efficiency."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, JavaScript, TypeScript, PHP\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n  **API Technologies:**\n\tAPIs, OAuth2, JWT\n\n  **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services)\n\n  **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\tAWS, Azure\n\n  **Other:**\n\tOOP, SOLID, Design Patterns, TDD, DDD, Clean Architectures, Version Control, WordPress, Testing, MLflow, Airflow, Kubeflow, Analyttical Skills, Organizational Skills, Proactive Attitude, Teamwork, Good Humor"
}