{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Rust Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Rust Engineer with 13+ years of experience in full-stack development, specializing in building secure, high-performance applications within complex systems. Proficient in **Rust** programming, emphasizing secure system design and concurrent system architecture. Experienced in applying cryptography, asynchronous programming, and developing decentralized systems. Accomplished in integrating Web3 technologies, including **OAuth**, **OpenID**, and implementing **Decentralized Identity (DID)** and **Verifiable Credentials (VCs)**. \n\nSkilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in frontend frameworks such as **React**, **Next.js**, and **Vue**, alongside backend frameworks including **Node.js**, **FastAPI**, and **Django**. Demonstrated ability to deliver AI/ML-powered platforms for predictive analytics, real-time processing, and automation. Proficient in cloud-native deployments on **AWS** and **Azure**, leveraging microservices, event-driven architectures, and CI/CD methodologies.\n\nStrong adherence to compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2, coupled with a robust background in MLOps using tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Rust Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed secure, decentralized systems leveraging **Rust** to ensure top-tier performance and reliability in financial applications.\nEngineered smart contracts and implemented **blockchain** solutions for trustless transactions, enhancing overall system security and integrity.\nDesigned and optimized asynchronous programming methodologies to enhance application responsiveness and performance in concurrent environments.\nImplemented secure system design patterns, ensuring compliance with **Web3** standards and practices to facilitate decentralized identity management using **DID**, **OAuth**, and **OpenID**.\nLed the integration of secure multiparty computations to enhance data privacy for various financial transactions, promoting safer and more transparent operations.\nCollaborated in developing decentralized finance (DeFi) solutions that increased transaction efficiency and reduced operational costs.\nCreated high-performance **Node** software utilizing modern coding practices to ensure maintainability and scalability in the face of high user demand.\nParticipated in code reviews and developed comprehensive testing strategies to enforce secure practices and uphold system integrity across all deployed applications.\nStreamlined development processes through the adoption of version control configurations, increasing team productivity by **20%** over **6 months**.\nParticipated in community discussions and contributed to open-source projects in the **Rust** ecosystem, enhancing personal growth and industry knowledge.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and developed secure, decentralized systems using **Rust**, prioritizing **Secure System Design** and **Decentralized Identity (DID)** methodologies to ensure robust identity management and transaction verification.\nImplemented **Web3** technologies to enable blockchain interactions and smart contract deployments, enhancing financial applications' decentralization and trustworthiness.\nCrafted asynchronous programming solutions to handle high-throughput transaction processing seamlessly, leveraging concurrent system design principles for improved performance.\nDeveloped cryptographic solutions to ensure data integrity and user privacy in financial applications, incorporating best practices of **Cryptography**.\nIntegrated **OAuth** and **OpenID** protocols for secure user authentication, boosting system security and user trust.\nBuilt scalable Node software applications that interacted with blockchain networks, enabling efficient data processing and real-time analytics.\nEngaged in decentralized finance (DeFi) projects, exploring and implementing innovative financial solutions within the blockchain ecosystem.\nProduced thorough documentation and performed code reviews to maintain high-quality standards in the development of distributed systems and applications."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Rust** for developing high-performance, decentralized applications and services, ensuring secure system design and efficient execution across blockchain platforms.\nImplemented decentralized systems leveraging **Web3** protocols, enabling interactions with smart contracts and data on the blockchain while maintaining robust cryptographic practices.\nDeveloped scalable, asynchronous applications adopting **Asynchronous Programming** principles to enhance concurrent system performance and manage multiple tasks without blocking.\nEngineered secure multiparty computation methods to facilitate private data sharing and computation among multiple parties, reinforcing data security in compliance with cryptographic frameworks.\nApplied **OAuth** and **OpenID** protocols to establish secure authentication mechanisms for decentralized identity management, ensuring user privacy and control over personal data.\nCreated and integrated smart contracts for decentralized finance (**DeFi**) applications, enabling automated and secure transactions on the blockchain environment.\nContributed to the design and deployment of Verifiable Credentials (VCs) to support decentralized identity verification processes, improving trust in digital interactions.\nConducted rigorous testing and documentation of decentralized applications, adhering to version **1.0** guidelines and emphasizing security and compliance throughout the software lifecycle.\nCollaborated with cross-functional teams to gather requirements and deliver feature-rich applications that meet the needs of blockchain users, improving deployment efficiency by **20%** through agile methodologies.\nOptimized backend performance through concurrent system design, handling over **10,000** transactions per minute during peak loads while maintaining system integrity and availability."
    }
  ],
  "skills": "Programming Languages:\n\tRust, Python, JavaScript/TypeScript\n\nBackend Frameworks:\n\tFastAPI, Flask, Django\n\nFrontend Frameworks:\n\tReact, Vue, Angular\n\nAPI Technologies:\n\tOAuth, OpenID, Keycloak (OIDC, RBAC), JWT\n\nServerless and Cloud Functions:\n\tAWS: Lambda, Azure: App Services\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\nCloud & Infrastructure:\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\nOther:\n\tBlockchain, Decentralized Systems, Cryptography, Asynchronous Programming, Concurrent System Design, Secure System Design, Web3, Decentralized Identity (DID), Verifiable Credentials (VCs), Smart Contracts, Node Software Development, Secure Multiparty Computation, DeFi"
}