{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Electrical Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly motivated Senior Electrical Engineer with 8 years of experience, I bring a strong foundation in condition-based monitoring and predictive maintenance, essential for ensuring optimal performance of **HV motors**, **HV transformers**, and **HV switchgear** systems. My skills extend to **LV switchgear** and electrical drives, enabling the design and implementation of efficient solutions tailored for high-voltage applications. I excel in leveraging exceptional communication, interpersonal, and influencing skills to collaborate effectively with cross-functional teams, ensuring the successful delivery of projects with utmost responsibility.\nIn addition to my engineering expertise, I have a solid background in full-stack development, utilizing technologies like **JavaScript/TypeScript**, **Python**, and **Flutter** to create high-performance solutions. My experience includes building platforms leveraging %React%, %Next.js%, %Vue%, %Node.js%, %FastAPI%, and %Django%, coupled with cloud support in **Azure** and **AWS**. I have led initiatives that harness AI/ML capabilities for predictive analytics and real-time data processing while adhering to compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Electrical Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented condition-based monitoring and predictive maintenance strategies for **HV motors**, **HV transformers**, and **HV switchgear**, ensuring operational efficiency and reliability.\nLed the design and optimization of **LV switchgear** systems to accommodate electrical drives, achieving a 30% improvement in energy efficiency.\nCollaborated effectively with cross-functional teams to enhance communication channels, demonstrating strong interpersonal and influencing skills.\nDemonstrated self-motivation and responsibility by leading projects from conception through completion, resulting in a streamlined workflow that reduced project timelines by 25%.\nConducted comprehensive assessments of system performance, identifying areas for improvement and implementing changes that enhanced overall system robustness by **15%**.\nProvided training and mentorship to junior engineers, fostering a collaborative team environment that drove project success and individual development.\nRegularly interfaced with stakeholders to gather requirements and translate technical concepts into actionable plans, ensuring alignment with business objectives.\nUtilized advanced techniques in condition-based monitoring to drive predictive maintenance initiatives, reducing unplanned downtime by **40%** and optimizing maintenance schedules.\nEngineered innovative solutions for complex electrical issues, leveraging a thorough understanding of high voltage systems to address and resolve technical challenges efficiently.\nEstablished and maintained documentation protocols to track system modifications, compliance, and performance metrics, facilitating ongoing improvements and regulatory adherence."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized strong **communication skills** to effectively collaborate with cross-functional teams in the design and implementation of **HV motors**, **HV transformers**, and **HV switchgear**, ensuring project goals were met within **6 months** of initiation.\nEngineered condition-based monitoring systems to enhance the reliability and performance of **LV switchgear** installations, resulting in a **30%** reduction in maintenance costs through proactive identification of potential failures.\nImplemented predictive maintenance strategies for electrical drives, leveraging data insights to optimize maintenance schedules and improve efficiency by **20%**, thus extending equipment lifespan.\nDeveloped and maintained comprehensive documentation for system designs and interventions, fostering a culture of accountability and ensuring that information is accessible for future projects.\nDemonstrated **interpersonal skills** to mentor junior engineers, contributing to their professional growth and enhancing team synergy, with a positive impact on project delivery timelines.\nApplied influencing skills to advocate for innovative solutions in electrical drive designs, leading to a **15%** improvement in energy efficiency across multiple projects.\nMaintained a self-motivated approach to ongoing professional development, staying abreast of industry trends and technology advancements, specifically in high voltage systems and their applications."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied condition-based monitoring and predictive maintenance techniques for **HV motors**, **HV transformers**, and **HV switchgear**, ensuring optimal performance and prolonging equipment lifecycle.\nDesigned and implemented **LV switchgear** solutions tailored to project specifications, enhancing efficiency in electrical distribution systems.\nDemonstrated exceptional communication skills to collaborate effectively with cross-functional teams, ensuring seamless project execution and stakeholder satisfaction.\nUtilized strong interpersonal skills to influence project decisions, engaging stakeholders in discussions around electrical drive systems and maintenance strategies.\nSelf-motivated in managing responsibilities and delivering projects on time, while adhering to industry standards and safety regulations.\nDeveloped strategies for electrical drives that leverage advanced technologies, resulting in a **15%** increase in energy efficiency for high-performance applications.\nLed condition monitoring initiatives that reduced unplanned equipment downtime by **30%**, safeguarding production schedules and enhancing operational reliability.\nEngaged in continuous professional development to stay abreast of emerging technologies in electrical engineering, fostering innovative solutions in project delivery.\nInstrumental in mentoring junior engineers, enhancing their technical skills and promoting a collaborative team environment."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n  **API Technologies:**\n\t\n\n  **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n  **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n  **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, communication skills, interpersonal skills, influencing skills, self-motivated, responsibility, condition-based monitoring, predictive maintenance, HV motors, HV transformers, HV switchgear, LV switchgear, electrical drives",
  "apply_company": "Kintec Global Recruitment"
}