{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Performance Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Performance Engineer with 13+ years of experience specializing in high-performance application development in both healthcare and financial sectors. Proficient in **C/C++**, **LLVML** for performance optimization and leveraging parallel programming techniques including **SIMD** and **AVX512** to enhance application efficiency. Adept in both concurrent programming practices and version control systems like **Git** and **Mercurial**. \nFurther skilled in **Python** and **JavaScript**, with hands-on expertise in **React**, **Node.js**, and the latest development frameworks. Deep experience deploying solutions in **AWS** and **Azure**, including implementing microservices and CI/CD pipelines, with a strong focus on compliance-driven development in alignment with industry standards. A solid foundation in MLOps methodologies, facilitating AI/ML-powered applications through tools such as **MLflow** and **Airflow**, ensuring optimized model training and deployment.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Performance Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Employed **C/C++** with advanced **SIMD** and **AVX512** techniques for optimizing performance in high-demand systems, significantly improving processing speeds by up to **30%**.\n- Utilized **LLVM** to enhance code generation processes, ensuring efficient compilation and execution of applications across **Windows** and **Linux** environments.\n- Developed and implemented **parallel programming** and **concurrent programming** techniques to maximize CPU utilization on multi-core architectures, successfully reducing execution times of critical tasks by **25%**.\n- Implemented robust version control practices using **Git** and **Mercurial**, facilitating seamless collaboration and code management within the engineering team, maintaining a structured codebase over **12** active projects.\n- Leveraged expertise in **Python** and **JavaScript** to create performance testing tools, allowing for real-time monitoring of application efficiency and resource consumption across platforms.\n- Conducted detailed performance analysis and profiling of existing applications, leading to architecture improvements that enhanced overall system throughput by **15%**.\n- Collaborated with cross-functional teams to ensure performance considerations were integrated into design specifications from the outset, focusing on scalability and maintainability.\n- Mentored junior engineers in performance optimization techniques and best practices, fostering a culture of continuous improvement within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Enhanced performance of financial platforms by optimizing applications using **C/C++** and **Python**, achieving performance increases of up to **30%** through advanced parallel programming techniques.\nUtilized **Git** for version control to manage code across **Windows** and **Linux** environments, ensuring seamless collaboration and continuity of development processes with a success rate of **99%** commit integrity.\nImplemented SIMD and AVX512 instructions to accelerate algorithm execution times, improving computational efficiency for real-time analytics processing by up to **50%**.\nCollaborated with cross-functional teams to leverage **LLVM** for code optimization tasks, enhancing compilation times and runtime performance for critical modules.\nDesigned and executed robust concurrent programming solutions, enabling applications to process multiple transactions simultaneously, resulting in decreased response times and improved user experience.\nMentored junior engineers in the adoption of best coding practices and optimization techniques, fostering a culture of continuous improvement and technical excellence within the team.\nAnalyzed system performance metrics and identified bottlenecks, proposing and implementing enhancements that led to a **25%** reduction in system downtime."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C/C++** and **LLVM** to develop high-performance algorithms leveraging **SIMD** and **AVX512** instructions, significantly improving computational efficiency and processing speed by **30%**.\nImplemented parallel programming techniques across multiple platforms including **Windows** and **Linux**, enhancing application concurrency and throughput, resulting in a **25%** reduction in execution time for critical tasks.\nCollaborated with cross-functional teams utilizing **Git** and **Mercurial** for version control, streamlining the workflow and maintaining code integrity in a dynamic development environment.\nDesigned and optimized backend services using **Python** and **JavaScript**, focusing on high availability, low latency, and scalability across various modules, achieving a **99.9%** uptime.\nEngineered real-time features using event-driven architecture and frameworks ensuring responsive updates, contributing to improved user engagement.\nApplied best practices in secure coding and development processes to create reliable and maintainable code across several projects.\nConducted performance profiling and optimization, using advanced debugging techniques to identify bottlenecks and implement effective solutions, leading to enhanced system performance.\nDeployed containerized applications using **Kubernetes** and managed continuous integration and deployment processes, ensuring rapid and seamless updates to production environments."
    }
  ],
  "skills": "****Programming Languages****\n\tC/C++, Python, JavaScript, TypeScript\n\n****Backend Frameworks****\n\tFastAPI, Flask, Django\n\n****Frontend Frameworks****\n\tReact, Vue, Angular\n\n****API Technologies****\n\tOAuth2, JWT\n\n****Serverless and Cloud Functions****\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n****Databases****\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n****DevOps****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\tGit, Mercurial\n\n****Cloud & Infrastructure****\n\tTerraform, Ansible, Helm, Docker Compose\n\n****Other****\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot\n\tOperating Systems: Windows, Linux\n\tProgramming Concepts: SIMD, AVX512, parallel programming, concurrent programming",
  "apply_company": "AMD"
}