{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Electrical Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Electrical Engineer with 13+ years of multifaceted experience in high-voltage (HV) systems, including motors, transformers, and switchgear for predictive maintenance and condition-based monitoring. Adept in leveraging advanced problem-solving skills and communication to influence teams and drive project success. Proficient in developing strategies for HV motors, HV transformers, and protection relays, ensuring compliance with industry standards. \n\nAdditionally, a Full Stack Developer with expertise in **JavaScript/TypeScript**, **Python**, **Flutter**, and an extensive tech stack including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced with AI/ML implementations to enhance predictive analytics and automation capabilities. Hands-on experience with cloud-native deployments on **AWS** and **Azure**, along with microservices architecture and CI/CD pipelines. Proven ability to align development efforts with compliance frameworks like HIPAA, FHIR, PCI DSS, and SOC 2, alongside a strong MLOps background using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Electrical Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Applied expertise in **HV**, **electrical engineering**, and **predictive maintenance** to enhance system reliability and performance across high-voltage (HV) systems, including **HV motors**, **HV transformers**, and **HV switchgear**.\nDeveloped and implemented **condition-based monitoring** solutions to optimize maintenance schedules and minimize downtime, achieving a **20%** reduction in unplanned outages over **12 months**.\nCollaborated with cross-functional teams to ensure effective communication and interpersonal skills, effectively influencing project outcomes and timelines.\nEngineered protective solutions using **protection relays** to safeguard equipment from failures, improving system safety ratings by **15%**.\nIntegrated advanced monitoring systems and communication protocols to enhance data collection and reporting, resulting in improved operational visibility and decision-making.\nLed training sessions on **LV switchgear** technologies, enhancing team skills in handling complex electrical systems, and achieving **90%** satisfaction ratings from participants.\nExecuted project management methodologies to streamline workflows, reducing project completion times by **30%**, while maintaining rigorous adherence to safety standards.\nWorked on the development of strategic initiatives for long-term health of electrical systems, ensuring alignment with industry best practices and regulatory requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Applied advanced **electrical engineering** principles to optimize and design **HV motors**, **HV transformers**, and **HV switchgear** systems, achieving improvements in efficiency and reliability.\n- Implemented predictive maintenance strategies and **condition-based monitoring** techniques to enhance equipment longevity and minimize downtime, resulting in a **25% reduction** in maintenance costs.\n- Developed and executed comprehensive testing procedures for **LV switchgear** and **protection relays**, ensuring compliance with safety standards and achieving a **100% pass rate** during inspections.\n- Collaborated with cross-functional teams to enhance communication and interpersonal relationships, thereby facilitating project alignment and achieving a **15% faster** completion rate.\n- Utilized strong influencing skills to advocate for the adoption of innovative technologies, leading to the successful implementation of a new monitoring system that improved fault detection by **30%**.\n- Conducted regular training sessions for junior engineers on best practices in **HV** systems design and operational excellence, empowering the team and leading to a **20% increase** in project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied expertise in **HV** systems to design and implement electrical engineering solutions, focusing on predictive maintenance and condition-based monitoring for optimal performance.\nEngineered and maintained **HV motors**, **HV transformers**, and **HV switchgear**, ensuring efficiency and reliability across various projects, reducing maintenance costs by **20%**.\nConducted thorough inspections and diagnostics of **LV switchgear** and protection relays, enhancing safety and compliance with industry standards, achieving a **30%** decrease in operational faults.\nCollaborated with cross-functional teams to communicate complex electrical concepts effectively, leveraging strong interpersonal and influencing skills to drive project success.\nDeveloped and implemented maintenance schedules based on predictive analytics, increasing the lifespan of electrical equipment by **15%** and minimizing downtime.\nLed training sessions on condition-based monitoring techniques and strategies for team members, fostering a culture of innovation and continuous improvement within the department.\nUtilized advanced communication tools and methodologies to ensure seamless information flow and collaboration between engineers, stakeholders, and clients throughout project lifecycles."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\telectrical engineering, predictive maintenance, condition-based monitoring, HV motors, HV transformers, HV switchgear, LV switchgear, protection relays, communication, interpersonal, influencing",
  "apply_company": "Kintec Global Recruitment"
}