{
  "name": "Patryk Zaslawski",
  "role_name": "Senior AI Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a seasoned Senior AI Engineer with over 8 years in software engineering, I specialize in developing scalable and high-performance solutions utilizing **Python**, **Langchain**, **LlamaIndex**, **Streamlit**, **Gradio**, and **Docker**. My expertise includes implementing **DevOps** practices and **CI/CD** pipelines, ensuring efficient code deployment and infrastructure management. I am skilled in **prompt engineering** and leveraging generative AI technologies to enhance application functionality. Additionally, I am proficient in cloud services such as **AWS**, **Azure**, and **GCP**, and utilize **Git** for version control. My background also encompasses microservices architecture and REST/gRPC API development, enabling me to craft enterprise-grade solutions aligned with best practices for sectors like e-commerce, finance, and healthcare.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Python** with advanced libraries and frameworks, such as **Langchain** and **LlamaIndex**, to develop innovative solutions for AI-driven applications, enhancing user experience and engagement.\nDesigned and implemented **Docker** containerized applications to ensure seamless deployment, scalability, and consistency across various environments.\nExecuted **scalability** strategies in projects, leading to a **30%** improvement in application performance and responsiveness.\nDeveloped and maintained **CI/CD** pipelines using **Git**, **GitHub Actions**, and **Azure DevOps**, streamlining code integration and deployment processes.\nLeveraged **DevOps** principles to automate workflows, minimizing manual intervention and increasing operational efficiency by **20%**.\nEmployed **IaC** (Infrastructure as Code) using tools like **Terraform** to manage cloud infrastructure in **AWS**, **Azure**, and **GCP**, ensuring reliability and consistency during deployments.\nIncorporated **generative AI** techniques, enhancing products with features like user-driven content generation and automated insights based on user interactions.\nConducted prompt engineering to refine and optimize model outputs, boosting effectiveness in real-world applications by **25%**.\nMentored and guided junior engineers in **Python** programming and cloud-native designs, enhancing the team's technical breadth and skillset.\nCollaborated on cross-functional teams to architect solutions integrating AI services with cloud infrastructure, resulting in innovative healthcare solutions.\nDeveloped real-time data processing pipelines and visualization tools using **Streamlit** and **Gradio**, ensuring insights are accessible and actionable for end-users.\nEnhanced security and compliance measures in AI applications, aligning with industry standards like SOC 2 and HIPAA.\nSpearheaded projects that focused on leveraging **scalability**, ensuring solutions can handle growth while maintaining performance and reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** including frameworks like **FastAPI**, **Django**, and **Flask** to develop and migrate to scalable microservices-based backend architectures, enhancing maintainability and performance for AI-driven applications.\nImplemented **Docker** containers for seamless deployment of **Python** applications, ensuring scalability across multiple services and environments.\nDesigned and developed user-centric applications utilizing **Streamlit** and **Gradio** for showcasing AI models and increasing user engagement with real-time outputs.\nIntegrated **AWS**, **Azure**, and **GCP** cloud services for deploying machine learning models, optimizing operational costs by up to **30%** through serverless architectures.\nEstablished **CI/CD** pipelines using **GitHub Actions** and **Azure DevOps** for automating the deployment processes of **Python** applications based on **generative AI** techniques.\nEmployed **IaC** (Infrastructure as Code) strategies to manage infrastructure for AI solutions, ensuring quick and reliable provisioning of resources across cloud platforms.\nConducted prompt engineering with **LLM** (Large Language Models) and leveraged tools such as **Langchain** and **LlamaIndex** to optimize model performance and user interactions.\nDeveloped and maintained high-performance applications with robust data processing capabilities, supporting scalability needs that accommodate up to **100,000** requests per minute.\nMaintained high standards of software quality through rigorous automated testing and integration processes, ensuring reliability in every deployment.\nCollaborated with cross-functional teams to integrate machine learning models into existing systems, facilitating a **25%** increase in processing speed across applications.\nUtilized **Git** for version control, ensuring code integrity and facilitating seamless collaboration among project members in a fast-paced environment."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Leveraged **Python** along with **LLM**, **Langchain**, and **LlamaIndex** to enhance AI model integrations, focusing on generative AI applications to drive innovative solutions.\nDesigned and optimized scalable backends using **Docker** for containerized deployments, ensuring streamlined operations across development and production environments.\nImplemented robust CI/CD pipelines utilizing **Git** and **Azure** DevOps, automating build, test, and deployment processes to achieve a deployment frequency of **20+ releases/month**.\nApplied extensive knowledge in **scalability** to architect AI-driven modules that effectively handle high volumes of data and user requests, targeting response times under **200ms**.\nConducted prompt engineering with **Streamlit** and **Gradio** for creating interactive user interfaces, enhancing user experience through efficient interactions with AI models.\nDeveloped and integrated Python-based microservices that utilize event-driven architecture with **RabbitMQ** and **Kafka**, effectively managing workflows for real-time data processing.\nAutomated testing and monitoring of applications using **IaC** practices to ensure system reliability, maintaining an uptime of **99.9%**.\nUtilized cloud services on **AWS**, **Azure**, and **GCP** to deploy AI solutions, optimizing resource allocation based on predictive scaling strategies.\nImplemented and monitored performance analytics using observability tools, ensuring consistent behavior and enhancing user satisfaction through iterative improvements.\nConducted load testing simulations on applications, successfully managing peak user loads by improving system throughput by **25%** through optimized resource handling and AI-driven predictions."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services), GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQLAlchemy\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, IaC, CI/CD, scalability, DevOps\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tPydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, LLM, Langchain, LlamaIndex, Streamlit, Gradio, Prompt Engineering, generative AI, Git",
  "apply_company": "dLocal"
}