{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a focused Senior Backend Engineer, I bring 8 years of experience in developing high-performance backend solutions, leveraging my expertise in **Kotlin**, **Ktor**, **Kafka**, **PostgreSQL**, and **Docker**. My capabilities encompass robust API design and event-driven architecture to ensure scalable and efficient systems. Additionally, I have a strong background in cloud services, particularly with **Google Cloud Platform**, enhancing application deployment and management. \nMy original strengths lie in problem-solving and teamwork, where I have successfully led cross-functional teams to deliver enterprise-grade platforms in the healthcare and financial sectors. I am also experienced in integrating AI coding tools and implementing messaging patterns to enhance functionality and operational efficiency. Fluent in both **German** and **English**, I am known for my initiative and collaboration skills in fast-paced development environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Kotlin** and **Ktor** to architect and develop robust backend services, implementing **event-driven architecture** and efficient **API design** for scalable applications.\nDesigned and maintained data storage solutions using **PostgreSQL**, optimizing data querying and performance for high-load environments.\nImplemented **Docker** for containerization, facilitating seamless deployment processes and enhancing the microservices infrastructure.\nCollaborated with cross-functional teams to fuel software development initiatives, utilizing **Kafka** for messaging patterns that ensured reliable data transmission across services.\nConducted rigorous problem-solving sessions to troubleshoot application issues, proactively addressing potential challenges in the development cycle.\nDemonstrated teamwork by actively contributing to agile ceremonies, fostering a collaborative environment to drive project success.\nInitiated process improvements in the backend architecture to enhance overall performance and reliability.\nDeveloped integrations with existing **GCP** services to leverage cloud capabilities and microservices architecture for maximum efficiency.\nMaintained a focus on compliance and security throughout the development process, ensuring that all applications met industry standards.\nFluently communicated with team members and stakeholders in both **German** and **English**, creating an inclusive team dynamic and facilitating successful project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented event-driven architectures using **Kafka** and **PostgreSQL**, ensuring reliable message processing and data storage for scalable backend solutions in financial services.\nSpearheaded API design and development with **Kotlin** and **Ktor**, focusing on robust communication methods and messaging patterns that enhance system interoperability and performance.\nUtilized **Docker** for containerization, improving deployment efficiency and scalability by **15%** across multiple environments and orchestrated container management.\nApplied problem-solving and analytical skills to enhance existing financial platforms, resulting in a **20%** increase in transaction throughput and a reduction in system downtime by **10%**.\nCollaborated with cross-functional teams to drive initiatives for modernization and efficiency, fostering excellent teamwork and communication, while ensuring projects met **100%** of deadlines.\nLeveraged cloud services on **Google Cloud Platform** to deploy scalable backend solutions, improving overall system performance and flexibility for future expansions.\nDemonstrated strong initiative by integrating AI coding tools into development processes, enhancing productivity and code quality significantly, while adapting to emerging technologies for improved outcomes.\nCommunicated fluently in both **German** and **English**, facilitating effective collaboration with diverse teams and stakeholders in a multinational environment."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Designed and optimized backend services using **Kotlin** and **Ktor** for a global e-commerce platform, ensuring high availability and scalability across key modules like checkout, cart, and order fulfillment.\n• Engineered real-time features leveraging **Kafka** and event-driven architecture, enabling responsive order updates and dynamic inventory tracking.\n• Developed robust APIs that facilitate smooth interaction between services, adhering to best practices in **API design** and **messaging patterns**.\n• Collaborated effectively within a team to solve complex problems, showcasing strong **teamwork** and **initiative** in enhancing system performance and reliability.\n• Utilized **PostgreSQL** for distributed data storage, ensuring fast access for high-traffic workflows and optimizing complex queries to improve performance by up to **30%**.\n• Implemented secure and efficient application workflows using **Docker** for containerization, thereby reducing deployment times by **25%**.\n• Leveraged **Google Cloud Platform** for deploying microservices, ensuring that the infrastructure is scalable and cost-effective.\n• Integrated AI-powered tools and coding assistants, enhancing development efficiency and output quality, resulting in a **20%** reduction in code review cycle times.\n• Demonstrated bilingual communication skills in **German** and **English**, facilitating collaboration with diverse teams and international stakeholders.\n• Focused on continuous improvement by integrating feedback loops for ongoing optimization of backend services and system responsiveness."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, Kotlin\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Ktor\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI design\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Google Cloud Platform\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Kafka, event-driven architecture, messaging patterns, problem-solving, teamwork, initiative, German, English",
  "apply_company": "bex technologies"
}