{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Customer Success Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Customer-centric Full Stack Developer with 13+ years of experience driving high-performance applications in the healthcare and financial sectors. Proficient in **SQL**, **API** integration, and deploying **SaaS** solutions to enhance **CRM** and **ERP** systems. Equipped with exceptional **communication**, **teamwork**, and **adaptability** skills that foster strong customer engagement and satisfaction. Technical expertise includes **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside robust hands-on experience in both frontend and backend development with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.\n\nDemonstrated ability in building AI/ML-powered platforms supporting predictive analytics and real-time processing. Adept at deploying cloud-native systems on **AWS** and **Azure**, alongside implementation of microservices, event-driven architectures, and CI/CD pipelines. Highly knowledgeable in compliance-driven development, aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong background in MLOps with expertise in model training, serving, and orchestration utilizing **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Success Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged **SQL** to analyze customer interactions and data, utilizing insights to enhance customer engagement and communication strategies.\n- Developed and maintained APIs to facilitate seamless integration with **SaaS** platforms, improving customer success outcomes by **30%**.\n- Collaborated in cross-functional teams, demonstrating exceptional teamwork and adaptability in delivering solutions tailored to client needs, resulting in a **25%** reduction in support tickets.\n- Provided technical understanding of products to clients through effective communication and training sessions, boosting customer satisfaction ratings by **15%**.\n- Managed customer relationships using **CRM** tools and integrated support channels like **Intercom** and **Slack** to streamline customer interactions and feedback.\n- Solved complex customer challenges using problem-solving skills, engaging with various stakeholders to ensure successful implementations and driving user adoption for new features.\n- Conducted regular training and onboarding sessions for clients to optimize their use of our **ESP** and **ERP** systems, leading to a **20%** increase in user proficiency.\n- Facilitated communication between development and customer success teams to ensure alignment on product updates and feature releases, enhancing the overall customer experience.\n- Assisted in identifying and implementing improvements to service delivery processes, positively impacting efficiency and customer engagement.\n- Analyzed user feedback and performance data to provide actionable insights to partners and stakeholders, driving continuous improvement initiatives within the customer success strategy."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** to analyze customer engagement data, providing insights that improved communication strategies and resolved customer issues effectively.\nCollaborated with cross-functional teams to integrate **API** solutions into SaaS products, enhancing user experience and streamlining operations across platforms.\nLeveraged **CRM** systems to manage customer relationships, ensuring seamless onboarding processes and technical support, significantly improving customer satisfaction rates by **30%**.\nImplemented integrations with **ESP** and **Intercom** to automate customer interactions, leading to a **25%** increase in engagement metrics through targeted communication.\nEmployed **ERP** solutions to track customer feedback and product performance, using data analysis to identify areas for improvement and develop actionable solutions.\nFacilitated training sessions and workshops focused on **Adaptability** and **Teamwork** principles, which fostered enhanced collaboration among team members and improved project delivery timelines.\nEngineered problem-solving strategies to address technical issues swiftly, achieving resolution times of under **24 hours** for critical customer support cases, demonstrating strong **Customer Engagement** and technical understanding.\nMaintained clear and effective **Communication** with clients, leading to a **40%** increase in service renewal rates through consistent follow-ups and support engagement."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized advanced **SQL** skills to analyze and optimize data storage and retrieval in high-traffic e-commerce applications, enhancing system performance by **30%**.\nDeveloped APIs for seamless integration with **CRM**, **ESP**, and **ERP** systems, improving data flow and customer engagement features, resulting in a **25%** increase in user satisfaction ratings.\nCollaborated with cross-functional teams, utilizing strong **communication** and **teamwork** capabilities to implement customer success strategies, striving for a collaborative environment that fosters **adaptability** and innovation.\nEmployed **SaaS** application models to deliver integrated customer solutions, effectively responding to user needs and escalating issues via **Intercom** for real-time support, achieving response times of under **2 hours**.\nImplemented **Slack** based communication channels for better teamwork and problem-solving, resulting in a **15%** enhancement in project delivery timelines.\nDrove customer engagement initiatives by providing technical understanding and support, identifying opportunities for continuous improvement and ensuring customer success in using the e-commerce platform, reported a **20%** increase in product adoption rates.\nConducted regular training sessions and workshops to enhance team members' skills in using the platform, ensuring all personnel were equipped to tackle customer inquiries and technical challenges effectively, achieving a **4.8/5** satisfaction rating in team feedback.\n\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\tSQL\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tSaaS, CRM, ESP, ERP\n\tIntercom, Slack\n\tCommunication, Teamwork, Adaptability, Problem Solving, Customer Engagement, Technical Understanding",
  "apply_company": "Hightouch"
}