{
  "name": "Tomasz Lee",
  "role_name": "Senior Field Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Field Engineer with a strong foundation in AI, computer vision, machine learning, and generative AI technologies. Over 9 years of experience in developing and managing technical documentation to support complex projects in diverse fields, including networking, electrical wiring, and mechanical assemblies. Proven track record in delivering exceptional customer service and maintaining safety compliance. Effective communicator and team leader with a knack for collaborating across teams to drive project success and ensure quality outcomes. Hands-on experience with AutoCAD and Linux complements my solid technical background.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Demonstrated team leadership and effective communication skills to collaborate with cross-functional teams and ensure project success.\nLeveraged customer service expertise to understand and address client needs, resulting in improved satisfaction and engagement.\nCreated and maintained technical documentation for machine learning algorithms and computer vision techniques used in projects, ensuring clarity and knowledge transfer.\nApplied safety compliance measures during field operations, conducting regular inspections and training to reduce incidents by 30%.\nUtilized **AutoCAD** for designing intricate mechanical assemblies, ensuring alignment with technical specifications and client expectations.\nWorked with **Linux** to configure and manage systems, enhancing operational efficiency in field deployments.\nIntegrated networking solutions to optimize data flow in operational environments, resulting in a 15% increase in system performance.\nImplemented generative AI solutions for predictive analysis, leading to actionable insights that improved decision-making processes.\nDeveloped and deployed AI frameworks for enhancing field processes, adapting to emerging technologies to maintain competitive advantage.\nCollaborated on electrical wiring projects, ensuring quality and compliance to electrical safety standards, which improved project turnaround time by 25%."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Applied AI and machine learning techniques to enhance project outcomes and increase operational efficiency by 20%.\n• Utilized **Linux** environments to streamline project management tasks, ensuring a fortified and efficient workflow.\n• Conducted technical documentation and created user manuals for team members, promoting effective communication and understanding of project requirements.\n• Led team leadership initiatives, fostering collaboration and engagement that resulted in a 15% improvement in team performance metrics.\n• Implemented safety compliance protocols during project execution, reducing on-site incidents by 10%.\n• Developed networking solutions that improved system connectivity, enabling seamless integration among project components.\n• Executed detailed reviews of electrical wiring and mechanical assemblies to ensure adherence to project specifications and safety standards.\n• Collaborated with cross-functional teams to gather requirements and improve project timelines, achieving a 95% on-time delivery rate.\n• Provided exceptional customer service through effective communication, handling inquiries promptly, which increased client satisfaction ratings by 30%.\n• Mentored junior engineers in mechanical assemblies and networking, significantly enhancing team skill levels and cohesiveness."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Delivered technical documentation for complex systems, ensuring effective knowledge transfer and enhancing team communication.\n• Provided exceptional customer service, fostering strong relationships and ensuring client satisfaction.\n• Led team initiatives and collaborated on project goals, demonstrating strong team leadership skills to enhance project outcomes.\n• Ensured safety compliance in all field operations, minimizing risks and maintaining a safe working environment.\n• Implemented AI and machine learning solutions to optimize field operations and improve efficiency.\n• Utilized **Linux** for system management and maintenance, enhancing the reliability of operations.\n• Designed and reviewed mechanical assemblies and electrical wiring, ensuring adherence to engineering standards.\n• Collaborated with cross-functional teams to integrate computer vision technology into field projects, enhancing data analysis capabilities.\n• Utilized **AutoCAD** for creating and reviewing technical schematics, ensuring they meet project specifications.\n• Participated in training sessions to upskill the team on networking fundamentals, improving overall team expertise."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, HTML, CSS, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tLinux, networking\n\n**Other**\n\tUnit Testing: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, UX/UI Design, Git, GitHub, Apache Kafka, RabbitMQ, Redis, AI, computer vision, machine learning, generative AI, AutoCAD, electrical wiring, mechanical assemblies, technical documentation, customer service, communication, team leadership, safety compliance",
  "apply_company": "UVeye"
}