{
  "name": "Tomasz Lee",
  "role_name": "Splunk Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Splunk Engineer with 9+ years of robust experience in observability architecture and advanced querying to support complex environments. Proficient in utilizing **Splunk**, **Kafka**, **Logstash**, **ETL Python**, **InfluxDB**, **Telegraf**, **Grafana**, **Dynatrace**, **Icinga**, **SCOM**, and **Sitescope** for effective monitoring, alerting, and capacity management. Demonstrated expertise in performance tuning and third-party integration to optimize system efficiency. Proven track record of developing insightful dashboards, SLA monitoring systems, and implementing correlation logic. Experienced in crafting technical documentation and leading cross-functional teams, ensuring streamlined development processes and successful project deliveries.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Splunk Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed advanced querying techniques to enhance data retrieval and analysis using **Splunk** and **InfluxDB**.\n• Integrated **Logstash** with ETL processes in Python to streamline data ingestion, increasing efficiency by **30%**.\n• Designed and implemented observability architecture leveraging **Grafana** and **Telegraf** for real-time monitoring and dashboarding, improving visibility into system performance.\n• Conducted performance tuning and capacity management exercises using **Dynatrace** and **Icinga**, optimizing resource utilization by **25%**.\n• Collaborated on third-party integrations and automated alerting systems to enhance SLA monitoring and response time.\n• Created technical documentation for best practices in deploying and maintaining **Splunk** environments, facilitating knowledge transfer within the team.\n• Spearheaded the design and development of a web-based client dashboard for performance metrics using **D3.js**, resulting in improved user satisfaction.\n• Implemented correlation logic for effective event management and incident response.\n• Developed monitoring solutions based on **SCOM** and **Sitescope**, enhancing operational awareness across platforms."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Kafka** and **Logstash** for event processing and data ingestion, improving data flow efficiency by **20%**.\nImplemented advanced querying techniques in **Splunk** to extract actionable insights from logs, enhancing troubleshooting speed by **30%**.\nDesigned and deployed observability architecture using **Grafana** and **InfluxDB**, enabling real-time performance monitoring and capacity management.\nDeveloped ETL solutions using **Python** for data transformation, ensuring high data integrity and accuracy across systems.\nIntegrated **Telegraf** for metric collection across services, streamlining alerting and correlation logic implementation.\nManaged performance tuning of logging infrastructure, resulting in a significant reduction of server resource utilization by **15%**.\nCreated comprehensive technical documentation to facilitate onboarding and knowledge transfer among team members and stakeholders.\nDeveloped and maintained dashboards for SLA monitoring and alerting, significantly increasing visibility into system health and performance.\nConducted in-depth analysis of third-party integrations to ensure compliance with performance benchmarks and service level agreements.\nLed efforts in **FinOps** practices to optimize cloud expenditure, achieving a cost reduction of up to **25%** through better resource allocation."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "- Developed advanced querying capabilities and dashboarding solutions in **Splunk**, providing insights into system performance and enhancing observability architecture.\n- Implemented **Kafka** for real-time data integration, ensuring effective third-party integration and alerting mechanisms across platforms.\n- Utilized **Logstash** for ETL processes, improving data ingestion efficiency and performance tuning of the analytics pipeline by **30%**.\n- Leveraged **InfluxDB** and **Telegraf** for time-series metrics management, achieving a **25%** reduction in data retrieval times.\n- Designed and maintained monitoring dashboards in **Grafana**, enhancing capacity management and SLA monitoring practices within the team.\n- Deployed **Dynatrace** and **Icinga** to monitor application performance, achieving a **15%** improvement in incident response times.\n- Administered data flows through **SCOM** and **Sitescope** for effective health checks and performance monitoring of critical applications.\n- Authored detailed technical documentation and user guides, improving knowledge transfer and onboarding efficiency for **10+** new team members.\n- Created correlation logic algorithms to detect anomalies in system behavior, improving alert accuracy and reducing noise by **40%**.\n- Participated in cross-functional project teams, enhancing collaboration and solution delivery for observability-related features."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Database Systems**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, InfluxDB\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Cloud & Infrastructure**\n\tCI/CD pipelines\n\n**DevOps**\n\tGit, GitHub, Docker, Splunk, Kafka, Logstash, ETL Python, Telegraf, Grafana, Dynatrace, Icinga, SCOM, Sitescope, advanced querying, dashboarding, capacity management, SLA monitoring, FinOps, alerting, correlation logic, third-party integration, performance tuning, observability architecture, technical documentation\n\n**Other**\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design"
}