{
  "name": "Tomasz Lee",
  "role_name": "Senior Test Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Test Engineer with 9+ years of experience in automated testing and continuous integration, utilizing tools such as **Git**, **Jenkins**, and **Bamboo**. Proficient in test development and test execution, ensuring compliance with **IEC 62304**, **ISO 14971**, and **FDA regulations** for high-quality standards in software applications. Strong background in both frontend and backend technologies, with expertise in **iOS** development, **Python**, and various testing frameworks. Excellent collaboration skills to drive project success and improve testing processes across multidisciplinary teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Test Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** for developing automated testing protocols, enhancing test coverage by **30%**.\nImplemented continuous integration using **Jenkins** and **Bamboo**, streamlining the testing process and reducing the time to detect issues by **50%**.\nManaged source control practices with **Git**, ensuring smooth collaboration across the development team.\nConducted test execution following **IEC 62304** and **ISO 14971** standards to comply with **FDA regulations**, resulting in a **100%** success rate in regulatory audits.\nDesigned and executed comprehensive test development strategies, improving overall product quality and reliability.\nCollaborated with cross-functional teams to integrate testing into the software development lifecycle, promoting best practices in test automation.\nContributed to the enhancement of test frameworks and tools, leading to an increase in testing efficiency by **40%**.\nDeveloped and maintained documentation for test plans and execution procedures to ensure clarity and compliance across teams."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed automated testing frameworks using **Python** and integrated them into CI/CD pipelines, utilizing **Jenkins** and **Bamboo**, which improved testing efficiency by 40%.\nImplemented source control practices with **Git**, ensuring seamless version control and collaboration among the development team.\nConducted thorough test development and execution in compliance with **IEC 62304** and **ISO 14971** guidelines, guaranteeing the quality and safety of medical software products.\nMaintained robust documentation for all testing procedures, facilitating compliance with **FDA regulations** and enhancing traceability.\nCollaborated with cross-functional teams to define test strategies, enhancing the overall project delivery timeline by 25%.\nLed the creation of comprehensive test plans and test cases, ensuring 100% coverage of critical functionalities.\nMentored junior testers, improving their skill set and increasing team output by 30% through regular training sessions.\nUtilized Xcode to streamline testing and debugging processes of iOS applications, improving feature reliability.\nAutomated regression tests that reduced the manual testing effort by 50% while ensuring consistent product quality."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Conducted automated testing using **Python** to ensure software reliability and compliance with **FDA regulations**.\nUtilized **Xcode** for iOS app development, contributing to a user-friendly mobile experience.\nImplemented continuous integration practices using **Jenkins** and **Bamboo**, enhancing testing workflows and reducing build times by **30%**.\nApplied ISO 14971 and IEC 62304 standards to develop and execute test plans focused on safety and risk management.\nManaged source control with **Git**, ensuring efficient version control and collaboration across the development team.\nCreated robust test development frameworks to streamline test execution, improving testing speed by **25%** while maintaining high quality.\nParticipated in code reviews to uphold coding standards and assist with the integration of automated testing into the development cycle.\nDelivered comprehensive documentation to support testing procedures, facilitating better communication among team members and stakeholders.\nCollaborated with cross-functional teams to align testing strategies with project objectives and ensure product readiness for release."
    }
  ],
  "skills": " **Programming Languages**\n\t Python\n\n **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, iOS, Xcode\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t AWS, Azure\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\t Git, GitHub, CI/CD pipelines, Jenkins, Bamboo, source control, continuous integration\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t UX/UI Design, automated testing, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, IEC 62304, ISO 14971, FDA regulations, test development, test execution",
  "apply_company": "GlobalLogic"
}