{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Sales Engineer with 8 years of experience in full-stack development and a strong command over cloud services such as **AWS**, **Google Cloud Services**, and **Azure**. Proficient in managing container orchestration and virtualization technologies with **Docker** and **Kubernetes**. Expertise in database management systems including **MS SQL Server**, **Oracle**, and **PostgreSQL**. Possesses advanced skills in programming languages including **JavaScript** and **Python**, coupled with the ability to design and implement **RESTful APIs**.\n\nDemonstrated ability to deliver high-performance solutions in challenging environments, particularly in the healthcare and financial sectors. Strong foundation in microservices architecture and event-driven systems designing. Proven problem-solving and mentoring skills alongside effective requirements gathering and communication abilities. Passionate about driving customer success through technical insights and strategic solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **Microsoft Windows Server** and **Linux** environments to support sales engineering efforts and facilitate smooth integration of enterprise solutions.\nUtilized **Docker** and **Kubernetes** to architect containerized deployments, ensuring scalability and resilience of applications during client demonstrations and presentations.\nDeveloped and maintained robust backend systems using **Python** and **JavaScript** for seamless RESTful API integrations with client infrastructure, enhancing user experience and client satisfaction.\nDemonstrated exceptional **presentation skills** by leading technical workshops and product demos for clients, effectively communicating complex technical concepts to non-technical stakeholders.\nCollaborated with clients to gather requirements, providing tailored solutions that leverage **PostgreSQL** and **MS SQL Server** for effective data management and storage solutions.\nExhibited strong **problem-solving** abilities by diagnosing and resolving technical challenges encountered during the sales process, ensuring timely delivery of solutions.\nMentored junior team members, fostering a culture of knowledge sharing and continuous learning within the sales engineering team.\nSupported cloud initiatives on **AWS** and **Google Cloud Services**, enabling clients to transition to cloud-based frameworks seamlessly, thereby reducing operational costs by up to **30%**.\nEnhanced deployment processes through the implementation of CI/CD workflows using modern tools like **CircleCI**, streamlining updates and feature rollouts.\nConducted market research and competitor analysis to inform sales strategies, helping increase market share by **15%** during fiscal year XX.\nEngineered high-performance systems with a variety of databases, including **Oracle** and **IMS**, to cater to diverse client needs and application requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Effectively communicated technical solutions to stakeholders, leveraging strong **Presentation Skills**, while gathering requirements to align product development with client needs.\n• Mentored junior engineers in best practices for **Docker** and **Kubernetes** deployment, fostering a culture of continuous improvement and problem-solving.\n• Designed and implemented RESTful APIs using **Python (FastAPI, Django)** and **JavaScript** frameworks, enhancing the integration capabilities with varied data sources, including **MS SQL Server**, **Oracle**, and **PostgreSQL**.\n• Streamlined the deployment process on **AWS** and **Google Cloud Services**, achieving a **30%** reduction in deployment time by optimizing infrastructure management.\n• Developed and maintained financial systems on **Linux** and **Microsoft Windows Server**, ensuring stable and secure operations for high-volume transactions.\n• Led the modernization of legacy financial platforms by adopting **microservices** architecture, increasing system throughput by **40%** and improving maintainability for ongoing enhancements.\n• Applied strong problem-solving skills to analyze and resolve complex issues in financial data flows, ensuring high data quality and integrity for reporting.\n• Executed comprehensive testing strategies and collaborated with cross-functional teams to ensure smooth product launches, leading to a **20%** increase in customer satisfaction post-implementation."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Leveraged **AWS**, **Google Cloud Services**, and **Microsoft Windows Server** to design and implement robust cloud-based solutions, enhancing the scalability and performance of sales engineering projects.\n- Utilized **Docker** and **Kubernetes** for containerization and orchestration of applications, achieving a 30% improvement in deployment speed and a 25% reduction in infrastructure costs.\n- Developed and maintained backend services and RESTful APIs using **Python** and **JavaScript**, ensuring high availability and low latency in sales applications.\n- Managed data storage solutions through **PostgreSQL**, **MS SQL Server**, and **Oracle**, optimizing database queries to reduce response time by up to **40%** during peak sales events.\n- Conducted requirements gathering sessions with clients to identify needs, creating tailored solutions that improved customer satisfaction ratings by **15%**.\n- Enhanced team performance and workflow through mentoring and coaching, leading to a **20%** increase in team productivity and improved problem-solving capabilities.\n- Demonstrated strong presentation skills in client meetings, clearly communicating complex technical concepts and project goals, resulting in a **95%** approval rate for proposals.\n- Developed technical documentation and visual aids to facilitate effective communication of solutions and project progress to stakeholders.\n- Implemented security measures using PowerShell scripts and protocols to ensure data integrity and compliance with industry standards, safeguarding sensitive customer information.\n- Worked collaboratively with cross-functional teams, enhancing communication skills and contributing to the strong, cohesive culture of the engineering team."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful API\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Google Cloud Services, Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, MS SQL Server, Oracle\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tMicrosoft Windows Server, Linux, z/OS, PowerShell\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Presentation Skills, Problem-solving, Requirements Gathering, Communication, Mentoring",
  "apply_company": "Rocket Software"
}