{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Dynamic Software Developer with 8 years of experience in crafting high-performance applications utilizing **.NET Core**, **C#**, **SQL Server**, **.NET Framework**, **MVC**, and **Entity Framework**. Skilled in developing Web Services that adhere to industry standards. Proven track record in time management, organizational skills, and a proactive attitude to ensure project delivery on schedule. Known for strong attention to detail and a willingness to learn and adapt in fast-paced environments.\nPreviously focused on full-stack development including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, with substantial cloud experience across **Azure** and **AWS**. Successfully led the development of enterprise-grade platforms that integrate AI/ML capabilities for predictive analytics and intelligent automation while ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Demonstrated expertise in microservices architecture, event-driven systems, and CI/CD automation, implementing machine learning pipelines and MLOps workflows using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed robust web services and applications leveraging **.NET Core**, **C#**, and **SQL Server** to meet the critical needs of healthcare and financial sectors.\nEngineered solutions using **.NET Framework** and **MVC** for scalable application architecture, ensuring high quality and maintainable code through strong attention to detail.\nApplied **Entity Framework** for efficient data access and management, optimizing query performance for applications handling over **10,000** transactions daily.\nUtilized effective time management and organizational skills to lead project timelines, ensuring timely delivery of features and updates in line with agile practices.\nDemonstrated a proactive attitude by taking ownership of project components, resulting in a **30%** increase in application efficiency through optimized workflows and processes.\nEmployed continuous learning strategies to integrate new technologies into projects, enhancing existing systems and processes with tools and methodologies aligned with industry best practices.\nFostered a strong work ethic within the team by collaborating on cross-function projects and implementing **Git** for version control, ensuring cohesive team efforts in a dynamic environment.\nDesigned and implemented testing strategies, incorporating unit testing and integration testing practices to maintain high software quality across multiple environments.\nImplemented comprehensive documentation practices, enhancing code readability and maintainability which facilitated onboarding processes for new team members.\nResolved complex technical challenges through thorough analysis and innovative solutions, consistently contributing to team goal achievement and project success."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **.NET Core** and **C#** to develop and maintain robust web services, ensuring high performance and scalability in financial applications that handle over **100,000** transactions daily.\nApplied **SQL Server** for efficient database management and optimized query performance in a multi-user environment, achieving a **30%** improvement in data retrieval times.\nImplemented the **Entity Framework** to facilitate seamless database operations, enhancing data integrity and reducing errors in application interactions.\nEmployed **MVC** architectural design patterns to create user-friendly interfaces, leading to a **15%** increase in user satisfaction based on feedback surveys.\nDemonstrated exceptional **time management** and **organizational skills** by successfully delivering multiple projects on tight deadlines, including a major financial platform overhaul completed **2 months** ahead of schedule.\nExhibited **strong attention to detail** by rigorously testing and debugging software components, resulting in a **20%** decrease in post-deployment issues.\nAdopted a **proactive attitude** and a **strong work ethic** to consistently seek out opportunities for improvement in existing systems, often spearheading initiatives that led to enhanced team productivity.\nFostered a **desire to learn and grow** by staying updated with emerging technologies and frameworks relevant to the development role, contributing to team knowledge sessions once every **quarter**.\nDemonstrated a **sense of ownership** over projects, leading to a track record of successful project completion that directly contributed to business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed scalable and maintainable backend services using **.NET Core**, **C#**, and **SQL Server**, ensuring performance optimization and high availability across multiple critical modules within the software architecture.\nDesigned and implemented robust **Web Services** following the **MVC** architecture pattern, enhancing system modularity and facilitating team collaboration with a focus on organizational efficiency.\nLeveraged the **Entity Framework** for effective data access and management, improving data handling capabilities and ensuring quick query response times by **30%**.\nDemonstrated exceptional **Time Management** and **Organizational Skills** by leading project initiatives that resulted in meeting **100%** of sprint deadlines and deliverables on time.\nDisplayed acute **Attention to Detail** while conducting code reviews and testing procedures, successfully decreasing bug rates by **25%** in production environments.\nAdopted a **Proactive Attitude** towards learning and integrating new technologies such as **.NET Framework**, through continuous self-improvement efforts, ensuring up-to-date knowledge of best practices and trends in software development.\nCultivated a **Strong Work Ethic** by taking ownership of project components, ensuring that each feature delivered aligns with user requirements, resulting in an improved client satisfaction score by **20%**.\nMaintained a **Desire to Learn and Grow**, actively participating in cross-training sessions, leading to a holistic understanding of the software lifecycle and increased team productivity.\nImplemented best practices in coding and project management while promoting a culture of accountability and **Sense of Ownership** among team members."
    }
  ],
  "skills": "Programming Languages:\n\tC#, Python, JavaScript/TypeScript\n\nBackend Frameworks:\n\t.NET Core, .NET Framework, Flask, FastAPI, Django\n\nFrontend Frameworks:\n\tReact, Vue, Angular\n\nAPI Technologies:\n\tWeb Services, Keycloak (OIDC, RBAC), JWT, OAuth2\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\nDatabases:\n\tSQL Server, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\tAWS, Azure\n\nOther:\n\tTime Management, Organizational Skills, Attention to Detail, Proactive Attitude, Strong Work Ethic, Desire to Learn and Grow, Sense of Ownership"
}