{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Frontend Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Frontend Developer with 10+ years of experience in delivering high-performance web applications focusing on **TypeScript**, **React**, **Next.js**, **Node.js**, and **CSS**. Proficient in creating secure, scalable interfaces using modern frameworks and libraries, with a solid understanding of micro frontends and web components. Adept at implementing unit testing frameworks to ensure high-quality code and seamless user experiences. Skilled in infrastructure-as-code practices using **Pulumi** and **Terraform**, alongside CI/CD pipelines managed through **Azure DevOps** to streamline deployment processes.\nPossesses a proactive mindset and strong problem-solving abilities that drive efficiency in project execution. Demonstrates excellent communication skills, facilitating collaboration with cross-functional teams to achieve project goals. Committed to developing applications that comply with industry standards and enhance user engagement.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and optimized scalable web applications using **TypeScript**, **React (17–18)**, **Next.js**, **Node.js**, and markup languages like **HTML** and **CSS**, adhering to modern frontend practices and security standards for end-users.\n•\tLed initiatives on micro frontends and web components to enhance application modularity and performance, ensuring high-quality user experiences and efficient application delivery.\n•\tImplemented CI/CD pipelines utilizing **Azure DevOps** and **Terraform** for automating deployments, reducing downtime by over **30%** through consistent infrastructure management practices.\n•\tConducted unit testing across applications using **unit testing frameworks**, achieving over **90%** test coverage for both frontend and backend services, and enhancing reliability and maintainability.\n•\tCollaborated closely with cross-functional teams, demonstrating excellent communication skills and proactive problem-solving to meet project deadlines and improve workflows.\n•\tEnsured web page security through comprehensive strategies on **Azure portal security**, aligning with best practices to safeguard user data and maintain compliance.\n•\tEngineered responsive, high-performance user interfaces that interact seamlessly with back-end services, optimizing loading times by **20%** through efficient coding practices and performance monitoring.\n•\tUtilized modern development tools including **NPM** for package management and version control to streamline development processes and enhance collaborative efforts.\n•\tEngaged in regular code reviews and mentorship, fostering a culture of continuous improvement and skill development among junior team members with a focus on innovative frontend solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Developed dynamic, user-focused front-end applications using **TypeScript**, **React (18)**, **Next.js**, and **CSS**, ensuring optimal performance and responsiveness.\n- Implemented unit testing frameworks to enhance the reliability of the applications, achieving a code coverage of **90%**.\n- Collaborated on migrating the architecture to a microservices-based approach using **Node.js** and **Azure DevOps**, increasing deployment frequency by **50%**.\n- Applied best practices in **web components** and **micro frontends** to streamline and modularize the development process.\n- Ensured compliance with **web page security** standards and implemented **infrastructure-as-code** practices using **Terraform** and **Pulumi** for smooth deployments and better resource management.\n- Actively participated in **CI/CD pipelines** setup, reducing the lead time for changes and enhancing integration workflows by **40%**.\n- Provided mentorship and training to junior developers, improving team communication and problem-solving skills, fostering a collaborative environment.\n- Demonstrated a proactive mindset in addressing challenges, contributing innovative solutions during project development to enhance overall product offerings."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** and **React (18)** to architect and develop highly interactive frontend applications, improving user engagement and achieving a **30%** increase in page load performance.\nImplemented **Next.js** for improved server-side rendering, optimizing SEO capabilities, and enhancing accessibility compliance (WCAG 2.1) for a modern e-commerce platform.\nEmployed **HTML5/CSS3** alongside advanced **CSS frameworks** for responsive, mobile-first design, resulting in a **25%** reduction in bounce rates on mobile devices.\nIntegrated **Node.js** microservices architecture to facilitate efficient communication between frontend and backend systems, delivering features in real-time with reduced latency by **15%** across crucial user workflows.\nLeveraged **CI/CD pipelines** utilizing **Azure DevOps** for streamlined deployment and version control, enhancing deployment speed by **40%**.\nCreated reusable **web components** and implemented **micro frontends** to increase code maintainability and enhance team collaboration.\nApplied **unit testing frameworks** to ensure a consistent quality and reliability of code, helping maintain a <1% bug rate post-release.\nEngaged in proactive problem-solving and communication to address cross-team dependencies and deliver feature requirements on time.\nUtilized **infrastructure-as-code** strategies with **Terraform** and **Pulumi** to automate environment provisioning and enhance security protocols in the **Azure Portal** and ensure tight **web page security**.\nMaintained high standards of user experience and functionality by regularly monitoring and updating **NPM** dependencies as part of the development cycle."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Next.js, CSS, HTML, web components, micro frontends\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services), Azure DevOps\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD pipelines, Terraform, Ansible, Helm, Docker Compose, Pulumi\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Azure Portal, infrastructure-as-code\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, problem-solving, communication skills, proactive mindset, unit testing frameworks, web page security, Let’s Encrypt, Nginx, Certbot"
}