{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior .NET Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "A results-driven Senior .NET Engineer with 8 years of experience specializing in high-performance applications development using **.NET**, **C#**, **ASP.NET MVC**, **ASP.NET Core**, **Entity Framework**, and **WebAPI**. Proficient in database management with **MS SQL Server**, **PostgreSQL**, and **Oracle**, I have a strong foundation in Object-Oriented Programming (OOP) principles and agile methodologies that facilitate continuous improvement within teams. My front-end expertise includes **JavaScript**, **TypeScript**, **CSS**, **SASS**, and **Angular**, enabling me to create dynamic user interfaces that are responsive and user-friendly.\n\nIn addition to my technical skills, I excel in mentoring and leading cross-functional teams, driving system architecture decisions, and fostering a culture of best practices in software development. I have successfully delivered enterprise solutions that prioritize compliance, performance, and scalability, leveraging tools and frameworks to enhance overall project efficiency.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior .NET Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and architected robust applications using **ASP.NET Core**, **C#**, and **Entity Framework**, ensuring adherence to Agile methodologies and best practices for continuous improvement.\n• Implemented WebAPI services to optimize data communication for applications, facilitating smooth integration with frontend technologies like **Angular** and **JavaScript**.\n• Enhanced database interactions using **MS SQL Server**, **PostgreSQL**, and Oracle, improving data retrieval and storage efficiency for high-performance applications.\n• Led and mentored junior developers in OOP principles and best practices, contributing to team skill enhancement and project success.\n• Established automated unit and integration testing protocols with **NUnit**, ensuring reliable code deployment and maintenance across development cycles.\n• Enhanced user interfaces with responsive designs using **CSS**, **SASS**, and DOM manipulation techniques, improving user experience and application interaction.\n• Collaborated with cross-functional teams to drive the development of cloud-native applications, leveraging platforms such as **Azure** and implementing CI/CD pipelines for efficient deployment.\n• Conducted code reviews and advocated for robust coding standards, fostering a culture of quality and best practices within the development team.\n• Facilitated project planning and sprint reviews as part of an Agile team, ensuring the timely delivery of high-quality software solutions.\n• Integrated advanced search capabilities using **Azure Cognitive Search** and **Elasticsearch**, optimizing search functionalities across complex datasets.\n• Oversaw the configuration and deployment of applications in production environments, ensuring scalability and performance as per user demand.\n• Championed initiatives for continuous learning and knowledge sharing among team members to maintain a forward-thinking and innovative development environment."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented robust web APIs with **ASP.NET Core** and **C#**, ensuring high performance and scalability for enterprise-level applications, achieving a throughput improvement of **30%** over previous systems.\nApplied **Entity Framework** for efficient data access and manipulation, connecting to databases such as **MS SQL Server**, **PostgreSQL**, and **Oracle**, resulting in a reduction of response times by **25%**.\nLed the transition of legacy systems to modern designs utilizing **OOP** principles and **Agile methodologies**, enhancing team productivity and project delivery times by **40%**.\nBuilt dynamic single-page applications using **Angular** and **TypeScript**, utilizing **CSS** and **SASS** for improved styling and responsiveness, increasing user engagement metrics by **15%**.\nConducted mentoring sessions for junior developers, fostering a culture of continuous improvement and knowledge sharing within the team, contributing to a **50%** increase in team skill levels.\nImplemented unit testing frameworks such as **NUnit** to ensure code quality and stability, achieving a code coverage of **85%** in critical components.\nEmphasized leadership within cross-functional teams to drive project objectives and meet deadlines, with a consistent track record of successful project completion.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **.NET** and **C#** to design and implement robust backend services aligned with OOP principles, ensuring scalability and maintainability for enterprise-level applications.\nDeveloped and maintained RESTful APIs using **ASP.NET WebAPI** and **ASP.NET Core**, optimizing application performance with a focus on response times and throughput.\nImplemented unit testing and test-driven development (TDD) methodologies using **NUnit**, achieving over **90%** code coverage to enhance software reliability.\nLed a cross-functional team through Agile methodologies, fostering continuous improvement and mentoring junior developers in best coding practices and **Entity Framework** for efficient data access.\nEngineered dynamic web applications using **Angular** and **TypeScript**, achieving seamless user interfaces and high user engagement through responsive design and adherence to WCAG 2.1.\nManaged databases including **MS SQL Server**, **PostgreSQL**, and **Oracle**, ensuring optimal performance through performance tuning and indexing strategies, resulting in query execution time reductions of up to **30%**.\nEmployed **SASS** and **CSS** for advanced styling, creating visually appealing and consistent design across multiple devices and browsers.\nStreamlined development processes through the implementation of CI/CD pipelines, enhancing deployment frequency by **40%** with automated testing and validation processes.\nFostered a culture of leadership and collaboration, guiding team members in technical skills and personal development to build a high-performing engineering team.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, .NET, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tASP.NET MVC, ASP.NET Core, FastAPI, Flask, Django, Entity Framework, WebAPI\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, SASS, CSS, DOM\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak, RESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n**Databases:**\n\tMS SQL Server, PostgreSQL, MySQL, MongoDB, Oracle, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Mentoring, Leadership, Agile, OOP, Continuous Improvement, Nginx, Certbot",
  "apply_company": "Creatio"
}