{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer full stack .NET/Angular",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of experience in full-stack development, specializing in **C#**, **.NET**, and **.NET Core** for building dynamic web applications. Expertise in designing and developing robust **APIs** and leveraging frameworks like **Asp NET MVC 5** along with responsive front-end technologies including **HTML**, **Bootstrap**, and **Angular**. Proficient in working with both relational and **non-relational databases**, ensuring optimized data handling. My solid foundation in modern development practices, combined with a focus on high-performance solutions, positions me to deliver scalable and efficient applications across diverse industries. Proven ability to adapt and implement best practices in software engineering, bringing exceptional value to business objectives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer full stack .NET/Angular",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and maintained scalable, high-performance **C#** and **.NET Core** web applications, ensuring seamless integration with **APIs** and delivering robust solutions within project timelines.\n- Designed responsive user interfaces using **Angular**, **Bootstrap**, and **HTML** to enhance user experience and engagement, improving usability scores by **30%**.\n- Created RESTful services and designed **ASP.NET MVC 5** applications, successfully supporting **100,000+** users and ensuring API efficiency and reliability.\n- Implemented secure data storage and retrieval solutions using both relational and **non-relational databases**, optimizing system performance through effective data management strategies.\n- Streamlined data interchange processes using **XML** and **JSON**, facilitating communication between front-end and back-end systems in real-time.\n- Spearheaded the migration of legacy applications by re-architecting them in **.NET** and **Angular**, achieving a streamline reduction in operational costs by **25%**.\n- Collaborated with cross-functional teams to integrate third-party services and tools, enhancing application capabilities while maintaining compliance with industry standards.\n- Conducted code reviews and mentored junior developers in effective software development practices in **C#**, **.NET**, and **Angular**, fostering a learning environment that improved team efficiency.\n- Developed unit and integration tests within the **.NET** framework to maintain code quality and reduce bug rates by **40%**, ensuring smooth deployments.\n- Optimized application loading times through performance tuning methodologies, achieving a **15%** enhancement in load times on all major web browsers.\n- Utilized best practices in security and data encryption to ensure compliance with GDPR guidelines and secure sensitive data handling in applications.\n- Championed Agile methodologies within the team, resulting in improved project visibility and a **20%** increase in delivery speed for project milestones."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained robust **.NET** and **C#** applications, integrating **ASP.NET MVC 5** frameworks for a seamless user experience.\nCollaborated on the design and implementation of **APIs** to facilitate communication between frontend applications and backend services, ensuring optimized performance and scalability.\nUtilized **HTML**, **Bootstrap**, and **Angular** to create dynamic, user-friendly web interfaces, enhancing overall user satisfaction and engagement.\nEmployed **XML** and **JSON** for efficient data interchange across services, streamlining integrations with external systems.\nEngaged in the migration of legacy applications to a modern **.NET Core** framework, improving maintainability and performance metrics by **30%**.\nIntegrated non-relational databases into applications to support diverse data storage needs and ensure efficient data retrieval.\nImplemented automated testing strategies with a focus on maintaining high code quality through unit testing and CI/CD practices.\nManaged database interactions and optimized queries to enhance application response times by **40%**, ensuring high availability and reliability.\nCollaborated with cross-functional teams to deliver solutions on time, achieving project milestones and enhancing team productivity by **25%**.\nUtilized Agile methodologies to enhance software delivery cycles, improving time-to-market for new features and updates.\nProvided mentorship to junior developers, fostering a collaborative team environment and sharing best practices in **.NET** development."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and optimized full stack applications using **C#**, **.NET Core**, and **Angular**, enhancing system performance and user experience across multiple modules.\nDesigned robust **APIs** utilizing **.NET** technologies to support high-volume transactions and streamline integration between frontend and backend systems.\nEnhanced database interactions with **non-relational databases** ensuring efficient data storage and retrieval while optimizing performance in handling JSON and XML data.\nCollaborated on the development of responsive frontends integrated with **HTML**, **Bootstrap**, **Angular**, and **AngularJS**, ensuring seamless user navigation and interaction.\nImplemented unit and integration testing procedures to maintain code quality and reliability, resulting in a reduction of issues reported by **30%** post-deployment.\nAutomated the deployment processes through CI/CD practices, significantly reducing deployment times by up to **50%** and ensuring consistent delivery of features.\nConducted thorough performance testing using tools like **JMeter**, identifying bottlenecks and enhancing system responsiveness under peak loads by **40%**.\nUtilized design patterns and architectural best practices in **.NET** development to create maintainable and scalable systems, improving team efficiency by facilitating easier onboarding of new developers.\nIntegrated secure payment systems following PCI standards within **.NET** applications, ensuring compliance and reliability in transaction processing.\nEngaged in code reviews to uphold coding standards and facilitate knowledge sharing within the team, resulting in enhanced team collaboration and reduced technical debt."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, Python\n\n**Backend Frameworks:**\n\t.NET, .NET Core, Asp NET MVC 5, FastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular, AngularJS, React, Next.js, Vue.js, Blazor, HTML, Bootstrap\n\n**API Technologies:**\n\tAPIs, REST & gRPC APIs, JSON, XML\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQLAlchemy, non-relational databases\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Nginx, Certbot\n\n**Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt"
}