{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Software Engineer with 8 years of comprehensive experience in software development, specializing in **Linux**, **C**, **C++**, and **Qt** technologies. Proficient in leveraging tools such as **Bash** for scripting and **Jira** for effective project management. I bring a robust background in designing and implementing efficient systems that support scalable applications. \nBeyond my core technical skills, I have a proven track record in developing high-performance solutions within the healthcare and financial sectors. My experience includes full-stack development utilizing **JavaScript/TypeScript**, **Python**, and **Flutter**, along with advanced frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. \nI also possess deep cloud expertise in **Azure** and **AWS**, alongside my knowledge of microservices architecture, event-driven systems, and CI/CD automation, ensuring compliance with standards like HIPAA, FHIR, PCI DSS, and SOC 2. My hands-on experience extends to developing machine learning pipelines and implementing MLOps workflows with technologies such as **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained applications using **C** and **C++**, ensuring high performance and responsiveness in a Linux environment.\n- Designed interactive user interfaces with **Qt** for application development, enhancing user experience in a desktop environment.\n- Implemented and integrated **DBus** for inter-process communication, improving application modularity and efficiency.\n- Utilized **OpenTelemetry** for monitoring and observability, allowing real-time performance tracking and system health analysis.\n- Created automation scripts using **Bash** to streamline deployment processes and increase development efficiency, resulting in a **30%** reduction in build times.\n- Managed project workflows and progress through **Jira**, enhancing team collaboration and issue tracking within agile frameworks.\n- Contributed to the development of scalable architectures that emphasize performance optimization through the use of modern programming paradigms.\n- Applied best practices in software development, including version control and continuous integration methodologies, to maintain code integrity and facilitate collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Linux** environments to streamline software development and deployment processes, ensuring robust and efficient application performance.\nEngaged in cross-functional collaboration using **Jira** for effective project management, tracking, and reporting, successfully meeting **95%** of project deadlines.\nContributed to system-level programming using **C** and **C++** to enhance the performance and responsiveness of applications, achieving a **30%** increase in processing speed.\nDeveloped GUI applications with **Qt**, leveraging advanced features to create user-friendly applications that improved user engagement by **15%**.\nImplemented inter-process communication via **DBus**, ensuring seamless data exchange between multiple components of applications while maintaining system integrity.\nAdopted **OpenTelemetry** for performance monitoring and tracing of applications, which provided insights that led to a reduction in bugs by **25%** and improved user satisfaction.\nScripted automation tasks in **Bash**, enhancing operational efficiencies and reducing manual workload by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and maintained applications using **C**, **C++**, and **Qt** for high-performance software solutions, ensuring robust system integration and user experience.\n- Managed Linux environments to optimize software deployment and performance, leveraging **Bash** scripts for automation and efficiency in processes.\n- Collaborated using **Jira** for project management, enhancing team communication and tracking progress effectively during the software development lifecycle.\n- Implemented **OpenTelemetry** for distributed tracing and monitoring, providing insights into system performance and application health.\n- Optimized GUI applications built on **Qt** with a focus on user accessibility and adherence to best practices for UX/UI design.\n- Developed features in alignment with existing architectures by utilizing **DBus** for inter-process communication, ensuring compatibility and low overhead.\n- Contributed to open-source projects to enhance community engagement and stay current with industry standards in software engineering.\n- Executed performance testing and optimization strategies that increased application responsiveness by **30%**, ensuring a seamless user experience across platforms.\n- Led code reviews and mentoring sessions that improved team productivity by **15%**, fostering a culture of knowledge sharing and continuous learning."
    }
  ],
  "skills": "Programming Languages:\n\tC, C++, Python(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOpenTelemetry\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tLinux, Bash, Jira, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, DBus, Weston",
  "apply_company": "Brightstar Lottery"
}