{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Fullstack Engineer with over 13 years of expertise in developing high-performance applications with a focus on frontend technologies like **React**, **TypeScript**, and **Redux**, alongside robust backend systems using **Node.js** and **Express**. Proficient in building responsive user interfaces with **HTML** and **CSS** and implementing APIs using **REST** and **GraphQL**. Experienced in database management with **PostgreSQL** and **MongoDB**.\n\nExpert in CI/CD practices to streamline deployments and improve application performance and security. Demonstrated ability to integrate **AWS** cloud solutions and enhance applications’ functionality with tools like **Firebase**. Knowledgeable in compliance-driven development standards, ensuring solutions meet industry regulations. Additionally, skilled in Python for backend services, leveraging extensive performance optimization techniques. My strong background includes delivering projects that align with the latest web technologies and best practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Led the design and development of scalable full-stack applications utilizing **React (17–18)**, **TypeScript**, **Node.js**, and **Express**, ensuring industry-standard **security** practices.\n• Implemented state management using **Redux** along with modern **Hooks** for enhanced component functionality, improving performance by **30%**.\n• Developed RESTful APIs and integrated **GraphQL** for efficient data fetching, enhancing front-end and back-end communication by **25%**.\n• Crafted dynamic web interfaces using **HTML** and **CSS**, focusing on both aesthetic and functional performance, achieving a **95%+ Lighthouse score** across major projects.\n• Established CI/CD pipelines with **Firebase** and cloud services like **AWS**, facilitating automated deployments that reduced release time by **40%**.\n• Managed and optimized databases using **PostgreSQL** and **MongoDB**, supporting high-volume transactions and data retrieval processes, resulting in a responsiveness improvement of **50%**.\n• Ensured compliance with performance and security guidelines, routinely conducting audits and reviews to maintain standards across the stack.\n• Enhanced user experiences by incorporating real-time data interactions and feedback loops through responsive UI design patterns and technologies.\n• Collaborated with cross-functional teams to drive feature innovation and troubleshoot issues swiftly, contributing to overall project success and enhanced user satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed interactive front-end applications utilizing **React (18)**, **TypeScript**, and **Redux** to create sleek, responsive interfaces, improving user experience for financial tools and admin panels.\n• Integrated Node.js (**Express**) for seamless back-end communication, ensuring a robust **REST** API architecture for high-performance financial applications.\n• Collaborated in cross-functional teams to implement performance enhancements, achieving a **20%** increase in application responsiveness as measured by **Lighthouse** scores.\n• Ensured compliance with best practices in **Security** to protect sensitive financial data and maintain user trust.\n• Employed **PostgreSQL** and **MongoDB** for effective data storage solutions, optimizing database queries for faster access and transaction handling.\n• Implemented CI/CD pipelines to streamline deployment processes, reducing release times by **30%** through automation and continuous integration.\n• Leveraged the power of **Hooks** in React for managing state and side effects, improving code efficiency and maintainability.\n• Conducted extensive testing using **Axe** for accessibility standards compliance, ensuring applications meet the needs of all users.\n• Actively contributed to architecture design, focusing on scalability and performance in line with evolving business needs, successfully deploying applications that handle **over 100,000** transactions per day."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and maintained frontend applications using **React (18)**, **TypeScript**, and **Redux** with a focus on performance and security, ensuring seamless user experiences across desktop and mobile platforms.\n- Created responsive and SEO-friendly user interfaces using **HTML5**, **CSS3**, and **Next.js**, achieving high accessibility compliance (WCAG 2.1) and optimizing for mobile-first engagement, ultimately increasing user retention by **20%**.\n- Designed and optimized backend services using **Node.js (Express)** and **Python**, delivering robust REST and GraphQL APIs that facilitated smooth communication between front and backend services, increasing transaction efficiency by **30%**.\n- Integrated **PostgreSQL** and **MongoDB** databases for efficient data storage and retrieval, contributing to a **25%** reduction in query response times during peak traffic.\n- Implemented CI/CD strategies to ensure timely deployment of code changes, improving overall workflow efficiency and reducing deployment-related incidents by **15%**.\n- Enforced application security measures, including role-based access control (RBAC) and OAuth 2.0, achieving GDPR compliance and ensuring secure user data handling, which led to a **25%** decrease in security-related incidents.\n- Conducted performance audits using **Lighthouse** and **Axe**, ensuring optimal application speed and accessibility, resulting in improved rankings in user satisfaction surveys by **10%**.\n- Collaborated in agile environments, maintaining code quality and unit testing standards, delivering high-quality software on a bi-weekly release schedule.\n- Coordinated with cross-functional teams to enhance application features and resolve technical challenges, fostering a collaborative atmosphere that led to innovative solutions and faster time-to-market for new features."
    }
  ],
  "skills": "  **Frontend Frameworks:**\n\tReact, TypeScript, Redux, Hooks, HTML, CSS\n\n  **Backend Frameworks:**\n\tNode.js, Express\n\n  **API Technologies:**\n\tREST, GraphQL\n\n  **Programming Languages:**\n\tPython, JavaScript\n\n  **Databases:**\n\tPostgreSQL, MongoDB\n\n  **DevOps:**\n\tDocker, Kubernetes, CI/CD\n\n  **Cloud & Infrastructure:**\n\tAWS\n\n  **Other:**\n\tPerformance, Security, Firebase, MLflow, Airflow, Kubeflow, GitHub Actions, GitLab CI/CD, Azure: App Services, Blob Storage, SQL Database, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Redis, Terraform, Ansible, Helm, Docker Compose, Lighthouse, Axe",
  "apply_company": "AccessiWay"
}