{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior IOS Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Highly skilled Senior iOS Engineer with 8 years of experience, specializing in **Swift** and **SwiftUI** development. Proven ability in delivering high-performance, user-centric solutions specifically for e-commerce and ads sectors. Proficient in **Python** for backend services and A/B testing methodologies that enhance user experiences. Demonstrated strengths in problem solving and cross-functional collaboration to drive project success and ownership from concept to launch. My extensive background includes robust documentation practices that ensure clarity and compliance. Additionally, I have comprehensive knowledge in machine learning and CI/CD workflows which complements my technical skill set.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior IOS Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust mobile applications using **Swift** and **SwiftUI**, focusing on seamless user experiences in e-commerce and ads spaces with A/B testing frameworks to optimize user engagement.\n- Collaborated cross-functionally with product management and design teams to gather requirements and tailor features, demonstrating strong problem-solving capabilities and ownership from concept to delivery.\n- Employed **Python** for backend services that interact with iOS applications, ensuring efficient data handling and integration with third-party services.\n- Conducted comprehensive documentation practices to outline application architecture, interfaces, and A/B test results, facilitating better team collaboration and knowledge transfer.\n- Implemented analytics tools to monitor user interactions and preferences, leveraging insights to iterate on features based on quantitative data from performance metrics.\n- Led initiatives to enhance app performance and user satisfaction, ensuring compliance with industry standards and best practices in mobile app development.\n- Utilized structured versioning and continuous integration methodologies to maintain high-quality code across development cycles, integrating feedback loops for consistent improvement.\n- Fostered an environment of continuous learning by encouraging team members to engage in workshops and training sessions on the latest iOS technologies and trends."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Swift** and **SwiftUI** to develop and enhance user-centric mobile applications, ensuring a seamless and engaging experience in e-commerce contexts.\nCollaborated with cross-functional teams to effectively implement features based on A/B testing results, analyzing performance improvements and user engagement metrics to drive product decisions.\nConducted extensive problem-solving sessions to identify and resolve issues, improving performance and stability of mobile applications handling over **100,000** monthly active users.\nTook ownership of the full development lifecycle, from documentation to deployment, maintaining high standards of code quality and comprehensive documentation practices.\nImplemented robust analytics solutions to track user interactions within the app, integrating insights into strategic marketing initiatives that increased conversion rates by **25%**.\nEngaged in continuous learning and collaboration with team members to enhance project outcomes, actively sharing best practices for **Python** integration in the back-end services.\nDrove the adoption of unit testing practices, increasing code reliability with coverage above **85%**, to ensure that all new features are robust and maintainable in the dynamic e-commerce landscape."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized mobile applications for e-commerce platforms using **Swift** and **SwiftUI**, ensuring high performance, low latency, and seamless user experiences.\nEngaged in cross-functional collaboration to conduct A/B testing on user interfaces and features, resulting in a **25%** increase in user engagement and conversion rates.\nEmploy problem-solving skills to troubleshoot and resolve issues throughout the development lifecycle, ensuring the delivery of high-quality e-commerce solutions.\nImplemented robust documentation practices for application features and architecture, enhancing team knowledge sharing and onboarding processes.\nLed ownership of multiple product features in the e-commerce domain, driving initiatives that resulted in a **30%** improvement in overall application load times.\nOptimized backend services using **Python** frameworks, ensuring compatibility and performance across multiple devices for greater market reach.\nEngaged continuously with ads and promotional strategies to enhance user acquisition and retention through effective e-commerce methods.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Swift\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular), SwiftUI\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tA/B testing, ads, e-commerce, problem solving, cross-functional collaboration, ownership, documentation, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Whatnot"
}