{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior PHP Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior PHP Engineer with 8 years of full-stack development experience, I have a strong focus on PHP and **Symfony** to create high-performance solutions tailored for E-Commerce and SaaS applications. My skill set also encompasses database management with **MySQL** and **PostgreSQL**, RESTful APIs, and JSON for seamless data interchange. I am proficient in **Git** for version control and have implemented CI/CD practices to enhance deployment efficiency. \n\nIn addition to my PHP expertise, I leverage modern technologies, including **JavaScript**, **TypeScript**, and **Flutter**, to enrich user experiences. My extensive background in cloud platforms such as **Azure** and **AWS**, combined with a solid understanding of containerization using **Docker**, enables me to build scalable applications while adhering to best practices in compliance and security. \n\nWith proven leadership in Agile methodologies, I excel in collaborating with cross-functional teams and driving projects to success using frameworks like Scrum and Lean. My commitment to quality is reflected in my experience with automated Testing and building robust applications that meet high industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust **PHP** applications within the **Symfony** framework, enabling seamless data processing and service delivery in the e-commerce and SaaS sectors.\n- Designed and optimized database schemas and queries in **MySQL** and **PostgreSQL**, ensuring efficient data handling and retrieval for high-traffic applications with over **10,000** daily active users.\n- Implemented RESTful APIs using **JSON** for effective data interchange, providing a solid foundation for integrations with external services and systems in a microservices-based architecture.\n- Orchestrated CI/CD pipelines utilizing **Docker** and automated deployment processes, decreasing deployment times by **50%** and enhancing reliability across multiple environments.\n- Employed Agile methodologies (Scrum and Lean) to manage project timelines, ensuring iterative development and timely feature releases, leading to a **30%** improvement in team productivity.\n- Collaborated with cross-functional teams to define testing strategies, including unit, integration, and end-to-end (E2E) testing, utilizing tools such as PHPUnit and Behat to enhance software quality and reliability.\n- Contributed to code reviews and mentoring junior developers in **Git** version control practices, promoting team collaboration and code quality standards.\n- Engaged in performance tuning and optimization of existing applications, successfully increasing system performance metrics by up to **40%** through efficient coding and database management practices.\n- Developed user-centric e-commerce features, ensuring secure transactions and compliance with industry standards, thereby enhancing overall customer experience and satisfaction.\n- Established a culture of continuous improvement, which facilitated the adoption of best practices in software development and operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained web applications using **PHP** and **Symfony**, ensuring high performance and responsiveness to requests from the front-end.\nManaged databases with **MySQL** and **PostgreSQL**, optimizing queries and indexing to improve data retrieval times by **30%**.\nDesigned and implemented RESTful APIs with **JSON** to facilitate seamless communication between front-end applications and back-end services, adhering to best practices in API design.\nUtilized **Git** for version control and collaborated with team members effectively through feature branches and pull requests, achieving a **95%** success rate in code reviews.\nImplemented CI/CD pipelines using **Docker** and cloud services to automate deployments, resulting in a **40%** reduction in deployment times.\nEngaged in Agile practices, participating in daily stand-ups, sprint planning, and retrospectives within a **Scrum** framework to enhance team productivity and project visibility.\nConducted comprehensive testing using unit and integration tests, improving code quality and reducing bugs in production by **25%**.\nIntegrated e-commerce features into applications, enhancing user experience and driving online sales growth by collaborating with cross-functional teams.\nLeveraged Lean methodologies to streamline processes and improve the overall efficiency of project deliveries, ensuring alignment with business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable and high-performance backend services using **PHP** (with **Symfony**) to support a global e-commerce platform.\nDesigned and implemented RESTful APIs ensuring robust data handling via **MySQL** and **PostgreSQL**, achieving a data retrieval speed improvement of **15%**.\nExecuted CI/CD pipeline enhancements through **Git** and **Docker**, ensuring streamlined code deployments and reducing release times by **30%**.\nApplied comprehensive testing strategies to maintain code quality, achieving a **90%** unit test coverage across all services.\nUtilized agile methodologies like **Scrum** and lean practices to enhance team collaboration and project delivery time, reducing cycle times by **25%**.\nEngineered user-centric e-commerce interfaces using frontend technologies, ensuring seamless integration with backend services for an enhanced shopping experience.\nMaintained cloud infrastructure for service deployment, optimizing for performance and reliability in an e-commerce environment.\nImplemented features focused on e-commerce and SaaS applications, driving customer engagement through optimized processes and workflows, resulting in a **20%** increase in user retention.\nFostered collaboration and communication across cross-functional teams to ensure project alignment and timely delivery using agile practices."
    }
  ],
  "skills": "\"**Programming Languages:**\n\tPython, PHP, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Symfony\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST, JSON\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCloud\n\n**Other:**\n\tAI & ML (MLflow, Airflow, Kubeflow), Git, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), CI/CD, E-Commerce, SaaS, Agile, Lean, Scrum, Testing\"",
  "apply_company": "brickfox Multichannel eCommerce"
}