{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Operations Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Operations Engineer with 13+ years of experience and a robust skill set in **Linux**, **Networking**, **Data Center** management, and **GPU** utilization. Proficient in **Kubernetes** for container orchestration, and capable of using **Grafana** and **Prometheus** for monitoring applications and infrastructure performance. Expert in **Python**, **Bash**, and **PowerShell** scripting for automation and troubleshooting, ensuring optimal operational efficiency.\nAdept at creating comprehensive documentation and facilitating effective collaboration across teams. Demonstrated flexibility and problem-solving capabilities in dynamic environments. Proven record of delivering high-performance applications across healthcare and financial sectors, leveraging skills in **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in AI/ML platforms, cloud-native systems deployment on **AWS** and **Azure**, and microservices architecture.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Operations Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Linux** environments for managing and optimizing cloud-based data center operations, ensuring high availability and performance for critical applications.\nExecuted **Kubernetes** for orchestration, monitoring, and scaling of containerized applications, ensuring robust performance through tools such as **Prometheus** and **Grafana** for real-time monitoring and alerting.\nImplemented troubleshooting protocols for networking issues, fostering quick resolution and minimizing downtime across systems through effective **Bash** and **PowerShell** scripting.\nDesigned and maintained comprehensive documentation for operational procedures, enhancing team collaboration and cross-department integration across the organization.\nCollaborated with developers and product teams to resolve system performance bottlenecks, employing a flexible approach to problem-solving and adaptive tactical strategies.\nEngineered scalable architectures leveraging **GPU** resources for computational tasks, optimizing workloads for machine learning applications and data processing on a large scale.\nFacilitated incident management processes through proactive monitoring and analytics, improving overall system response and operational efficiency by **20%**.\nTrained team members on best practices in **Kubernetes** operations, documentation standards, and troubleshooting techniques, fostering a culture of knowledge sharing and capacity building.\nDeveloped customized monitoring solutions using **Grafana** and **Prometheus**, enhancing visibility into system health and performance metrics, leading to reduced incident response times by **30%**.\nEngaged in continuous improvement initiatives, proposing innovative solutions to enhance data center infrastructure and network performance, achieving a **15%** increase in overall system uptime."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Ensured seamless **Linux** environment management to support the migration and modernization of core financial platforms, enhancing efficiency and reliability across systems.\nImplemented effective **Networking** solutions for robust communication between microservices, utilizing tools like **Kubernetes** to manage container orchestration for high-volume transactions.\nMonitored system performance and reliability using **Grafana** and **Prometheus**, facilitating proactive troubleshooting and problem-solving across financial platforms.\nEnhanced documentation practices for infrastructure processes, promoting collaboration and flexibility among team members in addressing system challenges.\nUtilized advanced **Python** scripting for automating operational tasks, contributing to reliable data flows and operational efficiencies.\nLeveraged **Bash** and **PowerShell** scripting for implementing system upgrades and managing configurations in multi-environment deployments.\nFostered a culture of continuous improvement by applying principles of collaboration in alignment with operational goals, driving successful outcomes in complex environments."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Managed **Linux** server environments to ensure optimal performance and uptime for applications, employing best practices in **networking** and data center operations.\nUtilized **Kubernetes** for container orchestration, enhancing deployment strategies and scaling efficiency while monitoring system health and application reliability using **Grafana** and **Prometheus**.\nStreamlined troubleshooting processes to effectively manage downtime, rapidly resolving issues in collaboration with application teams, thus improving mean time to recovery (MTTR) by up to **30%**.\nDeveloped custom scripts in **Python** and **Bash** to automate system monitoring and maintenance, significantly reducing manual efforts and operational overhead, cutting down job tasks by **40%**.\nImplemented comprehensive documentation practices to facilitate knowledge sharing and collaboration among team members, ensuring flexibility in operations and adherence to corporate standards.\nApplied solid problem-solving skills to identify and resolve complex system issues, with experience in GPU optimization, enhancing application performance by **20%** in key workloads.\nLeveraged **PowerShell** for automated infrastructure management, streamlining workflows across multiple environments and ensuring consistent operational stability.\nPromoted a culture of continuous improvement in IT operations through effective collaboration and regular team meetings, resulting in increased project success rates by **25%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Bash, PowerShell\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **API Technologies:**\n\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, S3\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\tMonitoring: Grafana, Prometheus\n\n **Cloud & Infrastructure:**\n\tAWS RDS, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tAI & ML: MLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n\tNetworking, Linux, Data Center, GPU, Troubleshooting, Documentation, Collaboration, Flexibility, Problem Solving",
  "apply_company": "CoreWeave"
}