{
  "name": "Patryk Zaslawski",
  "role_name": "AI Prompt Engineer & Quality Tester",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a results-driven AI Prompt Engineer & Quality Tester, I bring expertise in **Natural Language Processing (NLP)**, **Machine Learning**, and **Data Science**, utilizing cutting-edge technologies like **OpenAI**, **Gemini**, and **Anthropic models**. With a solid foundation in **Prompt Engineering**, I effectively design and refine prompts to optimize AI model performance. My analytical skills and problem-solving abilities empower me to tackle complex challenges and deliver innovative solutions. Additionally, my background as a Senior Python Full Stack Developer with 8+ years of experience enhances my technical proficiency in **Python** (FastAPI, Django, Flask), **cloud platforms** such as **AWS** and **Azure**, and database management with **PostgreSQL**, **MySQL**, and **MongoDB**. My strong communication skills and experience in client-facing roles enable me to collaborate effectively with diverse teams and stakeholders, ensuring that solutions are aligned with business needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "AI Prompt Engineer & Quality Tester",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Large Language Models (LLMs)** and **Natural Language Processing (NLP)** techniques to enhance the performance of AI-driven applications in healthcare, focusing on real-time data analysis and user interaction.\nConducted **Machine Learning** experiments and data analysis to improve model accuracy and relevancy, ensuring high-quality data output for downstream applications.\nEngaged in **Prompt Engineering** to develop effective prompts for various AI models including **OpenAI**, **Gemini**, and **Anthropic models**, resulting in a **25%** increase in response accuracy.\nApplied analytical skills to solve complex problems related to user interactions, leading to a **30%** reduction in error rates during content generation.\nCommunicated effectively with cross-functional teams, presenting findings and suggestions for improvements, contributing to a **15%** acceleration in project timelines.\nParticipated in client-facing roles, gathering feedback to refine model outputs and ensuring alignment with client expectations in deliverables.\nExecuted test strategies for AI models using **Python**, ensuring comprehensive quality assessments that adhered to industry standards.\nConducted regular audits on AI model performance, applying metrics and analysis to guide necessary improvements and ensure consistent delivery of high-quality outputs.\nMentored peers in **Machine Learning** basics and the usage of modern AI tools and frameworks, fostering a collaborative environment focused on skill enhancement.\nDeveloped comprehensive documentation of AI implementations and testing protocols to enable knowledge sharing and project scalability within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Applied **Natural Language Processing (NLP)** techniques to enhance the interaction of **Large Language Models (LLMs)** with users, improving response accuracy by **30%**.\n• Leveraged **Machine Learning** algorithms to develop predictive models that analyze user inputs, resulting in a **40%** increase in client engagement.\n• Designed prompt engineering strategies for **OpenAI** and **Gemini** integrations, enabling dynamic responses to user queries with **95%** relevancy.\n• Conducted rigorous quality testing of AI outputs to ensure precision and compliance with user expectations, thereby reducing error rates by **25%**.\n• Collaborated with cross-functional teams to identify areas for improvement in AI performance, enhancing overall product effectiveness through problem-solving and analytical skills.\n• Created detailed documentation and reports for client-facing roles, enhancing communication about AI capabilities and functionalities.\n• Engaged in regular updates and training sessions on emerging technologies like **Anthropic models** and their implications in data science, ensuring the team is knowledgeable and agile.\n• Utilized **Data Science** principles to derive actionable insights from AI interactions, guiding strategic decisions in AI development.\n• Developed and maintained relationships with clients to gather feedback and enhance product performance, demonstrating strong communication skills and client-centric approach."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Natural Language Processing (NLP)** techniques and tools to analyze and enhance user interactions with AI models, demonstrating **analytical skills** and **problem-solving** capabilities.\nDesigned and implemented prompt engineering strategies to optimize responses in **Large Language Models (LLMs)** like **OpenAI** and **Anthropic models**, ensuring clear communication and client alignment.\nCollaborated with cross-functional teams to integrate **machine learning** models effectively, showcasing **communication skills** in client-facing roles while conducting quality testing.\nAnalyzed model performance metrics and provided actionable insights to improve AI functionalities, applying **data science** principles and **analytical skills** to validate findings.\nCreated comprehensive testing protocols for AI systems, employing systematic approaches to measure performance and functionality, ensuring the high-quality delivery of AI solutions.\nPerformed user feedback analysis on generated outputs from **Gemini** and other LLMs, integrating human-in-the-loop feedback into models for continual improvement.\nDeveloped documentation and training materials for end-users and stakeholders to facilitate understanding and effective use of AI tools, showcasing strong **communication skills**.\nEngineered automated testing frameworks to evaluate prompt effectiveness and model responsiveness, leading to a measurable enhancement in user experience.\nConducted workshops and demos with clients to illustrate AI capabilities and foster a collaborative environment, emphasizing the importance of **client-facing** interactions.\nLeveraged advanced metrics and analytical tools to assess quality assurance in AI outputs, ensuring alignment with business goals and user expectations."
    }
  ],
  "skills": "**Other**\n\tLarge Language Models (LLMs), Natural Language Processing (NLP), Machine Learning, Data Science, OpenAI, Gemini, Anthropic models, Prompt Engineering, Analytical Skills, Problem-Solving, Communication Skills, Client-facing Roles\n\n**Programming Languages**\n\tPython\n\n**Backend Frameworks**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies**\n\tREST & gRPC APIs\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Cloud & Infrastructure**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis"
}