{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Frontend Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 8+ years of experience in software development, specializing in building high-performance applications with a robust tech stack that includes **React**, **Next.js**, **TypeScript**, and **Tailwind**. Proficient in creating RESTful and GraphQL APIs, and utilizing testing frameworks such as **Jest** and **React Testing Library** to ensure quality and reliability. Strong understanding of frontend design principles with experience using **Figma** and adhering to **WCAG** standards for accessibility. Demonstrated ability to work with CI/CD pipelines for seamless deployment and version control. My background in full-stack development, including technologies like **Python** (with **Flask** and **Django**), and experience in cloud services like **AWS** and **Azure**, equips me with a comprehensive understanding of the software development lifecycle and best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed user interfaces using **React**, **TypeScript**, and **Next.js**, ensuring compliance with **WCAG** standards for accessible digital experiences.\n- Created reusable components with **Tailwind** to improve design consistency and efficiency across applications, achieving a **30%** reduction in development time for new features.\n- Designed and implemented RESTful and GraphQL APIs for seamless interactions between frontend components and backend services, increasing API response efficiency by **25%**.\n- Conducted unit and integration testing using **Jest** and **React Testing Library**, raising code coverage to **90%** and enhancing system reliability.\n- Collaborated with UX/UI designers utilizing **Figma** to align on design specifications, ensuring a polished and user-centric interface.\n- Leveraged **CI/CD** practices to automate deployment processes, which improved release cycles by **40%** and ensured consistent delivery of updates.\n- Engaged in performance optimization strategies, resulting in a **50%** reduction in page load times through effective code splitting and lazy loading techniques.\n- Led code review sessions to promote best practices and standards in **React** and **TypeScript**, fostering continuous learning among team members.\n- Participated in agile ceremonies, contributing to sprint planning and retrospective meetings to enhance team efficiency and alignment on project goals.\n- Mentored junior engineers in frontend technologies and best practices, enhancing team skills and ensuring robust code practices."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-centric frontends with **React** and **Next.js**, utilizing **TypeScript** and **Tailwind** to create responsive interfaces that adhere to **WCAG** standards, ensuring accessibility and usability for all users.\n• Implemented automated testing strategies using **Jest** and **React Testing Library** to enhance code reliability and maintain high-quality standards in frontend applications.\n• Collaborated with cross-functional teams to design and develop **RESTful** and **GraphQL** APIs integration, ensuring seamless communication between frontend and backend services.\n• Designed effective CI/CD pipelines using **Azure DevOps** and **GitHub Actions** to streamline code deployment, enhancing release efficiency and minimizing downtime.\n• Partnered with UI/UX designers to transform wireframes created in **Figma** into functional web applications, enhancing user experience through iterative design and feedback loops.\n• Conducted thorough code reviews and maintained documentation for frontend codebases, fostering a culture of knowledge sharing and best practices among team members.\n• Leveraged modern state management techniques with frameworks such as Redux and **NgRx** for consistent and predictable application behavior.\n• Optimized application performance by implementing lazy loading and code splitting techniques, resulting in a **30%** reduction in loading times for critical routes.\n• Integrated various third-party services and tools to enhance application functionality, ensuring effective content management and delivery through a reliable **CMS**.\n• Maintained strict adherence to coding standards and guidelines to ensure quality and security in all frontend solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Designed and developed responsive frontends using **React**, **Next.js**, and **TypeScript** while ensuring accessibility (WCAG) standards and cross-device compatibility for an enhanced user experience.\n• Implemented RESTful and **GraphQL** APIs to seamlessly connect frontends with backend services, facilitating real-time data exchange and improving application performance.\n• Created automated tests using **Jest** and **React Testing Library** to ensure code reliability, reducing defects and improving development speed by **30%**.\n• Enhanced user interface designs and prototypes using **Figma**, ensuring modern aesthetics and user-centric design principles.\n• Streamlined Continuous Integration/Continuous Deployment (CI/CD) processes to improve deployment efficiency by **25%**, using best practices in version control and application lifecycle management.\n• Collaborated with backend developers to design and optimize APIs, leading to reduced response times for user interactions by **40%**.\n• Developed component libraries and integrated them with design systems, promoting reusability and consistent UI/UX across applications.\n• Conducted performance optimization and load testing, ensuring applications could handle peak traffic loads and maintain smooth functionality under pressure.\n• Collaborated closely with product managers and stakeholders to translate business requirements into technical specifications, contributing to effective project planning and execution.\n• Actively participated in code reviews and team knowledge-sharing sessions, fostering a culture of continuous learning and improvement among team members."
    }
  ],
  "skills": "Programming Languages:\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Next.js, Angular, Vue.js, Blazor, Tailwind\n\n**API Technologies:**\n\tREST & gRPC APIs, RESTful, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Jest, React Testing Library, Playwright, Figma, WCAG, CMS, CI/CD",
  "apply_company": "Marketer"
}