{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior PHP Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a skilled Senior PHP Engineer with 8 years of experience, I possess a strong command of PHP, HTTP, and RESTful APIs, with a focus on designing robust web infrastructure that adheres to OOP, SOLID, and Clean Code principles. I am adept at implementing secure coding practices and applying design patterns to create scalable applications. My technical acumen includes proficiency in **Docker** for containerization, ensuring the security of web applications while maintaining compliance with industry standards.\n\nIn addition to my PHP expertise, I am experienced in mentoring junior developers, showcasing my commitment to team growth and knowledge sharing. My background encompasses a diverse tech stack that includes modern JavaScript/TypeScript, Python, and **Flutter**, as well as a comprehensive understanding of microservices architecture, event-driven systems, and CI/CD automation. I've successfully led projects integrating AI/ML capabilities for analytics, utilizing tools like **Knime** for machine learning pipelines. My strong problem-solving skills and effective communication contribute to building high-performance solutions in fast-paced environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained scalable web applications using **PHP**, ensuring adherence to web infrastructure standards and **OOP** methodologies.\n- Implemented **RESTful APIs** to enhance system interoperability and facilitate seamless communication between services.\n- Employed **Docker** for containerization and deployment of applications, streamlining development processes and ensuring consistent environments.\n- Guided development practices adhering to **SOLID** principles and **Clean Code** standards to improve code quality and maintainability.\n- Designed and implemented secure coding practices to protect applications against vulnerabilities and enhance web security.\n- Mentored junior developers on coding best practices, design patterns, and efficient problem-solving techniques, fostering a collaborative team environment.\n- Collaborated with cross-functional teams to strategize and resolve complex technical challenges, leveraging strong **communication** skills.\n- Actively participated in code reviews to ensure compliance with coding standards and technical guidelines, driving continuous improvement.\n- Facilitated the integration of third-party services with **HTTP** protocols, enhancing application capabilities while ensuring performance and security.\n- Worked on multi-environment deployments and various web security measures, minimizing risks and ensuring data protection."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Developed and maintained secure **RESTful APIs** using **PHP** to enhance web infrastructure and ensure compliance with **Clean Code** principles and **OOP** methodologies.\nImplemented best practices in software development, applying **SOLID** design patterns to optimize code maintainability and flexibility, resulting in a reduction of bugs by **30%**.\nLed the mentoring initiatives for junior developers, improving team productivity through effective communication and problem-solving techniques, achieving a **15%** increase in project timelines.\nUtilized **Docker** for containerization, improving deployment efficiency and scalability of applications across multiple environments, which decreased deployment time by **40%**.\nCollaborated on the development of high-performing applications in a **.NET Core** environment, enhancing system performance metrics by **25%** through code refactoring and optimization.\nImplemented robust web security measures to protect sensitive customer data, resulting in zero security breaches over a one-year period.\nExplored data-driven solutions by using **Knime** for data analytics purposes, integrating findings into web applications to improve user experience and engagement.\nConducted peer code reviews to maintain quality standards in the development process, effectively raising the bar for coding practices across the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Utilized **PHP** to design and implement **RESTful APIs** for scalable web infrastructure, ensuring adherence to **OOP** principles and **SOLID** design patterns for clean and maintainable code.\nEmployed **Docker** for containerization to streamline development and deployment pipelines across multiple environments, achieving a 30% reduction in onboarding time for new developers.\nMentored junior developers on secure coding practices and **web security** standards, fostering a culture of clean code and design patterns within the team.\nEngineered robust applications leveraging **C#** and **.NET Core**, focusing on building efficient back-end services that align with industry best practices and enhance user engagement.\nImplemented effective **HTTP** protocols within project architecture to optimize application performance and reliability, achieving faster response times by 25%.\nApplied **Knime** for data analysis and business intelligence, enhancing decision-making processes through data-driven insights, which resulted in a 15% increase in team productivity.\nFostered strong communication channels within the development team to facilitate efficient collaboration and problem-solving, contributing to a more cohesive workplace.\nDesigned and executed secure application workflows incorporating features like user authentication and authorization aligned with GDPR compliance, ensuring robust data protection strategies across all platforms."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript, PHP, C#, .NET Core\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tHTTP, RESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tweb infrastructure\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, OOP, SOLID, Clean Code, design patterns, secure coding, mentoring, problem-solving, communication, web security",
  "apply_company": "LastPass"
}