{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Unity Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Unity Engineer with 13+ years of experience in delivering high-performance applications and mobile performance optimization. Proficient in **Unity**, **C#**, and multithreaded programming, with a strong focus on enhancing mobile performance through advanced **GPU profiling** and **CPU profiling** techniques. Skilled in implementing asset streaming and leveraging the **Burst Compiler** for optimal performance, along with a comprehensive understanding of the **Job System** and various **profiling tools**.\n\nDemonstrated expertise in applying best practices in memory management and using diagnostics frameworks for troubleshooting and performance tuning. Excellent communication and mentoring skills enable effective collaboration and guidance within development teams. Background in building scalable AI/ML-powered platforms makes me adaptable to evolving tech landscapes.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Unity Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Optimized mobile performance for applications using **Unity** and **C#**, implementing advanced techniques to enhance user experience and ensure smooth gameplay across devices.\nDesigned and managed multithreaded programming paradigms using **ECS**, **DOTS**, and integrated profiling tools to achieve peak performance metrics.\nEmployed memory management strategies and **asset streaming** to reduce load times and improve runtime efficiency for games and applications.\nUtilized the **Burst Compiler** and **Job System** to enhance processing speed, leading to performance improvements by over **30%** in critical sections of the game engine.\nConducted thorough CPU and GPU profiling to identify bottlenecks and optimize graphics rendering and game mechanics in real-time scenarios.\nDeveloped telemetry systems and diagnostic frameworks to monitor application performance, ensuring a seamless user experience and rapid identification of performance issues.\nMentored junior developers in best practices for mobile game development, providing guidance on **Unity** workflows and optimizing coding standards.\nFacilitated effective communication within cross-functional teams to align on project goals and deliver high-quality gaming experiences.\nImplemented rigorous testing and profiling methodologies to ensure applications meet high standards of reliability and performance during development cycles.\nCollaborated with designers and artists to streamline asset workflows, improving loading times significantly by implementing various performance optimization strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Unity** and **C#** to develop high-performance mobile applications, ensuring mobile performance optimization for seamless user experiences.\nEmployed advanced strategies in **multithreaded programming** and utilized **ECS** (Entity Component System) and **DOTS** (Data-Oriented Technology Stack) to enhance application scalability and performance.\nImplemented rigorous **memory management** techniques and utilized profiling tools for **CPU** and **GPU profiling**, achieving performance boosts of up to **50%** in complex game scenarios.\nDesigned and implemented asset streaming capabilities, reducing load times by **30%**, thereby improving user engagement with mobile applications.\nOptimized code performance using the **Burst Compiler** and **Job System**, enabling efficient multi-core processing and improving the overall frame rates of applications significantly.\nConducted detailed analysis using telemetry systems to monitor application performance, making data-driven decisions to enhance user experience.\nMentored junior developers in best practices for **diagnostic frameworks** and communication skills, contributing to a collaborative and productive team environment.\nFostered a culture of continuous improvement by sharing insights on **performance optimization**, which led to the successful completion of over **10 high-impact projects** within tight deadlines."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied advanced **multithreaded programming** techniques and **memory management** strategies to enhance performance in Unity applications, resulting in a **30% reduction** in load times across key features.\nOptimized mobile performance using **Unity's DOTS** and **ECS architecture**, achieving peak frame rates and smooth user experiences across various devices.\nEngineered and implemented **profiling tools** for real-time analysis of game performance, including **CPU profiling** and **GPU profiling**, to identify performance bottlenecks, significantly improving application efficiency.\nUtilized the **Burst Compiler** to accelerate CPU-bound tasks, contributing to an overall performance boost of **25%** in computationally intensive operations.\nDeveloped robust asset streaming solutions to streamline the delivery of digital assets, leading to a **40% improvement** in memory load management without compromising the user experience.\nMentored junior developers on **communication skills** and best practices in **diagnostic frameworks**, fostering a collaborative and growth-oriented team culture.\nImplemented **telemetry systems** to gather and analyze performance data, providing actionable insights for continuous optimization and player engagement improvement.\nLed design reviews and provided constructive feedback, guiding the team in adherence to best coding practices and ensuring quality deliverables in Unity projects.\nKept abreast of the latest developments in **Unity** and related technologies, integrating new findings into the existing workflow to maintain a competitive edge in mobile game development."
    }
  ],
  "skills": " **Programming Languages:** \n\tC#, Python, JavaScript/TypeScript \n \n **Backend Frameworks:** \n\tFastAPI, Flask, Django \n \n **Frontend Frameworks:** \n\tReact, Vue, Angular, Unity \n \n **API Technologies:** \n\tNginx, OAuth2, JWT \n \n **Serverless and Cloud Functions:** \n\tAWS: Lambda, ECS, RDS, S3, Azure: App Services \n \n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis \n \n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n \n **Cloud & Infrastructure:** \n\tAWS, Azure \n \n **Other:** \n\tMLflow, Airflow, Kubeflow, mobile performance optimization, multithreaded programming, CPU profiling, GPU profiling, memory management, asset streaming, Burst Compiler, Job System, profiling tools, telemetry systems, diagnostic frameworks, communication skills, mentoring",
  "apply_company": "Fortis Games"
}