{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Systems Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Systems Engineer with 10+ years of expertise in delivering reliable and high-performance solutions in dynamic environments. Proficient in managing cloud platforms including **AWS**, **Azure**, and **GCP**, alongside a solid command of **Docker**, **Kubernetes**, and configuration management tools like **Ansible** and **Puppet**. Skilled in scripting and automation using **PowerShell** and **Python** to optimize system operations.\nExtensive experience with systems monitoring and logging using **ELK** and **Splunk** to ensure robust system performance and security. Versatile in managing Windows Server environments, including Active Directory and LDAP configurations, and proficient in backup strategies such as RAID.\nAdept at developing SaaS applications with a strong foundation in full stack technologies, including **.NET**. Demonstrates a proactive approach to driving system enhancements that deliver tangible results and align with compliance standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Systems Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, high-availability systems leveraging **Windows Server**, **Docker**, and **Kubernetes** for enterprise applications, ensuring robust performance and fault tolerance.\n• Utilized **PowerShell** and **C#** for scripting and automation of system tasks, enhancing operational efficiency and reducing manual workload by **30%**.\n• Developed and maintained cloud infrastructure across **AWS**, **Azure**, and **GCP**, optimizing resource allocation and reducing operational costs by **25%** through effective use of SaaS solutions.\n• Implemented enterprise-level monitoring and logging solutions using **ELK** and **Splunk**, allowing for enhanced visibility and proactive incident response across systems.\n• Led the orchestration of containerized applications using **Docker Swarm** and **Kubernetes**, achieving a deployment success rate of **99%**.\n• Configured and managed server virtualization with **Hyper-V**, facilitating resource management and load balancing, resulting in improved server uptime and performance.\n• Established secure access through **Active Directory** and **LDAP**, implementing best practices for user management and authentication across the network.\n• Automated system configuration and management with **Ansible** and **Puppet**, reducing deployment times and ensuring consistency across different environments.\n• Conducted performance tuning and system updates, achieving a consistent **15%** increase in application response times and system throughput.\n• Collaborated with cross-functional teams to drive system integrations and enhancements, ensuring alignment with business goals and technical requirements.\n• Provided technical expertise and troubleshooting support for system issues, maintaining a resolution time of **under 4 hours** on average for critical incidents."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Leveraged **Azure** to manage cloud infrastructures, ensuring seamless integration and operational effectiveness for multi-tenant environments.\n• Orchestrated containerization and orchestration using **Docker** and **Kubernetes**, boosting deployment efficiency and application scalability by **40%**.\n• Monitored and optimized systems performance employing **ELK** stack and **Splunk**, achieving a **30%** reduction in downtime and enhancing incident response times.\n• Developed automation scripts in **PowerShell** for configuration management tasks, reducing manual errors by **25%** and increasing system reliability.\n• Integrated **Windows Server** environments with **Active Directory** for enhanced security and user management, simplifying user authentication processes by **50%**.\n• Configured and maintained **AWS**, **Azure**, and **GCP** resources for comprehensive cloud solutions, achieving resource cost optimization by **20%**.\n• Implemented robust backup solutions using **RAID** technology and disaster recovery strategies, improving system resilience against data loss events.\n• Utilized **.NET** and **Python** frameworks to develop automation tools that streamlined operational processes and reduced provisioning times for new services by **35%**.\n• Enhanced systems performance through continuous monitoring and feedback loops involving **Ansible** and **Puppet**, enabling quicker configuration deployments and system updates.\n• Worked on incident management processes utilizing tools like **SCCM** and **SCOM**, ensuring compliance and governance across all systems."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented infrastructure as code for **Windows Server**, **Docker**, and **Kubernetes**, ensuring scalable deployment and management of applications in multiple cloud environments, including **AWS**, **Azure**, and **GCP**.\nConfigured and managed system monitoring and logging tools such as **ELK** stack and **Splunk**, achieving a **90%** reduction in incident response time through proactive system health analysis.\nAutomated system provisioning and configuration management using **Ansible** and **Puppet**, enhancing deployment efficiency by **75%** and enabling consistent environments across platforms.\nDeveloped and maintained CI/CD pipelines leveraging **Azure DevOps** and **Git**, deploying applications with a **99.9%** uptime guarantee via automated testing and rolling updates.\nDesigned and managed highly available and fault-tolerant storage solutions using **RAID** technology, improving data redundancy and recovery time objectives by **50%**.\nExecuted backup and disaster recovery strategies utilizing **SCCM** and **Hyper-V**, ensuring system resilience and data integrity across critical applications and services.\nImplemented secure access controls using **Active Directory**, **LDAP**, and role-based access control (RBAC) for user management and compliance with information security regulations.\nUtilized **PowerShell** scripts for system automation and reporting, enabling streamlined operations management across a diverse infrastructure landscape.\nCollaborated on SaaS product development, integrating **.NET** and **C#** technologies to enhance back-end functionalities and support business growth objectives."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, C#, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Puppet\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Windows Server, Hyper-V, SCCM, SCOM, ELK, Splunk\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, SaaS, Authentication & Security: Let’s Encrypt, Nginx, Certbot, RAID, LDAP, Active Directory, PowerShell",
  "apply_company": "Bullhorn"
}