{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior PHP Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior PHP Engineer with over 8 years of experience in full-stack development, specializing in building secure and performant web solutions. Proficient in **PHP**, **RESTful APIs**, and design patterns, with a strong foundation in Object-Oriented Programming (OOP), SOLID principles, and Clean Code methodologies.  Adept at implementing secure coding practices and web security measures that ensure compliance.\n\nSkilled in enhancing web infrastructure and leveraging **Docker** for containerization, I have a proven track record in collaborating with teams to foster a culture of mentorship and continuous improvement. My problem-solving abilities, coupled with effective communication skills, enable me to deliver high-quality software solutions while mentoring junior developers. Furthermore, I possess substantial experience in integrating modern technologies such as **JavaScript**, **TypeScript**, and **Python**, with machine learning components, fostering innovation in the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable web infrastructure utilizing **PHP** for backend services, focusing on **RESTful APIs** to ensure seamless integrations and data exchange.\nEmployed **OOP**, **SOLID** principles, and **design patterns** in code architecture, ensuring adherence to **Clean Code** practices for improved code maintainability and readability.\nImplemented secure coding practices to enhance web security, protecting sensitive data and ensuring compliance with industry standards.\nCollaborated with cross-functional teams to gather requirements and deliver solutions that align with business objectives, leveraging strong **communication** and **collaboration** skills.\nMentored junior developers by conducting code reviews, guiding best practices in **problem-solving**, and sharing knowledge of **Docker** for containerization and deployment.\nArchitected cloud-native applications, focusing on performance optimization and scalability, enhancing user experiences for web applications.\nUtilized debugging tools and methodologies to identify and resolve complex issues, improving application stability and reliability.\nLed projects utilizing **HTTP** protocols, implementing caching strategies and optimizing load times for enhanced performance.\nDesigned and executed testing strategies using tools like PHPUnit, ensuring high code quality and performance before deployment, achieving over **95%** code coverage.\nIntegrated robust logging and monitoring solutions, empowering proactive troubleshooting and system maintenance to ensure high uptime and responsiveness. \nFostered a culture of continuous improvement by encouraging team collaboration and regular knowledge-sharing sessions."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **secure coding** practices while developing robust and scalable applications using **PHP** and **RESTful APIs**, ensuring high standards of **web security** across all platforms.\nUtilized **OOP** principles and applied **design patterns** to enhance code quality and maintainability, adhering to **SOLID** principles and **Clean Code** methodologies.\nStreamlined web infrastructure deployment through the use of **Docker**, achieving consistent development environments and facilitating smooth continuous integration and delivery (CI/CD) processes.\nMentored junior developers in best practices for **PHP** coding, instilling strong problem-solving skills and encouraging collaborative communication within the team.\nLed the development of a new financial services application that increased system performance by **45%**, leveraging the latest frameworks and ensuring adherence to industry standards.\nCollaborated with cross-functional teams to identify and resolve complex issues, successfully reducing bug rates in released code by **30%** through comprehensive code reviews and testing.\nChampioned the implementation of **HTTP** protocols to improve API performance, achieving a **25%** faster response time on critical transactional services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust **RESTful APIs** using **PHP**, ensuring adherence to best practices in **OOP**, **SOLID**, and **Clean Code** principles for high-quality web infrastructure.\n- Implemented and optimized server-side applications focused on secure coding practices and modern design patterns, enhancing overall system security and performance.\n- Collaborated with cross-functional teams to deliver scalable solutions, showcasing strong communication and problem-solving skills that improved project timelines by **25%**.\n- Designed Docker containers for deploying PHP applications, streamlining the development and production workflows with an emphasis on **web security**.\n- Mentored junior developers on coding standards and best practices, fostering a collaborative work environment and boosting team productivity by **15%**.\n- Engaged in code reviews to uphold high standards of **secure coding** and adherence to industry standards, improving code quality by reducing bugs by **30%**.\n- Participated in architectural discussions to refine and evolve the web infrastructure, ensuring alignment with business goals and technical viability.\n- Utilized tools and frameworks to streamline deployment processes and enhance the overall reliability of services.\n- Actively contributed to the establishment and enforcement of development and operational procedures, empowering the team to meet and exceed project expectations."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, PHP\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tHTTP, RESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n**Cloud & Infrastructure:**\n\tDocker, AWS, Azure\n\n**Other:**\n\tOOP, SOLID, Clean Code, design patterns, secure coding, web infrastructure, web security, mentoring, problem-solving, collaboration, communication",
  "apply_company": "LastPass"
}