{
  "name": "Patryk Zaslawski",
  "role_name": "Python Developer with Machine Learning Focus",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a detail-oriented and self-starter Python Developer with a focus on Machine Learning, I bring over 8 years of experience in backend development and AI automation. Proficient in **Python** and its frameworks including **FastAPI**, **Django**, and **Flask**, I excel at creating high-performance solutions that leverage machine learning technologies and cloud platforms such as **AWS**, **GCP**, and **Azure**. I have a strong foundation in **testing** methodologies to ensure code quality and reliability in every deployment. My expertise also encompasses modern frontend technologies like **React**, **Angular**, and **Vue**, ensuring a full-stack approach to application development. With robust organizational skills and a growth mindset, I thrive in collaborative environments focused on delivering enterprise-grade solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Python Developer with Machine Learning Focus",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Python** to develop and optimize machine learning algorithms, enhancing predictive capabilities in healthcare applications, while reducing processing time by **30%**.\nImplemented backend services using **AWS** and **Azure** cloud platforms, facilitating scalable deployment and high availability solutions, decreasing downtime by **25%**.\nDesigned and executed data pipelines leveraging **GCP** to efficiently process and analyze large datasets, achieving a **50%** improvement in data ingestion and transformation times.\nExecuted comprehensive testing using CI/CD practices, employing frameworks such as PyTest and unittest, ensuring a **90%** test coverage for robust application performance.\nLed and mentored a cross-functional team on backend development strategies using **Python**, fostering a collaborative environment that improved project delivery times by **20%**.\nStreamlined communication processes within teams using agile methodologies, enhancing team organization and project tracking effectively.\nMaintained a detail-oriented approach to improving code quality and implementation of best practices within the development workflows, leading to increased team productivity.\nPromoted continuous learning by sharing insights into the latest advancements in **AI Automation**, ensuring the team stayed updated with emerging technologies in the field.\nDeveloped APIs and microservices that integrated machine learning models into existing systems, optimizing service operations for end-users through real-time data processing and AI features."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Leveraged **Python** to build scalable backend systems focusing on **Machine Learning** capabilities and AI automation through integration with **AWS** and **Azure** cloud services.\n• Developed and maintained **Python** microservices, implementing automated testing frameworks to ensure consistent quality and performance.\n• Utilized **GCP** for data analysis and machine learning model deployment to enhance backend processes, achieving processing speeds of up to **50%** faster than previous implementations.\n• Designed and implemented RESTful APIs using **Python** ensuring secure communication and data transactions, handling over **10,000** requests per minute.\n• Managed cloud deployments through **Azure** to enhance system reliability, achieving an uptime of **99.95%** across services.\n• Employed **AWS Lambda** for serverless architecture, streamlining ETL processes and reducing deployment time by **30%**.\n• Collaborated on cross-functional teams to ensure integration of AI automation within applications, contributing to improved decision-making processes.\n• Maintained detailed documentation of all processes, enhancing organizational skills and communication within the team.\n• Demonstrated aptitude for detail-oriented tasks, refining algorithms and data processing methodologies to improve output accuracy by **25%**.\n• Engaged in continuous learning and adaptation, showcasing a growth mindset by mastering new technologies and methodologies in backend development."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and optimized backend services using **Python** for e-commerce platforms, incorporating **Machine Learning** techniques for enhanced personalization and user experience.\nDesigned, implemented, and improved machine learning models within backend systems, increasing recommendation accuracy by **30%** and enhancing customer engagement.\nLeveraged cloud services like **GCP**, **AWS**, and **Azure** to deploy scalable machine learning solutions, achieving a **99.9%** uptime for critical services.\nCreated robust RESTful APIs in **Python** to facilitate high-volume transactions, ensuring seamless interactions with frontend systems and handling **over 10,000** requests per minute.\nUtilized **SQLAlchemy** and other Python ORMs with databases like **PostgreSQL**, **SQL Server**, and **MySQL** to manage and optimize transactional data, improving query performance by **25%**.\nAutomated testing and deployment processes with **CI/CD pipelines** using **GitHub Actions** and **Jenkins**, reducing deployment times by **50%** and ensuring consistent feature delivery.\nContainerized applications using **Docker**, enabling efficient scalability across various environments and reducing deployment discrepancies by **40%**.\nIntegrated machine learning models with real-time data streams using **RabbitMQ** and **Kafka**, facilitating immediate updates and decision-making across applications.\nDeveloped complex backend functionality while prioritizing data integrity and error handling, ensuring high system reliability and availability.\nImplemented comprehensive testing strategies, including unit and integration tests with **PyTest** and automated UI tests using **Selenium**, which contributed to a **30%** decrease in production bugs.\nConducted performance testing and optimizations with tools like **Apache JMeter** and **Locust**, identifying and resolving bottlenecks to handle peak traffic loads with ease.\nEnsured secure API authentication and authorization using **OAuth 2.0**, maintaining compliance with best practices and delivering a secure user experience.\nCreated data visualization dashboards using **Grafana** for monitoring system performance and machine learning insights, improving visibility for stakeholders.\nMaintained clear and organized documentation of development processes and model performance, enabling better communication within teams and adherence to organizational standards."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQLAlchemy\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMachine Learning, AI Automation, Testing, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Communication, Detail-oriented, Organizational Skills, Self-starter, Growth Mindset"
}