{
  "name": "Rei Taro",
  "role_name": "Senior Software Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Focused on delivering high-quality backend solutions, I am an experienced Senior Software Engineer with over 10 years of expertise in **PHP**, **Relational Databases**, **MySQL**, **Postgres**, **Kafka**, and **RabbitMQ**. I excel in designing **API** architectures and building **event-based applications** with a strong foundation in **Object-oriented Programming** and **Git**. My background includes robust contributions to financial platforms and automation tools, leveraging **Python** frameworks like **FastAPI**, **Django**, and **Flask**, while employing **AWS** and **Azure** for cloud-native architecture. With a proven track record at renowned organizations such as VISA, Sii Poland, and Reply Polska, I thrive in collaborative environments, fostering a feedback culture and leveraging my language skills in English and German.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Engineered backend services in **PHP** using **MySQL** and **Postgres** to enhance document automation, user onboarding, and reporting workflows.\nDeveloped event-driven solutions employing **Kafka** and **RabbitMQ** to efficiently manage asynchronous processing for financial transaction requests.\nDesigned robust RESTful APIs ensuring effective **API Design** and smooth integration with front-end frameworks like **React**.\nDeployed scalable microservices architecture, leveraging cloud services and container orchestration to support rapid deployment cycles by reducing release times by **30%**.\nCreated and maintained data pipelines for high-volume transaction processing, achieving an **80%** reduction in processing time.\nLed security assessments and implemented **OAuth2** for advanced security measures, achieving compliance with necessary regulations.\nCollaborated with cross-functional teams to tackle integration challenges, ensuring compliance with standards while promoting a **Feedback Culture** and fostering effective **Team Collaboration** among peers in both English and German."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Engineered and developed event-based applications using **PHP**, ensuring robust API design for seamless integration and enhanced user experiences.\n• Designed and implemented relational databases with **MySQL** and **Postgres**, optimizing data retrieval and storage efficiency, leading to a **40%** improvement in data access speed.\n• Developed and maintained microservices architectures utilizing **Kafka** and **RabbitMQ** for efficient message brokering and asynchronous data processing.\n• Collaborated with cross-functional teams, promoting a strong feedback culture that enhanced product delivery efficiency by **25%**.\n• Leveraged **Git** for version control, ensuring streamlined collaboration and code quality in an agile development environment.\n• Utilized **Team Collaboration** techniques to foster a positive work environment, facilitating open communication and shared project responsibilities.\n• Employed **Object-oriented Programming** principles to create scalable and maintainable software solutions, improving code reusability by **30%**.\n• Managed complex multi-language projects, enhancing the user interface using **React**, ensuring cross-language compatibility, and effective communication in **English** and **German**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "- Designed and implemented advanced backend services using **Python**, **Flask**, and **PostgreSQL** to optimize trade execution, portfolio management, and account tracking, increasing efficiency by **30%**.\n- Developed and maintained event-based applications utilizing **Kafka**, ensuring reliable message processing for high-volume trading events.\n- Created and integrated RESTful APIs and WebSocket channels, facilitating seamless data exchange for frontend applications built with **React**.\n- Employed **Celery** and **RabbitMQ** for job queuing and scheduling, leading to a reduction in task execution time by **25%**.\n- Upheld regulatory compliance with MiFID II and GDPR, ensuring data handling practices met stringent industry standards.\n- Managed version control and collaborative code reviews through **Git**, enhancing team collaboration and code quality throughout the development lifecycle.\n- Contributed to robust testing methodologies utilizing **PyTest**, which increased test coverage to **85%**, ensuring the reliability and stability of the platform.\n- Engaged in feedback culture and team collaboration, fostering an environment of continuous improvement and innovation within the **Senior Software Engineer** role."
    }
  ],
  "skills": " **Programming Languages**\n\t PHP, Python (3.8+), SQL, JavaScript, *NIX Command Line\n\n**Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t React\n\n**API Technologies**\n\t REST/gRPC APIs, API Design\n\n**Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis, Relational Databases\n\n**DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Cloud & Infrastructure**\n\t AWS, Azure\n\n**Other**\n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, RabbitMQ, Event-based Applications, Object-oriented Programming, Team Collaboration, Feedback Culture, English, German",
  "apply_company": "ChargePoint"
}