{
  "name": "Tomasz Lee",
  "role_name": "Engineering and Research Intern",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Engineering and Research Intern with deep expertise in **Python** and **Machine Learning** techniques. Proficient in **Deep Learning** using frameworks like **PyTorch**, and skilled in performance analysis and optimization techniques, including **Model Compression**, **Pruning**, and **Quantization**. Strong foundation in algorithms and mathematical fundamentals, facilitating effective test design and scientific computing. Equipped with excellent communication and documentation skills to support collaboration and knowledge sharing across teams. Leverages 9+ years of technology experience in application design and development, delivering innovative solutions in dynamic environments.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Engineering and Research Intern",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** for developing algorithms that enhance model performance and efficiency in a deep learning environment.\nConducted performance analysis and optimization using machine learning techniques, improving model accuracy by **15%**.\nEngaged in test design strategies to validate models, ensuring rigorous evaluation and reliability of outputs.\nCollaborated with teams to develop scalable solutions by applying advanced mathematical fundamentals in algorithms.\nImplemented **PyTorch** and other **DL frameworks** to create and train deep learning models, achieving reduction in training time by **30%**.\nDeveloped and documented model compression techniques including **pruning**, **quantization**, and **distillation** to enhance model deployment efficiency.\nApplied neural architecture search methodologies for optimizing model hyperparameters, leading to performance gains of **10%**.\nConducted scientific computing tasks to support the analysis and preprocessing of large datasets for machine learning experiments.\nExhibited exceptional communication skills in presenting complex findings and projects to non-technical stakeholders, enhancing collaboration.\nCreated technical documentation for research findings and model deployment practices, ensuring clarity and access for future reference."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Applied **Python** and **Deep Learning** techniques to analyze and optimize performance, contributing to a 20% increase in model accuracy.\nDeveloped and implemented **Machine Learning** algorithms, leveraging **PyTorch** for training and evaluating models with a focus on **Model Compression** and **Quantization**.\nConducted comprehensive **Performance Analysis** and **Test Design** to ensure robust and scalable solutions, streamlining processes by 30%.\nUtilized **Neural Architecture Search** methodologies to enhance model efficiency tailored to project requirements, resulting in a 15% reduction in computational resources.\nDocumented research methodologies and experimental results in a clear and concise manner, improving **Documentation Skills** within the team.\nCollaborated with peers to develop effective communication strategies, demonstrating strong **Communication Skills** during project presentations and updates.\nParticipated in team meetings to discuss **Scientific Computing** advancements and share insights on **DL Frameworks**, ensuring alignment on innovative approaches.\nEmployed mathematical fundamentals and algorithms to solve complex problems, enhancing overall project outcomes.\nMentored junior interns on best practices in **GPU Architecture** and model optimization techniques, fostering skill development and knowledge sharing.\nEngaged in continuous learning about new trends in **Deep Learning**, attending workshops and webinars, to keep the team updated on the latest advancements."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Applied strong **Python** skills to implement machine learning algorithms and enhance performance analysis, delivering models with improved accuracy by **15%**.\nUtilized **Deep Learning** frameworks, such as **PyTorch**, to develop and train neural networks for a variety of research projects, achieving a **10%** reduction in training time through optimization techniques.\nConducted rigorous performance analysis of models, using mathematical fundamentals to refine algorithms ensuring efficient computation.\nDesigned and executed test plans to validate model predictions, achieving a test coverage rate of **95%**.\nEngaged in scientific computing practices to solve complex problems, ensuring robust solutions aligning with research goals.\nDrove initiatives in model compression techniques, such as **pruning** and **quantization**, resulting in a **30%** decrease in model size without sacrificing accuracy.\nExplored advanced concepts like **neural architecture search** and **distillation** to improve model efficiency, contributing to innovations in project outputs.\nDocumented processes and findings meticulously, enhancing communication skills while transferring knowledge through technical documentation.\nCollaborated effectively in team meetings to discuss project updates and align research efforts with team objectives, reinforcing robust communication skills.\nProvided documentation for best practices and methodologies to encourage knowledge sharing among team members and improve overall project efficiency."
    }
  ],
  "skills": " **Programming Languages**\n\t Python, JavaScript, TypeScript\n\n **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t AWS, Azure\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\t CI/CD pipelines\n\n **Cloud & Infrastructure**\n\t Cloud & DevOps\n\n **Other**\n\t UX/UI Design, Git, GitHub, Deep Learning, Performance Analysis, Test Design, Algorithms, Mathematical Fundamentals, Machine Learning, Scientific Computing, DL Frameworks, PyTorch, Model Compression, Pruning, Neural Architecture Search, Distillation, Quantization, GPU Architecture, Communication Skills, Documentation Skills, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Redux"
}