{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Quality Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a forward-thinking Senior Quality Engineer with 8 years of full-stack development experience, I excel in ensuring the highest quality standards in software delivery through extensive expertise in **CI/CD** practices, **Regression Testing**, **Functional Testing**, and various testing frameworks including **Postman**, **Cucumber**, and **Playwright**. I effectively implement Agile methodologies such as **Scrum** and **Kanban** to drive project success and enhance team collaboration.\nI have a strong technical foundation in **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside my proficiency in **React**, **Next.js**, and **Vue**. My experience encompasses the development of enterprise-grade platforms within the healthcare and financial sectors, integrating advanced technologies like **AI/ML** for predictive analytics and real-time processing.\nWith a deep understanding of cloud services including **Azure** and **AWS**, I utilize microservices architecture and event-driven systems to build secure applications complying with regulations such as HIPAA and PCI DSS. I'm also skilled in developing machine learning pipelines and implementing **MLOps** workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Quality Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Designed and implemented enterprise-level **CI/CD** pipelines utilizing **GitHub Actions** for automated testing, security scans, and multi-environment deployments across web and API services.\n- Established comprehensive testing strategies including **Regression Testing** and **Functional Testing** to ensure quality across both front-end and back-end services using tools like **Postman**, **Cucumber**, and **Playwright**.\n- Collaborated with cross-functional teams in an **Agile** environment, employing methodologies such as **Scrum** and **Kanban** to deliver high-quality software products efficiently.\n- Developed and executed test cases that encompassed unit, integration, and E2E testing through frameworks like **Jest**, **Cypress**, and **PyTest**, ensuring adherence to industry standards and specifications.\n- Led initiatives to improve existing testing frameworks and tools, driving a **20%** reduction in the time taken for release cycles through enhanced automation and systematic regression strategies.\n- Coordinated with developers to identify and resolve defects, achieving a **95%** first-pass test success rate.\n- Improved test coverage by implementing **functional testing** practices and integrating feedback loops with development teams, leading to higher reliability and performance in software deliveries.\n- Participated in sprint planning and retrospectives, offering insights that improved team velocity by **15%**, demonstrating a commitment to continuous improvement and quality excellence."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Executed comprehensive regression and functional testing using **Postman** and **Cucumber** for validating backend APIs, ensuring robust performance and security across financial platforms.\nEmployed **Playwright** for automated UI testing of dynamic applications developed with **React (18)**, **Vue 3**, and **Next.js**, enhancing user interface reliability and performance metrics post-deployment.\nDesigned and implemented CI/CD pipelines leveraging **GitHub Actions** to streamline testing workflows and deployments across various environments, leading to a 30% reduction in deployment time.\nUtilized Agile methodologies including **Scrum** and **Kanban** to foster collaborative and efficient development practices, ensuring timely delivery of quality enhancements and bug fixes.\nConducted thorough testing of ETL pipelines built with **Apache Airflow** and **Azure Data Factory**, ensuring data integrity and compliance during batch and real-time data ingestion processes.\nParticipated in sprint retrospectives and planning meetings, contributing insights that led to a 25% improvement in sprint velocity and team efficiency.\nPerformed thorough regression testing on AI/ML models within the system, ensuring new features did not disrupt existing functionality, leading to a 40% decrease in post-release defects.\nDeveloped and maintained extensive test case repositories and documentation, facilitating knowledge sharing and onboarding of new team members."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Executed comprehensive **Regression Testing** and **Functional Testing** strategies using **Postman** to validate the functionality and performance of backend services in a global e-commerce platform.\nCollaborated in an **Agile** environment, deploying projects through **CI/CD** pipelines with **GitHub Actions**, ensuring efficient and consistent code integration and release cycles.\nMonitored and enhanced product quality by utilizing **Cucumber** for Behavior Driven Development (BDD), allowing for better collaboration between technical and non-technical team members.\nImplemented automated test scripts using **Playwright** to ensure user interface reliability and performance, leading to a **30%** decrease in UI-related defects in production releases.\nParticipated in daily **Scrum** meetings and conducted **Kanban** sessions to streamline workflow, enhance team collaboration, and adapt to changing project requirements efficiently.\nDeveloped and maintained comprehensive test documentation for a high-traffic e-commerce platform, ensuring clarity and consistency in testing protocols and outcomes, contributing to a **25%** faster onboarding process for new testers.\nAssisted in the identification and resolution of software bugs and glitches through extensive testing and collaboration with development teams, leading to an overall **15%** improvement in application quality and user satisfaction.\nContributed to the enhancement of quality assurance processes by providing feedback and suggestions based on testing results, ensuring continuous quality improvements and adaptations to new technologies."
    }
  ],
  "skills": " **API Technologies:**\n\tPostman\n\n **Testing Frameworks:**\n\tCucumber, Playwright, Regression Testing, Functional Testing\n\n **DevOps:**\n\tGitHub Actions, CI/CD\n\n **Project Management:**\n\tAgile, Scrum, Kanban\n\n **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n **Artificial Intelligence & Machine Learning:**\n\tMLflow, Airflow, Kubeflow\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n **Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **CI/CD & Infrastructure as Code:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Containerization:**\n\tDocker, Kubernetes\n",
  "apply_company": "Computer Futures"
}