{
  "name": "Tomasz Lee",
  "role_name": "Custom Solutions Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Skilled in developing **RESTful APIs**, microservices architectures, and implementing QA best practices, I am a .NET Full Stack Developer with 9+ years of experience in software development throughout the entire software development lifecycle. Proficient in **HTML**, **CSS**, **JavaScript**, and proficient in both frontend and backend technologies like **ReactJS**, **NextJS**, **.NET**, and **C#**. My expertise extends to leveraging **Apache Kafka**, **RabbitMQ**, and **Redis** for building robust distributed systems. I have a proven track record in project management, stakeholder communication, and cross-functional collaboration, having successfully led development teams to deliver complex custom solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Custom Solutions Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and developed RESTful APIs with **.NET 7** and integrated them with a MongoDB database to ensure seamless data access across services.\nSpearheaded the implementation of microservices architecture using **.NET Core**, improving system scalability and maintainability, and increasing deployment efficiency by **40%**.\nUtilized strong project management skills to oversee the software development lifecycle, ensuring all phases were completed on time and met stakeholder expectations.\nOptimized cross-functional collaboration by working closely with UX/UI designers to enhance the platform’s user interface, contributing to a **25%** increase in user satisfaction.\nImplemented QA best practices to streamline testing processes and ensure code quality, resulting in a **20%** reduction in average query execution time in **MSSQL**.\nConducted technical training sessions to onboard team members on using **HTML**, **CSS**, and **JavaScript** best practices, improving overall team productivity.\nDeveloped a robust reporting engine using **D3.js** and **Three.js** for interactive data visualizations, enhancing data presentation capabilities.\nManaged stakeholder communication effectively to align project goals and gather requirements accurately throughout the project lifecycle.\nIntegrating **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing bolstered system resilience and throughput.\nUtilized **Redis** for caching frequently accessed data, which led to a **35%** improvement in response times."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **RESTful APIs** to develop seamless integrations, enhancing overall system interoperability and client satisfaction.\nImplemented a microservices architecture with **RabbitMQ** for task orchestration and **Apache Kafka** for event-driven data processing, resulting in a **30%** increase in system scalability.\nLed the design and development of a cloud-based project management tool with **Angular** and **.NET Core**, contributing to a **15%** boost in team collaboration efficiency.\nOptimized data access through the development of **RESTful APIs** interfaced with a **PostgreSQL** database, enabling **real-time** data retrieval for users.\nIncorporated **HTML**, **CSS**, and **JavaScript** to develop engaging and user-friendly web interfaces, culminating in a **25%** enhancement in user engagement.\nEstablished CI/CD pipelines via **GitHub Actions**, successfully reducing production deployment errors by **30%**.\nManaged **MSSQL** and **MySQL** databases, consistently optimizing queries for a more efficient data retrieval process.\nFostered cross-functional collaboration with stakeholders to gather system requirements and establish clear development timelines for projects, ensuring timely and efficient project delivery.\nCoordinated technical training and created documentation to elevate team understanding and adherence to software development lifecycle practices, contributing to overall project success.\nDeveloped custom charts and graphs using **D3.js** for interactive project status tracking, enabling enhanced project management oversight.\nConducted thorough code reviews and mentorship for junior developers, significantly improving team productivity and adherence to QA best practices."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and implemented **RESTful APIs** to support micro-services architecture, enhancing system integration and communication.\n• Designed user interfaces with **HTML**, **CSS**, and **JavaScript** to deliver robust frontend experiences aligned with stakeholder requirements.\n• Contributed to the software development lifecycle (SDLC) by utilizing **Angular** and **.NET Framework**, improving team deliverables by **20%**.\n• Managed and retrieved customer information using **SQL Server**, which improved query efficiency metrics by **30%**.\n• Led the integration of **RabbitMQ** for asynchronous processing, ensuring that customer notifications were handled efficiently during peak usage.\n• Played an integral role in migrating legacy code from **ASP.NET WebForms** to **.NET Core**, resulting in enhanced system performance and maintainability by reducing load time by **15%**.\n• Collaborated with DevOps to automate deployment processes in **Azure**, reducing deployment time by **40%**.\n• Provided technical training and documentation for internal systems, fostering cross-functional collaboration and knowledge sharing.\n• Executed quality assurance (QA) best practices during development and testing phases to maintain high-quality deliverables.\n• Engaged in project management activities to align project goals with stakeholder expectations and ensure timely delivery.\n• Improved client-side dashboard functionalities using **Vue.js**, enhancing user experience by delivering features in a **1.5** version upgrade."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, HTML, CSS, TypeScript, Python\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tUX/UI Design, Git, GitHub, Redux, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, project management, stakeholder communication, software development lifecycle, QA best practices, cross-functional collaboration, technical training, documentation, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest"
}