{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior QA Engineer with 13+ years of experience ensuring high-quality software through rigorous **software testing**, **manual testing**, and **API testing**. Highly skilled in **automation** techniques and **test case design** with a strong focus on quality reporting. Proficient in leveraging collaborative tools and office software to enhance team communication and streamline workflows. Strong background in compliance-driven processes within the healthcare and financial industries, aligning solutions with regulatory standards. Original strengths include a robust foundation in **JavaScript/TypeScript**, **Python**, and **Flutter**, combined with hands-on experience in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Additionally, adept in building AI/ML-powered platforms and deploying cloud-native systems on **AWS** and **Azure**, emphasizing the importance of CI/CD in maintaining high standards of software reliability.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented robust **software testing** strategies using **Jest**, **Cypress**, and **Postman** to execute thorough manual and automation tests across full-stack applications, ensuring high-quality deliverables.\nDesigned detailed **test case design** frameworks, aligning with best practices and leveraging **ISTQB** standards to achieve comprehensive coverage in unit, integration, E2E, and contract testing.\nConducted **API testing** and ensured that all endpoints were performant and secured, utilizing tools like **Postman** and custom scripts for regression testing.\nCollaborated effectively with development teams using **collaborative tools** such as **Azure DevOps** and **GitHub Actions**, facilitating communication and enhancing the testing lifecycle.\nDeveloped quality reporting metrics to track testing progress and outcomes, contributing to strategic decision-making for software releases across healthcare and fintech platforms.\nMaintained documentation of testing processes and results using **office software** to ensure transparency and knowledge sharing among team members for future reference.\nEngaged in continuous communication with cross-functional teams to provide insights on testing progress and quality assurance efforts, fostering a culture of quality and collaboration within the organization."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed comprehensive testing strategies to ensure the quality and reliability of modern financial platforms by implementing software testing practices including:\n- **Manual testing** for effective validation of core functionalities, assuring a high user acceptance rate above **95%**.\n- Execution of **API testing** using tools such as Postman, ensuring smooth integrations and responsiveness with <= **200ms** latency.\n- Design and implementation of thorough **test cases** that cover both functional and non-functional requirements, contributing to a **50%** reduction in defects post-deployment.\n- Collaborated with cross-functional teams, utilizing collaborative tools like JIRA and Confluence to foster effective communication and reporting among team members.\n- Maintained quality reporting standards with a focus on continuous improvement, documenting insights and facilitating feedback loops with stakeholders.\n- Utilized **automation** testing frameworks to enhance regression testing efficiency, achieving an automation coverage ratio of **80%**.\n- Provided mentorship and guidance in **ISTQB** practices, promoting best practices in software quality assurance across the teams."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Ensured high-quality software through impactful **manual testing** and **automation** strategies for a global e-commerce platform, leading to a **30% reduction** in critical bugs pre-release.\nDesigned and executed comprehensive **test case designs** and **API testing**, verifying backend services developed using **Python (Django, FastAPI)** and **Node.js (NestJS, Express)** to meet rigorous quality standards.\nDeveloped and executed robust quality reporting frameworks, analyzing **test results** for accurate insights and actionable outcomes, resulting in a **20% improvement** in team response time when addressing defects.\nUtilized **collaborative tools** and **office software** to facilitate effective communication across development and QA teams, enhancing project workflows and ensuring comprehensive coverage of test scenarios.\nTrained and mentored peers on **ISTQB** principles, fostering a culture of quality and continuous improvement within the team, increasing efficiency across all testing phases.\nLeveraged modern **QA methodologies** to establish repeatable processes for regression testing, ensuring the stability of key platform features after updates, and maintained an excellent playback of over **90%** test coverage.\nConducted thorough analysis of user stories and acceptance criteria, developing test plans that aligned with the project goals and stakeholder expectations, contributing to an enhanced understanding of software functionality.\nImplemented quality checks within CI/CD pipelines that integrated with existing deployment tools, ensuring that new features and updates were seamless and risk-free for user experience."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django,\n\tJavaScript/TypeScript: React, Vue, Angular,\n\n **Backend Frameworks:**\n \n **Frontend Frameworks:**\n \n **API Technologies:**\n\tAPI testing,\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3,\n\tAzure: App Services, Blob Storage, SQL Database,\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare),\n\tMongoDB (Gaming), Redis,\n\n **DevOps:**\n\tDocker, Kubernetes,\n\tGitHub Actions, GitLab CI/CD,\n\tTerraform, Ansible, Helm, Docker Compose,\n\n **Cloud & Infrastructure:**\n\n **Other:**\n\tsoftware testing,\n\tmanual testing,\n\tautomation,\n\ttest case design,\n\tISTQB,\n\tquality reporting,\n\tcollaborative tools,\n\toffice software,\n\tcommunication",
  "apply_company": "Federation for Sustainable Entrepreneurship"
}