{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Rust Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Innovative and detail-oriented Senior Rust Engineer with 13+ years of experience in software engineering, adept at leveraging **Rust**, **gRPC**, and **cryptography** to develop secure and high-performance applications. Proficient in building robust systems utilizing **RocksDB** and **tonic** for efficient data storage and communication, while demonstrating a strong understanding of **TCP** and **QUIC** protocols.\n\nExperienced in the healthcare and financial industries, proficient in developing compliance-driven solutions aligned with industry standards. Demonstrated ability in cybersecurity measures to protect applications against vulnerabilities. Strong foundation in AI/ML technologies, including expertise with cloud-native systems on **AWS** and **Azure**, while implementing microservices and CI/CD practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Rust Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Rust** to design and implement high-performance backend services, emphasizing **gRPC** for efficient communication protocols.\nDeveloped and maintained secure applications with a focus on **cryptography** to protect sensitive data, ensuring compliance with industry standards.\nEngineered ultra-fast storage solutions using **RocksDB** to optimize data access and reduce latency for real-time applications.\nApplied modern networking protocols like **TCP** and **QUIC** to improve service reliability and performance across distributed systems.\nLed the integration of **blockchain** technology into platforms to enhance data integrity and security, promoting transparency in transactions.\nExecuted comprehensive security strategies to safeguard applications against vulnerabilities, leveraging solid principles of **cybersecurity**.\nCollaborated with cross-functional teams to drive software engineering best practices within the team, ensuring high code quality and maintainability.\nImplemented robust testing frameworks and methodologies to ensure product reliability, focusing on unit and integration testing strategies.\nConducted performance analysis and optimization processes that improved system efficiencies by **30%** and reduced average response times by **45%**.\nMentored junior engineers, fostering an environment of learning and collaboration while sharing best practices in **Rust** and software engineering principles."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Employed **Rust** programming language to develop high-performance microservices that effectively handle both real-time and batch processing tasks.\n• Integrated **gRPC** for efficient communication between services, enhancing the speed and reliability of system interactions and reducing latency by **30%**.\n• Implemented advanced **cryptography** techniques to secure data in transit and at rest, ensuring compliance with industry standards and enhancing system trustworthiness.\n• Leveraged **RocksDB** for optimized storage solutions, improving data retrieval speeds by **50%**, crucial for high-frequency transaction environments.\n• Developed and maintained high-throughput network protocols, utilizing **TCP** and **QUIC** for seamless data exchange, significantly enhancing user experience.\n• Conducted software engineering best practices to guarantee robust system architecture and maintainability, resulting in **40%** fewer production issues.\n• Collaborated on projects involving **blockchain** technology, exploring decentralized solutions for financial transactions.\n• Enhanced **cybersecurity** measures across platforms, conducting regular audits and implementing corrective actions to safeguard sensitive financial information.\n• Contributed to the development of efficient algorithms for data processing, positively impacting system performance metrics by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed secure and efficient backend services leveraging **Rust** and **gRPC**, ensuring high performance and reliability in data processing.\n- Applied advanced cryptographic techniques to enhance security measures, safeguarding sensitive data across distributed systems using **Rust** libraries.\n- Designed and implemented databases using **RocksDB** for high-speed transactions and data accessibility, handling over **10K transactions** per second in real-time applications.\n- Utilized **TCP** and **QUIC** protocols to optimize network performance and reduce latency, achieving response times under **50 ms** for critical service requests.\n- Contributed to software engineering best practices, achieving a **30%** reduction in code complexity by embracing modular design and thorough testing methodologies.\n- Leveraged blockchain technologies for secure, immutable transactions, enhancing trust and transparency in digital interactions.\n- Conducted systematic reviews of cybersecurity practices to prevent vulnerabilities, successfully reducing potential attack vectors by **40%**.\n- Collaborated with cross-functional teams to integrate complex systems, ensuring seamless communication and data integrity through robust APIs built with **tonic**.\n- Mentored junior developers in adopting **Rust** programming paradigms and best practices, resulting in improved team output and reduced onboarding time by **20%**.\n- Participated in the full software development lifecycle, from planning through deployment, achieving milestones consistently within **2-week sprint cycles**."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript/TypeScript, Rust\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tgRPC, OAuth2\n\n **Serverless and Cloud Functions:** \n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis, RocksDB\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS, Azure\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, Nginx, Let’s Encrypt, Certbot, cybersecurity, cryptography, software engineering, blockchain, TCP, QUIC",
  "apply_company": "IOTA"
}