{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Detail-oriented Senior QA Engineer with 13+ years of experience in delivering high-performance applications. Proven expertise in **testing**, particularly with an emphasis on **API** testing and **automation** strategies. Strong analytical skills complemented by proficiency in **documentation** and **reporting**. Adept in using **collaborative tools** to foster communication and teamwork across departments.\n\nSkilled in JavaScript/TypeScript, Python, and Flutter, with hands-on experience in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms that support predictive analytics, automation, and real-time processing. Proficient in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices, event-driven architectures, and CI/CD pipelines.\n\nWell-versed in compliance-driven development, aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong background in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented robust **testing** strategies across the stack using Jest, Cypress, Postman, and PyTest, ensuring comprehensive coverage of unit, integration, E2E, and contract-level tests to enhance software quality.\nConducted thorough **documentation** and **reporting** for testing results, clear communication of defects, and collaborating with development teams to ensure streamlined bug resolution.\nUtilized **automation** frameworks in various stages of the software development lifecycle, improving testing efficiency and reliability while reducing manual intervention by **30%**.\nActively participated in **collaborative tools** such as JIRA and Confluence for tracking testing progress, managing test cases, and maintaining comprehensive documentation for future reference.\nEngaged in continuous improvement through **analytical skills**, assessing test results and application performance to suggest enhancements to existing processes.\nDesigned and built full-stack platforms for healthcare and fintech using Python (**FastAPI**), TypeScript, and **Node.js**, paired with modern front-end frameworks like **React (17–18)**, **Next.js**, and **Vue 3**, ensuring full compliance with HIPAA, FHIR, GDPR, PCI DSS, and SOX.\nDelivered mobile applications for iOS and Android using **Flutter** and **React Native**, implementing native modules and managing state with Provider and **Redux** to support secure, real-time user interactions.\nCreated CI/CD pipelines tailored for mobile using **Fastlane** and **App Center**, incorporating test automation, release workflows, and crash analytics with **Firebase Crashlytics** and **Sentry**.\nLed the transformation of legacy systems into microservices architectures, leveraging **Docker**, **Kubernetes (AKS/EKS)**, and serverless functions via **AWS Lambda** and **Azure Functions** for fault-tolerant, scalable deployments.\nBuilt and maintained data infrastructure using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, designed to support heavy data ingestion and real-time analytics for both health and finance domains.\nDeployed ML models for risk scoring, fraud detection, and document classification using **scikit-learn**, **PyTorch**, and **TensorFlow**, with backend inference integrated into live systems.\nImplemented MLOps workflows using **MLflow**, **DVC**, and **Airflow**, managing model training, validation, and deployment pipelines across development and production.\nIntegrated intelligent features into frontend applications, such as personalized dashboards, predictive health alerts, and financial summaries, powered by models hosted on **Azure ML** and **AWS Sagemaker**.\nBuilt DevOps pipelines using **GitHub Actions**, **CircleCI**, and **Azure DevOps**, with full test automation, linting, security checks, and multi-environment deployment workflows.\nDeveloped advanced data visualization tools with **D3.js**, **Chart.js**, and **Power BI Embedded**, enabling real-time analysis of financial activity, fraud trends, and operational KPIs.\nCollaborated closely with ML teams to deploy NLP models (**spaCy**, **Hugging Face Transformers**) for document parsing and anomaly detection, exposed through secured REST APIs.\nIntegrated search capabilities with **Azure Cognitive Search** and **Elasticsearch**, supporting fast and flexible querying across structured and unstructured health and financial datasets."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conduct thorough **API** testing to ensure the reliability and performance of systems, utilizing **automation** tools to enhance efficiency and coverage.\nLeverage **collaborative tools** like JIRA and Confluence for effective project management and documentation, supporting cross-team communication and project alignment.\nDevelop detailed **documentation** for test cases, procedures, and reporting, ensuring compliance with **ISTQB** standards and practices for the QA process.\nUtilize strong **analytical skills** to interpret complex data sets and identify testing requirements, contributing to sound testing strategies and execution plans.\nEngage in regular communication with software developers and product teams to foster collaboration and ensure the timely delivery of high-quality software.\nImplement automated testing frameworks, enhancing code review and analysis through the usage of tools like Selenium and Postman.\nMonitor and report on testing progress, defect rates, and testing success metrics, leveraging data to drive actionable insights and improvements.\nContribute to a culture of quality assurance within the team, promoting best practices in testing and validation of financial systems to maintain high standards of performance."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Ensured the quality of backend services through rigorous testing methodologies, enhancing API reliability for a global e-commerce platform built using **Python (FastAPI, Django)** and **Node.js (NestJS, Express)**.\nAutomated testing processes using collaborative tools for integration and regression testing, resulting in a **30% reduction in bug resolution time**.\nConducted detailed documentation of testing strategies and results, facilitating improved communication amongst cross-functional teams and ensuring project transparency.\nDeveloped comprehensive test cases and reporting mechanisms covering both frontend (utilizing **React (18), Vue 3, Angular**) and backend technologies, thereby increasing test coverage to **95%**.\nLeveraged analytical skills to identify areas for improvement in existing functionalities, resulting in a **20% decrease in customer-reported issues**.\nEmployed ISTQB principles to create a structured testing environment that included manual and automated test suites, thereby contributing to continuous integration pipelines.\nSupported collaborative toolsets in managing bug tracking and test case documentation, enhancing team productivity and stakeholder communication throughout the testing phases.\nUtilized APIs to facilitate automated testing environments, increasing testing efficiency with a framework optimized for high-load scenarios.\nContributed to A/B testing and feature flags implementation to optimize user experiences and performance gains, in line with operational KPIs.\nProvided real-time reporting and insights post-testing phases to monitor performance based on user feedback and operational metrics."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tautomation\n\ttesting\n\tISTQB\n\tcollaborative tools\n\treporting\n\tanalytical skills\n\tdocumentation\n\tcommunication",
  "apply_company": "Fédération pour l'Entrepreneuriat Durable"
}