{
  "name": "Rei Taro",
  "role_name": "Senior HTML Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior HTML Engineer with strong expertise in crafting responsive web interfaces and ensuring cross-browser compatibility. Proficient in utilizing **HTML**, **CSS**, **SCSS**, **Sass**, and **Less** to design high-quality user experiences. Experienced with **Figma** for UI/UX design and equipped with extensive knowledge of front-end frameworks including **Bootstrap** and **Tailwind**. Skilled in version control using **Git** and modern build tools like **Gulp** and **Webpack**. Strong attention to detail and a collaborative approach, focused on delivering visually appealing and accessible designs. Previous experience includes delivering impactful projects in top-tier organizations, leveraging over 10 years of software development expertise, including backend systems with **Python** (FastAPI, Django, Flask) and cloud technologies like **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior HTML Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Leveraged **HTML**, **CSS**, and **SCSS** to create responsive and visually appealing web interfaces, ensuring cross-browser compatibility and an enhanced user experience for over **1000** users.\nImplemented UI/UX best practices using **Figma** and **Bootstrap**, leading to a **25%** increase in user engagement through effective design.\nUtilized **Git** for version control, managing code across **multiple repositories** and facilitating efficient collaboration within a team of **10** engineers.\nDeveloped interactive elements using **Canvas API**, **WebGL**, and **ThreeJS**, enhancing multimedia presentation on the platform.\nOptimized CSS animations and transitions, employing frameworks such as **Tailwind** and **GSAP**, which improved page load times by **30%**.\nSpearheaded the creation of dynamic HTML email templates that increased open rates by **15%**, utilizing techniques in **Pug** and **Handlebars**.\nConducted thorough testing for responsive design across different devices and browsers, ensuring high standards of cross-browser compatibility and user accessibility.\nMentored junior developers on best practices in **UI/UX** design and efficient **Gulp** and **Webpack** usage for streamlined workflow."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Focused on front-end development skills by:\n- Designed and developed dynamic user interfaces using **HTML**, **CSS**, and **JavaScript** frameworks such as **Angular**, achieving a **30%** improvement in load times and user engagement.\n- Implemented responsive design principles ensuring cross-browser compatibility across **5+** browsers, enhancing user experience by performing rigorous testing for **99.9%** functionality.\n- Collaborated with UX/UI designers using tools like **Figma** to execute pixel-perfect designs, ensuring designs were consistent over **20+** user interfaces.\n- Leveraged CSS preprocessors such as **Sass** and **Less** to maintain clean and modular code, reducing overall CSS file size by **25%**.\n- Engaged in version control using **Git**, effectively managing **3+** project branches for efficient team collaboration.\n- Enhanced application performance by implementing CSS animations and transitions, ensuring smooth user interactions and engaging experiences.\n- Participated in code reviews to ensure adherence to best practices, and collaborated daily with cross-functional teams to streamline development processes."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Focus on enhancing user interface design through the following responsibilities:\n- Developed responsive and visually appealing layouts using **HTML**, **CSS**, and **SCSS** to ensure cross-browser compatibility for a user-friendly experience.\n- Collaborated closely with cross-functional teams to enhance the UI/UX of the platform, leveraging tools like **Figma** for design iterations.\n- Implemented advanced CSS features, including animations and transitions, to create engaging user interactions and boost overall user satisfaction.\n- Utilized task runners such as **Gulp** and module bundlers like **Webpack** to automate CSS pre-processing and optimize asset delivery for faster load times.\n- Created and maintained HTML email templates, ensuring compatibility across various email clients and adherence to best practices in responsive design.\n- Championed the use of front-end frameworks such as **Bootstrap** and **Tailwind** for rapid prototyping and efficient component-based development.\n- Integrated version control practices using **Git**, promoting a seamless collaborative environment and ensuring version history integrity.\n- Emphasized detail-oriented design through meticulous testing across multiple devices and browsers to ensure superior quality control in deliverables.\n- Improved team collaboration and project transparency through effective communication and Agile methodologies, enhancing the overall project scope across **3 major platform updates** in the last year."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Frontend Frameworks**\n\tHTML, CSS, SCSS, Sass, Less, Bootstrap, Tailwind, Angular, FastAPI\n\n **Backend Frameworks**\n\tFlask, Django, Celery\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n **Cloud & Infrastructure**\n\tAWS, Azure\n\n **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Collaboration, Attention to Detail, Responsive Design, Cross-browser Compatibility, CSS Animations, CSS Transitions, HTML Email Templates, Gulp, Webpack, Pug, Handlebars, Canvas API, WebGL, ThreeJS, GSAP",
  "apply_company": "BrainRocket"
}