{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Golang Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a skilled Senior Golang Engineer with 8 years of full-stack development experience, I focus on utilizing **Go**, alongside cloud platforms such as **AWS**, **Azure**, and **GCP**. My work incorporates **Kubernetes** for container orchestration and **Terraform** for Infrastructure as Code, ensuring scalable and resilient application deployment. I champion CI/CD practices and GitOps methodologies, leveraging version control with **Git** while optimizing Linux environments for performance and security.\n\nI have successfully led the development of high-performance solutions in healthcare and financial sectors, integrating observability and security best practices. My expertise extends to building robust applications that adhere to compliance standards like HIPAA and PCI DSS. Coupled with my strong problem-solving abilities, exceptional communication skills, and collaborative approach, I am dedicated to creating innovative solutions that drive business success.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Golang Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed scalable, full-stack applications with an emphasis on **Go**, and incorporated container orchestration using **Kubernetes** to ensure efficient deployment and management of services.\n- Designed and maintained cloud infrastructure using **AWS**, **Azure**, and **GCP**, utilizing **Terraform** for Infrastructure as Code, ensuring compliance with security best practices and operational efficiency.\n- Implemented CI/CD pipelines using **GitHub Actions** and **GitOps** principles to streamline development workflows, deploying **8%** faster than previous methodologies.\n- Optimized application performance and reliability monitoring through observability tools, ensuring high availability and low latency across services.\n- Employed **Linux** environments for robust application deployment, ensuring smooth integrations with various cloud services and APIs.\n- Collaborated with cross-functional teams to integrate new features, effectively communicating technical requirements and solutions, enhancing collaboration and team productivity by **20%**.\n- Established security protocols for application development, adherence to industry standards, and compliance with regulatory frameworks.\n- Utilized problem-solving skills to troubleshoot complex infrastructure issues, increasing operational reliability by **15%**.\n- Conducted regular code reviews and mentoring sessions to enhance team skill levels and maintain high code quality across projects.\n- Championed the transition of existing applications to microservices architecture, leveraging container platforms for better scalability and maintenance.\n- Automated deployment processes using CI/CD pipelines, reducing deployment time from **120 minutes** to **30 minutes**, thus supporting rapid feature releases."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **AWS**, **Azure**, and **GCP** cloud services to design and implement scalable infrastructure for financial applications, enhancing deployment efficiency by **30%** through **Infrastructure as Code** practices using **Terraform**.\nEmployed **Kubernetes** for container orchestration, improving application resilience and reducing downtime in production environments by **25%**.\nImplemented **CI/CD** pipelines to streamline development workflows, achieving a **40%** reduction in deployment time and ensuring consistent application delivery.\nMaintained comprehensive observability across applications utilizing **GitOps** principles and monitoring tools, facilitating proactive issue resolution and enhancing system reliability.\nCollaborated with cross-functional teams to enhance security measures, applying best practices and compliance standards, successfully reducing vulnerabilities by **15%**.\nEmphasized effective problem-solving and communication skills to facilitate project discussions, ensuring alignment on goals and strategies among team members.\nContributed to ongoing process improvements within the team, fostering a culture of collaboration and continuous learning, leading to increased team performance and morale."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Go** for developing highly efficient backend services in a scalable architecture, ensuring high availability and low latency in the deployment of key modules for a global e-commerce platform.\nImplemented **AWS**, **Azure**, and **GCP** solutions to enhance the infrastructure, utilizing **Kubernetes** for container orchestration and managing application workloads effectively.\nDesigned and maintained CI/CD pipelines to automate deployment processes, incorporating **GitOps** strategies and **Terraform** for Infrastructure as Code to streamline development workflows and reduce deployment time by **30%**.\nEnhanced application observability through metrics, monitoring, and logging practices, resolving both infrastructure and application issues with an average recovery time of under **5 minutes**.\nDeveloped secure and robust cloud environments with emphasis on compliance and security best practices, ensuring all systems are resilient against vulnerabilities, thus maintaining a **99.9%** uptime record.\nCollaborated effectively with cross-functional teams to solve complex problems, leading to improved system performance and enhanced user experiences.\nApplied problem-solving techniques to optimize backend services, resulting in a **25%** reduction in latency for critical user interactions across the platform.\nEngaged in continuous improvement initiatives, leveraging feedback loops to enhance communication and foster collaboration among team members.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript, Go\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, CI/CD, GitOps, Terraform, Ansible, Helm, Docker Compose, Linux\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP, Infrastructure as Code, Observability\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Problem-solving, Communication, Collaboration, Security",
  "apply_company": "Elastic"
}