{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience delivering high-performance applications, especially in AI and software verification. Proficient in critical programming languages such as **JavaScript**, **Python**, and familiar with **Go**, **C++**, and **Ruby**. Skilled in employing **AI** technologies to enhance software functionality and streamline processes. Strong commitment to documentation and effective communication to ensure project success.\nDeep expertise in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, along with experience in server-side frameworks like **FastAPI** and **Django**. Proven capability in building AI/ML-powered platforms that leverage predictive analytics, automation, and real-time processing, ensuring robust and scalable applications.\nHighly adept at deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, event-driven architectures, and CI/CD pipelines. Comprehensive knowledge of compliance-driven development in alignment with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Strong background in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and **Python** to design and build full-stack platforms, ensuring software verification and compliance with industry standards.\nCollaborated and communicated effectively within cross-functional teams to refine project documentation and specifications, delivering complex solutions in healthcare and fintech.\nLed software verification processes throughout development, validating functionality and performance of applications built with **Node.js** and **React** (17–18).\nImplemented robust documentation practices to support code maintenance and handover for major projects, highlighting the importance of clear communication in software engineering.\nDeveloped a real-time data analytics platform using **Python (FastAPI)**, employing scalable microservices architecture through **Docker** and **Kubernetes (AKS/EKS)**.\nDrove the integration of AI models for improved decision-making processes, leveraging machine learning libraries including **scikit-learn** and **PyTorch** to enhance system capabilities.\nOptimized and maintained application performance across platforms, ensuring high standards of software verification and quality control.\nLed communications with stakeholders to align project objectives with technical feasibility, implementing feedback into iterative development cycles.\nEngineered CI/CD pipelines using **GitHub Actions** for deployment workflows, enhancing team productivity through streamlined testing and verification processes across multiple environments.\nSynthesized advanced data visualization solutions with **D3.js** and **Power BI Embedded**, aimed at delivering key operational insights to end-users in real-time."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **Python** to modernize core financial platforms by migrating to microservices architecture, enhancing scalability and performance for high-volume transactional systems.\nDeveloped and deployed back-end services with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django) to support interactive applications and improve system reliability by **30%**.\nBuilt interactive front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, leveraging **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels, increasing user engagement by **25%**.\nDelivered real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies, improving operational response time by **15%**.\nDesigned and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance, resulting in a **20%** boost in processing speed.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing which handled over **1 million** records per day.\nBuilt and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns, reducing fraud instances by **40%**.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, improving predictive accuracy by **35%**.\nMaintained documentation and effective communication across teams to ensure high standards of software verification and delivery."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and optimized software solutions in **JavaScript** and **Python**, ensuring high-quality code adherence and performance efficiency for complex systems.\n• Contributed to product development through effective **communication** with cross-functional teams, enhancing project documentation and fostering collaboration.\n• Engaged in **software verification** processes to ensure robust code functionality and reliability by conducting comprehensive unit and integration testing, achieving a bug rate reduction of **15%**.\n• Enhanced the software architecture utilizing **Go** and best practices in **documentation**, resulting in a **30%** increase in team productivity.\n• Participated in performance optimization initiatives that improved application response times by **25%**, leveraging real-time monitoring tools and analytics.\n• Guided junior engineers through best practices and coding standards in **C++** and **Ruby**, helping elevate team capability and knowledge sharing.\n• Led bi-weekly code reviews and provided constructive feedback, fostering a culture of continuous improvement and learning within the engineering team.\n• Designed and implemented scalable software solutions to accommodate growing user bases, contributing to platforms that served over **50,000** concurrent users at peak times.\n• Conducted customer feedback sessions to identify pain points and improve user interface designs, resulting in an increase in customer satisfaction scores by **20%**."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, Python, Go, C++, Ruby\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tMLflow, Airflow, Kubeflow\n\tSoftware Verification, Documentation, Communication",
  "apply_company": "Stellar AI"
}