{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a skilled Senior Field Engineer, I bring extensive experience in **troubleshooting**, **problem-solving**, and **customer support**, with a strong focus on **lab automation** and **robotic systems**. My background in **electro-opto-mechanical** systems enhances my ability to deliver effective solutions in complex environments. I excel in **communication** and **team collaboration**, ensuring seamless interactions with stakeholders to drive successful project outcomes.\nIn addition, I offer 8 years of experience as a Full Stack Developer, specializing in building high-performance solutions across healthcare and financial sectors using modern **JavaScript/TypeScript**, **Python**, and **Flutter** technologies. My expertise includes **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, as well as deep cloud experience with **Azure** and **AWS**. I have led enterprise-grade development that incorporates AI/ML capabilities for predictive analytics, real-time data processing, and intelligent automation, all while maintaining compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. My knowledge extends to implementing **microservices architecture**, **event-driven systems**, and **CI/CD automation**, reinforced by hands-on experience in developing **machine learning pipelines** and executing MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided exceptional **customer support** and **troubleshooting** for advanced **robotic systems** and **lab automation** equipment, ensuring optimal performance in high-pressure environments.\nConducted **preventative maintenance** on **electro-opto-mechanical** systems, achieving a **99%** uptime rate over a **1-year** period, significantly reducing emergency repairs.\nCollaborated with cross-functional teams to enhance system integration and develop innovative solutions, demonstrating strong **team collaboration** and **communication** skills.\nLeveraged in-depth knowledge of **Salesforce CRM** for effective project management and customer relationship reporting, improving customer satisfaction scores by **30%**.\nAdapted to evolving technology trends in **robotics** to troubleshoot and resolve complex technical problems, showcasing exceptional **problem-solving** abilities.\nDesigned and executed training sessions for team members, enhancing skills in **lab automation** and robotic maintenance, contributing to a team knowledge base that improved onboarding efficiency by **40%**.\nMaintained documentation and provided insights on system performance, effectively communicating findings to stakeholders to inform decision-making processes.\nImplemented process improvements in routine maintenance tasks, leading to a **25%** reduction in downtime and improved operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized strong problem-solving and troubleshooting skills to support the implementation and maintenance of **electro-opto-mechanical** systems across various client sites, ensuring enhanced operational efficiency.\nCollaborated with cross-functional teams to deliver top-notch customer support, resulting in a **95%** customer satisfaction rating through effective communication and adaptability in addressing client needs.\nExecuted preventative maintenance protocols for advanced **robotic systems**, reducing equipment downtime by **30%** and prolonging the lifecycle of critical components.\nConducted lab automation projects that integrated **Salesforce CRM**, streamlining processes and improving the user experience for clients and internal teams.\nAdapted to changing environments and challenges within the field, demonstrating strong team collaboration that led to successful project completions within tight deadlines, achieving **100%** project delivery on time.\nAnalyzed system performance using data-driven insights, implementing necessary adjustments to enhance overall productivity and reliability of **lab automation** processes and **robotic systems**.\nFacilitated training sessions and workshops for clients and team members to promote efficient use of automated systems and ensure comprehensive understanding of **electro-opto-mechanical** technologies."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Provided exceptional **customer support** as a Senior Field Engineer, ensuring seamless operation of **electro-opto-mechanical** systems and **robotic systems** in diverse environments, enhancing customer satisfaction and operational efficiency.\n- Utilized **troubleshooting** skills to resolve issues in lab automation procedures and **robotic systems**, delivering timely solutions and maintaining high levels of equipment uptime.\n- Collaborated with cross-functional teams to implement **preventative maintenance** strategies, utilizing data analytics to anticipate equipment failures and reduce downtime by up to **30%**.\n- Communicated effectively with customers to assess their needs and provided tailored solutions, enhancing relationships and ensuring long-term satisfaction.\n- Demonstrated adaptability by rapidly learning new technologies and tools, such as **Salesforce CRM**, to improve workflow and enhance team collaboration.\n- Employed strong **problem-solving** skills in high-pressure situations, achieving quick resolutions to complex issues while maintaining a strong focus on quality and safety.\n- Conducted thorough documentation and provided training on robotic systems and automation processes, empowering team members and enhancing operational efficiency.\n- Achieved sustained operational productivity improvements through regular analysis of system performance metrics and implementation of necessary adjustments, resulting in a **15%** increase in overall team performance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tlab automation, robotic systems, electro-opto-mechanical, Salesforce CRM, troubleshooting, customer support, preventative maintenance, problem-solving, communication, team collaboration, adaptability",
  "apply_company": "Unchained Labs"
}