{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 13+ years of experience in delivering high-performance applications, specializing in **TypeScript**, **React**, and **Cypress**. Proficient in API development and database management with **SQL** and **PostgreSQL**, applying best practices to ensure robust support for frontend solutions. Strong expertise in deploying cloud-native applications on **AWS** using **Docker** and **Kubernetes** for efficient container orchestration.\n\nAdditionally, adept in extending functionality and enhancing user experience through **Python** backend integrations, alongside familiarity with **Golang** for building scalable solutions. Proven track record of developing AI/ML-powered platforms that drive predictive analytics and automation. Committed to compliance-driven development adhering to standards such as HIPAA and PCI DSS, with a solid foundation in CI/CD methodologies to streamline the development process.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained robust applications using **TypeScript** and **React (17-18)**, ensuring the delivery of high-quality software that meets user requirements and design specifications.\nImplemented comprehensive testing strategies using **Cypress** to enhance code quality and implement reliable API integrations.\nDesigned scalable backend systems leveraging **PostgreSQL** for efficient data management and retrieval through well-structured SQL queries, enhancing application performance by **30%**.\nUtilized **Docker** and **Kubernetes** for container orchestration, resulting in simplified deployment processes and improved system reliability with **99.9% uptime**.\nCollaborated with cross-functional teams in Agile environments to produce optimal solutions for user needs, reducing time to market by **25%**.\nExecuted efficient API design and implementation to ensure seamless communication between frontend and backend components, improving data flow and application responsiveness.\nContributed to code reviews and mentorship programs that led to a **40%** decrease in bugs and improved team efficiency.\nActively participated in performance tuning and optimizations on existing applications, increasing overall system speed by **20%**.\nEngaged with DevOps principles by integrating CI/CD practices, contributing to a **50%** acceleration in deployment cycles.\nUtilized **AWS** services to manage cloud-based applications, ensuring that solutions were both scalable and secure."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed dynamic user interfaces using **React (18)** and **TypeScript** to ensure a responsive and engaging experience for users interacting with financial applications.\nExecuted comprehensive testing and quality assurance using **Cypress** to guarantee the reliability of API integrations and safeguard data flow in high-stakes financial services.\nDesigned RESTful APIs and integrated them with backend services to optimize performance and facilitate seamless communication between the frontend and database systems, employing **SQL** for data management.\nUtilized **PostgreSQL** for efficient data storage and retrieval, ensuring robust performance under high transaction volumes, and implementing complex queries to support analytics features.\nLeveraged **Docker** and **Kubernetes** for containerization and orchestration of applications, enhancing deployment efficiency and scalability across different environments.\nCollaborated with cross-functional teams to integrate **AWS** services for cloud solutions, ensuring high availability and reliability of frontend applications.\nImplemented microservices strategies using **Python**, enhancing performance and scalability while managing complex business logic across various financial tools.\n\nOriginal Strengths:\n- Contributed to the development of high-volume transactional systems, improving response time by **30%** through code optimization and refactoring.\n- Spearheaded initiatives to standardize coding practices, leading to a **25%** decrease in bug reports and increased maintainability of code.\n- Championed user-centered design, achieving positive user feedback scores of **95%** for usability in internal surveys."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized frontend applications using **React 18**, **TypeScript**, and **Cypress**, ensuring high performance and engaging user experiences for e-commerce platforms.\nDesigned and implemented efficient APIs, leveraging **PostgreSQL** for robust data management, enabling seamless interaction between frontend and backend services.\nCollaborated on distributed systems using **AWS** and **Docker**, ensuring scalable deployment and enhanced reliability across multiple environments.\nIntegrated advanced state management with **Redux Toolkit** for efficient data flow and improved user responsiveness in applications.\nApplied best practices in unit and end-to-end testing using **Cypress**, increasing code coverage to **95%** and enhancing overall application stability.\nMaintained a mobile-first approach in creating SEO-friendly UIs, utilizing **HTML5/CSS3**, ensuring high accessibility compliance (WCAG 2.1) and improved organic search rankings.\nContributed to the implementation of CI/CD pipelines and container orchestration strategies with **Kubernetes**, enabling rapid deployment and version control improvements.\nUsed **Golang** for backend services collaborations, enhancing the performance and interoperability of applications.\nEnsured robust security practices and data protection with role-based access control (RBAC) and OAuth 2.0 integrations, fully compliant with GDPR regulations."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, TypeScript, Golang\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Cypress\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Terraform, Ansible, Helm, Docker Compose",
  "apply_company": "Timescale"
}