{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Firewall Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Experienced Senior Firewall Engineer with a robust background in **Network Security** and **Firewall Configuration**. Proficient in managing and configuring leading technologies such as **Cisco ASA**, **Cisco Firepower**, **Check Point**, **Palo Alto**, and **Fortinet** systems. Adept at implementing security protocols aligned with enterprise standards, ensuring robust protection against cyber threats. Skilled in **Python** for automation tasks and proficient in **Linux**, with experience in **CI/CD** methodologies to enhance deployment processes.\n\nBringing 13+ years of experience in IT, delivering high-performance applications in the healthcare and financial sectors. Proven track record in **Docker** and **VMware** for containerization and virtualization, alongside hands-on expertise in cloud services on **AWS** and **Azure**. Knowledgeable in developing AI/ML-based platforms and applying **Ansible** for configuration management and orchestration. Strong understanding of compliance frameworks including HIPAA and PCI DSS, ensuring secure and compliant software delivery.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Firewall Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and built secure network environments with a focus on **Network Security** protocols, utilizing **Firewall Configuration** techniques for robust defenses against threats.\nImplemented **Cisco ASA**, **Cisco Firepower**, **Check Point**, **Palo Alto**, and **Fortinet** firewalls to create customized security solutions tailored for enterprise clients, achieving a **98% reduction** in security incidents.\nAutomated deployment and configuration tasks using **Ansible**, ensuring consistent and secure network setups across multiple sites, enhancing deployment speed by **30%**.\nLed the integration of **Docker** containers into network security infrastructure, improving application isolation and component scalability, enabling the support of over **100+** concurrent users.\nDeveloped and maintained **CI/CD** pipelines specifically designed for the deployment of network configurations and updates, reducing downtime during updates by **40%**.\nArchitected the transition of legacy systems to **SASE/SSE** frameworks, optimizing connectivity and security for remote users and devices, achieving **50%** increased efficiency in user access controls.\nAdministered **Linux** servers, optimizing network performance and security practices across the infrastructure, ensuring full compliance with industry standards.\nCreated detailed network diagrams and documentation for enterprise clients, improving troubleshooting and operational efficiency by providing clear visual resources.\nCoordinated with cross-functional teams to enforce strict policies on **Enterprise Network Security**, leading to enhanced security awareness among stakeholders and reducing audit findings by **60%**.\nConducted regular security audits and assessments using tools such as **VMWare**, ensuring ongoing compliance with security best practices and standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Managed and configured enterprise network security systems, ensuring robust defenses with tools such as **Cisco ASA**, **Palo Alto**, and **Fortinet**, securing over **1000** endpoints.\nImplemented and maintained firewall policies with **Check Point** and **Cisco Firepower**, reducing unauthorized access by **30%** and improving the security posture of corporate networks.\nLed the configuration of **Docker** and **VMWare** for operational containment, achieving a **20%** increase in operational efficiency.\nAutomated network security tasks using **Ansible**, streamlining deployments and reducing manual errors in configuration across **50+** network devices.\nConducted vulnerability assessments and penetration testing, leveraging **Python** scripts and various security tools to uncover and rectify critical vulnerabilities in real-time.\nDeveloped and maintained documentation for security protocols and procedures, enhancing team understanding and compliance with **SASE/SSE** methodologies.\nEstablished CI/CD pipelines to enable continuous integration and delivery of security policies and updates, significantly improving response times to emerging threats.\nProvided training and guidance on network security best practices to teams, elevating overall security knowledge and awareness by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented robust **network security** strategies ensuring **high availability** and **scalability** of enterprise systems.\nConfigured and optimized firewalls using **Cisco ASA**, **Cisco Firepower**, **Palo Alto**, and **Fortinet**, managing security policies to safeguard critical infrastructure across **10+** global locations.\nLeveraged **Ansible** for automating **network security** tasks, resulting in a **30%** reduction in configuration errors and improving deployment times by **25%**.\nUtilized **Python** scripts to automate monitoring processes, enhancing operational efficiency and reducing incident response times by **15%**.\nManaged **CI/CD** pipelines with **Docker** and **VMWare**, ensuring smooth deployment of security updates and infrastructure changes with minimal downtime.\nDesigned and implemented network monitoring solutions to track traffic patterns and identify threats, improving incident detection times by **40%**.\nDeveloped security policies compliant with **GDPR**, ensuring users' data protection and privacy across the enterprise network.\nIntegrated centralized management solutions with **SASE/SSE** architecture, enabling streamlined policy enforcement and visibility for remote and on-premise users.\nConducted risk assessments and security validation tests on deployment environment to ensure compliance and bolster defenses against threats.\nEstablished secure **VPN** access configurations for remote employees and external partners, maintaining high levels of performance and security."
    }
  ],
  "skills": "****Programming Languages****\n\tPython\n\n****Backend Frameworks****\n\tFastAPI, Flask, Django\n\n****Frontend Frameworks****\n\tJavaScript/TypeScript: React, Vue, Angular\n\n****API Technologies****\n\t\n\n****Serverless and Cloud Functions****\n\tAWS: Lambda\n\n****Databases****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Ansible, CI/CD\n\n****Cloud & Infrastructure****\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, VMWare\n\n****Other****\n\tNetworks, Network Security, Firewall Configuration, Cisco ASA, Cisco Firepower, Check Point, Palo Alto, Fortinet, Linux, SASE/SSE, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, CI/CD & Infrastructure as Code: Terraform, Helm, Docker Compose"
}