{
  "name": "Tomasz Lee",
  "role_name": "Automation Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Automation Engineer with over 9 years of experience in pharmaceutical automation and ERP systems. Highly proficient in **Ignition SCADA**, **SAP**, **MES**, and **LIMS**, ensuring compliance with **GMP** and **FDA regulations**. Expert at troubleshooting and streamlining automation processes to optimize performance. Exceptional communication and collaboration skills, enabling effective team engagement and project leadership. Strong background in software development, leveraging a solid foundation in technologies such as **.NET**, **C#**, and a keen understanding of microservices architecture.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Automation Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged effective **communication skills** to engage stakeholders and ensure alignment on project objectives throughout all phases of development.\nCollaborated with cross-functional teams utilizing **collaboration skills** to seamlessly integrate pharmaceutical automation solutions within existing workflows.\nDesigned and implemented automation solutions within **Ignition SCADA** to enhance real-time monitoring and control of processes in compliance with **GMP** standards.\nOptimized operations through the integration of **ERP** systems and **MES**, streamlining data flow and improving operational efficiency by **30%**.\nEnsured adherence to **FDA regulations** in all automation projects, maintaining compliance and quality assurance across the board.\nConducted troubleshooting of automation processes leading to a **20%** reduction in system downtimes.\nDeveloped comprehensive documentation for automation procedures and protocols, enhancing the training process for new engineers.\nImplemented **LIMS** for laboratory data management, enhancing data accuracy and reducing processing times by **15%**.\nEngaged in continuous process improvement initiatives, contributing to an overall increase in productivity and efficiency within the organization."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **Ignition SCADA** to design and implement automation solutions for pharmaceutical processes, ensuring compliance with **GMP** and **FDA regulations**.\nEmployed **ERP** systems, particularly **SAP**, to streamline operations within the manufacturing environment, enhancing productivity by 20%.\nDeveloped and maintained **MES** and **LIMS** integrations to facilitate real-time data tracking and analysis, which reduced processing times by **15%**.\nUtilized strong communication and collaboration skills to coordinate effectively with cross-functional teams, ensuring alignment on project goals and timelines.\nExecuted troubleshooting techniques on automation equipment that resulted in a **30%** decrease in downtime.\nConducted training sessions for team members on automation best practices, bolstering team efficiency and knowledge sharing.\nAnalyzed system performance metrics, leading to the identification and implementation of process improvements that enhanced operational efficiency by **25%**.\nParticipated in regular safety and compliance audits, ensuring that all automation projects adhered to company policies and regulatory standards.\nMaintained detailed documentation of system architectures and protocols, facilitating a smoother onboarding process for new hires and continuity in operations.\nLed projects from conception through to execution, focusing on aligning technical requirements with business needs, achieving project deadlines with **100%** success."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Ignition SCADA** to implement real-time monitoring systems, enhancing operational efficiency in pharmaceutical automation processes.\nCollaborated with cross-functional teams to integrate **ERP** and **MES** systems, ensuring compliance with **GMP** and **FDA regulations** in automation workflows.\nProvided troubleshooting and problem-solving skills to resolve integration issues between **LIMS** and production systems, resulting in a **30%** reduction in downtime.\nDesigned custom reports using **SAP** to streamline data visibility, improving decision-making time for project stakeholders by **15%**.\nConducted training sessions on **Ignition SCADA** platform for team members, promoting knowledge sharing and improving overall team performance.\nLed collaborative projects involving equipment automation and data management, demonstrating strong communication and collaboration skills to align team members.\nParticipated in regular project meetings to review progress, assess challenges, and strategize solutions to meet deadlines and project milestones effectively.\nDelivered detailed documentation on system processes and changes, ensuring seamless transitions and clear understanding of automation systems among teams.\nEnhanced operational protocols by integrating automation technologies, leading to a **25%** increase in productivity in pharmaceutical manufacturing environments."
    }
  ],
  "skills": "**Frontend Frameworks**,\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**,\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**,\n\tRESTful API, GraphQL\n\n**Database Systems**,\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & Infrastructure**,\n\tAWS, Azure\n\n**DevOps**,\n\tCI/CD pipelines\n\n**Other**,\n\tUX/UI Design, Git, GitHub, Python, Redux, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Solidity, Ether.js, Web3.js, Ethereum, Ignition SCADA, pharmaceutical automation, ERP, SAP, MES, LIMS, GMP, FDA regulations, troubleshooting, communication skills, collaboration skills"
}