{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Industrial Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Industrial Engineer with a robust background in quality management, production processes, and configuration management, contributing over 10 years of experience in the hardware development and Electronic Manufacturing Services (EMS) sectors. Expert in ensuring compliance with IPC electronics standards and implementing effective quality control measures. Proficient in tools like **Jira**, **LabView**, and **TestStand**, along with a solid foundation in hardware design. Demonstrated problem-solving abilities and meticulous attention to detail, fostering collaboration across cross-functional teams to optimize production efficiency and product quality. Excellent communication skills that facilitate the successful execution of complex engineering projects.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Industrial Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tConducted thorough analysis of production processes to enhance efficiency, utilizing quality management techniques and configuration management practices, achieving a **15%** reduction in process cycle time.\n•\tLed hardware development projects to design hardware components adhering to IPC electronics standards, ensuring compliance and reliability in electronic manufacturing services.\n•\tCollaborated with cross-functional teams using **Jira** to facilitate project management and communication, improving team productivity by **20%**.\n•\tDeveloped and implemented quality management protocols that elevated product quality, reducing defects by **30%** over two production cycles.\n•\tDesigned testing frameworks with **LabView** and **TestStand** to initiate rigorous testing of hardware components, ensuring performance met established specifications.\n•\tUtilized strong problem solving and attention to detail skills to identify bottlenecks in hardware designs, resulting in enhanced production efficiency.\n•\tTrained teams on best practices for hardware design and production processes, promoting a collaborative environment and effective communication across departments.\n•\tMaintained documentation on hardware design specifications and production processes to support continuous improvement initiatives within the organization."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Conducted configuration management to optimize production processes, ensuring adherence to IPC electronics standards and quality management practices, leading to a **25%** reduction in defects.\n• Collaborated with cross-functional teams using **Jira** to effectively track project progress, contributing to timely delivery of hardware development projects with a **15%** improvement in timeline adherence.\n• Leveraged problem-solving skills to address hardware design challenges, implementing innovative solutions that improved overall product reliability and performance by **30%**.\n• Focused on attention to detail in the development of hardware components, leading to high-quality outputs that met stringent industry standards.\n• Utilized **LabView** and **TestStand** for automatic testing of production hardware, enhancing the test coverage and reducing manual intervention by **40%**.\n• Applied industrial engineering principles to streamline manufacturing processes, reducing production cycle time by **20%** while maintaining high-quality standards.\n• Fostered collaboration among engineers and production teams to promote effective communication and knowledge sharing, driving productivity improvements.\n• Developed and implemented quality management frameworks that enhanced the overall product lifecycle, from design to manufacturing."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Applied expertise in **hardware development** to design and optimize electronic systems ensuring compliance with **IPC electronics standards** and robust **production processes**.\nLeveraged **quality management** principles to enhance the efficiency of **Electronic Manufacturing Services**, resulting in a **15%** reduction in production defects.\nUtilized **configuration management** tools, including **Jira**, to track project progress and ensure effective communication across cross-functional teams.\nExecuted detailed **problem solving** methodologies to address production challenges, reducing downtime by **20%** through effective troubleshooting protocols.\nDemonstrated strong **communication skills** in collaborating with team members and stakeholders to ensure alignment on project objectives and deliverables.\nApplied **attention to detail** in **hardware design** processes, contributing to the successful launch of **3 major products** within **6 months**.\nCoordinated with engineering teams using **LabView** and **TestStand** for rigorous testing and validation of hardware components to ensure compliance with established standards.\nFostered a culture of collaboration among engineering teams, facilitating knowledge sharing and best practices to improve overall team performance.\nDeveloped and implemented training programs to enhance team capabilities in quality management and hardware development processes, positively impacting team productivity by **25%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n **Backend Frameworks:**\n\n **Frontend Frameworks:**\n\n **API Technologies:**\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tInfrastructure as Code\n\n **Other:**\n\thardware development, industrial engineering, configuration management, Electronic Manufacturing Services, Jira, quality management, production processes, hardware design, IPC electronics standards, LabView, TestStand, problem solving, communication skills, attention to detail, collaboration, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "ABB"
}