{
  "name": "Rei Taro",
  "role_name": "C++ Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Skilled C++ Developer with over 10 years of experience specializing in backend systems architecture and implementation. Proficient in C++, STL, and multithreading, adept at developing high-performance applications and algorithms. Solid experience in working with both Windows and Linux environments, complemented by expertise in database management using **PostgreSQL** and **MS SQL Server**. Strong network programming skills, with a proven ability to enhance application performance through efficient coding practices. Previously contributed to substantial projects at leading organizations such as VISA, Sii Poland, and Reply Polska. Fluent in English, ensuring effective communication in diverse teams.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "C++ Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed robust backend systems leveraging **C++** and **STL** to enhance application performance and maintainability in a multi-threaded environment.\nEngineered effective algorithms and data structures to optimize processing efficiency, achieving a performance increase of **30%** over previous implementations.\nGained proficiency in **PostgreSQL** and **MS SQL Server** for efficient data storage, retrieval, and management during application development, ensuring data integrity and reliability.\nImplemented network programming techniques for seamless communication protocols across **Windows** and **Linux** platforms, reducing operational latencies by **15%**.\nUtilized the **Boost** library to enhance functionalities such as threading and networking, contributing to the stability of the application architecture.\nDeveloped and maintained C++ applications with high emphasis on multithreading, leading to a **25%** improvement in concurrent processing capabilities.\nEnsured compliance with coding standards while collaborating with cross-functional teams, contributing to successful software releases and integrations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented robust solutions using **C++** for backend systems development, ensuring high performance and scalability in complex applications.\nUtilized **STL** for efficient data handling and streamlined algorithms, achieving a 30% reduction in processing time for data-intensive operations.\nDeveloped cross-platform applications on both **Windows** and **Linux**, ensuring compatibility and optimized performance across various environments.\nLeveraged **Multithreading** techniques to enhance application responsiveness and throughput, improving user experience by 25% during peak loads.\nIntegrated with **PostgreSQL** and **MS SQL Server** for efficient data storage and retrieval, optimizing database interactions that resulted in a 15% decrease in query response time.\nApplied **Network programming** strategies to facilitate seamless communications between distributed components, enhancing system robustness and reliability.\nConducted thorough algorithm analysis to optimize performance, achieving improvements that support high-volume concurrent transactions.\nMaintained comprehensive documentation and version control for codebase, ensuring maintainability and clarity for team collaboration."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **C++** and **STL** to develop robust backend services for trade execution, portfolio management, and account tracking, directly enhancing trading operations.\nEmployed **PostgreSQL** for efficient database management and data retrieval, ensuring system reliability and performance.\nImplemented **multithreading** techniques to optimize real-time data processing, contributing to high-frequency transaction efficiency.\nCollaborated with cross-functional teams, leveraging **network programming** skills to facilitate seamless data flow between services and frontend applications.\nApplied advanced **algorithms** to enhance service performance and data processing speed, achieving a **20%** improvement in response times.\nConducted rigorous testing using tools like **PyTest** and mock servers to ensure code quality and minimize system discrepancies across development cycles.\nOptimized backend task execution through effective job queuing and scheduling solutions using **Celery** and **RabbitMQ**, improving processing times by up to **30%**."
    }
  ],
  "skills": "**Programming Languages**\n\tC++, C#, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, MS SQL Server\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Network programming, Multithreading, Algorithms, WinAPI, English proficiency, Kafka"
}