{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Sales Engineer with a proven track record in B2B Sales and Account Management, leveraging over 10 years of expertise in developing strategic account plans and managing client relationships. Skilled in CRM tools and MS Office, I excel at optimizing processes within the Process Industry and implementing Condition Monitoring and Plant Asset Management solutions. My background in backend development enhances my ability to understand complex technical products and deliver tailored solutions to clients, driving significant revenue growth in every organization I've contributed to, including top-tier companies.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Developed and implemented strategic account plans using insights from **CRM** tools to enhance sales performance and customer satisfaction.\n• Managed B2B sales initiatives, leveraging a deep understanding of the process industry to drive growth and maintain strong client relationships.\n• Conducted thorough condition monitoring and assessment of client needs, ensuring tailored solutions through **sales** methodologies.\n• Utilized **MS Office** (Excel, PowerPoint) to create impactful presentations and reports that supported sales efforts and client engagements.\n• Collaborated with cross-functional teams to address system integration challenges, ensuring compliance, and overseeing release strategies.\n• Streamlined account management processes, contributing to a **30%** increase in sales efficiency and client retention over a **12-month** period.\n• Engaged with clients utilizing data-driven insights, resulting in a **15%** growth in upselling opportunities across key accounts."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "- Leveraged **CRM** systems to track and manage client accounts, ensuring effective **account management** and customer relationship building.\n- Developed **strategic account plans** targeting a **9%** increase in sales growth within the **process industry** sector.\n- Conducted regular presentations and demos to potential clients, utilizing **MS Office** to create engaging content and increase **B2B sales** efficiency.\n- Collaborated with cross-functional teams to align sales strategies with product development and operational processes, ensuring a comprehensive understanding of **plant asset management**.\n- Implemented tracking and monitoring systems for equipment performance, facilitating **condition monitoring** to enhance customer satisfaction and retention.\n- Analyzed market trends and competitor activities to adapt and refine sales strategies, achieving a **15%** improvement in sales conversion rates.\n- Generated weekly reports to evaluate sales performance metrics and recommend improvements based on data-driven insights."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized CRM systems to manage customer accounts effectively, driving efficiencies and maximizing collaboration across **Sales** initiatives.\nDeveloped strategic account plans to optimize **B2B Sales** processes, resulting in a **15%** increase in customer retention.\nImplemented comprehensive condition monitoring strategies, enhancing **Plant Asset Management** and ensuring operational excellence across the process industry.\nUtilized **MS Office** tools for data-driven reporting and presentations, contributing to improved decision-making and stakeholder engagement.\nFostered strategic relationships with clients, focusing on delivering tailored solutions and enhancing overall **account management**.\nMaintained a deep understanding of the sales process and customer needs, leading to successful negotiations and finalization of contracts worth over **$2M**.\n\nDeveloped backend services for trade execution, portfolio management, and account tracking using **Python**, **Flask**, and **PostgreSQL** to enhance trading operations.\nEngineered real-time price feed processors with **asyncio**, **WebSockets**, and **Redis** to deliver up-to-the-minute trading data for high-frequency transactions.\nCollaborated closely with frontend teams to deliver data through **REST APIs** and **WebSocket** channels, ensuring smooth user interaction with the platform.\nEnsured the platform met regulatory requirements, including **MiFID II** and **GDPR**, while adhering to internal data security protocols.\nImplemented comprehensive test suites with **PyTest**, **tox**, and mock servers, streamlining QA and CI processes for efficient development cycles.\nIntroduced job queuing and scheduling solutions with **Celery** and **RabbitMQ**, optimizing backend task execution and process management."
    }
  ],
  "skills": "Programming Languages: Python (3.8+), SQL, Bash, JavaScript\n\n\tBackend Frameworks: FastAPI, Flask, Django, Celery\n\n\tFrontend Frameworks: \n\n\tAPI Technologies: REST/gRPC APIs, Microservices, Kafka\n\n\tServerless and Cloud Functions: AWS (EC2, S3, Lambda), Azure\n\n\tDatabases: PostgreSQL, MySQL, MongoDB, Redis\n\n\tDevOps: Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n\tCloud & Infrastructure: \n\n\tOther: AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Sales, Account Management, Process Industry, B2B Sales, Strategic Account Plans, CRM, Condition Monitoring, Plant Asset Management, MS Office",
  "apply_company": "Emerson"
}