{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Technical Regional Service Engineer - EMEA",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Experienced Senior Technical Regional Service Engineer with a robust background in technical support, troubleshooting, and field service. Proven project management skills with a strong focus on quality assurance and effective relationship management. Adept in training and developing technical documentation to streamline processes and support users effectively. \n\nBringing 13+ years of expertise as a Full Stack Developer within the healthcare and financial sectors, with proficiency in **JavaScript/TypeScript**, **Python**, and **Flutter**. Specialized in both frontend and backend development utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Demonstrated capability in deploying AI/ML-powered platforms, enhancing real-time processing and predictive analytics.\n\nHands-on experience in developing cloud-native systems on **AWS** and **Azure**, implementing microservices, event-driven architectures, and CI/CD pipelines. Strong commitment to compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Extensive MLOps knowledge, encompassing model training, serving, and orchestration with **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Technical Regional Service Engineer - EMEA",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided expert technical support and troubleshooting for full-stack platforms across healthcare and fintech sectors.\nConducted comprehensive training sessions for teams, enhancing project management efficiency through the effective use of **JIRA** and agile methodologies.\nAuthored and maintained technical documentation, ensuring that quality assurance standards were met and adherence to compliance regulations (HIPAA, FHIR, GDPR, PCI DSS, SOX) was achieved.\nCollaborated with cross-functional teams to deliver high-quality solutions utilizing **Python (FastAPI)**, **TypeScript**, and **Node.js**, ensuring streamlined project execution.\nManaged relationships with stakeholders by effectively communicating complex technical concepts and securing buy-in during project phases.\nLed troubleshooting efforts for mobile applications built with **Flutter** and **React Native**, implementing native modules for optimized performance.\nOversaw the development of CI/CD pipelines utilizing **Fastlane** and **App Center**, significantly reducing deployment times by **30%** while enhancing stability.\nEstablished and enforced quality assurance protocols across all stages of development, using tools like **Jest**, **Cypress**, and **Postman** for thorough testing of features and integrations.\nFacilitated the transformation of legacy systems into microservices, leveraging **Docker** and **Kubernetes (AKS/EKS)**, to deliver scalable solutions that improved system uptime to **99.9%**.\nEnhanced data infrastructure operations through hands-on experience with **PostgreSQL**, **MongoDB**, and **Redis**, successfully supporting real-time analytics frameworks for critical business performance metrics."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Provided exceptional **technical support** and **troubleshooting** skills to ensure the effective resolution of client issues related to financial platforms and software, enhancing customer satisfaction by **25%**.\nConducted comprehensive training sessions for field service teams on the latest tools and platforms, resulting in a **30%** increase in service efficiency and quality assurance metrics.\nManaged **JIRA** projects for timely feature rollouts and bug fixes, ensuring alignment with project timelines and stakeholder requirements, achieving **95%** on-time delivery.\nDeveloped and maintained **technical documentation** for all deployed systems and processes, facilitating better **communication** and **relationship management** between technical and non-technical teams.\nCollaborated closely with engineering teams to address client feedback, improving product features based on user insights, leading to a **15%** increase in product usage metrics.\nImplemented quality assurance protocols during software deployments, ensuring system integrity and performance consistent with industry standards, which resulted in a **40%** reduction in post-launch issues."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Provided high-level **technical support** by troubleshooting and resolving 95% of service issues within 24 hours for a global e-commerce platform using **JIRA** for issue tracking and management.\nDeveloped and maintained comprehensive **technical documentation** to support ongoing **training** initiatives, ensuring all team members are equipped with the necessary knowledge and skills to excel in **field service** environments.\nManaged projects for service improvements, utilizing effective **project management** techniques to implement changes that increased **quality assurance** metrics by 30% within the first quarter.\nFacilitated communication between cross-functional teams, strengthening **relationship management** and collaboration, leading to a 20% reduction in response times for customer inquiries.\nConducted training sessions for 50+ team members on best practices in troubleshooting and customer support, enhancing overall service delivery and satisfaction rates.\nLeveraged analytics tools to monitor service performance, leading to a significant decrease in downtime by 15% through proactive maintenance strategies.\nEngaged in continuous improvement processes, employing customer feedback to refine service delivery and address issues more effectively, achieving a customer satisfaction rate over 90%.\nUtilized **quality assurance** methodologies to ensure all service solutions adhere to best practice standards and comply with regulatory requirements."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n  **Backend Frameworks:**\n\tFlask, Django, FastAPI\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n  **API Technologies:**\n\tOAuth2, JWT\n\n  **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda\n\tAzure: App Services\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n  **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\tAWS: RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n  **Other:**\n\tTechnical Support, Troubleshooting, Field Service, Training, Technical Documentation, JIRA, Project Management, Quality Assurance, Communication, Relationship Management"
}