{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Lead Website Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a highly skilled Lead Website Engineer with 8 years of experience, I excel in front-end development utilizing **JavaScript**, and I'm well-versed in leveraging AI SEO tooling to enhance website performance. My strong communication and collaboration skills allow me to effectively lead teams and mentor junior developers. I have expertise in designing user-friendly CMS interfaces and implementing algorithms that improve SEO metrics.\nMy background includes developing high-performance solutions in various sectors, including healthcare and finance, using a robust tech stack of **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**. With a solid understanding of cloud services such as **Azure** and **AWS**, I implement CI/CD automation to ensure efficient deployment processes. Additionally, my experience with machine learning pipelines and MLOps workflows enhances my ability to incorporate intelligent automation into various projects.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Lead Website Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Led the development of innovative front-end solutions utilizing **JavaScript** and modern frameworks, ensuring high standards in UI/UX design and performance optimization.\n- Championed technical mentorship and provided guidance on best practices for **front end development**, fostering a collaborative environment among team members.\n- Collaborated effectively with cross-functional teams to integrate **CMS** solutions and enhance web platforms, while aligning with SEO strategies to boost visibility and user engagement.\n- Implemented robust algorithms to improve website performance and user experience, ensuring seamless interactions across various devices.\n- Guided the integration of **AI SEO tooling** to optimize content strategy and drive organic traffic growth, resulting in a **25%** increase in search rankings over **6 months**.\n- Actively communicated project updates and technical concepts to stakeholders, ensuring clarity and alignment across all levels of the organization.\n- Oversaw the implementation of marketing automation tools like **Marketo** and analytics platforms such as **Wistia** to enhance user engagement and track performance metrics.\n- Designed and executed lead generation strategies leveraging tools like **Chili Piper**, optimizing conversion rates and boosting overall productivity.\n- Fostered a culture of design excellence by advocating for user-centric design principles, leading to a **30%** improvement in user satisfaction scores as measured through feedback surveys.\n- Conducted regular code reviews and provided constructive feedback to enhance the team's technical skills, ensuring adherence to best practices and high-quality standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Led the development and modernization of dynamic websites leveraging **JavaScript** frameworks, ensuring a user-friendly interface and enhanced user experience.\n\n- Championed front-end development by utilizing **React (18)**, **Vue 3**, and **Next.js** to create responsive and visually appealing designs, increasing user interaction by **30%**.\n- Collaborated on SEO initiatives with a focus on improving site visibility using **AI SEO tooling**, enhancing organic search traffic by **25%**.\n- Implemented advanced algorithms for site optimization processes, resulting in faster load times and improved site performance metrics.\n- Mentored a team of junior developers to enhance their technical skills and understanding of modern web development practices, fostering a collaborative environment.\n- Communicated effectively with cross-functional teams to ensure project alignment, leading to a **15%** reduction in development cycle time.\n- Designed and executed strategies for integrating CMS platforms, ensuring content delivery was efficient and aligned with marketing objectives using tools such as **Marketo**.\n- Enhanced website capabilities through third-party integrations such as **Wistia** for video content management, significantly increasing engagement metrics.\n- Oversaw project milestones and timelines, ensuring deliverables were met on schedule and within budget while maintaining high-quality standards."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Led front-end development initiatives utilizing **JavaScript** frameworks such as React (18) and Vue 3, ensuring robust SEO practices and enhancing user engagement on e-commerce platforms.\n• Implemented SEO strategies aligned with AI SEO tooling to optimize site visibility and search ranking, achieving a significant increase in organic traffic.\n• Fostered collaboration among cross-functional teams to improve design workflows and enhance the overall user experience, employing strong communication skills.\n• Provided technical mentorship to junior developers, guiding them on best practices in **front-end development**, algorithms, and effective use of content management systems (CMS).\n• Developed and maintained scalable and responsive e-commerce UIs utilizing **HTML5**, **CSS3**, Next.js, and **Vue 3 + Nuxt**, adhering to WCAG 2.1 accessibility standards.\n• Integrated video solutions from **Wistia** and scheduling tools like **Chili Piper** to improve user experience and streamline customer interactions on the website.\n• Enhanced product discovery through collaboration with marketing teams, leveraging tools like **Marketo** to implement targeted campaigns.\n• Championed technical leadership by advocating for code quality and innovative solutions, showcasing a proven track record in delivering high-performance applications.\n• Executed algorithms and data strategies to optimize page load time and enhance site performance metrics.\n• Actively participated in design discussions, contributing to a cohesive vision that aligned with business goals and user needs."
    }
  ],
  "skills": "****Programming Languages****\n\tJavaScript, Python(FastAPI, Flask, Django)\n\n****Frontend Frameworks****\n\tReact, Vue, Angular\n\n****Backend Frameworks****\n\tFastAPI, Flask, Django\n\n****API Technologies****\n\tMLflow, Airflow, Kubeflow\n\n****Serverless and Cloud Functions****\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n****Databases****\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n****DevOps****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n****Cloud & Infrastructure****\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n****Other****\n\tCMS, SEO, Marketo, Wistia, Chili Piper, AI SEO tooling, front end development, algorithms, technical mentorship, leadership, communication, collaboration, design"
}