{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Quality Assurance Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Quality Assurance Engineer with 13+ years of experience ensuring high-performance application delivery in the healthcare and financial sectors. Proficient in leveraging **C#**, **Java**, **Unity**, **iOS**, and **Android** technologies to enhance software quality. Skilled in automating testing processes using **AWS Device Farm**, **Kobiton**, and **Unity Test Runner**, while implementing robust CI/CD strategies with **Jenkins** and **Azure DevOps**. Expertise in debugging and problem-solving to identify and resolve issues efficiently. Strong communication and collaboration skills to work effectively within cross-functional teams. Additionally, well-versed in compliance standards such as HIPAA and PCI DSS, ensuring alignment with regulatory requirements while maintaining application integrity.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Quality Assurance Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Ensured rigorous quality assurance of mobile applications developed for iOS and Android using **Unity**, **C#**, and **Android** frameworks, implementing realistic testing scenarios to validate performance and user interactions.\nDeveloped and maintained CI/CD pipelines using **Jenkins** and **Azure DevOps**, enabling automated testing, deployment, and monitoring of applications across multiple environments.\nUtilized **AWS Device Farm** and **Kobiton** for cross-device testing, achieving coverage across **9** different device types to ensure optimal performance on target platforms.\nApplied effective debugging techniques in **Unity Test Runner** to identify and resolve issues promptly, ensuring high-quality software delivery and maintaining compliance with best practices.\nCollaborated with cross-functional teams to define quality metrics, streamline communication, and implement problem-solving strategies that improved the overall efficiency of the development lifecycle.\nConducted comprehensive regression tests, followed by thorough analysis and documentation of testing outcomes, fostering transparency and driving continuous improvement in QA processes.\nAssessed custom build configurations using **adb** and **Xcode**, ensuring tailored tests that met the specific needs of projects, thus enhancing the robustness of applications.\nParticipated in daily stand-ups and sprint reviews, fostering a collaborative environment that emphasized quality at all stages of development, promoting open communication amongst team members.\nDefined and enforced best practices for version control and code reviews, contributing to the establishment of a culture focused on quality outcomes and technical excellence within the development team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Collaborated with cross-functional teams to implement CI/CD pipelines using **Jenkins** and **Azure DevOps**, improving deployment efficiency by **30%**.\n- Developed and executed comprehensive test plans for applications developed in **C#**, **Java**, and **Unity**, ensuring high-quality standards with a defect rate reduction of **20%**.\n- Conducted automated testing using **Unity Test Runner** and manual testing strategies for mobile applications on **iOS** and **Android**, increasing test coverage to **90%**.\n- Utilized **AWS Device Farm** and **Kobiton** for mobile testing, achieving a more diverse range of device coverage and improved performance evaluations.\n- Coordinated debugging efforts with development teams, leveraging problem-solving skills to identify and resolve complex issues quickly, resulting in a **15%** reduction in critical bugs post-release.\n- Communicated test results and project status effectively to stakeholders, fostering collaboration across teams for continuous improvement in product quality.\n- Applied **Unreal Engine Blueprints** for creating test scenarios, streamlining the quality assurance process and enhancing the overall quality of gaming applications."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed automated testing frameworks in **C#** and **Java** to streamline QA processes, ensuring rigorous test coverage and high-quality deliverables across platforms like **iOS** and **Android**.\n- Utilized **Unity** and **Unreal Engine Blueprints** for creating engaging test environments, facilitating the identification of bugs and performance issues in graphical applications.\n- Implemented CI/CD pipelines using **Jenkins** and **Azure DevOps**, enabling frequent releases and reducing deployment time by up to **30%**.\n- Executed comprehensive test plans, leveraging **AWS Device Farm** and **Kobiton** for real-device testing to ensure functionality across diverse hardware.\n- Conducted performance testing and analysis using **Unity Test Runner**, identifying optimization opportunities that improved application responsiveness by **25%**.\n- Collaborated with cross-functional teams to troubleshoot and resolve issues, enhancing communication and problem-solving skills in a fast-paced environment.\n- Developed automated scripts using **adb** and **Xcode** for device-specific testing, ensuring adherence to platform standards and improving test efficiency.\n- Fostered collaboration through effective communication channels, driving a quality-driven culture within the development team for enhanced product outcomes.\n- Engaged in debug sessions with developers to address critical issues in real-time, significantly reducing bug resolution time and improving user experience.\n- Monitored and documented defect tracking metrics to inform project stakeholders, leading to data-driven decisions that improved product quality by over **15%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, Java, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Unity\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Azure DevOps\n\n**Cloud & Infrastructure:**\n\tAWS Device Farm, Kobiton, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tUnity Test Runner, adb, Xcode, Unreal Engine Blueprints, debugging, problem solving, communication, collaboration"
}