{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Operations Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Operations Engineer with 8 years of experience, I excel in *scripting*, *networking*, and *troubleshooting*, complemented by a strong proficiency in **Python**. I possess hands-on experience with **Linux** systems and am skilled at deploying and managing **Kubernetes** environments, as well as utilizing **Grafana** and **Prometheus** for monitoring and performance optimization. My background in high-performance computing (HPC) ensures I optimize system architectures for efficiency and scalability.\nAdditionally, I am adept at documenting processes and collaborating effectively with cross-functional teams to solve complex problems. I thrive in flexible environments and leverage my solid foundation in cloud technologies, including **AWS** and **Azure**, to enhance operational efficiency. My expertise also extends to developing robust solutions that integrate emerging technologies, ensuring compliance with industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Operations Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Linux** systems for deploying and maintaining scalable applications, ensuring robust performance and reliability in operational environments.\nLeveraged **Kubernetes** for orchestrating containerized applications, improving deployment times by **50%** and enhancing resource utilization across the infrastructure.\nImplemented efficient **scripting** solutions with **Python** to automate routine operational tasks, resulting in a **30%** reduction in manual intervention and workflow errors.\nConducted extensive **troubleshooting** of application and network issues, adhering to best practices, which minimized downtime to less than **1%** annually.\nCollaborated across teams to document processes, enhancing knowledge sharing and improving **documentation** accuracy by **40%**.\nWorked with **Grafana** and **Prometheus** to establish real-time monitoring dashboards that improved system alert identification time by **60%**.\nFostered a culture of **collaboration** and **flexibility** within the team, encouraging cross-functional initiatives that enriched problem-solving capabilities.\nEmployed advanced problem-solving techniques to address complex system performance challenges, successfully resolving **95%** of escalated incidents within SLA timelines.\nArchitected scalable solutions that incorporated best practices from high-performance computing (**HPC**), leading to an increase in processing efficiency across multiple operational workloads.\nEnsured that all systems adhered to security and compliance standards while maintaining high operational availability, contributing to overall organizational reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Linux** expertise to enhance system operations and optimize performance across various environments, ensuring high availability and reliability for financial platforms.\nLeveraged **Python** scripting skills to automate repetitive tasks and improve operational workflows, resulting in a **35%** increase in efficiency.\nConducted troubleshooting and network diagnostics to resolve issues related to application performance and connectivity, maintaining a **99.9%** uptime for critical systems.\nImplemented and managed container orchestration using **Kubernetes**, deploying applications in a highly scalable and efficient manner, reducing deployment times by **40%**.\nMonitored system performance and application metrics with **Grafana** and **Prometheus**, providing real-time insights that led to proactive maintenance and avoidance of potential outages.\nDocumented system architecture and operational procedures to ensure clear communication and knowledge sharing among team members.\nCollaborated with cross-functional teams, demonstrating flexibility and problem-solving skills to address operational challenges and enhance system functionalities.\nDeveloped and maintained operational scripts to streamline data processing and system monitoring tasks, increasing overall team productivity by **25%**.\nProvided training sessions on best practices for troubleshooting and system management, fostering a culture of continuous improvement and knowledge exchange within the team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Performed troubleshooting and problem-solving tasks to ensure seamless operations of backend services and infrastructure on **Linux** systems.\nDeveloped scripts in **Python** to automate routine maintenance and monitoring tasks, enhancing efficiency and reducing manual efforts.\nCollaborated with development teams to optimize performance of applications running on **Kubernetes** clusters, ensuring high availability and scalability.\nMonitored system performance using **Grafana** and **Prometheus**, setting up alerting mechanisms to proactively address any issues impacting service quality.\nDocumented operational procedures and system configurations to improve team communication and knowledge sharing, facilitating onboarding and process adherence.\nEnsured network stability and performance through effective **networking** practices, allowing for uninterrupted access to applications and services.\nEngaged in flexible collaboration with cross-functional teams to troubleshoot and resolve complex operational challenges, focusing on enhancing system reliability.\nDesigned and executed high-performance computations (HPC) workflows that leverage robust backend architectures, optimizing resource utilization and execution speeds.\nAchieved significant improvements in operational efficiency, managing over **100** services and applications in production while maintaining a **99.9%** uptime.\nUtilized automation tools to streamline deployment processes, ensuring consistent and error-free rollouts across environments."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:** \n\tNginx, JWT, OAuth2\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Grafana, Prometheus\n\n **Cloud & Infrastructure:** \n\tHPC, CI/CD & Infrastructure as Code\n\n **Other:** \n\tLinux, Networking, Troubleshooting, Scripting, MLflow, Airflow, Kubeflow, Documentation, Collaboration, Flexibility, Problem Solving, Keycloak (OIDC, RBAC), Let’s Encrypt, Certbot",
  "apply_company": "CoreWeave"
}