{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Full Stack Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Senior Full Stack Developer with 13+ years of experience in delivering high-performance applications, particularly proficient in **Python**, **JavaScript**, and **PHP**. Expertise in both frontend and backend development using **React**, **Vue.js**, and **Node.js**. Skilled in implementing scalable architectures and deploying robust applications while maintaining high code quality using **Git** for version control.\n\nDeep experience with frameworks such as **Symfony** for backend development, ensuring compliance-driven solutions tailored for the healthcare and financial sectors. Proven ability in building and integrating user-centric systems with advancements in AI/ML, driving efficiency through automation and predictive analytics. Adept at utilizing cloud services like **AWS** and **Azure** alongside CI/CD practices to enhance deployment workflows. A strong foundation in MLOps methodologies complements my technical repertoire, which includes model training and orchestration using tools like **MLflow** and **Airflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python**, **JavaScript**, and **PHP** to design and develop robust full-stack solutions for diverse applications, ensuring high-quality coding standards and efficient project execution.\nEmployed **React** and **Vue.js** to build dynamic and responsive user interfaces, enhancing user engagement and interaction across platforms.\nIntegrated **Shopware** to enhance e-commerce functionalities, optimizing backend processes for superior product management and customer experiences.\nImplemented Git for version control and collaborative development, ensuring smooth workflows and code integrity among team members.\nDesigned and executed CI/CD pipelines using industry-standard practices to accelerate application delivery without sacrificing quality.\nCollaborated with cross-functional teams to define and execute project specifications, meeting up to **99%** of delivery deadlines over a span of **12** major projects.\nOptimized application performance, achieving a reduction in load times by up to **30%** using best practices in coding and architecture.\nDeveloped and maintained RESTful APIs with **Symfony**, ensuring seamless interaction with frontend components and third-party services.\nLed system upgrades, transitioning legacy PHP applications to modern frameworks, improving system reliability and maintainability.\nMonitored and debugged applications using modern tools, achieving an overall bug reduction of **25%** in production environments.\nParticipated in code reviews and mentoring sessions, enhancing team skill levels and promoting knowledge sharing.\nAdopted Agile methodologies, enabling iterative project development and quicker response to change requests."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **JavaScript** to modernize core financial platforms by migrating to microservices architecture, enhancing scalability and performance for high-volume transactional systems.\nImplemented responsive front-end applications using **React (18)** and **Vue.js** to create interactive, user-friendly interfaces for financial tools and admin panels.\nEmployed version **3.0** of **D3.js** and **Power BI Embedded** to deliver real-time analytics dashboards, providing operations teams with instant insights into transactions and anomalies.\nDesigned and deployed an event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows including payments and alerts.\nDeveloped **ETL pipelines** for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing with efficiency metrics tracked at over **100K transactions/day**.\nEngineered and deployed machine learning models for fraud detection leveraging **scikit-learn** and **XGBoost**, enabling proactive detection of suspicious activities based on user behavior and transaction patterns with an accuracy rate of **95%**.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification by integrating **MLflow** and **Airflow** into backend services, processing models with a deployment frequency of **twice a week**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **PHP** to develop and maintain dynamic, scalable e-commerce solutions on the **Shopware** platform, ensuring seamless integration across key functionalities and modules.\nEngineered frontend applications using **React** and **Vue.js** to deliver responsive user interfaces, adhering to best practices in user experience design and optimizing for both web and mobile engagement.\nImplemented version control using **Git** for efficient collaboration and code management in a team environment, enhancing deployment efficiency by **30%**.\nDeveloped and integrated APIs with **Symfony** for backend services, ensuring robust data communication between the server-side and client-side applications.\nOptimized server-side logic and database interactions to handle a transaction volume of over **1,000** transactions per minute without performance lag, improving the platform's reliability and speed.\nCreated a modular component library in **JavaScript** for reusable UI elements, facilitating a **50%** reduction in development time for new features.\nConducted code reviews and pair programming sessions to elevate team coding standards and mentorship among junior developers, leading to a **20%** increase in overall code quality.\nCollaborated on developing CI/CD pipelines for automated deployment, reducing deployment time from hours to minutes and ensuring a swift, error-free release process.\nEngaged in cross-functional team collaborations, providing technical expertise and ensuring that all developments align with business objectives and user needs."
    }
  ],
  "skills": "****Programming Languages****\n\tPython, PHP, JavaScript\n\n****Backend Frameworks****\n\tFastAPI, Flask, Django, Symfony\n\n****Frontend Frameworks****\n\tReact, Vue, Angular\n\n****API Technologies****\n\tNginx, Let’s Encrypt, Certbot\n\n****Serverless and Cloud Functions****\n\tAWS: Lambda, ECS, RDS, S3\n\n****Databases****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n****Cloud & Infrastructure****\n\tAzure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n****Other****\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT"
}