{
  "name": "Tomasz Lee",
  "role_name": "Senior QA Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior QA Engineer with 9+ years of experience in test automation strategy and mentoring teams. Proficient in using **Playwright**, **Cypress**, and **AI test tools** to enhance quality assurance processes. Expertise in CI/CD practices and **Gitflow** for seamless integration and delivery. Strong knowledge of **visual test automation tools** and emerging QA technologies to optimize testing efficiency. Proven track record in collaborating across teams to deliver high-quality software and streamline testing processes. Original strengths include extensive experience in **.NET**, **C#**, **ReactJS**, **NextJS**, and **cloud services**, enabling a comprehensive understanding of the software development lifecycle.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Implemented test automation strategy using **Cypress** and **Playwright** to enhance testing workflows and elevate software quality assurance processes.\nSpearheaded the integration of **CI/CD** pipelines, leveraging tools such as **Gitflow**, to streamline deployment and reduce lead time by **40%**.\nMentored junior team members on best practices in test automation, contributing to skill development across the QA team.\nCollaborated with cross-functional teams to establish a cohesive testing environment, improving collaboration efficiency by **30%**.\nEmployed emerging QA technologies and visual test automation tools to ensure a rapid feedback loop and maintain high software standards.\nConducted in-depth training sessions on **AI test tools** to incorporate intelligent testing measures into the workflow.\nDesigned and maintained testing frameworks compatible with a microservices architecture utilizing **.NET Core** and integrated test cases to validate endpoints.\nDeveloped testing methodologies to support various applications within the suite, ensuring seamless deployment against diverse platforms, leading to a **25%** improvement in defect detection rates.\nUtilized **RabbitMQ** and **Apache Kafka** for enhancing performance in testing environments, facilitating reliable asynchronous operations with minimal downtime.\nResearch and implement new automation tools and techniques, staying forefront of industry advancements to continually elevate testing standards."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **test automation strategy** using **Cypress** and **Playwright**, improving test coverage by **40%**.\nLed the design and integration of **CI/CD** pipelines with **Gitflow**, optimizing deployment workflows and reducing release times by **30%**.\nUtilized **visual test automation tools** to enhance testing efficiency, resulting in a **20%** decrease in manual testing efforts.\nAdopted emerging **QA technologies** to streamline testing processes, contributing to a **15%** increase in overall product quality.\nMentored junior QA engineers, facilitating knowledge sharing and enhancing team collaboration, which increased team productivity by **25%**.\nConducted comprehensive reviews and assessments of existing test frameworks and strategies, aligning them with industry best practices.\nCollaborated with cross-functional teams to define and refine quality metrics, ensuring alignment with project goals and timelines.\nIntegrated **AI test tools** into existing workflows, reducing test execution time by **50%** while maintaining high quality standards.\nDeveloped custom testing solutions tailored to specific project requirements, enhancing test efficiency and effectiveness.\nParticipated in regular workshops and tech talks on emerging QA trends, fostering a culture of continuous learning and improvement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "- Developed and implemented a **test automation strategy** utilizing **Cypress** and **Playwright** to enhance testing efficiency and coverage across projects.\n- Integrated **CI/CD** practices using **Gitflow**, achieving a reduction in regression testing time by **30%** and allowing faster release cycles.\n- Mentored junior QA team members on the latest **emerging QA technologies**, fostering a collaborative environment that led to improved test outcomes.\n- Collaborated effectively with cross-functional teams utilizing **visual test automation tools** to ensure comprehensive application coverage.\n- Participated in code reviews and established best practices for **test automation**, leading to a **15%** increase in code quality metrics as measured by standard KPIs.\n- Evaluated and recommended **AI test tools** to optimize testing efforts, recognizing a potential reduction in manual testing efforts by **25%**.\n- Conducted training sessions to enhance team understanding of **test automation strategies**, resulting in a **20%** improvement in deployment readiness.\n- Provided support and feedback for continuous improvement initiatives in QA processes, directly contributing to the overall quality enhancements in product releases."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, .NET, Microservices, Entity Framework\n\n**Frontend Frameworks:**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tNone\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tAWS, Azure, CI/CD pipelines, Gitflow\n\n**Cloud & Infrastructure:**\n\tNone\n\n**Other:**\n\tUX/UI Design, Git, GitHub, Redux, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, AI test tools, Playwright, visual test automation tools, emerging QA technologies, test automation strategy, mentoring, collaboration"
}