{
  "name": "Mariusz Jan Skobel",
  "role_name": "Cloud Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Cloud Engineer with 10+ years of experience in delivering high-performance solutions leveraging **AWS**, **Azure**, and **Google Cloud**. Expertise in cloud platforms, **Terraform**, **CloudFormation**, and **ARM templates** for infrastructure as code. Proficient in **containerization** using **Docker** and **Kubernetes**, with a strong background in virtualization and networking to ensure robust security and compliance. Skilled in scripting languages such as **Python** and **Bash**, driving automation and cloud cost optimization. Proven track record in applying DevOps practices to enhance workflow efficiency and problem-solving capabilities. Additionally, possess extensive experience in building full stack applications with modern technologies including **React**, **Next.js**, **Flutter**, **Node.js**, **FastAPI**, and **Django**, combined with a strong foundation in microservices architecture and CI/CD automation. Committed to creating systems that are not only technically sound but also facilitate significant real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Cloud Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, cloud-native solutions utilizing **AWS**, **Azure**, and **Google Cloud**, with a focus on infrastructure as code using **Terraform** and **CloudFormation**, ensuring optimal cloud cost optimization.\n• Led the migration and re-architecture of applications into microservices-based ecosystems using **Docker** and **Kubernetes**, achieving a 30% increase in deployment efficiency and 99.9% uptime.\n• Developed robust **Python** scripts for automation and enhancement of DevOps practices, resulting in a 25% reduction in manual intervention and increased operational efficiency.\n• Established enterprise-level DevOps pipelines with tools like **GitHub Actions**, **Azure DevOps**, and **CircleCI**, integrating comprehensive security scans and automated testing to streamline deployment processes across networked environments.\n• Collaborated with cross-functional teams to optimize infrastructure security, applying advanced networking skills and best practices, mitigating security risks in cloud solutions.\n• Leveraged virtualization technologies to improve resource management and utilization, ensuring a seamless integration of services across platforms.\n• Enhanced existing systems by implementing **Infrastructure as Code** strategies, leading to quicker provisioning of environment configurations and reducing setup time by 40%.\n• Utilized **Kubernetes** for container orchestration, managing clusters effectively to ensure high availability and scalability of applications across cloud platforms.\n• Championed the development of cloud architecture guidelines and best practices to improve overall service reliability and adhere to security standards, resulting in zero compliance breaches during audits.\n• Engaged in proactive problem-solving and effective communication with stakeholders to ensure alignment on project objectives and timely resolution of technical challenges."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **AWS**, **Azure**, and **Google Cloud** for deploying scalable cloud infrastructure, implementing solutions that led to a **30%** reduction in cloud costs through effective resource management and optimization practices.\nImplemented **Terraform** and **CloudFormation** for infrastructure as code, automating the provisioning of cloud resources while maintaining security and compliance standards.\nDesigned and automated CI/CD pipelines using **Docker** and **Kubernetes** to streamline application deployment and management processes across multiple environments, enhancing deployment frequency by **40%**.\nDeveloped and maintained networking solutions, including VPNs and firewalls, to ensure top-tier security practices and compliance with industry standards, resulting in a **50%** decrease in vulnerabilities over a **6-month** period.\nExecuted virtualization strategies to optimize server usage and resource allocation, contributing to increased server performance and reduced operational costs.\nCollaborated with cross-functional teams to define and address requirements, enhancing problem-solving capabilities and communication across project stakeholders for efficient project execution.\nEmployed **Bash** and **Python** scripting to automate operational tasks, improving efficiency and reducing manual intervention by **25%** within a year.\nResearched and implemented cloud security protocols to safeguard assets, providing training and guidance on security best practices to the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **AWS**, **Azure**, and **Google Cloud** for infrastructure design and management, ensuring secure, scalable, and resilient cloud solutions for the organization.\nUtilized **Terraform** and **CloudFormation** for Infrastructure as Code (IaC), enabling automated provisioning and management of cloud resources across **9** services, ensuring consistency and compliance with standards.\nImplemented **Docker** and **Kubernetes** for containerization and orchestration of applications, facilitating efficient deployment and scalability of services by managing more than **50** containerized applications.\nDeveloped and supported cloud networking configurations, maximizing security and performance through configurations that reduced latency by up to **30%** while maintaining high availability.\nEmployed security best practices including role-based access control (RBAC) and encryption strategies to safeguard sensitive data, achieving **100%** compliance with GDPR and other regulatory standards.\nCreated and maintained scripting solutions using **Python** and **Bash** to automate routine tasks and enhance operational efficiency, solving complex problems with a **95%** success rate in critical deployments.\nConducted cloud cost optimization assessments, leading to a **25%** reduction in monthly cloud expenditures while maintaining resource performance and availability.\nCollaborated effectively within cross-functional teams, utilizing strong communication skills to articulate technical concepts to non-technical stakeholders and ensure alignment across cloud initiatives.\n"
    }
  ],
  "skills": " **Cloud & Infrastructure**\n\tAWS, Azure, Google Cloud, cloud platforms, cloud cost optimization, networking, virtualization, Docker, Kubernetes, Terraform, infrastructure as code, CloudFormation, ARM templates\n\n**Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, security\n\n**Programming Languages**\n\tPython, JavaScript/TypeScript, Bash, scripting languages\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\t\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, DevOps practices\n\n**Other**\n\tMLflow, Airflow, Kubeflow, problem-solving, communication"
}