{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Rust Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Rust Engineer with 8 years of experience, I possess a robust skill set in modern technologies, focusing on **Rust**, **Golang**, and **TypeScript**. My background includes building high-performance solutions across sectors, integrating identity management and access management strategies such as **OAuth** and **OIDC** for secure applications. I thrive in collaborative environments and adapt quickly to evolving technologies, demonstrating a commitment to continuous learning.\n\nMy expertise extends to full-stack development using frameworks like **React**, **Next.js**, **Node.js**, and **Vue**, alongside cloud services from **Azure** and **AWS**. I have successfully led projects that leverage AI and machine learning capabilities for innovative analytics and real-time data processing. My foundation in microservices architecture and event-driven systems supports the development of applications that meet compliance standards, while my hands-on experience with MLOps workflows using tools such as **MLflow**, **Airflow**, and **Kubeflow** enhances the scalability and performance of solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Rust Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Rust** and **Golang** to architect robust, scalable systems, demonstrating adaptability and continuous learning in leveraging new technologies for healthcare and financial applications.\nImplemented secure access management and identity management frameworks, incorporating **OAuth** and **OIDC** protocols to enhance application security and user authentication.\nContributed to collaborative environments, fostering teamwork across cross-functional teams to deliver high-quality solutions on time, with a focus on efficient coding practices.\nApplied **TypeScript** for developing full-stack applications alongside modern frameworks such as React and Next.js, ensuring code quality and maintainability.\nDeveloped and maintained APIs for identity and access management, ensuring compliance with regulatory standards like HIPAA and GDPR.\nLed initiatives to integrate **AI** features within the applications, enhancing user experience and operational efficiency through innovative solutions.\nImplemented unit and integration tests using Jest and PyTest, achieving a minimum of **80%** code coverage across critical components to ensure reliability and performance.\nParticipated in regular code reviews, demonstrating collaboration, and supporting the overall improvement of team coding standards.\nAdapted to evolving project requirements, showcasing strong adaptability to facilitate the success of various projects.\nEngaged in continuous learning practices, staying up to date with the latest in **AI**, **WASM**, and other emerging technologies to apply best practices in software development."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Rust** and **Golang** for developing efficient backend services, focusing on performance and concurrency to support high-throughput financial applications.\nCollaborated effectively with cross-functional teams to implement **Identity Management** and **Access Management** solutions, ensuring robust security measures through **OAuth** and **OIDC** protocols.\nPromoted a culture of **Continuous Learning** by mentoring peers and sharing knowledge on emerging technologies and best practices, enhancing team collaboration and adaptability.\nLed the modernization of existing codebases by integrating **TypeScript** for increased type safety and maintainability in the application lifecycle.\nEngaged in the development of RESTful APIs and microservices, improving system scalability and enhancing the overall architecture for transaction processing.\nApplied data science principles to develop AI-driven solutions, analyzing user behavior and transaction patterns to create predictive models.\nFostered an environment of **Adaptability**, supporting swift adjustments to changing project requirements while maintaining high-quality deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed scalable and high-performance backend services in **Rust** and **Golang**, adapting to changing business requirements and driving continuous learning in emerging technologies.\nImplemented robust **OAuth** and **OIDC** protocols for identity and access management, ensuring secure and compliant authentication mechanisms across the platform.\nCollaborated with cross-functional teams to enhance system architecture and optimize performance, while fostering a culture of adaptability and collaborative problem-solving.\nLeveraged **AI** for developing innovative solutions that improve user experience and engagement, integrating machine learning algorithms to deliver personalized features and recommendations.\nUtilized **TypeScript** for creating maintainable and efficient codebases, ensuring high code quality and collaboration on frontend projects.\nBuilt and deployed applications utilizing **WASM** to improve performance and responsiveness, with a focus on seamless user experiences in modern web environments.\nConducted code reviews and knowledge sharing sessions to promote continuous improvement and skill enhancement among team members, contributing to a collaborative and forward-thinking engineering culture.\nMaintained a commitment to continuous learning by staying updated on industry trends and integrating new methodologies into the development process."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Rust, Golang, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth, OIDC\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, Let’s Encrypt, Nginx, Certbot, AI, Identity Management, Access Management, Collaboration, Adaptability, Continuous Learning",
  "apply_company": "1Password"
}