{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Web Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Web Engineer with 8 years of extensive experience in developing high-performance web applications. Proficient in **JavaScript**, **TypeScript**, **React**, **Vue.js**, **Node.js**, **HTML5**, **CSS3**, and modern frameworks including **jQuery**, **Gulp**, and **Webpack**. Strong background in Behavior-Driven Development enhances team collaboration and project outcomes. I leverage **Git** for efficient version control and maintain code quality through the implementation of best practices.\n\nMy experience includes building seamless user interfaces and robust back-end services, ensuring cross-functional functionality and scalability. I excel at integrating responsive design principles and optimizing applications for performance and accessibility. I have a proven track record in delivering enterprise-level solutions, particularly in areas requiring compliance with industry standards. My strengths also encompass the use of CI/CD pipelines that foster continuous integration and delivery, along with solid exposure to cloud platforms like **Azure** and **AWS**. I am dedicated to driving innovation and efficiency while engaging in collaborative, agile environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and optimized user interfaces for complex applications using **JavaScript**, **React (17-18)**, **Vue.js (3.x)**, **HTML5**, and **CSS3**, ensuring seamless user experiences across web platforms.\nImplemented modern JavaScript features following **ECMAScript 5** and **ECMAScript 6** standards to enhance code maintainability and performance.\nCollaborated with cross-functional teams to deploy high-quality web solutions, utilizing **Node.js** for backend services and **TypeScript** for better type safety.\nMaintained version control with **Git**, ensuring a robust workflow across multiple projects while integrating **SASS** and **LESS** for improved styling capability.\nApplied Behavior-Driven Development principles to facilitate effective communication between technical and non-technical team members, promoting agile methodologies.\nUtilized **Webpack**, **Gulp**, and other build tools to streamline front-end development processes, reducing build time by up to **30%**.\nDeveloped responsive interfaces to ensure compatibility across various devices, enhancing user engagement and accessibility.\nCreated and executed test strategies using **Jest**, **Cypress**, and **Playwright**, covering unit, integration, and end-to-end testing for reliable releases.\nLeveraged third-party libraries and frameworks to improve application functionality, including integration of **D3.js** for data visualizations and enhancing user interactions.\nEngaged in code reviews and mentoring of junior developers, fostering a culture of learning and best practices in web development."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed dynamic, user-focused front-end applications using **React (18)**, **Vue 3**, and **TypeScript**, ensuring robust performance and seamless user experience through **CSS3** and **HTML5** integration.\n- Implemented modular and maintainable back-end solutions using **Node.js (NestJS/Express)**, focusing on **Behavior-Driven Development** practices to enhance code quality and collaboration.\n- Collaborated with cross-functional teams utilizing **Git** for version control, ensuring a streamlined development process and effective project management across **JavaScript** frameworks.\n- Optimized and adapted legacy code, transitioning from old technologies to modern approaches involving **Gulp**, **Webpack**, and **SASS** for improved build processes.\n- Engaged in continuous testing and validation of user interfaces with **Playwright**, facilitating a high-standard deployment process with a focus on test-driven strategies.\n- Built responsive UI features that align with business requirements, applying principles of **ECMAScript 6** and earlier versions to ensure compatibility and functionality across different environments.\n- Leveraged analytics and user feedback to iterate on designs, resulting in a 25% improvement in user engagement metrics over a 6-month testing phase.\n- Participated in code reviews and sprint planning sessions, contributing to enhanced team dynamics and better understanding of project scopes."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed dynamic and responsive web applications using **React (18)**, **Vue 3**, and **HTML5/CSS3**, ensuring seamless user experiences across devices and adherence to accessibility compliance (WCAG 2.1).\nImplemented modern JavaScript features with **ECMAScript 6** and **TypeScript**, facilitating better code quality and maintainability through type safety and improved syntax.\nOptimized workflow processes by leveraging **Git** for version control, enabling smoother collaboration and tracking of changes across the development cycle.\nIntegrated CSS preprocessors like **SASS** and **LESS** to improve the scalability and maintainability of styling in projects, enhancing development efficiency by **30%**.\nUtilized task runners and module bundlers including **Gulp** and **Webpack** to streamline the build process, achieving up to **50% faster load times** for web applications.\nAdopted behavior-driven development (BDD) practices with **Playwright**, allowing for robust testing and validation of application behavior, reducing bugs in production by **15%**.\nDesigned and maintained APIs utilizing **Node.js** (with frameworks like Express) to support seamless data interactions and enhance application performance under high traffic conditions.\nEngaged in full-cycle development practices, creating responsive UI components in a modular fashion that promotes reusability and efficiency in coding standards.\nCollaborated with cross-functional teams to deliver high-quality web solutions on time, ensuring project milestones were met while maintaining strict quality assurance standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, jQuery, HTML5, CSS3, SASS, LESS, ECMAScript 5, ECMAScript 6\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Gulp, Webpack, Behavior-Driven Development, Playwright",
  "apply_company": "Aylo"
}