{
  "name": "Mariusz Jan Skobel",
  "role_name": "Doctor (MD) - AI trainer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-118083397/",
  "profile_summary": "Critical thinker with 10+ years of experience in AI training and machine learning, specializing in data analysis and evaluation methodologies. Proven ability to apply **machine learning** techniques to real-world scenarios, fostering interdisciplinary collaboration and ensuring ethical standards in healthcare and finance environments. Strong communicator with a keen attention to detail, adept at formulating critical questions and conducting comprehensive research to inform medical education and assessment practices.\n\nAs a Full Stack Developer, I bring a robust technical background in **JavaScript/TypeScript**, **Python**, and **Flutter**, with practical expertise in frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proficient in building and deploying cloud-native applications on **Azure** and **AWS**, I lead the development of enterprise platforms integrating **AI/ML** capabilities for real-time analytics and intelligent decision-making. My experience spans microservices architecture, event-driven systems, and CI/CD automation, consistently delivering secure and maintainable solutions that align with compliance standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Doctor (MD) - AI trainer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tUtilized **data analysis** skills to assess patient data and clinical research, ensuring adherence to ethical standards in AI training and development.\n•\tEngaged in **interdisciplinary collaboration** with data scientists and technology teams to implement machine learning models for patient health insights and financial fraud detection, enhancing healthcare service delivery.\n•\tApplied **critical thinking** and **attention to detail** during the evaluation of medical data and results, formulating questions that drive research and improve patient outcomes.\n•\tDelivered **medical education** to peers and junior staff, emphasizing the importance of **ethical standards** and comprehensive assessment methodologies in AI-enabled healthcare environments.\n•\tConducted thorough **research** encompassing patient health trends and challenges, leveraging AI models and machine learning frameworks for predictive analytics.\n•\tParticipated in ongoing **continuous learning** to stay updated on advancements in medical AI applications, enhancing skills in **AI training** and **machine learning** processes, including the use of tools like Python (PyTorch, TensorFlow).\n•\tLed the development of training programs for healthcare professionals on effective **communication skills** and **question formulation** techniques related to AI technology use in medical settings.\n•\tImplemented comprehensive **data annotation** practices to improve the training datasets used by machine learning models in clinical scenarios, supporting patient risk prediction and fraud detection.\n•\tReviewed and refined **evaluation methodologies** utilized in AI model assessments, ensuring that they align with the highest standards of medical practice and patient care."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive **data analysis** to assess patient conditions, utilizing critical thinking to develop informed treatment plans and improve healthcare outcomes.\nImplemented **evaluation methodologies** and **assessment techniques** to monitor patient progress, ensuring adherence to high **ethical standards** in medical practices.\nFacilitated interdisciplinary collaboration by engaging with medical staff and patients, enhancing communication skills to effectively convey treatment options and patient care strategies.\nDeveloped and delivered **medical education** initiatives, fostering continuous learning and professional development for healthcare practitioners to stay updated with emerging **AI training** procedures.\nLed **research** efforts in **machine learning** applications for healthcare diagnostics, contributing to innovative solutions aimed at improving patient diagnosis accuracy and treatment efficiency.\nFormulated precise **question formulation** methods tailored to patient interviews, aiding in improved data annotation practices and thorough understanding of individual health conditions.\nExercised **attention to detail** in documenting assessments and treatment plans, ensuring accurate and compliant patient records across all clinical interactions."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized critical thinking to assess and evaluate patient cases, ensuring accurate treatment plans through thorough medical education and research.\nApplied data analysis techniques to interpret clinical data, optimizing patient outcomes and enhancing diagnostic accuracy in AI training.\nEngaged in continuous learning to keep abreast of the latest medical advancements and AI technologies, enhancing interdisciplinary collaboration among healthcare providers.\nFormulated insightful questions to drive discussions and assessments, improving communication skills with patients and colleagues to ensure clear understanding and effective treatment strategies.\nConducted assessments that adhere to ethical standards, guaranteeing patient confidentiality and integrity in clinical practice.\nImplemented AI training protocols, utilizing machine learning algorithms to enhance data annotation processes for improved healthcare applications.\nCollaborated with medical teams to develop and refine evaluation methodologies, ensuring compliance with regulatory standards in patient care.\nMaintained meticulous attention to detail in all medical documentation and reporting to ensure high-quality patient care and accurate health records."
    }
  ],
  "skills": "****Programming Languages:****\n\tPython, JavaScript, TypeScript\n\n****Backend Frameworks:****\n\tFastAPI, Flask, Django\n\n****Frontend Frameworks:****\n\tReact, Vue, Angular\n\n****API Technologies:****\n\tJWT, OAuth2\n\n****Serverless and Cloud Functions:****\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n****Databases:****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps:****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n****Cloud & Infrastructure:****\n\tAWS, Azure\n\n****Other:****\n\tMedical doctorate, Critical thinking, Medical education, Assessment, Research, Communication skills, Attention to detail, Question formulation, Data analysis, AI training, Machine learning, Data annotation, Evaluation methodologies, Interdisciplinary collaboration, Ethical standards, Continuous learning"
}