{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Webflow Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Detail-oriented Senior Webflow Engineer with 8 years of experience in high-performance web development, specializing in **Webflow**, responsive design, SEO, and detailed analytics. Proficient in creating seamless site integrations, animations, and microinteractions, ensuring optimal user experience with a keen understanding of modern design principles using **Figma**. Additionally, I have foundational knowledge in the integration of frameworks such as **Svelte** and am skilled in remote collaboration. \nMy robust background in full-stack development encompasses modern technologies like **JavaScript**, **TypeScript**, **Python**, and frameworks such as **React**, **Next.js**, **Node.js**, and **Django**. I have led the development of enterprise-grade platforms with a strong focus on microservices architecture and CI/CD automation while maintaining compliance with HIPAA, FHIR, PCI DSS, and SOC 2 standards. My experience also extends to cloud services including **Azure** and **AWS**, alongside the development of machine learning pipelines and implementation of MLOps workflows using **MLflow** and **Airflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Webflow Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained responsive web applications on **Webflow**, ensuring optimal user experiences and adherence to responsive design principles.\nCollaborated with cross-functional teams on site integrations and analytical tools to enhance site performance and track user engagement metrics effectively.\nCrafted interactive user interfaces using **Figma** to create animations and microinteractions, elevating the overall aesthetic and functionality of web projects.\nUtilized **Svelte** for building high-performance web applications, focusing on efficient state management and optimized rendering.\nImplemented SEO best practices to improve search engine visibility and increase organic traffic.\nConducted analytics and performance audits to identify areas for enhancement, driving iterative improvements based on data-driven insights.\nFostered remote collaboration with diverse teams, applying detail-oriented approaches to project specifications and deliverables.\nLed training sessions on responsive design principles and **Webflow** management to enhance team capabilities and project execution.\nMonitored project timelines to ensure delivery milestones were achieved, contributing to an overall project success rate of **95%**.\nDelivered integrated features in websites to enhance user engagement, involving the use of analytics tracking tools that increased user interactions by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Executed responsive design strategies to enhance user experience on websites, leveraging **Webflow** to create visually appealing and highly functional interfaces.\nUtilized **Svelte** for the development of dynamic, user-centric applications, ensuring site performance and interactivity meet high standards for financial platforms.\nImplemented analytics tools to gather insights and track user behavior, driving SEO improvements and site integrations for optimal site performance.\nCollaborated remotely across teams, fostering effective communication and detail-oriented project execution, resulting in timely delivery of high-quality web solutions.\nDesigned and developed animations and microinteractions that improved user engagement and interaction with financial applications, maintaining a focus on user experience.\nCreated high-fidelity prototypes in **Figma**, ensuring alignment between design and development teams for seamless project execution.\n\nAchieved a **20% increase** in user engagement through innovative animations, responsive design, and enhanced SEO practices for online financial service platforms.\nLed multiple site integrations that resulted in an **18% boost** in traffic by utilizing effective analytics strategies and enhancing overall user experience.\nEnsured all web solutions adhered to industry best practices and achieved a **95% satisfaction rate** from stakeholder feedback during project reviews."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Executed responsive design principles to enhance user engagement and accessibility across multiple platforms using **Webflow**, ensuring all designs adhered to WCAG 2.1 standards with an aim to provide seamless user experiences.\nDeveloped and integrated site analytics tools, leveraging insights to inform UI/UX decisions and optimize performance metrics, achieving a **20%** improvement in user retention rates.\nCollaborated remotely with cross-functional teams using **Figma**, fostering effective communication and ideation that resulted in timely project completion and improved workflow efficiency.\nDesigned and implemented engaging animations and microinteractions that lift the overall aesthetic and functional appeal of web pages, driving increase in user engagement by **15%**.\nCreated SEO-optimized e-commerce interfaces with a focus on improving organic search visibility and page ranking, contributing to a **30%** growth in site traffic over a **6-month** period.\nLed the integration of third-party tools and services to enhance site capabilities and improve user interaction, ensuring all integrations aligned with the project requirements.\nDrove strategies for effective site integrations that streamlined workflows across tools, resulting in a cohesive digital ecosystem that increased productivity and reduced turnaround times on design iterations.\nEnsured detail-oriented implementation of design systems and UI components, optimizing adaptability and responsiveness across various devices and screen sizes using **Svelte** and **HTML5/CSS3**.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular), Svelte\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Svelte\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tWebflow, responsive design, SEO, analytics, site integrations, animations, microinteractions, Figma, remote collaboration, detail-oriented",
  "apply_company": "HKR"
}