{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior QA Engineer with 8 years of experience, I excel in automation and testing workflows, utilizing tools such as **Playwright** and **Cypress** to ensure high-quality software delivery. My strong background in CI/CD and Gitflow methodologies enables efficient collaboration and streamlined processes within development teams. I am well-versed in integrating AI strategies to enhance testing capabilities, promoting intelligent automation in software quality assurance.\n\nIn my previous roles as a Full Stack Developer, I showcased my ability to build high-performance solutions across the healthcare and financial sectors using modern technologies like **JavaScript**/**TypeScript**, **Python**, and **Flutter**. I have led the development of enterprise-grade platforms leveraging frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My experience with cloud services like **Azure** and **AWS** has equipped me with the skills to implement robust and secure applications that meet compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, I am adept at mentorship and collaboration, fostering a productive environment that cultivates growth and knowledge sharing among team members.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Designed and implemented robust testing workflows using **Playwright** and **Cypress**, enhancing test automation for continuous integration and delivery (CI/CD) processes.\n- Mentored junior QA engineers in best practices, fostering a collaborative environment to improve overall testing quality and efficiency.\n- Collaborated closely with cross-functional teams to integrate automation solutions in the development lifecycle, ensuring high-quality product releases in line with project timelines.\n- Developed and executed test cases and strategies to ensure compliance with **AI** features, thoroughly validating functionalities through extensive automated and manual testing.\n- Oversaw the end-to-end testing of applications, maintaining a coverage goal of at least **90%** across key user journeys.\n- Implemented Gitflow branching strategies within testing processes to streamline version control and enhance collaboration across QA and development teams.\n- Conducted exploratory testing on complex functionalities, leveraging advanced tools to identify potential issues prior to production releases, thereby reducing post-deployment defects by **30%**.\n- Spearheaded automation for regression tests, reducing testing time by over **50%** and enabling faster deployment cycles.\n- Established metrics for measuring testing efficiency, ensuring actionable insights are provided to enhance future testing workflows.\n- Integrated CI/CD pipelines with existing test suites to support automated deployment workflows across **3 environments**: development, staging, and production.\n- Facilitated knowledge-sharing sessions to promote best practices in test automation, increasing team productivity through collective learning.\n- Maintained clear documentation of testing processes, making it easily accessible for team members, which improved onboarding processes for new QA engineers."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented robust **automation** testing workflows using **Playwright** and **Cypress**, ensuring high-quality software delivery and adherence to best practices in a fast-paced environment.\nTrained and mentored junior QA team members on testing methodologies, enhancing team capabilities and promoting a culture of collaboration and continuous improvement.\nDesigned and executed CI/CD pipelines in conjunction with Gitflow, streamlining deployment processes and increasing release frequency by **30%**.\nCollaborated with cross-functional teams to integrate **AI** technologies in testing processes, enabling smarter test case generation and improved defect detection rates by **25%**.\nContributed to the development of test strategies and frameworks, focusing on scalability and maintainability, which resulted in a **40%** reduction in test execution time.\nEngaged in peer code reviews, promoting best practices and knowledge sharing to enhance code quality and team skills.\nConducted thorough regression, performance, and security testing on multiple projects, ensuring compliance with industry standards and requirements, leading to a **95%** reduction in post-release defects.\nUtilized advanced bug tracking and reporting tools to maintain transparency and efficiency in the QA process, directly impacting project timelines and deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Executed comprehensive **Testing workflows** utilizing **Cypress** and **Playwright** for automated test scenarios, ensuring robust application performance and quality across the e-commerce platform.\nEnhanced **Automation** processes by developing efficient test cases and scripts using modern frameworks, achieving **85%** code coverage and decreasing manual testing time by **40%**.\nCollaborated cross-functionally with development teams to integrate reliability checks into the CI/CD pipeline, streamlining deployment processes and reducing release cycles to **2 weeks**.\nMentored junior QA engineers and facilitated knowledge sharing sessions, promoting a culture of continuous improvement and fostering collaborative team dynamics.\nImplemented best practices in **Gitflow** for version control, maintaining organized and traceable code revisions across releases.\nDesigned and executed performance and regression testing using advanced automation tools to identify bottlenecks and ensure scalability under peak load, specifically during sales events generating **1.5M+** transactions.\nLeveraged AI technologies for predictive analysis in test automation, improving defect discovery rate and enabling proactive risk assessment during development cycles.\nUtilized collaboration tools to track and report QA progress, ensuring transparency in workflows and enhancing team accountability.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Gitflow, CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, AI, Automation, Testing workflows, Mentorship, Collaboration",
  "apply_company": "Startup Environment"
}