{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Software Engineer with 13+ years of expertise in **Node.js**, **TypeScript**, and **AWS**, specializing in high-performance applications within the healthcare and financial sectors. Demonstrated proficiency in event-driven architectures and infrastructure as code, ensuring robust system performance and seamless **external systems integration**.\n\nSkilled in Agile methodologies and effective **code reviews**, fostering collaboration and strong **communication** among cross-functional teams. Experience with **DynamoDB** for reliable data management, coupled with a passion for continuous learning and **curiosity** in emerging technologies.\n\nExtensive background in both frontend and backend development, utilizing frameworks such as **React**, **Next.js**, **Vue**, and **FastAPI**, along with a solid foundation in compliance-driven development aligned with industry standards like HIPAA and PCI DSS. Proven track record of implementing CI/CD pipelines and leveraging MLOps tools such as **MLflow**, **Airflow**, and **Kubeflow** for AI/ML projects.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Delivered full-stack applications and solutions leveraging **Node.js** and **TypeScript** in an **Agile** environment, ensuring high code quality and performance through rigorous **code reviews**.\nImplemented **DynamoDB** for efficient data storage and retrieval, seamlessly integrating with external systems to enhance logistics and operational workflows.\nEmployed **infrastructure as code** practices for scalable and maintainable deployments on **AWS**, utilizing services for automation and operational excellence.\nLed the design of event-driven architectures, enabling responsive and efficient system interactions, which improved overall application performance by **30%**.\nFacilitated effective **communication** and **collaboration** across cross-functional teams to drive project success and enhance productivity.\nLeveraged curiosity to explore and integrate cutting-edge technologies, continuously improving the tech stack.\nImplemented CI/CD pipelines using industry standards, reducing deployment time by **50%** while ensuring stability across environments.\nProduced detailed documentation and user guides, enhancing team onboarding and project handovers, contributing to a **25%** increase in team efficiency.\nConducted regular training sessions to promote best practices in software development and maintain a high standard of coding discipline among peers."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Modernized core financial platforms by migrating to microservices architecture using **Node.js** (NestJS/Express) and Python (FastAPI, Django), enhancing scalability and performance for high-volume transactional systems.\n• Delivered real-time analytics dashboards with React, D3.js, and Power BI Embedded, providing operations teams with instant insights into transactions and anomalies.\n• Built interactive front-end applications with **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, utilizing Redux Toolkit and Tailwind CSS to create sleek, responsive interfaces for financial tools and admin panels.\n• Designed and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows for payments, alerts, and compliance.\n• Developed ETL pipelines for ingesting financial data from internal and third-party sources using Python, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing.\n• Built and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns.\n• Created ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services.\n• Collaborated in an Agile environment, implementing **DynamoDB** for efficient data storage and retrieval, maintaining high standards through regular code reviews and effective teamwork.\n• Integrated external systems, showcasing strong communication and collaboration skills to streamline logistics and enhance system interoperability."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable backend services using **Node.js** (NestJS, Express) and **TypeScript** for a global e-commerce platform, ensuring high availability and low latency for user-facing modules with traffic handling capacity reaching over **100,000** concurrent users.\n• Implemented event-driven architecture leveraging **AWS**, **Redis**, and **DynamoDB** to integrate external systems, streamlining logistics processes and enabling real-time data flow for order fulfillment and inventory management.\n• Collaborated in an **Agile** environment, participating in code reviews and fostering communication and collaboration among cross-functional teams to enhance project delivery timelines by an average of **30%**.\n• Engineered dynamic integrations with third-party logistics and payment systems, enhancing conversion rates by **25%** through improved checkout experiences powered by **Stripe**, **PayPal**, and **Razorpay**.\n• Authored infrastructure as code scripts using **AWS CloudFormation** to automate deployment processes, resulting in a **40%** reduction in deployment times across multiple environments.\n• Drove continuous improvement initiatives by sharing insights and gaining knowledge about the latest **event-driven** systems and technologies, leading to enhanced project outcomes.\n• Spearheaded feature development for seamless integration of logistics functionalities, maximizing operational efficiency and reducing delivery delays by **15%**.\n• Cultivated a culture of curiosity and innovation within the team, encouraging experimentation and the adoption of cutting-edge solutions."
    }
  ],
  "skills": "**Programming Languages:**\n\tNode.js, TypeScript, Python, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, DynamoDB\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Agile, event-driven, infrastructure as code, logistics, external systems integration, code reviews, communication, collaboration, curiosity, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Cimpress Technology"
}