{
  "name": "Rei Taro",
  "role_name": "Senior Scala Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Proficient Senior Scala Engineer with over 10 years of experience in developing and maintaining distributed systems, focusing on high code quality, testing, and data de-normalization. Expertise in **Scala**, **MySQL**, and **TypeScript**, alongside cloud services such as **Google Cloud Platform**. Demonstrated ability to implement monitoring and observability tools including **Prometheus** and **Grafana** to enhance system performance. Strong leadership and communication skills combined with a rich background in designing backend systems for financial platforms and AI/ML pipelines, utilizing **Python** frameworks (FastAPI, Django, Flask) and cloud-native architectures like **AWS** and **Azure**. Consistently contributed to significant projects in leading organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Scala Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Scala** to develop high-performance backend services, improving system efficiency by **35%**.\nDesigned and implemented **MySQL** databases focusing on data de-normalization, enhancing query performance by **20%**.\nCollaborated with cross-functional teams to integrate systems on **Google Cloud Platform**, ensuring scalable and distributed architectures.\nMonitored application performance using **Prometheus** and visualized data with **Grafana**, leading to a **15%** reduction in downtime.\nChampioned code quality initiatives through thorough testing and code reviews, elevating the standard of deliverables.\nDemonstrated strong leadership and communication skills while mentoring junior engineers and spearheading project timelines.\nConducted regular system assessments to troubleshoot and optimize distributed systems, ensuring robust performance and reliability."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Scala** to develop robust backend systems, ensuring high code quality and implementing advanced testing methodologies to maintain system integrity.\nLeveraged **MySQL** for data management and de-normalization techniques, optimizing queries and performance for large datasets.\nImplemented event-driven architectures with an emphasis on **distributed systems**, enhancing the scalability and resilience of applications.\nManaged cloud infrastructure on **Google Cloud Platform**, effectively utilizing platforms like **Prometheus** and **Grafana** for monitoring and performance tracking of applications.\nCollaborated effectively with cross-functional teams, focusing on leadership and communication skills to drive successful project outcomes.\nEngaged in rigorous testing practices to ensure the delivery of high-quality code and minimize production issues, achieving a **99%** up-time on services.\nLed initiatives for continuous improvement of software development processes, incorporating feedback loops and best practices into workflow, resulting in a **30%** reduction in deployment times."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Scala** to develop scalable backend services that support trade execution, portfolio management, and account tracking, improving trading operations by **30%**.\nEngineered real-time price feed processors using **TypeScript** and **Google Cloud Platform**, delivering up-to-the-minute trading data for high-frequency transactions, achieving a **99.9%** uptime.\nCollaborated with frontend teams to integrate data through REST APIs and WebSocket channels, ensuring a seamless user experience and facilitating a **40%** increase in user engagement.\nEnsured compliance with regulatory requirements, including MiFID II and GDPR, while implementing internal data security protocols, contributing to a **25%** reduction in compliance-related issues.\nImplemented comprehensive test suites with industry-standard tools, enhancing code quality and reliability, and streamlining QA and CI processes, reducing bug rates by **50%**.\nIntroduced job queuing and scheduling solutions with **Celery** and **RabbitMQ**, optimizing backend task execution and process management, leading to a **35%** improvement in operational efficiency."
    }
  ],
  "skills": "  **Programming Languages**\n\tScala, Python (3.8+), SQL, Bash, JavaScript, TypeScript\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\t\n\n  **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n  **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Google Cloud Platform\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Prometheus, Grafana\n\n  **Cloud & Infrastructure**\n\tAWS, Azure\n\n  **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, data de-normalization, distributed systems, testing, code quality, leadership, communication",
  "apply_company": "EPAM Systems"
}