{
  "name": "Andrzej Ito",
  "role_name": "Senior Contracts Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Contracts Engineer with over 9 years of experience, I possess robust skills in **Contract Administration**, **Document Review**, and **Attention to Detail**. I excel in **Collaboration** and **Communication** within cross-functional teams, ensuring thorough and precise contract management. My strengths in **Interpersonal Skills** and **Time Management** allow me to foster strong relationships and efficiently manage project timelines. Additionally, I have a proven track record of mentoring junior engineers and leading impactful projects that enhance accessibility and drive technical excellence.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Contracts Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Ensure effective **Contract Administration** by meticulously reviewing and managing contracts with a focus on detail and accuracy.\n• Collaborate with cross-functional teams to streamline processes and enhance communication surrounding contractual obligations.\n• Exhibit strong **Attention to Detail** while reviewing legal documents, mitigating risks by identifying and addressing potential issues early.\n• Maintain comprehensive documentation throughout contract lifecycle, ensuring adherence to standards and timely updates.\n• Foster strong **Interpersonal Skills** to build relationships with stakeholders, facilitating collaboration and negotiation on contract terms.\n• Oversee project timelines and deliverables, demonstrating exceptional **Time Management** to manage multiple contracts simultaneously.\n• Utilize technology tools for document review and tracking, ensuring efficient workflows and compliance with best practices.\n• Develop and present reports on contracts processed, maintaining clarity on contract status, and utilizing insights for future improvements."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Demonstrated expertise in **Contract Administration** by reviewing and managing critical project documents to ensure compliance and accuracy.\n• Maintained a high level of **Attention to Detail**, ensuring that all contract specifications and stipulations are met with a focus on eliminating discrepancies.\n• Effectively conducted **Document Review** processes, analyzing contracts and agreements for clarity and completeness across various projects, achieving a **100% compliance** rate during audits.\n• Collaborated effectively with cross-functional teams to facilitate communication and strengthen partnerships, ensuring project goals are met efficiently.\n• Leveraged strong **Communication** and **Interpersonal Skills** to negotiate contract terms and resolve any potential conflicts, leading to smooth project execution.\n• Applied **Time Management** skills to manage multiple contracts and deadlines simultaneously, resulting in the successful delivery of **15+ projects** within stipulated timelines.\n• Created ad-hoc reports using data analytics tools to track contract performance metrics and provided insights that improved contract strategies.\n• Regularly updated stakeholders through presentations and meetings to keep everyone informed about contract developments and issues."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Demonstrated **Attention to Detail** by meticulously reviewing contract documents to ensure compliance and precision across all legal aspects.\n• Fostered **Collaboration** with cross-functional teams to effectively communicate contract requirements and streamline project execution, resulting in a **20%** reduction in processing time.\n• Leveraged strong **Communication** and **Interpersonal Skills** in negotiations and discussions, enhancing team synergy and achieving a **95%** satisfaction rate in stakeholder feedback.\n• Utilized **Time Management** strategies to prioritize multiple contract assignments, successfully managing an average of **10+** contracts simultaneously.\n• Conducted thorough **Document Review** to identify necessary amendments and improvements, helping to increase contract adherence by **15%**.\n• Applied **Contract Administration** principles to ensure contracts are executed properly and timely, contributing to project deadlines and client satisfaction."
    }
  ],
  "skills": " **Programming Languages** \n\t Java, C++, C#, Python, SQL, PLSQL, Kotlin \n\n **Backend Frameworks** \n\t Spring, Spring Boot, Hibernate, Struts, JPA, Node.js \n\n **Frontend Frameworks** \n\t React, Vue, Angular \n\n **API Technologies** \n\t SOAP, REST APIs, Microservices \n\n **Databases** \n\t MS SQL Server, Oracle, MongoDB, Rabbit MQ, PostgreSQL, Redis \n\n **DevOps** \n\t SOLID, DRY, LINQ \n\n **Other** \n\t Contract Administration, Attention to Detail, Document Review, Collaboration, Communication, Interpersonal Skills, Time Management ",
  "apply_company": "Iron Mountain"
}