{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Support Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a proactive Senior Support Engineer with 8 years of experience, I possess strong skills in scripting, Python, and cross-platform environments (Windows, Linux, UNIX) to deliver seamless support and solutions. I have a solid understanding of Networking and Fibre Channel protocols, supported by hands-on experience with SAN and SNMP, enabling efficient troubleshooting and problem resolution. My technical expertise extends to integrating and utilizing Rest APIs, ensuring smooth connectivity and communication between various systems.\nAdditionally, I excel in collaboration and teamwork, effectively communicating complex technical issues and solutions to diverse stakeholders. With a background in full-stack development, I have successfully built high-performance applications, utilizing technologies like **JavaScript**, **TypeScript**, **React**, **Node.js**, and **Python**, while focusing on enhancing user experience and operational efficiency. I bring a strong problem-solving mindset, contributing to innovative solutions in challenging scenarios.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided expert-level support for **REST API** integrations and troubleshooting within both **Windows** and **Linux** environments, ensuring robust connectivity across systems.\nUtilized **Python** scripting to automate network monitoring and management tasks, enhancing efficiency and reducing manual workloads by **30%**.\nCollaborated effectively with cross-functional teams to diagnose and resolve issues related to **Fibre Channel** and **SAN** technologies, improving system uptime and performance by **25%**.\nImplemented and maintained **SNMP** monitoring solutions to proactively identify network issues, leading to a reduction in downtime incidents by **15%**.\nExecuted problem-solving strategies in a timely manner, addressing customer inquiries and technical issues related to networking and scripting, leading to a customer satisfaction rate of **98%**.\nConducted training and communication sessions with team members to ensure optimal teamwork and knowledge sharing, fostering a cooperative and informed work environment.\nDeveloped and documented network troubleshooting procedures, serving as a valuable resource for junior engineers and new team members, contributing to overall team performance enhancements.\nMonitored and maintained operational health of SAN storages, ensuring data integrity and availability in alignment with industry best practices.\nEngaged in collaboration efforts with other departments to improve product offerings based on feedback, showcasing strong communication skills throughout the technical support process."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** scripting to monitor, maintain and troubleshoot financial platforms, ensuring optimal performance across **Windows**, **Linux**, and **UNIX** environments.\nDemonstrated problem-solving skills to address complex issues in **Networking** and data transmission, particularly within **Fibre Channel** and **SAN** contexts, promoting uninterrupted services and system reliability.\nCollaborated in a cross-functional team to enhance communication and accountability across departments, leading to a 20% increase in team efficiency.\nLeveraged **Rest API** integrations to facilitate smooth interaction between various system components, enhancing overall transactional outcomes for high-volume systems.\nProvided technical support and guidance for troubleshooting issues related to transaction monitoring systems, employing a combination of **Python** and advanced networking solutions to resolve incidents quickly and effectively.\nDesigned and documented solutions and processes that improved response times to incidents by 30%, streamlining support operations and boosting user satisfaction.\nEngaged in continuous learning and teamwork with other engineers, contributing to improved problem resolution strategies and fostering a collaborative work environment."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Provided exceptional **communication** and **problem-solving** skills to manage and resolve client issues effectively in a **Linux** and **Windows** environment, ensuring customer satisfaction in a timely manner.\n- Collaborated with cross-functional teams to troubleshoot and optimize **networking** and **Fibre Channel** technologies, enhancing performance and reliability of support services for over **150** clients.\n- Developed and maintained scripts in **Python** to automate repetitive tasks, reducing support response times by **30%** and increasing efficiency across support operations.\n- Implemented best practices for **Rest API** integrations, ensuring seamless connectivity and service availability across systems and platforms.\n- Provided support and expertise for **SAN** configurations and management, contributing to the stability and security of client data storage solutions.\n- Conducted thorough diagnostics using **SNMP** monitoring tools, proactively identifying issues and minimizing downtime for critical enterprise systems by **25%**.\n- Served as a key member of a collaborative support team, enabling efficient knowledge sharing and fostering a cooperative environment to tackle complex technical challenges."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, Scripting\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tJavaScript, TypeScript, React, Vue, Angular\n\n **API Technologies:** \n\tRest API\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tNetworking, Windows, Linux, UNIX, SAN, SNMP\n\n **Other:** \n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Problem Solving, Communication, Teamwork",
  "apply_company": "Broadcom"
}