{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior DevOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior DevOps Engineer with 13+ years of experience in configuration management, release management tools, and deploying automation solutions. Proficient in implementing **CI/CD** pipelines, skilled in using **DevOps tools** and **monitoring tools** for high-performance enterprise web applications. Experienced in both **Linux administration** and **Windows administration**, ensuring operational issue troubleshooting and seamless deployment.\nAdept at leveraging scripting tools for effective system automation and documentation processes. Proven track record of delivering innovative features in the healthcare and financial industries, with hands-on expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**. Strong understanding of **microservices**, **event-driven architectures**, and cloud services like **AWS** and **Azure**. Familiar with compliance-driven development standards, including HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, have a robust foundation in building AI/ML-powered platforms using **FastAPI**, **Django**, **React**, **Next.js**, and **Vue**, complemented by MLOps experience utilizing **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented and managed **CI/CD** pipelines utilizing **GitHub Actions**, **CircleCI**, and **Azure DevOps** to enhance deployment efficiency with automated testing, linting, security checks, and multi-environment workflows.\nExecuted configuration management strategies for enterprise web applications ensuring consistency and reliability in deployments throughout the development lifecycle across **Linux** and **Windows** environments.\nDeveloped automation solutions to streamline operational processes, improve efficiency, and reduce manual intervention, resulting in a **30%** improvement in deployment speed.\nUtilized service container platforms such as **Docker** and orchestration technologies like **Kubernetes** (AKS/EKS) to facilitate scalable and fault-tolerant microservices architecture.\nPerformed comprehensive operational issue troubleshooting, reducing system downtime by **25%** through proactive monitoring and issue resolution with tools like **Prometheus** and **Grafana**.\nCreated thorough documentation for all processes, ensuring clear communication and knowledge sharing across teams, which contributed to increased operational efficiency and team alignment.\nDemonstrated strong communication skills while collaborating cross-functionally with development, QA, and ML teams to align DevOps objectives with overall business goals.\nManaged release management tools effectively to orchestrate deployments, ensuring alignment with compliance and regulatory standards such as HIPAA and GDPR across all applications.\n\nDesigned and built full-stack platforms leveraging **Python** (**FastAPI**), **TypeScript**, and **Node.js**, ensuring robust enterprise application performance.\nDelivered mobile solutions for iOS and Android utilizing **Flutter** and **React Native**, implementing state management that supports real-time user interactions.\nLed the transformation of legacy systems to microservices, improving system architecture and responsiveness.\n\nIntegrated search capabilities using **Azure Cognitive Search** and **Elasticsearch**, expediting querying processes across structured and unstructured data, enhancing user experience in information retrieval.\nDeveloped advanced data visualization tools with **D3.js**, **Chart.js**, and **Power BI Embedded** to enable stakeholders to gain insights from financial and operational data."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Implemented **CI/CD** pipelines to automate deployment processes for both microservices and enterprise web applications, resulting in a 30% reduction in release time.\n- Utilized **configuration management** tools to maintain consistent development and production environments, enhancing system stability and reducing downtime by 25%.\n- Managed and resolved operational issues through effective troubleshooting, utilizing **monitoring tools** to ensure optimal performance across all systems.\n- Designed automation solutions in **Linux** and **Windows** environments, increasing deployment efficiency by 40% and minimizing manual intervention.\n- Developed and maintained scripts using **scripting tools** to streamline workflows across teams, leading to a reduction in operational bottlenecks.\n- Collaborated cross-functionally with development and operations teams to oversee **release management tools** integration, enhancing communication and project coordination.\n- Ensured the effective use of **service container platforms** to facilitate scalability and improved resource management for applications, which decreased cloud resource usage by 20%.\n- Documented processes and systems thoroughly, providing comprehensive manuals and guides to support ongoing operations and improve team knowledge transfer.\n- Led training sessions to improve team understanding of **DevOps tools**, fostering a culture of continuous improvement within the organization."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented CI/CD pipelines to streamline development and deployment processes using **Jenkins** and **GitHub Actions**, improving release frequency by **30%**.\nUtilized configuration management tools like **Ansible** and **Terraform** to automate infrastructure provisioning and management, enhancing deployment speed by **40%**.\nAdministered service container platforms such as **Docker** and **Kubernetes**, optimizing application orchestration and ensuring high availability of **99.9%**.\nConducted Linux and Windows administration, providing operational support and troubleshooting for both environments, maintaining system performance and stability.\nDeveloped automation solutions using **Bash** and **Python**, reducing manual intervention in deployment processes by **50%**, and minimizing human error.\nImplemented effective monitoring tools such as **Grafana** and **Prometheus** to track system performance and proactively address operational issues, improving incident response time by **25%**.\nEngaged in effective communication and documentation practices to ensure knowledge transfer and operational clarity among cross-functional teams, resulting in improved collaboration.\nLed release management initiatives, coordinating software releases and ensuring minimal disruption to production environments.\nEnhanced existing enterprise web applications, ensuring they align with DevOps principles and meet organizational goals related to scalability and performance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n **Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n **Cloud & Infrastructure:**\n\tAWS\n\tAzure\n\n **Other:**\n\tCI/CD\n\tconfiguration management\n\tDevOps tools\n\trelease management tools\n\tservice container platforms\n\tLinux administration\n\tWindows administration\n\tscripting tools\n\tenterprise web applications\n\tautomation solutions\n\tmonitoring tools\n\toperational issue troubleshooting\n\tdocumentation\n\tcommunication",
  "apply_company": "Hyland"
}