{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Driven Senior DevOps Engineer with 8 years of experience specializing in cloud infrastructure and CI/CD automation, proficient in **AWS**, **Docker**, **Kubernetes**, and **Terraform**. Adept at performance profiling and employing design patterns to enhance software architecture, I ensure high-quality, scalable systems that meet industry standards. My solid experience with **Linux** environments, coupled with expertise in AI/ML technologies, including Large Language Models and Computer Vision, allows me to implement robust solutions that integrate the latest advancements in AI productivity tools.\nPossessing strong collaboration and communication skills, I also have a comprehensive background in developing and managing critical deployments within enterprise settings. I am committed to continuous improvement and have worked on various projects focusing on machine learning and data structures while ensuring compliance with industry regulations.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented enterprise-level **CI/CD** pipelines utilizing **GitHub Actions**, **Azure DevOps**, and **CircleCI** to enhance deployment efficiency and reduce time-to-market by **30%**.\n- Employed **Docker** and **Kubernetes (AKS/EKS)** to orchestrate containerized applications, improving system scalability and high availability.\n- Managed infrastructure as code using **Terraform** to maintain consistency across development and production environments, reducing configuration drift by **40%**.\n- Developed scalable solutions on **AWS**, leveraging services including **Lambda** for serverless functions and implementing cost-effective storage strategies.\n- Conducted regular performance profiling, applying design patterns and optimizing data structures, resulting in a **25%** increase in application performance.\n- Collaborated with cross-functional teams, enhancing communication and collaboration efforts leading to smoother project executions and timely delivery of features.\n- Designed and integrated Large Language Models and Computer Vision frameworks into existing applications, advancing the capability of AI productivity tools.\n- Spearheaded the implementation of test strategies using tools like **Jest** and **Cypress**, enhancing code reliability and coverage to ensure robust application performance.\n- Integrated modern data processing frameworks enabling real-time insights for large-scale datasets associated with operational metrics.\n- Enhanced infrastructure security and compliance by implementing stringent practices and robust monitoring strategies across all deployments.\n- Provided guidance and mentorship on best practices in software architecture, improving team skills and knowledge consistently.\n- Achieved **AWS certification** to reinforce knowledge in deploying secure and scalable applications, contributing to team competence in cloud solutions.\n- Leveraged **Yocto** to build custom Linux images, optimizing runtime performance for cloud-based applications."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **CI/CD** pipelines to enhance software deployment efficiency, achieving a **30%** reduction in release times for multiple financial applications.\nManaged infrastructure as code using **Terraform** to provision cloud environments effectively on **AWS**, ensuring consistency and scalability across development, testing, and production phases.\nUtilized **Docker** and **Kubernetes** for container orchestration, leading to improved application deployment and resource management across various environments, supporting over **50** microservices.\nConducted performance profiling and optimization of cloud-native applications, applying best practices for **software architecture** and **data structures**, which improved system throughput by **25%**.\nCollaborated cross-functionally with developers and stakeholders to design and implement innovative **design patterns** for scalable financial systems, adhering to robust software engineering principles.\nLeveraged **Linux** environments to maintain and monitor server performance, troubleshooting issues to ensure **99.9%** uptime for critical financial services.\nIntegrated **Large Language Models** and **Computer Vision** technologies into banking applications, enhancing user interaction and accuracy in transaction processing.\nResearched and implemented **AI productivity tools** to automate repetitive tasks in financial data processing, increasing team efficiency by **40%**.\nParticipated in knowledge-sharing sessions, enhancing team collaboration and communication around best practices in DevOps and cloud services within the organization."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **AWS** and **Terraform** for automating infrastructure deployment and management, implementing CI/CD pipelines to enhance deployment efficiency by over **40%**.\nManaged container orchestration using **Docker** and **Kubernetes**, achieving a robust and scalable application environment with uptime exceeding **99.9%**.\nConducted performance profiling and optimization of backend services, leveraging design patterns and data structures to ensure high availability and low latency across all systems.\nCollaborated with cross-functional teams to improve communication and teamwork, resulting in a **30%** reduction in project delivery time.\nDesigned and integrated systems using **Linux** environments, ensuring system stability and optimized resource utilization.\nDeveloped and deployed Large Language Model and Vision-Language Model applications to enhance AI product offerings aimed at boosting user engagement and operational efficiency.\nImplemented innovative solutions using AI productivity tools, markedly improving team efficiency.\nEngaged in continuous learning and development towards **AWS certification**, boosting personal skill set in cloud architecture.\nCreated scalable infrastructure using best practices in software architecture while mentoring junior team members in software design principles and DevOps methodologies.\nContributed to the successful adaptation of new technologies like **Yocto** for building Linux-based systems tailored to specific hardware, enhancing deployment speed and adaptability."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tLinux, performance profiling, design patterns, data structures, software architecture, communication, collaboration, Large Language Models, Computer Vision, Vision-Language Model, AWS certification, AI productivity tools, Yocto",
  "apply_company": "SQUAD"
}