{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Full Stack Engineer with 13+ years of expertise in developing high-performance applications. Proficient in **C#**, **Angular**, and **T-SQL**, with a strong foundation in **Microservices** and **Service Fabric** architectures. Demonstrated experience in deploying cloud solutions and enhancing **IT Security** measures. Skilled in collaborating with cross-functional teams to deliver high-quality software solutions that align with business goals.\n\nBeyond core technical skills, I bring extensive experience in **AI/ML** development and predictive analytics platforms. My technical toolkit includes **JavaScript**, **TypeScript**, **Python**, with a robust proficiency in both frontend and backend technologies, such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experience with cloud services on **AWS** and **Azure**, complemented by a strong understanding of CI/CD practices. Committed to compliance-driven development, ensuring adherence to industry standards including HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **Angular** to design and build scalable and secure full-stack applications, prioritizing IT Security and compliance with industry standards.\nImplemented Microservices architecture to enhance modularity and maintainability of applications, improving deployment speed by **30%**.\nDeveloped and optimized T-SQL queries for SQL Server databases, ensuring efficient data retrieval and manipulation, and reducing query response times by **25%**.\nLeveraged **Cloud Computing** solutions to deploy applications and services, ensuring high availability and scalability in production environments.\nCollaborated cross-functionally with teams to foster effective communication and teamwork, ensuring seamless integration of new features and enhancements.\nIntegrated AI-driven functionalities into applications, including predictive analytics and intelligent user interfaces, driving user engagement metrics up by **40%**.\nDefined and enforced testing strategies using robust frameworks to cover all linkage points, enhancing code quality and reliability.\nEstablished continuous deployment pipelines using leading DevOps tools, resulting in accelerated release cycles and improved application performance.\nConducted regular code reviews to maintain high standards of code quality and security, fostering a culture of collaboration and excellence within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Leveraged **C#** in developing microservices architecture that enhances system performance and scalability, resulting in a **30%** increase in transaction processing efficiency.\n- Collaborated with cross-functional teams to integrate **Angular** front-end applications, utilizing **T-SQL** for seamless data interactions and achieving a user engagement boost of **25%**.\n- Implemented **SQL Server** solutions to optimize database queries, reducing runtime by **40%**, and improving overall application response time.\n- Enhanced application security frameworks and protocols, ensuring compliance with **IT Security** standards across all platforms.\n- Championed the transition to **Cloud Computing** by deploying applications on **Azure**, leading to a **50%** reduction in infrastructure costs.\n- Designed and maintained a comprehensive microservices framework using **Service Fabric** to streamline deployment processes and improve operational resilience.\n- Fostered a culture of effective **Collaboration** and **Communication** among team members, resulting in expedited project timelines and innovative problem-solving approaches.\n- Explored **AI** capabilities to enhance application functionalities ensuring data-driven decision-making processes.\n- Successfully executed team projects by combining technical expertise with strategic vision, achieving key milestones ahead of schedule."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized microservices architecture leveraging **C#**, ensuring high performance and scalability across various components for a multifaceted application.\nEngineered robust applications utilizing **Angular** for frontend development, ensuring seamless user experiences and responsive design across both web and mobile platforms.\nUtilized **T-SQL** for efficient data retrieval and manipulation in **SQL Server**, maintaining data integrity and performance for transactional processes.\nImplemented **Cloud Computing** solutions that enhanced scalability and reliability of services in the Azure environment, supporting business growth and deployment flexibility.\nAdopted best practices in **IT Security** to safeguard applications, ensuring compliance with regulatory standards and protecting sensitive user data.\nLeveraged **AI** technologies to enhance application functionality, such as intelligent data processing and personalized user experiences, contributing to improved engagement metrics.\nFostered a collaborative work environment and improved team productivity through effective **communication** and teamwork, leading to successful project deliveries.\nDesigned and implemented performance metrics, achieving a **30%** increase in application speed in conjunction with **cloud** enhancements.\nConducted version-controlled deployments, reducing downtime by **25%** using continuous integration and delivery pipelines integrated with **Service Fabric**.\nOversaw and guided cross-functional teams in agile methodologies, ensuring alignment of project goals and timely delivery of software releases through effective collaboration."
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tPython\n\t•\tJavaScript/TypeScript\n\t•\tC#\n\n**Backend Frameworks:**\n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\n**Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\n**API Technologies:**\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\n**Serverless and Cloud Functions:**\n\t•\tAWS: Lambda\n\t•\tAzure: App Services\n\n**Databases:**\n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\t•\tRedis\n\t•\tT-SQL\n\t•\tSQL Server\n\n**DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\n**Cloud & Infrastructure:**\n\t•\tAWS: ECS\n\t•\tAWS: RDS\n\t•\tAWS: S3\n\t•\tAzure: Blob Storage\n\t•\tAzure: SQL Database\n\n**Other:**\n\t•\tArtificial Intelligence & Machine Learning\n\t•\tMLflow\n\t•\tAirflow\n\t•\tKubeflow\n\t•\tMicroservices\n\t•\tService Fabric\n\t•\tCloud Computing\n\t•\tIT Security\n\t•\tCollaboration\n\t•\tCommunication",
  "apply_company": "Inycom"
}