{
  "name": "Rei Taro",
  "role_name": "Senior R&D Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior R&D Engineer with over 10 years of experience in electronics design and technical support. Proficient in **C++**, **C**, **GIT**, and **MFC**, with a strong foundation in project management and quality assurance. Demonstrated expertise in problem-solving through innovative design and documentation practices. Proven success in driving projects within top-tier organizations, leveraging a depth of knowledge in hardware and software integration.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior R&D Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Leveraged **C++** and **C** programming languages to develop high-performance applications and system components, enhancing operational efficiency by **30%**.\n• Designed and implemented solutions for **MFC** (Microsoft Foundation Class) based user interfaces, resulting in a user satisfaction rate of over **85%**.\n• Utilized **GIT** for version control, managing code contributions from **10+** team members, ensuring a robust development workflow.\n• Applied **STM32** microcontroller architecture in electronics design projects, increasing project turnaround time by **20%**.\n• Managed project documentation and templates, leading to a **40%** reduction in onboarding time for new engineers.\n• Provided technical support and crafted troubleshooting strategies, resolving over **500** client issues annually while maintaining a resolution satisfaction rate above **90%**.\n• Engaged in quality assurance practices, streamlining testing frameworks to reduce bugs in production by **25%**.\n• Demonstrated advanced problem-solving capabilities in electronics and software integration, enhancing overall system performance."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "- Led **project management** initiatives to deliver R&D projects on time, increasing efficiency by **25%** through meticulous planning and documentation.\n- Utilized **GIT** for version control, ensuring code quality and facilitating collaboration among team members.\n- Implemented **quality assurance** practices, resulting in a **30%** reduction in bugs during the testing phases of projects.\n- Developed **technical support** protocols for various electronics design projects, improving response times by **40%**.\n- Engaged in **problem solving** activities to troubleshoot complex issues within **MFC** applications on **STM32** platforms, maintaining a high standard of reliability.\n- Conducted thorough documentation of electronics design processes, enhancing knowledge sharing and project continuity.\n- Actively participated in **C++** and **C** coding sessions, contributing to the development of robust software solutions tailored for R&D applications."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **C++** and **C** to design and develop advanced research and development solutions for innovative electronic designs, improving product efficiency by **25%**.\nApplied **GIT** for version control and collaborative project management, ensuring seamless integration of contributions from team members and maintaining code quality.\nCreated detailed documentation for electronics design processes, enhancing knowledge sharing and enabling project continuity, resulting in a **30%** reduction in onboarding time for new team members.\nLed project management initiatives, collaborating with cross-functional teams to meet project timelines and objectives, contributing to a **15%** increase in project delivery speed.\nProvided technical support and problem-solving expertise for R&D projects, resolving issues promptly and maintaining a high standard of quality assurance throughout the development lifecycle.\nImplemented quality assurance protocols and conducted thorough testing of systems to ensure compliance with industry standards and reliability in product performance."
    }
  ],
  "skills": "  **Programming Languages**\n\tC++, C, Python (3.8+), SQL, Bash, JavaScript\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\t\n\n  **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n  **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git, PyTest\n\n  **Cloud & Infrastructure**\n\t\n\n  **Other**\n\tdocumentation, project management, technical support, problem solving, quality assurance, electronics design, Kafka, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow",
  "apply_company": "Kingspan Light + Air"
}