{
  "name": "DANIEL HE",
  "role_name": "Integration Engineer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Results-driven Integration Engineer with expertise in **Python**, **Node.js**, and **GCP** for developing and integrating scalable systems. Proficient in designing robust solutions that enhance system interoperability and streamline operational workflows. Adept at leveraging **IMS** for efficient data management, ensuring seamless integration across various platforms. Highly skilled in conveying complex technical concepts in **English** to diverse audiences. Proven ability to drive improvements across healthcare, eCommerce, and finance sectors through automation and efficient architecture design.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Integration Engineer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Implemented integration solutions using **Python** and **Node.js** to enhance system communication and data exchange.\nLeveraged **GCP** (Google Cloud Platform) services to improve deployment scalability and reliability, achieving a system uptime of **99.9%**.\nStreamlined the integration process of various systems using **IMS** (Integration Management System), ensuring smooth data transfer.\nCollaborated with cross-functional teams to design and execute integration workflows, enhancing data accuracy by **40%**.\nConducted thorough testing and debugging of integration solutions, improving overall system performance and reliability.\nFacilitated technical documentation and training sessions, ensuring effective knowledge transfer and understanding of integration systems.\nMaintained fluency in **English**, fostering clear communication with diverse teams and stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "• Developed and maintained integration solutions utilizing **Python** and **Node.js**, enhancing system interoperability by 30%.\n• Collaborated with cross-functional teams to streamline services on **GCP**, resulting in a 40% reduction in deployment time.\n• Implemented Infrastructure Management Systems (IMS) to monitor and optimize cloud resources, achieving a 25% cost savings.\n• Designed and executed test strategies, using **Python** to automate tests, increasing test coverage to 95%.\n• Enhanced documentation and communication in English, ensuring clarity in technical specifications and integration processes for stakeholders."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Implemented integration solutions using **Python** and **Node.js** to facilitate seamless data exchange and improve system interoperability.\nUtilized **GCP** services, achieving a cloud infrastructure efficiency improvement of **25%**.\nCollaborated with cross-functional teams to enhance the Integration Management System (IMS), improving process efficiency by **15%**.\nDeveloped integration scripts and automated workflows to ensure system accuracy and reliability, maintaining a system uptime of **99%**.\nDocumented integration processes and provided technical support in **English** to ensure clear communication and user understanding."
    }
  ],
  "skills": "Programming Languages:\n\tPython, Node.js, Java, JavaScript, Go, SQL, Swift, Kotlin\n\n**Backend Frameworks:**\n\tSpring Boot, Spring Security, Hibernate, Express.js, JPA, Kafka, RabbitMQ\n\n**Frontend Frameworks:**\n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest\n\n**API Technologies:**\n\tRESTful API design\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, API Gateway\n\n**Databases:**\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n**DevOps:**\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline\n\n**Cloud & Infrastructure:**\n\tAWS (EKS, RDS, CloudFront, S3), GCP, CloudWatch, ELK Stack\n\n**Other:**\n\tMicroservices, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies, English, IMS"
}