{
  "name": "Tomasz Lee",
  "role_name": "Senior Java Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Java Engineer with 9+ years of experience in developing scalable applications using **Java**, **Spring**, and **REST** APIs. Proficient in database management with **MySQL** and **PostgreSQL**, and skilled in search technologies like **Elasticsearch**. Experienced in cloud computing with **AWS** and containerization technologies including **Docker**. Strong advocate of Agile methodologies and practices such as **Scrum** and **CI/CD**. Adept at integration and unit testing, ensuring high-quality deliverables. Demonstrated ability to collaborate effectively across teams to drive project success while fostering a growth mindset. Previously contributed to microservices architectures and distributed systems, utilizing **Apache Kafka**, **RabbitMQ**, and **Redis** for high-performance solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and optimized RESTful APIs using **Java** and **Spring**, improving data accessibility and integration across services.\n• Designed and implemented a microservices architecture to enhance system scalability and maintainability, leading to a **20%** increase in application responsiveness.\n• Utilized **PostgreSQL** and **MySQL** for robust data management, ensuring high availability and fast query execution.\n• Integrated **Elastic Stack** for enhanced data analysis and logging, resulting in more effective troubleshooting and system performance monitoring.\n• Implemented CI/CD pipelines on cloud services such as **AWS**, reducing deployment time by **40%** and ensuring consistent delivery.\n• Collaborated in **Agile** and **Scrum** environments to promote teamwork and iterative development, enhancing project deliverables quality.\n• Conducted **Unit Testing** and **Integration Testing** to maintain high code quality and reliability, improving code coverage by **30%**.\n• Leveraged **Docker** for containerization of applications, facilitating easy deployment and environment management.\n• Collaborated with cross-functional teams to drive project goals, demonstrating a strong **Growth Mindset** and commitment to continuous learning.\n• Streamlined reporting functionalities using **Java** and visualization libraries resulting in insightful data presentations."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Designed and developed microservices using **Spring** and **Java**, applying **REST** principles to create scalable and efficient backend solutions.\n• Managed and optimized **MySQL** and **PostgreSQL** databases, leading to a **20%** increase in query performance through advanced indexing and query optimization strategies.\n• Implemented **AWS** services for cloud deployment of applications, achieving a **30%** reduction in operational costs via resource optimization.\n• Established CI/CD pipelines using **Docker** and **GitHub Actions**, improving deployment frequency by **40%** and minimizing production errors.\n• Leveraged **Elasticsearch** for enhancing search functionalities, resulting in a **50%** improvement in data retrieval times across the platform.\n• Collaborated in **Agile** teams to ensure timely project delivery, maintaining a focus on stakeholder requirements and project milestones.\n• Conducted unit and integration testing to ensure quality code delivery, achieving a **90%** code coverage with test scenarios.\n• Supported team growth by conducting mentorship sessions and code reviews, fostering a culture of collaboration and continuous improvement.\n• Facilitated the Agile sprint planning process, ensuring efficient task management and team alignment for project goals.\n• Contributed to the creation of interactive dashboards and reporting tools using **D3.js**, increasing transparency in project tracking."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Develop and implement RESTful APIs using **Java** and **Spring**, contributing to the backbone of scalable applications that support **20%** growth in service capacity.\nDesign and manage MySQL databases, optimizing query performance to handle at least **10,000** transactions per hour.\nUtilize **Elasticsearch** to enhance search functionalities across the platform, improving user experience and response time by **30%**.\nDeploy applications using **AWS** and containerize services with **Docker** to streamline onboarding processes for development teams.\nAdhere to Agile methodologies in project management, participating in **2-week** sprint cycles that enhance team collaboration and project delivery.\nImplement CI/CD pipelines to automate testing and deployment, allowing for up to **5** automated releases per week to production environments.\nConduct comprehensive unit testing and integration testing to ensure high-quality software releases, maintaining a code coverage of at least **85%**.\nFacilitate knowledge sharing through collaboration with cross-functional teams, fostering a growth mindset and promoting innovative solutions.\nEngage in daily standups and retrospectives to optimize workflow and address any bottlenecks in project execution.\nCreate and maintain technical documentation to ensure best practices are followed and knowledge is effectively transferred throughout the organization."
    }
  ],
  "skills": " **Programming Languages**\n\t Java, JavaScript, TypeScript, Python, C#, Solidity\n\n **Backend Frameworks**\n\t Spring, NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t AWS, Azure\n\n **Databases**\n\t MySQL, MSSQL Server, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Elasticsearch\n\n **DevOps**\n\t CI/CD, Docker\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t UX/UI Design, Git, GitHub, REST, Agile, Scrum, Unit Testing, Integration Testing, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Collaboration, Growth Mindset",
  "apply_company": "Brightflag"
}