{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Platform Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Platform Engineer with 13+ years of experience in developing robust applications across healthcare and financial sectors. Expert in **Python**, with additional proficiency in **GoLang** for building scalable solutions. Demonstrates hands-on experience in **AWS** and **Azure** cloud services, enhancing system performance and reliability. Skilled in deploying **CI/CD** pipelines and utilizing **Git** for version control within **Agile** environments. Exceptional knowledge of **RESTful API** design and integration, ensuring seamless communication between services.\n\nProficient in supporting AI initiatives through machine learning and predictive analytics. Strong multitasking capabilities with an impressive track record in leading compliance-driven development adhering to standards including HIPAA and PCI DSS. Adept at managing system operations within **Linux** environments, incorporating elements of **networking** to optimize platform functionality.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Platform Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **GoLang** to design and build robust full-stack platforms for healthcare and fintech, leveraging **AWS**, **Azure**, and **GCP** for cloud deployment while ensuring compliance with HIPAA, FHIR, GDPR, PCI DSS, and SOX standards.\nImplemented efficient **CI/CD** pipelines using tools like GitHub Actions and Azure DevOps, facilitating a seamless deployment process with **test automation** and security checks across multiple environments.\nDesigned and developed **RESTful APIs** to support microservices architecture, transforming legacy systems into scalable components on **Linux** environments, achieving a **40%** reduction in operational latency.\nCollaborated in an **Agile** team environment, deploying software with continuous feedback cycles that improved feature delivery speed by **30%**.\nIntegrated intelligent features powered by **AI** for personalized dashboards and predictive analytics using modern machine learning frameworks.\nManaged version control and collaboration through **Git**, ensuring smooth integration of code changes and effective team communication.\nUtilized advanced networking techniques to optimize system performance and data transfer, contributing to a **25%** increase in overall system efficiency.\nLed initiatives to enhance platform security measures, aligning with industry best practices and regulatory requirements to protect sensitive financial and health-related data.\nConducted regular performance assessments and optimizations of cloud resources in **AWS** and **Azure**, leading to a **50%** reduction in unnecessary costs.\nMaintained comprehensive documentation to facilitate knowledge sharing and onboarding of new team members, resulting in a **20%** faster ramp-up time for new hires."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **GoLang** to modernize core financial platforms by migrating to microservices architecture, significantly enhancing scalability and performance for high-volume transactional systems.\nEngineered and maintained **AWS**, **Azure**, and **GCP** integrations to support cloud-native applications, ensuring streamlined deployment processes and reliable service dynamics.\nDesigned and built **RESTful APIs** to enable seamless communication between backend services and front-end applications, adhering to **Agile** methodologies for rapid development and iterative enhancements.\nImplemented CI/CD pipelines using **Git** and automation tools to facilitate continuous delivery and integration, reducing deployment times by **40%** and boosting team productivity.\nLeveraged **Linux** environments to optimize application performance and facilitate effective networking strategies, ensuring robust system operations and security.\nDeveloped comprehensive machine learning solutions with **AI** technologies for fraud detection and credit scoring, resulting in a **30%** reduction in unauthorized transactions.\nCreated and monitored real-time analytic solutions utilizing **Azure** services and **Apache Airflow** for data workflow management, improving operational efficiency by providing critical insights promptly.\nEngaged in unit and integration testing, focusing on quality assurance to deliver high-performing financial applications, maintaining a defect rate of less than **2%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **GoLang** for building scalable RESTful APIs, ensuring high availability and low latency in backend services for a global e-commerce platform.\nDesigned CI/CD pipelines using **AWS**, **Azure**, and **GCP**, streamlining deployments and enhancing operational efficiency across **Linux** environments.\nImplemented robust networking solutions, optimizing performance and security of services integrated with cloud service providers.\nEmployed Agile methodologies to drive development processes, enhancing collaboration and productivity within cross-functional teams.\nUtilized **Git** for version control, managing code versions and facilitating seamless team collaboration.\nEngineered and optimized responsive web applications to improve user experience on both desktop and mobile platforms, ensuring fast load times and mobile-first engagement.\nIntegrated AI capabilities and machine learning algorithms to enhance personalization and optimize e-commerce workflows, significantly boosting conversion rates.\nEnabled CI/CD best practices, reducing deployment times by up to **50%**, while ensuring seamless integration across the development lifecycle.\nDeveloped secure payment processing workflows with compliance to PCI standards, maintaining the highest level of security for customer transactions."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, GoLang\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful API\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tGCP\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD\n\tGit\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tLinux\n\tNetworking\n\n**Other:**\n\tMLflow, Airflow, Kubeflow\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\tAgile\n\tAI",
  "apply_company": "Qumulo"
}