{
  "name": "Rei Taro",
  "role_name": "Senior Network Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-oriented Senior Network Engineer with over 10 years of experience in network infrastructure, specializing in **Cisco**, **Juniper**, and **Palo Alto** technologies. Proven expertise in **Docker**, **Kubernetes**, and **CI/CD** pipelines, coupled with strong capabilities in **Python** for automation and development of **REST-APIs**. Skilled in deploying Infrastructure as Code using **Ansible** and **Terraform**, ensuring efficient network management and operational excellence. Demonstrated history of enhancing system performance and security at leading organizations, including VISA, Sii Poland, and Reply Polska. Committed to leveraging skills in **DevOps**, **ITIL**, and networking certifications (CCNA, CCNP, CCIE) to drive successful project outcomes.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Ansible** to automate network configurations and streamline deployment processes, reducing setup time by **30%**.\nEngineered continuous integration and continuous deployment (**CI/CD**) pipelines using **Docker** and **Kubernetes** to ensure efficient deployment of applications across multiple environments.\nUtilized **Terraform** for infrastructure as code, enabling quick provisioning of network resources and achieving a deployment success rate of **99%**.\nImplemented robust routing strategies and VLAN configurations to enhance network performance and security, achieving a **15%** improvement in data flow efficiency.\nConducted security assessments leveraging tools from **Cisco**, **Juniper**, and **Palo Alto** to identify vulnerabilities and enhance overall network security posture.\nCollaborated cross-functionally to address system integration challenges and ensure compliance with industry standards, leading to a **50%** reduction in integration time.\nDesigned and managed REST-APIs for seamless communication between network components, enhancing system interoperability and team productivity.\nMonitored and optimized network performance using **ITIL** best practices to maintain high availability and reliability of network services."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Designed and maintained network infrastructure utilizing **Cisco** and **Juniper** technologies to ensure optimal performance and reliability for mission-critical applications.\nImplemented **Docker** and **Kubernetes** for containerized application deployment, enhancing scalability and resource management across environments.\nUtilized **Python** for scripting and automation of network configurations and monitoring processes, resulting in a **20%** reduction in configuration errors.\nExecuted **Ansible** playbooks for configuration management, ensuring consistent system settings across **100+** network devices, streamlining deployment processes.\nDeployed **Terraform** for Infrastructure as Code (IaC), automating the provisioning of network resources and reducing setup times by **30%**.\nEstablished CI/CD pipelines to promote DevOps practices, enhancing collaboration among teams and accelerating the software development lifecycle by **40%**.\nConducted extensive network routing and VLAN configuration to optimize traffic segmentation and improve overall bandwidth utilization, successfully managing over **500** VLANs.\nPerformed security audits of network systems, implementing best practices to ensure compliance with **ITIL** standards, and the integration of security frameworks such as **Palo Alto** firewalls and advanced routing policies to guard against threats.\nCollaborated with cross-functional teams including development and security to ensure compliance, regulatory needs, and effective fault tolerance across network services."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented CI/CD practices to streamline deployment processes, enhancing the delivery speed of network solutions up to **3x** faster.\nLeveraged **Terraform** and **Ansible** for Infrastructure as Code (IaC) deployments, improving infrastructure management and scalability across cloud services.\nConfigured network routing protocols (e.g., OSPF, BGP) and VLANs to optimize data flow, managing networks with capacity for **over 10k** devices.\nDeveloped and maintained REST APIs for network monitoring, ensuring real-time data access and system integration with **JSON/YAML** formats.\nCollaborated with cross-functional teams to integrate solutions leveraging documents in **Postman**, facilitating a seamless workflow between network and development teams.\nUtilized container orchestration with **Docker** and **Kubernetes** to enhance application scalability and reliability, supporting deployment of services across multiple environments.\nConducted thorough network assessments to ensure compliance with ITIL and industry standards while aligning with Cisco and Juniper technologies for best practices.\n"
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+)\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\tJavaScript\n\n **API Technologies**\n\tREST/gRPC APIs, REST-APIs, Postman\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda)\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Ansible, Terraform, ITIL\n\n **Cloud & Infrastructure**\n\tCisco, Juniper, Palo Alto, Routing, VLAN, Infrastructure as Code, YANG, JSON/YAML\n\n **Other**\n\tMicroservices, Kafka, PyTest, Git, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, CCNA, CCNP, CCIE",
  "apply_company": "nscon network, security & consulting gmbh"
}