{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "Results-driven Senior Software Engineer with 8 years of comprehensive experience in full-stack engineering, specializing in **Ruby on Rails**, **PostgreSQL**, **MySQL**, and modern **TypeScript** frameworks such as **Stimulus**, **Turbo**, and **Tailwind CSS**. Proven track record in building scalable applications and optimizing site performance with a focus on automated and unit testing methodologies. Experienced with **AWS**, **Docker**, and **Kubernetes** for infrastructure management and deployment. In-depth knowledge of **JSON:API** and **GraphQL** for efficient data handling. \n\nI possess strong leadership skills, providing mentorship to junior developers while fostering effective communication and teamwork across cross-functional teams. My background includes developing robust solutions in high-compliance environments, ensuring applications are designed to meet rigorous standards. Leveraging expertise in **Git** and **GitHub**, I contribute to collaborative project development, enhancing code quality and maintainability.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Ruby on Rails** to architect and develop scalable full-stack applications, ensuring smooth integration with **PostgreSQL** and **MySQL** relational databases for effective data management.\nCollaborated with cross-functional teams to implement automated testing strategies using tools like **Git** and **GitHub**, focusing on unit and integration testing to maintain high code quality and system reliability.\nDeveloped user interfaces with **Stimulus**, **Turbo**, and **Tailwind CSS**, optimizing the performance and responsiveness of client applications while adhering to web standards.\nManaged CI/CD processes in the deployment of applications using **Docker** and **Kubernetes**, enabling seamless updates and scaling in cloud environments.\nImplemented robust messaging systems utilizing **RabbitMQ** and **Kafka** for real-time data processing and communication between services.\nEnhanced site performance through technical SEO practices, ensuring a seamless user experience and optimizing search engine visibility.\nMentored junior developers in effective coding practices, fostering a culture of communication and learning within the engineering team.\nAnalyzed and enhanced application performance, achieving improvements by **30%** through optimization techniques and code refactoring.\nDesigned API layers using **JSON:API** and **GraphQL**, facilitating efficient data querying and interactions between the front-end and back-end systems.\nStreamlined application deployments by integrating automated testing and best practices into the development workflow, reducing deployment times by **40%** and minimizing downtime.\nProvided regular feedback and code reviews, ensuring adherence to industry standards and best practices while contributing to team growth and productivity."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Led the development of financial platforms utilizing **Ruby on Rails** for backend services, ensuring high performance and reliability.\n• Applied **full-stack engineering** principles in building dynamic, user-focused front-end applications with **TypeScript**, **Tailwind CSS**, and **Stimulus** to create responsive interfaces for financial dashboards and admin portals.\n• Implemented **automated testing** and **unit testing** methodologies to ensure code quality and robustness of applications, enhancing the development process efficiency by **30%**.\n• Designed and maintained relational databases using **PostgreSQL** and **MySQL**, optimizing queries that improved data retrieval speed by **25%**.\n• Integrated **RabbitMQ** and **Kafka** for effective message queuing, establishing a scalable system for asynchronous communication within transaction processing workflows.\n• Developed and implemented **GraphQL** APIs for efficient data queries, leading to a **40%** reduction in over-fetching of data across financial applications.\n• Utilized **Git** and **GitHub** for version control, facilitating collaborative development and streamlined code reviews, reducing merge conflicts by **20%**.\n• Mentored junior developers in best practices, fostering a culture of continuous learning and enhancing team productivity by **15%**.\n• Focused on **site performance optimization** techniques, yielding a **60%** improvement in load times for user-facing applications.\n• Collaborated with cross-functional teams to optimize technical SEO practices, improving organic search rankings by **35%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized full-stack applications for various platforms utilizing **Ruby on Rails**, with a focus on enhancing site performance optimization and technical SEO.\nEngineered robust backend services and integrated relational databases such as **PostgreSQL** and **MySQL**, ensuring a scalable architecture that supports up to **10,000** concurrent users.\nLeveraged **Git** and **GitHub** for version control, facilitating seamless collaboration within a distributed development team comprising of **12** engineers.\nDeveloped automated testing strategies including unit testing, improving code coverage to **85%** and ensuring code quality throughout the development lifecycle.\nImplemented responsive UI components with **Tailwind CSS**, integrating **Stimulus** for enhanced interactivity and leveraging **Turbo** to optimize page load times by up to **30%**.\nEngaged in architectural discussions to implement **JSON:API** and **GraphQL** for efficient data retrieval, improving API response times by **50%**.\nUtilized **Docker** and **Kubernetes** for containerization and orchestration, streamlining deployment processes and reducing rollback times by **40%**.\nFacilitated team mentorship, empowering junior developers in best practices and supporting a culture of knowledge sharing and continuous improvement.\nCommunicated effectively with cross-functional teams to gather requirements and translate them into technical specifications, ensuring alignment on project goals and timelines."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tRuby on Rails\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular), Stimulus, Turbo, Tailwind CSS\n\n **API Technologies:**\n\tJSON:API, GraphQL\n\n **Programming Languages:**\n\tPython(FastAPI, Flask, Django), TypeScript\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, relational databases\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tfull-stack engineering, automated testing, unit testing, RabbitMQ, Kafka, technical SEO, site performance optimization, mentorship, communication\n\n **Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **CI/CD & Infrastructure as Code:**\n\tTerraform, Ansible, Helm, Docker Compose"
}