{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Math Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Full Stack Developer with 13+ years of experience, specializing in delivering AI/ML-powered applications. Skilled in leveraging **AI**, **data labeling**, and advanced **programming** techniques to enhance predictive analytics and automation. Adept in using **JavaScript/TypeScript**, **Python**, and **Flutter** with comprehensive expertise in both frontend and backend technologies, including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.\n\nDemonstrated ability to implement complex mathematical algorithms within applications, ensuring accuracy and efficiency in data processing. Proficient in deploying cloud-native systems on **AWS** and **Azure**, and experienced in architecting microservices, event-driven systems, and robust CI/CD pipelines. Committed to compliance-driven development, ensuring all solutions meet essential standards including HIPAA, FHIR, PCI DSS, and SOC 2.\n\nStrong background in MLOps, encompassing model training, serving, and orchestration with tools like **MLflow**, **Airflow**, and **Kubeflow**. Excellent analytical writing and communication skills, enabling effective collaboration and fact-checking to enhance project outcomes.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Math Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Demonstrated strong **programming** skills by designing and building full-stack platforms, ensuring alignment with advanced **AI** techniques to support complex numerical computations.\n- Utilized **analytical writing** to develop documentation and explain methodologies in projects involving data labeling and **math** processes, improving team understanding and project clarity.\n- Collaborated effectively through **communication** with cross-functional teams to integrate real-time analytical features into platforms, thereby enhancing user experience in intricate workflows involving **AI**.\n- Applied **data labeling** strategies in the construction of ML models for financial applications, ensuring accurate training datasets that led to a **25%** increase in detection accuracy for fraud detection.\n- Engineered solutions using **Python**, **TensorFlow**, and **PyTorch** for predictive modeling tasks, correlating insights with real-world business outcomes to optimize programmatic efforts in risk management.\n- Implemented reinforced learning from human feedback (**RLHF**) methods that improved model performance by **30%** in complex decision-making processes.\n- Managed MLOps workflows to ensure a streamlined approach to model training and validation, using **MLflow** and **DVC**, leading to time savings of **40%** in deployment cycles.\n- Conducted rigorous fact-checking and validation of deployed algorithms, reducing errors in financial estimations and improving trust in system outputs.\n- Designed and deployed a robust data infrastructure using **PostgreSQL** and **MongoDB**, capable of handling real-time analytics for finance applications, supporting data queries that have increased by **50%** in operational efficiency.\n- Developed visualization tools leveraging **D3.js** and **Power BI Embedded** for analytical insights, translating complex data into understandable formats for stakeholders, leading to improved strategic decisions across the board."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **AI** technologies to enhance the development of complex mathematical algorithms and models for predictive analytics.\nConducted thorough **data labeling** for training datasets, ensuring high-quality inputs for machine learning applications.\nImplemented **reinforcement learning from human feedback (RLHF)** strategies to optimize system performance and improve model accuracy.\nUtilized strong **mathematical** skills to design and validate algorithms, ensuring robustness and efficiency in computations.\nExecuted comprehensive fact-checking processes to ensure the integrity of analytical outputs and data-driven decisions.\nProvided insightful **analytical writing** to document findings, methodologies, and recommendations for data-driven projects, facilitating effective communication with stakeholders.\nDeveloped and maintained clean and efficient code using modern **programming** languages (Python, JavaScript), enhancing workflow and application functionality.\nFostered clear and effective **communication** with cross-functional teams, ensuring alignment on project goals and collaboration on deliverables.\nUtilized quantitative metrics to track project milestones, achieving a 20% improvement in project efficiency and reducing deployment times by **35%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **AI** technologies to optimize algorithms for data processing and recommendation engines, utilizing frameworks such as TensorFlow and scikit-learn to enhance machine learning capabilities in e-commerce platforms.\nEmployed analytical writing and communication skills to document algorithms and AI model performance, translating complex mathematical concepts into accessible insights for cross-functional teams.\nDeveloped data labeling techniques to refine the quality of training datasets, achieving an accuracy improvement of over **25%** in AI model effectiveness.\nUtilized strong programming expertise in Python and JavaScript, collaborating closely with engineers to integrate AI solutions and enhance backend functionalities, achieving over **99%** uptime in production environments.\nDemonstrated effective communication of technical concepts to stakeholders, ensuring alignment and understanding of AI-driven initiatives and project objectives.\nApplied mathematics and data analytics to conduct in-depth evaluations of AI performance metrics, driving continuous improvement initiatives based on quantitative analysis and feedback loops.\nFacilitated problem-solving sessions with cross-disciplinary teams to address challenges in AI implementation, promoting innovative approaches and solutions for customer-centric improvements.\n"
    }
  ],
  "skills": "****Programming Languages: \n\tPython, JavaScript/TypeScript\n\n****Backend Frameworks: \n\tFastAPI, Flask, Django\n\n****Frontend Frameworks: \n\tReact, Vue, Angular\n\n****API Technologies: \n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n****Serverless and Cloud Functions: \n\tAWS: Lambda, ECS; Azure: App Services\n\n****Databases: \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps: \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n****Cloud & Infrastructure: \n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database\n\n****Other: \n\tAI, data labeling, RLHF, math, fact-checking, analytical writing, programming, communication",
  "apply_company": "SME Careers"
}