{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of experience in developing and implementing high-performance applications. Proficient in **Golang**, **SQL**, **data warehousing**, **Nats**, and **Kafka**. Demonstrated expertise in building and maintaining microservices, APIs, and integrating messaging systems, while utilizing best practices in clean code and agile development methodologies. Experienced with blockchain fundamentals including **EVM** and indexing, alongside knowledge in cryptography and Web3 technologies. Proven track record of delivering scalable solutions and optimizing operational performance through observability metrics using **Prometheus** and **Grafana**. Strong communication and collaboration skills, capable of leading cross-functional teams to successful project completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and maintained robust APIs to facilitate seamless data access, utilizing principles of **clean code** and **agile development** methodologies.\nDesigned and implemented data warehousing solutions with a focus on **SQL**, ensuring efficient storage and retrieval of large datasets.\nIntegrated advanced messaging systems like **Kafka** and **Nats** to enhance system reliability and facilitate real-time communication, achieving reduced latency by **30%**.\nApplied **observability metrics** through tools like **Prometheus** and **Grafana** to monitor application performance and ensure system health, resulting in a **25%** decrease in downtime.\nSpearheaded the architecture of a microservices framework for scalable applications using **Golang** and **blockchain fundamentals**, optimizing resource allocation and management.\nConducted thorough testing and implemented cryptographic standards to ensure application security and data integrity across systems.\nCollaborated with cross-functional teams on user interface improvements while adhering to **Web3** principles and practices.\nEnhanced system indexing processes, improving data retrieval speed by **20%**.\nUtilized AWS cloud services to deploy and scale applications, maintaining high availability and performance under varying load conditions."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and implemented APIs using **Golang**, enhancing data interchange and system integration, optimizing performance by **30%**.\n• Designed a microservices architecture leveraging **Nats** and **Kafka** messaging systems for efficient task orchestration and real-time data processing, which supported a scalable infrastructure handling **100+** requests per second.\n• Collaborated on data warehousing solutions utilizing **SQL** for optimized storage and rapid data retrieval, achieving a **20%** reduction in query response times.\n• Built observability metrics dashboards with **Prometheus** and **Grafana**, improving system monitoring and performance insights by **40%**.\n• Applied agile development methodologies to ensure continuous integration and deployment, resulting in a **15%** decrease in project delivery times.\n• Conducted effective code reviews promoting clean code practices and increased testing coverage by **25%**, significantly reducing bug occurrences.\n• Implemented encryption and cryptography techniques, ensuring data integrity and security in line with **blockchain fundamentals** and **Web3** principles.\n• Created robust indexing systems to enhance data retrieval speed, enabling real-time analytics for applications handling large datasets.\n• Mentored junior developers, contributing to a collaborative team environment that increased overall productivity and software quality."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and maintained high-quality **APIs** that enhanced application interoperability and data sharing across systems.\n• Implemented data warehousing solutions that optimized query performance and data retrieval using **SQL**.\n• Designed and integrated observability metrics leveraging **Prometheus** and **Grafana** to monitor application performance, leading to a 30% reduction in downtime.\n• Utilized **messaging systems** like **RabbitMQ** and **Kafka** to ensure seamless data processing and communication across various services.\n• Collaborated in an **agile development** environment, participating in daily standups and code reviews to enhance team productivity and coding standards.\n• Engaged in the application of **blockchain fundamentals** and **EVM** (Ethereum Virtual Machine) technology for distributed and secure solution development.\n• Improved maintainability and performance by migrating existing code to **clean code** standards, and testing practices.\n• Worked with **AWS** cloud services for scalable application deployment and management, increasing deployment speed by 25%.\n• Developed and optimized data indexing strategies for efficient data retrieval, resulting in a performance increase of **15%**.\n• Actively engaged in **cryptography** practices to secure application data and enhance overall system security."
    }
  ],
  "skills": "  **Programming Languages**\n\tGolang, Python, JavaScript, TypeScript\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL, APIs\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\n  **DevOps**\n\tCI/CD pipelines, observability metrics, Prometheus, Grafana\n\n  **Cloud & Infrastructure**\n\tdata warehousing, messaging systems, Nats, Apache Kafka, RabbitMQ, Redis\n\n  **Other**\n\tUX/UI Design, Git, GitHub, testing, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, blockchain fundamentals, EVM, indexing, cryptography, agile development, clean code, Web3",
  "apply_company": "Consensys"
}