{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Query Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Query Engineer with 13+ years of experience in software design and development, specializing in performance optimization and distributed systems. Proficient in **C++**, database management, query execution, and data structures, leveraging strong knowledge of algorithms to solve complex problems efficiently. Adept at collaborating with cross-functional teams to deliver high-performance applications and analytics solutions.\nSkilled in **AWS** and **Azure** for cloud deployment, with hands-on experience in building AI/ML-powered platforms that support real-time processing and predictive analytics. Proven track record in implementing change streams and CI/CD pipelines to enhance development workflows. Committed to mentoring junior developers and fostering a culture of collaboration and continuous improvement.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Query Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Executed advanced **database** design and implementation strategies to optimize **query execution** efficiency, achieving performance improvements of up to **30%**.\nLeveraged **C++** for building high-performance distributed systems, ensuring scalability and reliability of backend services across various cloud environments.\nImplemented innovative **software design** patterns and utilized effective **data structures** to enhance application performance and maintainability, significantly reducing code complexity.\nDeveloped custom analytics solutions that provided insights into system performance, leading to a **25%** reduction in operational costs through informed decision-making.\nMentored junior engineers on best practices in **algorithms** and **performance optimization**, fostering a culture of collaboration and continuous learning within the team.\nUtilized **Change Streams** for monitoring real-time updates in databases, enabling prompt responses to data fluctuations in applications, and enhancing user experience.\nConducted thorough code reviews and facilitated collaborative problem-solving sessions to promote excellence in software craftsmanship and innovation.\nDesigned and implemented distributed data processing solutions that supported high-throughput requests, maintaining a system reliability rate of **99.9%**.\nParticipated in cross-functional teams to discuss and architect scalable solutions that integrated well with existing systems, ensuring optimal performance across all layers of the application stack."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Optimized query execution and performance of financial platforms by implementing advanced **C++** algorithms and efficient **database** structures to support high-volume transactions.\nMentored junior engineers in software design principles and best practices for building scalable and high-performance systems within distributed environments.\nCollaborated with cross-functional teams to enhance data analytics capabilities through real-time insights, utilizing **analytics** tools and methodologies aligned with industry standards.\nDesigned and executed robust cloud solutions that included **Change Streams** for asynchronous data processing, improving system responsiveness and reliability across applications.\nLeveraged knowledge of **distributed systems** to formulate strategies that facilitated performance optimization in financial data workflows, enhancing user experience and operational efficiency.\nUtilized data structures and algorithms to refine backend processes, ensuring quick response times and efficient handling of complex queries.\nProvided expertise in mentoring team members on best practices for collaboration and problem-solving within the context of software development and engineering methodologies."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Optimized **database** query execution to enhance performance and efficiency in distributed systems, resulting in a **30%** reduction in query response time.\n• Designed and implemented robust **software design** patterns and **data structures** for complex query handling and storage solutions, streamlining workflows for analytics and data retrieval.\n• Collaborated with cross-functional teams to develop analytics solutions leveraging cloud services, improving data accessibility and insights using real-time **Change Streams** from MongoDB.\n• Mentored junior engineers in best practices for **performance optimization** and data processing algorithms, fostering a culture of continuous improvement and knowledge-sharing within the team.\n• Developed and maintained scalable **cloud**-based architectures for data handling and querying, ensuring high availability and reliability for large-scale applications.\n• Implemented advanced **algorithms** to enhance data integrity and consistency across various platforms, contributing to an overall increase in system performance by **25%**.\n• Facilitated team collaborations to enhance **distributed systems**' functionalities through organized brainstorming and problem-solving sessions, effectively driving project goals forward.\n• Actively participated in code reviews and provided feedback focused on optimizing data access methods while adhering to industry best practices.\n• Engaged in ongoing learning and adaptation of emerging technologies and techniques relevant to query engineering, ensuring alignment with modern standards and expectations."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript, C++\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, software design, data structures, algorithms, query execution, distributed systems, performance optimization, collaboration, analytics, Change Streams, mentor",
  "apply_company": "MongoDB"
}