{
  "name": "Rei Taro",
  "role_name": "Senior Integration Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Skilled Senior Integration Engineer with over 10 years of experience in designing and delivering backend systems for financial and AI-driven applications. Proficient in **Python** and **JavaScript**, with a strong focus on building **RESTful APIs** to enable seamless integration and facilitate NLP and Conversational AI functionalities. Experienced in leveraging cloud-based platforms such as **AWS** and **Azure** for robust, scalable solutions. Demonstrated ability to work with **Salesforce**, **ServiceNow**, and **MSDynamics** to manage complex projects effectively. A results-oriented professional with proven project management skills and exceptional communication abilities, contributing to significant projects at prestigious organizations such as VISA and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Integration Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **JavaScript** to develop and maintain **RESTful APIs** for seamless integration with various third-party services, including **Salesforce** and **ServiceNow**.\nEngineered backend services in **Python** using **FastAPI** to streamline document automation, user onboarding, and reporting workflows, improving processing time by **30%**.\nDeveloped event-driven solutions with **Celery** and **Redis** to manage asynchronous processing for financial transaction requests, enhancing system responsiveness.\nDeployed microservices on **Azure App Services** and utilized **Terraform** to manage infrastructure as code, ensuring seamless cloud operations with a **99.9%** uptime.\nCreated and maintained data pipelines for regulatory data exchange with **Apache Airflow** and **Azure Functions**, ensuring timely and accurate data flow that meets strict compliance timelines.\nLed security assessments and integrated **OAuth2** and **Azure AD B2C** for secure, scalable authentication systems, reducing security vulnerabilities by **25%**.\nCollaborated with cross-functional teams to address system integration challenges, ensure compliance, and oversee release strategies, enhancing overall project delivery efficiency by **20%**.\nEmploy professional communication skills to effectively liaise with stakeholders regarding integrations involving **VoIP**, **Video Conferencing**, and **8x8 APIs**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed and optimized **RESTful APIs** using **Python** and **FastAPI** to enhance document workflows and facilitate user onboarding, achieving a **30% reduction** in process time.\n• Designed and implemented scalable back-end solutions for **Conversational AI** leveraging **NLP** technologies to improve user interaction, resulting in a **25% increase** in user engagement.\n• Created event-driven microservices with **Celery** and **Redis**, enabling asynchronous processing of financial data, which improved transaction processing speed by **40%**.\n• Managed deployment of microservices on **Azure App Services** utilizing **Terraform** for infrastructure automation, resulting in a more consistent environment and a **50% faster** deployment cycle.\n• Engineered data pipelines for secure regulatory data exchange using **Apache Airflow** and **Azure Functions**, streamlining workflows and reducing data processing time by **Outcomes measured: 20%**.\n• Conducted security audits to ensure compliance with standards and integrated **OAuth2** and **Azure AD B2C** for robust authentication and secure access control, enhancing security perception among stakeholders.\n• Collaborated closely with cross-functional teams, ensuring successful system integration, maintaining **90% compliance** with regulatory requirements, and streamlined release management processes."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** to develop robust backend services for trade execution, portfolio management, and account tracking, significantly enhancing trading operations by 30% efficiency.\nDesigned and deployed **RESTful APIs** that facilitated seamless data communication between frontend teams and backend services, ensuring optimal user experience for over **1000 active users**.\nEngineered real-time price feed processors using **asyncio**, **WebSockets**, and **Redis**, achieving a **99.9% uptime** for high-frequency transaction environments.\nEnsured compliance with industry regulations including MiFID II and GDPR while maintaining a high standard of internal data security protocols, thereby reducing data breach risks by **40%**.\nImplemented automated testing frameworks using **PyTest**, **tox**, and mock servers which reduced testing time by **50%** and streamlined QA and CI processes.\nIntroduced job queuing and scheduling solutions utilizing **Celery** and **RabbitMQ**, optimizing backend task execution and increasing process management efficiency by **25%**.\nLeveraged **Project Management** skills to coordinate with multiple teams, enhancing communication and project delivery timelines by implementing **Salesforce** and **ServiceNow** integration strategies."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tRESTful APIs, REST/gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, NLP, Conversational AI, Salesforce, ServiceNow, MSDynamics, VoIP, Video Conferencing, 8x8 APIs, Project Management, Professional Communication",
  "apply_company": "8x8"
}