{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior SAP Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior SAP Engineer, I bring 8 years of comprehensive experience in troubleshooting, configuration, and root-cause analysis within enterprise environments. My strong analytical skills and problem-solving abilities have enabled me to deliver process improvements that enhance system performance and user satisfaction.\n\nI possess excellent communication and collaboration skills, allowing me to work effectively with cross-functional teams to drive successful project outcomes. With a robust understanding of **SAP** technologies and methodologies, I am dedicated to optimizing payroll processes in the UK market and resolving complex issues efficiently.\n\nAlongside my expertise in SAP, I have a history of building high-performance solutions in the healthcare and financial sectors, utilizing modern **JavaScript/TypeScript**, **Python**, and **Flutter**. My technical experience encompasses full-stack development with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, as well as extensive work with cloud services including **Azure** and **AWS**. I have led the development of platforms integrating AI/ML for predictive analytics, and have a strong foundation in microservices architecture, event-driven systems, and CI/CD automation, ensuring robust and secure application development.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior SAP Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **SAP** to configure and troubleshoot complex payroll systems, ensuring accurate processing for **9,000+** employees across the UK payroll structure while adhering to compliance standards.\nConducted thorough root-cause analysis on payroll discrepancies, implementing solutions that led to a **30%** reduction in processing errors and improved operational efficiency.\nCollaborated with cross-functional teams to enhance system configurations, enhancing user experience and operational processes, resulting in a **25%** improvement in payroll reconciliation.\nDeveloped and documented clear communication channels and process flows, improving stakeholder collaboration and transparency in the payroll processing system.\nImplemented process improvements based on analytical assessments that streamlined existing procedures, driving significant time savings of **15 hours/week** for the payroll team.\nProvided ongoing troubleshooting support, utilizing analytical skills to resolve system issues promptly, reducing downtime by **40%**.\nTrained team members on SAP configurations and payroll systems, enhancing compliance knowledge and technical skills across the department.\nParticipated actively in team meetings, delivering insights on system optimization and troubleshooting challenges, fostering a culture of collaboration and continuous improvement.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Configured and troubleshot **SAP** systems to ensure optimal performance and user satisfaction, demonstrating strong analytical skills in identifying system issues and implementing effective solutions.\nConducted root-cause analysis to resolve **UK Payroll** discrepancies, applying problem-solving techniques to enhance payroll processing accuracy by **30%**.\nCollaborated with cross-functional teams to gather requirements and enhance system functionalities, leading to a **25%** improvement in overall process efficiency.\nEnhanced existing payroll configurations and processes, resulting in significant reductions in manual entry tasks and increasing productivity by **40%**.\nAnalyzed and documented system configurations, creating clear communication channels with stakeholders to facilitate effective collaboration and process improvement initiatives.\nLed the development of user training materials and conducted workshops, improving user adoption of **SAP** tools by **20%**.\nImplemented continuous improvement strategies to optimize **SAP** workflows, effectively decreasing processing times for payroll and reporting by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Configured and optimized **SAP** solutions to enhance UK Payroll processes, ensuring compliance with regional regulations and improving operational efficiency by **25%**.\nConducted thorough troubleshooting and root-cause analysis for SAP-related issues, consistently resolving **90%** of incidents within the first **24 hours** to ensure minimal disruption.\nUtilized analytical skills to gather requirements and drive process improvement initiatives, leading to a **15%** reduction in processing time across payroll cycles.\nCollaborated with cross-functional teams to design and implement configuration changes, improving the integration of **SAP** modules with existing systems.\nFacilitated effective communication across departments to ensure seamless collaboration and understanding of SAP functionalities, resulting in enhanced user adoption and satisfaction.\nApplied strong problem-solving techniques to identify and implement solutions for complex configuration challenges, significantly reducing error rates in payroll processing.\nEngaged in continuous process improvement strategies, which helped streamline workflows and increased overall efficiency within the payroll department, impacting over **1,000 employees** directly.\nMentored junior team members in **SAP** best practices, fostering a culture of knowledge sharing and collaboration across the team."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tCI/CD, Infrastructure as Code\n\n **Other:**\n\tSAP, UK Payroll, troubleshooting, configuration, root-cause analysis, analytical skills, problem-solving, communication, collaboration, process improvement",
  "apply_company": "Support Revolution"
}