{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Proficient in **MS Office** and **SAP** with exceptional **communication** and **teamwork** skills, complemented by a strong ability to work autonomously and in a structured manner. With over 10 years of experience as a Senior Backend Developer, I bring a wealth of expertise in delivering high-performing backend systems. My background in financial platforms, AI/ML pipelines, and cloud-native architectures has equipped me to effectively contribute to impactful projects. I am skilled in developing scalable services and automation tools using **Python (FastAPI, Django, Flask)** and leveraging cloud services such as **AWS** and **Azure**. My proven track record includes successful collaborations with leading organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed and maintained comprehensive sales strategies, leveraging **MS Office** for creating presentations and reports to enhance client engagement.\nFostered effective communication with clients and internal teams, ensuring clear articulation of **sales** strategies and **product offerings**.\nCollaborated with cross-functional teams to address technical requirements, using **SAP** for managing customer relationships and tracking sales progress.\nDrove teamwork initiatives to promote collaboration and autonomy within the sales engineering team, resulting in a **15%** increase in sales productivity.\nUtilized **vacuum technology** knowledge to address client needs and provide tailored solutions that improved customer satisfaction and retention rates by **20%**.\nExecuted structured work plans that involved systematizing processes for handling customer inquiries, successfully reducing response times by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed robust sales strategies and technical solutions to enhance client engagement and drive revenue growth.\n• Utilized **MS Office** for creating presentations and reports, improving communication with stakeholders by **30%**.\n• Leveraged **SAP** to manage customer data and sales processes, ensuring a streamlined workflow and efficient data analysis.\n• Collaborated with various teams to implement customer feedback into product improvements, showcasing strong **teamwork** and **communication** skills.\n• Conducted presentations that effectively communicated complex technical concepts to non-technical stakeholders, enhancing client understanding and satisfaction.\n• Independently handled client negotiations and project management tasks, demonstrating high levels of **autonomy** and structured work approaches.\n• Achieved a **15%** increase in sales by effectively utilizing **vacuum technology** solutions tailored to client specifications."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Leverage strong **communication** skills to engage with clients and understand their needs, resulting in tailored sales presentations and strategies that led to a **20%** increase in quarterly sales.\nUtilized **teamwork** principles to collaborate with cross-functional teams, ensuring seamless integration of **sales** strategies with **SAP** systems to enhance customer relationship management.\nDemonstrated **autonomy** by independently handling large accounts, achieving **15%** year-over-year growth through proactive client engagement and follow-ups.\nMaintained a structured work process by implementing **MS Office** tools for project management, tracking performance metrics that improved sales efficiency by **30%**.\nApplied in-depth knowledge of **vacuum technology** products, effectively addressing clients' technical inquiries and leading to a significant reduction in inquiry response times.\nDeveloped and implemented training sessions on **SAP** solutions, increasing overall team proficiency and product knowledge as evidenced by a **25%** improvement in sales conversions.\n"
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, sales, vacuum technology, MS Office, SAP, communication, teamwork, autonomy, structured work",
  "apply_company": "Leybold"
}