{
  "name": "Rei Taro",
  "role_name": "Senior ASIC Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior ASIC Engineer with over 10 years of experience in **digital ASIC verification**, **RTL design**, and **verification principles**. Proficient in **SystemVerilog**, **UVM**, and **Cadence Xcelium**, showcasing a solid foundation in **testbench development**, **simulation**, and **debugging**. Skilled at **constrained random verification** and **formal verification**, enhancing the quality of ASIC designs. Adept at writing effective **test cases** and managing **regression maintenance**. Originally experienced as a Senior Backend Developer specializing in backend systems for financial platforms and AI/ML pipelines. Strong background in high-performing API development using **Python** (FastAPI, Django, Flask), complemented by expertise in cloud platforms such as **AWS** and **Azure**. Known for delivering impactful projects at top-tier organizations including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior ASIC Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Python** for testbench development and efficient simulation, enhancing the verification process for digital ASIC designs.\nExecuted unit and integration tests with **Cadence Xcelium** to validate **RTL design** and **verification principles** with a focus on accuracy and compliance.\nImplemented constrained random verification techniques to significantly improve coverage metrics by **20%** and reduce bug escape rate.\nEngineered debugging processes that streamlined test case writing, leading to a **30%** reduction in regression maintenance time.\nCollaborated on a multi-disciplinary team to integrate simulation and formal verification strategies into existing workflows, ensuring quality across projects.\nFacilitated clear communication with stakeholders to address system integration challenges and oversee the release of new features with precise compliance checks.\nMentored junior engineers on **SystemVerilog** and **UVM** best practices, fostering a culture of continuous improvement in the verification lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Engineered and developed robust **Python** testbenches for **digital ASIC verification** using **SystemVerilog** and **UVM**, ensuring high-quality verification processes that comply with industry standards.\nUtilized **Cadence Xcelium** to perform simulations and debugging on numerous projects, achieving a **95%** success rate in test case execution.\nImplemented constrained random verification techniques to enhance the efficiency of test scenarios, resulting in a **30%** reduction in debugging time.\nCreated and maintained regression tests to guarantee consistent functionality across multiple versions, with over **200 test cases** designed for thorough validation.\nCollaborated closely with cross-functional teams, ensuring effective communication and integration of RTL design elements into the verification process.\nConducted in-depth training on verification principles to junior engineers, improving team capabilities and enhancing project delivery.\nActively participated in formal verification processes, ensuring rigorous adherence to specifications and maximizing product reliability."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **Bash** for writing advanced test cases and scripts to improve digital ASIC verification processes.\nEngineered testbench development frameworks with **SystemVerilog** and **UVM** to validate RTL designs, ensuring robustness against industry standards.\nImplemented digital ASIC simulation strategies with **Cadence Xcelium** for **90%** faster debugging and regression maintenance, enhancing project timelines.\nConducted constrained random verification and formal verification techniques to identify design flaws early, reducing defect rates by **25%**.\nMaintained consistent communication with cross-functional teams to share insights on verification principles and methodology, fostering collaboration.\nDeveloped efficient regression testing workflows to cover **1,000+** test cases, increasing reliability and accuracy across simulations.\n"
    }
  ],
  "skills": "**Programming Languages**\n\tPython, SQL, Bash, Perl, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tdigital ASIC verification, RTL design, verification principles, Cadence Xcelium, testbench development, simulation, debugging, constrained random verification, formal verification, test case writing, regression maintenance, communication",
  "apply_company": "Oxford Nanopore Technologies"
}