{
  "name": "Patryk Zaslawski",
  "role_name": "Quality Assurance Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a seasoned Quality Assurance Engineer with 8+ years of experience in software engineering, I specialize in ensuring high-quality software delivery across diverse platforms such as iOS and Android. Proficient in **C#**, **Java**, and **Unity**, I leverage tools like **AWS Device Farm**, **Kobiton**, and **Unreal Engine Blueprints** to execute effective testing strategies. My expertise also encompasses **CI/CD**, utilizing **Jenkins** and **Azure DevOps** for streamlined testing workflows. With strong skills in debugging and effective communication, I efficiently collaborate with cross-functional teams to enhance product quality and performance. My background includes a focus on automation and thorough testing methodologies that ensure robust software solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Quality Assurance Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and executed comprehensive test strategies for applications built in **C#**, **Java**, and **Unity**, ensuring high-quality deliverables in line with industry standards.\nImplemented and maintained CI/CD pipelines using **Azure DevOps**, **Jenkins**, and **CI/CD** tools for automated testing and continuous integration of applications across both iOS and Android platforms.\nConfigured testing environments in **AWS Device Farm** and **Kobiton** to facilitate cross-device testing, enabling faultless performance and user experience verification on various mobile devices.\nUtilized **Unity Test Runner** for automated unit testing of game components, achieving a test coverage improvement of **30%** in critical game features.\nCollaborated with cross-functional teams to improve development processes and workflows, fostering a culture of collaboration and effective communication to streamline project management.\nExecuted debugging and validation procedures using tools such as **adb** and **Xcode**, achieving rapid identification and resolution of issues in mobile applications.\nConducted manual and automated testing phases for applications developed in **C#** and **Java**, contributing to a **20%** decrease in bug rates post-deployment.\nMentored junior QA engineers on best practices in testing methodologies, contributing to skill enhancement within the team and accelerating project lifecycle times.\nParticipated in weekly sprint meetings and retrospectives to provide feedback on potential improvements in testing frameworks and approaches, ensuring continuous quality enhancement.\nUtilized **Unreal Engine Blueprints** to support the testing of interactive elements in applications, ensuring rich and engaging user experiences are upheld across all platforms.\nAssisted in the development of training materials and documentation for testing processes, helping to cultivate an informed team capable of maintaining high standards in quality assurance.\nEnabled effective communication of testing results and project status to stakeholders, ensuring transparency and alignment across all project phases.\nStreamlined test case management processes by integrating modern tools and frameworks, which improved efficiency by **15%** in test execution timelines."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Focused on ensuring high-quality deliverables by integrating QA practices with software development processes.\nUtilized **CI/CD** tools such as **Azure DevOps** and **Jenkins** to automate testing workflows, improving deployment efficiency by **30%**.\nManaged automated testing frameworks utilizing **Unity Test Runner** to enhance testing processes for C# and **Unreal Engine Blueprints** projects, ensuring bug-free releases.\nDeveloped comprehensive test cases and executed performance testing on mobile applications for Android and iOS environments using **AWS Device Farm** and **Kobiton**, achieving a defect reduction of **25%**.\nCollaborated closely with development teams to perform debugging and resolution of issues in applications built with C# and **Unity**, ensuring that all functionalities meet business requirements.\nImplemented integration tests and ensured seamless compatibility across platforms by utilizing **adb** and **Xcode** for mobile testing, achieving successful test cases in both environments.\nConducted regular communication with cross-functional teams to identify areas for improvement and streamline testing processes, promoting a culture of continuous improvement.\nProvided training and mentorship on QA best practices to junior QA engineers, enhancing team collaboration and productivity.\nDesigned and documented testing processes and procedures, contributing to improved clarity in the quality assurance lifecycle.\nParticipated in regular sprint reviews and retrospectives to address testing challenges and improve overall software quality, reinforcing teamwork and communication across departments."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Conduct thorough debugging and testing of applications developed with **C#**, **Java**, and **Unity**, ensuring high-quality software delivery.\nCollaborate with cross-functional teams to define testing requirements and communicate results effectively using clear documentation and verbal communication skills.\nImplement CI/CD processes using **Jenkins** and **Azure DevOps** to automate testing and deployment workflows, contributing to an accelerated development lifecycle.\nUtilize **AWS Device Farm** and **Kobiton** for comprehensive mobile testing across iOS and Android platforms, ensuring compatibility and performance across different devices.\nExecute testing scripts with **Unity Test Runner** and perform manual testing of game features, uncovering critical bugs and ensuring a seamless user experience.\nEmploy debugging techniques to diagnose and resolve issues within applications, streamlining performance and enhancing overall functionality.\nFacilitate collaboration between developers and QA team members to create a cohesive work environment focused on achieving common goals.\nDesign and conduct load and stress testing to benchmark system performance, leveraging tools like **JMeter** and **k6** to identify bottlenecks under peak traffic loads.\nEnsure high levels of coverage by writing and maintaining test cases that align with unit, integration, and functional testing strategies, contributing to a code quality of **95%** coverage or more.\nFamiliarize with tools and frameworks relevant to **Unreal Engine Blueprints**, debugging performance issues, and optimizing applications for better usability.\nPerform end-to-end testing, validating the entire user journey from installation to real-world scenario usage, ensuring robust and reliable user experiences.\nMonitor and report on testing progress, providing stakeholders with metrics to assess application readiness and overall project timelines."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Java, Python, SQL\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs, Keycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps, CI/CD, Jenkins\n\n **Cloud & Infrastructure:**\n\tAWS Device Farm, Azure (App Services, Blob, SQL), Nginx, Certbot\n\n **Other:**\n\tUnity, Unity Test Runner, iOS, Android, Kobiton, adb, Xcode, Unreal Engine Blueprints, debugging, communication, collaboration"
}