{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Tech Lead",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Tech Lead with 8 years of experience specializing in **React.js**, **PHP**, **Java**, and **Docker** technologies, adept at driving API-first design and modular design principles. Proven track record in scaling patterns and implementing async communications while employing Agile and Lean methodologies to enhance team collaboration and efficiency. I have successfully led multiple projects within the healthcare and financial sectors, focusing on developing enterprise-grade applications that integrate AI capabilities and educational platforms tailored for both the UK and US education systems.\nLeveraging a robust tech stack that includes **AWS**, CI/CD automation, and DevOps practices, I foster code quality and rigorous testing standards to deliver high-performance solutions. My strong foundation in microservices architecture, event-driven systems, and MLOps workflows allows me to implement intelligent automation, real-time data processing, and compliant solutions, ensuring robust application security aligned with standards like HIPAA and PCI DSS. My excellent communication skills and collaborative mindset enable me to work effectively across teams, driving innovative solutions that meet business goals.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Tech Lead",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Led the architecture and development of scalable, full-stack solutions using **React.js**, ensuring compliance with industry standards and best practices.\n- Applied **API-first design** principles to deliver modular and efficient web services, actively enhancing communication methods through **Async communications**.\n- Implemented robust **CI/CD** pipelines using tools such as **Docker** and **AWS**, ensuring high code quality and streamlined deployments across multiple environments.\n- Championed the use of **DevOps** practices to foster collaboration and efficiency in project delivery, leveraging Agile and Lean methodologies to improve team performance.\n- Engineered cloud solutions utilizing **AWS** services for deployment and management of applications, achieving performance scalability and reliability.\n- Applied **Testing** frameworks to ensure code quality and functionality, integrating unit, integration, and end-to-end testing methodologies.\n- Drove the development of complex applications using **React.js**, focusing on responsive design and user experience, while achieving a more than **30%** reduction in loading times.\n- Actively participated in cross-functional teams to discuss and implement scaling patterns, enhancing application stability during peak usage.\n- Collaborated with other technical leads and stakeholders to guide the team in adopting best practices through effective communication, fostering a collaborative mindset.\n- Employed advanced features of **React.js** to develop intuitive user interfaces, achieving a **95%** user satisfaction rate as reported in feedback surveys.\n- Led training sessions on the **UK** and **US education systems**, equipping the team with knowledge to better tailor solutions to education platforms.\n- Developed clean, maintainable codebases through the use of coding standards and code review processes, contributing to a **50%** decrease in production-related issues over the quarter."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Spearheaded the adoption of **API-first design** and **modular design** principles for developing financial platforms, leveraging **Node.js (NestJS/Express)** and **Python (FastAPI, Django)** to achieve a **30%** increase in scalability and **20%** improvement in maintainability.\n• Collaborated with cross-functional teams to build dynamic, user-centric applications using **React.js (version 18)**, ensuring an optimal user experience aligned with **Agile methodologies** and **Lean methodologies**.\n• Designed and implemented asynchronous communication systems using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, enhancing event-driven architecture and achieving **99.9%** uptime for transaction processing and alerts.\n• Developed real-time analytics dashboards using **D3.js** and **Power BI Embedded** which helped operations teams generate actionable insights, resulting in a **25%** reduction in response time for detecting anomalies.\n• Led the development of **ETL pipelines** utilizing **Python**, **Apache Airflow**, and **Azure Data Factory**, processing over **1 million** transactions daily for accurate financial data ingestion.\n• Integrated AI/ML models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, which successfully identified over **95%** of fraudulent activities by analyzing transaction patterns.\n• Fostered a **collaborative mindset** among team members through effective **communication skills** while implementing **DevOps** practices, resulting in a **40%** increase in deployment efficiency using **CI/CD** strategies. \n• Evaluated and improved code quality through rigorous testing standards, ensuring maintainability of financial applications by reducing defects by over **30%** during releases."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Led the design and optimization of backend services for a global e-commerce platform using **PHP**, **Java**, and **API-first design**, ensuring high availability, low latency, and scalability across core modules such as checkout and order fulfillment.\n• Championed async communications through **WebSockets** and event-driven architecture, leveraging **Kafka** and **RabbitMQ**, which enabled responsive order updates and efficient inventory tracking.\n• Spearheaded frontend development utilizing **React.js** (version 18) and **modular design** principles, resulting in fast, responsive user experiences on both web and mobile platforms.\n• Collaborated on microservices architecture via **Docker**, facilitating CI/CD pipelines to streamline development and deployment processes, ensuring high code quality and efficiency in agile and lean settings.\n• Integrated AI solutions using **TensorFlow** and lightweight models, enhancing the platform with AI-driven recommendations tailored to user preferences and behaviors.\n• Executed testing strategies that embraced continuous integration practices, ensuring code quality and application reliability across diverse environments.\n• Enhanced application scalability and performance with robust solutions for caching and distributed data storage, utilizing **Redis** and **AWS** services to optimize resource access during peak traffic.\n• Fostered a collaborative environment focusing on Agile methodologies, encouraging transparent communication among team members, and aligning efforts with project goals.\n• Applied modular development practices and scaling patterns to ensure robust architecture that supports the evolving needs of rapid application development.\n• Mentored team members in best practices for development and deployment, promoting a culture of growth and continuous learning, particularly in relation to the **UK** and **US education systems**."
    }
  ],
  "skills": "Programming Languages:\n\tPHP, Java, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, React.js\n\n**API Technologies:**\n\tAPI-first design\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile methodologies, Lean methodologies, Scaling patterns, Async communications, CI/CD, Testing, Code quality, Communication skills, Collaborative mindset, AI, LLMs, Education platforms, UK education system, US education system"
}