{
  "name": "Tomasz Lee",
  "role_name": "Senior iOS Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Senior iOS Developer with 9+ years of experience in designing and implementing mobile applications. Proficient in **Swift**, **SwiftUI**, **UIKit**, and **Xcode** with a strong understanding of **MVVM** architecture and **RESTful APIs**. Expertise in concurrency techniques and best practices for **UI/UX principles** as per **Apple’s Human Interface Guidelines**. Skilled in unit and UI testing, leveraging tools like **Git** for version control and optimizing CI/CD pipelines with **Github actions**. Recognized for delivering high-quality solutions, improving user experiences, and effectively leading teams to success. Strong problem-solving and communication skills enhance collaboration across development teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Spearheaded the design and development of iOS applications utilizing **Swift** and **SwiftUI**, enhancing user satisfaction metrics by **25%**.\nDesigned and implemented a microservices architecture for mobile backend services employing **RESTful APIs**, ensuring scalability and maintainability.\nManaged **CI/CD pipelines** on **Github Actions**, reducing deployment time by **40%** and increasing release efficiency.\nCollaborated with UI/UX designers to refine application interfaces, adhering to **Apple’s Human Interface Guidelines**, which improved overall user experience.\nDeveloped and maintained robust **Unit testing** and **UI testing** frameworks, achieving a **20%** reduction in post-release bugs.\nLeveraged **Core Data** and **Swift Data** for efficient data management and storage, significantly improving data retrieval times.\nImplemented **Concurrency** techniques to enhance app performance, maintaining smooth user interactions under heavy load scenarios.\nUtilized **Xcode** for effective project management and version control, ensuring seamless integration with **Git** workflows.\nExhibited strong **communication** and **problem-solving** skills throughout all phases of development, fostering teamwork and leadership within cross-functional teams."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and developed robust **RESTful APIs** in adherence to **UI/UX principles** and **Apple’s Human Interface Guidelines**, contributing to a high-quality user experience for iOS applications.\nImplemented and optimized **Swift**, **SwiftUI**, and **UIKit** components in various projects, enhancing app performance and scalability.\nUtilized **Xcode** for project development, seamlessly integrating frameworks to improve application workflow.\nEstablished **CI/CD pipelines** using **GitHub Actions**, which reduced deployment cycles by **30%** and minimized errors in production.\nConducted thorough **unit testing** and **UI testing**, ensuring functionality and user interface integrity in applications, resulting in a **20%** decrease in post-release bugs.\nLed project teams with strong leadership and communication skills, coordinating efforts to meet project milestones and deadlines effectively.\nApplied **MVVM** design patterns to structure code efficiently, facilitating easier maintenance and scalability for future updates.\nManaged concurrency effectively to improve responsiveness and performance of apps, leading to a **15%** increase in user satisfaction ratings.\nMentored junior developers by holding regular knowledge-sharing sessions, fostering a collaborative team environment.\nEngaged in problem-solving exercises to address and mitigate issues promptly, improving overall project outcomes."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed robust and efficient iOS applications using **Swift** and **SwiftUI**, aligning with Apple’s Human Interface Guidelines to enhance user experience.\nImplemented **RESTful APIs** to facilitate smooth data communication between the frontend and backend services, improving system interoperability.\nConducted unit testing and UI testing to ensure high-quality applications, achieving over **90%** code coverage.\nUtilized **Xcode** for application development and debugging, streamlining the development process through effective tool utilization.\nManaged source control and collaboration via **Git** and **Github actions**, ensuring seamless continuous integration and delivery with **CI/CD pipelines**.\nApplied strong **MVVM** design patterns to enhance code organization and maintainability, reducing future development time by **30%**.\nLed technical discussions and provided mentorship to junior developers, enhancing team productivity and fostering a collaborative environment.\nLeveraged **Core Data** and **Swift Data** for effective data management and storage solutions within mobile applications, improving application performance.\nCollaborated closely with UI/UX designers to implement user-friendly interfaces, adhering to **UI/UX principles** and improving user satisfaction ratings by **15%**.\nResearched and applied advanced iOS concurrency techniques to enhance application responsiveness, ensuring smooth user interactions during background processing.\nParticipated actively in Agile methodologies, including daily standups and sprint planning, to align team objectives and deliverables."
    }
  ],
  "skills": "**Programming Languages**\n\tSwift, Python, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, SwiftUI, UIKit\n\n**API Technologies**\n\tRESTful APIs, GraphQL\n\n**Serverless and Cloud Functions**\n\tNone\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Core Data\n\n**DevOps**\n\tAWS, Azure, CI/CD pipelines, Github actions\n\n**Cloud & Infrastructure**\n\tNone\n\n**Other**\n\tUI/UX principles, Apple’s Human Interface Guidelines, UX/UI Design, Git, GitHub, Redux, Communication, Problem-solving, Leadership, Unit testing, UI testing, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest"
}