{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Operations Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Operations Engineer with 13+ years of experience in managing and optimizing server infrastructures and data centers. Proficient in **Linux**, **Networking**, **Troubleshooting**, and **Server Administration**, ensuring seamless operations and high availability. Strong expertise in **Kubernetes** for orchestration and managing containerized applications, with skills in **Scripting** to automate routine tasks.\nExperienced in implementing monitoring solutions with **Grafana** and **Prometheus**, providing real-time insights into system performance and reliability. Demonstrates exceptional documentation skills and thrives in **Team Collaboration** environments to enhance operational efficiency.\nAdditionally, has a solid background as a Full Stack Developer, skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**. Familiar with deploying applications on **AWS** and **Azure**, and implementing microservices architecture.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Operations Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Managed **Linux** servers and performed troubleshooting to ensure optimal performance and reliability of operations.\n• Administered a data center environment, coordinating the physical and virtual resources while ensuring uptime and scalability of systems.\n• Scripted automation processes for routine tasks, enhancing operational efficiency and minimizing human error.\n• Implemented and maintained **Kubernetes** clusters to orchestrate containerized applications, ensuring high availability and secure deployments.\n• Monitored system health and performance using **Prometheus** and **Grafana**, facilitating proactive troubleshooting and incident resolution.\n• Developed comprehensive documentation for system configurations and operational procedures, improving team collaboration and knowledge transfer.\n• Collaborated with cross-functional teams to optimize networking and enhance system integrations, ensuring seamless end-user experiences.\n• Designed and executed troubleshooting protocols to swiftly address and resolve server administration issues across the infrastructure.\n• Led initiatives to analyze and improve data center management strategies, resulting in a **20%** increase in resource utilization.\n• Conducted regular audits and performance assessments, achieving **99.9%** uptime across critical systems.\n• Fostered a culture of continuous improvement and innovation through regular team meetings and collaborative brainstorming sessions."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Linux** to manage and troubleshoot server environments, improving uptime by **15%** through proactive monitoring and maintenance strategies.\nImplemented **Kubernetes** orchestration for containerized applications, enhancing deployment efficiency and overall system scalability across multiple servers by **30%**.\nConducted detailed **networking** analysis and server administration tasks, effectively resolving issues and implementing solutions that reduced incident response times by **25%**.\nUtilized **Grafana** and **Prometheus** for monitoring system performance, enabling operational insight and improving response strategies by providing real-time data visualization.\nCollaborated with cross-functional teams to draft and maintain documentation for processes and systems, ensuring seamless knowledge transfer and onboarding, which increased productivity by **20%**.\nDrove troubleshooting initiatives across data center operations, optimizing performance and resolving **85%** of incidents on first contact.\nExecuted **scripting** tasks for automation of routine server management, reducing manual intervention and streamlining workflows."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Linux** for server administration and management of systems, ensuring robust performance and security for all backend services.\nConducted **troubleshooting** of network issues and server malfunctions, successfully reducing downtime by **30%** across critical operations.\nManaged and optimized data center resources to improve efficiency and reliability, achieving a **15%** reduction in operational costs through strategic resource allocation.\nDeveloped and maintained **Kubernetes** clusters for container orchestration, allowing seamless deployment and scaling of applications and services with a less than **2%** failure rate during updates.\nImplemented **scripting** solutions for automation of routine tasks, resulting in a **40%** improvement in team productivity through reduced manual interventions.\nMonitored system performance and application health using **Grafana** and **Prometheus**, ensuring a high availability rate of **99.9%** for operational metrics.\nProduced comprehensive **documentation** for systems and workflows, facilitating knowledge sharing and onboarding for new team members.\nCollaborated effectively with cross-functional teams to enhance service delivery and address operational challenges, fostering a team-driven culture of success.\nEngaged in managing application security and network integrity, applying best practices to ensure safe operations in high-performance computing (**HPC**) environments."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tLinux\n\tServer Administration\n\tData Center Management\n\tNetworking\n\tTroubleshooting\n\tHPC\n\tGrafana\n\tPrometheus\n\tDocumentation\n\tTeam Collaboration\n\n**Other:**\n\tMLflow, Airflow, Kubeflow\n\tScripting",
  "apply_company": "CoreWeave"
}