{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Field Engineer with 8 years of experience, I excel in problem-solving, IT diagnosis, and ensuring network connectivity in complex environments. My technical expertise in **Electro-engineering** and **Imaging Systems** allows me to deliver precise remote service and preventative maintenance solutions, ensuring operational excellence. I have a proven track record of providing exceptional customer service while strictly adhering to regulatory standards. \nIn addition to my field engineering skills, I possess a full-stack development background, utilizing modern technologies such as **JavaScript**, **TypeScript**, **Python**, and **Flutter**. My experience encompasses building high-performance applications with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have also worked extensively with cloud services like **Azure** and **AWS**, and I am proficient in implementing microservices architecture and CI/CD automation practices. My strengths in developing machine learning pipelines and utilizing tools such as **MLflow**, **Airflow**, and **Kubeflow** enhance my ability to innovate and drive efficient solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Ensured compliance with regulatory standards by applying knowledge of healthcare and financial regulations, including HIPAA, FHIR, GDPR, and PCI DSS, while delivering innovative engineering solutions.\nUtilized advanced problem-solving skills to diagnose IT issues in imaging systems and remote service configurations, achieving a resolution rate of over **90%** on first contact.\nProvided exceptional customer service by maintaining clear communication and timely updates during field operations and ensuring clients received thorough IT diagnosis and solutions tailored to their needs.\nImplemented preventative maintenance strategies for high-tech imaging systems, reducing downtime by **30%** and increasing operational efficiency across healthcare facilities.\nExecuted corrective maintenance protocols on network connectivity issues, resulting in improved system reliability and user satisfaction across serviced locations.\nDesigned and implemented full-stack solutions utilizing **TypeScript**, **Python**, **FastAPI**, and modern front-end frameworks, enhancing project delivery speed by **25%**.\nLeveraged **Docker** and **Kubernetes** for scalable deployment of applications, improving application uptime and performance, and contributing to high availability of healthcare services.\nDeveloped mobile applications with **Flutter** and **React Native**, ensuring high-quality user experiences for both iOS and Android platforms.\nOptimized cloud-native data architectures utilizing **PostgreSQL** and **MongoDB**, supporting efficient data ingestion and querying processes for large-scale health and financial data.\nCollaborated with multi-disciplinary teams to integrate machine learning models for real-time analytics, improving operational efficiencies and decision-making efficiencies for clients."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Troubleshot and diagnosed IT connectivity issues in imaging systems, ensuring maximum uptime for operational efficiency, achieving a **20%** reduction in downtime.\n• Provided high-level customer service and support, maintaining a satisfaction rating above **95%** through effective problem-solving and prompt resolution of technical challenges.\n• Conducted preventative and corrective maintenance on remote service platforms, adhering to regulatory standards and enhancing system reliability by **30%**.\n• Collaborated with cross-functional teams to implement network connectivity solutions, ensuring seamless integration of imaging systems and compliance with industry standards.\n• Leveraged knowledge of electro-engineering principles to optimize imaging systems, enhancing performance and operational capabilities by reducing error rates by **15%**.\n• Developed and conducted training sessions for clients on maintenance best practices, contributing to improved customer service and decreased service call frequency by **25%**.\n• Engaged in continuous improvement initiatives to identify and implement process enhancements in field operations, leading to more efficient workflow and increased customer satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conduct thorough IT diagnosis and problem solving for imaging systems, ensuring compliance with regulatory standards and enhancing overall network connectivity in diverse environments.\nProvide exceptional customer service by delivering effective remote service solutions and troubleshooting for complex electro-engineering issues, achieving a 95% customer satisfaction rate.\nDevelop and implement preventative and corrective maintenance strategies for imaging systems, reducing downtime by **30%** through timely interventions and reliable service delivery.\nUtilize systematic approaches to electro-engineering challenges, successfully improving operational efficiency for imaging systems by applying advanced techniques and tools.\nCollaborate with cross-functional teams to ensure seamless integration of imaging technology solutions, enhancing performance and reliability across **50+** deployed units.\nOptimize technical service processes to manage remotely accessed imaging equipment, streamlining service calls and reducing on-site visits by **20%**.\nEnsure continuous compliance with regulatory standards through regular audits and updates, maintaining a flawless compliance record in **100%** of service evaluations.\nDrive initiatives for training and development in imaging technology, enhancing team capabilities to handle complex issues and improve overall service delivery efficiency.\nAssess field equipment performance and implement customized solutions to enhance service quality, achieving a repair turnaround time reduction from **72 hours to 24 hours** for urgent cases."
    }
  ],
  "skills": "**Other**\n\tElectro-engineering, Imaging Systems, Remote service, IT diagnosis, Network connectivity, Problem solving, Customer service, Regulatory standards, Preventative maintenance, Corrective maintenance\n\n**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tNginx, Keycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**\n\tTerraform, Ansible, Helm, Docker Compose\n",
  "apply_company": "Philips"
}