{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Sales Engineer with 13+ years of experience in high-performance application development, specializing in **Elektrotechnik** and **Notbeleuchtungssysteme**. Leveraging strong **Kundenorientierung** and **technische Pr채sentation** skills, I effectively communicate complex technical concepts in both **Deutsch** and **Englisch** to diverse clients. Proven ability to manage projects with focus on client needs, demonstrating high levels of **Eigeninitiative** and **analytisches Denken**. My technical background as a Full Stack Developer has equipped me with a robust understanding of systems architecture, enabling me to bridge the gap between engineering and client solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and delivered technical presentations to clients, showcasing **Notbeleuchtungssysteme** solutions and demonstrating a deep understanding of the **Elektrotechnik** field.\nExecuted detailed project bidding and **Ausschreibung** processes, effectively aligning customer needs with engineered solutions, thereby enhancing **Kundenorientierung**.\nExercised strong **Eigeninitiative** in identifying opportunities for improvements in customer engagements and project delivery methods, resulting in a **25%** increase in client satisfaction ratings.\nUtilized advanced **analytisches Denken** to troubleshoot complex engineering challenges, yielding efficient and innovative solutions, effectively reducing project turnaround time by **30%**.\nDeveloped and maintained strong customer relationships through exceptional communication in **Deutsch** and **Englisch**, ensuring clarity and understanding throughout the project lifecycle.\nCollaborated with cross-functional teams to bridge technical requirements and client expectations, positively impacting project success and delivery.\nLed the engineering design process effectively, adhering to strict timelines and quality standards, which resulted in successful project completion rates of **95%** on schedule.\nHandled customer queries and provided post-sale technical support, ensuring comprehensive understanding and satisfaction with **Notbeleuchtungssysteme** products.\nMonitored industry trends and technical advancements in **Elektrotechnik**, integrating relevant innovations into client pitches and project proposals."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Demonstrated **Kundenorientierung** by developing tailored financial solutions that meet client needs through effective communication and collaboration.\nUtilized **Ausschreibung** skills to prepare and present technical documentation and proposals for financial systems, significantly enhancing the proposal acceptance rate by **20%**.\nLeveraged **Analytisches Denken** to assess client requirements and translate them into actionable technical plans, driving project success and customer satisfaction.\nExhibited **Eigeninitiative** by proactively identifying areas for improvement in products and services, resulting in a **15%** reduction in response time to client inquiries.\nConducted **Technische Pr채sentation** sessions for stakeholders, simplifying complex architectural concepts and showcasing the capabilities of new technologies leveraged in projects.\nApplied knowledge of **Elektrotechnik** principles to provide insights into system integration, particularly in financial technology solutions.\nEffectively communicated in both **Deutsch** and **Englisch** to cater to diverse client demographics and project teams, ensuring clarity and understanding across all communications.\nEnhanced project delivery by working with a multidisciplinary team and ensuring all technical requirements were met within specified timelines and budgets, completing projects at **95%** on-time delivery rate."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Provided technical presentations on **Notbeleuchtungssysteme** solutions to clients, showcasing product features and benefits in both **Deutsch** and **Englisch**.\nEngaged in comprehensive customer interactions to ensure alignment of products with their needs, leveraging strong **Kundenorientierung** skills to build lasting relationships and boost sales.\nDemonstrated **Eigeninitiative** by leading the development of tailored solutions in response to customer requirements, enhancing overall customer satisfaction and contributing to repeat business.\nConducted thorough market analyses and technical assessments as part of the **Ausschreibung** process, ensuring competitive and compelling proposals.\nPlayed a vital role as a **Projektingenieur**, managing project timelines and deliverables to ensure that all technical solutions adhered to quality standards, optimizing project outcomes.\nUtilized **analytisches Denken** to solve complex technical issues, facilitating quick resolutions for client problems and fostering trust in technical capabilities.\nCollaborated with cross-functional teams to enhance overall service delivery, utilizing **technische Pr채sentation** skills to clearly communicate technical concepts.\nAchieved a 30% increase in customer engagement through proactive outreach and follow-ups, leveraging strong interpersonal communication skills.\nDeveloped and implemented 5 new service strategies that increased client conversion rates by 25% within the first quarter of execution."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3\n\tAzure: Blob Storage, SQL Database\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tElektrotechnik, Notbeleuchtungssysteme, Ausschreibung, Projektingenieur, Kundenorientierung, Technische Pr채sentation, Eigeninitiative, Analytisches Denken, Deutsch, Englisch",
  "apply_company": "Eaton"
}