{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Technical Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Technical Engineer with over 13 years of experience in Mechanical Engineering and Pressure Vessel Design. Proven track record in Project Management and conducting Production Audits, ensuring compliance with industry standards and regulations. Skilled in Technical Reporting and creating precise Engineering Drawings, with exceptional Analytical Skills to identify and implement effective Root Cause Analysis. Strong negotiation and communication skills, fostering collaboration across teams while maintaining confidentiality.\nAdditionally, I possess a background in technology and engineering processes. I am adept at delivering high-performance applications using **JavaScript/TypeScript**, **Python**, and **Flutter**. I have hands-on expertise in deploying cloud-native systems on **AWS** and **Azure**, while also implementing **microservices**, event-driven architectures, and **CI/CD pipelines**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Technical Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted detailed **Pressure Vessel Design** analyses to meet safety and performance standards, leading to a **20% reduction** in production-related incidents.\n- Executed rigorous **Production Audits** to evaluate system efficiency and compliance with industry regulations, resulting in a **15% improvement** in operational performance.\n- Leveraged **Analytical Skills** to identify and resolve engineering challenges through effective **Root Cause Analysis**, enhancing product reliability and safety.\n- Managed multiple engineering projects using **Project Management** methodologies, ensuring adherence to timelines and budgets, with **95% on-time delivery** rate across projects.\n- Developed precise **Technical Reporting** structures for detailed documentation of design processes and production output, facilitating transparency and continuous improvement.\n- Collaborated with cross-functional teams to create and review **Engineering Drawings**, leading to clear communication of technical specifications and designs.\n- Engaged in **Technical Sales** activities to promote engineering solutions, effectively integrating **Negotiation Skills** to close deals, achieving a sales growth of **30%**.\n- Maintained strict **Confidentiality** regarding sensitive project information and proprietary technologies throughout all stages of the engineering lifecycle.\n- Improved interdepartmental **Communication Skills** to ensure seamless collaboration and project alignment, enhancing team efficiency and morale.\n- Utilized advanced software tools for design simulations, enhancing the **Mechanical Engineering** process and ensuring high-quality output."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized strong **analytical skills** to conduct production audits and ensure compliance with pressure vessel design standards, enhancing safety and operational efficiency.\nApplied **project management** techniques to oversee technical sales processes and maintain project timelines, resulting in a **15%** increase in client satisfaction ratings.\nPerformed **root cause analysis** to diagnose and resolve technical issues swiftly, achieving a **30%** reduction in production errors and improving overall product quality.\nCreated detailed **engineering drawings** and technical reports to communicate design specifications, enabling clear understanding among cross-functional teams and stakeholders.\nLeveraged **communication skills** to negotiate technical contracts and service agreements, fostering strong relationships with clients and vendors in the manufacturing sector.\nMaintained **confidentiality** of sensitive project data and client information, adhering strictly to company policies and industry regulations.\nDemonstrated proficiency in presenting technical concepts through effective reporting and documentation, aligning engineering objectives with business goals."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and managed engineering designs for pressure vessels, ensuring compliance with industry standards and regulations, utilizing **AutoCAD** and **SolidWorks** to enhance precision in engineering drawings.\n- Executed production audits across various manufacturing processes to identify bottlenecks, achieving a **20%** increase in efficiency through effective root cause analysis and timely adjustments.\n- Conducted technical sales presentations to stakeholders, employing strong negotiation skills to secure contracts that resulted in a **15%** revenue increase over the fiscal year.\n- Led project management efforts on mechanical engineering projects, coordinating a cross-functional team of **5** engineers to ensure on-time project delivery within budget constraints.\n- Created detailed technical reports and documentation, enhancing communication with clients and ensuring clarity in project specifications and milestones for **10+** ongoing projects.\n- Applied analytical skills to assess and troubleshoot mechanical systems, leading to improvements that reduced operational downtime by **30%** through effective root cause analysis.\n- Fostered strong communication channels with clients and team members, maintaining confidentiality and trust in all engineering processes and project developments.\n- Developed comprehensive project timelines and delivered status updates, aligning team objectives with client expectations and project goals, resulting in **95%** client satisfaction in feedback surveys.\n"
    }
  ],
  "skills": "**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tMechanical Engineering, Pressure Vessel Design, Production Audits, Technical Sales, Root Cause Analysis, Project Management, Technical Reporting, Engineering Drawings, Analytical Skills, Negotiation Skills, Communication Skills, Confidentiality",
  "apply_company": "EXSIF OFFSHORE"
}