{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior PHP Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior PHP Engineer with 10+ years of experience in developing efficient, high-performance systems utilizing **PHP**, **Laravel**, and **MySQL** for database management. Proficient in building robust **RESTful APIs** and implementing **JavaScript**, **HTML5**, and **CSS3** to create seamless user experiences. Demonstrated expertise in **Git** for version control and **Agile** methodologies to enhance collaboration and productivity across teams. Adept at leveraging **CI/CD** practices for efficient deployment and strong advocate for **clean code** principles and performance optimization. \nSkilled in problem-solving and effective communication to ensure project milestones are met while fostering teamwork within development teams. With hands-on experience across the full stack, I bring a strong background in integrating modern technologies and practices to drive impactful solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable full-stack solutions using **PHP**, **Laravel**, and **MySQL**, ensuring adherence to clean code principles and performance optimization for web applications.\n• Developed robust **RESTful APIs** to facilitate seamless communication between front-end and back-end systems, enhancing overall system efficiency and response times.\n• Spearheaded Agile project management methodologies, improving team communication and collaboration, resulting in a **30%** increase in project delivery speed.\n• Optimized existing codebases for better performance and maintainability, utilizing **Git** for version control and collaboration across teams.\n• Actively participated in CI/CD processes, implementing automated testing and deployment pipelines to reduce manual errors by **40%** and streamline production releases.\n• Delivered compelling user interfaces with **HTML5**, **CSS3**, and **JavaScript**, focusing on responsive design and user experience, achieving a **20%** increase in user engagement metrics.\n• Collaborated closely with cross-functional teams to solve complex problems, showcasing strong problem-solving skills and effective communication to ensure project alignment.\n• Conducted regular code reviews to promote clean code practices amongst team members, fostering a culture of continuous improvement and knowledge sharing.\n• Led workshops to enhance team skills in **PHP** development, **Laravel**, and Agile methodologies, which resulted in a more proficient development team and enhanced project outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **PHP**, **Laravel**, and **MySQL** to develop and maintain scalable, high-performance web applications, enhancing overall performance and user experience for financial platforms.\nEmployed RESTful API design principles to create and integrate various services, ensuring seamless communication and data exchange between multiple systems.\nImplemented best practices in **clean code** and **performance optimization**, reducing page load times by up to **30%** and improving overall system throughput for high-volume transactions.\nCollaborated in an **Agile** environment, participating in sprint planning, daily stand-ups, and retrospectives to ensure timely delivery of features while fostering effective **communication** and **teamwork**.\nLeveraged **JavaScript**, **HTML5**, and **CSS3** skills to build interactive user interfaces, contributing to improved user satisfaction ratings by **25%** based on user feedback.\nLed the adoption of **Git** for version control, promoting collaborative development and maintaining code quality within the team.\nApplied **CI/CD** practices to streamline deployment processes, achieving a **50%** reduction in time taken for releases, thereby accelerating the delivery pipeline.\nProactively identified and resolved complex issues using advanced **problem-solving** techniques, minimizing downtime and enhancing system reliability."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and maintained robust **RESTful API** services using **PHP (Laravel)** and **MySQL**, ensuring consistent performance and data integrity while handling **100,000+** transactions daily.\nImplemented **Agile** methodologies to enhance collaboration and communication within cross-functional teams, resulting in a **25%** increase in project delivery speed.\nDesigned and optimized frontend applications using **JavaScript, HTML5,** and **CSS3** to create intuitive user interfaces, contributing to an increase in user engagement by **30%**.\nEnsured clean code principles and best practices throughout the development lifecycle, fostering a maintainable and scalable codebase while achieving a **40%** reduction in bug reports.\nUtilized **Git** for version control, enabling effective collaboration and efficient release management across multiple development branches.\nEmployed CI/CD practices to streamline deployment processes, reducing the time to production for key features by **50%**, enhancing overall productivity.\nConducted performance optimization efforts leading to a **60%** improvement in page load times and overall system responsiveness.\nEffectively communicated technical concepts to non-technical stakeholders, promoting understanding and alignment of project objectives, which improved inter-department cooperation.\nCollaborated with team members to solve complex problems, driving innovative solutions that enhanced system capabilities and user experience."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, PHP, JavaScript, TypeScript, HTML5, CSS3\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django, Laravel\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tRESTful API\n\n **Serverless and Cloud Functions:** \n\tAWS (Lambda), Azure (App Services)\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n **Cloud & Infrastructure:** \n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Git, Agile, CI/CD, clean code, performance optimization, problem-solving, communication, teamwork, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Docker Compose",
  "apply_company": "Wecity"
}