{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Backend Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a skilled Backend Developer with 8 years of experience, I excel in building scalable solutions using **PHP**, APIs, and various **databases**. My technical expertise includes **Docker** for containerization, ensuring clean code principles, and managing **messaging brokers** for efficient data handling. I have a strong track record in end-to-end development, particularly within the healthcare and financial sectors, where I have led projects utilizing **JavaScript/TypeScript**, **Python**, and **Flutter** technologies.\n\nIn addition to my core backend skills, I possess hands-on experience with modern frameworks such as **React**, **Vue**, **Node.js**, **FastAPI**, and **Django**, which I leverage for developing high-performance applications. My familiarity with cloud services like **Azure** and **AWS** enables me to implement robust solutions that meet compliance standards, including HIPAA and PCI DSS. I am also adept in collaborative environments and possess strong communication skills that facilitate teamwork and project success.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained **scalable solutions** utilizing **PHP** and **APIs** to ensure seamless data integration between front-end interfaces and backend services, leading to improved application performance metrics by **25%**.\n• Designed and optimized database structures using popular **databases** ensuring high availability and efficient data management, resulting in a **30%** reduction in query response time.\n• Implemented **messaging brokers** solutions to enhance microservices communication, which improved system reliability and fault tolerance, achieving an uptime of **99.9%**.\n• Utilized **Docker** for containerization of applications, streamlining deployment processes, and reducing deployment time by **50%**.\n• Advocated for and implemented **clean code** principles throughout the development process to enhance maintainability and readability of codebases.\n• Collaborated closely with cross-functional teams to define project requirements and timelines, utilizing effective **communication skills** to ensure alignment and timely project delivery.\n• Led the full-cycle **end-to-end development** of impactful features, resulting in user satisfaction ratings increasing by **40%** post-release.\n• Conducted code reviews and shared best practices in software development, significantly improving team coding standards and fostering a culture of continuous improvement.\n• Worked in collaboration with product teams to troubleshoot and resolve application issues, enhancing response times for critical bugs to within **24 hours**.\n• Contributed to the creation of comprehensive documentation for APIs and code, reducing onboarding time for new team members by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed scalable solutions for backend systems by leveraging **PHP** for robust application development and ensuring clean code practices throughout the development lifecycle.\nCreated and integrated APIs to facilitate seamless data communication between services, enhancing system interoperability and user experience.\nUtilized databases effectively, implementing optimized queries and indexing strategies to improve performance by **30%** in data retrieval operations.\nEmployed **Docker** for containerization of applications, ensuring consistent deployment environments and reducing complications during deployments by **50%**.\nImplemented messaging brokers, specifically **RabbitMQ** and **Kafka**, to enable asynchronous communication and improve system responsiveness for financial transaction processing.\nCollaborated with cross-functional teams to define and refine project requirements, leading to a **20%** decrease in project turnaround time through improved communication skills and teamwork.\nEngaged in end-to-end development, from requirement analysis to system deployment, ensuring that all components of the application are integrated and functional.\nOptimized the application architecture for high-volume transaction handling, achieving a throughput increase of **40%** during peak operational hours."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed scalable solutions using **PHP** and designed robust **APIs** to support backend functionalities, ensuring seamless integration and high performance across e-commerce operations.\n• Utilized messaging brokers like **Kafka** and **RabbitMQ** to engineer event-driven architecture, allowing for efficient communication between services and enhancing real-time features.\n• Collaborated closely with frontend teams, applying effective communication skills to facilitate end-to-end development processes and ensure consistent delivery of application features.\n• Optimized **databases** including **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** to support high-traffic operations, achieving a **99.9%** uptime in database performance and reduced latency.\n• Employed **Docker** for containerization, streamlining deployment processes, and ensuring smooth transitions across development, staging, and production environments.\n• Maintained clean code practices, fostering a maintainable codebase that enhances collaboration and reduces bugs by **30%**.\n• Led the implementation of real-time features and messaging strategies, improving response times and customer interactions by **40%**.\n• Engaged in strategic planning and feature development sessions, enhancing collaboration and ensuring alignment with project goals and timelines.\n• Advocated for quality assurance practices throughout the development cycle to ensure scalability and maintainability of solutions delivered."
    }
  ],
  "skills": "Programming Languages:\n\tPHP, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMessaging brokers, Clean code, End-to-end development, Scalable solutions, Collaboration, Communication skills, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}