{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior iOS Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior iOS Engineer with 13+ years of experience specializing in delivering high-performance applications in compliance-driven environments. Proficient in **iOS development**, adept in **MVVM**, **VIPER** architectures, and skilled in **RESTful** and **SOAP** APIs. Experienced in managing data interchange formats such as **JSON** and **XML**, and implementing security protocols like **OAuth** and **JWT**. \nStrong communication and problem-solving skills, with a proven track record of collaborating effectively across teams. Prior expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on capabilities in building and integrating sophisticated tech stacks using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Knowledgeable in deploying cloud-native systems on **AWS** and **Azure**, and experienced in implementing microservices and CI/CD pipelines.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented robust iOS applications using **Xcode** and Swift, adhering to the **MVVM** and **VIPER** architectural patterns to enhance maintainability and scalability.\n\nDesigned and developed interactive and user-friendly RESTful APIs with **JSON** and **XML** data formats to facilitate seamless communication between frontend and backend systems.\n\nUtilized secure authentication methods including **OAuth** and **JWT** to protect sensitive user information and ensure a secure environment within the applications.\n\nCollaborated closely with cross-functional teams, demonstrating excellent communication and problem-solving skills to gather requirements and deliver features efficiently.\n\nLed the enhancement of application performance, resolving issues, and improving user experience with careful analysis and testing methodologies.\n\nParticipated in defining testing strategies and performing unit testing, integration testing, and E2E testing using **Cypress** and **Postman** to ensure reliability and quality.\n\nEngaged in regular code reviews and mentoring junior developers, promoting best practices and adherence to OOP principles to strengthen team capabilities.\n\nAdapted and executed Agile methodologies in project management to facilitate quick development cycles and efficient team collaboration, leading to the successful delivery of over **30** projects within strict deadlines.\n\nIntegrated third-party libraries and frameworks to enhance application functionality, focusing on maintaining a modular approach for future scalability and improvements.\n\nUtilized analytics tools to gather user feedback and track application's performance, employing insights for continuous improvement and adaptation of app features."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Implemented **RESTful** and **SOAP** services to ensure seamless communication between iOS applications and backend systems.\n- Developed a robust architecture for iOS applications utilizing **MVVM** and **VIPER** design patterns, enhancing maintainability and scalability of the codebase.\n- Produced clear and efficient **JSON** and **XML** data structures for client-server interactions, ensuring optimal data handling and processing.\n- Ensured secure authentication and authorization processes by integrating **OAuth** and **JWT** protocols within mobile applications.\n- Leveraged **xCode** to develop and maintain applications, continuously refining code for performance improvements and bug fixes, achieving a crash-free user experience of **99.9%**.\n- Engaged in collaborative problem-solving and effective communication across cross-functional teams to identify and resolve issues swiftly, contributing to a **25%** reduction in development timelines.\n- Applied **Object-Oriented Analysis (OOA)** and Object-Oriented Programming (OOP) principles in designing reliable and reusable components for iOS applications.\n- Participated in code reviews, mentor junior developers, and foster a transparent communication culture, thus increasing team productivity by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented RESTful APIs and integrated secure authentication methodologies, including **OAuth** and **JWT**, ensuring user data protection and robust security protocols for the iOS application.\nDesigned and developed iOS applications utilizing **Swift** and **xCode**, embodying the **MVVM** and **VIPER** architectures for clean, maintainable code and efficient app navigation.\nCollaborated effectively within cross-functional teams to enhance product features, showcasing excellent **communication** skills and providing solutions to complex issues through strong **problem-solving** capabilities.\nEnsured seamless data interchange by working with **JSON** and **XML** formats, facilitating interaction between the iOS application and external APIs.\nOptimized application performance through rigorous testing and profiling, leading to a **30%** improvement in load times and a **20%** reduction in crash reports post-release.\nContributed to the development of user-friendly UI components following Apple's design guidelines, improving overall user experience and accessibility.\nConducted thorough code reviews and mentor junior developers, fostering a culture of continuous improvement and knowledge sharing within the team.\nManaged the deployment process and adhered to version control practices using Git, ensuring that code changes were tracked and deployed efficiently."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\tObjective-C, Swift\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful, SOAP, JSON, XML, OAuth, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tKeycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot\n\tCommunication, Problem-Solving, OOA, OOP, MVVM, VIPER, iOS, xCode",
  "apply_company": "Atos"
}