{
  "name": "Tomasz Lee",
  "role_name": "Solution Architect",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Solution Architect with 9+ years of experience in transforming business requirements into innovative technical solutions. Proficient in AI/ML technologies, including **Python**, **PyTorch**, and **CUDA**, with expertise in large-scale data processing and bioinformatics tools development. Experienced with accelerated computing frameworks such as **RAPIDS** and **Parabricks**, and adept at utilizing **Nextflow** and **WDL** for workflow management. Strong background in computational biology and genomics, with a proven track record of delivering customer-facing communication and leading cross-functional teams. Additionally, a skilled **.NET Full Stack Developer** proficient in **ReactJS**, **NextJS**, **.NET**, **C#**, and cloud services. Committed to enhancing performance and optimizing development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Solution Architect",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Python** and **PyTorch** to design and implement AI/ML models that enhance data processing capabilities within bioinformatics applications.\nArchitected solutions employing **Nextflow** and **WDL** to streamline genomic workflows, increasing processing efficiency by **30%**.\nUtilized **CUDA** for accelerated computing processes, significantly improving the computational performance for various genomic analyses.\nDeveloped and deployed frameworks for Large Scale Data Processing, achieving a data throughput increase of **50%**.\nCreated bioinformatics tools utilizing **RAPIDS** and **Parabricks** to handle large datasets, improving analysis times by **40%**.\nConducted rigorous Data Analysis to derive actionable insights from complex genomic data, leading to improved decision-making.\nFacilitated customer-facing communication to better align solution architectures with client needs, enhancing user satisfaction ratings.\nImplemented advanced Deep-Learning Foundation Models for predictive analytics in computational biology applications.\nCollaborated with cross-functional teams to integrate innovative machine learning solutions into existing frameworks, fostering continuous improvement and adaptability.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **Python** and **PyTorch** to design AI/ML algorithms for bioinformatics tools development, facilitating a 20% increase in data analysis accuracy for genomics projects.\nUtilized **Nextflow** and **WDL** workflows for the accelerated processing of large-scale genomic datasets, reducing processing time by 40%.\nImplemented **CUDA** for enhanced computational performance in deep-learning foundation models, improving model training efficiency by 30%.\nDeveloped and optimized data pipelines utilizing **RAPIDS** and **scverse** for rapid data processing and integration with bioinformatics tools.\nFacilitated customer-facing communication to gather requirements for solutions in computational biology, ensuring alignment with stakeholder expectations and enhancing project delivery timelines by 25%.\nConducted deep dive sessions on **Deep-Learning** advancements for team knowledge building, boosting team capabilities and collaboration.\nMentored junior developers in bioinformatics and data processing techniques, fostering a culture of learning and improving team productivity by 15%.\nAnalyzed complex genomic data sets using advanced data analysis techniques, driving insights crucial for project development.\nCollaborated with cross-functional teams to align on project goals and deliverables, enhancing team synergy and project success rates.\nContinuously refined software solutions and tools by integrating feedback loops into the development lifecycle, achieving higher customer satisfaction rates."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **PyTorch** to develop innovative AI/ML solutions that improve genomics data analysis efficiency by **30%**.\nDesigned and deployed scalable architectures for **Large Scale Data Processing**, ensuring robustness in **Nextflow** and **WDL** workflows.\nImplemented **GPU acceleration** technologies like **CUDA** and **RAPIDS** to enhance computational capabilities, decreasing processing times by **40%**.\nDeveloped bioinformatics tools and frameworks to facilitate the integration of **Deep-Learning Foundation Models** into genomic research workflows, contributing to breakthrough discoveries.\nCollaborated with cross-functional teams to deliver effective **Customer-Facing Communication**, enhancing stakeholder engagement and feedback loops.\nProduced comprehensive technical documentation and user guides to foster knowledge sharing across internal teams, increasing team efficiency by **25%**.\nEngaged in code reviews and architecture discussions to align project goals with best practices and industry standards.\nSupported the implementation of advanced data analysis techniques to derive actionable insights from complex genomic datasets.\nFacilitated training sessions for team members on the use of **scverse** and other cutting-edge bioinformatics libraries, ensuring team competency in current technologies."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\tAWS, Azure\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tCI/CD pipelines\n\n **Cloud & Infrastructure**\n\tLarge Scale Data Processing\n\n **Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, AI/ML, Accelerated Computing, Genomics, Computational Biology, PyTorch, Nextflow, WDL, RAPIDS, Parabricks, scverse, CUDA, Bioinformatics Tools Development, Deep-Learning Foundation Models, Data Analysis, Customer-Facing Communication"
}