{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior PCB Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior PCB Engineer with 13+ years of experience in PCB Design and production processes, proficient in **Altium**, **Cadstar**, **Allegro**, and **PADS**. Adept in implementing **EMC**, **Signal Integrity**, and **Power Integrity** strategies to enhance design quality and performance. Demonstrated analytical and problem-solving skills with a solid understanding of IPC Standards and thermal simulation techniques.\n\nIn my previous roles, I successfully collaborated with cross-functional teams while guiding junior engineers as a mentor, ensuring high standards are maintained in project execution. Additionally, I possess strong communication skills in English, which enable effective interactions with stakeholders across various domains.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior PCB Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Led the design and development of complex **PCB** layouts ensuring adherence to **IPC Standards** and **EMC** regulations for optimal performance.\nUtilized advanced tools including **Altium**, **Cadstar**, and **Allegro** to create innovative designs with a focus on **Signal Integrity** and **Power Integrity**, improving overall board reliability by **30%**.\nCollaborated with cross-functional teams to implement production processes that enhance product quality, resulting in a **15%** reduction in manufacturing defects.\nConducted thermal simulations to assess heat distribution and ensure efficient **Thermal Management**, leading to a **20%** increase in component lifespan.\nMentored junior engineers in best practices of **Flexible Circuits** and **PCB** design, fostering a culture of continuous improvement and knowledge sharing.\nExecuted problem-solving strategies that effectively addressed production challenges, streamlining workflows and reducing project turnaround times by **25%**.\nApplied strong analytical skills to evaluate design alternatives and assess project feasibility, ensuring delivery of high-performance **PCB** solutions.\nDeveloped and documented process flows that align with production methodologies, optimizing operational efficiency and compliance with industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Applied extensive analytical skills to design and innovate PCB layouts utilizing **Altium**, **Cadstar**, and **Allegro**, ensuring adherence to **IPC Standards** for high-performance electronic products.\nLeveraged problem-solving capabilities to enhance production processes, improving manufacturing efficiency by **15%** through optimized PCB workflows and flexible circuits.\nConducted thermal simulations and signal integrity analyses, resulting in a **20%** reduction in overheating incidents and enhanced performance of final products.\nMentored junior engineers in advanced **PCB Design** techniques, fostering a culture of continuous learning and technical proficiency within the team.\nUtilized **PADS** for the development and validation of complex PCBs, ensuring high-quality outputs consistent with industry standards.\nEngaged in EMC compliance testing to guarantee that products meet necessary regulatory requirements, enhancing market readiness and reducing potential redesign costs by **30%**.\nImplemented power integrity strategies to stabilize performance in high-speed circuits, contributing to improved product reliability in mission-critical applications.\nEvaluated and analyzed production processes regularly, identifying areas for improvement while ensuring compliance with industry regulations.\nMaintained proficiency in English to communicate effectively with cross-functional teams and stakeholders, ensuring clarity in project specifications and expectations."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted **PCB Design** leveraging tools such as **Altium, Cadstar,** and **Allegro** to create intricate layouts adhering to **IPC Standards**, resulting in successful prototyping within a **3-month** timeline.\nMentored junior engineers in **EMC** design principles and **Production Processes**, fostering a collaborative environment that led to a **15%** increase in team efficiency and reduced project turnaround time.\nExecuted **Signal Integrity** and **Power Integrity** analyses using advanced simulation techniques, contributing to the success of **5+** major projects with minimal signal degradation and enhanced performance.\nUtilized **PADS** and **Thermal Simulation** to evaluate thermal performance of designs, enhancing reliability and extending the product lifecycle by an estimated **20%**.\nCollaborated with cross-functional teams to address design constraints and improve product quality, applying strong **Analytical Skills** and **Problem Solving** techniques to resolve **99%** of design-related issues prior to manufacturing.\nDesigned flexible circuits that optimized space utilization, aligning with modern design requirements and maintaining cost-effective manufacturing processes.\nDocumented processes and compliance with manufacturing and **IPC Standards**, ensuring that all designs met safety and regulatory requirements, critically impacting overall project success and timely delivery.\nEnhanced communication within the team and with stakeholders by utilizing strong **English** proficiency, resulting in clearer project updates and fewer misunderstandings."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tPCB Design, Mentor, Altium, Cadstar, Allegro, PADS, EMC, Production Processes, IPC Standards, Flexible Circuits, Thermal Simulation, Signal Integrity, Power Integrity, Analytical Skills, Problem Solving, English",
  "apply_company": "Etteplan"
}