{
  "name": "Rei Taro",
  "role_name": "Solutions Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Solutions Engineer with over 10 years of expertise in Sales Engineering and SaaS solutions. Proficient in cloud platforms including **AWS**, **GCP**, and **Azure**, and experienced with third-party tools such as **Okta**, **Google Workspace**, and **Entra ID**. Strong background in API integration and creating technical documentation to support project deliverables. Known for analytical thinking, impactful communication, and a collaborative approach to problem solving. Proven success in leveraging state-of-the-art technologies like **Python** (FastAPI, Django, Flask) and cloud-native architectures to design and deliver scalable and high-performing solutions. Passionate about continuous learning and contributing to high-impact projects, including tenure at top organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Solutions Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Azure** and **AWS** for deploying and managing scalable SaaS solutions, ensuring high availability and performance across environments.\nEngineered robust API integrations that enhanced system interoperability, utilizing **FastAPI** and **Celery** for efficient service communication and event handling.\nDeveloped technical documentation reflecting architectural decisions and operational procedures for seamless onboarding and user understanding.\nImplemented secure authentication systems using **OAuth2** and **Okta**, guaranteeing compliance with industry standards and enhancing user security.\nManaged source code effectively across platforms such as **GitHub**, **BitBucket**, and **GitLab**, promoting version control best practices in a collaborative environment.\nApplied analytical thinking to identify impactful solutions to technical challenges, contributing to continuous improvement initiatives and operational efficiencies.\nFacilitated cross-functional collaboration, leading to the successful rollout of **9** critical system integrations within **2 months**, enhancing the overall functionality of solutions presented to clients.\nExecuted problem-solving strategies to meet client requirements, resulting in an **85%** increase in customer satisfaction scores after implementing feedback-based improvements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Azure** and **AWS** to deploy scalable SaaS solutions while optimizing performance and maintaining regulatory compliance.\nEmployed **API Integration** strategies to enhance system interoperability and improve user experiences, effectively reducing onboarding time by **30%**.\nConducted thorough technical documentation practices to streamline communication and ensure project transparency across cross-functional teams.\nDemonstrated exceptional problem-solving and analytical thinking skills when troubleshooting issues, leading to a **50%** reduction in incident response times.\nCollaborated within teams utilizing **GitHub**, **BitBucket**, and **GitLab** for version control and code management, ensuring smooth collaboration and project tracking.\nImplemented **Okta** and **Entra ID** for authentication solutions, enhancing security and access controls across various **Azure** cloud applications.\nEngaged in continuous learning to stay updated with the latest **GCP** and **Azure** technologies, driving innovative solutions and improvements to existing workflows."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Conducted **API Integration** for backend services related to trade execution, portfolio management, and account tracking using **Python**, **Flask**, and **PostgreSQL**, enhancing trading operations for over **5000** active users.\nUtilized exceptional **Problem Solving** skills to engineer real-time price feed processors leveraging **asyncio**, **WebSockets**, and **Redis** to deliver trading data instantly, catering to high-frequency transactions with a latency reduction of **30%**.\nFacilitated collaboration with frontend teams through impactful communication, delivering data via **REST APIs** and **WebSocket channels**, ensuring seamless integration and user experience.\nMaintained compliance with regulatory standards such as **MiFID II** and **GDPR**, safeguarding data security protocols for application handling more than **10TB** of sensitive information.\nDeveloped comprehensive test suites employing **PyTest**, **tox**, and mock servers to enhance QA and CI processes, achieving a **40%** reduction in development cycle time.\nImplemented job queuing and scheduling solutions using **Celery** and **RabbitMQ**, optimizing the backend task execution efficiency and managing processes for over **1000** simultaneous transactions."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **API Technologies**\n\tREST/gRPC APIs, API Integration\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, GCP\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, Git, BitBucket, GitLab\n\n **Cloud & Infrastructure**\n\tAWS, Azure, GCP, Okta, Google Workspace, Entra ID\n\n **Other**\n\tSales Engineering, SaaS, Technical Documentation, Problem Solving, Analytical Thinking, Impactful Communication, Collaboration, Continuous Learning, Microservices, Kafka, CI/CD, PyTest"
}