{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Ruby Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Ruby Engineer with 8 years of experience, I bring a deep expertise in **Ruby**, **Ruby on Rails**, **SQL**, and **PostgreSQL**, along with a strong foundation in **Docker**, **Terraform**, and **Kubernetes** for containerization and orchestration. My proficiency in building robust APIs and applying Test-Driven Development practices ensures the delivery of high-quality software aligned with best practices in **cybersecurity**. I have successfully led projects focusing on the integration of open-source technologies and have implemented CI/CD workflows using tools like **Capistrano**. \nIn addition to my core Ruby expertise, I possess a diverse tech stack encompassing **JavaScript**, **TypeScript**, **Python**, and **Flutter**. My background includes developing high-performance applications in the healthcare and financial sectors, coupled with cloud experience in **Azure** and **AWS**. I have also led the development of enterprise-grade platforms that integrate AI/ML capabilities for predictive analytics, intelligent automation, and real-time data processing. With a robust understanding of microservices architecture and event-driven systems, I am committed to delivering secure applications that meet compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Ruby Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Ruby** and **Ruby on Rails** to architect and develop maintainable and scalable applications, ensuring adherence to best practices in **Test-Driven Development** and clean code principles.\nImplemented backend services with **SQL** and **PostgreSQL**, focusing on efficient data storage, retrieval, and complex query optimization for enhanced application performance, while processing over **10,000** transactions daily.\nEmployed **Docker** for containerization, streamlining deployment and scalability of microservices applications in orchestrated environments using **Kubernetes** for seamless management of deployment cycles and availability across various clusters.\nExecuted deployment strategies with **Capistrano**, managing multiple environments and ensuring zero downtime during releases, achieving a **99.9%** uptime across production services.\nDesigned and implemented background job processing using **Sidekiq**, improving system performance and reducing processing time for schedules tasks by over **50%**.\nDeveloped Restful APIs to ensure efficient communication between services and client applications while focusing on high-level security measures, implementing cybersecurity protocols to protect sensitive data.\nLed efforts to migrate legacy systems to a microservices architecture, decreasing system complexity and enhancing maintainability, while reducing deployment time from **2 weeks** to **1 day**.\nCollaborated with cross-functional teams to integrate and maintain open-source libraries, driving innovation and maintaining a high level of code quality for the organization.\nEstablished robust test strategies using testing frameworks and methodologies, ensuring comprehensive coverage for both unit and integration tests that aligned with project standards and requirements.\nInstituted DevOps practices incorporating **Terraform** for infrastructure as code, allowing for consistent and repeatable environment setups, contributing to improved system reliability and team productivity."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Develop scalable and maintainable web applications using **Ruby** and **Ruby on Rails**, adhering to best practices in **Test-Driven Development** to ensure high-quality deliverables.\nUtilize **PostgreSQL** and **SQL** for efficient data management, ensuring optimized queries and schema design to support robust application performance.\nImplement containerization and orchestration solutions with **Docker** and **Kubernetes** to streamline deployment processes and enhance development workflows.\nLeverage **Terraform** for infrastructure as code, automating provisioning and configuration management across cloud environments.\nMaintain and optimize background job processing with **Sidekiq** to ensure efficient task management and processing of asynchronous operations.\nIntegrate APIs with a focus on security and performance, using **open source** solutions to enhance application capabilities and user experience.\nConduct regular reviews and refinements of application code to fortify **cybersecurity** practices, ensuring compliance with industry standards and protecting sensitive user data.\nLead cross-functional collaboration efforts to gather requirements and implement user-centric design principles that enhance overall application usability.\nMentor junior engineers on best practices and support their skill development in Ruby and related technologies, fostering a culture of continuous learning and improvement."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Ruby** and **Ruby on Rails** to develop and maintain scalable and maintainable backend services for high-traffic applications, enhancing performance amidst growing demands.\nImplemented **SQL** and **PostgreSQL** for efficient data management, optimizing database operations to handle over **100,000** concurrent users without performance degradation.\nManaged deployment and orchestration of applications using **Docker** and **Kubernetes**, resulting in streamlined CI/CD pipelines and reduced deployment times by **30%**.\nAutomated workflow processes and job scheduling with **Sidekiq**, ensuring timely execution of background tasks and improved system responsiveness.\nEnhanced application security through practices in **Cybersecurity**, including the implementation of encryption and secure access protocols to protect sensitive user data.\nEmployed **Terraform** for infrastructure as code, enabling reliable and consistent environment setup across development, testing, and production.\nConducted **Test-Driven Development** (TDD) practices, increasing code coverage to over **85%**, which significantly reduced the number of bugs in production.\nCollaborated with open-source communities to incorporate best practices and tools, fostering a culture of continuous improvement and innovation within the team.\nDesigned robust APIs using **Ruby on Rails**, ensuring seamless integration with microservices and third-party tools while adhering to industry standards.\nLed code reviews and mentoring sessions, enhancing team productivity and knowledge sharing, resulting in the successful onboarding of **5** junior developers within a quarter."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Ruby\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Ruby on Rails\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Capistrano\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Sidekiq, Test-Driven Development, Open Source, Cybersecurity",
  "apply_company": "Mend.io"
}