{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a skilled Senior Frontend Engineer with 8 years of experience, I excel in utilizing **React**, **JavaScript**, and **TypeScript** to deliver high-performance, user-centric web applications. My expertise also includes **Next.js** for server-side rendering and building scalable front-end architectures. I am well-versed in testing methodologies including unit testing, integration testing, and E2E testing, ensuring high-quality output and robust user experiences.\n\nI have a solid background in developing secure applications and implementing event-driven architecture, which aligns with best practices in creating responsive and interactive web solutions. My technical acumen extends to utilizing cloud services like **Amazon Web Services (AWS)** to support deployment and scalability. I possess experience with backend technologies that complement my frontend skills, including familiarity with **MySQL** and **gRPC** for efficient data handling and communication.\n\nIn addition to my technical skills, I bring an agile mindset and a passion for continuous learning and improvement, enabling my team to adopt innovative solutions that meet client needs in dynamic environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable front-end applications using **React** and **Next.js** integrating with back-end services written in **JavaScript** and **TypeScript** to enhance user experience and performance.\n• Implemented automated testing strategies, including **unit testing**, **integration testing**, and **E2E testing**, utilizing Jest and Cypress, ensuring high-quality software releases.\n• Collaborated with cross-functional teams to integrate RESTful APIs, improving data flow and communication between front-end applications and backend services using **JSON**.\n• Utilized **Amazon Web Services** for deploying applications and maintaining high availability, enhancing the overall infrastructure reliability by **30%**.\n• Constructed highly efficient event-driven architectures using **gRPC** and **Protocol Buffers** to streamline service communication, reducing latency by **25%**.\n• Optimized database interactions with **MySQL**, ensuring efficient data retrieval and storage, leading to **40%** faster response times in data-driven applications.\n• Championed the adoption of best practices in coding standards, promoting the transition to a cleaner codebase in line with modern JavaScript standards.\n• Enhanced application performance by **20%** through code optimization techniques and profiling tools, successfully improving user engagement.\n• Facilitated agile development processes, participating in sprint planning and reviews to ensure timely delivery of milestones.\n• Mentored junior developers on effective use of **React** and **JavaScript** frameworks, fostering a culture of continuous learning and improvement.\n• Actively contributed to the design and architecture decisions, providing deep insights into **event-driven architecture** to enhance application scalability.\n• Monitored performance metrics through tools like Google Lighthouse, achieving an overall performance score improvement of **15%** in the application."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)** and **Next.js** to architect and develop dynamic, user-focused front-end applications, enhancing performance and responsiveness for high-volume financial dashboards and admin portals.\nEmployed **TypeScript** and **JavaScript** to ensure code quality and effective collaboration within development teams, implementing **unit testing**, **integration testing**, and **E2E testing** methodologies for robust application performance.\nLeveraged **event-driven architecture** principles, integrating **Kafka** and **RabbitMQ** to facilitate real-time communication and processing for transaction alerts and compliance workflows, supporting a scalable financial ecosystem.\nContributed to the modernization of financial platforms through the adoption of a microservices architecture, incorporating services built with **Node.js** (using **NestJS** and **Express**) and **Python** (with **FastAPI** and **Django**), achieving an overall system throughput increase of **30%**.\nDeveloped real-time transaction monitoring dashboards using **React**, **D3.js**, and **Power BI Embedded**, allowing operations teams to track financial activity and anomalies with a **99% accuracy** rate in anomaly detection.\nOrchestrated **ETL** pipelines leveraging **Apache Airflow** and **Azure Data Factory** for seamless ingestion and processing of financial data, improving data access speed by **50%**.\nImplemented and optimized **AI/ML** strategies using **scikit-learn**, **XGBoost**, and **Azure Machine Learning** for fraud detection, resulting in a **40% decrease** in fraud-related losses.\nCreated machine learning pipelines for critical processes such as credit scoring and transaction classification, ensuring model inference was integrated efficiently into backend services for real-time operational decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Collaborated on frontend engineering solutions leveraging **React (18)**, **JavaScript**, and **TypeScript** to deliver high-performance web applications for an innovative e-commerce platform with over **1M** daily users.\nDesigned and implemented responsive user interfaces using **Next.js**, enhancing SEO and mobile-first engagement to achieve a **30%** increase in organic traffic.\nDeveloped user interfaces ensuring compliance with accessibility standards (WCAG 2.1), resulting in a better user experience for diverse customer bases.\nUtilized best practices in unit testing, integration testing, and E2E testing, achieving **95%** test coverage across key components to enhance product reliability and facilitate faster deployments.\nParticipated in the architectural design of event-driven architecture using **RabbitMQ** for real-time feedback mechanisms, contributing to the seamless customer support experience.\nEnsured effective API interactions through JSON-based data formats and secure communications utilizing **gRPC** and **HTTP** protocols.\nEngaged in agile development methodologies to rapidly iterate on features and fixes, leading to a **40%** reduction in sprint cycle time.\nContributed to cross-functional collaboration between frontend and backend teams to create optimized service interactions, enhancing overall system performance and user satisfaction.\nManaged application state efficiently using **Redux Toolkit**, ensuring smooth data flow and improved state management in large-scale applications.\nExplored and integrated cloud technologies, particularly **Amazon Web Services (AWS)**, to improve application deployment and scalability strategies."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, JavaScript, Python, Ruby, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tgRPC, Protocol Buffers, HTTP, JSON\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Unit testing, Integration testing, E2E testing, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Event driven architecture",
  "apply_company": "Square"
}