{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Principle Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Principal Backend Engineer with 8 years of experience, I possess robust skills in **Go**, **TypeScript**, **PostgreSQL**, and **Redis**, complemented by a strong understanding of algorithms, data structures, and graph algorithms. I specialize in building high-performance backend solutions within the healthcare and financial sectors, utilizing my expertise in full-stack development including **React**, **Node.js**, and **FastAPI**. My cloud strategy includes extensive experience with **AWS** and **Azure**, enhancing the scalability and reliability of enterprise-grade platforms.\n\nI have led the development of complex systems integrating AI/ML capabilities for predictive analytics and intelligent automation, ensuring alignment with compliance standards such as HIPAA and PCI DSS. My foundation in microservices architecture and event-driven systems allows me to craft robust applications, while my proficiency in CI/CD automation furthers operational efficiency. Additionally, my hands-on experience in machine learning pipelines and MLOps workflows is backed by the use of tools such as **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Principle Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Go**, **TypeScript**, **PostgreSQL** and **Redis** for architecting and developing robust backend systems catering to high-performance requirements and data management in financial and healthcare platforms.\nEmployed strong algorithm and data structure principles to design efficient solutions for complex backend challenges, ensuring optimal data retrieval and processing times.\nImplemented graph algorithms to enhance the functionality of distributed systems and improve data relationship handling in microservices architecture.\nLed the transition to microservices architectures using containerization technologies such as Docker and orchestration with Kubernetes, optimizing system performance and scalability.\nArchitected cloud-native data architectures leveraging **PostgreSQL** and **Redis** for large-scale data storage and retrieval, achieving a **99.9%** uptime and reducing latency by **30%**.\nConducted thorough code reviews and implemented best practices in **Go**, **TypeScript**, ensuring high standards of software quality and maintainability.\nIntegrated background services using **Redis** and messaging systems for real-time data processing and task queuing, improving application responsiveness.\nCollaborated with cross-functional teams to define and implement APIs, ensuring seamless data integration and services communication across multiple platforms.\nSupervised a team of engineers in adopting modern programming practices in **Go** and **TypeScript**, mentoring them on advanced concepts, fostering an atmosphere of continuous learning and improvement.\nUtilized performance profiling and monitoring tools to identify bottlenecks, enabling a **40%** increase in backend processing efficiency through optimization efforts.\nDesigned and executed comprehensive testing strategies to ensure system reliability, utilizing testing frameworks and methodologies suitable for both **Go** and **TypeScript** applications.\nOptimized algorithms to enhance the performance of data-processing tasks, significantly reducing execution times and increasing system throughput."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Go** and **TypeScript** to design and implement scalable backend solutions with an emphasis on performance and maintainability for high-throughput financial applications.\nLeveraged **PostgreSQL** for robust database management, optimizing queries to improve response time by **30%** and ensuring efficient data organization and retrieval.\nEmployed **Redis** for caching strategies, reducing latency and improving application response times by over **50%**, supporting real-time transaction processing and analytics.\nApplied advanced **Algorithm** and **Data Structures** knowledge to enhance the efficiency of backend processes, achieving a **25%** reduction in processing time.\nDeveloped complex **Graph Algorithms** for transaction analysis, identifying patterns and optimizing financial operations with measurable improvements in detection accuracy.\nEngaged in code reviews and architecture discussions, guiding the engineering team towards best practices and innovative solutions to enhance overall project outcomes.\nContributed to the modernization of legacy systems using **C++** and **Rust**, ensuring seamless integration with existing architecture while leveraging the latest programming paradigms.\nMentored junior engineers, fostering a collaborative environment that promotes skill enhancement and knowledge sharing across the team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed scalable backend services using **Go** and **C++**, focusing on high availability and efficient resource management.\n- Enhanced data management solutions leveraging **PostgreSQL** and **Redis** for optimized data storage and retrieval, achieving a **30%** improvement in read-write performance.\n- Implemented advanced algorithms and data structures, including **Graph Algorithms**, to solve complex problems, resulting in a **40%** reduction in processing time for data-heavy operations.\n- Collaborated on system architecture design, ensuring robust applications built with best practices in software engineering, leveraging **Rust** for performance-critical components.\n- Mentored junior engineers in best coding practices and introduced performance optimization techniques, elevating team productivity by **25%**.\n- Conducted code reviews to maintain code quality and adherence to best practices for both **Go** and **TypeScript**, leading to a significant decrease in code-related issues.\n- Engaged in cross-functional teams to align backend architecture with frontend technologies, ensuring seamless integration and user experience across platforms.\n- Explored and adopted emerging technologies and methodologies to continuously advance the team's technical expertise and software delivery capabilities."
    }
  ],
  "skills": "Programming Languages:\n\tGo, TypeScript, C++, Rust, Python, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOpenID Connect, OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Certbot, Algorithm, Data Structures, Graph Algorithms"
}