{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Fullstack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Fullstack Engineer with over 10 years of experience in delivering high-performance software solutions, specializing in **C#**, **Angular**, **T-SQL**, and **Cloud Computing**. Demonstrated expertise in **microservices** architecture and the development of secure applications, ensuring compliance with IT Security standards. Proven ability to lead collaborative teams while maintaining a strong customer focus. Skilled in modern frameworks such as **React**, **Next.js**, **Vue**, and backend technologies like **Node.js**, **FastAPI**, **Django**. Experience in deploying cloud-native applications on **Azure** and **AWS**, integrating **AI** capabilities for real-time analytics and automation. Well-versed in CI/CD automation with a rich background in MLOps, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**. Committed to building maintainable, scalable, and impactful solutions while effectively communicating with cross-functional teams.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped robust microservices using **C#**, enhancing system scalability and maintainability to meet complex healthcare and finance requirements while ensuring compliance with IT security standards.\n•\tEngineered dynamic web applications utilizing **Angular** for interactive user interfaces, resulting in improved customer engagement and streamlined workflows.\n•\tImplemented efficient data retrieval processes using **T-SQL** and **SQL Server**, optimizing database queries and enhancing application performance by up to **30%**.\n•\tDesigned and managed cloud-based solutions with emphasis on **Cloud Computing**, ensuring seamless integration and deployment of services that support business continuity and disaster recovery.\n•\tPioneered the integration of AI-driven features into applications, enhancing user experience with personalized insights, achieving a user satisfaction rate of **95%**.\n•\tLed collaborative projects with cross-functional teams, emphasizing effective communication and customer-focused strategies to ensure alignment and maximize project impact.\n•\tStructured and delivered training sessions to enhance team skills in **Microservices** architecture and **Service Fabric**, fostering a culture of continuous improvement and knowledge-sharing.\n•\tDelivered scalable and secure applications by adhering to IT security protocols, redundantly protecting sensitive data in compliance with relevant regulations, leading to a **40%** reduction in security incidents.\n•\tConducted regular code reviews and established a mentorship program to improve communication skills and collaborative work across developers, resulting in a **20%** increase in team productivity."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed and modernized robust financial platforms utilizing **C#**, **Microservices** architecture, and **SQL Server**, enhancing system scalability and transaction throughput by over **50%**.\n• Created responsive front-end applications employing **Angular** and **TypeScript**, applying industry best practices to ensure an intuitive user experience for financial dashboards, resulting in a **30%** increase in user engagement.\n• Implemented back-end services to support real-time data processing and analytics, utilizing **T-SQL** for efficient database management and query optimization, achieving a **20%** reduction in data retrieval times.\n• Collaborated cross-functionally with teams to integrate **Cloud Computing** resources, improving overall project delivery timelines and enhancing communication and teamwork.\n• Designed and executed **IT Security** protocols to protect sensitive financial data, ensuring compliance with industry standards and safeguarding against potential threats.\n• Championed customer-focused solutions, gathering user feedback to continuously improve application functionality and performance, successfully increasing client satisfaction ratings by **25%**.\n• Enhanced collaborative work environments through effective communication, leading to streamlined project workflows and greater alignment among team members."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and maintained microservices architecture using **C#** and **Angular**, ensuring seamless integration and high availability across multiple service layers, optimizing performance for over **1 million** users.\nEngineered scalable cloud solutions leveraging **Cloud Computing** platforms, achieving a **30%** reduction in operational costs and enhancing system reliability.\nImplemented robust data storage solutions with **SQL Server** and **T-SQL**, managing databases with a **99.9%** uptime service level agreement (SLA) to accommodate peak transaction volumes.\nLed the design and development of frontend applications using **Angular**, ensuring responsive user experiences with a focus on customer-centric features that increased user engagement by **25%**.\nIntegrated AI-driven features for personalized user experiences, improving customer retention rates through targeted marketing implementations and recommendations based on behavioral analytics.\nEnsured data security and compliance with **IT Security** best practices, applying role-based access control (RBAC) and creating secure APIs with **OAuth 2.0** for sensitive data management.\nCollaborated with cross-functional teams to enhance product features through agile methodologies and effective communication, contributing to a project delivery rate of **95%** within deadlines.\nDesigned and executed comprehensive testing strategies, identifying and resolving application issues swiftly, leading to a **40%** improvement in overall application stability and performance.\nFostered a collaborative work environment, mentoring junior developers, and facilitating knowledge sharing sessions to improve team efficiency and skill levels."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Microservices, Service Fabric\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL Server, T-SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Cloud Computing, AI, IT Security, Collaborative Work, Customer Focus, Communication Skills",
  "apply_company": "INYCOM"
}