{
  "name": "Tomasz Lee",
  "role_name": "Senior Java Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Java Engineer with 9+ years of experience in software development, specializing in **Java**, **Spring Boot**, and **REST API** design and implementation. Proficient in microservices architecture and adept at utilizing **Docker** and **Kubernetes** for containerization and orchestration. Experienced in database management with **PostgreSQL** and integrating modern message brokers. Proven track record of delivering high-performance solutions, streamlining development processes, and optimizing application scalability. Additional strengths include effective collaboration across multidisciplinary teams and successfully leading complex development projects to completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and maintained RESTful APIs using **Java**, ensuring robust data access and seamless integration with various services.\nEngineered microservices architecture utilizing **Spring Boot**, improving system modularity and enabling scalability for high-demand applications.\nImplemented containerization using **Docker** and orchestrated deployments with **Kubernetes**, streamlining application management and enhancing operational efficiency.\nPerformed database management and query optimization for **PostgreSQL**, resulting in a **20%** decrease in average query execution time and improved data retrieval efficiency.\nIntegrated **Apache Pulsar** for handling real-time data streaming, contributing to an increase in system throughput and reliability.\nCollaborated with cross-functional teams to gather requirements and provide technical guidance, leading to a **30%** increase in project delivery speed.\nEmployed CI/CD methodologies to automate testing and deployment processes, significantly reducing deployment time by **40%**.\nMentored junior engineers on best practices in software development and modern frameworks, enhancing the team's overall skill set and output quality.\nDesigned and developed key system components with an emphasis on performance and security, including JWT-based authentication mechanisms."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and maintained RESTful APIs leveraging **Java** and **Spring Boot**, ensuring efficient data handling and integration with a **PostgreSQL** database for real-time access.\nArchitected microservices using **Docker** and **Kubernetes**, enhancing the scalability and deployment of applications across **3** different cloud environments.\nIntegrated **Apache Pulsar** for effective messaging and data streaming solutions, resulting in a **40%** increase in data processing capabilities.\nOptimized query performance in **PostgreSQL**, leading to a **30%** reduction in response times during peak usage.\nDesigned CI/CD pipelines utilizing best practices, reducing deployment errors by **25%** and improving release cycles significantly.\nCollaborated with cross-functional teams to gather requirements and set development timelines, achieving **100%** on-time delivery across **5** projects.\nMentored junior developers on best practices in Java development and REST API design, fostering a culture of learning and enhancing team performance.\nImplemented automated testing for RESTful services, ensuring a high degree of reliability and performance in production environments.\nCreated and managed containerized applications to streamline development and operational workflows using **Docker**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Java** and **Spring Boot** to design and implement robust **REST APIs**, enhancing application performance by **30%**.\nDeveloped microservices architecture with **Docker** and **Kubernetes**, ensuring efficient deployment and scalability across environments.\nIntegrated **Apache Pulsar** for real-time messaging and event streaming, successfully handling over **1 million** messages per hour during peak times.\nManaged PostgreSQL database to optimize data retrieval processes, improving query execution time by **25%**.\nCollaborated in an Agile environment with daily standups and code reviews, promoting coding standards and team alignment.\nProduced comprehensive technical documentation for API endpoints and system interfaces, facilitating better developer onboarding.\nLed initiatives for performance tuning and resource monitoring using industry-standard tools, achieving a **40%** reduction in system downtime.\nEngaged in the migration of legacy systems to modern frameworks, effectively increasing maintainability and development speed.\nSupported integration efforts with third-party services, ensuring interoperability and data consistency across platforms."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, JavaScript, TypeScript, Python\n\n**Backend Frameworks**\n\tSpring Boot, NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tREST API, GraphQL\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tDocker, Kubernetes, AWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis; Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest; Blockchain: Solidity, Ether.js, Web3.js, Ethereum; UX/UI Design, Git, GitHub, Redux",
  "apply_company": "BlueSoft"
}