{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Platform Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a proactive Senior Platform Engineer with 8 years of experience, I possess a strong foundation in **CI/CD**, **performance optimization**, and **cross-functional communication**. My expertise includes high-level programming with **Go**, **Rust**, **C++**, and **Scala**, alongside a profound understanding of **blockchain** technologies, including **Solidity** and **Merkle trees**. I have successfully led the development of internal tooling that enhances developer experience while ensuring robust observability and compliance within systems.\n\nI also bring hands-on experience in **microservices architecture** and building high-performance solutions across diverse sectors, utilizing my skills in **JavaScript**, **TypeScript**, and **Python**. With expertise in leveraging **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, I have contributed to enterprise-grade platforms, incorporating **AI/ML** capabilities for advanced analytics and intelligent automation. My deep cloud experience spans platforms such as **Azure** and **AWS**, where I implement robust and secure applications aligning with compliance standards. Additionally, my knowledge of machine learning pipelines and MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow** enhances my contributions to project success.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Platform Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Led **cross-functional communication** to architect and develop scalable platforms using **Go**, **Rust**, and **C++**, ensuring robust performance optimization and high observability.\n- Implemented **CI/CD** pipelines for the deployment of decentralized applications, leveraging **Foundry** for efficient development and testing processes.\n- Developed and managed internal tooling for performance monitoring and observability across **blockchain** applications, specifically utilizing **EVM**, **Solidity**, and **Merkle trees** for secure data structures.\n- Optimized algorithm performance within smart contract environments by implementing cryptographic primitives, enhancing security and responsiveness.\n- Fostered **proactive ownership** of the technical stack, ensuring continuous improvement while mentoring junior engineers in **Scala**, **Yul**, and performance best practices.\n- Established and maintained documentation and resources for developer experience, ensuring clear guidelines and knowledge sharing within the team.\n- Collaborated on innovative solutions for enhancing the developer experience through integrated tools and interfaces, aiming for seamless onboarding and adoption of the tech stack.\n- Championed observability practices across all platforms, enhancing the ability to monitor, troubleshoot, and optimize application performance effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented and optimized CI/CD pipelines to enhance deployment efficiency and ensure seamless integration of blockchain technologies such as **Solidity**, **Rust**, and **Go** in platform development, reducing deployment time by **30%**.\nLed initiatives in performance optimization and observability, utilizing cryptographic primitives and Merkle trees to increase the security and integrity of systems managing sensitive financial data, achieving a **20%** reduction in latency.\nDesigned and developed internal tooling to enhance developer experience, fostering cross-functional communication for efficient project execution across teams, resulting in a more cohesive workflow with a **15%** improvement in project delivery times.\nContributed to the evolution of high-performance platforms by exploring EVM and Foundry for smart contract development, focusing on reliability and scalability of financial applications.\nProactively identified and addressed performance bottlenecks within existing systems, employing C++ and Scala for optimized backend services in a microservices architecture.\nEnhanced observability across platforms through the integration of developer monitoring tools, driving proactive maintenance and support for better system resilience and uptime.\nFostered a culture of ownership among team members, encouraging innovative problem-solving approaches and improved collaboration on project objectives."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Demonstrated **ownership** in designing and optimizing backend services for a blockchain-based platform using **Go** and **Rust**, ensuring high availability and scalability across essential components.\nLeveraged **EVM** and **Solidity** to build smart contracts, enhancing platform versatility and integration with decentralized applications.\nUtilized **CI/CD** practices to streamline the deployment process, ensuring rapid, error-free updates with **Foundry** and enhanced **observability** for stability monitoring.\nImplemented performance optimization techniques in the blockchain architecture, achieving a **10x** increase in transaction speeds and reducing latency.\nEngineered cross-functional communication strategies to facilitate collaboration across teams, promoting a proactive development culture that resulted in a **30%** reduction in project turnaround time.\nApplied cryptographic primitives and **Merkle trees** to secure data and ensure integrity across transactions, promoting trust in the decentralized system.\nDeveloped internal tooling to enhance developer experience, resulting in improved productivity metrics with a **25%** faster onboarding process for new team members.\nEnsured robust performance optimization through regular code refactoring and adopting best practices, which contributed to an improved user experience across the platform.\n"
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript, TypeScript, Go, Rust, C++, Scala, Solidity, Yul\n\n**Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:** \n\tReact, Vue, Angular\n\n**API Technologies:** \n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:** \n\tAWS (Lambda), Azure (App Services)\n\n**Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:** \n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:** \n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, blockchain, EVM, Foundry, CI/CD, observability, performance optimization, cryptographic primitives, Merkle trees, internal tooling, developer experience, cross-functional communication, proactive, ownership",
  "apply_company": "Matter Labs"
}