{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior R&D Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a highly skilled Senior R&D Engineer with 8 years of experience, I possess expert knowledge in **C++** and **C**, complemented by hands-on experience with **GIT** for version control and collaboration. My technical proficiency extends to **MFC** and **STM32**, enabling me to develop cutting-edge electronic designs that meet high standards of performance and reliability.\nI have a strong background in full-stack development using modern frameworks such as React and Node.js, and I'm well-versed in cloud technologies including **Azure** and **AWS**. I excel at creating scalable applications and have implemented microservices architectures to enhance system efficiency. My commitment to quality is reflected in my thorough understanding of CI/CD practices, ensuring robust workflows that streamline development processes.\nWith a collaborative approach to project management and a knack for innovative problem-solving, I bring creative solutions to complex challenges in tech-driven environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior R&D Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and integrated robust applications leveraging **C++** and **C** for high-performance systems, ensuring optimal functionality in electronic design projects.\n- Utilized **GIT** for version control in collaborative projects, enhancing code quality and version management in software development processes.\n- Designed and implemented various electronic design solutions using **MFC** (Microsoft Foundation Class) to streamline applications in embedded systems.\n- Applied programming skills in **C++** environments to optimize algorithms and data structures for complex project requirements, achieving significant performance enhancements.\n- Conducted thorough testing and validation of software components, employing methodologies suitable for embedded systems and ensuring compliance with project specifications.\n- Collaborated with cross-functional teams to drive product innovation, integrating feedback loops into the design process for continuous improvement.\n- Developed prototypes for electronic designs, utilizing the **STM32** microcontroller platform for efficient applications in consumer electronics and IoT devices.\n- Led research initiatives that implemented findings from cutting-edge electronic design methodologies into practical applications for various industries.\n- Documented development processes and best practices, establishing a knowledge base for future projects and facilitating easier onboarding of new engineering team members."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "• Developed advanced electronic design solutions utilizing **C++** and **C** to enhance product functionality and performance, improving design efficiencies by **25%**.\n• Implemented version control and collaboration strategies with **GIT** to manage and streamline project workflows across a diverse engineering team, ensuring a **15%** reduction in merge conflicts.\n• Led the integration of **MFC** for user interface applications, achieving a more robust application experience while overcoming compatibility challenges with legacy systems.\n• Programmed and tested embedded systems using **STM32**, reducing development time for new prototypes by **30%** through effective testing methodologies and design optimizations.\n• Conducted comprehensive electronic designs and validation processes to guarantee product compliance with industry standards, resulting in a **20%** decrease in time-to-market for new electronic products."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Utilized **C++** and **C** to develop high-performance software solutions for embedded systems in electronic design, ensuring robust functionality and reliability in varying operational environments.\nImplemented version-control best practices by managing source code and collaboration through **GIT**, facilitating seamless team integration and tracking of software iterations across **STM32** architecture.\nEngineered and optimized real-time applications utilizing **MFC** frameworks to enhance user interaction and control, achieving response times under **50ms** for critical operational tasks.\nConducted comprehensive testing and validation of electronic designs, achieving a **98% success rate** in prototype to production transitions, while maintaining compliance with industry standards.\nDesigned modular and scalable software components that improved development efficiency by **30%**, enabling faster iterations and application upgrades.\nDeveloped detailed documentation and training for new technologies introduced, promoting knowledge transfer and ensuring team proficiency with both new and legacy systems.\nCollaborated closely with cross-functional teams to assess project needs and deliver innovative solutions, resulting in a **25% reduction** in overall project timelines."
    }
  ],
  "skills": " **Programming Languages:** \n\tC++, C, Python, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:** \n\tAWS (Lambda), Azure (App Services)\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Nginx, Certbot, MFC, STM32, electronic design",
  "apply_company": "Kingspan Light + Air"
}