{
  "name": "Tomasz Lee",
  "role_name": "Printer and MFP Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "A dedicated Printer and MFP Engineer with strong communication and problem-solving skills, bringing over 9 years of experience in desktop and laptop repair, including board level repair and desk side support. Proficient in Windows support and network troubleshooting, ensuring efficient and reliable service delivery. Proven track record in collaborating with teams and managing vendor certifications for optimal performance. Previously, as a .NET Full Stack Developer, demonstrated expertise in full application lifecycle management, including experience with **microservices architecture**, **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, and **.NET/C#** technologies, driving successful development projects and complex application implementations.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Printer and MFP Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Provided **desk side support** for printer and Multi-Function Printer (MFP) repair, ensuring minimal downtime for clients through efficient troubleshooting processes.\nUtilized **problem-solving skills** to diagnose and resolve complex issues related to desktop and laptop repairs, achieving a resolution rate of over **90%** on first attempt.\nConducted **network troubleshooting** to ensure uninterrupted connectivity and functionality of printing solutions, resulting in enhanced user satisfaction ratings by **30%**.\nMaintained up-to-date knowledge on **vendor certifications** for various printer brands to enhance repair effectiveness and service quality.\nCommunicated effectively with clients to gather requirements and provide clear updates on repair status, leading to improved customer relationships and feedback.\nStreamlined repair processes through the development of documentation and checklists, reducing average repair time by **25%**.\nImplemented **Windows support** techniques to optimize OS performance on client machines, enhancing overall system efficiency.\nDemonstrated expertise in **board level repair**, allowing complex hardware issues to be resolved rapidly with minimal parts replacement.\nConducted regular training sessions on **printer repair** best practices, improving team proficiency in MFP and desktop repair techniques."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Provided desk-side support for printer and MFP repair, delivering solutions that reduced downtime by **30%**.\nExecuted board-level repairs on printer and multifunction printers (MFP), leveraging technical expertise to resolve complex hardware issues effectively.\nConducted Windows support and desktop repair, achieving a **95%** customer satisfaction rate through effective communication and problem-solving skills.\nPerformed detailed network troubleshooting to ensure seamless operation of printing and MFP systems, improving network performance by **20%**.\nManaged vendor certifications and maintained compliance with industry standards to enhance service delivery.\nDeveloped training materials and conducted workshops on printer maintenance, increasing team knowledge and service capabilities.\nProvided technical guidance and mentorship to junior technicians, fostering a collaborative environment that improved problem-solving efficiency.\nCollaborated with clients to understand printing needs and tailored solutions to ensure optimal performance of devices, resulting in a **25%** increase in client retention.\nImplemented a tracking system for service requests that streamlined operational workflows, reducing response times by **15%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Provided desk side support and maintenance for printers and Multifunction Printers (MFP), ensuring optimal performance and reducing downtime by **15%**.\nExecuted printer repair and MFP repair tasks, leveraging industry-standard techniques to resolve issues efficiently and maintain functionality.\nConducted thorough diagnostic assessments that utilized **Windows support** practices, resulting in a **30%** improvement in first-time fix rates.\nDelivered outstanding customer service through excellent communication skills, facilitating client education on troubleshooting basic network issues related to printers and MFPs.\nCollaborated with vendors to obtain necessary certifications for repairing various printer models, enhancing service reliability and compliance.\nApplied problem-solving skills to identify and rectify common issues related to desktop and laptop repair, achieving a **25%** reduction in repair turnaround time.\nEngaged in network troubleshooting to address connectivity problems affecting printer operations, significantly improving overall workflow.\nMaintained meticulous documentation of repair processes and service reports, enhancing team knowledge transfer and operational efficiency.\nParticipated in regular training sessions to stay up-to-date with evolving printer technologies and repair strategies, including **board level repair** practices."
    }
  ],
  "skills": " **Programming Languages**\n\t Python, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t Vendor certifications, Communication skills, Problem-solving skills\n\n**Other**\n\t UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Desktop repair, Laptop repair, Printer repair, MFP repair, Board level repair, Desk side support, Windows support, Network troubleshooting"
}