{
  "name": "Mariusz Jan Skobel",
  "role_name": "DevOps Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "DevOps Engineer with 10+ years of experience in delivering high-performance software solutions, specializing in **Azure** cloud services and **CI/CD** automation. Expertise in **Infrastructure as Code** using **Terraform**, **Bicep**, and **ARM Templates** to streamline deployment processes. Proficient in **Azure DevOps**, **Azure Policy**, **Azure Monitor**, and **Application Insights** to ensure robust application performance and compliance. Hands-on experience with **Docker** and **Kubernetes** for container orchestration, leveraging **Powershell** for automation tasks. Strong problem-solving, communication, and collaboration skills facilitate effective teamwork and project success.\n\nExtensive background in software development using **Python**, and modern frameworks including **React** and **Node.js**, coupled with practical experience in building secure and maintainable solutions that adhere to compliance standards such as HIPAA, FHIR, and PCI DSS. Passionate about utilizing technical expertise to drive real-world impact through efficient and innovative software practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "DevOps Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tImplemented **CI/CD** pipelines leveraging **Azure DevOps**, **GitHub Actions**, and **CircleCI** to automate the deployment process, ensuring seamless integration and delivery across different environments with a focus on reliability and speed.\n•\tUtilized **Infrastructure as Code** (IaC) principles through **Terraform**, **Bicep**, and **ARM Templates** to provision and manage Azure resources, achieving a 30% reduction in deployment time and higher consistency across environments.\n•\tDesigned and maintained container orchestration solutions using **Docker** and **Kubernetes** on Azure (AKS), enhancing scalability and resource utilization by 25% while minimizing downtime during updates.\n•\tDeveloped monitoring solutions using **Azure Monitor** and **Application Insights**, achieving up to 99.9% uptime for critical applications by implementing proactive alerting and logging strategies.\n•\tCollaborated with cross-functional teams to improve application performance and reliability, utilizing **PowerShell** for automation scripts that streamlined repetitive tasks by over 40%.\n•\tFostered communication and collaboration through Agile methodologies, improving team efficiency in resolving deployment issues and maintaining project timelines.\n•\tAddressed complex problems using **Python** for scripting resource management tasks, enhancing operational workflows to support development teams effectively.\n•\tBuilt and deployed enterprise-level applications, ensuring compliance with industry standards, and implementing best practices for security and governance within the Azure environment.\n•\tLed initiatives in continuous improvement and paradigmatic shifts towards automated processes, effectively reducing manual intervention and operational costs by 15%.\n•\tApplied strong communication and collaboration skills to liaise between technical and non-technical stakeholders, ensuring project alignment with business goals and requirements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented **Infrastructure as Code** strategies using **Terraform**, **Bicep**, and **ARM Templates** to manage cloud resources on **Azure**, ensuring consistent and repeatable deployments across multiple environments.\nOrchestrated CI/CD pipelines in **Azure DevOps** utilizing **Docker** and **Kubernetes**, achieving a deployment frequency increase of **40%** while reducing the deployment time to less than **15 minutes**.\nMonitored application performance and health by configuring **Azure Monitor** and setting up **Application Insights**, enhancing troubleshooting efficiency by **30%** through proactive alerting and diagnostics.\nDeveloped and maintained automation scripts in **Powershell** and **Python** to streamline infrastructure deployment and configuration management, improving operational efficiency by **25%**.\nCollaborated with cross-functional teams to improve communication and foster collaboration, contributing to a **50%** reduction in issues during production releases.\nAdopted best practices in security by implementing **Azure Policy** to enforce governance and compliance across cloud resources, enhancing the security posture of applications.\nUtilized **Azure Service** features for monitoring and managing cloud resources, optimizing operational costs by regularly analyzing usage and performance metrics.\nApplied strong problem-solving skills to troubleshoot and resolve complex issues in both cloud infrastructure and application deployments, ensuring uptime above **99.9%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Azure** services to design and implement CI/CD pipelines, enhancing deployment frequency by **30%** and reducing lead time for changes by **40%**.\nImplemented Infrastructure as Code (IaC) using **Terraform** and **Bicep**, achieving consistent and reproducible deployments across multiple environments.\nMonitored application performance and infrastructure health through **Azure Monitor** and **Application Insights**, leading to a **25%** reduction in downtime through proactive issue resolution.\nDeveloped and maintained container orchestration using **Docker** and **Kubernetes**, optimizing resource utilization and scaling applications based on traffic demands.\nCreated automated scripts with **Powershell** to streamline operational tasks, resulting in an efficiency gain of over **15%** within the team.\nFacilitated cross-functional collaboration and effective communication with development teams to ensure seamless integration of DevOps practices.\nImplemented **Azure Policy** for governance and compliance, ensuring that all deployments adhere to defined organizational standards.\nLeveraged **Python** for automation scripts and tools that enhance operational workflows and improve problem-solving capabilities.\nFostered a culture of continuous improvement through regular feedback loops, focusing on problem-solving techniques and collaborative efforts.\nParticipated in code reviews and knowledge-sharing sessions to enhance team skills and promote best practices in both development and operations."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Azure DevOps, Azure Policy, Azure Monitor, Application Insights\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Infrastructure as Code, Terraform, Ansible, Helm, Docker Compose, Bicep, ARM Templates, Powershell\n\n **Cloud & Infrastructure:**\n\t\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Communication Skills, Collaboration Skills, Problem-Solving Skills"
}