{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Python Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a dedicated Senior Python Engineer with 8 years of experience, I excel in utilizing **Python**, **FastAPI**, and **Pydantic** to develop high-performance, scalable applications, particularly in the healthcare and financial industries. My strong background in **CI/CD** practices ensures smooth deployment processes, while my proficiency in **Git** enhances version control and collaboration within development teams. I thrive in **Agile** environments, driving efficient project execution through effective **communication** and **collaboration**.\n\nWith extensive expertise in databases and cloud services, particularly **Azure** and **AWS**, I am adept at building secure applications that comply with standards such as HIPAA and PCI DSS. I possess a solid foundation in testing protocols that guarantee software reliability. My experience also includes architectural design using microservices and event-driven systems, which has supported the development of enterprise-grade solutions incorporating AI/ML for real-time data processing and intelligent automation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable applications using **Python**, **FastAPI**, and **Pydantic**, ensuring robust API development and adherence to Agile methodologies.\nImplemented Continuous Integration (CI) and Continuous Deployment (CD) pipelines leveraging **Git** for version control, enhancing deployment efficiency by **30%**.\nCollaborated effectively with cross-functional teams to ensure seamless communication and alignment on project progress and requirements.\nDesigned and optimized relational and non-relational database solutions for data storage and retrieval, employing both traditional and cloud-based databases.\nConducted comprehensive testing strategies across applications, utilizing frameworks like **pytest** to ensure robustness and reliability of code.\nArchitected innovative solutions for healthcare and financial platforms while adhering to compliance standards, streamlining operations and reducing overhead by **15%**.\nSpearheaded DevOps initiatives to automate testing and deployment processes, achieving a **40%** reduction in deployment time.\nEngaged in collaborative code reviews and mentoring, fostering a culture of continuous improvement and code quality within the team.\nMonitored application performance and reliability using **cloud services** to ensure optimal user experience and system stability."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Executed Agile development practices while leading a team on the modernization of financial platforms, enhancing project delivery and team collaboration through effective communication.\nUtilized **Python** with **FastAPI** and **Pydantic** to implement robust backend services, improving application performance and maintainability for high-volume transaction systems.\nEngaged in Continuous Integration (CI) and Continuous Deployment (CD) processes, leveraging **Git** for version control while ensuring seamless deployments and code quality.\nDesigned and developed ETL pipelines using **Apache Airflow** and **Azure Data Factory** for efficient data processing, achieving both batch and real-time ingestion workflows with a **5x** increase in data handling capabilities.\nIntegrated databases efficiently with application layers, optimizing data retrieval and storage, resulting in **30%** faster access times for transactional data.\nCollaborated with cross-functional teams to implement effective testing strategies, ensuring bug-free releases and enhancing product stability with a **98%** success rate in production.\nCreated comprehensive documentation and participated in code reviews, promoting a culture of code quality and continuous improvement within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** with **FastAPI** and **Pydantic** to design and optimize backend services for a global e-commerce platform, achieving **99.9%** uptime and enhancing scalability across modules including checkout and order fulfillment.\nImplemented CI/CD pipelines and utilized **Git** for effective version control and collaboration in an Agile environment, accelerating deployment times by **30%**.\nEngaged in collaborative communication with cross-functional teams to ensure alignment on project goals and requirements, contributing to **8%** increase in project delivery efficiency.\nDeveloped and executed comprehensive testing strategies to maintain code quality and reliability, utilizing automated testing frameworks to reduce bug rates by **25%**.\nLeveraged databases such as **MongoDB** and **PostgreSQL**, managing data storage solutions that handled traffic spikes efficiently, processing up to **10,000** transactions per minute during peak hours.\nEmployed cloud services to ensure high availability and disaster recovery, achieving seamless application performance across global regions.\nConducted regular code reviews and participated in technical discussions to foster an environment of continuous improvement and knowledge sharing among team members."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tPydantic\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tAuthentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), CI/CD, Testing, Agile, Collaboration, Communication, Git",
  "apply_company": "Nearform"
}