{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior QA Engineer with 8 years of full-stack development experience, I excel in **JavaScript**, **TypeScript**, **React**, and **Node.js**, and have a strong foundation in **CI/CD** processes and **test automation**. My extensive background includes implementing comprehensive **regression testing** and **end-to-end testing** strategies, ensuring robust quality assurance protocols. I have effectively communicated with cross-functional teams to align development goals and maintain high standards of output.\n\nI have successfully led the deployment of high-performance applications in the healthcare and financial sectors, utilizing my expertise in **FastAPI**, **Django**, and cloud platforms like **Azure** and **AWS**. My knowledge of microservices architecture and event-driven systems has allowed me to develop compliant and secure solutions, adhering to HIPAA, FHIR, PCI DSS, and SOC 2 standards. Additionally, I am experienced in leveraging **AI/ML** capabilities to enhance applications and streamline workflows using tools such as MLflow, Airflow, and Kubeflow.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained test automation strategies for scalable applications in **JavaScript** and **TypeScript**, ensuring high-quality standards and compliance with project specifications.\n- Implemented CI/CD pipelines using **Playwright** for automated testing of web applications, enhancing deployment frequency by **30%** and reducing lead time for changes.\n- Conducted regression testing and end-to-end testing utilizing tools such as **Playwright** and **Jest** to ensure functionality across applications developed with **React** and **Node.js**.\n- Collaborated effectively with cross-functional teams, including developers and product managers, to communicate QA progress and challenges, fostering a culture of quality in fast-paced projects.\n- Led the integration of test automation tools into existing workflows, resulting in a **40%** increase in testing efficiency and catch rate of critical bugs.\n- Performed continuous monitoring and reporting on testing processes, utilizing metrics to drive improvements in reliability and performance across both web and API services.\n- Enhanced and maintained testing frameworks to accommodate rapid feature development cycles, ensuring compatibility with existing codebases written in **JavaScript** and **TypeScript**.\n- Provided thorough documentation and training on testing procedures and best practices, improving team knowledge and onboarding processes for new hires.\n- Executed thorough API testing and validation to ensure that system integrations worked seamlessly, leveraging tools like **Postman** for enhanced API testing capabilities.\n- Championed the adoption of innovative testing tools and techniques, including test automation for functional and performance testing, keeping the team updated with the latest QA methodologies."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented comprehensive **test automation** frameworks using **JavaScript** and **TypeScript**, ensuring high code quality and effective regression testing for applications built with **React** and **Node.js**.\nConducted **end-to-end testing** for financial platforms, enhancing the overall user experience and identifying critical issues in **real-time** systems to ensure seamless operations.\nCollaborated with cross-functional teams to develop and execute CI/CD pipelines, integrating automated testing into workflows, leading to an increase of **30%** in deployment efficiency.\nUtilized **Playwright** for automated UI testing, achieving **95%** test coverage across core functionalities, significantly reducing manual testing time and improving release cycles.\nLed communication efforts with stakeholders to gather testing requirements, ensuring alignment and clarity throughout the software development lifecycle.\nFacilitated rigorous **regression testing** processes for new feature releases, guaranteeing system stability and performance across multiple environments with a focus on **high-volume transaction systems**.\nExercised strong analytical skills to troubleshoot and resolve complex testing issues, enhancing the reliability of financial applications across deployment versions **1.0** to **3.2**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted **test automation** for frontend and backend applications using **Playwright** and **Node.js**, enhancing regression testing efficiency by **30%**.\nDeveloped comprehensive end-to-end testing strategies integrated with continuous integration and delivery (**CI/CD**) pipelines, ensuring rapid delivery of high-quality software.\nCollaborated with development teams to create and execute **JavaScript** and **TypeScript** test scripts, improving cross-browser compatibility and responsiveness of applications.\nExecuted regression testing and identified critical bugs prior to release, reducing production issues by **25%** and enhancing communication between QA and development teams.\nDesigned and implemented automated test cases for applications built with **React**, fostering better coverage and reliability in systems under test.\nUtilized performance testing tools to ensure significant enhancements, achieving application load times reduced by **15%** under high traffic scenarios.\nParticipated in daily stand-ups and team retrospectives, improving communications and teamwork across project phases.\nProvided mentorship and guidance on best practices for **test automation** and quality assurance techniques to junior QA engineers, fostering skill development within the team."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django), Node.js\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tPlaywright, test automation, regression testing, end-to-end testing, communication, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n",
  "apply_company": "lemlist"
}