{
  "name": "Patryk Zaslawski",
  "role_name": "Senior ML Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior ML Engineer with over 8 years of experience in software engineering, I excel in **Machine Learning** and **Software Systems Architecture**, delivering innovative engineering solutions across various sectors. My technical proficiency includes advanced skills in **Python** (FastAPI, Django, Flask, SQLAlchemy) and I am adept at leading technical discussions and providing **Technical Leadership**. I specialize in collaborating with cross-functional teams to drive **Technical Consultation** and ensuring robust design through **Design Reviews**. I have a focus on building secure and efficient systems while optimizing databases with **PostgreSQL**, **MySQL**, and **MongoDB**. My background also includes developing scalable cloud applications using **AWS** and **Azure**, and employing **microservices architecture** and **REST/gRPC API development** for enterprise-grade software solutions. Known for my strong **Interpersonal Skills** and **Problem Analysis** capabilities, I contribute to staff development and foster a culture of **Lean** principles within teams.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Provided technical leadership and engineering solutions to cross-functional teams, optimizing workflows with a focus on **Machine Learning** methodologies and software systems architecture.\n• Conducted design reviews and technical consultations, improving system efficiency based on data-driven problem analysis and lean principles.\n• Developed and implemented scalable software architectures, enhancing performance and reliability, significantly improving overall system efficiency by **30%**.\n• Mentored and trained junior engineers, fostering a culture of continuous learning and staff development within the organization.\n• Spearheaded initiatives for patent evaluation, ensuring innovative solutions adhered to industry standards and best practices.\n• Collaborated effectively with cross-functional teams, driving impactful change and increasing project delivery timeliness by **25%** through streamlined communication and collaboration.\n• Evaluated and integrated advanced machine learning models using Python frameworks, contributing to a project that improved prediction accuracy by **15%**.\n• Maintained a culture of high technical standards by implementing thorough review processes and efficient development methodologies.\n• Engaged in problem analysis and interpersonal skills to align team efforts with organizational goals, ensuring project alignment and stakeholder satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Leveraged **Machine Learning** techniques to enhance fraud detection services in Python, integrating Azure Machine Learning models for proactive identification of suspicious activities.\n• Designed and architected software systems using **Python** along with **FastAPI, Django**, and **Flask** to build microservices that improve scalability and performance for financial applications.\n• Provided technical leadership and consultation during design reviews, contributing to the development of industry-compliant, secure **API** integrations across platforms and services, including **OAuth 2.0** for authentication.\n• Developed and maintained robust, high-performance backend systems utilizing **PostgreSQL**, **SQL Server**, and **MongoDB** for efficient data management supporting real-time transaction updates, achieving **99.9%** availability.\n• Guided cross-functional teams in achieving technical excellence through training and skills development in **Python**, microservices architecture, and cloud service deployment with **Azure** and **AWS**.\n• Conducted problem analysis to refactor and migrate legacy systems from **.NET/VB.NET** to **Python** microservices, enhancing compatibility with modern frameworks while preserving critical functionalities.\n• Designed and integrated dynamic, user-centric frontends utilizing **Angular**, **Vue**, **React**, and **Next.js**, employing frameworks like **Redux/NgRx** to enhance user experience of banking applications.\n• Championed engineering solutions for secure payment gateways supporting **ACH** transfers, credit card payments, and wire transfers, ensuring PCI compliance and interoperability with external providers.\n• Implemented the **ELK stack (Elasticsearch, Logstash, Kibana)** for centralized logging and monitoring of Python services, improving system performance tracking and issue resolution times by over **30%**.\n• Managed and configured **Kubernetes** clusters for deploying Python microservices, enabling rolling updates and auto-scaling capabilities which led to a **50%** reduction in deployment times.\n• Created system integrations through **MuleSoft** to facilitate secure financial data exchange with external partners and improve transaction processing efficiency.\n• Applied best practices in Python development, performing automated unit testing using **PyTest** and continuous integration through **Azure DevOps** to maintain high code quality and reliability across all services.\n• Led innovative project initiatives to architect event-driven systems utilizing **Kafka** and **RabbitMQ** to significantly enhance performance and responsiveness of large-scale financial applications."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Provided **technical leadership** in the design and implementation of machine learning solutions, enhancing overall **software systems architecture** and driving project success.\nCollaborated with cross-functional teams to conduct **design reviews** and ensure alignment on project deliverables, utilizing strong **interpersonal skills** to foster collaboration.\nAnalyzed complex problems and delivered innovative **engineering solutions** within the scope of machine learning, improving system performance by **25%** in targeted areas.\nConducted **technical consultations** to evaluate patent opportunities related to machine learning advancements, facilitating informed decision-making.\nLed **staff development** initiatives and **technical training** sessions to upskill team members in emerging technologies, boosting team productivity by **30%**.\nEngaged in **problem analysis** to identify areas for improvement in existing machine learning models, leading to a **15%** increase in accuracy through iterative adjustments.\nUtilized lean methodologies in the development process, streamlining workflows and reducing inefficiencies, resulting in a **20%** faster turnaround on project deadlines.\nDesigned and optimized machine learning algorithms using Python libraries such as **TensorFlow** and **Scikit-Learn**, achieving industry-leading performance metrics.\nIncorporated features for **real-time data processing** and analytics to enhance the decision-making process within the organization, ensuring robust model delivery.\nDeveloped comprehensive documentation for machine learning solutions and architecture, facilitating knowledge transfer and future maintenance."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython (FastAPI, Django, Flask)\n\n**Backend Frameworks:**\n\tSpring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Other:**\n\tMachine Learning, Software Systems Architecture, Technical Leadership, Design Reviews, Engineering Solutions, Technical Consultation, Patent Evaluation, Cross-Functional Team Collaboration, Technical Training, Staff Development, Problem Analysis, Interpersonal Skills, Lean",
  "apply_company": "GE Vernova"
}