{
  "name": "Rei Taro",
  "role_name": "Senior UX Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior UX Engineer with over 10 years of experience in creating responsive and user-centered designs. Proficient in **Node.js**, **Angular**, **Nest.js**, as well as leveraging design tools like **Figma**, **Sketch**, and **Adobe Creative Suite** to enhance UI/UX. Skilled at transforming complex data into intuitive visualizations, conducting usability testing, and leading prototyping efforts to ensure optimal user experience. Proven ability to collaborate effectively across teams and contribute to impactful projects at leading organizations, demonstrating a strong commitment to excellence and innovation.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior UX Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Designed and developed user-centric interfaces using **Angular** to enhance user engagement and streamline workflows.\nUtilized **Node.js** and **Nest.js** to create robust, scalable backend services that support responsive and interactive UI components.\nCollaborated with design teams using **Figma** and **Sketch** to create wireframes and prototypes, translating user requirements into intuitive designs that improve usability.\nConducted usability testing sessions with a **95% satisfaction rate** to gather feedback for continuous design improvements.\nImplemented responsive design techniques in **HTML5** and **CSS** to ensure seamless experiences across devices, achieving a **30% increase** in mobile traffic.\nLed cross-functional team meetings to address system challenges, ensuring compliance and maintaining a **6-month** roadmap for iterative design enhancements.\nCreated data visualization components that improved decision-making processes, leveraging user feedback for an iterative design flow."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Figma**, **Sketch**, and **Adobe Creative Suite** to design and prototype intuitive user interfaces, enhancing the overall user experience by **30%** based on usability testing metrics.\nDirected the creation of wireframes and mockups for responsive web applications, leveraging **HTML5**, **CSS**, and JavaScript frameworks such as **Angular** and **Node.js** for seamless integration.\nEngaged in usability testing, gathering user feedback to iterate design solutions that improved user satisfaction scores by **25%**.\nCollaborated with cross-functional teams to develop UI/UX strategies, ensuring designs align with business goals and provided data visualization for user behavior analytics.\nImplemented responsive design principles that enhanced cross-device compatibility, resulting in a **40%** increase in mobile user engagement.\nSupported releases by overseeing the design-to-development handoff, ensuring fidelity in UI implementation and adherence to UX principles throughout the development cycle."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Lead the design and prototyping of user experiences leveraging **Angular** and **Node.js**, ensuring intuitive UI that aligns with project goals and user needs.\nUtilize **Figma** and **Sketch** for wireframing and high-fidelity prototypes, enhancing visual design for web applications by **30%** in user satisfaction scores.\nConduct usability testing sessions, leading to actionable insights that improved task completion time by **25%** across various projects.\nCollaborate with cross-functional teams to create responsive design solutions that comply with modern web standards, achieving compatibility across **99%** of devices.\nIncorporate data visualization techniques into designs, enhancing decision-making processes with clear, engaging representations of complex data.\nExecute UX design revisions based on feedback and analytics, iterating wireframes and prototypes efficiently to address user pain points and stakeholder needs.\nAdopt methodologies for effective UX/UI changes, which led to a **40%** reduction in bounce rates on redesigned pages through tested prototypes."
    }
  ],
  "skills": "  **Frontend Frameworks**\n\tAngular, HTML5, CSS, Figma, Sketch, Adobe Creative Suite, UX, UI, Prototyping, Wireframing, Usability Testing, Responsive Design, Data Visualization\n\n  **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery, Node.js, Nest.js\n\n  **API Technologies**\n\tREST/gRPC APIs, Microservices, Kafka\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), Azure\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n  **Other**\n\tPandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, PyTest, Git",
  "apply_company": "GlobalLogic"
}