{
  "name": "Mariusz Jan Skobel",
  "role_name": "Fullstack Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-118083397/",
  "profile_summary": "Results-driven Full Stack Developer with 10+ years of experience creating high-performance software solutions across healthcare and finance. Expert in **Java**, **JavaScript**, **Node**, and proficient in both SQL and NoSQL databases. Experienced in building cloud-native applications utilizing **AWS**, **Azure**, and **GCP**, leveraging **Serverless Computing** to enhance scalability and efficiency. Strong skills in **REST** and **GraphQL** for building robust APIs, alongside modern frameworks like **Vue**. Proven ability to design, implement, and maintain applications within agile environments, focusing on security and compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2.\n\nAdditionally, I bring hands-on expertise in utilizing **Docker** for containerization and microservices architecture, ensuring seamless deployment and continuous integration. Passionate about leveraging technology to create impactful solutions, with a solid foundation in building enterprise platforms and integrating AI/ML capabilities for enhanced analytics and automation.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Fullstack Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed full-stack applications using **JavaScript** (Node.js, React, and Vue), adhering to best practices in **REST** and **GraphQL** API development to enhance user engagement and satisfaction.\n• Designed, implemented, and maintained **Cloud Platforms** solutions on **AWS** and **Azure**, leveraging services like **serverless computing** to optimize performance and reduce operational costs by up to **30%**.\n• Spearheaded the integration of **SQL** (PostgreSQL) and **NoSQL** (MongoDB) databases within applications, achieving data retrieval speeds improved by **25%** compared to traditional methods.\n• Engineered robust microservices architectures utilizing **Docker** for containerization and orchestration frameworks like Kubernetes to ensure scalability and high availability across cloud environments.\n• Collaborated on frontend development using **HTML5**, **CSS**, and **JavaScript** frameworks (Vue, React) to create responsive designs, enhancing UX with load times reduced to less than **2 seconds**.\n• Applied agile methodologies to manage project timelines effectively and deliver on project milestones with a **95%** on-time delivery rate.\n• Implemented CI/CD pipelines using tools such as Jenkins and GitHub Actions to streamline development processes and increase deployment efficiency by **40%**.\n• Conducted performance tuning and optimization of existing applications, aiming for a **50%** enhancement in application speed and efficiency.\n• Developed and deployed cross-platform mobile solutions using React Native, achieving functionality parity across **iOS** and **Android** platforms within a single codebase.\n• Fostered a culture of collaboration by liaising with cross-functional teams to implement features driven by customer feedback, leading to an increase in user retention by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** and **React (18)** to develop scalable and maintainable applications for financial platforms, enhancing transaction throughput by over **30%**.\nEmployed **Java** and **Spring Boot** for back-end development, integrating **SQL** and **NoSQL** databases to manage high-volume transaction data effectively.\nImplemented cloud solutions using **AWS** and **Azure**, leading the deployment of serverless applications that reduced operational costs by **25%**.\nDesigned user interfaces using **Vue 3**, **HTML5**, and **CSS**, incorporating **Tailwind CSS** for responsive design, which improved user engagement metrics by **40%** across financial dashboards.\nConducted real-time data analytics with **D3.js** and integrated **Power BI Embedded**, allowing teams to monitor transaction activities and receive alerts in real-time.\nEstablished a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, facilitating real-time event processing for compliance workflows and alerts.\nDeveloped and maintained ETL pipelines leveraging **Apache Airflow** and **Azure Data Factory**, optimizing data ingestion processes and achieving an ingestion time reduction of **50%**.\nImplemented AI/ML algorithms for fraud detection using **scikit-learn** and **XGBoost**, resulting in a **70%** improvement in anomaly detection accuracy in financial transactions.\nCreated and orchestrated ML pipelines for various predictive analytics tasks, integrating them with backend services to support real-time decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Engineered and optimized backend services using **Java** and **Node.js** (NestJS, Express) for a high-performance e-commerce platform, achieving **99.9%** uptime and minimal latency across critical modules like checkout, cart, and order fulfillment.\nDesigned responsive and dynamic frontend applications utilizing **Vue** (3), coupled with HTML5 and CSS, leading to a **30%** increase in user engagement and streamlined mobile experiences.\nImplemented database solutions with **SQL** and **NoSQL** systems, including **PostgreSQL** and **MongoDB**, ensuring efficient data storage and retrieval for high-volume transactions and enabling rapid data access under load.\nLeveraged **Cloud Platforms** such as **AWS** and **GCP** for scalable application deployment and data management, ensuring high availability and effective disaster recovery procedures.\nDeveloped APIs with **REST** and **GraphQL** to facilitate seamless interactions between the frontend and backend services, reducing client-side data fetch times by **20%**.\nUtilized **Spring Boot** to create microservices architecture, enhancing application modularity and allowing independent scaling of services to handle traffic surges of up to **5,000** concurrent users.\nImplemented **Docker** for containerization to streamline development workflows and improve the deployment process, reducing release cycles by **25%**.\nIncorporated secure authentication with **OAuth 2.0** and role-based access control (RBAC) for safeguarding user data and ensuring compliance with GDPR standards across all services.\nEmployed serverless computing for specific functionalities to optimize costs and enhance service response times, providing an efficient, flexible backend architecture.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, JavaScript, Python\ng\n**Backend Frameworks:**\n\tSpring Boot, FastAPI, Flask, Django, Node\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS\n\n**API Technologies:**\n\tREST, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Serverless Computing\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL, NoSQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}