{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Electrical Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a dedicated Senior Electrical Engineer, I bring exceptional problem-solving abilities and analytical skills honed over 8 years in the field. My expertise lies in **Electrical System Design**, **Power Distribution**, and ensuring compliance with **NEC codes** and **IEC codes**. I have successfully contributed to projects involving **Direct Liquid Cooling** systems and gained experience in achieving **Tier certification** across various deployments.\nIn previous roles, I've demonstrated strong troubleshooting capabilities and a commitment to collaboration with cross-functional teams. My effective communication skills have enabled me to present complex technical ideas clearly and work closely with stakeholders to achieve project goals.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Electrical Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Led the design and implementation of **Electrical System Design** for healthcare and financial platforms ensuring compliance with **NEC codes** and **IEC codes**.\nDeveloped efficient **Power Distribution** systems that support scalable and fault-tolerant architectures, enhancing operational reliability and performance ratings by **30%**.\nUtilized effective **Direct Liquid Cooling** strategies to maintain optimal operational temperatures in high-performance data centers, significantly reducing cooling costs by **20%**.\nAchieved **Tier certification** in compliance with industry standards by applying robust engineering principles and meticulous documentation.\nFacilitated troubleshooting sessions, utilizing strong **analytical skills** to diagnose and resolve system issues, leading to a **40%** reduction in downtime.\nFostered collaboration across multidisciplinary teams to enhance project outcomes, utilizing advanced **communication skills** to articulate complex technical concepts to non-technical stakeholders.\nExhibited exceptional problem-solving capabilities by developing innovative solutions for electrical load balancing and redundancy.\nConducted thorough reviews of electrical systems to identify areas for improvement and implemented corrective actions, resulting in a **25%** increase in operational efficiency.\nEstablished best practices for the integration of renewable energy sources, optimizing energy usage and promoting sustainability initiatives within the organization.\nMentored junior engineers, enhancing team capabilities and ensuring the adherence to safety standards and regulations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and developed electrical systems with a focus on electrical system design to ensure optimal power distribution and efficiency in high-performance environments.\nPerformed rigorous compliance checks with **NEC codes** and **IEC codes**, ensuring all electrical designs meet industry standards and safety regulations.\nUtilized problem-solving and analytical skills to troubleshoot complex electrical issues in power distribution systems, achieving a **30%** reduction in downtime.\nCollaborated effectively with cross-functional teams to implement direct liquid cooling systems, enhancing system reliability and performance in mission-critical applications.\nConducted assessments for tier certification of electrical systems, ensuring they meet the required standards for operational readiness.\nCommunicated technical concepts clearly to stakeholders, enhancing collaboration with engineering and operations teams for superior project outcomes.\nLeveraged expertise in electrical system design to contribute to innovative solutions, incorporating advanced technologies that are cost-effective and sustainable."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized **electrical system designs** for efficient **power distribution** with a focus on **Tier certification** compliance and assessment of **NEC** and **IEC codes**.\nValidated the implementation of **direct liquid cooling** solutions in **9** major projects, enhancing thermal management efficiency by **30%**.\nConducted rigorous **problem-solving** initiatives related to system failures which reduced downtime by **25%**, demonstrating strong **analytical skills** and **troubleshooting** capabilities.\nFacilitated cross-functional **collaboration** with project teams to streamline the integration of electrical systems, ensuring adherence to industry standards and improving project delivery timelines by **15%**.\nDeveloped comprehensive documentation and presented technical insights to stakeholders, showcasing excellent **communication skills** and simplifying complex concepts for varied audiences.\nParticipated in review meetings, actively contributing to project strategies and solutions, demonstrating a commitment to continuous improvement and innovation in electrical engineering practices."
    }
  ],
  "skills": "**Other**\n\tElectrical System Design, Power Distribution, Direct Liquid Cooling, Tier certification, NEC codes, IEC codes, Problem-solving, Analytical skills, Troubleshooting, Communication skills, Collaboration skills\n\n**Frameworks & Technologies**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Artificial Intelligence & Machine Learning**\n\tMLflow, Airflow, Kubeflow\n\n**DevOps & Cloud**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Databases & Caching**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**CI/CD & Infrastructure as Code**\n\tTerraform, Ansible, Helm, Docker Compose"
}