{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Engineer specializing in Account Lifecycle and Access Management (IAM)",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a proficient Software Engineer specializing in Account Lifecycle and Access Management (IAM), I bring 8 years of experience in full-stack development and a strong command of **JavaScript**, **TypeScript**, **Node.js**, as well as extensive expertise in **AWS**. My proficiency includes designing and implementing scalable solutions with **REST APIs**, **SQL**, and **NoSQL** databases, ensuring robust access control mechanisms using **OAuth**, **OpenID Connect**, **SAML 2.0**, **SCIM**, **LDAP**, and **Active Directory**.\n\nI possess a solid background in cloud architecture utilizing **AWS CloudFormation** and **Terraform** for infrastructure as code, and orchestration tools such as **Kubernetes** to manage containerized applications. My hands-on experience in developing secure solutions aligns with compliance standards including RBAC, ABAC, and ReBAC, essential for IAM functionalities. I also leverage best practices in CI/CD automation to streamline deployment processes.\n\nCombined with my strengths in microservices architecture and proficiency in frameworks like **React** and **Next.js**, I have successfully led teams to develop enterprise-grade platforms that integrate AI/ML capabilities for advanced operational efficiencies.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer specializing in Account Lifecycle and Access Management (IAM)",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained secure **REST APIs** and microservices using **Node.js** and **TypeScript**, ensuring compliance with **OAuth**, **OpenID Connect**, and **SAML 2.0** protocols to facilitate seamless access management.\n- Architected solutions leveraging **AWS** services for account lifecycle management, utilizing **Kubernetes** for orchestration and **Terraform** for infrastructure as code (IaC) deployments, achieving a 30% reduction in deployment time.\n- Implemented database solutions using both **SQL** (PostgreSQL) and **NoSQL** (MongoDB) to store and manage user identity and access data, optimizing query performance by 25%.\n- Collaborated with product teams to design and implement role-based access control (RBAC), attribute-based access control (ABAC), and relationship-based access control (ReBAC) strategies, enhancing security measures across applications.\n- Led the integration of **AWS CloudFormation** and **Terraform** for managing cloud infrastructure, resulting in decreased environment provisioning time from 5 days to just 1 day.\n- Enhanced the security framework by embedding advanced authentication mechanisms using **LDAP** and **Active Directory**, ensuring secure user authentication and authorization.\n- Developed automated testing and CI/CD pipelines using **GitHub Actions** and **CircleCI**, which increased deployment frequency by 40% with improved security checks during the software lifecycle.\n- Conducted code reviews and implemented security scanning tools to address vulnerabilities, effectively reducing the number of identified security issues by 50% across applications.\n- Provided technical leadership and mentoring to junior engineers in adopting best practices for **JavaScript** and **TypeScript** development, fostering a collaborative engineering environment.\n- Continuously monitored and optimized application performance, achieving a response time under 200 milliseconds for high-traffic access management services."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to develop scalable software solutions in the role of Software Engineer specializing in Account Lifecycle and Access Management (IAM).\nImplemented secure authentication and authorization protocols including **OAuth**, **OpenID Connect**, **SAML 2.0**, and **SCIM** to enhance access management, aligning with industry standards.\nLeveraged **Node.js** frameworks (specifically **Express**) to create RESTful APIs that integrated seamlessly with various **NoSQL** and **SQL** databases, facilitating efficient data storage and retrieval for user accounts.\nConfigured and managed cloud infrastructure using **AWS**, including **AWS CloudFormation** and **Terraform**, achieving a **30%** improvement in deployment time for new environments and services.\nDesigned and deployed containerized applications using **Kubernetes**, ensuring high availability and scalability of IAM services.\nImplemented role-based and attribute-based access control (RBAC and ABAC) strategies to ensure data security and compliance across platforms, improving organizational workflow adaptability by **25%**.\nParticipated in cross-functional teams to define, design, and deliver projects, contributing to a **15%** reduction in response time for user access requests through system optimization and enhancement initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and optimized secure, scalable backend services using **Node.js (Express)** and **JavaScript**, ensuring seamless management of account lifecycles and access control for over **100,000** users.\n• Engineered REST APIs in accordance with **OAuth 2.0**, **OpenID Connect**, and **SAML 2.0** standards for identity management, facilitating secure authentication and authorization flows for multiple applications.\n• Implemented roles and permissions via **RBAC** and **ABAC** strategies, streamlining access management and ensuring compliance with regulatory requirements.\n• Administered database solutions using both **SQL** (PostgreSQL) and **NoSQL** (MongoDB, Cassandra) technologies for efficient data storage and retrieval, supporting a transaction load of over **1 million** queries per day.\n• Deployed infrastructure and application resources using **Terraform** and **AWS CloudFormation**, enhancing deployment processes with automated setups and reducing provisioning time by **30%**.\n• Integrated **Kubernetes** for container orchestration, achieving high availability and facilitating continuous deployment cycles.\n• Developed frontend features with **TypeScript** and **React**, enhancing user interfaces to deliver intuitive account management experiences, tailored for over **10 million** annual users.\n• Established secure connections across services by embedding **LDAP** and **Active Directory** integrations, maintaining user authentication seamlessly across platforms.\n• Created comprehensive logging and monitoring solutions utilizing **JSON** structures to ensure application visibility and operational integrity, thereby enhancing troubleshooting capabilities by **40%**.\n• Spearheaded user access audits and compliance checkpoints to maintain a secure IAM environment, resulting in a **20%** reduction in security incidents year over year."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST APIs, OAuth, OpenID Connect, JWT, SAML 2.0, SCIM, LDAP, Active Directory, RBAC, ABAC, ReBAC\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, NoSQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS CloudFormation\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot"
}