{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Java Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-oriented Senior Java Engineer with 8 years of comprehensive experience in designing and implementing high-performance SaaS solutions. Proficient in **Java**, **Spring**, and modern frameworks such as **JavaScript**, **TypeScript**, and **ReactJS**. Expert in microservices architecture, event-driven systems, and building scalable applications optimized for the cloud. Significant hands-on experience in CI/CD pipelines, DevOps practices, and containerization technologies.\n\nSkilled in developing user-friendly UI/UX interfaces, utilizing advanced state management techniques like **Redux** and **Context API**. In my previous roles, I have successfully integrated systems that adhere to strict compliance standards including HIPAA and PCI DSS, while also implementing best practices in system architecture and security. My background also encompasses full-stack development, allowing me to bring a holistic view to projects, ensuring smooth collaboration between frontend and backend teams.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed high-quality, scalable applications using **Java**, **Spring**, and **JavaScript** to meet business requirements in a fast-paced environment.\n• Architected and deployed **microservices**-based solutions and **SaaS** products, ensuring event-driven and domain-driven design principles.\n• Implemented robust **DevOps** practices, establishing **CI/CD** pipelines with tools like GitHub Actions, Azure DevOps, and CircleCI for smooth deployment processes across multiple environments.\n• Enhanced user experience by collaborating with UI/UX teams and implementing responsive front-end solutions using **TypeScript**, **ReactJS**, and **Redux** for state management.\n• Designed and optimized architecture for scalable systems by leveraging **containerization** technologies such as **Docker** and **Kubernetes** for improved application deployment and management.\n• Actively participated in the design and execution of test strategies using frameworks such as **Jest**, **Cypress**, and **Postman**, achieving a test coverage of over **90%** across applications.\n• Utilized project management methodologies to ensure timely completion of developments, tracking progress with metrics and ensuring compliance with best practices in software development.\n• Collaborated with cross-functional teams to align on objectives and resolve issues quickly, improving the overall system performance by **30%**.\n• Delivered ongoing product enhancements and support, maintaining an uptime of **99.9%**, and a response time of under **200ms** for all microservice endpoints.\n• Monitored application performance and reliability, utilizing analytics tools to ensure operational KPIs are met and exceeded for both user engagement and transaction efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring** frameworks to design and implement microservices architecture, enhancing scalability and maintainability for high-traffic financial platforms.\nFocused on developing robust APIs that facilitate seamless integration with front-end technologies including **JavaScript** and **TypeScript**, ensuring responsive functionalities in user interfaces.\nLed the front-end development of user-centric applications using **ReactJS** (version 18) and **Redux**, enhancing user experience for financial dashboards while maintaining efficient state management.\nImplemented event-driven solutions leveraging **Microservices** and **Event-driven** architecture, which streamlined real-time processing of transactions and improved operational efficiency.\nApplied **DevOps** strategies to establish effective **CI/CD** pipelines for continuous deployment and integration, reducing release time by **30%** and increasing overall productivity.\nOversaw ongoing containerization efforts using **Docker**, ensuring consistent environments across development, testing, and production.\nParticipated in creating SaaS platforms designed to cater to the evolving needs of financial services, improving service delivery and customer satisfaction.\nIntegrated state-of-the-art **UI/UX** practices into product design, leading to a **25%** increase in user engagement metrics.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Engineered and optimized microservices architecture for scalable SaaS applications, utilizing **Java** and **Spring** frameworks, ensuring high availability and efficient resource management across various services.\nDeveloped interactive and user-friendly frontend applications with **ReactJS**, leveraging **TypeScript** and **Redux** for state management, delivering seamless UI/UX experiences in compliance with modern standards.\nImplemented CI/CD pipelines and automated deployment strategies using **DevOps** tools, enhancing development efficiency and deployment accuracy, achieving a rollout success rate of **95%**.\nDeveloped event-driven architectures and integrated **event-driven** communication using technologies like RabbitMQ, enabling real-time data processing and responsiveness of microservices deployed in a cloud environment.\nLeveraged **JavaScript** and **Context API** for managing global state in applications, contributing to improved overall application performance and maintainability by **30%**.\nApplied domain-driven design principles to promote maintainable and scalable codebases, aligning development efforts with business goals and reducing time-to-market for new features by **25%**.\nConducted regular containerization of applications using technologies like Docker, optimizing resource usage and significantly reducing dependency conflicts during deployments.\nDesigned and implemented secured API services adhering to **JWT** standards for authentication, ensuring role-based access control for users and enhancing data protection measures across applications.\nCollaborated with cross-functional teams to define requirements and deliver innovative solutions aligning with project goals and customer needs, facilitating a **15%** increase in user engagement post-launch.\nEngaged in continuous integration practices, ensuring code quality through unit testing and static analysis, thereby reducing overall code defects by **20%**."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, Java, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django, Spring\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular, ReactJS, Redux, Context API\n\n **API Technologies:** \n\tMicroservices, Event-driven, Domain-driven\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Containerization\n\n **Cloud & Infrastructure:** \n\tTerraform, Ansible, Helm, Docker Compose, Cloud\n\n **Other:** \n\tSaaS, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, UI/UX, MLflow, Airflow, Kubeflow",
  "apply_company": "AgileEngine"
}