{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Platform Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior Platform Engineer with 8+ years of expertise, I excel in designing and implementing robust, scalable cloud-based solutions utilizing **AWS**, **Azure**, and **GCP**. Proficient in modern programming languages including **Java** and **C#**, I leverage my experience in **JavaScript**, **TypeScript**, and **MySQL** along with **NoSQL** database systems to create high-performance applications. I have a strong emphasis on **Kubernetes** for container orchestration, **CI/CD** pipelines using **GitLab CI** and **Jenkins**, and observability tools such as **Prometheus**, **Grafana**, and **New Relic** to ensure operational excellence. My capabilities also extend to utilizing design patterns and **OOP** principles, along with a solid understanding of message queues and testing strategies. By fostering effective leadership and communication, I am committed to delivering innovative solutions while enhancing team collaboration and problem-solving initiatives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Platform Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and maintained robust cloud-native solutions utilizing **AWS**, **Azure**, and **GCP** to ensure high availability and seamless scalability of the platform.\n- Implemented CI/CD pipelines using **GitLab CI**, **Jenkins**, and **Azure DevOps** for automated testing and deployment, leading to a **40% reduction** in release cycles.\n- Designed and executed observability strategies leveraging **Prometheus**, **Grafana**, and **New Relic** for enhanced monitoring and performance metrics, achieving **99.9% uptime**.\n- Led a cross-functional team of **10+ engineers**, fostering strong communication and collaboration to promote best practices in **OOP**, **Design Patterns**, and cloud development.\n- Architected solutions leveraging **Kubernetes** for microservices orchestration, enhancing the deployment speed and reliability of platform updates by **30%**.\n- Championed the integration of messaging systems such as **RabbitMQ** and **Kafka** for event-driven architecture, facilitating asynchronous processing of tasks and data handling across microservices.\n- Ensured adherence to data compliance standards including **SOC 2**, **ISO 27001**, and **PCI DSS** by embedding security practices into the development lifecycle.\n- Conducted performance and regression testing using various frameworks, including **unittest** and **Selenium**, leading to measurable improvements in system reliability.\n- Mentored junior engineers on fundamental concepts in **Java**, **C#**, **JavaScript**, and **TypeScript**, enhancing the team's technical proficiency and problem-solving skills.\n- Optimized database interactions with **MySQL** and various **NoSQL** solutions, resulting in faster response times and improved data retrieval efficiency, with a **20% increase** in query performance.\n- Implemented robust security protocols for multi-tenant applications, ensuring secure data transactions and user authentication mechanisms across cloud services."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Spearheaded the migration and development of a scalable backend architecture utilizing **Java**, **C#**, **JavaScript**, **TypeScript**, and cloud services like **AWS** and **Azure**, resulting in a **40%** improvement in system performance while streamlining integrations.\n• Designed and implemented robust **RESTful** APIs ensuring secure data communication and high availability with **MySQL** and **NoSQL** databases, achieving a **99.9%** uptime.\n• Devised efficient CI/CD pipelines using **Gitlab CI** and **Jenkins**, automating deployment processes and enhancing the delivery cycle by **30%**.\n• Implemented observability frameworks using **Prometheus**, **Grafana**, and **New Relic** for real-time performance monitoring and logging, identifying bottlenecks with a precision of **95%**.\n• Led a team in applying Object-Oriented Programming (OOP) principles and Design Patterns to improve code maintainability and scalability for microservices, facilitating a **50%** decrease in code complexity.\n• Facilitated communications across teams to gather requirements and drive effective problem-solving strategies, boosting cross-functional collaboration by **25%**.\n• Developed and deployed applications on **Kubernetes**, ensuring seamless scaling for high-demand services and availability with rolling updates.\n• Integrated messaging solutions such as **Kafka** and **RabbitMQ** to enhance event-driven architectures and improve data flow efficiency across services.\n• Conducted comprehensive testing strategies with automated frameworks to ensure software reliability, achieving a **100%** quality assurance in code integrity and performance.\n• Mentored junior engineers, fostering leadership and effective communication skills within the team, enhancing overall productivity and team morale."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and maintained robust, scalable backend components using **Java**, **C#**, and **Python**, contributing to a 30% improvement in system performance and processing speed across deployment environments.\nImplemented **CI/CD** practices using **Gitlab CI**, **Jenkins**, and **Azure DevOps**, reducing deployment times by up to **50%**, ensuring seamless and reliable delivery of features.\nEngineered efficient and secure APIs leveraging **JavaScript**, **TypeScript**, and **RESTful** principles for high-volume applications, tailored critical business workflows leading to a **25%** increase in user retention.\nOptimized database management across **MySQL** and **NoSQL** platforms, enhancing data fetching capabilities by **40%** while utilizing cloud services like **AWS** and **GCP** for scalable storage solutions.\nDesigned and implemented observability solutions with **Prometheus** and **Grafana**, ensuring real-time monitoring of system health and performance metrics, reducing incident response times by **20%**.\nLeveraged **Kubernetes** for container orchestration, enhancing application deployment efficiency and maintaining high availability in **cloud** environments.\nExecuted performance and load testing strategies using **Apache JMeter** and **New Relic**, identifying bottlenecks and ensuring optimal application performance under peak load conditions.\nUtilized message queue systems like **RabbitMQ** for asynchronous communication between microservices, streamlining data processing and response times across systems.\nCollaborated with cross-functional teams employing leadership and communication skills to deliver integrated solutions that met client requirements and exceeded performance expectations.\nMentored junior engineers on OOP principles and design patterns, fostering a culture of knowledge sharing and continuous improvement within the team."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, Java, C#, JavaScript, TypeScript \n\n **Backend Frameworks:** \n\tFastAPI, Django, Flask, Spring Boot \n\n **Frontend Frameworks:** \n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor \n\n **API Technologies:** \n\tREST & gRPC APIs \n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP \n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, NoSQL \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, CI/CD \n\n **Cloud & Infrastructure:** \n\tCloud, AWS, Azure \n\n **Other:** \n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Observability, Prometheus, Grafana, New Relic, OOP, Design Patterns, Message Queues, Testing, Problem-solving, Leadership, Communication ",
  "apply_company": "Plan A Technologies"
}