{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Python Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Python Engineer with 8 years of full-stack development experience specializing in building scalable solutions leveraging **Python**, **Flask**, **FastAPI**, **Django**, and databases such as **MongoDB** and **PostgreSQL**. Proficient in implementing **CI/CD** pipelines and containerization strategies using **Docker** and **Kubernetes**, while maintaining code quality through peer **Code Review** and solid **Testing Principles**.\n\nExperienced in cloud environments, particularly with **AWS**, utilizing tools like **Terraform** for infrastructure management. I excel in performance monitoring and logging utilizing **Grafana**, **ELK Stack**, and **New Relic**, ensuring reliability and transparency in systems deployed in production.\n\nI possess strong technical communication skills, adept at collaboration through tools like **JIRA**, **Confluence**, **Slack**, and **Miro**. My background also includes hands-on experience in implementing event-driven architectures and messaging systems with **RabbitMQ** and **Redis**. I have led teams towards achieving compliance standards and have a passion for mentoring newer engineers, fostering a culture of continuous learning and improvement.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained scalable backend solutions using **Python** and **FastAPI**, ensuring optimal performance and compliance with industry standards.\n- Implemented CI/CD pipelines utilizing **Docker**, **Kubernetes**, and **AWS**, effectively automating deployment processes and enhancing delivery efficiency by **30%**.\n- Designed relational databases with **PostgreSQL** and implemented NoSQL solutions with **MongoDB** to manage and optimize large-scale data retrieval and storage.\n- Collaborated closely with cross-functional teams using tools like **JIRA** and **Confluence** to streamline project management and enhance communication, reducing project timelines by **25%**.\n- Led the integration of advanced search capabilities using **ElasticSearch**, enabling efficient querying across vast datasets.\n- Executed rigorous testing strategies employing frameworks such as **pytest**, ensuring high-quality code through unit, integration, and E2E testing.\n- Participated in code reviews and established best practices for software development to maintain code quality and facilitate knowledge sharing within the team.\n- Automated monitoring and logging with tools like **Grafana** and **New Relic** for real-time performance tracking, reducing incident response times by **40%**.\n- Engaged in plans to migrate legacy applications to microservices architecture with cloud infrastructure on **AWS**, enhancing scalability and resilience to load fluctuations."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** (FastAPI, Django, Flask) to develop and modernize financial applications, enhancing scalability and maintainability for high-volume transaction systems.\nImplemented CI/CD practices using **Git** and **Docker**, ensuring seamless deployment and continuous integration of new features across various environments.\nDesigned and optimized data storage solutions with **MongoDB** and **PostgreSQL**, achieving a **40%** improvement in query performance for financial data access.\nArchitected microservices using **Kubernetes** for container orchestration and **AWS** for cloud hosting, which facilitated the launch of **3** major financial platforms in **2023**.\nIntegrated messaging systems like **RabbitMQ** and **Redis** to establish effective communication channels between services, improving transaction processing times by **25%**.\nEstablished monitoring and logging solutions with **Grafana** and the **ELK Stack**, allowing for real-time insights and performance tracking, which reduced downtime incidents by **30%**.\nReviewed and enforced testing principles across the codebase, resulting in a **15%** reduction in critical bugs post-deployment by fostering a culture of code review.\nCollaborated effectively using tools like **JIRA**, **Confluence**, and **Slack** for project management and team communication, enhancing workflow efficiency and transparency in project updates.\n\n\nOriginal strengths include:\n- Developed real-time transaction monitoring and analytics dashboards, using **React**, **D3.js**, and embedded **Power BI** for actionable insights.\n- Built ETL pipelines with **Apache Airflow** and **Azure Data Factory** for efficient data ingestion from various sources.\n- Implemented AI/ML-powered fraud detection systems leveraging **scikit-learn** and **XGBoost**, improving the identification of suspicious activities in banking systems.\n- Created ML pipelines for credit scoring and transaction classification using **MLflow** and **Airflow**, contributing to data-driven decision-making in financial contexts."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Django** to design and optimize backend services for a global e-commerce platform, ensuring high availability and scalability, achieving up to **99.9%** uptime across key modules like checkout and order fulfillment.\nImplemented **Flask** and **FastAPI** frameworks to build fast and efficient APIs, enhancing the development process by utilizing CI/CD practices integrated with **Docker** and **Kubernetes** for seamless deployments.\nLeveraged **MongoDB** and **PostgreSQL** for data management, ensuring fault-tolerant data access that supported **10,000+** concurrent users while maintaining performance through effective caching strategies in **Redis**.\nApplied **RabbitMQ** as a messaging broker for real-time features, enabling responsive order updates and dynamic inventory tracking, resulting in improved customer engagement and satisfaction scores by **30%**.\nAdopted CI/CD practices utilizing **Git**, **Terraform**, and **AWS** services, streamlining deployment cycles and reducing time-to-market for new features by **40%**.\nEstablished robust testing principles and conducted code reviews to maintain quality assurance, fostering a collaborative environment using tools like **JIRA**, **Confluence**, and **Slack** for agile project management.\nDesigned secure payment processing workflows using **Stripe** and **PayPal**, implementing tokenization to ensure PCI compliance and safeguard sensitive customer information.\nEngaged in effective communication across cross-functional teams to enhance project delivery, utilizing **Miro** for ideation and design, and ensuring alignment of project goals to improve team productivity.\nImplemented observability and monitoring with **Grafana** and the **ELK Stack** to track application performance, achieving a **25%** reduction in downtime incidents through proactive issue resolution."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFlask, FastAPI, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS\n\n**Databases:**\n\tMongoDB, PostgreSQL\n\n**DevOps:**\n\tDocker, Kubernetes, CI/CD, Terraform\n\n**Cloud & Infrastructure:**\n\tAWS\n\n**Other:**\n\tGit, Vault, Grafana, ELK Stack, New Relic, RabbitMQ, JIRA, Confluence, Slack, Miro, Testing Principles, Code Review, Communication",
  "apply_company": "YouGov"
}