{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Security Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Dynamic Senior Security Engineer with 8 years of experience in **cloud security**, **SOC operations**, and **threat hunting**. Proficient in using **SIEM** tools such as **Splunk** and **Rapid7**, alongside **EDR** solutions, **DLP** strategies, and **CSPM** frameworks to enhance security postures. Adept in deploying security measures on **Azure** and **AWS**, and experienced with **Microsoft Sentinel** for threat detection and compliance monitoring.\n\nSkilled at **scripting** in **Python** and **PowerShell** to automate repetitive tasks and streamline security processes. My background in full-stack development has equipped me with a strong understanding of application security, ensuring robust and secure solutions. I also excel in communication and collaboration across teams, ensuring adherence to compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2. Excited about leveraging my technical prowess and experience in implementing cybersecurity best practices to safeguard critical infrastructure.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented robust **cloud security** measures, ensuring compliance with industry regulations and standards, such as HIPAA and PCI DSS.\nDeveloped and maintained incident response strategies within **SOC operations**, effectively managing **SIEM** tools like **Splunk** and **Azure Sentinel** for real-time security monitoring and threat detection.\nConducted thorough **threat hunting** activities to identify potential vulnerabilities and mitigate security risks within healthcare and financial platforms, leveraging tools like **Rapid7** and **EDR** solutions.\nDesigned and executed **DLP** strategies to protect sensitive data across various platforms, utilizing Python and **PowerShell** for scripting automations and reporting.\nCollaboratively integrated **CSPM** practices within cloud environments, enhancing security posture across **AWS** and **Azure** infrastructures.\nCommunicated security reporting and updates effectively to stakeholders, ensuring transparency and understanding of security initiatives.\nAssisted in the engineering of secure and scalable applications by implementing CI/CD pipelines and conducting vulnerability assessments across development and production environments.\nDeveloped documentation and training materials to promote security awareness and best practices among engineering teams.\nEvaluated and recommended third-party tools and frameworks for enhancing security capabilities in line with organizational requirements and industry changes.\nCoordinated with cross-functional teams to strategize and implement security features across applications and systems, ensuring defense in depth and comprehensive coverage of **threat** vectors."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Executed cloud security measures by integrating **Azure** and **AWS** services into the existing infrastructure, ensuring compliance and data protection across financial platforms.\nConducted proactive threat hunting initiatives utilizing **SIEM** tools such as **Splunk** and **Rapid7**, improving incident detection and response times by **30%**.\nDeveloped and implemented **DLP (Data Loss Prevention)** strategies to safeguard sensitive financial information, reducing data exfiltration incidents by **40%**.\nCollaborated with SOC operations to enhance security monitoring processes, leveraging scripts written in **Python** and **PowerShell** to automate routine security tasks, resulting in a **25%** increase in operational efficiency.\nEngaged in continuous communication with cross-functional teams, translating complex security protocols into understandable language, thereby facilitating effective collaboration for resolving security incidents.\nArchitected and maintained robust end-to-end solutions involving **EDR** tools for endpoint security, deploying and customizing solutions to meet the unique needs of financial systems while ensuring real-time protection against threats.\n\nStrengthened incident response capabilities by creating comprehensive incident management plans and training materials, allowing teams to respond to security breaches effectively and promptly.\nAnalyzed and implemented security best practices, monitoring compliance with regulatory standards, leading to a **100%** pass rate during audits."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted **threat hunting** operations utilizing **SIEM** tools like **Splunk** and **Rapid7** to identify anomalies and security vulnerabilities within e-commerce infrastructure, ensuring robust **cloud security** and compliance.\nImplemented and maintained **EDR** solutions and **DLP** strategies to mitigate data loss and enhance incident response times across **AWS** and **Azure** platforms.\nSpearheaded security incident responses and collaborated with SOC operations, leading investigations that reduced incident resolution time by **30%** through expert **communication** and analysis.\nDeveloped and executed **scripting** solutions in **Python** and **PowerShell** for automating security monitoring tasks, improving system checks and response workflows by **50%**.\nEvaluated and upgraded security best practices, leveraging **CSPM** tools for enhanced compliance and risk management across cloud environments, ensuring seamless integration with existing security protocols.\nProvided training sessions on cybersecurity awareness and best practices to over **100** team members, fostering a culture of security-first thinking across the organization.\nUtilized **Azure Sentinel** for streamlined threat detection and response, enhancing real-time monitoring capabilities and reducing average detection time to **12 seconds**.\nConducted regular security audits and vulnerability assessments, implementing remediation strategies that resulted in a **40%** decrease in identified deficiencies year-over-year.\nEstablished strong relationships with stakeholders to communicate security health, impact assessments, and project updates regularly, ensuring transparency and alignment with organizational goals."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, PowerShell, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n **Cloud & Infrastructure:**\n\tCloud security, CSPM, security tools (SOC operations, threat hunting, SIEM, EDR, DLP, Splunk, Rapid7, Sentinel)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot, communication",
  "apply_company": "Novanta Inc."
}