{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Software Engineer with over 13 years of experience specializing in high-performance application development. Proficient in **JavaScript**, **TypeScript**, **Python**, and **Node.js**, demonstrating extensive experience with **React**, **Express**, and **REST API** technologies. Skilled in cloud computing with hands-on experience in deploying applications on **AWS** and utilizing **Terraform** for infrastructure as code.\n\nExpert in modern development practices including microservices architecture, CI/CD pipelines with **GitHub Actions** and **Jenkins**, and container orchestration with **Kubernetes**. Proven track record of building robust backend systems using **PostgreSQL** and **Redis**, ensuring data integrity and performance. \n\nPossesses strong analytical skills in compliance-driven environments, ensuring adherence to industry standards such as HIPAA and PCI DSS. A proactive collaborator with a strong background in developing solutions that leverage AI/ML technologies to enhance user experiences in both healthcare and financial sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed high-performance applications utilizing **TypeScript**, **Node.js**, and **Python** to deliver seamless functionality and efficient data processing.\n• Designed and implemented REST APIs using **Express**, ensuring optimal communication between front-end and back-end systems.\n• Utilized **PostgreSQL** and **Redis** for robust data storage and caching solutions to enhance application performance and reliability.\n• Deployed applications on **AWS** leveraging **Kubernetes** for container orchestration, achieving improved scalability and fault tolerance.\n• Created CI/CD pipelines utilizing **GitHub Actions** to automate deployment processes, resulting in a **50%** reduction in release time.\n• Collaborated in building a microservices architecture, streamlining application development and maintenance across multiple projects, leading to a **30%** increase in team productivity.\n• Implemented comprehensive unit and integration tests to maintain high-quality standards using frameworks such as Jest and PyTest, ensuring **95%** test coverage.\n• Conducted performance tuning on applications using **Nginx** as a reverse proxy to improve network speed and resource usage.\n• Spearheaded the migration project transitioning legacy codebases to modern frameworks, significantly reducing technical debt by **40%**.\n• Actively participated in agile methodologies to ensure timely delivery of software features and enhancements, resulting in increased client satisfaction ratings by **20%**.\n• Engaged in regular code reviews and mentoring of junior engineers, facilitating knowledge sharing and enhancement of team skills in **JavaScript** and **React**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed scalable web applications using **TypeScript** and **Node.js** (Express), enhancing user functionality and engagement across financial platforms.\n• Implemented REST APIs with **Python** (FastAPI, Django) to facilitate efficient and secure data exchange among microservices, improving system interoperability.\n• Leveraged **PostgreSQL** and **Redis** for optimal data storage and caching strategies, enhancing application performance by **30%**.\n• Created responsive user interfaces with **React** (18) and **Python**, utilizing **Tailwind CSS** for design consistency across all devices, resulting in a **25%** increase in user satisfaction.\n• Managed deployment and orchestration of microservices using **Kubernetes** and **Docker**, ensuring high-availability and resilience of applications in production.\n• Automated CI/CD pipelines with **GitHub Actions** and **Jenkins** for streamlined deployment workflows, reducing deployment time by **40%**.\n• Developed and executed comprehensive unit and integration tests, leveraging frameworks like **Jest** and **Mocha**, improving code coverage by **50%**.\n• Collaborated with cross-functional teams to gather requirements and deliver solutions that aligned with business objectives, resulting in a **15%** increase in stakeholder satisfaction.\n• Contributed to codebase optimization efforts, refactoring legacy code for better maintainability and performance, particularly in the transaction processing module."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable backend services utilizing **Node.js** (including **Express**) and **Python** (working with FastAPI and Django), achieving a performance improvement of **30%** in request handling and minimizing latency during peak loads.\n• Implemented robust and efficient **REST APIs** for smooth integration with frontend applications and third-party services, employing **PostgreSQL** for database management, distributed across **3** availability zones in **AWS**.\n• Enhancing code quality and deployment processes by utilizing **GitHub Actions** and **Jenkins**, achieving a deployment success rate of **99%** while reducing build times by **20%**.\n• Applied containerization and orchestration techniques using **Kubernetes**, leading to improved application scalability and maintainability across **5** microservices.\n• Assisted in architecting secure cloud infrastructure leveraging **Terraform** facilitating Infrastructure as Code (IaC) practices, ensuring consistency in **AWS** environments across development and production.\n• Crafted user-friendly interfaces with **React** (version **18**) and **TypeScript**, focusing on performance optimizations that resulted in faster loading times, enhancing user engagement by **15%**.\n• Applied comprehensive caching strategies using **Redis** for swift data retrieval, resulting in a **40%** decrease in database load for frequently accessed information.\n• Conducted code reviews and mentorship for junior developers, promoting consistent coding standards and technology best practices across the team, positively influencing team performance metrics by **25%**.\n• Collaborated with cross-functional teams to integrate payment solutions like **Stripe** and **PayPal**, ensuring compliance with PCI standards, facilitating secure transactions for over **10,000** users per month.\n• Developed automated testing frameworks ensuring consistent quality assurance processes that decreased bug reports post-deployment by **35%**, significantly improving customer satisfaction."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript, Java, Kotlin, Swift, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js, Express\n\n **Frontend Frameworks:**\n\tReact\n\n **API Technologies:**\n\tREST API\n\n **Serverless and Cloud Functions:**\n\tAWS, AWS Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Terraform, Ansible\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Glia"
}