{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a results-oriented Senior Sales Engineer with extensive experience in technical presentation and customer engagement, I excel in delivering value-driven presentations that resonate with clients. My proficiency in communicating complex technical concepts ensures clarity and fosters stronger relationships. Leveraging my background in internet security, I possess a deep understanding of security protocols including **HTTP**, **SMTP**, **DNS**, and hold certifications like **Security+**, **SSCP**, **CISSP**, and **CEH**. \n\nWith 8 years as a Full Stack Developer, I have cultivated a strong technical foundation using modern technologies such as **JavaScript**, **TypeScript**, **Python**, and **Flutter**. My expertise encompasses **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, backed by cloud proficiency in **Azure** and **AWS**. I have successfully led the development of enterprise-grade platforms integrating AI/ML capabilities for predictive analytics and real-time data processing, grounded in robust systems architecture, CI/CD automation, and adherence to compliance standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Engaged with customers to deliver value-driven presentations on healthcare and financial platform solutions, showcasing expertise in **sales engineering** and **customer engagement**.\nConducted technical presentations to demonstrate the capabilities of **modern app architectures** and **cloud services**, ensuring alignment with client needs and industry standards.\nUtilized **communication** skills to effectively translate complex technical information into actionable insights for clients during product discovery sessions, identifying key requirements and challenges.\nFacilitated discovery conversations with clients, leveraging **discovery skills** to uncover underlying needs and map solutions using **full-stack technologies** such as **TypeScript**, **Python (FastAPI)**, and **Node.js**.\nMaintained Internet security by integrating protocols like **HTTP**, **SMTP**, and **DNS**, adhering to compliance regulations to safeguard health and financial data.\nPresented security solutions aligned with **Security+**, **SSCP**, **CISSP**, and **CEH** standards, reinforcing the importance of robust security frameworks in healthcare and fintech applications.\nIntegrated advanced features into client-facing applications using data visualization tools like **D3.js** and **Power BI**, demonstrating the impact of insights on business decisions.\nLed discussions on system architecture decisions, leveraging **Kubernetes** and **AWS Lambda** to assure clients of high availability and fault-tolerant designs.\nCollaborated with data scientists to provide insights into AI integrations, enhancing customer interactions with intelligent features and predictive alerts.\nEstablished test strategies focusing on performance using **Jest** and **Cypress**, ensuring both web and API services are robust and reliable throughout the sales engineering process."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted technical presentations to showcase solutions that align with customer requirements, utilizing strong communication skills to engage clients and articulate value propositions related to financial technology solutions.\nUtilized discovery skills to deeply understand customer needs, fostering relationships that lead to successful implementation of complex systems for financial services.\nProficiently demonstrated an understanding of internet security protocols including **HTTP**, **SMTP**, and **DNS**, ensuring that all proposed solutions comply with industry standards and best practices.\nCollaborated with cross-functional teams to craft value-driven presentations, integrating insights from financial transactions to highlight the business impact of our technical solutions.\nActively engaged with clients to gather feedback and iterate on solutions, leveraging knowledge of security certifications such as **Security+**, **SSCP**, **CISSP**, and **CEH** to enhance trust in our offerings.\nLed technical discussions that bridged customer needs and technical capabilities, focusing on the adaptable qualities of our software and its scalability in handling **1,000,000** transactions per month."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized strong **communication** and **customer engagement** skills to deliver impactful, **value-driven presentations**, ensuring alignment of technical solutions with client needs and sales objectives.\nConducted in-depth client **discovery skills** sessions to accurately assess customer challenges, effectively tailoring solutions using industry best practices and our technical capabilities.\nMaintained a keen understanding of **internet security** principles, applying frameworks such as **Security+**, **SSCP**, **CISSP**, and **CEH** to ensure compliance and safeguard customer data throughout the sales process.\nExecuted technical presentations that effectively conveyed complex information on **HTTP**, **SMTP**, and **DNS** protocols, enhancing client confidence in product offerings and technical competencies.\nCollaborated cross-functionally with engineering teams to support the design and optimization of backend services, focusing on solutions that demonstrate scalability and resilience within sales contexts.\nShowcased the technical stack of our products, emphasizing integrations with cloud services and other third-party tools to strengthen customer understanding of our solution’s value.\nAchieved a **30%** increase in customer engagement and retention by leveraging tailored demonstrations that incorporate real-world use cases and technical functionalities.\nSpearheaded initiatives that improved sales training materials with technical insights, resulting in a **25%** reduction in ramp-up time for new sales engineers.\nAnalyzed customer feedback and market trends, contributing to the ongoing development of presentation strategies that resonate with diverse audiences for a **15%** increase in conversion rates."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tHTTP, SMTP, DNS\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tsales engineering, technical presentation, communication, customer engagement, value-driven presentations, discovery skills, internet security, Security+, SSCP, CISSP, CEH, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow",
  "apply_company": "Abnormal AI"
}