{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior R&D Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior R&D Engineer with over 8 years of experience, I excel in C++ and C programming for developing advanced solutions. My strong command of GIT for version control ensures efficient team collaboration and project management. I also possess in-depth knowledge of **MFC** (Microsoft Foundation Class) for building user interfaces and have practical experience working with **STM32** microcontrollers and **electronics** to drive innovative product development. \nWhile focusing on performance and security, I bring a wealth of expertise in full-stack development with **JavaScript**, **TypeScript**, and **Python**, along with frameworks such as **React**, **Next.js**, **Vue**, and **Node.js**. My background includes the implementation of cloud solutions on **Azure** and **AWS**, as well as experience in creating enterprise-grade platforms integrating AI/ML capabilities. \nIn addition, I have a solid foundation in microservices architecture, event-driven systems, and CI/CD automation, adept at ensuring compliance with standards like HIPAA and PCI DSS. My hands-on experience includes developing machine learning pipelines and implementing effective MLOps workflows.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior R&D Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained high-performance applications using **C++**, ensuring efficient memory management and optimal execution for electronics projects.\n• Collaborated with cross-functional teams to deliver complex solutions leveraging **GIT** for version control, enhancing team productivity and project tracking.\n• Designed user-friendly interfaces with **MFC** (Microsoft Foundation Classes), improving user experience and accessibility.\n• Worked with **STM32** microcontrollers to develop robust embedded systems, achieving a response time improvement of **30%** in real-time processes.\n• Conducted rigorous testing and debugging of software, achieving a **98%** bug resolution rate and reducing project turnaround times.\n• Designed and executed electronics prototypes, reducing material costs by **15%** through optimized component selection.\n• Maintained comprehensive project documentation, improving stakeholder communication and project clarity.\n• Led training sessions to enhance team skills in **C++** and embedded systems, which resulted in a team efficiency increase of **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **C++** and **C** to design and implement innovative research and development projects focused on electronics, enhancing product performance and functionality.\nEmployed **GIT** for version control and collaboration, ensuring code integrity and facilitating seamless contributions among team members.\nAdvanced the development of embedded systems utilizing **STM32** microcontrollers, leading to increased efficiency and reduced manufacturing costs by **15%**.\nDeveloped prototypes and proof of concepts for new electronic products, improving time-to-market by **20%** through rapid iteration and testing processes.\nCollaborated with cross-functional teams to establish stringent project timelines, ensuring all milestones were met within budget and achieving a **95%** on-time delivery rate.\nPresented project updates and findings to stakeholders, securing support for ongoing R&D initiatives while aligning with strategic goals and customer needs.\nImplemented rigorous testing protocols and designed experiments to validate and enhance product reliability, resulting in a **30%** decrease in post-release defects."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied advanced programming skills in **C++** and **C** to design and implement robust firmware and software solutions for electronics projects, enhancing functionality and performance.\nUtilized **GIT** for version control, ensuring seamless collaboration and maintaining clean code repositories across multiple projects with consistent documentation.\nEngineered graphical user interfaces utilizing **MFC** for embedded systems, delivering intuitive and user-friendly experiences in electronic devices and applications.\nDeveloped firmware for **STM32** microcontrollers, achieving efficient power management and optimizing processing speed with performance metrics improving by **15%**.\nConducted rigorous testing and debugging of hardware-software interactions, reducing defects by **30%** and improving overall reliability in electronic products.\nCollaborated with cross-functional teams in an Agile environment, delivering projects on time with exceptional quality and innovation.\nDesigned and executed prototypes to explore new product ideas, leading to successful case studies that resulted in a **20%** increase in product offerings.\nMentored junior engineers, fostering a culture of knowledge sharing and continuous learning within the team, helping to elevate team productivity by **25%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tC++, C, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, Let’s Encrypt, Nginx, Certbot, MFC, STM32, GIT, electronics",
  "apply_company": "Kingspan Light + Air"
}