{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Python Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Python Engineer with 8 years of experience, I am proficient in **Python**, **Django**, and **AWS** while leveraging my strong skills in **CI/CD** practices and **API** design and development. I excel in building efficient and scalable applications, utilizing modern architecture principles and automation strategies to enhance productivity and ensure observability. My leadership abilities extend to mentoring junior developers and facilitating Agile methodologies to streamline project workflows.\nI have a proven track record in developing high-performance solutions in healthcare and financial sectors, integrating key technologies, including **React**, **Node.js**, and **FastAPI**. My deep cloud expertise spans **Azure**, enabling me to create secure applications compliant with industry standards like HIPAA and PCI DSS. I have hands-on experience in developing and deploying machine learning models in production, implementing MLOps workflows using tools such as **MLflow** and **Kubeflow**, thus ensuring the delivery of intelligent and automated solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Django** to architect and develop scalable, full-stack solutions focusing on automated structures, enhancing observability through comprehensive logging and monitoring, ensuring best practices in **API** development.\nImplemented CI/CD practices using **AWS** tools for streamlined deployment processes, achieving a **30%** reduction in deployment time and errors.\nAutomated workflows to improve efficiency and reduce manual intervention, enhancing team productivity and project delivery times by **25%**.\nLed architectural discussions to ensure robust design principles were adhered to, fostering a culture of mentorship and knowledge sharing within the team, aiding junior engineers in skill development and understanding.\nContributed to Agile methodologies, participating in sprint planning, daily stand-ups, and retrospectives to enhance team collaboration and project transparency.\nEnsured high availability and fault tolerance in services by integrating observability tools, while guiding the team on best practices for design and implementation.\nCollaborated with cross-functional teams to identify opportunities for automation that could reduce operational overhead and enhance system performance.\nParticipated in the design and implementation of solutions that optimized application performance and maintainability, resulting in a **40%** improvement in system response times.\nEngaged in code reviews and contributed to improving the team's coding standards and practices, increasing overall code quality."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Django** to implement robust APIs for high-performance financial applications, ensuring seamless integration and communication across systems.\nConducted architecture design and development of cloud services using **AWS**, focusing on scalable solutions that enhance system reliability and performance metrics by **30%**.\nLed CI/CD pipeline automation efforts using tools such as Jenkins and GitHub Actions, optimizing the deployment process and reducing deployment time by **50%**.\nImplemented observability strategies by integrating monitoring tools, enhancing system visibility and reducing downtime by reacting to anomalies within **5 minutes**.\nFacilitated agile development methodologies, mentoring team members on best practices, resulting in a **20%** increase in team productivity and collaboration.\nEngaged in the design and implementation of an event-driven architecture, integrating with services like Kafka and RabbitMQ to improve system responsiveness.\nDesigned and orchestrated ETL processes leveraging **Python** and **Apache Airflow**, facilitating data ingestion from internal and external sources with over **1 million transactions daily**.\nStreamlined automation processes across the application lifecycle by employing tools such as **Directus** for content management, further enhancing operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services for a global e-commerce platform using **Python** (Django), ensuring high availability and scalability across key modules like checkout and order fulfillment.\n\nLeveraged **AWS** services to enhance application performance and reliability in deployment and scaling.\n\nImplemented CI/CD practices to streamline deployments and automate testing pipelines, reducing release cadence to **2 weeks**.\n\nArchitected robust RESTful APIs, ensuring efficient communication between frontend and backend components with an emphasis on performance and security.\n\nConducted architecture reviews and implemented observability tools, improving system monitoring and incident response time by **30%**.\n\nMentored junior developers in best coding practices and effective use of **Python** frameworks, fostering a collaborative and high-performing team environment.\n\nUtilized **Agile** methodologies to enhance project delivery by creating iterative development practices, increasing team productivity by **20%**.\n\nDeveloped automated testing scripts for unit and integration tests, improving code coverage to **85%** and ensuring high code quality.\n\nParticipated in the architectural decision-making process, contributing to the design of scalable and maintainable systems based on performance metrics and future growth projections."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython\n\n **Backend Frameworks:** \n\tDjango\n\n **Frontend Frameworks:** \n\tJavaScript/TypeScript (React, Vue, Angular)\n\n **API Technologies:** \n\tAPI\n\n **Serverless and Cloud Functions:** \n\tAWS\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tCI/CD, Docker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:** \n\tTerraform, Ansible, Helm, Docker Compose, Azure (App Services, Blob, SQL)\n\n **Other:** \n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Directus, Automation, Architecture, Observability, Mentorship, Agile",
  "apply_company": "Paychex"
}