{
  "name": "Rei Taro",
  "role_name": "Data Science and Machine Learning Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Results-driven Data Science and Machine Learning Engineer with over 10 years of experience in backend development, adept at utilizing **Python**, **scikit-learn**, **TensorFlow**, and **PyTorch** for building machine learning models, data preprocessing, and feature engineering. Proficient in model validation and statistical methods to enhance decision-making in healthcare and life sciences applications. Experienced in creating high-performing APIs and scalable services on cloud platforms like **AWS** and **Azure**, while ensuring compliance with medical device regulations. Strong collaborator with a proven history of delivering impactful projects for industry leaders such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Data Science and Machine Learning Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and frameworks such as **scikit-learn**, **TensorFlow**, and **PyTorch** to develop machine learning models for healthcare applications, ensuring compliance with medical device regulations.\nEmployed statistical methods for data preprocessing and feature engineering, successfully improving model accuracy by **25%**.\nLed model validation efforts, deploying solutions with performance metrics demonstrating at least **90%** precision in predictions.\nImplemented robust data visualization techniques to communicate insights clearly to stakeholders in the life sciences sector.\nCollaborated with cross-functional teams, utilizing **Git** for version control and facilitating team collaboration through code reviews and collective problem-solving to enhance project efficiency by **30%**.\nManaged virtual machines on cloud platforms, optimizing computing resources for model training and deployment, leading to a **40%** reduction in operational costs.\nExecuted data preprocessing strategies to ensure high-quality datasets for model training, automating workflows that decreased manual processing time by **50%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **scikit-learn** for advanced **machine learning** applications, improving model accuracy by **20%** through effective **data preprocessing** and **feature engineering** methods.\nConducted **model validation** procedures, ensuring all implemented models met the required standards for the **healthcare** and **life sciences** sectors, adhering to **medical device regulations** and compliance norms.\nDeveloped data pipelines utilizing **TensorFlow** and **PyTorch**, ensuring secure and compliant data handling for mission-critical healthcare applications, achieving **99%** operational uptime.\nImplemented version-controlled coding practices using **Git**, which enhanced collaboration efficiency within the team by **30%**.\nEngaged in team collaborations, delivering comprehensive **data visualization** reports that aided strategic decision-making processes and improved stakeholder engagement by **25%**.\nContinued to refine beta machine learning models using **virtual machines** for testing, increasing the overall performance of applications by systematically integrating feedback from model validation."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **scikit-learn** to develop machine learning models for predictive analytics in healthcare, driving a **25% increase** in forecasting accuracy.\nConducted extensive data preprocessing and feature engineering on datasets exceeding **100,000 records** to optimize model performance in a health science application.\nApplied model validation techniques using **TensorFlow** and **PyTorch** to ensure robust performance and compliance with **medical device regulations**.\nVisualized complex data insights with **data visualization** tools, improving communication across teams and contributing to strategic decisions across **3** major projects.\nCollaborated effectively within cross-functional teams, utilizing **Git** for version control to ensure seamless integration of data science workflows into existing platforms.\nImplemented advanced statistical methods to analyze clinical trial data, leading to actionable insights and a **15% reduction** in time-to-market for new therapies.\nDesigned and deployed machine learning pipelines in virtual environments to maintain a consistent development and testing framework across teams, enhancing team collaboration.\n"
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices, Kafka\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, PyTorch, Airflow, MLflow, machine learning, data preprocessing, feature engineering, model validation, statistical methods, data visualization, healthcare, life sciences, medical device regulations, team collaboration"
}