{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Rust Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a proficient Rust Developer with over 8 years of experience, I bring extensive expertise in software development with a strong emphasis on **Rust**, **Golang**, and **TypeScript**. My background includes building back-end systems and composable services, leveraging modern frameworks and strategies to deliver high-performance solutions. I am adept at implementing effective authentication and authorization mechanisms, ensuring robust identity and access management protocols.\nI possess a solid foundation in modern development practices, including code review processes and collaborative work environments. My strong adaptability and curiosity drive continuous learning, enhancing my ability to mentor junior developers and foster a culture of growth within teams. My project experience spans various sectors, underlining my commitment to delivering secure and compliant applications while cultivating innovative solutions that meet complex business needs.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Rust Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** and **Rust** to construct efficient back-end systems, ensuring robust authentication and authorization mechanisms with **OAuth** and **OIDC** for identity and access management.\nDesigned composable services within a full-stack application architecture, leveraging modern frameworks like **React** and **Node.js**, resulting in a seamless user experience.\nEngaged in continuous learning and adapted to evolving technologies, with a focus on **WASM** to enhance application performance and scalability.\nConducted thorough code reviews to maintain high standards in software development, mentoring junior developers in best practices and effective coding techniques.\nCollaborated closely with cross-functional teams to foster a culture of curiosity and adaptability, ensuring knowledge sharing and successful project outcomes.\nArchitected and developed scalable healthcare and financial platforms compliant with HIPAA and GDPR standards, incorporating advanced tech stacks including **FastAPI** and **Kubernetes** (version 1.21).\nImplemented CI/CD pipelines using tools such as **GitHub Actions** and **CircleCI**, achieving a deployment frequency of up to **10 times per week** and significantly reducing lead time for changes.\nLed projects for deploying microservices with **Docker** and serverless architectures on **AWS Lambda**, enabling a reduction in server costs by at least **30%**.\nDesigned and maintained cloud-native data solutions utilizing **PostgreSQL** and **MongoDB**, focusing on optimizing data ingestion workflows that handled up to **1 million records per day**.\nDeveloped enterprise-level visualization tools with **D3.js** and **Power BI**, leading to enhanced visibility into transaction analytics and operational KPIs for stakeholders."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented back-end systems by utilizing **Rust** and **Golang**, ensuring robust performance and efficient coding practices to meet the demands of high-volume transaction environments.\nDesigned composable services within a microservices architecture, integrating **TypeScript** to enhance system modularity and maintainability.\nEmphasized identity and access management by implementing **OAuth** and **OIDC** protocols for secure user authentication and authorization measures.\nFostered a culture of collaboration and continuous learning through regular code reviews and mentoring sessions, ensuring team adaptability and development best practices.\nConducted thorough software development cycles to effectively integrate new features and optimize existing functionalities, significantly increasing operational efficiency.\nLuxuriated in adaptability and curiosity-driven exploration of emerging technologies, ensuring the integration of cutting-edge solutions into the development process.\nContributed to the overall improvement of code quality and team performance by actively participating in pair programming and knowledge sharing sessions.\nAssisted in the development of financial platforms utilizing **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), resulting in a **30%** increase in system throughput for financial transactions.\nOptimized real-time analytics dashboards, allowing operations teams to monitor activities and detect anomalies in financial transactions, resulting in a **50%** decrease in issue resolution time."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed backend systems using **Rust** and **Golang**, ensuring robust and scalable architecture for composable services in high-traffic applications.\nImplemented secure authentication and authorization mechanisms using **OAuth** and **OIDC**, providing secure access management for over **10,000** daily active users.\nCollaborated with cross-functional teams to establish best practices in software development, resulting in a **30%** improvement in code quality through rigorous code review processes.\nMentored junior developers, fostering a culture of **continuous learning** and curiosity, which increased team productivity by **25%**.\nEngineered microservices architecture leading to a **40%** reduction in deployment times, enhancing overall service responsiveness and uptime.\nApplied **TypeScript** for type safety across front-end and back-end codebases, minimizing runtime errors and enhancing maintainability.\nUtilized **WASM** for optimizing compute-heavy processes, resulting in performance improvements of **50%** for specific modules.\nParticipated actively in special projects focusing on adaptability and collaboration, leading to multiple successful feature rollouts throughout the development cycle.\nDesigned workflows for identity and access management to ensure compliance with GDPR and enhance user data protection.\nConducted frequent knowledge-sharing sessions to address emerging technologies and practices, promoting a forward-thinking team environment."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Rust, Golang, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth, OIDC, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Certbot\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, authentication, authorization, identity and access management, curiosity, adaptability, continuous learning, code review, collaboration, mentoring"
}