{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Frontend Engineer with 8 years of experience, I specialize in utilizing **React**, **TypeScript**, **Next.js**, and **TailwindCSS** to create high-performance, user-centric applications. My proficiency extends to building and integrating **RESTful APIs** and **GraphQL** services, ensuring seamless data flow and optimized performance. I am skilled in implementing CI/CD practices to enhance development efficiency and achieve clean, maintainable code. My testing expertise with tools like **Jest**, **React Testing Library**, and **Playwright** ensures quality assurance and application reliability.\n\nAlongside my frontend focus, I have a solid foundation in full-stack development, with a strong grasp of **Python**, **Node.js**, and cloud technologies such as **AWS** and **Azure**. I bring experience in compliance across various standards including HIPAA and PCI DSS, and I have led the development of platforms that leverage AI/ML for enriching user experience. This combination of frontend specialization and versatile technical expertise allows me to drive innovative solutions in agile environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed dynamic and responsive user interfaces using **React** and **Next.js** to ensure performance optimization and adherence to **WCAG** standards for accessibility.\n- Collaborated in building RESTful APIs and integrating GraphQL for efficient data management, enhancing the overall performance of applications.\n- Established CI/CD pipelines utilizing modern tools to streamline deployment processes, ensuring clean code and rapid delivery cycles.\n- Implemented testing strategies using **Jest** and **React Testing Library** to enhance code quality through effective unit and integration tests.\n- Employed **TailwindCSS** for crafting responsive designs, aligning with the project's visual requirements and maintaining consistency across various platforms.\n- Conducted performance optimization initiatives leading to a **30%** decrease in load times and improved user satisfaction scores.\n- Led code reviews and mentorship sessions to promote clean coding practices within the team, resulting in a **25%** increase in team productivity.\n- Participated in cross-functional teams to define project requirements and translate them into functional specifications, collaborating closely with backend engineers and product managers.\n- Integrated modern CMS solutions to streamline content delivery and management, enhancing user experience and content accessibility.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed dynamic, user-focused front-end applications using **React (18)**, **Next.js**, and **TypeScript**, applying **TailwindCSS** to create responsive and performant user interfaces for financial dashboards and admin portals.\nUtilized **Jest** and **React Testing Library** to implement comprehensive testing strategies ensuring high code quality and maintainability in all front-end solutions.\nDesigned and built reusable UI components adhering to **WCAG** standards, enhancing accessibility for diverse user bases and maintaining a focus on clean and efficient code practices.\nCollaborated in an Agile environment, employing **RESTful APIs** and **GraphQL** for seamless data integration across services and improving overall application performance and user experience.\nDeveloped performance optimization strategies that improved load times by **30%** and reduced latency in data rendering.\nImplemented **CI/CD** pipelines to streamline deployment processes, resulting in a **50%** reduction in release time and improved team productivity.\nWorked closely with cross-functional teams to gather requirements and translate them into functional front-end designs that align with user needs and business goals."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed high-performance frontend applications utilizing **React (18)**, **Next.js**, and **TypeScript**, ensuring fast, responsive user experiences tailored for e-commerce.\n- Implemented clean code practices and performance optimization techniques, significantly enhancing application load times and user engagement metrics.\n- Created responsive, SEO-friendly e-commerce UIs using **TailwindCSS**, optimized for mobile-first engagement and compliance with **WCAG 2.1** standards.\n- Designed and integrated robust **RESTful APIs** and **GraphQL** services to facilitate seamless communication between frontend and backend components, ensuring scalability in high traffic scenarios.\n- Conducted thorough testing and quality assurance using **Jest**, **React Testing Library**, and **Playwright**, ensuring that key features maintain functionality through each version.\n- Engaged in continuous integration and continuous deployment (**CI/CD**) practices, automating deployment workflows to streamline application updates and iterations.\n- Collaborated with cross-functional teams to establish a content management system (**CMS**) that supports dynamic product updates and efficient content handling.\n- Mentored junior developers on best practices in frontend development, focusing on code quality and performance optimization strategies.\n- Set key performance indicators to monitor application effectiveness and usability, achieving a user satisfaction score improvement by **25%** over three months."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, TailwindCSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tRESTful APIs, GraphQL\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMachine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Jest, React Testing Library, Playwright, CMS, WCAG, CI/CD, clean code, performance optimization",
  "apply_company": "Marketer.com"
}