{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a skilled Software Developer with 8 years of experience, I excel in utilizing **.NET**, **C#**, and **MS SQL Server** to drive the development of high-performance applications, particularly within the healthcare and financial sectors. My proficiency in **T-SQL**, **Angular**, and **CSS** enables me to create intuitive user interfaces and effective web services while adhering to best practices in **REST APIs** and service-oriented architecture.\nFurthermore, I possess extensive experience with cloud technologies, particularly **Azure**, and maintain a strong focus on **CI/CD** and **DevOps** methodologies to streamline development processes. My technical toolbox includes modern frameworks and tools such as **JavaScript**, **Visual Studio**, and design patterns aimed at producing scalable and maintainable software solutions.\nIn addition, I have a proven track record in building applications compliant with industry standards, effectively integrating my foundational knowledge in microservices architecture and automation practices.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained robust **.NET** applications using **C#** in alignment with service-oriented architecture principles, ensuring high performance and scalability.\nImplemented complex **Web Services** and **REST APIs** for seamless integration with third-party tools and internal systems, optimizing data retrieval and manipulation with **MS SQL Server** leveraging **T-SQL**.\nExecuted CI/CD processes using tools such as Azure DevOps and GitHub Actions, facilitating automated deployments and testing across development and production environments.\nUtilized **Angular**, **CSS**, and **JavaScript** to create dynamic and responsive user interfaces, ensuring an engaging user experience across diverse web platforms.\nApplied effective **Design Patterns** to enhance application structure and maintainability, resulting in a significant reduction in technical debt over a period of **12 months**.\nCollaborated closely with cross-functional teams to deliver projects within scope and deadlines, consistently achieving at least a **95%** on-time delivery rate.\nEmployed Agile methodologies, participating in daily scrums, sprint planning, and retrospectives, enhancing team collaboration efficiency by **25%**.\nMaintained and optimized existing applications for performance, reducing load times by up to **30%**, therefore increasing overall user satisfaction.\nAssisted in establishing enterprise-level **DevOps** practices, enhancing the development workflow and ensuring high-quality outputs through rigorous testing and code review processes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Designed and developed robust **.NET** applications, focusing on scalability and performance for high-volume transaction processing systems.\n- Implemented REST APIs and Web Services to facilitate seamless communication between client and server-side applications, leveraging **C#** and **ASP.NET Core**.\n- Developed and optimized SQL queries and stored procedures using **MS SQL Server** and **T-SQL**, achieving a **30%** improvement in data retrieval efficiency.\n- Enhanced user interfaces with **Angular** and **CSS**, creating responsive and intuitive designs to improve user engagement across financial platforms.\n- Leveraged **Azure** cloud services to deploy applications and manage resources, utilizing **CI/CD** pipelines to streamline development and deployment processes, reducing release times by **40%**.\n- Collaborated with cross-functional teams to implement **DevOps** practices, supporting continuous integration and delivery with tools like **Visual Studio**.\n- Maintained best practices in **Service-oriented Architecture** and **Design Patterns**, contributing to code quality and maintainability.\n- Delivered high-quality software solutions by conducting thorough testing and debugging processes, enhancing overall application reliability by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained robust web services and REST APIs using **.NET**, **C#**, and **MS SQL Server**, ensuring high performance and secure data transactions across applications.\nEngineered responsive, interactive UI components leveraging **Angular** and **CSS** to deliver seamless user experiences aligned with modern design patterns and best practices.\nUtilized **T-SQL** for efficient database queries and optimization, handling datasets exceeding **1 million records** to ensure timely data access and processing.\nImplemented CI/CD pipelines and DevOps practices within **Azure**, streamlining release processes and enhancing deployment speeds by up to **30%**.\nApplied principles of Service-oriented Architecture (SOA) to ensure modular design, allowing for easier integration of **Web Services** and third-party APIs within the e-commerce ecosystem.\nEmployed **Visual Studio** for development and debugging, achieving code quality and reducing the frequency of production bugs by **20%** through effective design patterns and testing methodologies.\nCollaborated in an Agile environment, participating in daily scrums and sprint planning, improving delivery timelines by ensuring alignment on project goals and timelines.\nExecuted deployment strategies using **Azure's CI/CD** capabilities, enhancing system reliability and uptime to achieve a target availability of **99.9%**.\nMentored junior developers in best coding practices and design patterns, fostering a collaborative coding environment and increasing team efficiency by **15%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, .NET, Python, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tAngular, React, Vue, CSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tREST APIs, Web Services, Service-oriented Architecture\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, MS SQL Server, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Visual Studio, Design Patterns"
}