{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in building high-performance applications primarily utilizing **Node.js**, **TypeScript**, and **PostgreSQL**. Proficient in **Angular** and **NestJS**, with expertise in modern testing frameworks such as **Jest**. Demonstrated ability to implement Clean Code principles and Domain-Driven Design (DDD) methodologies in software development, ensuring maintainability and scalability of applications.\nSkilled in deploying cloud solutions using **GCP** and experienced in full stack development practices. A strong advocate for agile methodologies, including **Shape Up** for efficient project management. Developed AI/ML-powered solutions focused on predictive analytics and automation, while adhering to compliance standards like HIPAA and PCI DSS. Proven track record of effective collaboration across teams to deliver complex software projects in dynamic environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable full-stack applications utilizing **Node.js**, **TypeScript**, and **PostgreSQL**, ensuring adherence to Clean Code and Domain-Driven Design (DDD) principles.\n• Created modular and maintainable architectures aligned with Shape Up methodologies, resulting in a **30%** increase in development efficiency.\n• Led the implementation of advanced testing strategies using **Jest** to automate unit and integration tests, achieving **95%** code coverage across critical modules.\n• Collaborated on cloud-based projects using **GCP**, enhancing application performance and reducing downtime by **20%** through optimized deployments.\n• Engaged in code reviews and peer mentoring to promote best practices in software design and development, fostering a culture of continuous improvement.\n• Integrated dynamic front-end frameworks such as Angular to ensure responsive and user-friendly interfaces, boosting user engagement by **15%**.\n• Championed the creation of CI/CD pipelines that improved release cycle times from **2 weeks to 3 days**, leveraging best practices in continuous deployment.\n• Actively participated in cross-functional teams to deliver high-quality projects within tight deadlines while ensuring compliance with industry standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Node.js** (NestJS) and **TypeScript** to develop scalable microservices, enhancing performance for high-volume transactional systems with a focus on **Clean Code** practices and **Domain-Driven Design (DDD)** principles.\nImplemented robust data storage solutions using **PostgreSQL**, ensuring efficient query performance and data integrity in core financial applications.\nDesigned and built user-centric front-end applications utilizing **Angular** 9 and **Redux Toolkit**, delivering intuitive experiences for financial tools and administrative panels.\nCreated automated unit and integration tests using **Jest**, enhancing code quality and minimizing regressions during development cycles.\nEmployed **GCP** services for cloud infrastructure, deploying and managing applications with optimal resource allocation and cost efficiency.\nCollaborated with cross-functional teams employing the **Shape Up** methodology to effectively plan and execute development sprints, aligning with business goals and user needs.\nImplemented real-time data processing and analytics workflows, enabling immediate transaction insights and anomaly detection for operational teams, utilizing modern data visualization frameworks.\nArchitected event-driven systems using **Kafka** and **RabbitMQ** for efficient asynchronous communication across workflows, such as payment processing and regulatory compliance.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed robust backend services using **Node.js (NestJS, Express)** and **TypeScript** for a global e-commerce platform, prioritizing high availability and scalability across critical modules including checkout and order fulfillment.\n• Employed best practices in **Clean Code** and **Domain-Driven Design (DDD)** to enhance maintainability and clarity of codebase.\n• Collaborated in the implementation of **PostgreSQL** for distributed data storage, ensuring efficient data access under high traffic, achieving a performance metric of **99.9% uptime**.\n• Built dynamic user interfaces using **Angular** and optimized them for both web and mobile platforms, significantly enhancing user engagement metrics by over **30%**.\n• Crafted and executed unit tests employing **Jest** to maintain code quality, achieving a coverage goal of **90%** or more.\n• Engaged in cloud-based solutions on **GCP** to streamline deployments and resource management, enhancing overall platform response times by **25%**.\n• Participated in code reviews and pair programming sessions to uphold high standards of software craftsmanship and continuous improvement in line with the **Shape Up** methodology.\n• Implemented modern CI/CD workflows enabling faster and seamless deployments into production environments, drastically reducing deployment time by **50%**."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\nBackend Frameworks:\n\tFastAPI, Flask, Django, NodeJS, NestJS\n\nFrontend Frameworks:\n\tReact, Vue, Angular\n\nAPI Technologies:\n\tClean Code, DDD, Shape Up\n\nServerless and Cloud Functions:\n\tAWS: ECS, Lambda, RDS, S3, GCP\n\nDatabases:\n\tPostgreSQL, MySQL, MongoDB, Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\tAWS, Azure: App Services, Blob Storage, SQL Database\n\nOther:\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Jest",
  "apply_company": "Dougs Compta"
}