{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Security Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a detail-oriented Senior Security Engineer, I bring robust expertise in **Microsoft Defender**, **Microsoft Sentinel**, **Microsoft Purview**, and **PowerShell** to ensure comprehensive cloud security solutions. With 8 years of experience focusing on security protocols compliant with ISO 27001 and SOC2, I effectively manage **EDR** and **SIEM** systems to enhance incident response strategies. My background includes a deep understanding of **NIST** standards and **MITRE ATT&CK** framework, coupled with excellent problem-solving and analytical skills. \nIn addition to security-focused roles, I possess strong development capabilities with **Python** and significant cloud experience across **Azure** and **AWS**. I’ve previously led the design of healthcare and financial applications, integrating compliance standards like HIPAA and FHIR while employing **CI/CD** automation. This blend of security expertise and software development equips me to contribute effectively to your team.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented enterprise-level security measures utilizing **Microsoft Defender**, **Microsoft Sentinel**, and **Microsoft Purview** to ensure compliance with **ISO 27001** and **SOC2** standards.\nConducted incident response operations, employing **PowerShell** for scripting and automation of security processes, thereby enhancing the efficiency of threat detection and remediation.\nDeployed security incident and event management (SIEM) solutions incorporating **EDR** capabilities to monitor and analyze security alerts from user activities across cloud environments.\nDeveloped and maintained security documentation and protocols in alignment with **NIST** and **MITRE ATT&CK** frameworks to establish robust response strategies.\nUtilized **Python** to automate routine security tasks, improving operational efficiency and incident response times by **30%**.\nCollaborated across teams to implement cloud security best practices on **Azure**, focusing on secure configuration, identity access management, and data protection measures across **25+** cloud applications.\nLed training sessions to enhance team communication and problem-solving skills related to security incidents, fostering an analytical mindset among team members.\nMaintained strong communication with stakeholders to ensure consistent updates on security protocols and incident response strategies, enhancing trust and collaboration.\nConducted thorough risk assessments and vulnerability analyses, resulting in an overall decrease in security incidents by **15%** year-over-year.\nEngaged with security audits and assessments to ensure compliance with regulatory standards, documenting findings and enhancing security posture for future audits."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Ensured robust **Cloud Security** measures aligning with standards such as **ISO 27001** and **SOC2** while leveraging **Microsoft Defender**, **Microsoft Sentinel**, and **Microsoft Purview** for incident detection and response.\nDeveloped and maintained powerful **SIEM** solutions, utilizing **PowerShell** to automate processes and improve response times for security incidents, achieving a 30% reduction in average response time.\nConducted **Incident Response** by analyzing security incidents and system alerts, employing the **MITRE ATT&CK** framework to identify, assess, and mitigate threats effectively.\nLeveraged **Python** to script and augment security tools, leading to a 20% improvement in efficiency for security operations and threat hunting initiatives.\nCollaborated with cross-functional teams to enhance security posture by implementing NIST cybersecurity framework principles, addressing vulnerabilities, and providing solutions for potential threats.\nImplemented advanced **EDR** solutions to monitor endpoints, successfully detecting and responding to threats in less than **5** minutes on average.\nFostered an analytical mindset within the team by training staff on emerging threats and best practices, improving overall communication and problem-solving skills, achieving a **15%** increase in team performance metrics.\nDeveloped security awareness programs that educated the organization on security best practices, significantly elevating awareness levels and decreasing phishing susceptibility by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented **Microsoft Defender** and **Microsoft Sentinel** solutions to enhance threat detection and incident response capabilities across the organization, ensuring compliance with **ISO 27001** and **SOC2** standards.\nDeveloped and executed incident response strategies utilizing **EDR** systems to swiftly mitigate security breaches, reducing average response time by **30%** and improving efficiency through established **NIST** frameworks.\nUtilized **PowerShell** scripting to automate security tasks, resulting in a **25%** increase in operational efficiency and streamlining processes for enhanced cloud security across **Azure** environments.\nConducted regular security assessments and implemented security policies adhering to **MITRE ATT&CK** framework, improving overall security posture and ensuring critical vulnerabilities were remediated within **72 hours**.\nEmployed an analytical mindset to create detailed reports on security incidents, collaborating with cross-functional teams to improve security protocols and enhance communication regarding potential threats.\nLed the implementation of **Microsoft Purview** to ensure secure data governance and compliance, facilitating accurate data categorization and management in line with organizational policies.\nProvided training and mentorship to junior team members on incident response protocols and cloud security best practices, fostering a culture of security awareness and problem-solving within the team.\nEstablished clear communication channels with stakeholders to report on security metrics and incident updates, ensuring alignment on security strategy and enhancing transparency across the organization."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython,\n\n **Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango,\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript,\n\tReact,\n\tVue,\n\tAngular,\n\n **API Technologies:**\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3),\n\tAzure (App Services, Blob, SQL),\n\n **Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\n **DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose,\n\n **Cloud & Infrastructure:**\n\tMicrosoft Defender,\n\tMicrosoft Sentinel,\n\tMicrosoft Purview,\n\tPowerShell,\n\tCloud Security,\n\n **Other:**\n\tSIEM,\n\tEDR,\n\tIncident Response,\n\tISO 27001,\n\tSOC2,\n\tNIST,\n\tMITRE ATT&CK,\n\tAnalytical Mindset,\n\tProblem Solving,\n\tCommunication",
  "apply_company": "Netrix Global"
}