{
  "name": "DANIEL HE",
  "role_name": "Senior TypeScript Developer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Results-driven Senior TypeScript Developer with extensive experience in building scalable, user-centric applications using **Angular** and **TypeScript**. Skilled in leveraging **AWS Lambda** for serverless architectures, contributing to improved application performance and reduced operational costs. Demonstrated expertise in the finance sector, enhancing system efficiency through automation and clean code practices. Proven track record in developing frontend solutions and collaborating with cross-functional teams to deliver high-quality software.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Senior TypeScript Developer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Angular** and **TypeScript** to develop dynamic, user-friendly applications for the financial industry, enhancing client satisfaction by 25%.\nImplemented **AWS Lambda** to create serverless functions, reducing operational costs by **40%** and increasing system responsiveness during peak times.\nUtilized **Docker** to containerize applications, ensuring seamless deployment processes across multiple environments, leading to a **50%** reduction in deployment failures.\nCollaborated with cross-functional teams to integrate financial services APIs, increasing transaction speed by **30%** and improving overall system efficiency.\nConducted rigorous code reviews and unit testing, resulting in a **20%** decrease in bug count prior to production releases.\nMaintained a continuous feedback loop with stakeholders to ensure alignment with business objectives, effectively addressing market trends and user needs in the financial sector.\nParticipated in the adoption of Agile methodologies, facilitating bi-weekly sprints and improving project delivery timelines by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Leveraged **Angular** and **TypeScript** to develop dynamic web applications, enhancing user experience and engagement metrics by **30%**.\nCollaborated with cross-functional teams to integrate **AWS Lambda** for serverless architecture, resulting in reduced operational costs by **40%**.\nImplemented financial industry best practices to ensure compliance and security in codebases, improving project delivery timelines by **15%**.\nUtilized advanced debugging and optimization techniques to increase application performance, achieving load times under **2 seconds**.\nParticipated in Agile ceremonies and contributed to a **5-member** development team, fostering a culture of continuous improvement and innovation."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "- Developed responsive web applications using **Angular** and **TypeScript**, enhancing user engagement by over 40%.\n- Implemented serverless architectures with **AWS Lambda**, increasing deployment speed by 50%.\n- Leveraged financial industry knowledge to design features that meet regulatory compliance and improve user experience.\n- Collaborated on REST API integration, ensuring seamless communication between frontend and backend services.\n- Conducted agile development practices, reducing sprint cycles by 20% while achieving higher quality deliverables.\n- Delivered solutions utilizing best practices in performance optimization, leading to a 98% project success rate."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, JavaScript (TypeScript), Go, Python, SQL, Swift, Kotlin\n\n**Backend Frameworks**\n\tSpring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n**Frontend Frameworks**\n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest\n\n**API Technologies**\n\tRESTful API design\n\n**Serverless and Cloud Functions**\n\tAWS Lambda\n\n**Databases**\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n**DevOps**\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline\n\n**Cloud & Infrastructure**\n\tAWS (EKS, RDS, CloudFront, S3), API Gateway, Git, CloudWatch, ELK Stack\n\n**Other**\n\tMicroservices, CI/CD, Infrastructure as Code (IaC), financial industry knowledge, Data structures and algorithms, Agile/Scrum methodologies"
}