{
  "name": "Tomasz Lee",
  "role_name": "Senior Salesforce Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Salesforce Engineer with 9+ years of experience in project management, specializing in the development and implementation of Salesforce solutions. Proficient in **Salesforce**, **Sales Cloud**, **Flow Builder**, **Lightning App Builder**, and **Data Loader**. Demonstrated expertise in leveraging tools like **HubSpot**, **Outreach**, **Gong**, and **ZoomInfo** to optimize customer relationship management (CRM) processes. Known for attention to detail and exceptional communication skills, with a strong ability to collaborate across teams and lead projects to successful outcomes. Proven track record in delivering impactful solutions and enhancing organizational efficiency.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Salesforce Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Salesforce** to develop and manage custom workflows in **Flow Builder**, enhancing operational efficiency across sales teams by 30%.\nDesigned and deployed applications using **Lightning App Builder** to improve end-user experience in **Sales Cloud**, achieving a user satisfaction increase of 40%.\nLeveraged **Data Loader** to import and export large datasets, ensuring data accuracy and integrity across systems, effectively handling over **100,000** records monthly.\nImplemented integrations with third-party tools such as **HubSpot**, **Outreach**, and **Gong**, streamlining communication processes and boosting lead conversion rates by 25%.\nManaged customer relationships using **CRM** best practices, resulting in improved retention rates and client satisfaction.\nLed project management initiatives, ensuring timely delivery of solutions and adherence to project milestones with an 85% on-time completion rate.\nFostered a collaborative environment by maintaining open communication channels among cross-functional teams, improving overall team productivity.\nConducted training sessions for sales personnel on utilizing the **Salesforce** platform effectively, enhancing user adoption by **20%**.\nEmphasized attention to detail in report generation and analysis, enabling data-driven decision-making and improving forecasting accuracy.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **Salesforce** and **Sales Cloud** to design and implement customized solutions, enhancing CRM functionalities and achieving a 15% increase in sales tracking accuracy.\nUtilized **Flow Builder** and **Lightning App Builder** to automate workflows, resulting in a 20% reduction in manual data entry errors and improving process efficiency.\nIntegrated **HubSpot**, **Outreach**, and **Gong** to create seamless communication channels for the sales team, boosting lead conversion rates by 30%.\nEmployed **Data Loader** for efficient data management tasks, optimizing data imports and exports for over 500 client records daily.\nConducted project management activities to deliver high-quality solutions on time, ensuring alignment with stakeholders and adherence to project timelines.\nDeveloped comprehensive documentation and user guides, focusing on attention to detail, which significantly improved user training sessions by 25%.\nMaintained effective communication across cross-functional teams to better understand product requirements and ensure accurate deliverables.\nImplemented CPQ solutions to streamline quoting processes, reducing quote generation time by 40%.\nManaged data integrity and security within **CRM** systems, ensuring compliance with industry standards while overseeing a database of 1,000+ client profiles.\nFacilitated training sessions and mentorship programs for junior developers, fostering a collaborative team environment and enhancing overall productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and customized Salesforce applications using **Salesforce**, specifically utilizing **Sales Cloud** to enhance sales productivity by **20%**.\n• Created automated workflows with **Flow Builder** to streamline business processes and improve efficiency.\n• Designed custom lightning components with **Lightning App Builder**, facilitating seamless user experiences within the CRM.\n• Integrated and synchronized data with third-party tools such as **HubSpot**, **Outreach**, and **Gong** for comprehensive sales insights.\n• Leveraged **Data Loader** to manage bulk data imports and updates within Salesforce, increasing data accuracy and retrieval efficiency.\n• Implemented CPQ solutions to optimize sales quotes and ensure pricing accuracy during transactions.\n• Participated in project management activities, fostering effective communication and collaboration across teams.\n• Maintained high attention to detail while delivering technical documentation, aiding in the onboarding of new users and supporting knowledge transfer.\n• Conducted regular training sessions on Salesforce best practices, ensuring team members are well-versed in CRM functionalities.\n• Engaged in performance reviews and stand-up meetings to align project development with business objectives."
    }
  ],
  "skills": " \n\n**Programming Languages**\n\tJavaScript, TypeScript, C#, Python, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tSalesforce, Sales Cloud, Flow Builder, Lightning App Builder, Data Loader, HubSpot, Outreach, Gong, ZoomInfo, CPQ, CRM\n\n**Other**\n\tMicroservices, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, UX/UI Design, Git, GitHub, Attention to Detail, Communication, Project Management",
  "apply_company": "Commit"
}