{
  "name": "Damian Franciszek Pospiech",
  "role_name": "COBOL Consultant",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "COBOL Consultant with a strong foundation in legacy system patterns and expertise in technical communication. Proven ability to enhance process improvement and quality control measures through detailed documentation and SOP development. Skilled in training content development and applying QA frameworks to maintain the highest standards of technical quality. Possesses a keen attention to detail necessary for effective code annotation and dataset labeling. While my primary focus is on COBOL, I bring valuable insights from 13+ years as a Full Stack Developer, which includes proficiency in modern technologies like **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, as well as hands-on experience in deploying **cloud-native systems** on **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "COBOL Consultant",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted analysis and implemented legacy system patterns using **COBOL**, ensuring compliance with industry standards and best practices. \n- Designed technical documentation for processes and procedures, enhancing quality control and aiding in training content development related to **DB2** and **CICS**. \n- Developed comprehensive SOPs to streamline operations and improve process quality, integrating feedback mechanisms for continuous process improvement. \n- Collaborated with cross-functional teams to establish QA frameworks and technical standards, ensuring adherence to quality metrics across projects. \n- Implemented code annotation practices to enhance code readability and maintainability in **JCL** environments, effectively training team members in the process. \n- Provided training sessions on technical communication and attention to detail, improving team members' capabilities in **VSAM** and legacy systems handling. \n- Led initiatives to enhance dataset labeling processes, ensuring accuracy and consistency in data used for application development. \n- Established best practices for technical standard setting within the organization, facilitating seamless collaboration across teams and systems integration."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **DB2** and **VSAM** for data handling and storage, ensuring efficient database management and retrieval for legacy systems.\nApplied **COBOL** programming principles to maintain and enhance existing applications, following stringent **Quality Control** protocols to ensure accuracy in financial processing.\nConducted **Process Improvement** initiatives that increased operational efficiency by **15%**, focusing on legacy system optimization and modernization strategies.\nDeveloped comprehensive **Technical Documentation** for software enhancements, encapsulating changes in legacy systems using **JCL** and adhering to defined **Technical Standards**.\nTrained junior staff on best practices for using **CICS** and **DB2**, enhancing team skills and ensuring adherence to **SOP Development**.\nImplemented **QA Frameworks** to assess and improve software quality, contributing to reduced defect rates by **20%** in critical financial applications.\nEngaged in **Technical Communication** with stakeholders to elucidate system improvements and provide clarity on technical processes related to legacy systems.\nConducted **Code Annotation** and **Dataset Labeling** practices to enhance code comprehension and review cycles within a **COBOL** environment, ensuring a focus on **Attention to Detail** and maintainability."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and maintained legacy systems in **COBOL**, ensuring optimal performance and reliability through adherence to **Quality Control** standards and **Process Improvement** initiatives.\n- Created detailed **Technical Documentation** for **DB2** databases and **CICS** transaction systems, promoting clarity and uniformity across multiple project phases.\n- Enhanced existing COBOL applications by implementing **VSAM** datasets, which streamlined data access and improved processing times by up to **30%**.\n- Conducted comprehensive **Training Content Development** sessions for team members focusing on **JCL** processes, improving team proficiency and efficiency.\n- Established rigorous **QA Frameworks** for testing COBOL applications, leading to a reduction in defects by **25%** through effective technical standard setting.\n- Implemented structured **SOP Development** protocols that enhanced compliance with internal processes and improved project delivery timelines by **15%**.\n- Actively participated in **Technical Communication** strategies that fostered collaboration across teams, ensuring successful integration of new features into legacy systems.\n- Provided in-depth support for **Code Annotation** and **Dataset Labeling** practices, ensuring clarity in the codebase and compliance with regulatory standards."
    }
  ],
  "skills": "Programming Languages:\n\tCOBOL, JCL, Python, JavaScript/TypeScript\n\nBackend Frameworks:\n\tFastAPI, Flask, Django, CICS\n\nFrontend Frameworks:\n\tReact, Vue, Angular\n\nAPI Technologies:\n\tOAuth2, JWT\n\nServerless and Cloud Functions:\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), DB2, MongoDB (Gaming)\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose, Quality Control\n\nCloud & Infrastructure:\n\tNginx, Let’s Encrypt, Certbot, Legacy System Patterns, Technical Documentation\n\nOther:\n\tProcess Improvement, Training Content Development, SOP Development, QA Frameworks, Technical Standard Setting, Code Annotation, Dataset Labeling, Attention to Detail, Technical Communication"
}