{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Odoo Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Odoo Engineer with 13+ years of experience in **Python** and database management, skilled in data migration and integration techniques. Proficient in conducting business process analysis to optimize systems and deliver effective solutions. Expertise in system administration ensures robust and scalable implementations. Strong background in technical support and documentation skills enhances communication with stakeholders.\nAdditionally, I have experience in full stack development across the healthcare and financial industries, working with **JavaScript**, **TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have a solid foundation in building AI/ML-powered platforms, deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and CI/CD pipelines. A well-rounded professional with a commitment to compliance-driven development aligned with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Odoo Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented robust **Odoo** solutions leveraging **Python**, ensuring seamless integration with existing business processes through effective **Data Migration** and **Integration Techniques**.\nConducted comprehensive **Business Process Analysis** to gather requirements, translating them into **Odoo** modules and features that enhanced operational efficiency by over **30%**.\nManaged and maintained databases with **PostgreSQL** and **MySQL**, implementing advanced **Database Management** practices for data integrity and performance, supporting system users during peak load times with **99.9%** uptime.\nProvided technical support and administration for **Odoo** installations, troubleshooting issues and ensuring optimal system performance and user satisfaction through clear **Documentation Skills**.\nCollaborated with cross-functional teams to define project scope, timeline, and deliverables, enhancing communication flow and project transparency, achieving project milestones **10%** ahead of schedule.\nImplemented extensive testing and validation procedures within the **Odoo** environment, enhancing the reliability of business applications and ensuring compliance with industry standards.\nDeveloped user training materials and conducted workshops to empower staff on new **Odoo** functionalities, improving user adoption rates by **25%**.\nUtilized analytical skills to identify system inefficiencies and implement solutions that optimized business operations and improved data accessibility for stakeholders.\nConnected with technical teams to ensure effective ***system administration*** and support for **Odoo**, fostering collaboration and continuous improvement in service delivery."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive business process analysis to identify and implement Odoo solutions that optimize financial operations, ensuring seamless integration with existing systems.\nManaged data migration projects, successfully transferring over **10,000** records from legacy systems to Odoo, maintaining data integrity and accuracy throughout the process.\nProvided technical support and system administration for Odoo environments, ensuring high availability and performance across all financial platforms using **PostgreSQL** and **Docker**.\nDeveloped and maintained detailed documentation for Odoo customizations and integration techniques, facilitating knowledge transfer and best practices across teams.\nUtilized **Python** for scripting and automation of database management tasks, enhancing operational efficiency and reducing downtime by **30%**.\nCollaborated with cross-functional teams to refine integration techniques between Odoo and other third-party applications, ensuring smooth information flow and process alignment.\nLeveraged strong communication skills to educate stakeholders on Odoo features, resulting in improved user adoption rates by **25%** across financial departments."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** for data migration processes, ensuring seamless transitions and superior data integrity across the **Odoo** platform.\nConducted comprehensive business process analysis to identify areas for improvement, translating findings into actionable tasks to enhance overall system performance.\nImplemented robust database management strategies using **PostgreSQL** and **MongoDB**, ensuring reliable data access and backup solutions while maintaining system efficiency.\nProvided technical support for **Odoo** applications, effectively resolving issues and ensuring continuous operational efficiency for users across various departments.\nCommunicated complex technical information clearly and concisely to stakeholders, fostering collaboration and understanding within teams.\nDocumented processes, system configurations, and workflows to ensure knowledge transfer and compliance with best practices in system administration.\nManaged **Odoo** installations and upgrades, ensuring minimal downtime and robust deployment strategies for enhanced user experience.\nExecuted integration techniques with external systems, streamlining workflows and enhancing data flow across multiple platforms.\nEstablished and maintained a robust testing framework, applying version control with **Git** to manage project changes effectively and reduce deployment risks.\nLed team efforts in optimizing existing business processes within the **Odoo** ecosystem, resulting in performance improvements of up to **40%** in key modules."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Odoo\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tIntegration Techniques\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Database Management\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tSystem Administration\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n\tData Migration, Business Process Analysis, Technical Support, Documentation Skills, Communication Skills",
  "apply_company": "Twine"
}