{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Field Engineer with 13+ years of experience in delivering high-performance solutions in the healthcare sector. Demonstrated expertise in problem-solving and complex system repair, with a strong focus on customer service and preventative maintenance. Adept at diagnosing IT network issues and providing remote support for advanced systems.\n\nProficient in **JavaScript/TypeScript**, **Python**, and **Flutter**, with a solid background in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in building AI/ML-powered platforms designed for predictive analytics, automation, and real-time processing through cloud-native solutions deployed on **AWS** and **Azure**. Experienced in implementing microservices, event-driven architectures, and CI/CD pipelines, aligning solutions with compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2.\n\nStrong background in MLOps, including model training, serving, and orchestration with **MLflow**, **Airflow**, and **Kubeflow**. Committed to enhancing healthcare systems through innovative technology integration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized strong problem-solving skills to diagnose and repair complex systems within healthcare environments, ensuring minimal downtime and efficient operations.\nProvided remote support and preventative maintenance for imaging and electro-engineering systems, enhancing customer service and user experience in medical facilities.\nConducted thorough IT network diagnosis and troubleshooting, applying expertise in healthcare systems to ensure seamless integration of technical solutions.\nCollaborated with cross-functional teams to solve intricate technical issues, demonstrating exceptional customer service and communication skills.\nSupported the development and maintenance of technical equipment, utilizing best practices in remote support to reduce service time by up to **30%**.\nExecuted complex system repairs, effectively reducing customer complaints related to operational inefficiencies by **20%** through dedicated follow-up and support.\nImplemented systematic preventative maintenance programs for imaging technologies, increasing operational reliability rates by **15%** within healthcare settings.\nLed training sessions for staff on new remote support tools and strategies, enhancing team efficiency and understanding of healthcare IT networks."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized strong **problem-solving** skills to diagnose and troubleshoot complex systems within healthcare environments, ensuring swift resolutions to technical issues.\nProvided exceptional **customer service** during remote support sessions, assisting clients with **IT network diagnosis** and offering clear guidance on issues related to healthcare systems.\nPerformed **preventative maintenance** on essential equipment and IT systems, minimizing downtime and enhancing operational efficiency in high-stakes healthcare settings.\nExecuted complex system repairs, leveraging extensive knowledge in **electro-engineering** to ensure the reliability and performance of healthcare devices.\nAnalyzed and optimized imaging systems, improving performance by up to **30%**, thus enhancing diagnostic accuracy in patient care.\nCollaborated with cross-functional teams to implement innovative solutions for field engineering processes, demonstrating a commitment to ongoing improvement and excellence in service delivery.\nManaged multiple field engineering projects simultaneously, ensuring timely completion and adherence to strict healthcare regulations and standards."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Applied advanced **electro-engineering** principles to diagnose and troubleshoot IT networks, ensuring optimal performance and reliability across various healthcare systems.\n• Provided exceptional **customer service** by delivering remote support and on-site solutions for complex system repairs, enhancing user satisfaction by implementing effective problem-solving strategies.\n• Engineered preventative maintenance processes for imaging systems, increasing uptime by **25%** and reducing repair time by **15%** through proactive monitoring and field assessments.\n• Collaborated with healthcare teams to integrate cutting-edge imaging technologies, ensuring rapid deployment of solutions to meet patient care requirements.\n• Spearheaded training sessions for healthcare staff on the use of diagnostic tools and equipment, improving operational efficiency and speeding up system adoption by **30%**.\n• Leveraged remote support technologies to reduce travel time for field service by **40%**, achieving significant cost savings and increasing service accessibility for clients.\n• Developed comprehensive documentation for complex repairs and troubleshooting procedures, resulting in improved knowledge transfer and service continuity for future technicians.\n• Implemented strategies for system upgrades and integrations, maintaining compliance with industry standards and enhancing electronic workflow efficiency across multiple healthcare environments."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tImaging\n\tElectro-engineering\n\tProblem Solving\n\tHealthcare Systems\n\tCustomer Service\n\tIT Network Diagnosis\n\tRemote Support\n\tPreventative Maintenance\n\tComplex System Repair",
  "apply_company": "Philips"
}