{
  "name": "Mariusz Jan Skobel",
  "role_name": "Salesforce Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Salesforce Developer with 10+ years of experience delivering exceptional software solutions within healthcare and finance. Proficient in **Salesforce**, **Apex**, **Lightning**, **LWC**, and adept at integrating **REST API** and **Web Services**. Experienced in utilizing **Mulesoft**, **Boomi**, and **Informatica** to streamline processes and enhance system integration. Demonstrated skills in **HTML**, **CSS**, **JavaScript**, **jQuery**, and **Ajax** for developing responsive and user-friendly interfaces. Skilled in Agile methodologies fostering collaboration and timely project delivery. \nPossesses a robust background in developing cloud-native applications on **Azure** and **AWS**, with hands-on expertise in modern frameworks such as **React**, **Next.js**, and **Vue**. Experienced in leading enterprise platform development that incorporates **AI/ML** for optimized automation and real-time analytics. Strong understanding of microservices architecture, event-driven systems, and CI/CD automation, ensuring compliance with standards like HIPAA, FHIR, PCI DSS, and SOC 2. Committed to building secure, maintainable solutions that generate real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Salesforce Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented robust Salesforce solutions utilizing **Apex**, **Lightning**, and **LWC** to enhance user experiences and streamline processes.\n• Developed and maintained REST API integrations with various web services to facilitate data exchange between **Salesforce** and external platforms, employing **Mulesoft**, **Boomi**, and **Informatica** for seamless connectivity.\n• Collaborated in an Agile development environment to deliver features with a focus on iterative improvement and continuous delivery, integrating user feedback into product enhancements.\n• Created visually appealing user interfaces using **HTML**, **CSS**, **JavaScript**, **jQuery**, and **Ajax**, ensuring adherence to the **SLDS** (Salesforce Lightning Design System) for consistency and usability.\n• Optimized deployment workflows by implementing best practices in **Salesforce DevOps**, ensuring reliable and quick releases to production environments.\n• Trained team members on **Salesforce** best practices and new technologies, fostering a culture of knowledge sharing and continuous learning.\n• Leveraged data integration tools like **Tibco** and **Fusion Middleware** to automate data synchronization and workflow processes, facilitating better reporting and insights.\n• Managed complex workflows and business logic in **Salesforce**, enhancing system performance and user satisfaction, with historical data tracking for over **100** business processes.\n• Conducted code reviews and provided mentorship to junior developers in **Apex**, **Lightning**, and modern front-end technologies to ensure high-quality deliverables.\n• Engaged in troubleshooting and resolving performance issues across Salesforce development environments, ensuring application reliability and user engagement levels exceeding **95%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained robust applications on **Salesforce** platform using **Apex**, enhancing business logic and automating processes to improve efficiency by **30%**.\nUtilized **Lightning Web Components (LWC)** and **Visualforce** to design responsive and user-centric interfaces, resulting in a **25%** increase in user engagement and satisfaction ratings.\nImplemented seamless integration of **REST APIs** and **Web Services** to enable data exchange with external systems through **Mulesoft**, contributing to streamlined workflows and improved data accuracy.\nCreated and optimized custom components with **HTML**, **CSS**, **JavaScript**, and **jQuery** to meet specific client needs, leading to a **15%** reduction in loading times for high-traffic pages.\nLeveraged **Agile methodologies** to ensure continuous delivery and enhancement of **Salesforce** applications, fostering collaboration within cross-functional teams.\nUtilized **Vlocity** to configure industry-specific solutions, improving overall time-to-market for projects by **20%**.\nEmployed **Informatica** and **Boomi** for data integration and transformation processes, ensuring a seamless flow of information between **Salesforce** and various business systems.\nWorked on troubleshooting and resolving complex technical issues within **Fusion Middleware** and **Tibco**, ensuring uninterrupted service and achieving a system uptime of **99.9%**.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented Salesforce solutions using **Apex** and **Lightning Web Components (LWC)**, delivering high-quality, scalable applications to meet client requirements and enhance user experience.\nLeveraged **Salesforce REST API** for seamless integration with external systems, ensuring real-time data synchronization and effective business process automation across platforms.\nDeveloped and maintained Web Services using **Mulesoft** and **Boomi** to connect with various enterprise applications, enhancing operational efficiency and streamlining workflows across an organization.\nCollaborated on agile teams, applying **Agile methodologies** to deliver new features and enhancements in a timely manner, adhering to project timelines and client specifications.\nDesigned intuitive user interfaces using **SLDS**, **HTML5**, **CSS3**, and **JavaScript**, improving the overall usability of Salesforce applications while maintaining accessibility (WCAG 2.1) standards.\nUtilized **Informatica** and **Tibco** for data integration and transformation, enabling comprehensive reporting and data analysis capabilities.\nEngineered custom components and solutions in **Salesforce** for handling complex business requirements, maintaining performance optimization and ensuring scalability for applications with up to **10,000+** active users.\nConducted training sessions for end-users and stakeholders on Salesforce functionalities, resulting in a **25%** increase in user adoption rates across various departments.\nImplemented best practices for security and compliance, including role-based access control (RBAC) and data protection measures, ensuring adherence to GDPR regulations.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Apex\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Lightning, LWC, SLDS, jQuery, Ajax, HTML, CSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tREST API, Web Services, Mulesoft, Boomi, Informatica, Tibco, Fusion Middleware\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Terraform, Ansible, Helm, Docker Compose, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile methodologies"
}