{
  "name": "Rei Taro",
  "role_name": "Senior QA Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior QA Engineer with over 10 years of comprehensive experience in test automation, demonstrating proficiency in **Playwright**, **pytest**, **Selenium**, and various **QA methodologies**. Skilled in creating robust test documentation and executing automated tests to ensure high-quality software delivery. Adept in backend programming with **Python** and frameworks such as **FastAPI**, **Django**, and **Flask**, along with expertise in **SQL** and **SQLAlchemy** for backend validations. Proficient in utilizing **HTTP/S**, **JSON**, **XML**, **HTML**, **CSS**, and **JavaScript** for thorough test coverage. Familiar with CI/CD practices and tools like **Git**, as well as monitoring solutions such as **Datadog**, **New Relic**, and **Splunk**. Proven track record of successfully contributing to critical projects in top-tier organizations, including VISA and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Ensured the quality and reliability of backend services through test automation using **Python**, **pytest**, and **Playwright** for effective validation of workflows and functionalities.\nDeveloped comprehensive QA methodologies to streamline the testing processes, delivering at least **95%** test coverage on all major components.\nImplemented automation using **Selenium** for UI testing, ensuring smooth user interactions with applications leveraging **JavaScript**, **HTML**, **CSS**, and **JSON**.\nConducted performance monitoring and logging using tools like **Datadog**, **New Relic**, and **Splunk** to proactively identify and resolve issues in production, achieving a **30%** reduction in incident response time.\nCollaborated within an Agile/Scrum environment, using **Jira**, **Confluence**, and **Zephyr** for efficient test documentation and project management, contributing to a stable CI/CD pipeline.\nManaged and executed tests against relational databases using **SQL** and **SQLAlchemy**, assessing data integrity through rigorous testing of data exchange processes.\nLed security testing initiatives, ensuring authentication systems remained robust by incorporating thorough assessments against **HTTP/S** threats and vulnerabilities, including API security checks.\n\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Implemented **test automation** frameworks using **Playwright** and **Selenium** to enhance testing efficiency for software releases, achieving a 50% reduction in testing time.\n• Developed and maintained **test documentation** for various projects, adhering to **QA methodologies** to ensure consistent quality standards across software releases.\n• Collaborated with development teams to create automated tests for backend systems built in **Python**, ensuring continuous integration and delivery with **CI/CD** pipelines.\n• Conducted performance testing and monitoring using tools like **Datadog**, **New Relic**, and **Splunk** to ensure applications meet user demand under varying loads.\n• Assisted in the implementation of Agile and Scrum methodologies, participating in daily stand-ups and sprint planning sessions to optimize team workflow.\n• Utilized **pytest** for unit and integration testing, covering over **90%** of the codebase for robust testing coverage and stability.\n• Collaborated with cross-functional teams to troubleshoot and resolve issues identified during the testing phase, enhancing system reliability.\n• Performed database testing using **SQL** and **sqlalchemy**, validating data integrity and completeness across the application.\n• Developed HTTP/S and API testing scripts in **Python** to validate endpoints responding in expected formats such as **XML**, **JSON**, and **HTML**.\n• Managed version control using **Git**, ensuring all changes are tracked and synchronized across development teams."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed and executed automated test strategies using **pytest** and **Selenium** to ensure robust quality across developed modules.\nImplemented end-to-end testing with **Playwright** to validate user interactions and functionality, achieving a test coverage rate of **95%**.\nCollaborated with development teams to create comprehensive test documentation and utilize **Jira** for issue tracking and management, improving issue resolution time by **30%**.\nEngaged in Agile and Scrum methodologies to enhance workflow efficiency and adapt quickly to project needs, ensuring timely delivery of quality software.\nPerformed database testing, utilizing **SQL**, **SQLAlchemy**, and **PostgreSQL**, to validate data integrity and compliance with business requirements.\nConducted API testing using **requests** with **HTTP/S** protocols to ensure service reliability and performance, handling up to **100** concurrent users.\nStreamlined CI/CD processes using **Git** and implementing automated test suites, reducing deployment time by **20%** and enhancing release cycles.\nUtilized monitoring tools like **Datadog**, **New Relic**, and **Splunk** to track application performance and identify potential areas of improvement in real-time."
    }
  ],
  "skills": "****Programming Languages****\n\tPython (3.8+), SQL, Bash, JavaScript, HTML, CSS\n\n****Backend Frameworks****\n\tFastAPI, Flask, Django, Celery, SQLAlchemy\n\n****Frontend Frameworks****\n\tPlaywright, JavaScript Automation\n\n****API Technologies****\n\tREST/gRPC APIs, HTTP/S, XML, JSON\n\n****Serverless and Cloud Functions****\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes\n\n****Databases****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps****\n\tGitHub Actions, Azure DevOps, CI/CD, Test Automation, Datadog, New Relic, Splunk\n\n****Cloud & Infrastructure****\n\tGit\n\n****Other****\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, QA methodologies, scripting, Jira, Confluence, Zephyr, Agile, Scrum, Test Documentation, pytest, requests, Selenium",
  "apply_company": "Playson"
}