{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience specializing in building high-performance applications. Proficient in **Elixir**, **Phoenix**, and **Postgres**, with a solid track record in leveraging **AWS** services and implementing **CI/CD** pipelines using **GitLab**. Adept in deploying containerized applications with **Docker** and managing orchestrated environments using **Kubernetes**. Experienced in frontend development frameworks such as **React**, **Next.js**, and **Vue**, enhancing user-driven application features.\nPossesses strong expertise in JavaScript/TypeScript, Python, and **Flutter**, with hands-on experience in building AI/ML-powered platforms for predictive analytics and real-time processing. Well-versed in compliance-driven development, ensuring solutions meet standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Knowledgeable in MLOps practices, including model training and orchestration using MLflow, Airflow, and Kubeflow.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained back-end services using **Elixir** and **Phoenix**, ensuring robust performance and scalability for complex applications while adhering to CI/CD best practices.\n- Managed databases with **Postgres**, optimizing queries and ensuring data integrity across multiple projects.\n- Designed and implemented **CI/CD** pipelines with **GitLab**, facilitating automated testing and deployment workflows for faster iteration cycles.\n- Collaborated on full-stack development, leveraging modern front-end frameworks like **Next.js**, **React**, and **Vue**, ensuring seamless integration with back-end services.\n- Deployed containerized applications using **Docker** and orchestrated with **Kubernetes**, achieving fault tolerance and simplifying management of microservices architecture.\n- Led initiatives to migrate legacy systems to modern technologies, reducing downtime by **30%** through strategic deployment and resource allocation.\n- Integrated cloud services via **AWS** to enhance the flexibility and scalability of applications, resulting in **20%** improved responsiveness to user demands.\n- Created and optimized RESTful APIs allowing easy access to back-end functionality across multiple frameworks, fostering better collaboration with front-end teams.\n- Conducted performance tuning and debugging sessions, achieving **40%** reduction in response times for critical services under load.\n- Developed comprehensive documentation and testing strategies using tools like Jest, PyTest, and Postman to ensure maintainability and reliability of the codebase.\n- Actively participated in code reviews and architectural discussions, mentoring junior developers on best practices in software development and application architecture."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Elixir** and **Phoenix** frameworks to develop robust backend services, enhancing system reliability and performance for high-traffic applications.\nImplemented **Postgres** as the primary database solution, ensuring efficient data storage and retrieval with a focus on optimizing query performance and transaction handling.\nEnhanced deployment processes by integrating **CI/CD** pipelines using **GitLab**, streamlining the release of new features and reducing deployment times by **30%**.\nLeveraged **AWS** cloud services for hosting applications, optimizing cloud efficiency and ensuring high availability and scalability for backend solutions.\nContainerized applications using **Docker** and orchestrated them with **Kubernetes**, enabling seamless scaling and managing of microservices architecture.\nDeveloped dynamic front-end components with **React**, **Vue**, and **Next.js** to create engaging user experiences that improve customer interaction and satisfaction.\nCollaborated on full-stack development using **Angular** for the creation of responsive web applications, focusing on modular design and component reusability.\nStreamlined development workflows and improved collaboration through version control using **GitLab**, maintaining clean code practices and facilitating coordinated team efforts.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized backend services with **Elixir** and **Phoenix** for a robust e-commerce platform, focusing on performance, scalability, and maintaining high availability throughout the application.\nManaged **Postgres** databases for effective data storage and retrieval, ensuring fault-tolerant access to critical information with an emphasis on reducing latency.\nDesigned and implemented CI/CD pipelines using **GitLab**, facilitating rapid and reliable code deployments and enhancing overall development efficiency.\nUtilized **AWS** for cloud infrastructure management, ensuring secure and scalable hosting solutions for the e-commerce applications.\nContainerized applications with **Docker** and orchestrated them using **Kubernetes** to improve deployment consistency and resource management across various environments.\nCrafted responsive and high-performing frontend applications using **React**, **Vue 3**, and **Angular**, seamlessly integrating with the backend for an optimized user experience.\nCreated SEO-friendly and accessible user interfaces with **Next.js**, enhancing customer engagement on both web and mobile platforms and adhering to WCAG 2.1 standards.\nImplemented comprehensive security measures, including role-based access control (RBAC) and OAuth 2.0, to ensure data protection and compliance with GDPR regulations across the platform.\nLeveraged advanced caching strategies with Redis to improve system responsiveness and to handle high traffic effectively, promoting better user experience and performance.\nConducted routine code reviews and optimized existing features based on real-time analytics to enhance overall platform functionality and user satisfaction."
    }
  ],
  "skills": " **Programming Languages:**\n\tElixir,\n\n **Frontend Frameworks:**\n\tNextjs,\n\tReact,\n\tVue,\n\tAngular,\n\n **Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango,\n\tPhoenix,\n\n **API Technologies:**\n\tOAuth2,\n\tJWT,\n\n **Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\n **DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3,\n\tAzure: App Services, Blob Storage, SQL Database,\n\n **Other:**\n\tMLflow,\n\tAirflow,\n\tKubeflow,\n\tKeycloak (OIDC, RBAC),\n\tNginx,\n\tLet’s Encrypt,\n\tCertbot,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose,\n\tCI/CD",
  "apply_company": "Remote"
}