{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Frontend Engineer, I bring 8 years of experience specializing in **React Native**, **TypeScript**, and **Tailwind**. My expertise in developing high-performance user interfaces aligns with the demands of fintech solutions, utilizing tools like **Expo** for rapid application development. I leverage strong skills in automation and testing frameworks such as **Cypress** to ensure quality and performance excellence.\n\nIn addition to my frontend capabilities, I have a solid background in full-stack development, harnessing **React**, **Next.js**, and **Node.js**. My knowledge of cloud services on **Azure** and **AWS**, combined with experience in **microservices architecture** and **CI/CD automation**, allows me to contribute seamlessly to cross-functional teams. Furthermore, I have successfully integrated AI/ML capabilities into enterprise platforms, employing tools like **PostHog** and **Sentry** for performance tracking and error monitoring. With a commitment to compliance standards, I ensure the applications I develop are both robust and secure.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed responsive front-end applications in **React Native** and **TypeScript**, ensuring high-quality user experiences in the **fintech** domain.\n- Utilized **Cypress** for end-to-end testing, ensuring reliability and performance across all applications.\n- Integrated analytics tools like **Sentry** and **PostHog** for real-time monitoring and error tracking, improving user engagement by **30%**.\n- Implemented UI components using **Tailwind CSS** for a streamlined and responsive design across devices, enhancing the visual identity of the fintech platform.\n- Collaborated with cross-functional teams to gather requirements and translate them into technical specifications, improving project delivery times by **25%**.\n- Designed and maintained a coding framework and component library for consistent styling and component reuse, speeding up development cycles by **50%**.\n- Ensured compliance with industry regulations by embedding security best practices into the front-end development workflow.\n- Participated in code reviews, promoting best practices in coding, and improving overall code quality.\n- Fostered an agile work environment by facilitating daily stand-ups, sprint planning, and retrospectives, contributing to a more adaptive development process."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed dynamic, user-focused front-end applications with **React Native** and **Typescript**, enhancing user experience for financial dashboards and admin portals.\nUtilized **Tailwind CSS** to create responsive layouts, achieving a loading performance improvement of **30%** in page speed.\nImplemented comprehensive testing strategies using **Cypress** to ensure robust UI components, decreasing bug rates by **25%** before deployment.\nIntegrated **Expo** to streamline the development process, facilitating smooth deployment of mobile apps for cross-platform usability.\nLeveraged **PostHog** for product analytics, providing insights that led to a **15%** increase in user engagement through data-driven feature improvements.\nMonitored and optimized application performance through **Sentry**, resolving critical issues in under **24 hours** to enhance user satisfaction in fintech applications.\nParticipated in the modernization of financial platforms by collaborating with backend teams to ensure seamless integration with microservices architectures powered by **Node.js** and **Python** frameworks.\nDemonstrated leadership and mentorship skills in guiding junior developers to adopt best practices in fintech software development."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed responsive and engaging frontend applications using **React Native**, **TypeScript**, and **Tailwind CSS**, ensuring seamless mobile user experiences while aligning with fintech standards.\n• Enhanced application features with **Expo** and integrated testing frameworks like **Cypress**, achieving a 30% reduction in bug reports post-deployment.\n• Collaborated with cross-functional teams to design user-friendly interfaces while maintaining adherence to industry best practices and accessibility compliance (WCAG 2.1).\n• Leveraged third-party tools such as **PostHog** and **Sentry** for application performance monitoring and user analytics, improving application performance by 25%.\n• Participated in Agile development processes, employing **Continous Integration/Continous Deployment (CI/CD)** practices to streamline development workflows and accelerate the release cycle by 40%.\n• Drove the implementation of feature flags using **Maestro**, enabling controlled feature rollouts and enhancing user engagement through targeted A/B testing.\n• Ensured scalability of frontend applications by optimizing build workflows and leveraging lazy loading techniques, significantly improving page load times by 50%.\n• Provided leadership through code reviews and mentorship of junior developers, fostering a culture of continuous improvement and knowledge sharing within the team."
    }
  ],
  "skills": "**Frontend Frameworks**:\n\tReact, React Native, Vue, Angular, Tailwind, Typescript\n\n**Backend Frameworks**:\n\tPython(FastAPI, Flask, Django)\n\n**API Technologies**:\n\t\n\n**Serverless and Cloud Functions**:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**:\n\n**Other**:\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Cypress, PostHog, Sentry",
  "apply_company": "MoneyGram"
}