{
  "name": "Mariusz Jan Skobel",
  "role_name": "Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Software Engineer with over 10 years of experience in delivering high-performance software solutions with a robust skill set in **Python**, **gRPC**, **REST APIs**, **Kubernetes**, **Docker**, and **CI/CD** practices. Exceptionally skilled in microservices architecture, building and deploying cloud-native applications, and implementing **CI/CD** automation strategies to ensure seamless and secure deployments. Proven ability to collaborate effectively within teams, focusing on simplicity in design while solving complex problems.\n\nDemonstrated expertise in modern technologies including **JavaScript/TypeScript**, and **Flutter**, alongside hands-on experience with frameworks and tools such as **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**. Adept at developing enterprise-grade platforms with AI/ML capabilities for real-time analytics, automation, and intelligent decision-making. Strong background in microservices, event-driven systems, and ensuring compliance with standards such as HIPAA, FHIR, and PCI DSS. Passionate about creating impactful solutions that not only meet technical requirements but also drive real-world benefits.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained scalable microservices architectures using **Python** and **gRPC**, enhancing system modularity and resilience while ensuring effective communication between services.\n•\tLed the transition from monolithic architectures to microservices, leveraging **Kubernetes** and **Docker** for deployment, achieving a **30%** increase in deployment efficiency across **5** projects.\n•\tImplemented CI/CD pipelines utilizing **GitHub Actions** and **CircleCI**, improving release cycle speed by **40%** and ensuring high code quality through automated testing and linting.\n•\tUtilized REST APIs for seamless integration of various services, facilitating communication between front-end and back-end components effectively.\n•\tCollaborated with cross-functional teams to foster problem-solving strategies, ensuring timely completion of development tasks and enhancing team performance.\n•\tApplied simplicity in design principles to create intuitive software interfaces, optimizing user experience across multiple applications.\n•\tEngaged in team collaboration sessions to refine project goals and deliverables, improving overall project alignment and execution.\n•\tDemonstrated proficiency in English for effective communication within the team and through documentation, ensuring clarity in project objectives and updates.\n•\tParticipated in architectural discussions to optimize system design and functionality, enhancing the product's overall robustness and scalability."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to develop and modernize financial platforms, adopting a microservices-based architecture that improved scalability and maintainability for high-volume transaction systems.\nLeveraged **Docker** and **Kubernetes** for container orchestration, optimizing deployment processes and ensuring consistent environments across **CI/CD** pipelines.\nCollaborated within cross-functional teams, enhancing software quality through problem-solving and effective team collaboration in an agile environment.\nCreated REST APIs and gRPC services to facilitate seamless communication between various microservices, adhering to best practices for API design.\nImplemented solutions in both monolithic and microservices architectures, demonstrating adaptability to project needs and simplifying design.\nEnhanced application performance and user experience by employing **React (18)**, **Vue 3**, and **Next.js** for building dynamic front-end applications. \nIncorporated **TypeScript**, **Redux Toolkit**, and **Tailwind CSS** to develop responsive user interfaces for financial dashboards, achieving a **30%** increase in user engagement.\nDeveloped real-time analytics dashboards using **D3.js** and **Power BI Embedded**, enabling the operations team to monitor financial activities and detect anomalies in real-time with a response time of under **5 seconds**.\nEngineered an event-driven architecture integrating **Kafka**, **RabbitMQ**, and **Azure Service Bus**, guaranteeing reliable and efficient processing of transactions, alerts, and compliance workflows.\nOrchestrated ETL pipelines using **Apache Airflow** and **Azure Data Factory**, achieving near real-time ingestion of financial data, ensuring data accuracy and availability with **99.9%** reliability.\nDesigned and deployed AI/ML-powered fraud detection systems utilizing **scikit-learn**, **XGBoost**, and **Azure Machine Learning** to analyze and flag suspicious transactions, enhancing security processes with a **85%** accuracy rate.\nCreated and integrated ML pipelines for credit scoring and classification, driving impactful real-time decision-making within banking systems."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed robust **REST APIs** and microservices using **Python** (FastAPI, Django) to enhance system modularity and scalability, ensuring application responsiveness for 1 million+ concurrent users.\n• Implemented **gRPC** for inter-service communication, reducing latency by **30%** and improving service efficiency across the platform.\n• Collaborated with cross-functional teams leveraging **CI/CD** processes through **Docker** and **Kubernetes** for seamless deployment and orchestration of services, resulting in a **40%** increase in deployment speed.\n• Engaged in problem solving and simplicity in design principles, optimizing existing features and ensuring maintainable code with a focus on usability and performance across **Python** and **Node.js** environments.\n• Participated in team collaboration efforts, leading regular stand-ups and code reviews to foster knowledge sharing and improve code quality, resulting in a **15%** reduction in bugs and technical debt.\n• Applied expert-level English proficiency in documentation and communication, effectively conveying complex technical concepts to diverse stakeholders to ensure clear project alignment.\n• Championed the adoption of microservices architecture, managing more than **15** independent services, each designed for specific business functions, promoting a flexible and adaptive system.\n• Contributed to the development of monolithic architectures when necessary, carefully weighing trade-offs between complexity and performance to match client needs effectively.\n• Provided mentorship to junior engineers, enhancing team capabilities and fostering a culture of continuous learning and improvement."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Rust\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n**API Technologies:**\n\tgRPC, REST APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Nginx, Certbot\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Problem solving, Team collaboration, English proficiency, Simplicity in design"
}