{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior OPS Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior OPS Engineer with over 10 years of experience in delivering high-performance solutions in healthcare and finance. Proficient in **Linux**, **Ansible**, **Terraform**, **GitLab CI/CD**, **ArgoCD**, **Docker**, **Kubernetes**, and **Infrastructure as Code**. Strong expertise in **networking** and **security concepts**, with a solid background in managing **distributed systems** to ensure secure and efficient operations. Proven ability to build and maintain CI/CD pipelines, automate deployment processes, and monitor system performance. Skilled in modern programming technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in deploying cloud-native applications on **Azure** and **AWS**, and leading development projects that integrate AI/ML capabilities for real-time analytics and intelligent decision-making. Committed to creating secure, maintainable solutions that comply with industry standards like HIPAA, FHIR, PCI DSS, and SOC 2. Fluent in German and English, with a passion for building systems that create meaningful real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior OPS Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDesigned and implemented efficient and secure infrastructure solutions using **Docker** and **Kubernetes** to enhance deployment processes and promote high availability in diverse environments.\n•\tMaintained infrastructure as code (IaC) utilizing **Terraform** and **Ansible**, ensuring consistent provisioning of resources and streamlined operations across both development and production.\n•\tLed the orchestration of continuous integration and deployment (CI/CD) pipelines using **GitLab CI/CD** and **ArgoCD**, achieving automated testing and deployment across multiple environments.\n•\tEnhanced system networking strategies to ensure robust connectivity and security, addressing critical networking challenges in distributed systems architecture.\n•\tCollaborated with cross-functional teams to develop and optimize security concepts, safeguarding infrastructure and applications across systems.\n•\tImplemented best practices for Linux server management, ensuring reliable and efficient system performance.\n•\tProvided operational support, including troubleshooting and performance tuning, thereby achieving a remarkable 99.9% uptime on critical applications.\n•\tWorked effectively in both **English** and **German** to facilitate collaboration and communication among international teams.\n•\tContributed to the development and maintenance of a scalable microservices architecture, promoting agility and flexibility in project delivery.\n•\tConducted regular assessments and audits on existing infrastructure systems to drive optimization, resulting in a **30%** increase in overall efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Linux** for system administration and operation management of various infrastructures, ensuring high availability and reliability.\nImplemented **Infrastructure as Code** using **Terraform** and **Ansible** for provisioning and configuration management across multiple environments, increasing deployment efficiency by **40%**.\nManaged continuous integration and deployment pipelines using **GitLab CI/CD** and **ArgoCD**, resulting in a reduction of deployment times from hours to under **30 minutes**.\nOrchestrated containerized applications using **Docker** and **Kubernetes**, enabling scalability and optimal resource utilization in distributed system environments.\nEnsured security best practices and compliance within the infrastructure, leveraging knowledge of **security concepts** and **networking** to safeguard operations.\nCollaborated with software engineering teams to design and maintain distributed systems architecture, supporting high-volume transaction processing with minimal downtime.\nFluency in **German** and **English** facilitated effective communication across diverse teams and with international stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Applied **Infrastructure as Code** principles using **Terraform** and **Ansible** to automate the provisioning and configuration of cloud resources, enhancing deployment speed by **30%** and reducing manual errors.\nUtilized **GitLab CI/CD** pipelines for continuous integration and deployment of applications, ensuring seamless integration and delivery with a **95%** success rate in automated builds.\nManaged containerized applications with **Docker** and orchestrated container deployments using **Kubernetes**, achieving **99.9%** uptime and optimizing resource utilization across services.\nImplemented robust **networking** strategies to secure and optimize connections between distributed microservices, improving data transmission efficiency by **25%**.\nEnhanced system security by integrating best practices and concepts of **security** frameworks, implementing proactive measures that reduced vulnerability scanning failures by **40%**.\nCollaborated on proposals for expanding infrastructure efficiency through **Kubernetes** and **Docker**, leading to a streamlined deployment process and faster scaling of services.\nMaintained and monitored production systems on **Linux** environments, resulting in a reduction of incident response time by **20%**.\nUtilized **ArgoCD** for continuous delivery, enabling version control of application deployments and reducing rollback time during incidents.\nEngaged in capacity planning and performance tuning of distributed systems, resulting in improved system load handling during peak traffic by **50%**.\nProvided support in both **German** and **English**, fostering collaboration within international teams and enhancing communication across various stakeholders."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks**\n\tReact, Vue, Angular\n\n **API Technologies**\n\tMLflow, Airflow, Kubeflow\n\n **Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Ansible, Terraform, Helm, Docker Compose, ArgoCD\n\n **Cloud & Infrastructure**\n\tInfrastructure as Code, Linux, security concepts, networking\n\n **Other**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, distributed systems, German, English",
  "apply_company": "Adfinis AG"
}