{
  "name": "Andrzej Ito",
  "role_name": "Senior Digital Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Digital Engineer with over 9 years of experience, I specialize in **RPA**, **Power Automate**, **UiPath**, **Camunda**, and **API** integrations. I am adept at **data integration** and have hands-on experience with **Microsoft 365**, utilizing tools like **Atlassian Jira** and **Atlassian Confluence** for effective project management and documentation. My role requires strong troubleshooting, collaboration, and communication skills, which I leverage to lead cross-functional teams and mentor junior engineers. I have a proven track record of delivering impactful projects that enhance user experience, prioritize performance, and drive innovation, all while focusing on enhancing accessibility and technical excellence.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Digital Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Utilize **Power Automate** and **UiPath** to streamline automated workflows for better RPA solutions.\n• Collaborate with cross-functional teams using **Atlassian Jira** and **Atlassian Confluence** to manage documentation and tracking of RPA projects.\n• Integrate data processes using **API** services for enhanced data integration across various platforms including **Microsoft 365**.\n• Implement troubleshooting strategies that improve system reliability and performance metrics by **15%**.\n• Drive communication with stakeholders to ensure project alignment and understanding of technical requirements within RPA initiatives.\n• Utilize **Camunda** for workflow automation, enhancing business process discoverability and execution by **20%**.\n• Lead project documentation initiatives, ensuring clarity and accuracy to support ongoing project needs and freeze version control for future reference.\n• Enhance collaboration across teams to ensure the seamless execution of projects while meeting strict deadlines, achieving a **98%** on-time delivery rate.\n• Optimize project development processes which led to a **30%** reduction in project lead time through efficient use of **RPA** tools."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "- Developed and integrated data integration solutions using **Power Automate** and **UiPath**, improving process efficiency by **30%**.\n- Executed RPA strategies with **Camunda**, enhancing automation capabilities across workflows.\n- Collaborated with cross-functional teams via **Atlassian Jira** and **Confluence**, ensuring transparent communication and documentation processes.\n- Worked on API development and integration to streamline operations across **Microsoft 365** applications.\n- Implemented troubleshooting procedures for software anomalies, reducing incident resolution time by **20%**.\n- Created detailed documentation for automated workflows and processes, improving team onboarding by **50%**.\n- Designed user-friendly interfaces with modern web technologies such as **HTML5**, **CSS3**, **JavaScript**, and **React 12** to enhance user experience.\n- Utilized **Spring MVC**, **Hibernate**, and other frameworks to develop scalable backend services for applications.\n- Employed **Web API** for efficient data interchange between frontend and backend systems, ensuring reliable application performance.\n- Developed reusable modules and custom directives in **Angular 12/13**, promoting code efficiency and maintenance ease.\n- Designed dynamic web pages that are multi-browser compatible, leveraging technologies such as **jQuery**, **AJAX**, and **Ext Js**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed and integrated **API** solutions for seamless data exchange across platforms, enhancing process automation through **RPA** tools like **UiPath** and **Power Automate**.  \n• Collaborated using **Atlassian Jira** and **Atlassian Confluence** for project management and documentation, ensuring streamlined communication across teams.  \n• Designed and implemented data integration strategies utilizing **Camunda** for optimizing workflow processes, resulting in a 20% improvement in operational efficiency.  \n• Documented system requirements and technical specifications to facilitate maintenance and future enhancements, adhering to best practices in **Microsoft 365** applications.  \n• Troubleshot and resolved technical issues effectively, minimizing downtime and improving user satisfaction by 15%.  \n• Created web applications using **Spring MVC**, **jQuery**, **HTML**, **JavaScript**, **CSS**, **Web Forms**, **Material UI**, and **Tailwind CSS**, ensuring high performance and responsiveness.  \n• Converted complex Photoshop and Figma designs into functional semantic XHTML and CSS with a focus on accessibility and user experience.  \n• Developed RESTful services using **Node.js** and **Express**, implementing **CORS** to ensure secure cross-origin requests.  \n• Designed SSIS packages for data migration from flat file sources to **MS SQL Server**, handling data for over **10,000** records per transfer.  \n• Experienced in leveraging various web technologies including **Bower**, **NPM**, and **Git**, and deploying applications on cloud services like **AWS**, **Azure**, and **GCP**, increasing deployment efficiency by 25%.  \n• Champion of collaboration and communication within fast-paced environments, contributing to a positive team culture and successful project outcomes."
    }
  ],
  "skills": "**API Technologies**\n\tAPI, SOAP, REST APIs\n\n**Programming Languages**\n\tJava, C++, C#, Python, SQL, PLSQL, Kotlin\n\n**Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA, Node.js\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**Databases**\n\tMS SQL Server, Oracle, MongoDB, PostgreSQL, Redis\n\n**Serverless and Cloud Functions**\n\tRPA, Power Automate\n\n**DevOps**\n\tCamunda, UiPath\n\n**Cloud & Infrastructure**\n\tMicrosoft 365, data integration\n\n**Other**\n\tSolid, DRY, LINQ, Microservices, Rabbit MQ, troubleshooting, documentation, collaboration, communication, Atlassian Jira, Atlassian Confluence, HubSpot",
  "apply_company": "chargecloud"
}