{
  "name": "Mariusz Jan Skobel",
  "role_name": "PL/SQL Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Experienced PL/SQL Developer with 10+ years in crafting robust software solutions tailored for healthcare and finance sectors. Proficient in **PL/SQL**, **Oracle database**, and **Oracle SQL Developer**, with a demonstrated ability to implement stored procedures and develop calculation engines for optimizing workflows. Strong focus on coding standards, with exceptional problem-solving abilities and analytical skills. While my background includes advanced experience in **JavaScript/TypeScript**, **Python**, and **Flutter**, I have also led enterprise platforms integrating AI/ML capabilities for enhanced decision-making. Proven success in designing secure solutions compliant with regulations such as HIPAA, FHIR, PCI DSS, and SOC 2. Bilingual in English and Italian, with a passion for developing systems that yield tangible benefits.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "PL/SQL Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed complex stored procedures and PL/SQL scripts to optimize data retrieval and manipulation within **Oracle Database** to enhance application performance for healthcare and finance sectors.\n• Implemented coding standards and best practices for database development ensuring maintainability and high-quality code across all **Oracle SQL Developer** projects.\n• Designed and automated calculation engines and workflows in PL/SQL for real-time data processing, resulting in a **30% reduction** in processing time for analytical reports.\n• Assisted in transitioning legacy systems into more efficient **Oracle-based** solutions, contributing to a **25% increase** in system efficiency and user satisfaction.\n• Collaborated with cross-functional teams to troubleshoot and solve complex data-related problems, utilizing strong analytical skills and problem-solving methodologies to drive effective solutions.\n• Documented and maintained technical specifications and user manuals for database applications to comply with organizational guidelines and coding standards.\n• Facilitated knowledge-sharing sessions in English and Italian, providing training to junior developers on best practices in PL/SQL programming and database management.\n• Performed code reviews to ensure adherence to coding standards, improving the quality of PL/SQL scripts and reducing bugs by **15%**.\n• Engaged in continuous improvement initiatives resulting in enhanced database performance and security, reducing downtime incidents by **10%**.\n• Developed analytical dashboards using powerful data visualization tools, enabling stakeholders to quickly interpret financial and healthcare data trends."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Oracle SQL Developer** and **TOAD** to develop and optimize **PL/SQL** stored procedures, ensuring efficient data processing and reliable performance in financial systems.\nCreated and maintained robust calculation engines and workflows, streamlining complex financial computations and improving the accuracy of reporting by over **30%**.\nImplemented coding standards across all PL/SQL scripts, enhancing code readability and maintainability, which reduced bugs in production by **25%**.\nCollaborated with stakeholders to analyze business requirements, applying strong analytical skills to design and develop solutions that meet user needs and adhere to best practices in data management.\nLeveraged **Oracle database** for data modeling and performance tuning, resulting in a **40%** increase in query execution speed and improved user experience in financial applications.\nProvided problem-solving expertise, addressing and troubleshooting issues related to data integrity, database performance, and query optimization effectively.\nConducted training sessions in both **English** and **Italian** for team members on best practices in PL/SQL development and database management, promoting a culture of continuous learning."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **PL/SQL** for developing and optimizing stored procedures and calculation engines, improving data processing efficiency by **25%** in handling large datasets within the **Oracle database** environment.\nLeveraged **Oracle SQL Developer** and **TOAD** for database debugging and performance tuning, leading to a **30%** reduction in query execution times across critical workflows.\nDesigned and implemented complex workflows to automate database tasks, ensuring robust coding standards that enhanced maintainability and team collaboration.\nApplied strong problem-solving and analytical skills to troubleshoot and resolve data integrity issues, resulting in a **15%** decrease in error rates in production environments.\nCollaborated with cross-functional teams to architect scalable database solutions, incorporating best practices in **Oracle SQL** to ensure high performance and reliability.\nConducted code reviews and provided mentoring to junior developers on PL/SQL best practices, fostering a culture of continuous improvement and skill enhancement.\nProduced comprehensive documentation in English and Italian for stored procedures and workflows, ensuring clear communication and knowledge transfer across diverse teams."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, PL/SQL\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Oracle database\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, calculation engines, workflows, coding standards, problem-solving, analytical skills, English language, Italian language, Let’s Encrypt, Nginx, Certbot, stored procedures"
}