{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Industrial Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Industrial Engineer with over 10 years of experience in hardware development and process engineering, adept at configuration management and supplier quality management. Proven track record in optimizing production processes and ensuring compliance with IPC electronics standards. Proficient in tools like **Jira**, **LabView**, and **TestStand** for effective project tracking and testing solutions. Strong communication skills complemented by excellent problem-solving abilities and a keen attention to detail, facilitating collaboration across cross-functional teams. Additionally, I bring a solid foundation in software development, having utilized modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter** across full-stack environments. Experienced in deploying cloud-native applications with expertise in **Azure** and **AWS**. Passionate about driving efficiency and delivering impactful solutions that enhance production workflows.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Industrial Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and optimized production processes incorporating **hardware development** and **configuration management** strategies to enhance efficiency and output quality.\n• Collaborated with cross-functional teams using **Jira** for project management to ensure seamless communication and alignment on objectives and deliverables.\n• Implemented quality control measures adhering to **IPC electronics standards** to uphold product integrity and compliance within **Electronic Manufacturing Services**.\n• Utilized **LabView** and **TestStand** for automated testing solutions, increasing testing efficiency by **30%** and reducing error rates in production lines.\n• Spearheaded process engineering initiatives that improved production throughput by **15%** while maintaining the highest standards of quality and safety.\n• Conducted supplier quality management assessments, ensuring materials and components met rigorous specifications, contributing to an overall reduction in defects by **25%**.\n• Leveraged **communication skills** to facilitate workshops and training sessions focused on problem-solving and **attention to detail**, leading to improved team performance and project outcomes.\n• Analyzed production data to identify bottlenecks and implement corrective actions, resulting in a **20%** increase in overall operational efficiency.\n• Collaborated closely with teams to drive collaboration initiatives, resulting in a more integrated approach to project execution, ultimately fostering a culture of continuous improvement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized exceptional **communication skills** to lead cross-functional teams in the development and modernization of financial platforms, ensuring alignment with industry standards and **supplier quality management** practices.\nEmployed **problem-solving** techniques to address challenges in hardware development and process engineering, enhancing the scalability and maintainability of systems.\nManaged project timelines and deliverables using **Jira**, ensuring effective **configuration management** and adherence to **IPC electronics standards** during software and hardware integration.\nCollaborated with teams to refine production processes, achieving a **20%** increase in operational efficiency across various projects.\nDeveloped detailed documentation and process maps using **LabView** and **TestStand**, enhancing team collaboration and knowledge sharing.\nApplied **attention to detail** while conducting thorough quality assessments to ensure compliance with **Electronic Manufacturing Services** standards, which contributed to a **15%** reduction in defect rates.\nFacilitated continuous improvement workshops, promoting a culture of collaboration that resulted in streamlined workflows and enhanced performance metrics."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **LabView** and **TestStand** for developing and optimizing hardware testing protocols, ensuring high-quality standards in **Electronic Manufacturing Services** while maintaining compliance with IPC electronics standards.\nImplemented effective **configuration management** processes to streamline production workflows, resulting in a **20% increase** in process efficiency and adherence to quality benchmarks.\nCollaborated with suppliers and internal teams using **Jira** for tracking and resolving quality issues, enhancing supplier quality management practices that led to a reduction of defects by **30%**.\nEngineered automated setups for hardware development processes, applying best practices in **process engineering** to reduce turnaround times by **25%** while maintaining product integrity.\nDemonstrated exceptional **communication skills** and **collaboration** with cross-functional teams to align project goals, leveraging a detailed approach to problem-solving and attention to detail in project execution.\nConducted thorough audits of **production processes**, implementing strategies to optimize workflows and mitigate risks associated with hardware manufacturing, contributing to overall operational excellence.\nDeveloped and refined documentation processes for hardware development, ensuring all operations met industry standards and internal guidelines, thereby enhancing team productivity and knowledge sharing."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tNginx, Certbot\n\n **Other:**\n\thardware development, process engineering, configuration management, Electronic Manufacturing Services, Jira, supplier quality management, production process knowledge, IPC electronics standards, LabView, TestStand, communication skills, problem solving, attention to detail, collaboration",
  "apply_company": "ABB"
}