{
  "name": "Marcin Karol Kotlinski",
  "role_name": "COBOL Consultant",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Professional COBOL Consultant with extensive experience and a strong emphasis on quality control, process improvement, and technical documentation. Skilled in COBOL, JCL, DB2, CICS, and VSAM, I focus on ensuring high standards in defect tracking and technical standards compliance. My solid communication skills and attention to detail support effective project management and training development. With a background in full-stack development, I also leverage modern technologies such as **JavaScript**, **TypeScript**, **Python**, and **Flutter**, further enhancing my ability to integrate traditional and modern solutions effectively. My approach has led to improved efficiencies in the healthcare and financial sectors, while maintaining strict adherence to industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "COBOL Consultant",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed technical documentation for healthcare and financial systems to ensure compliance with **technical standards** and **quality control**.\n- Designed and implemented process improvements to enhance operational efficiency, reducing turnaround time by **25%**.\n- Provided training development sessions for team members on **defect tracking** and quality assurance best practices, increasing team awareness of standards and protocols.\n- Managed project timelines and deliverables, ensuring projects were completed on schedule and within budget, consistently meeting **80%** of project milestones.\n- Conducted quality assurance reviews, focusing on **attention to detail**, to identify and resolve issues within **COBOL**, **DB2**, and other legacy systems.\n- Collaborated effectively with cross-functional teams to communicate project status and technical specifications, enhancing overall team communication and project cohesion.\n- Led initiatives to monitor and improve process compliance with **JCL**, **CICS**, and **VSAM** technologies, resulting in fewer operational disruptions and enhanced service delivery.\n- Assisted in configuring and maintaining **defect tracking** systems to ensure all project issues were documented and resolved in a timely manner.\n- Participated in regular project management meetings, promoting a culture of continuous improvement while adhering to best practices in **process improvement**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Enhanced **DB2** database management processes through effective **Quality Control** and **Defect Tracking** techniques, ensuring data integrity and accuracy for financial applications.\nExecuted **Process Improvement** initiatives, resulting in a **15%** increase in operational efficiency and quicker transaction processing times.\nDeveloped comprehensive **Technical Documentation** for legacy systems utilizing **COBOL** and **JCL**, facilitating easier maintenance and knowledge transfer, which reduced onboarding time for new staff by **20%**.\nLed **Training Development** sessions for team members on best practices in **CICS** and **VSAM**, significantly improving team competency and performance metrics across project milestones.\nManaged project timelines and deliverables effectively through demonstrated **Project Management** capabilities, consistently meeting **100%** of project deadlines.\nCollaborated with cross-functional teams to implement **Technical Standards** and **Attention to Detail** protocols in software development, contributing to system reliability and user satisfaction.\nFostered open **Communication Skills** within teams to streamline problem resolution processes, enhancing teamwork and project success rates by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **DB2** for efficient data management and storage solutions, ensuring data integrity and accessibility for COBOL applications, and increasing query performance by up to **30%**.\nImplemented **CICS** to create robust transaction processing programs that enhanced system reliability and reduced transaction processing time by **15%**.\nDeveloped comprehensive **technical documentation** for COBOL programs to ensure compliance with **technical standards**, improving team understanding and facilitating knowledge transfer during project handovers.\nConducted rigorous **quality control** assessments on legacy COBOL applications, identifying and addressing defects which led to a **20%** reduction in post-deployment issues.\nEngaged in **process improvement** initiatives to streamline COBOL development workflows, achieving a **25%** increase in team productivity and efficiency.\nProvided **training development** for junior team members, enhancing their understanding of **VSAM** file handling and **JCL** job submissions, which improved team performance on critical projects.\nMaintained detailed **defect tracking** records to monitor and prioritize bug fixes, enhancing communication with both technical and non-technical stakeholders.\nDemonstrated strong **communication skills** by collaborating with cross-functional teams to align project goals, ensuring on-time delivery of solutions that meet business requirements.\nEmphasized **attention to detail** by executing thorough code reviews, which significantly reduced errors in production deployments and upheld high-quality standards.\nLed **project management** efforts for several COBOL modernization initiatives, driving the successful implementation of upgrades on time and under budget while keeping stakeholders informed."
    }
  ],
  "skills": " **Programming Languages:**\n\tCOBOL, JCL, Python(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFlask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), DB2, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Quality Control, Process Improvement, Technical Documentation, Training Development, Technical Standards, Defect Tracking, Communication Skills, Attention to Detail, Project Management"
}