{
  "name": "Rei Taro",
  "role_name": "QA Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Detail-oriented QA Engineer with over 10 years of experience in backend development and quality assurance. Proficient in API Testing, Data Quality Validation, REST, and JSON, with a strong focus on automation using **Postman**, **Newman**, **Cypress**, **Playwright**, and **Jest**. Skilled in troubleshooting and problem-solving to ensure seamless integration and performance of services. Adept at validating data through comparison techniques while ensuring high standards of quality in financial and blockchain data environments. Holds extensive experience in Python (**FastAPI**, **Django**, **Flask**) and JavaScript, backed by a solid understanding of CI/CD processes, thus contributing to efficient deployment and testing practices. Successfully executed impactful QA strategies in collaborations with leading organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Conducted thorough **API Testing** using tools like **Postman** and **Newman** to ensure high standards of **Data Quality Validation** across applications.\nUtilized **REST** and **JSON** standards to validate responses and perform detailed **Data Comparison** for accuracy in data-driven applications.\nEmployed problem-solving skills to troubleshoot and resolve issues, enhancing overall testing efficiency and integrity in workflows.\nDemonstrated **Attention to Detail** in assessing application behaviors through manual and automated tests using **Cypress**, **Playwright**, and **Jest** frameworks.\nCollaborated with developers to implement CI/CD practices, deploying updates and ensuring consistent integration and delivery.\nTested backend services built in **Python** and **JavaScript**, achieving a **95%** test coverage score on pivotal functionalities.\nParticipated in the validation of blockchain data for compliance with **Web3 APIs**, ensuring reliability and transparency in transactions.\nLeveraged AI tools to enhance testing methodologies, streamlining data integrity checks and automating repetitive tasks."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Conducted **API Testing** and **Data Quality Validation** on various system integrations, ensuring data consistency through **REST**ful interfaces and **JSON** structure.\nUtilized **Postman** and **Newman** to generate comprehensive reports on API performance, achieving a **95%** automation rate in regression testing.\nEmployed **Cypress**, **Playwright**, and **Jest** for validation of front-end applications, significantly improving the customer onboarding experience by reducing errors by **30%**.\nLeveraged **Python** for scripting test automation processes, enhancing test coverage to **80%** of core functionalities within **2 months** of deployment.\nEngaged in problem-solving and detail-oriented analysis to identify and resolve defects, maintaining high quality across deliverables in a fast-paced environment.\nCollaborated with engineering teams to integrate CI/CD practices using tools like Azure DevOps to streamline deployments and reduce lead time by **40%**.\nActively participated in knowledge sharing sessions focused on **Blockchain Data** and **Web3 APIs**, leading to the enhanced testing capabilities for emerging technologies and **AI Tools**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Conduct thorough **API Testing** to validate data quality and functionality using tools like **Postman** and **Newman** for precise monitoring and error detection.\nUtilize **JSON** for data comparison and verification, ensuring integrity and accuracy throughout the testing process.\nImplement robust **CI/CD** practices to facilitate ongoing integration and deployment processes, enhancing project efficiency and reliability.\nExecute comprehensive test cases with frameworks such as **Cypress** and **Playwright** to ensure high-quality software delivery in projects based on **Python** and **JavaScript**.\nPerform meticulous problem-solving and attention to detail during testing phases, leading to a 30% reduction in defect rates across applications.\nDevelop and maintain documentation for all test procedures and outcomes, promoting teamwork and clarity in communication within the QA team.\nCollaborate with development teams to troubleshoot and resolve identified issues swiftly, minimizing downtime during the development lifecycle.\nStay updated with **AI Tools** and emerging technologies to enhance the testing suite, adopting best practices to ensure continuous improvement."
    }
  ],
  "skills": " **Programming Languages**\n\t Python (3.8+), JavaScript, SQL, Bash\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t Cypress, Playwright, Jest\n\n **API Technologies**\n\t REST, REST/gRPC APIs, JSON, API Testing, Web3 APIs, Postman, Newman\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t AI/ML Tools (Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow), Microservices, Kafka, Data Quality Validation, Data Comparison, Problem-solving, Attention to Detail"
}