{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior ML Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a driven Senior ML Engineer with 8 years of experience, I specialize in **Python** and have a robust foundation in **Machine Learning**, **Statistics**, **Data Engineering**, and algorithms. I excel in collaborating with cross-functional teams to deliver high-performance solutions, integrating predictive analytics and real-time data processing capabilities. My technical expertise also includes developing machine learning pipelines and deploying ML models in production while implementing MLOps workflows using **MLflow**, **Airflow**, and **Kubeflow**. I have a solid background in optimization and data structures to refine algorithms, ensuring robust and efficient application performance. My extensive knowledge in **JavaScript/TypeScript**, **Flutter**, and full-stack frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** complements my machine learning skills, allowing me to build comprehensive solutions. Additionally, I bring expertise in cloud environments with **Azure** and **AWS**, and ensure compliance with industry standards like HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented and designed machine learning models for various applications such as patient risk prediction and financial fraud detection using **Python** (scikit-learn, PyTorch, TensorFlow), ensuring optimized performance and accuracy.\nCollaborated with cross-functional teams to enhance data engineering processes, integrating algorithms and data structures for better model training and evaluation.\nDeveloped robust statistical models for optimized decision-making in healthcare and fintech, leveraging advanced optimization techniques to improve predictive outcomes.\nEngaged in collaborative prototyping of innovative solutions, focusing on machine learning applications to drive product development.\nArchitected and built scalable MLOps pipelines using **MLflow**, **DVC**, and **Apache Airflow** for continuous training, validation, versioning, and deployment of machine learning models across varying environments.\nDesigned and maintained cloud-native databases and data architectures using **PostgreSQL**, **MongoDB**, and **Redis** for efficient data extraction and storage, handling large volumes of healthcare and financial data.\nExecuted comprehensive testing strategies, utilizing tools like **Jest**, **Cypress**, **PyTest**, and **Postman** to cover unit testing, integration, and end-to-end testing across all services, ensuring high code quality and reliability.\nIntegrated AI features in client-facing applications, developing solutions that deliver personalized recommendations and predictive alerts using machine learning algorithms deployed on **Azure ML** and **AWS Sagemaker**.\nDeliverd visualization tools using **D3.js** and **Power BI Embedded** to present complex financial data insights, helping stakeholders make informed decisions.\nInstalled Azure Cognitive Search and **ElasticSearch** for enhancing search capabilities across large datasets, improving the user experience in accessing health records and financial documents."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Applied Machine Learning algorithms and statistics to develop and optimize fraud detection systems, increasing detection accuracy by **15%** using technologies like **scikit-learn** and **XGBoost**.\nCollaborated with cross-functional teams to enhance financial platforms by leveraging data engineering techniques and optimizing workflows that improved operational efficiency by **20%**.\nEngaged in prototyping ML models for credit scoring and churn prediction, utilizing **MLflow** and **Apache Airflow** to streamline deployment into production.\nDeveloped efficient algorithms and data structures that processed financial data in real-time, ensuring data integrity and availability for analysis.\nUtilized **Python** for ETL pipeline construction, processing batch and real-time data with tools like **Azure Data Factory** to support data ingestion from **5+** internal and third-party sources.\nConducted statistical analyses to refine model performance, ensuring robust and reliable outcomes in data-driven decision-making processes.\nFostered collaboration within project teams to enhance system architecture and maintainability, significantly reducing development time on new features by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Engineered AI/ML-based recommendation engines utilizing **Python** frameworks like scikit-learn, LightGBM, and TensorFlow to enhance product listing personalization and optimize search relevance, improving conversion rates by **45%** based on real-time behavioral data.\n• Developed algorithms and data structures for predictive modeling, ensuring robust data engineering practices and statistical analysis to drive product insights and business decisions.\n• Collaborated effectively within cross-functional teams to prototype and optimize machine learning pipelines, resulting in a **30%** reduction in model training times.\n• Designed and optimized backend services, leveraging **Data Engineering** best practices in Python (FastAPI, Django) and Node.js (NestJS, Express) for scalable, high-performance applications.\n• Applied optimization techniques to enhance processing speed and resource utilization while maintaining a focus on deploying ML models responsibly across environments.\n• Engaged in collaborative problem solving and code reviews to ensure best practices in the implementation of machine learning solutions in a scalable architecture.\n• Conducted statistical analysis and performance evaluations on machine learning models, ensuring continual improvement and alignment with business objectives.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript, React, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMachine Learning, Statistics, Optimization, Data Engineering, Algorithms, Data Structures, Collaboration, Prototyping, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "StackAdapt"
}