{
  "name": "Tomasz Lee",
  "role_name": "Senior Field Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Field Engineer with 9+ years of experience in designing and implementing embedded systems and in-vehicle networking solutions. Proficient in automotive standards and frameworks including **AUTOSAR**, **DDS**, and **SOME/IP** alongside strong skills in **C/C++** and **Python**. Expertise in **cloud-native** architectures and **containers**. Demonstrated knowledge of **threading**, **UDP**, and **multicast** protocols within complex systems. Committed to enhancing technical architecture and optimizing development processes, employing methodologies aligned with **SDLC**. Excellent communication skills foster effective team collaboration and customer engagement, ensuring project success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged expertise in **.NET** and **Python** to develop robust embedded systems, ensuring compliance with **AUTOSAR** standards.\nImplemented **C/C++** programming for in-vehicle networking solutions, enhancing communication protocols such as **SOME/IP** and **UDP**.\nExecuted system design and development adhering to **SDLC** methodologies, resulting in on-time project deliveries.\nEnhanced team collaboration through effective presentation skills and customer communication, fostering a unified project approach.\nUtilized **Containers** in deploying cloud-native applications, achieving a 30% increase in resource efficiency.\nEmployed **Threading** and **Multicast** techniques to optimize system performance for real-time data exchange.\nDevised technical architectures using **DDS** for seamless data distribution across embedded platforms.\nReduced system latency by 25% by optimizing communication patterns across various networking layers, applying **OSI** model frameworks.\nCollaborated cross-functionally with developers and stakeholders, leading to improved project outcomes through shared insights and feedback.\nArchitected solutions integrating **Web Services** to ensure scalability and maintain essential service availability."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "- Developed and implemented **Embedded Systems** using **C/C++** and **AUTOSAR** standards, enhancing system integration with in-vehicle networks and improving overall performance.\n- Designed **Web Services** leveraging **.NET** for seamless communication between various components in vehicle architecture, ensuring high reliability under demanding conditions.\n- Utilized **Python** and **Java** for creating robust communication patterns and data management solutions, supporting a cleaner data flow in the system.\n- Managed **Threading** and **UDP** protocols for efficient data transmission, improving real-time communication across multiple systems in a vehicle environment.\n- Collaborated with team members and stakeholders, including during the **SDLC**, to define technical architecture and system requirements, ensuring project specifications were met on time.\n- Led initiatives on **Virtualization** and **Cloud-Native** technologies for development, reducing deployment times by **20%** and enhancing scalability in computing resources.\n- Optimized **Communication Patterns** by implementing **Multicast** solutions, resulting in a **15%** improvement in data delivery efficiency.\n- Conducted code reviews and provided mentorship to maintain coding quality and adherence to industry standards, thereby increasing team collaboration and productivity by **30%**.\n- Engaged in customer communication sessions to present technical specifications and updates, facilitating better understanding and cooperation from non-technical stakeholders.\n- Ensured compliance with technical safety and communication protocols in automotive environments by utilizing knowledge of **OSI** and **DDS** standards."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed embedded systems solutions using **C/C++**, employing **AUTOSAR** for standardized automotive software architecture to ensure compliance with industry standards.\n• Implemented in-vehicle networking protocols including **UDP** and **SOME/IP**, enhancing communication reliability within automotive systems.\n• Created and optimized multithreaded applications to improve performance and responsiveness across various operating systems.\n• Leveraged knowledge of **DDS** for distributed communication, successfully achieving low-latency data exchange in complex systems.\n• Managed the full software development lifecycle (SDLC) for embedded projects, ensuring timely delivery and adherence to quality standards.\n• Collaborated effectively with cross-functional teams to facilitate clear technical architecture documentation and improve team collaboration initiatives.\n• Designed cloud-native solutions utilizing **Containers** to enhance scalability and efficiency in automotive applications.\n• Conducted technical presentations that improved customer communication and enriched stakeholder engagement, successfully increasing client satisfaction by **30%**.\n• Reviewed software designs and code to assure compliance with best practices in technical architecture, contributing to a **15%** reduction in bugs during testing phases.\n• Participated in agile methodologies, including daily standups, to ensure project alignment and foster a culture of collaboration and continuous improvement."
    }
  ],
  "skills": "Frontend Frameworks:\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\nBackend Frameworks:\n\tC#, .NET, NodeJS, ExpressJS, NestJS, Microservices\n\nProgramming Languages:\n\tC/C++, Python, Java\n\nAPI Technologies:\n\tRESTful API, GraphQL, Web Services\n\nServerless and Cloud Functions:\n\tCloud-Native\n\nDatabases:\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\nCloud & Infrastructure:\n\tAWS, Azure, Virtualization, Containers, CI/CD pipelines\n\nDevOps:\n\tCommunication Patterns, Technical Architecture\n\nOther:\n\tAUTOSAR, In-Vehicle Networking, OS, Threading, UDP, Multicast, OSI, SDLC, DDS, SOME/IP, Embedded Systems, UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Presentation Skills, Customer Communication, Team Collaboration",
  "apply_company": "Real-Time Innovations (RTI)"
}