{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Backend Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "Senior Backend Engineer with 8+ years of experience specializing in designing and implementing robust solutions across e-commerce, finance, and healthcare domains. Proficient in **Java**, **Spring Boot** and developing RESTful and GraphQL APIs, I leverage cloud platforms such as **AWS**, **Azure**, and **GCP** to ensure high availability and scalability. Experienced in database management with **MySQL** and **NoSQL** solutions for optimized data handling and storage. Strong knowledge of microservices architecture and expertise in tools like **Git**, **Gitlab**, **Kafka**, and **Cloud Run** to enhance development and deployment workflows. My full-stack capabilities include proficiency in **Python** (FastAPI, Django, Flask, SQLAlchemy) and modern frontend frameworks like **Angular**, **Vue**, **React**, and **Next.js**, allowing me to deliver comprehensive software solutions that meet intricate business needs.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Java** and **Spring Boot** to develop and maintain scalable backend services, ensuring optimal performance and reliability in cloud environments.\nDesigned and implemented **RESTful** and **GraphQL** APIs for seamless data interaction, supporting integration with **GCP**, **AWS**, and **Azure** cloud platforms.\nLed the deployment of microservices on **Cloud Run** and orchestrated event-driven architectures using **PubSub** and **Kafka** to enhance system scalability and responsiveness.\nManaged databases including **MySQL** and **NoSQL** solutions, implementing robust indexing and data retrieval strategies to handle large-scale data operations.\nAutomated CI/CD processes in **Git** and **Gitlab**, streamlining code deployment and ensuring rigorous code quality through integrated testing and security scans.\nCollaborated with cross-functional teams to design high-performance APIs, achieving a **30% reduction** in response time over existing systems.\nChampioned the integration of AI algorithms to improve user experience and performance metrics across applications.\nMentored junior engineers in best practices for backend development and cloud architectures, fostering growth and knowledge sharing within the team.\nConducted performance tuning and optimization strategies, achieving a **50% improvement** in database query processing.\nFacilitated cloud migrations and optimizations, leveraging **AWS** and **Azure** capabilities to reduce operational costs by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **Java** and **Spring Boot** to develop and optimize backend services, ensuring efficient API performance and code maintainability.\nDesigned and implemented **RESTful** and **GraphQL** APIs for robust data access, achieving a **30%** reduction in response times while maintaining secure communication across microservices.\nUtilized **GCP** and **AWS** for scalable cloud deployments, implementing strategies that increased system uptime to **99.9%**.\nIntegrated **MySQL** and **NoSQL** databases for streamlined data management, ensuring high availability and optimized query performance across various services.\nDeveloped real-time data processing capabilities using **Kafka** for event-driven architectures, enabling the efficient handling of large volumes of transactions with minimal latency.\nIncorporated best practices in version control using **Git** and **GitLab** to enhance collaborative efforts and streamline the development workflow.\nBuilt serverless applications using **Cloud Run** and automated deployment pipelines, decreasing time-to-market for new features by **40%**.\nImplemented data-driven features using AI solutions, enhancing user experience and decision-making processes within applications.\nEstablished message brokering systems using **Pub/Sub**, facilitating smooth communication between microservices and reducing response delays.\nApplied rigorous testing protocols, including integration tests and unit tests, to ensure maximum reliability and performance in all backend services.\nConfigured and managed **Azure** environments for service deployment, focusing on modularity and high performance under varying load conditions.\nDeveloped monitoring solutions to track system performance and user interactions, leveraging advanced analytics for continuous improvement and refinement of services.\nEnsured compliance with data protection regulations through implementing industry standards for secure API development and data handling."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and optimized **RESTful APIs** to ensure high-volume transaction processing for seamless integration between frontend interfaces and backend systems.\nImplemented robust backend services using **Java** and **Spring Boot**, enhancing scalability and performance across critical modules.\nLeveraged various **NoSQL** and **MySQL** databases to design, optimize, and manage transactional storage, improving query performance and reducing latency.\nUtilized **GCP** services, including **Cloud Run** and **PubSub**, to streamline development and deployment processes for cloud-native applications.\nEmployed **Git** and **Gitlab** for version control and collaboration, ensuring consistent and reliable delivery of new features with a focus on CI/CD best practices.\nImplemented event-driven architectures using **Kafka** for real-time data processing and integration across microservices.\nConducted performance testing with tools like JMeter to identify and mitigate bottlenecks, ensuring the backends can handle peak loads of up to **100,000** transactions per minute.\nDesigned and developed secure and scalable backend solutions that interacted with third-party **API** services to enhance functionality and service offerings.\nStreamlined deployment processes using containerization technologies like **Docker** to support consistent environments across development, testing, and production.\nLed efforts to validate application functionality through comprehensive unit and integration testing, improving code quality and reducing defects by **30%**.\nImplemented caching solutions with **Redis** to optimize response times and reduce load on the database.\nWorked on projects utilizing AI to enhance business processes, leveraging cloud services on **AWS** and **Azure** for cross-platform support.\nMentored junior developers in best practices for developing back-end systems, resulting in a **40%** increase in team productivity."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Java\n\n**Backend Frameworks:**\n\tSpring Boot, FastAPI, Django, Flask\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, RESTful, GraphQL, API\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), GCP, Cloud Run, Azure\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, NoSQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Git, Gitlab, Kafka, PubSub",
  "apply_company": "Pathway Solutions GmbH"
}