{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Core Engine/C++ Optimization Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Core Engine/C++ Optimization Engineer with 13+ years of experience in high-performance application development. Proficient in **C++**, with a strong focus on **multithreading**, **optimization**, **profiling**, and **shipping AAA titles**. Experienced in using **VTune** and various console profiling tools for efficient CPU/GPU crash dump analysis.\nDiverse tech stack includes JavaScript/TypeScript, Python, and **Flutter** for frontend and backend development, utilizing frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Knowledgeable in deploying applications in cloud environments like **AWS** and **Azure**, implementing microservices, and developing solutions aligned with compliance standards such as HIPAA and PCI DSS. Adept in AI/ML with experience in MLOps tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Core Engine/C++ Optimization Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C++** to optimize core engine performance, ensuring efficient multithreading and resource management for AAA titles developed with **Unreal Engine** (version 4.26).\nLeveraged advanced profiling techniques including **VTune** and console profiling tools to analyze and enhance application performance, achieving a **30%** reduction in CPU/GPU utilization.\nImplemented multithreading strategies to maximize efficiency across core engine components, resulting in improved game responsiveness and gameplay mechanics.\nConducted extensive crash dump analysis for CPU/GPU issues, successfully diagnosing and resolving **95%** of critical performance bottlenecks prior to title release.\nSuccessfully shipped **3** AAA titles, coordinating the optimization strategies across teams to meet stringent performance benchmarks and deadlines.\nDeveloped and integrated robust optimization frameworks focused on improving rendering and calculation times, contributing to linear scaling across console platforms.\nCollaborated with cross-functional teams to gather requirements and feedback, driving continuous improvements in optimization tools and methodologies.\nLed training sessions for junior engineers on best practices in performance optimization and multithreading paradigms, enhancing overall team skill level and project delivery.\nMaintained comprehensive documentation of optimization processes and results, facilitating ongoing knowledge transfer and process refinement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Optimized core game engine functionalities by implementing multithreading techniques and performance tuning strategies, resulting in improved frame rates and reduced load times for AAA titles.\nEnhanced application performance by employing **profiling** tools, including **VTune** and console profiling tools, to identify and eliminate bottlenecks in the **C++** codebase, leading to optimizations of up to **25%**.\nConducted thorough CPU/GPU crash dump analysis, allowing for rapid issue identification and remediation, thereby minimizing downtime and enhancing user experience across multiple console platforms.\nCollaborated with cross-functional teams to ensure seamless shipping of AAA titles, adhering to strict deadlines and maintaining quality standards through thorough testing and iteration.\nUtilized knowledge of **Unreal Engine** to fine-tune graphics rendering and asset management, achieving more realistic visuals while maintaining optimal performance on hardware.\nImplemented innovative **optimization** strategies for both CPU and GPU usage, resulting in enhanced gameplay fluidity and improved memory management practices for high-performance gaming.\nLed team workshops on **C++** performance profiling methods, equipping peers with cutting-edge skills to optimize game performance effectively."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C++** for developing and optimizing **Core Engine** components, ensuring high performance and efficiency in rendering and processing for **AAA** titles.\nEmployed multithreading techniques to enhance application performance and reliability, achieving a **25%** reduction in frame rendering time.\nConducted extensive profiling using **VTune** and console profiling tools to identify bottlenecks, with a focus on optimizing CPU and GPU usage to facilitate smoother gameplay experiences.\nPerformed detailed CPU/GPU crash dump analysis to troubleshoot and resolve issues, ensuring high-quality gameplay performance prior to shipping title releases.\nCollaborated on shipping **AAA** titles for major console platforms, ensuring all features are optimized for performance and stability across diverse hardware configurations.\nImplemented advanced optimization strategies that led to a **15%** improvement in overall frame rates through careful resource management and algorithm enhancements.\nLed the integration of configuration settings to improve resource allocation through systematic profiling, achieving a **30%** enhancement in overall application responsiveness.\nContributed to documentation of optimization techniques to facilitate knowledge sharing and training within the team, enhancing overall team productivity and skill set."
    }
  ],
  "skills": " **Programming Languages:**\n\tC++, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, multithreading, optimization, profiling, VTune, console profiling tools, CPU/GPU crash dump analysis, shipping AAA titles, knowledge of console platforms"
}