{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior SREngineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior SREngineer with 8 years of experience, I bring strong expertise in **DevOps**, **GitOps**, and **Observability** practices, ensuring high-performance solutions across diverse sectors. My technical proficiency includes programming in **Python**, with additional familiarity in **Java**, **C**, **C++**, **Go**, **Perl**, and **Ruby**, enhancing my adaptability to various technology stacks. I have successfully deployed and managed applications using **Kubernetes**, **Terraform**, and **ArgoCD**, while employing monitoring tools like **Prometheus**, **Grafana**, and the **ELK Stack** for effective system observability.\n\nIn previous roles, I’ve focused on automation and distributed systems, leading to robust operational efficiencies. I am well-versed in CI/CD automation utilizing tools such as **GitHub Actions** and **Packer**. My experience includes deep cloud environments in **AWS** and **Azure**, ensuring adherence to compliance standards while managing scalable applications. I excel in remote work settings and prioritize communication to align cross-functional teams towards common goals.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior SREngineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented enterprise-level DevOps pipelines using **GitHub Actions**, **ArgoCD**, and automated processes for both web and API services, ensuring observability and streamlined deployments across environments.\nDesigned and maintained robust, distributed systems while leveraging **Kubernetes** for orchestration, ensuring high availability and fault tolerance by utilizing **Terraform** for infrastructure as code (IaC) across **AWS** and **Azure** platforms.\nAutomated CI/CD processes with **GitOps** techniques, enhancing the efficiency of deployment cycles and version control with precision.\nIntegrated observability tools such as **Prometheus**, **Grafana**, and **ELK Stack** for monitoring, logging, and alerting, maintaining real-time insights into system performance and operational KPIs.\nCollaborated effectively in a remote work environment, fostering clear communication and teamwork to resolve complex infrastructure issues promptly.\nUtilized scripting languages such as **Python** and **Go** to enhance automation processes across deployments and system configurations.\nEstablished automation frameworks that increased efficiency by up to **30%**, delivering a more responsive development lifecycle.\nManaged configuration and management of Kubernetes clusters, ensuring deployments were resilient and scalable by implementing effective resource management strategies.\nDeveloped and maintained comprehensive documentation for automated processes and system architectures to facilitate knowledge sharing within the team.\nParticipated actively in incident response and root cause analysis for distributed systems, ensuring swift resolution of outages and minimizing downtime to below **5%** annually."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Implemented **GitOps** practices in managing deployment workflows, enhancing collaboration and reducing deployment times by **50%**.\n- Ensured observability through integration of **Prometheus** and **Grafana** for monitoring system performance and uptime, achieving a **99.9%** system availability.\n- Automated infrastructure with **Terraform** and **Kubernetes**, leveraging **ArgoCD** for continuous delivery, resulting in faster system updates and improved reliability.\n- Spearheaded the modernization of financial platforms adhering to **DevOps** principles, employing **Python** and various frameworks to boost scalability and maintainability.\n- Developed and maintained effective monitoring and alerting systems using **ELK Stack** and **Splunk** for logging and troubleshooting, reducing incident resolution time by **30%**.\n- Led cross-functional teams in remote work environments, promoting clear communication and agile methodologies to meet project deadlines and enhance productivity.\n- Provided automation solutions that drove efficiencies in deployment processes, leading to a **40%** reduction in manual configuration errors.\n- Continuously improved system architecture and processes with best practices, promoting a culture of feedback and innovation within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained **observability** tools, utilizing **Prometheus** and **Grafana** to monitor system performance and ensure high availability within the platform.\nApplied **GitOps** practices for CI/CD using **GitHub Actions** and **ArgoCD**, streamlining deployment processes and improving release cycles by **30%**.\nEngineered secure and scalable backend services using **Python** (FastAPI, Django) and **Go**, ensuring optimal performance across e-commerce modules.\nImplemented **Kubernetes** for container orchestration, enabling flexible scaling and efficient resource management across development and production environments. \nEnhanced infrastructure as code capabilities with **Terraform** and **Terragrunt**, expediting system deployments and reducing configuration errors by **25%**.\nStreamlined automation workflows for system monitoring and incident resolution, contributing to improved system reliability and reducing downtime by **40%**.\nApplied best practices of **Distributed Systems** for building resilient applications capable of handling high traffic, increasing system throughput by **15%**.\nCollaborated effectively in a **remote work** setup, maintaining strong communication with cross-functional teams to align on system architectures and operational strategies.\n\nUtilized advanced programming languages such as **C**, **C++**, and **Java** to enhance legacy systems and improve interoperability with modern platforms.\nEnsured compliance with GDPR through efficient data management practices and **role-based access control (RBAC)** for user access security.\nImplemented real-time observability solutions with the **ELK Stack** and **Splunk**, providing actionable insights into system health and user engagement."
    }
  ],
  "skills": " **Programming Languages:**\n\tC, C++, Java, Go, Perl, Ruby, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tN/A\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, GitOps, Prometheus, Grafana, ELK Stack, Splunk, ArgoCD, Packer, Automation\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, Terraform, Terragrunt, Calico\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Remote Work, Communication, OIDC, RBAC, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Distributed Systems",
  "apply_company": "Chainlink Labs"
}