{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Automation Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Automation Engineer with 8 years of experience, I excel in automation QA, CI/CD practices, and test automation strategies, ensuring robust and reliable software delivery. Proficient in **Docker**, **Kubernetes**, **Jenkins**, and **Ansible**, I implement seamless automation pipelines that enhance productivity and integrate best QA practices. My extensive programming knowledge in **Python**, alongside familiarity with **Bash** and **Groovy**, empowers me to troubleshoot, debug, and optimize systems efficiently within **Linux** environments.\nI hold a strong background in developing high-performance solutions in diverse sectors, including healthcare and finance. My expertise in modern tech stacks such as **React**, **Next.js**, and **Node.js**, combined with a solid foundation in microservices architecture and event-driven systems, allows me to contribute to comprehensive automation frameworks. Additionally, my hands-on experience with deployment strategies and tools like **Behave** and **Playwright** reinforces my capability to deliver quality software that resonates with industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Automation Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Designed and implemented **CI/CD** pipelines using **Jenkins**, **GitHub Actions**, and **CircleCI** to automate testing and deployment processes, ensuring smooth integration of code from development to production environments.\n- Developed thorough **test automation strategies** utilizing **Python**, **Behave**, and **Playwright** to enhance software quality and reliability across various platforms.\n- Employed **Docker** and **Kubernetes** to containerize and orchestrate test environments, significantly improving consistency and scalability in testing processes for applications running on **Linux**.\n- Implemented effective **QA best practices** and troubleshooting techniques that reduced production bugs by **30%** through rigorous debugging and test coverage efforts.\n- Automated regression testing and other test processes using custom **Python** scripts, reducing manual testing time by **50%** and increasing testing efficiency.\n- Integrated **Ansible** for configuration management, ensuring uniform setup of test environments aligned with production configurations.\n- Collaborated with cross-functional teams to establish a culture of quality, resulting in improved stakeholder satisfaction metrics by **25%**.\n- Conducted training sessions on **test automation frameworks** and debugging tools, fostering skill development among team members and enhancing overall team capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented test automation strategies and QA best practices in the development of high-volume financial platforms ensuring software quality using **Python**, **Bash**, and **Linux**.\nLed the integration of **Docker**, **Kubernetes**, and **Jenkins** for continuous integration and delivery (CI/CD), facilitating automated deployment and testing for microservices architectures.\nExecuted debugging and troubleshooting processes to identify and resolve issues within the application, enhancing overall system reliability and performance.\nDeveloped and maintained automation scripts using **Behave** and **Playwright** to ensure comprehensive test coverage across applications with a focus on user scenarios and functionality.\nCollaborated with cross-functional teams to design and evaluate automated test cases, reducing testing time by **30%** and improving release cycles.\nConfigured and managed **Ansible** for environment provisioning and configuration management, ensuring consistency across staging and production environments.\nUtilized strong understanding of software development processes to innovate and refine automation frameworks, achieving a test pass rate of **98%** on release candidates.\nUtilized version **3.8** of **Python** in conjunction with **Groovy** for scripting and tooling, increasing automation efficiency across development teams."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and implemented **Test Automation Strategies** to enhance the efficiency and reliability of the testing process using **Python** and **Bash**, achieving a reduction of testing time by **30%**.\nDesigned and maintained Continuous Integration/Continuous Deployment (**CI/CD**) pipelines using **Jenkins**, **Kubernetes**, and **Docker**, ensuring seamless deployment processes with minimal downtime.\nAutomated regression testing suites with **Behave** and **Playwright**, resulting in a **40%** increase in test coverage across critical features and functionalities.\nUtilized **Linux** environments for executing and optimizing automated tests, ensuring compatibility and stability across diverse systems.\nCollaborated in **debugging** and **troubleshooting** environments to resolve issues proactively, maintaining system integrity and application performance at scale.\nImplemented best practices of **QA** methodologies to enforce high standards in test scenarios and documentation, supporting strategic automation planning and execution.\nStreamlined workflow and collaboration with development teams to adopt **Ansible** for environment setup and configuration management, enhancing deployment consistency across projects.\nConducted regular assessments of test results and metrics to guide process improvements and quality assurance initiatives, contributing to higher product delivery standards.\nEnhanced automation scripts for various testing phases, ensuring thorough quality checks and efficient feedback loops throughout the development lifecycle."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Bash, Groovy\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Ansible, Helm, Terraform, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tAutomation QA, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD, Behave, Playwright, Debugging, Troubleshooting, Test Automation Strategies, QA Best Practices",
  "apply_company": "Acronis"
}