{
  "name": "Andrzej Ito",
  "role_name": "Senior Oracle Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Oracle Engineer, I possess extensive expertise in **Oracle Service Cloud**, **PHP**, **JavaScript**, **Java**, **Python**, **CSS**, **HTML**, **SQL**, **RESTful APIs**, and **Web Services**. With over 9 years of experience in application development, I have successfully led cross-functional teams in delivering scalable software solutions, focusing on performance, innovation, and user experience. My proficiency in debugging, unit testing, data modeling, report development, and BI ensures the effective enhancement of applications, all while driving technical excellence and mentoring junior engineers.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Oracle Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Develop and enhance applications leveraging **Oracle Service Cloud** and **Java** for seamless integration with cloud services.  \n• Design and implement scalable **RESTful APIs** for delivering robust web services that adhere to **Microservices Architecture** principles.  \n• Utilize **JavaScript**, **CSS**, and **HTML** to craft dynamic user interfaces, ensuring a responsive design aligned with current web standards.  \n• Implement back-end logic and data management using **SQL** databases such as **Oracle**, **MySQL**, and **PostgreSQL** to ensure efficient data processing and retrieval.  \n• Conduct unit testing and debugging of applications ensuring high code quality and performance with a focus on continual improvement.  \n• Collaborate in building enhancements and automating tasks using **Python** and **PHP**, providing solutions for application development and data modeling.  \n• Lead efforts in report development and business intelligence (BI) using gathered data to inform architectural decisions.  \n• Employ **Jenkins** and **Ansible** for automated deployment of applications, improving deployment times by up to **30%** in development and production environments.  \n• Mentor junior engineers in software architecture best practices and the latest **Java** frameworks, contributing to their professional growth."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "- Applied **Oracle Service Cloud** expertise to enhance application development strategies and improve RESTful API functionality.\n- Developed robust web applications using **PHP**, **JavaScript**, **HTML5**, and **CSS3**, ensuring high performance and responsiveness across multiple platforms.\n- Designed and implemented software architecture for scalable solutions, emphasizing **Web Services** and **RESTful APIs** integration for seamless data transactions.\n- Conducted comprehensive debugging and unit testing procedures, improving application reliability and optimizing performance by **30%**.\n- Engaged in effective data modeling practices, utilizing **SQL** to develop intricate reports, thereby enhancing business intelligence (BI) insights.\n- Built enhancements for existing applications, collaborating with cross-functional teams to prioritize features based on user feedback and requirements, resulting in a **25%** increase in user satisfaction.\n- Leveraged **Java** and **Python** for backend services, ensuring efficient data processing and integration with third-party tools.\n- Developed interactive dashboards and custom reports, using **ChartJS**, providing critical data visualizations for stakeholders.\n- Created reusable modules and optimized code in different JavaScript frameworks (**AngularJS**, **React 12**, and **AJAX**), reducing development time by **20%**."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed robust applications utilizing **Oracle Service Cloud**, **Java**, **PHP**, and **JavaScript** to enhance user experience and operational efficiency.\n• Designed and implemented **RESTful APIs** and **Web Services** ensuring seamless communication between various software components.\n• Utilized **SQL** for efficient data modeling and report development, ensuring high performance in data retrieval and manipulation.\n• Implemented and tested web application features using **HTML**, **CSS**, and **JavaScript**, ensuring cross-browser compatibility across versions **9.0** and above.\n• Conducted debugging and unit testing to ensure application stability and reliability, facilitating software architecture improvements.\n• Engaged in building enhancements based on user feedback and system requirements, leading to a **20%** increase in user satisfaction.\n• Effectively collaborated with cross-functional teams to design and implement various successful enhancement projects, achieving a **15%** reduction in processing time for critical transactions.\n• Involved in using tools such as **Bower**, **NPM**, and **Git** for version control and package management, streamlining development workflows.\n• Integrated cloud services like **AWS** and **Azure** to leverage scalable resources, optimizing application performance by **30%**."
    }
  ],
  "skills": " **Programming Languages** \n\t Java, C++, C#, Python, SQL, PLSQL, PHP, JavaScript, CSS, HTML\n\n **Backend Frameworks** \n\t Spring, Spring Boot, Hibernate, Struts, JPA, Kotlin, Node.js\n\n **Frontend Frameworks** \n\t React, Vue, Angular\n\n **API Technologies** \n\t RESTful APIs, SOAP, Web Services\n\n **Serverless and Cloud Functions** \n\t Microservices\n\n **Databases** \n\t MS SQL Server, Oracle, MongoDB, PostgreSQL, Redis\n\n **DevOps** \n\t Building Enhancements, Debugging, Unit Testing\n\n **Cloud & Infrastructure** \n\t Application Development, Data Modeling, Report Development, BI, Software Architecture\n\n **Other** \n\t SOLID, DRY, LINQ",
  "apply_company": "Oracle"
}