{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Elixir Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dedicated Senior Elixir Engineer with 8 years of comprehensive experience in backend development, specializing in **Elixir** and leveraging **Rust** for high-performance solutions. Proven expertise in **event-driven architecture** and **microservices**, effectively applying **Agile** methodologies and **domain-driven design** to enhance system efficiency. Strong advocate for **test-driven development (TDD)** practices, ensuring robust and maintainable code through continuous testing and refinement. Skilled in using messaging tools such as **RabbitMQ** and **Kafka** to facilitate seamless data transfer and communication between services. \n\nAlongside my primary skills, I also bring proficiency in modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside platforms including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. With a solid foundation in enterprise software development, I have successfully led projects that incorporate AI/ML capabilities, backed by significant experience with cloud services like **Azure** and **AWS**. My commitment to problem-solving and effective communication ensures successful project delivery and collaborative team dynamics.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Elixir Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and implemented **backend** solutions in **Elixir** and **Rust** following **Agile** methodologies to deliver high-quality applications with continuous integration and deployment.\n- Designed and maintained **microservices** architectures, leveraging event-driven designs using **RabbitMQ** and **Kafka**, ensuring scalability and flexibility within the system.\n- Employed **TDD** (Test Driven Development) practices to enhance code reliability and maintainability, leading to a **30%** reduction in post-deployment defects.\n- Spearheaded the transition of legacy systems to a **domain-driven** design approach, improving code understandability and project maintainability.\n- Collaborated with cross-functional teams to facilitate **problem-solving** sessions that enhanced system performance and reduced bottlenecks by **25%**.\n- Mentored junior engineers on best practices in E2E testing and service integrations, fostering a culture of communication and shared knowledge across the team.\n- Participated in code reviews and architecture discussions to continuously improve system design and code quality, contributing to an **overall team efficiency increase of 20%**.\n- Implemented responsive and user-friendly interfaces, ensuring a cohesive experience across all platforms, and utilized iterative feedback for continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Elixir** and **Rust** to develop robust backend services, ensuring optimal performance and maintainability within a **microservices** architecture, which enhanced system scalability by **30%**.\nImplemented **event-driven** architecture principles using **RabbitMQ** and **Kafka** to improve asynchronous communication across various services, facilitating real-time processing for transactions and alerts.\nAdopted **Agile** methodologies to lead cross-functional teams in project planning and execution, resulting in a **20%** increase in project delivery speed and a marked improvement in team collaboration and communication.\nEmployed **domain-driven design** practices to create scalable software solutions that accurately meet business needs in a financial environment, reducing the number of critical bugs by **15%**.\nApplied Test-Driven Development (**TDD**) techniques to ensure code quality and facilitate rapid iterations, contributing to a continuous integration pipeline that decreased deployment times by **25%**.\nConducted regular problem-solving sessions with team members to enhance workflow efficiency and brainstorm innovative solutions to complex challenges in backend service architecture."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Developed backend services utilizing **Elixir** and contributed to the implementation of microservices architecture for enhanced scalability and maintainability.\n- Employed **RabbitMQ** and **Kafka** to build event-driven systems, ensuring efficient communication between services and enabling real-time updates and processing.\n- Collaborated in an **Agile** environment, participating in daily stand-ups, sprint planning, and retrospectives to align on project goals and enhance team efficiency.\n- Applied **TDD** (Test-Driven Development) principles to ensure robust and maintainable code, leading to a **30%** reduction in production bugs.\n- Engineered microservices for critical e-commerce functionalities, improving service response times by over **25%** through optimization and refactoring.\n- Enhanced system reliability and performance through strategic problem-solving and communication across cross-functional teams, reducing incident response times by **40%**.\n- Leveraged experience in domain-driven design to align technical solutions with business requirements and user needs.\n- Contributed to system documentation and knowledge sharing, fostering a culture of continuous improvement and innovation within the development team."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript, Elixir, Rust\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRabbitMQ, Kafka\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tAgile, event-driven, microservices, domain-driven, TDD, MLflow, Airflow, Kubeflow, problem-solving, communication, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Prima"
}