{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Autonomous Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Autonomous Engineer with 10+ years of experience in software development and deployment, specializing in **Java**, **SQL**, **Oracle**, **PostgreSQL**, and **Kubernetes**. Adept in **Containerization** and **CaaS**, with substantial expertise in **Service Inventory**, **Service Provisioning**, and **Catalog Driven Orchestration** within telecom environments. Proven track record of delivering high-performance solutions featuring **NokiaFlowOne**, **xDSL**, **FTTx**, and **IP/MPLS** technologies, while leveraging **Virtualization** techniques to enhance operational efficiency.\n\nDemonstrated ability to lead agile teams in the development of enterprise platforms with a strong focus on compliance and security standards. Skilled in adopting modern technologies including **JavaScript**, **TypeScript**, and **Python** for innovative solutions, experienced in **React**, **Next.js**, **Node.js**, and **FastAPI** for full stack development. Passionate about embedding AI/ML capabilities into solutions for real-time analytics and intelligent decision-making, with practical experience in MLOps and tools like **MLflow**, **Airflow**, and **Kubeflow**. Committed to driving impactful results through robust software engineering practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Autonomous Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tUtilized **Kubernetes** and **Docker** for containerization and orchestration of microservices applications, ensuring efficient resource management and high availability in a scalable infrastructure.\n•\tImplemented **Agile** methodologies to enhance collaborative development and streamline deployment processes, achieving a 30% reduction in project turnaround time.\n•\tDesigned and maintained robust service provisioning systems for **Mobile Services** and **xDSL**, ensuring optimal performance and scalability for telecommunications tech stacks.\n•\tManaged service inventory and catalog-driven orchestration processes, enhancing operational efficiency and service delivery times by 25%.\n•\tEmployed **SQL**, **PostgreSQL**, and **Oracle** for data management, optimizing operational workflows and ensuring data integrity across platforms.\n•\tLed the adoption of **CaaS** solutions, delivering cross-platform applications that improved deployment speed by 40% while maintaining compliance with industry standards.\n•\tOversaw virtualization initiatives to maximize resource utilization, significantly reducing infrastructure costs by 20%.\n•\tDesigned and executed quality assurance strategies integrating automated testing frameworks to enhance reliability and maintainability of cloud services for telecommunications.\n•\tFacilitated the integration of advanced technologies like **IP/MPLS** and **FTTx** to improve service offerings and customer satisfaction in the telecommunications space.\n•\tMentored junior engineers on best practices in **Virtualization**, **Containerization**, and operational excellence for autonomous systems."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Leveraged **Kubernetes**, **Docker**, and **CaaS** to implement containerization strategies for deploying and scaling microservices in a dynamic network environment, enhancing availability and resource efficiency by **30%**.\nUtilized **Java** and **SQL** to develop cross-functional service provisioning systems, resulting in a **25%** reduction in deployment time for new services and improved service inventory management across various telecommunications platforms.\nExecuted **Catalog Driven Orchestration** techniques to automate service lifecycle management, leading to an increase in operational efficiency by **40%** through reduced manual interventions.\nEngaged in Agile methodologies to foster collaboration within teams, delivering high-quality projects while maintaining adherence to project timelines and budget constraints.\nImplemented virtualization solutions utilizing **IP/MPLS** and **xDSL** technologies to enhance network performance and capacity, providing **99.9%** uptime for mobile services.\nDesigned and deployed FTTx architectures to facilitate high-speed broadband connections in both urban and rural areas, significantly increasing user adoption rates across diverse demographics.\nCollaborated with cross-functional teams to integrate advanced analytics and reporting capabilities into services, employing PostgreSQL and Oracle databases to streamline data management and access.\nStreamlined service provisioning processes for mobile services, ensuring seamless integration with Cloud solutions to support future expansions and enhancements."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized service orchestration solutions for telecommunications platforms utilizing **NokiaFlowOne** and **Java**, ensuring efficient service inventory management and provisioning across mobile and fixed services.\nEngineered catalog-driven orchestration strategies leveraging **ServiceInventory** for streamlined service deployment, minimizing time-to-market for new offerings by **30%**.\nImplemented xDSL and **FTTx** technologies to enhance broadband accessibility, contributing to a network reliability increase of **25%**.\nDesigned and integrated resilient networking solutions using **IP/MPLS**, leading to improved connectivity and reduced latency in service delivery for mobile and enterprise customers.\nApplied virtualization techniques with **Docker** and **Kubernetes** for containerization, enabling efficient resource scaling and management across cloud environments, increasing operational efficiency by **40%**.\nUtilized **SQL**, **PostgreSQL**, and **Oracle** databases for effective data management and access, achieving **99.9%** uptime for critical services.\nAdopted Agile methodologies for project management, ensuring timely delivery and adaptability throughout the development cycle, leading to **15%** increases in team productivity.\nCollaborated on cross-functional teams to implement innovative mobile services, driving customer engagement and satisfaction levels to an all-time high.\nEngaged in continuous improvement processes to optimize service provisioning efforts, aligning operations with evolving market demands and technological advancements."
    }
  ],
  "skills": "Programming Languages:\n\tJava, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Oracle, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile, NokiaFlowOne, CatalogDrivenOrchestration, ServiceInventory, ServiceProvisioning, xDSL, FTTx, IP/MPLS, MobileServices, Virtualization, Containerization, CaaS",
  "apply_company": "Capgemini"
}