{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Full Stack Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Accomplished Full Stack Developer with 8 years of extensive experience in **Python** and **Full Stack Development**. Adept at managing projects effectively and collaborating with cross-functional teams in remote work environments. I specialize in designing high-performance solutions, leveraging technologies such as **JavaScript**, **TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. \nDemonstrated success in building secure and compliant applications in the healthcare and financial sectors, applying in-depth knowledge of cloud services like **Azure** and **AWS**. My previous projects include developing enterprise-grade platforms that integrate AI/ML capabilities for predictive analytics, intelligent automation, and real-time data processing. \nPossessing a strong understanding of microservices architecture, event-driven systems, and CI/CD automation, I have hands-on experience in implementing MLOps workflows utilizing tools such as **MLflow**, **Airflow**, and **Kubeflow**. My commitment to maintaining responsibility and accountability ensures successful project outcomes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** in developing scalable, full-stack healthcare and financial platforms, ensuring the delivery of high-quality software solutions.\nArchitected both front-end and back-end components using modern frameworks, leveraging **Full Stack Development** methodologies to create responsive applications.\nCollaborated effectively in **Remote Work** settings to manage and drive projects, ensuring adherence to deadlines and project milestones.\nDemonstrated strong **Project Management** skills by coordinating across teams to align on goals and deliver results.\nLed seamless communication and **Collaboration** with cross-functional teams to incorporate user feedback and integrate requirements into the project efficiently.\nEmphasized **Responsibility** in maintaining compliance with industry regulations such as HIPAA, FHIR, and PCI DSS throughout the software development lifecycle.\nDesigned cloud-native data architecture with **PostgreSQL** and **MongoDB**, optimizing for large-scale data handling, processing over **1 million** transactions daily.\nImplemented CI/CD pipelines for mobile apps using **Fastlane** and **App Center**, achieving a deployment frequency of **5 times per week** with automated testing.\nDeveloped and deployed machine learning models utilizing **scikit-learn** and **TensorFlow**, achieving **85%+ accuracy** in patient risk prediction models.\nIntegrated advanced programming features using **D3.js** and **Chart.js** for financial data visualization, providing insights driven by real-time analytics for **over 10,000** users.\nEstablished robust test strategies utilizing **Jest** and **Cypress**, achieving **99% code coverage** and ensuring application reliability across multiple environments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to lead the development of both front-end and back-end components in a **Full Stack Development** capacity, ensuring a seamless integration that enhances overall application performance.\nManaged multiple projects concurrently while maintaining collaboration across remote teams, contributing to an efficient **Project Management** workflow that facilitated timely delivery of software solutions.\nDeveloped and maintained scalable web applications with advanced technologies including **Node.js** (NestJS/Express), **React** (18), and **TypeScript**, achieving a 30% improvement in load time for user-facing interfaces.\nImplemented a microservices architecture to modernize legacy systems, increasing system throughput by over 50% and enhancing maintainability of the codebase.\nOrchestrated ETL processes using **Python**, **Apache Airflow**, and **Azure Data Factory** for real-time data ingestion from various sources, managing over **1 million** transactions daily.\nCollaborated with cross-functional teams to design and implement AI-driven fraud detection systems using **scikit-learn** and **XGBoost**, detecting **95%** of fraudulent transactions through predictive analytics and pattern recognition.\nEmployed real-time monitoring dashboards built with **React** and **D3.js**, providing decision-makers with critical insights into financial activities, improving response times by **40%** on average."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** for Full Stack Development, implementing backend services across a global e-commerce platform, achieving high availability and scalability in key modules, with a focus on checkout and order fulfillment.\nLed the integration of **Node.js** frameworks such as **NestJS** and **Express** to enhance application responsiveness, ensuring low latency for critical user interactions and workflows.\nCollaborated with cross-functional teams to design and optimize frontend applications using **React (18)**, **Vue 3**, and **Angular**, providing a seamless user experience across web and mobile platforms.\nManaged project timelines and deliverables effectively in a **remote work** setting, ensuring successful team collaboration and timely project completion, and consistently delivering projects on time within a **9-month** timeframe.\nEngineered real-time features utilizing **WebSockets** and event-driven architecture with **Kafka** and **RabbitMQ**, which led to a **50%** reduction in order processing time by enabling instantaneous order updates and improved inventory management.\nDeveloped robust data storage solutions employing **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra**, maintaining fast access to data for high-traffic workflows and implementing caching strategies that improved response time by **30%**.\nLeveraged AI/ML techniques with tools such as **scikit-learn**, **LightGBM**, and **TensorFlow**, resulting in personalized product recommendations that increased conversion rates by **15%** based on behavioral analytics.\nImplemented application optimizations using caching mechanisms with **Redis** for metadata and active sessions, enhancing response times significantly while lowering database read pressure by **20%**.\nManaged deployment strategies with **Kubernetes** and **LaunchDarkly**, successfully conducting A/B testing and controlling feature rollouts, which minimized risks during platform updates.\nDesigned SEO-friendly and accessible UI components using **Next.js**, enhancing the e-commerce interface to comply with **WCAG 2.1**, along with **HTML5/CSS3**, to ensure a mobile-first experience that improved user engagement metrics by **25%**.\nOrchestrated secure payment systems using **Stripe**, **PayPal**, and **Razorpay**, ensuring adherence to PCI compliance and effective handling of sensitive transaction data.\nApplied **role-based access control (RBAC)** and **OAuth 2.0** strategies to maintain high-level security for user data, ensuring GDPR compliance and rigorous protection protocols across the platform."
    }
  ],
  "skills": "Programming Languages:\n\t**Python**\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tN/A\n\n**Other:**\n\tFull Stack Development, Project Management, Remote Work, Collaboration, Responsibility, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}