{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of extensive experience in developing and implementing scalable applications. Proficient in **C++**, **Docker**, **Kubernetes**, and **Cloud** technologies, with a solid foundation in operating systems and networking principles. Skilled in utilizing **Python**, **Rust**, and **Go** for building efficient back-end systems. Adept at applying modern software development methodologies and practices to enhance project delivery and performance. Proven track record of successfully leading cross-functional teams and fostering collaboration to achieve project goals while optimizing development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Docker** and **Kubernetes** for containerization and orchestration, enhancing application deployment efficiency by 30%.\nDeveloped cloud-native applications applying **C++**, **Go**, and **Python** for high-performance applications on **Linux** environments, resulting in improved system reliability.\nImplemented networking protocols and optimized kernel functionalities, increasing system performance by **15%**.\nUtilized **eBPF** for performance monitoring and network traffic management, enabling real-time analytics and troubleshooting.\nDesigned and executed microservices using **Go**, ensuring inter-service communication was efficient, scalable, and maintainable for high-traffic applications.\nCollaborated with cross-functional teams to enhance system resilience by leveraging modern development practices and by employing **Linux** based services.\nContributed to the development of toolchains for orchestration and management of cloud resources, improving deployment consistency across **Cloud** platforms.\nConducted code reviews and mentored junior developers in best practices concerning **C++**, **Rust**, and their integration with scalable server environments.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented robust software solutions in **C++** and **Python**, enhancing module performance by **20%** through optimized algorithms.\nDeveloped applications in a **Linux** environment, ensuring cross-platform compatibility and stability across **3** different distributions.\nUtilized **Docker** to containerize applications, improving deployment efficiency by **40%** and enabling seamless integration with **Kubernetes** for orchestration.\nDesigned and optimized networking protocols, contributing to a **15%** reduction in latency and increased data throughput in critical systems.\nExplored and applied **eBPF** for performance monitoring and security auditing, facilitating real-time insights into kernel operations.\nCollaborated with cross-functional teams to deliver high-quality software solutions by adhering to Agile methodologies and ensuring project milestones were met.\nMentored junior engineers on best practices in **Go** and **Rust**, promoting a culture of continuous learning and technological innovation within the team.\nConducted system performance evaluations, resulting in recommendations that led to a **30%** optimization in resource usage across deployments.\nProduced documentation for systems and processes, ensuring clarity and maintenance of knowledge sharing within the engineering team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and maintained performant applications in **C++** and **Python**, enhancing system efficiency by 30%.\n• Leveraged **Docker** and **Kubernetes** for container orchestration, improving deployment consistency across environments by 25%.\n• Implemented **Linux** kernel modules, resulting in a **15%** reduction in system resource usage.\n• Utilized **eBPF** for enhanced networking capabilities, boosting traffic management efficiency by **40%**.\n• Developed cloud-native applications using **Rust** and **Go**, increasing scalability and reliability of services.\n• Optimized networking protocols to handle increased throughput, achieving a **50%** performance gain.\n• Conducted performance tuning and troubleshooting, leading to an overall application downtime reduction of **10%**.\n• Collaborated with cross-functional teams to ensure seamless integration of cloud solutions, improving workflow efficiency.\n• Engaged in code reviews and knowledge sharing to uphold coding standards and best practices across the team.\n• Authored comprehensive technical documentation, facilitating better understanding and usability of developed solutions."
    }
  ],
  "skills": " **Programming Languages:** C++, Rust, Go, Python, HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Solidity, Ether.js, Web3.js, C#, .NET\n\n **Backend Frameworks:** NodeJS, ExpressJS, NestJS, Microservices, Entity Framework\n\n **Frontend Frameworks:** React Native, Flutter, Material UI, Three.js, D3.js, Chakra UI, TailwindCSS\n\n **API Technologies:** RESTful API, GraphQL\n\n **Serverless and Cloud Functions:** AWS, Azure\n\n **Databases:** MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps:** Docker, Kubernetes, CI/CD pipelines\n\n **Cloud & Infrastructure:** Cloud, Linux, Networking\n\n **Other:** Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, UX/UI Design, Apache Kafka, RabbitMQ, Redis, Kernel, eBPF, Blockchain",
  "apply_company": "SentinelOne"
}