{
  "name": "Rei Taro",
  "role_name": "Senior Sales Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Sales Engineer with over 10 years of experience in technical presentation and customer-focused engagements, specializing in sales engineering for advanced internet security solutions. Proficient in messaging protocols including **HTTP**, **SMTP**, and **DNS**, with comprehensive knowledge of security certifications such as **Security+**, **SSCP**, **CISSP**, and **CEH**. Recognized for emotional intelligence and exceptional discovery skills to understand client needs effectively. Strong background in backend development, leveraging **Python** (FastAPI, Django, Flask) to create responsive technical demonstrations, alongside experience with cloud platforms including **AWS** and **Azure**. Proven ability to drive technical discussions and support sales processes, contributing to substantial projects at industry-leading organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Conducted technical presentations to clients, aligning backend solutions in **Python** with **FastAPI** to improve sales engineering processes involving document automation and user onboarding.\nUtilized emotional intelligence and discovery skills to understand customer needs, ensuring tailored solutions that address key challenges.\nDeveloped secure messaging protocols, including **HTTP**, **SMTP**, and **DNS** to enhance system reliability and communication.\nImplemented internet security measures and completed security assessments leveraging certifications such as **Security+**, **SSCP**, **CISSP**, and **CEH** to fortify system defenses.\nFacilitated collaboration with cross-functional teams to integrate solutions effectively and meet compliance standards, optimizing workflows.\nPresented findings and strategic insights using **PowerPoint** and **Google Slides**, supporting decision-making and fostering customer relationships.\nProvided expert guidance on managing asynchronous processing for financial transactions using **Celery** and **Redis**, ensuring efficiency for **9** key transaction workflows.\nDrove the deployment of microservices on **Azure App Services**, with a focus on using **Terraform** to manage infrastructure as code efficiently, leading to **30%** faster deployment times."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Provided technical presentations and product demonstrations to clients, leveraging **PowerPoint** and **Google Slides** to effectively communicate complex concepts.\nDemonstrated advanced understanding of **internet security** principles, ensuring adherence to **Security+**, **SSCP**, **CISSP**, and **CEH** frameworks in all technical solutions.\nUtilized **messaging protocols** such as **HTTP**, **SMTP**, and **DNS** for seamless integration and communication between systems, enhancing customer engagement.\nConducted in-depth discovery sessions with clients to understand their needs, fostering customer focus and emotional intelligence in addressing their concerns.\nCollaborated with engineers to develop sales strategies that combine technical knowledge with real-world applications, ensuring successful proposal outcomes for **9** key clients in **2023**.\nLeveraged emotional intelligence to build strong relationships, resulting in a **15%** increase in customer satisfaction scores over the last quarter.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed and delivered dynamic technical presentations to clients, enhancing understanding of backend services and their relation to sales engineering strategies.\nLeveraged digital tools such as **PowerPoint** and **Google Slides** to craft compelling presentations that effectively communicate technical concepts to diverse audiences.\nImplemented robust **internet security** measures ensuring compliance with best practices such as **Security+**, **SSCP**, **CISSP**, and **CEH** for protecting customer data during trade executions.\nUtilized industry-standard **messaging protocols** including **HTTP**, **SMTP**, and **DNS** to optimize communication and data exchange between systems and stakeholders.\nPromoted a customer-focused approach by effectively using **discovery skills** to understand client needs and tailor presentations accordingly, achieving a 30% increase in engagement scores.\nEmphasized the importance of **emotional intelligence** during client interactions, leading to a 20% improvement in client relationships feedback.\nGuided cross-functional teams in discussions around technical solutions, leveraging real-time data processing skills to align products with client requirements.\nFacilitated communication between development and sales teams, ensuring clarity around product offerings and their technical capabilities."
    }
  ],
  "skills": "**Programming Languages**\n\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\n\tPowerPoint, Google Slides\n\n**API Technologies**\n\n\tREST/gRPC APIs, HTTP, SMTP, messaging protocols\n\n**Serverless and Cloud Functions**\n\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\n\tInternet security, Security+, SSCP, CISSP, CEH\n\n**Other**\n\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, Git, customer focus, emotional intelligence, discovery skills, sales engineering, technical presentation",
  "apply_company": "Abnormal AI"
}