{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I specialize in **Full-stack Development** utilizing **React**, **TypeScript**, and **Python** to drive high-performance solutions within the healthcare and financial sectors. My extensive expertise includes working with **GraphQL**, **MySQL**, **Redis**, and **Memcached**, complemented by my ability to create seamless **User Experiences**. I have a proven track record in leading teams and fostering collaboration, thereby enhancing productivity and achieving project goals.\n\nThroughout my career, I've developed enterprise-grade platforms that integrate AI/ML capabilities and adhere to compliance standards such as HIPAA and PCI DSS. My work is backed by a solid foundation in modern frameworks such as **Next.js**, **Node.js**, **FastAPI**, and **Django**, as well as cloud services like **Azure** and **AWS**. Additionally, I have hands-on experience in building machine learning pipelines and implementing MLOps workflows using tools like MLflow and Airflow. My technical prowess, combined with my leadership skills and a strong focus on delivering innovative solutions, positions me as a valuable asset to any development team.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** and **TypeScript** to architect and develop scalable, full-stack healthcare and financial platforms, ensuring optimal **user experience** and compliance with regulatory standards including HIPAA and PCI DSS.\nEmployed **GraphQL** for efficient data retrieval and management within applications, enhancing collaboration between front-end and back-end teams.\nLed cross-functional teams in the implementation of machine learning features powered by **Python**, driving insights and predictive analytics tailored to user needs.\nCoached and mentored junior developers, enhancing team skills and fostering a culture of continuous improvement and **collaboration**.\nDesigned and maintained cloud-native databases using **Redis** and **MySQL**, optimizing performance for high-volume transactions and large-scale data storage solutions.\nArchitected mobile applications with cross-platform tools, utilizing **React Native** for seamless integration and **user experience** across iOS and Android devices.\nImplemented responsive and engaging user interfaces, ensuring accessibility and ease of use, which contributed to a 30% increase in user satisfaction ratings.\nExecuted enterprise-level **DevOps** practices with automated CI/CD pipelines using tools like GitHub Actions, resulting in a 40% reduction in deployment time for web and API services.\nParticipated in the integration of complex AI features, enhancing products with intelligent functionalities tailored to financial and healthcare applications, increasing client engagement by 25%.\nAuthored comprehensive unit tests using **Jest** and **PyTest**, resulting in improved code quality and a significant reduction of bugs in production, down to 5%.\nCollaborated with data teams to integrate advanced search capabilities, utilizing **Elasticsearch**, leading to improved retrieval times for unstructured health records and financial documents by up to 50%."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained dynamic, user-focused applications utilizing **React (18)**, **TypeScript**, and **GraphQL**, enhancing user experience and engagement for financial platforms.\n• Led full-stack development initiatives that incorporated **Python** for backend functionalities and **MySQL** for robust data management and transactions, improving performance and reliability of banking systems.\n• Engaged in mentoring and coaching team members while fostering collaboration across multidisciplinary teams, enhancing overall project delivery and team productivity.\n• Integrated caching strategies using **Memcached** and **Redis** to optimize application responsiveness and reduce latency for financial transactions.\n• Designed and implemented AI-driven solutions focusing on user experience, leveraging machine learning models and insights to continuously improve application features based on user data.\n• Spearheaded the development of efficient database systems using **MyRocks** and conducted performance tuning to support high-volume transactions with improved throughput by **40%**.\n• Actively contributed to team leadership and collaboration efforts to establish best practices and improve overall software quality, leading to a **30%** decrease in bug reports.\n• Developed modular and scalable services utilizing cloud technologies and frameworks that improved functionality across multiple platforms by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **React (18)** and **TypeScript** to develop responsive user interfaces, ensuring an intuitive and engaging user experience that aligns with best practices in **Full-stack Development**.\nEmployed **Python** for backend development, leveraging frameworks such as **FastAPI** and **Django** to create robust, scalable services that support over **10,000** concurrent users on a global e-commerce platform.\nImplemented **GraphQL** APIs for efficient data fetching, reducing data transfer by **40%** and improving overall application performance.\nEngineered data caching solutions using **Redis** and **Memcached**, resulting in a **60%** reduction in database load and significantly enhancing application responsiveness.\nLed a team of **5** developers in agile practices, fostering collaboration through coding standards and pair programming, aimed at enhancing code quality and team productivity.\nIntegrated AI features through **machine learning frameworks** like **scikit-learn** to personalize user experiences, contributing to a **15%** increase in conversion rates based on real-time behavioral analysis.\nDesigned and maintained databases using **MySQL** and **MyRocks**, ensuring data integrity and availability across multiple application modules for efficient e-commerce operations.\nFacilitated cross-functional collaboration by coaching team members on modern technologies and user experience design principles, enhancing team capability and project outcomes.\nImplemented secure coding practices with **role-based access control (RBAC)** and **OAuth 2.0**, ensuring compliance with **GDPR** and safeguarding user data integrity across the platform."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, Vue, Angular, Typescript\n\n**Backend Frameworks:**\n\tPython(FastAPI, Flask, Django)\n\n**API Technologies:**\n\tGraphQL\n\n**Databases:**\n\tPostgreSQL, MySQL, MyRocks, MongoDB, Redis, Memcached\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Full-stack Development, AI, User Experience, Team Leadership, Collaboration, Coaching"
}