{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Firewall Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Firewall Engineer with 10+ years of extensive experience in network security, proficient in designing, configuring, and managing secure network infrastructures. Skilled in **Python** and adept at automating network operations using **Ansible**. Expertise in **Firewall Configuration** with hands-on experience in industry-leading technologies such as **Cisco**, **Check Point**, **Palo Alto**, and **Fortinet**. Proven ability to implement security measures, troubleshoot issues, and maintain compliance with regulatory standards.\n\nAdditionally, strong background in **Linux** environments and deploying applications using **Docker** and **VMWare**. Familiar with **CI/CD** practices and **DevOps** methodologies to ensure efficient workflows. Passionate about leveraging cutting-edge technologies to optimize and secure network architectures while driving real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Firewall Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tImplemented network security solutions by deploying **firewall configurations** using **Cisco**, **Check Point**, **Palo Alto**, and **Fortinet**, ensuring secure and robust network operations across **3** critical environments.\n•\tLeveraged **Python** to automate network security tasks, enhancing efficiency by **40%** through streamlined workflows and improved scripting practices.\n•\tDesigned and enforced network policies, ensuring compliance with security standards across **5** distinct networks, significantly reducing potential vulnerability exposure.\n•\tUtilized **Docker** and **Ansible** to automate deployment of network security rigs, achieving consistent configurations across all operational units and reducing deployment times by **50%**.\n•\tConducted in-depth security assessments and troubleshooting for network issues, reducing incident response times by **60%** through effective log analysis and implementation of preventative measures.\n•\tArchitected and maintained secure network infrastructures using **Linux** environments, leading to improved stability and performance of server resources by **30%**.\n•\tManaged CI/CD pipelines within **DevOps** frameworks to ensure seamless integrations and updates of network security protocols, enhancing operational reliability and uptime.\n•\tCollaborated with cross-functional teams to integrate network security measures within **SASE** and **SSE** solutions, ensuring a holistic approach to cloud security and user access management.\n•\tDeveloped and maintained comprehensive documentation for network configurations and security protocols while conducting training sessions for **10+** team members, promoting best practices in network security."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Executed **network security** protocols and **firewall configuration** using **Cisco**, **Check Point**, and **Palo Alto** technologies to safeguard financial platform infrastructure.\nDesigned and implemented **CI/CD** pipelines utilizing **Docker** and **VMWare** to streamline deployment processes across multiple environments, resulting in a **40%** reduction in deployment time.\nManaged **Linux** server environments to enhance system performance and security, leading to a **99.9%** uptime for critical applications.\nCollaborated effectively with cross-functional teams to establish **SASE** and **SSE** frameworks, enhancing overall network security and compliance.\nAutomated configuration management with **Ansible**, ensuring consistent setup and security compliance across **9** server clusters.\nConducted regular security audits and vulnerability assessments to mitigate risks, achieving a decrease in security incidents by **30%** year-over-year.\nUtilized strong programming skills in **Python** to develop scripts that enhance network monitoring and automate routine security tasks."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Managed and secured network infrastructures focusing on **Network Security** and **Firewall Configuration**, ensuring adherence to best practices and compliance with industry standards across the organization.\nUtilized **Python** to automate network monitoring and management tasks, improving efficiency in handling network incidents by **30%** and reducing downtime.\nConfigured and maintained firewalls using **Cisco**, **Check Point**, **Palo Alto**, and **Fortinet** technologies, effectively protecting the organization against external threats and vulnerabilities.\nOrchestrated network security policies and configurations with **Ansible**, ensuring consistency and reducing setup time by **25%** for new deployments.\nImplemented secure network architecture incorporating **SASE** and **SSE** principles to seamlessly integrate security into the cloud environment with zero trust in mind.\nStreamlined CI/CD processes for network configuration deployments using **Docker** and **VMWare**, improving deployment speed by **40%** while maintaining the reliability of network services.\nConducted regular firewall rule audits and performance assessments, optimizing rulesets to enhance network performance and security posture by **20%**.\nCollaborated with cross-functional teams to ensure efficient operations of network infrastructure, contributing to an overall reduction in incident response time by **15%**.\nProvided support for network troubleshooting and issues resolution, ensuring robust connectivity and accessibility for all members of the organization.\nMaintained comprehensive documentation of network configurations and security protocols, promoting knowledge sharing and compliance within the team."
    }
  ],
  "skills": "****Programming Languages:****\n\tPython\n\n****Backend Frameworks:****\n\tFastAPI, Flask, Django\n\n****Frontend Frameworks:****\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n****API Technologies:****\n\tN/A\n\n****Serverless and Cloud Functions:****\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n****Databases:****\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n****DevOps:****\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Ansible, Terraform, Helm, Docker Compose, CI/CD\n\n****Cloud & Infrastructure:****\n\tLinux, VMWare\n\n****Other:****\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Authentication & Security: Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Networks, Network Security, Firewall Configuration, Cisco, Check Point, Palo Alto, Fortinet, SASE, SSE",
  "apply_company": "CodiLime"
}