{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Elixir Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Elixir Engineer with 13+ years of experience delivering scalable and high-performance applications. Proficient in **Elixir**, with a strong emphasis on **functional programming**, **microservices**, and **event-driven architectures**. Adept at implementing **domain-driven design** (DDD) and adhering to **Agile** methodologies for efficient project management. Extensive experience in **troubleshooting** and **debugging**, complemented by expertise in **code reviews**, ensuring maintainable **code modularity**.\nSkilled in backend development with a solid foundation in JavaScript/TypeScript, Python, and **Flutter**. Hands-on experience with frameworks and libraries including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Familiar with **RabbitMQ** and **Kafka** for messaging services. Proven success in building AI/ML-powered platforms for predictive analytics and automation, while proficiently deploying cloud-native systems on **AWS** and **Azure**. Committed to **continuous learning** and alignment with compliance standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Elixir Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust **backend** solutions utilizing **Elixir** and functional programming principles, ensuring high scalability and maintainability through effective **code modularity** and adherence to **TDD** practices.\n• Designed and implemented **microservices** architectures, employing **event-driven architecture** patterns with **RabbitMQ** and **Kafka** to facilitate efficient communication between services.\n• Led Agile development processes, fostering a culture of **collaboration** and continuous learning within cross-functional teams, while ensuring adherence to best practices during **code reviews**.\n• Delivered comprehensive solutions involving troubleshooting and debugging of complex system interactions, enhancing overall reliability and performance of applications in production.\n• Facilitated communication with stakeholders to gather requirements, manage expectations, and provide updates throughout project lifecycles, enhancing transparency and trust.\n• Contributed to the establishment of testing frameworks to maintain high code quality through rigorous testing strategies, promoting confidence in new features and updates.\n• Implemented best-practice methodologies in systems design to optimize performance, ensuring systems could manage increased loads and adapt to changing requirements efficiently.\n• Worked on integrating external services, enhancing application functionality, and improving user experience through intuitive design and responsive interfaces.\n• Engaged in peer programming and mentorship opportunities to nurture the skills of junior developers and enhance team performance through shared knowledge and best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Led the transformation of core financial platforms towards a **microservices** architecture using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, increasing system scalability and accommodating **9 million** transactions per day.\n• Utilized **Agile** methodologies to enhance team collaboration and foster continuous learning environments, regularly engaging in **code reviews** to maintain high code quality across all releases.\n• Engineered asynchronous messaging with **RabbitMQ** and **Kafka**, establishing a resilient **event-driven architecture** that improved workflow efficiency for critical processes like payments and alerts, reducing downtime by **25%**.\n• Championed **domain-driven design** principles in application development which led to better **code modularity** and maintainability across multiple microservices, contributing to a **30%** reduction in deployment times.\n• Developed robust troubleshooting and debugging strategies, which improved system reliability and reduced issue resolution time by **40%** through the integration of effective monitoring tools.\n• Built interactive front-end applications with **React (18)**, **Vue 3**, and **Next.js**, resulting in a seamless user experience for financial tools and admin panels, while maintaining **scalability** for increasing users.\n• Delivered real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, empowering operations teams with immediate insights into financial transactions, thus cutting down anomaly detection time to less than **2 hours**.\n• Designed and set up efficient ETL pipelines for data ingestion leveraging **Apache Airflow** and **Azure Data Factory**, supporting both batch and real-time processing, ensuring seamless integration of **financial data** from **3** internal and external sources.\n• Deployed and maintained machine learning models for proactive fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, which reduced fraudulent transaction rates by **15%** through real-time analysis of transaction patterns."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Engineered robust backend services utilizing **Elixir**, with a focus on **microservices** architecture and **functional programming**, ensuring high scalability and maintainability.\n• Developed and deployed **event-driven architecture** with tools like **RabbitMQ** and **Kafka**, enhancing the efficiency of real-time feature implementations and system responsiveness.\n• Advocated **Agile** methodologies, collaborating effectively with cross-functional teams to drive code reviews and ensure adherence to best practices in **TDD** (Test-Driven Development).\n• Optimized system performance and reliability through strategic **troubleshooting**, **debugging**, and proactive developments aimed at preventing future issues.\n• Enhanced application modularity, applying principles of **domain-driven design** to streamline functions across diverse system components, impacting scalability positively.\n• Participated in continuous learning initiatives, keeping abreast of industry trends and technologies to improve project outputs and foster a culture of innovation within the team.\n• Collaborated with teams on communication protocols and tools, ensuring seamless project updates, and maintaining clarity throughout the development lifecycle.\n• Helped in refining backend processes that resulted in a **30%** reduction in deployment time, directly contributing to the overall efficiency of the development cycle.\n• Engaged in regular knowledge-sharing sessions, improving team skills in **scalability** and system architecture, which contributed to a **40%** increase in project delivery speed."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tFastAPI, Flask, Django, Elixir, microservices, event-driven architecture\n\n**Programming Languages:**\n\tPython, JavaScript, TypeScript, functional programming\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRabbitMQ, Kafka\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tAgile, TDD, troubleshooting, debugging, collaboration, communication, code reviews, code modularity, scalability, continuous learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n",
  "apply_company": "Prima"
}