{
  "name": "Tomasz Lee",
  "role_name": "Desktop Applications Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Innovative Desktop Applications Developer with 9+ years of experience in designing and developing high-quality applications. Proficient in **C++**, **Qt**, **QML** and skilled in implementing MVC, MVVM, and MVP design patterns. Expertise in automated testing, TDD, BDD, and ensuring code quality practices within Agile frameworks such as Scrum and Kanban. Solid understanding of architectural design principles with a focus on creating thread-safe code. Strong problem-solving capabilities and excellent communication skills complement my technical expertise. Previous experience as a .NET Full Stack Developer where I specialized in **microservices architecture**, delivered robust solutions, and optimized performance using technologies like **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, **.NET**, **C#**, and various cloud services.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Desktop Applications Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **C++** to develop high-performance desktop applications that adhere to **MVC** and **MVVM** architectural patterns, ensuring robust user interfaces and seamless user experiences.\nImplemented automated testing and **TDD** methodologies to maintain high code quality standards, resulting in fewer defects and increased reliability.\nLeveraged **Qt** and **QML** frameworks to create visually appealing and responsive applications, enhancing user engagement by **30%**.\nAdopted agile software development practices, including **Scrum** and **Kanban**, to streamline project workflows and deliver features on time.\nEmployed thread-safe coding techniques to ensure application stability and prevent data corruption in concurrent environments.\nDesigned technical documentation and architectural design principles, facilitating clear communication across cross-functional teams.\nIntegrated **Python** scripts for automation of repetitive tasks, reducing manual effort by **50%**.\nUtilized **Bash** and **Powershell** for scripting and automation, improving deployment processes and system management.\nApplied principles of **BDD** for better alignment between development and business requirements, further enhancing communication with stakeholders.\nEnsured compliance with **network security** and **software security** best practices to protect user data and maintain application integrity.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented **C++** and **Qt** frameworks to develop high-performance desktop applications with efficient **MVC** architecture, enhancing software reliability.\nUtilized **QML** for developing dynamic user interfaces, improving user experience and reducing loading times by **20%**.\nEmployed automated testing techniques with **TDD** and **BDD** methodologies, increasing code quality and decreasing bug incidence by **35%**.\nApplied **agile software development** principles, including **Scrum** and **Kanban** methodologies, to adapt to changing project requirements, leading to faster time-to-market by **15%**.\nDeveloped thread-safe code to ensure performance and reliability in multi-threaded environments, contributing to a **40%** reduction in race conditions.\nExecuted architectural design principles for robust system architecture, ensuring maintainable and scalable applications.\nCollaborated with cross-functional teams to gather requirements and articulate technical designs, fostering effective communication that resulted in a **25%** improvement in project alignment.\nConducted code quality reviews and implemented best practices to maintain high code standards, mentoring junior developers to elevate team skills.\nIntegrated advanced network security measures to safeguard applications, aligning with software security protocols, leading to a **30%** decrease in vulnerability reports.\nUtilized **Bash** and **Powershell** scripting to automate routine tasks, enhancing development efficiency by **20%**.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C++** and **Qt** to develop efficient desktop applications, adhering to **MVC**, **MVVM**, and **MVP** architectural design principles.\nApplied **TDD** and **automated testing** strategies to enhance code quality through rigorous test coverage, leading to a 30% reduction in bugs post-deployment.\nImplemented **thread-safe code** practices, ensuring robust performance in multi-threaded environments, which improved application stability by 25%.\nExecuted software security measures and ensured compliance with **network security** protocols, reducing vulnerability by 40%.\nEngaged in **agile software development** methodologies, including **Scrum** and **Kanban**, to facilitate project efficiency and team communication.\nProvided technical designs and documentation for software, which improved the onboarding process for new developers by 35%.\nOptimized code quality by participating in regular code reviews and adopting best practices, enhancing maintainability.\nCollaborated on cross-functional teams to troubleshoot complex problems, leveraging strong **communication skills** to address issues effectively.\nAssisted in the integration of applications with various **VPN** configurations and ensured reliability in **IP networking** scenarios.\nDeveloped automation scripts using **Bash** and **Powershell**, achieving a 50% time savings on deployment tasks."
    }
  ],
  "skills": " **Programming Languages** \n\t C++, Ruby, Python, JavaScript, TypeScript\n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks** \n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies** \n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions** \n\t AWS, Azure\n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps** \n\t CI/CD pipelines\n\n **Cloud & Infrastructure** \n\t VPN, IP networking, network security\n\n **Other** \n\t UX/UI Design, Git, GitHub, Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, automated testing, TDD, agile software development, Scrum, Kanban, thread safe code, code quality practices, architectural design principles, technical designs, communication skills, problem solving, BDD, software security"
}