{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Lead Android Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Lead Android Engineer with 13+ years of experience in delivering high-performance applications, specializing in mobile development with **Android** and **Kotlin**. Proficient in building effective **RESTful APIs**, integrating **third-party integrations**, and adhering to coding standards, ensuring quality and maintainability of software.\nDemonstrated expertise in agile methodologies and providing technical leadership to drive project success. Possessing a solid foundation in **Java**, understanding architectural patterns including **MVC**, **MVVM**, and **MVP**. Experienced in developing high-quality applications that align with business objectives and enhanced user experience.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Lead Android Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Led technical direction and architectural design for Android applications using **Java** and **Kotlin**, ensuring adherence to **coding standards** and best practices throughout the development lifecycle.\nDeveloped and maintained mobile applications for Android platforms, incorporating **RESTful APIs** and **third-party integrations** to enrich user experience and functionality.\nImplemented agile methodologies to streamline project management, resulting in a **30%** improvement in project delivery time and fostering team collaboration.\nProvided technical leadership and mentorship for a team of **9** developers, conducting code reviews and encouraging adherence to **MVC**, **MVVM**, and **MVP** design patterns.\nEnhanced application performance and security by integrating robust testing strategies with tools like **JUnit** and **Mockito** to ensure high-quality deliverables.\nCollaborated with cross-functional teams to define and fulfill development requirements, successfully launching **5+** applications and driving user engagement metrics up by **40%**.\nManaged project timelines and resources effectively, resulting in on-time delivery of all milestones with a **0%** critical defect rate.\nEvaluated and adopted new technologies that improved team productivity, including automated deployment tools and integrated development environments, leveraging best practices in **Agile** methodologies.\nDefined and tracked key performance indicators for applications, ensuring alignment with business strategies and user needs through iterative development cycles. \nConducted regular sprint reviews and retrospectives, leading to continuous improvement in processes and team dynamics."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Led the design and implementation of **RESTful APIs** for Android applications using **Kotlin** and **Java**, ensuring scalability and maintainability in line with **coding standards**.\nApplied **Agile** methodologies to manage project teams, improving delivery time by **30%** while maintaining **quality** and **efficiency** through continuous integration and testing practices.\nOversaw third-party integrations, including payment gateways and social media APIs, enhancing app functionalities and improving user engagement metrics by **25%**.\nProvided technical leadership and mentoring to junior developers, fostering a culture of best practices in **MVC**, **MVVM**, and **MVP** architectural patterns, which resulted in a **15%** reduction in code defects.\nFacilitated the adoption of modern development tools and frameworks, ensuring the team stays up-to-date with the latest technologies to enhance productivity and deliver cutting-edge solutions.\nParticipated in code reviews and design discussions to ensure alignment with project goals and adherence to **Agile** principles, contributing to a cohesive team environment and improved performance across projects.\nChampioning technical debt reduction initiatives, successfully achieving a **20%** decrease in backlog tasks by promoting efficient coding practices and effective project management strategies."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Led the design and implementation of **RESTful APIs** for mobile applications, ensuring seamless integration of third-party services and aligning with **Agile** methodologies.\nEngineered robust Android applications using **Kotlin** and **Java**, adhering to **MVC**, **MVVM**, and **MVP** architectural patterns, delivering high-performance solutions.\nEstablished coding standards and best practices for a team of developers, improving code quality and maintainability by **30%** over **6 months**\nPlayed a pivotal role in technical leadership through regular code reviews, mentoring team members, and fostering a culture of continuous improvement in coding standards.\nCollaborated with cross-functional teams to design and implement efficient **third-party integrations**, enhancing application features and functionality in response to user feedback.\nImplemented Agile project management practices to prioritize tasks, ensuring timely delivery of application features in **sprints**, resulting in a **40%** increase in project efficiency.\nDeveloped mobile applications with a focus on **Android** development tools, optimizing performance for various devices and screen sizes, achieving compatibility across **90%** of the Android market.\nApplied rigorous testing and quality assurance (QA) processes throughout the development cycle, ensuring a defect rate of less than **2%** in released versions.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Kotlin, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs, third-party integrations\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda; Azure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database; Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tAgile, MVC, MVVM, MVP, coding standards, technical leadership, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}