{
  "name": "Rei Taro",
  "role_name": "Senior Network Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Network Engineer with over 10 years of experience in **Data Center Networking**, **Architecture**, and **Operations**. Proficient in implementing **network tools** and strategies that enhance **troubleshooting** capabilities while driving **continuous improvement** initiatives. Additionally, I bring a strong background in backend development with expertise in creating high-performing APIs and scalable services, utilizing technologies such as **Python (FastAPI, Django, Flask)**, cloud platforms like **AWS** and **Azure**, and designing solutions for financial systems and AI/ML pipelines. Proven success in delivering impactful projects for renowned organizations including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Network Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Executed troubleshooting strategies and continuous improvement initiatives to enhance network performance and reliability.\nManaged and optimized data center networking to ensure efficient operations and seamless connectivity, utilizing network tools for monitoring and management.\nDeveloped comprehensive network architecture designs to support scalable infrastructure solutions, ensuring alignment with business requirements and policies.\nUtilized BGP (Border Gateway Protocol) for efficient routing and to enhance overall network stability in dynamic environments.\nImplemented robust operations processes that improved system uptime by **15%** and reduced incident response times by **20%**.\nCollaborated with engineering teams to integrate new technologies and resolve system integration challenges effectively, maintaining a robust network infrastructure.\nLeveraged advanced analytics to drive troubleshooting efforts and inform strategic operational decisions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Managed and optimized **Data Center Networking** operations to ensure seamless connectivity, reliability, and performance across all systems.\nExecuted continuous improvement projects aimed at enhancing network architecture, resulting in a **15%** reduction in downtime.\nLeveraged network tools for efficient troubleshooting and monitoring of network performance, directly contributing to an increase in operational efficiency by **20%**.\nDesigned and implemented robust network architecture solutions, aligning with business requirements and best practices to facilitate scalability and performance improvement.\nCollaborated with cross-functional teams to assess network requirements, ensure regulatory compliance, and enhance overall network security protocols.\nLed training sessions to elevate team knowledge on the latest network technologies and troubleshooting techniques, improving the team’s effectiveness in maintaining the network infrastructure."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Applied network architecture principles to enhance data center operations and performance metrics by 25%.\nExecuted troubleshooting strategies to resolve network issues, resulting in a decrease of downtime by 15%.\nUtilized network tools to monitor and analyze performance, ensuring efficient data handling and capacity forecasting with a 99.9% uptime.\nConducted continuous improvement initiatives, refining architectural designs that improved traffic flow and reduced latency by 30%.\nCollaborated with cross-functional teams to deploy and optimize backend network services using **Python**, **Flask**, and **PostgreSQL**.\nEngineered real-time connectivity solutions with **asyncio**, **WebSockets**, and **Redis**, improving response times for high-frequency data transactions.\nIntegrated comprehensive testing methodologies with **PyTest** and CI practices, increasing deployment efficiency by 20%.\nIntroduced proactive job scheduling using **Celery** and **RabbitMQ**, enhancing task prioritization and resource utilization."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\t\n\n  **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n  **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n  **Cloud & Infrastructure**\n\t\n\n  **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, BGP, Data Center Networking, Network Tools, Architecture, Operations, Troubleshooting, Continuous Improvement",
  "apply_company": "Iron Mountain"
}