{
  "name": "DANIEL HE",
  "role_name": "Senior Mobile Engineer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Results-driven Senior Mobile Engineer with extensive experience in developing high-performance mobile applications using **Swift** and **Kotlin**. Skilled in employing design principles such as **SOLID**, **DRY**, and architectural patterns including **MVVM**, **MVP**, and **VIPER** to create modular and maintainable code. Demonstrated expertise in **TDD** and **BDD** methodologies, ensuring high-quality software through rigorous testing practices. Adept at engaging in **Agile** methodologies, including **Scrum** and **Kanban**, to foster team collaboration and improve project delivery. Strong communicator dedicated to providing customer-focused solutions and enhancing user experience while delivering scalable, reliable applications.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Senior Mobile Engineer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "• Employed Agile methodologies (Scrum and Kanban) for project management, ensuring timely delivery with an average sprint completion rate of **95%**.\n• Designed and implemented SOLID principles and DRY best practices in mobile application development using **Swift** and **Kotlin**, enhancing code maintainability.\n• Leveraged MVVM and MVP architectural patterns to create scalable and maintainable applications, improving code reusability by **40%**.\n• Introduced Test-Driven Development (TDD) and Behavior-Driven Development (BDD) practices to boost code quality, achieving a **90%** test coverage in critical modules.\n• Collaborated with cross-functional teams to ensure customer-focused solutions, enhancing user satisfaction ratings by **25%**.\n• Managed deployment processes and continuous integration using DevOps techniques, reducing lead time for changes by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Utilized **Swift** and **Kotlin** to develop high-performance mobile applications adhering to **SOLID** and **DRY** principles, resulting in a 30% increase in app stability.\nImplemented **MVVM**, **MVP**, and **VIPER** architectural patterns to enhance modular architecture, enabling quicker feature add-ons by 40%.\nEmployed **TDD** and **BDD** methodologies to improve code quality, reducing bug reports by 50% during the integration phase.\nCollaborated with cross-functional teams in an **Agile** environment, facilitating **Scrum** meetings and utilizing **Kanban** to optimize workflow and promote effective communication.\nEngaged with stakeholders to ensure a customer-focused approach, increasing user satisfaction scores by 15% through direct feedback loops."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Utilized **Swift** and **Kotlin** to develop high-performance mobile applications aligned with customer-focused requirements, resulting in a 25% increase in user engagement.\nEmployed **MVVM**, **MVP**, and **VIPER** design patterns to create maintainable codebases, enhancing development speed by 30%.\nAdopted **TDD** and **BDD** methodologies, leading to a reduction in defect rates by 40% during the development lifecycle.\nCollaborated within **Agile** frameworks such as **Scrum** and **Kanban**, conducting bi-weekly sprints to deliver an average of **3 features** per release cycle.\nImplemented **modular architecture** to improve code reusability and team collaboration, decreasing integration times by **50%**.\nFostered a culture of effective **communication** and collaboration among cross-functional teams to meet project deadlines and improve throughput."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, JavaScript (React, Vue.js, Angular, Pixi.js, Vanilla JS, Node.js, TypeScript), Go, Python, SQL, Swift, Kotlin\n\n**Backend Frameworks**\n\tSpring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n**Frontend Frameworks**\n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest\n\n**API Technologies**\n\tRESTful API design\n\n**Databases**\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n**DevOps**\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline\n\n**Cloud & Infrastructure**\n\tAWS (EKS, RDS, CloudFront, S3, Lambda), API Gateway, Git, CloudWatch, ELK Stack\n\n**Other**\n\tMicroservices, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies, SOLID, DRY, MVVM, MVP, VIPER, modular architecture, TDD, BDD, communication, customer-focused, Kanban",
  "apply_company": "Kaufland"
}