{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Security Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Senior Security Engineer with 8+ years of experience, I am proficient in security principles, vulnerability management, and mobile application security, utilizing frameworks like **OWASP 10** and **SANS 25** to ensure robust application security. My technical skill set includes extensive knowledge of **Python** and **Go** for scripting and automation, coupled with cloud platforms such as **AWS** and **Google Cloud** to enhance security measures. I adhere to standards like **NIST**, **ISO 27001**, **CIS**, and **PCI** to deliver comprehensive risk mitigation and compliance strategies. I possess strong communication skills and a collaborative mindset, focusing on continuous improvement and proactive measures to safeguard systems. Additionally, I bring expertise in developing high-performance applications for sectors including e-commerce, financial, and healthcare, leveraging technologies such as **FastAPI**, **Django**, **Flask**, and modern frontend frameworks like **Angular**, **Vue**, **React**, and **Next.js**.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Ensured adherence to **security principles** by embedding best practices into Python microservices and cloud workflows, aligning with **ISO 27001** and **PCI DSS** compliance standards.\n• Managed **vulnerability management** processes to identify and mitigate risks in cloud-native environments, employing frameworks such as **OWASP 10** and **SANS 25**.\n• Developed automation scripts in **Python** to streamline security processes and enhance **mobile application security** across platforms.\n• Led the architectural design and development of secure systems using **Python** (FastAPI, Django, Flask) to enable secure healthcare data exchange and compliance with regulations such as HIPAA and FHIR.\n• Successfully integrated payment gateways (**Stripe**, **PayPal**, **Adyen**) into Python microservices for secure, scalable, multi-currency transactions.\n• Implemented tokenization and OAuth 2.0 to ensure **security** in sensitive data handling, contributing to overall PCI DSS compliance standards.\n• Spearheaded incident response efforts, employing proactive monitoring and security assessments to detect anomalies in systems and ensure compliance with **NIST** standards.\n• Developed and deployed **real-time** fraud detection services in **Python**, using third-party integrations (**Sift**, **FraudLabs Pro**) to reduce chargebacks by **30%**.\n• Designed **RESTful** and **gRPC APIs** with JWT-based authentication and role-based access control to secure workflows in financial and healthcare domains.\n• Architected efficient ETL pipelines within the **Python** ecosystem, leveraging tools such as **Apache Airflow** and **Azure Event Hubs** for data security and compliance reporting.\n• Championed DevOps practices in security automation by provisioning infrastructure with **Terraform** and **Azure Resource Manager templates**, cutting deployment times by **40%**.\n• Mentored a cross-functional team of **10+ engineers** in secure coding practices and cloud-native design patterns, fostering a **collaborative** and **proactive** mindset.\n• Integrated observability in Python services through **Prometheus** and **Grafana** for enhanced monitoring and issue resolution, achieving a reduction in issue resolution time by **25%**.\n• Established robust test strategies in **Python** with PyTest and Selenium, ensuring reliable and scalable deliveries through automated performance tests leveraging **Apache JMeter**.\n• Developed hybrid cloud solutions by integrating **AWS** services (Lambda, RDS, S3) with Azure workloads, optimizing cost and performance effectively.\n• Guided the establishment of event-driven architectures using **Kafka** and **RabbitMQ**, enhancing asynchronous communication and improving system scalability.\n• Ensured secure integrations with **ElasticSearch** and **Azure Cognitive Search**, significantly improving query performance and accessibility of healthcare data.\n• Configured and maintained CI/CD pipelines for Python microservices, incorporating automated security scans and release management for improved software quality."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Ensured robust data protection in Python services by applying security principles such as RBAC, OAuth 2.0, and JWT, ensuring compliance with standards like **PCI** and the OWASP 10 vulnerabilities.\n• Developed and implemented comprehensive vulnerability management strategies within the Python frameworks, enhancing application security across **AWS** and **Google Cloud** environments.\n• Led the automation of security assessments and compliance checks using **scripting and automation** techniques, fostering a proactive mindset towards continuous improvement.\n• Designed secure mobile application security frameworks, adhering to **NIST**, **ISO 27001**, and **CIS** guidelines, elevating protection for sensitive financial data.\n• Built a real-time transaction monitoring dashboard powered by Python APIs with Angular UI, integrated with **Power BI** for advanced reporting, tracking **1000+** transactions per hour.\n• Contributed to event-driven architectures in Python using technologies like **Kafka** and **RabbitMQ** to enhance system performance in handling financial transactions at scale.\n• Managed Kubernetes clusters to deploy **Python** microservices, enabling rolling updates and improving high availability, achieving **99.99%** uptime.\n• Developed secure payment gateway integrations in Python supporting **ACH** transfers, ensuring compliance with **PCI** regulations for smooth interoperability.\n• Implemented ELK stack (**Elasticsearch**, **Logstash**, **Kibana**) with Python services for centralized logging, achieving a **50%** reduction in response time for error tracing and resolution.\n• Configured and managed **Azure Service Bus** for reliable message brokering between microservices, enhancing system modularity and decoupling.\n• Applied best practices in Python development, including automated unit testing with **PyTest** and integration testing with **Selenium** to ensure reliability in backend services.\n• Designed and implemented integration solutions with **MuleSoft** for external partners, ensuring secure financial data exchange processes while maintaining compliance."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Implemented security principles and vulnerability management strategies while developing backend services for an e-commerce platform with **Python**.\nEmployed OWASP 10 and SANS 25 standards to ensure secure coding practices in developing robust RESTful APIs, facilitating high-volume transactions while safeguarding customer data.\nAutomated security compliance checks using scripting and automation techniques, enhancing the delivery pipeline's integrity and reliability.\nDeveloped and maintained high-performance backend systems using **Python** frameworks (FastAPI, Django, Flask) optimized for security and scalability.\nIntegrated cloud security best practices in AWS and Google Cloud, ensuring data protection and compliance with **ISO 27001**, **CIS**, and **PCI** standards.\nDesigned and executed comprehensive security assessments, identifying vulnerabilities and facilitating proactive remediations in collaboration with cross-functional teams.\nUtilized **PostgreSQL**, **SQL Server**, and **MySQL** with Python ORMs (SQLAlchemy, Django ORM) for database management, implementing encryption and access controls to protect sensitive information.\nBuilt resilient, secure frontend applications using **React**, **Next.js**, **Angular**, and **Vue**, with responsive design principles that adhere to modern security standards.\nLeveraged CI/CD pipelines using **GitHub Actions**, **Azure DevOps**, and **Jenkins** to automate deployments while embedding security checks to ensure compliance.\nContainerized Python applications with **Docker**, setting security configurations to streamline secure deployments across hybrid environments.\nConducted load and performance testing using Apache JMeter and Locust to uncover security bottlenecks, optimizing the security posture of Python services.\nImplemented real-time monitoring and observability solutions using **Prometheus**, **Grafana**, and **Azure Monitor** for actionable security insights into system health and incident response.\nMigrated legacy systems to Python microservices with a focus on security, ensuring minimal disruption to critical business workflows during transitions.\nFacilitated effective communication and collaboration among development teams, driving continuous improvement in security processes and product deployment.\nUtilized caching strategies with **Redis** in Python services to enhance performance, while ensuring secure data access and management practices.\nConducted regular security workshops and training sessions to promote a proactive mindset among teams towards mobile application security and overall cybersecurity awareness."
    }
  ],
  "skills": " **Programming Languages** \n\tPython, Go\n\n **Backend Frameworks** \n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks** \n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies** \n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases** \n\tSQLAlchemy, Pydantic, Celery, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure** \n\tAWS, Google Cloud\n\n **Other** \n\tsecurity principles, vulnerability management, scripting and automation, OWASP 10, SANS 25, mobile application security, NIST, ISO 27001, CIS, PCI, communication skills, collaborative mindset, proactive mindset, continuous improvement"
}