{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Backend Engineer with 8 years of experience, I possess strong expertise in **PHP**, **Python**, and **JavaScript**, focusing on robust backend development using advanced frameworks. My proficiency extends across **Node.js**,**Django**, and modern microservices architectures. I am skilled at building secure and scalable APIs and have a solid understanding of cloud services, particularly with **Azure** and **AWS**. My hands-on experience with DevOps practices and CI/CD automation ensures seamless deployment pipelines.  \nIn addition to my technical skill set, I have successfully led agile projects using **Scrum** methodologies, delivering high-performance solutions within the healthcare and financial sectors. I prioritize cybersecurity and adhere to regulatory compliance standards including HIPAA and PCI DSS. My commitment to data quality and a structured approach to remote work further enhance my capability to contribute effectively as a Senior Backend Engineer.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained robust **APIs** for scalable applications using **PHP**, **Python**, and **JavaScript**, ensuring adherence to industry standards for **regulatory compliance** including HIPAA and PCI DSS.\nDesigned and implemented backend services utilizing modern **Backend-Frameworks**, with a focus on optimizing performance and data integrity, achieving **85%** reduction in response times.\nEnhanced CI/CD processes using **Git** and **DevOps** tools to enable streamlined deployment and integration, reducing deployment time by **40%**.\nCollaborated in an **Agile** and **Scrum** environment to deliver back-end solutions that effectively met project goals, participating in bi-weekly sprint planning and retrospectives.\nIntegrated third-party services through **APIs** while ensuring **Data Quality** and reliability, maintaining a **99.9%** uptime.\nAssured safe coding practices to mitigate risks and improve **cybersecurity** standards in software development lifecycle (SDLC).\nAssisted in transforming existing applications into cloud-native environments using **Cloud** technologies and frameworks while reducing infrastructure costs by **30%**.\nContributed to the development of **Frontend-Frameworks** for seamless user experience, ensuring that backend and frontend integrations were achieved timely and effectively with minimal disruptions.\nSupported and mentored junior engineers in adopting best practices in backend development and deployment techniques, fostering a productive team environment in a **remote work** context."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **PHP**, **Python**, and **JavaScript** to architect and enhance backend functionalities, ensuring robust performance in line with best coding practices.\nDeveloped and maintained RESTful APIs to facilitate seamless communication between frontend and backend systems, adhering to Agile methodologies and Scrum practices.\nImplemented CI/CD pipelines using **Git** and **DevOps** practices, which reduced deployment times by **30%** and improved code quality, allowing for faster release cycles.\nDrove the modernization of backend services through the integration of various **backend-frameworks** and established data quality standards to support regulatory compliance in the financial sector.\nCollaborated with cross-functional teams to enforce **cybersecurity** measures across systems, ensuring the protection of sensitive financial data and adherence to industry regulations.\nLed and participated in code reviews and pair programming sessions to foster knowledge sharing and uplift the existing codebase's maintainability and scalability.\nEngaged in remote work practices, ensuring consistent communication and collaboration across diverse teams and maintaining productivity.\nAdopted cloud solutions and services to optimize resource utilization and performance in financial applications, enhancing system reliability.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **PHP**, **Python** (FastAPI, Django), and **JavaScript** (Node.js, NestJS, Express) to design and optimize backend services for a global e-commerce platform, achieving high availability, low latency, and scalability across key modules like checkout and order fulfillment.\nDeveloped RESTful and GraphQL **APIs** for seamless integration between backend services and frontend applications, improving response times by **30%** and enhancing user experience.\nImplemented CI/CD pipelines to automate deployments and testing using **Git**, aligning with **Agile** and **Scrum** methodologies for efficient project management and faster delivery cycles, reducing release times by **40%**.\nEngineered backend architecture using microservices, ensuring efficient resource utilization and improving system resilience, scaling to handle **over 1 million** transactions per day without performance degradation.\nEmployed cloud services for scalable deployments and **DevOps** practices for improved collaboration between development and operations teams, facilitating a **75%** decrease in deployment failures.\nIntegrated AI/ML-based recommendation engines with **APIs** that personalized user experiences, resulting in a **20%** increase in user engagement and conversion rates.\nCollaborated with cross-functional teams to ensure compliance with **regulatory requirements**, achieving **100%** adherence to GDPR guidelines throughout the platform.\nApplied **cybersecurity** measures such as role-based access control (RBAC) and **OAuth 2.0**, ensuring secure transactions while handling sensitive customer data during payment processes with platforms like **Stripe** and **PayPal**.\nLeveraged **Git** for version control and collaboration in a **remote work** environment, ensuring code quality and consistency across all development efforts.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, PHP\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPIs, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda, ECS), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Certbot, Agile, Scrum, Cybersecurity, Remote Work, Regulatory Compliance, Data Quality, KV Accounting",
  "apply_company": "PCS Professional Clinical Software GmbH"
}