{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Java Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Java Engineer with 13+ years of experience in designing and implementing **microservices** architecture using **Java**, **Spring Boot**, **Spring Data JPA**, and **Spring Security**. Proven expertise in deploying scalable applications with **Docker** and orchestrating containerized applications with **Kubernetes**. Strong background in database management with **PostgreSQL** and caching mechanisms with **Redis**.\nSkilled in Agile methodologies and proficient in using **JIRA** for project management. Recognized for strong leadership qualities and effective communication skills. Additionally, experienced in developing high-performance applications across healthcare and financial industries using **JavaScript/TypeScript**, **Python**, and frameworks such as **React**, **Next.js**, and **Angular**. Familiar with compliance-driven development, ensuring alignment with standards like HIPAA and PCI DSS, and have hands-on practices in automation and testing with **JUnit** and **Test Containers**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed microservices architectures using **Java**, **Spring Boot**, and **Spring Data JPA**, ensuring robust and scalable solutions for high-demand applications.\n• Implemented security protocols leveraging **Spring Security** and **OAuth2** to protect sensitive user data and maintain compliance with industry standards.\n• Collaborated in Agile teams using **JIRA** for project management and sprint planning, ensuring timely delivery of features while promoting effective team communication.\n• Led integration efforts using **Docker** to containerize applications and streamline deployment processes in various environments, enhancing developer productivity and minimizing system conflicts.\n• Optimized data storage solutions with **PostgreSQL** and **Redis**, achieving an increase in application efficiency by **30%** in response times during peak usage.\n• Conducted rigorous testing with **JUnit** and **Test Containers**, establishing test-driven development practices that improved code quality and reduced bugs by **25%**.\n• Drove the adoption of SOLID principles and Design Patterns, fostering better code maintenance and scalability across multiple microservices.\n• Successfully managed the Kubernetes orchestration platform, utilizing best practices for deployment and scaling that resulted in a **40%** reduction in downtime.\n• Mentored junior developers, boosting team performance through training in best practices, coding standards, and effective problem-solving strategies.\n• Facilitated cross-functional communication between development, QA, and operations teams, fostering a collaborative and high-performance culture within the organization.\n• Promoted and maintained a culture of continuous improvement and commitment to high-quality software delivery, aligning with organizational goals."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented microservices architecture to modernize core financial systems, utilizing **Java** with **Spring Boot** and **Spring Data JPA**, boosting scalability and enabling efficient management of high-volume transactions.\nEnhanced system security through **Spring Security** and **OAuth2**, ensuring stringent access control across financial applications.\nLed the development of containerized applications using **Docker** and orchestrated them with **Kubernetes**, improving deployment efficiency and reliability by **30%**.\nUtilized **PostgreSQL** for robust data storage solutions, ensuring data integrity and optimized query performance with fast, reliable responses.\nDeveloped unit and integration tests using **JUnit** and **Test Containers**, achieving over **85%** code coverage to ensure software quality and reliability.\nChampioned Agile methodologies and utilized **JIRA** for efficient project management and coordination across cross-functional teams.\nFostered open communication and leadership within the development team, facilitating knowledge sharing and mentoring of junior engineers to build a cohesive and high-performing team.\nPracticed **SOLID** principles and **Design Patterns** to enhance code maintainability and alignment with best practices across applications.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized backend microservices for a global e-commerce platform using **Java** (Spring Boot, Spring Data JPA) and **Docker**, ensuring high availability, low latency, and scalability across key modules like checkout, cart, and order fulfillment.\nEngineered real-time features using **Redis** and event-driven architecture, enabling responsive order updates, dynamic inventory tracking, and real-time customer support.\nDeveloped frontend applications using **Angular** (version **12**) and integrated it with backend services, delivering fast, responsive user experiences.\nLeveraged **PostgreSQL** for distributed data storage, ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows.\nImplemented architectural best practices ensuring adherence to **SOLID** principles and **Design Patterns** across the codebase, enhancing maintainability and scalability.\nCreated automated testing environments with **JUnit** and **Test Containers**, achieving **95%** code coverage and increasing confidence in deployments.\nImplemented feature flags and blue-green deployments using **Kubernetes**, enabling controlled rollouts, A/B testing, and risk mitigation during major platform updates.\nEnsured secure customer access using **OAuth2** for authentication processes, adhering to GDPR compliance and user data protection standards throughout the platform.\nLed Agile development practices with tools like **JIRA** to prioritize backlog, optimize team collaboration, and deliver major features within **2-week** sprints, significantly improving team efficiency.\nFostered strong communication and leadership skills within cross-functional teams to drive project deliverables and ensure alignment with business goals."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tSpring Boot, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tAngular, React, Vue\n\n**API Technologies:**\n\tOAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMicroservices, Spring Data JPA, Spring Security, JUnit, Test Containers, Agile, JIRA, Leadership, Communication, MLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Terraform, Ansible, Helm, Docker Compose, SOLID, Design Patterns",
  "apply_company": "Inycom"
}