{
  "name": "Rei Taro",
  "role_name": "Senior Web Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Web Engineer with over 10 years of extensive experience in crafting and optimizing web infrastructure, leveraging a strong expertise in **TypeScript**, **gRPC**, and **API integration** to enhance developer experience and performance. Skilled in **dependency management** and **build tooling**, ensuring seamless project execution and robust documentation practices. Proven ability to deliver scalable and efficient solutions, with a successful track record in top-tier organizations such as VISA, Sii Poland, and Reply Polska, alongside proficiency in **Python** frameworks (FastAPI, Django, Flask) and cloud services like **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** to enhance developer experience and ensure seamless integration of **API** interfaces in web applications.\nImplemented **gRPC** for high-performance communication between services, optimizing web infrastructure and enabling robust data exchange.\nStreamlined **dependency management** practices to improve build tooling efficiency and maintainability in projects.\nCollaborated in cross-functional teams to develop comprehensive **documentation** for internal tools, enhancing overall system understanding.\nDesigned and implemented **build tooling** strategies that increased deployment speed by **30%** while reducing integration errors by **15%**.\nLed initiatives in **API integration** projects that successfully decreased onboarding time for new features by **25%**.\nConducted thorough testing and validation processes to ensure system reliability and performance across all web applications."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed and integrated **TypeScript** for enhanced developer experience and improved code maintainability, focusing on streamlined build tooling and dependency management.\n• Built and optimized **gRPC** services for efficient API integration, ensuring high-performance communication between microservices.\n• Improved web infrastructure by automating deployment processes, enhancing scalability and reducing downtime by **30%**.\n• Crafted detailed documentation for APIs, contributing to better project understanding and team collaboration while adhering to best practices.\n• Coordinated with cross-functional teams to facilitate smooth integration of web applications into existing workflows, ensuring seamless developer experience.\n• Employed rigorous tooling for continuous integration and deployment, fostering an agile development cycle with deployment frequency increased by **40%**.\n• Developed testing strategies that reduced bugs in production by **50%**, significantly enhancing the overall application reliability."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed robust **API integration** solutions using **gRPC** and **TypeScript** to enhance backend communication and improve developer experience.\n• Designed and implemented scalable **web infrastructure** leveraging **modern build tooling** strategies to optimize deployment processes across **3** different environments.\n• Spearheaded **dependency management** initiatives, reducing package bloat by **30%** through streamlined version control and regular updates.\n• Collaborated with cross-functional teams to integrate various services, ensuring seamless access to backend functionalities with comprehensive documentation and clear guidelines.\n• Enhanced overall performance and usability by introducing effective **tooling** tailored to support efficient development workflows and reduce onboarding time by **20%**.\n• Contributed to the establishment of best practices, engaging in regular reviews and feedback sessions to continuously improve engineer productivity."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices, gRPC, API integration\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, build tooling, dependency management\n\n**Cloud & Infrastructure**\n\tweb infrastructure\n\n**Other**\n\tPandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, documentation, tooling, developer experience, PyTest, Git",
  "apply_company": "Justera Group"
}