{
  "name": "Andrzej Ito",
  "role_name": "Senior UI Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior UI Engineer, I possess 9+ years of experience in designing and building intuitive and user-friendly interfaces. My expertise includes **HTML5**, **CSS**, **Figma**, **Sketch**, and **Adobe Creative Suite**, enabling me to create seamless user experiences that prioritize usability and performance. I excel in prototyping, wireframing, and responsive design, leveraging user feedback and usability testing to enhance accessibility and engagement. In addition to my technical skills, I have a proven track record of mentoring junior engineers and leading cross-functional teams to deliver high-impact projects that drive innovation.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior UI Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Utilize strong **UX** and **UI** principles in designing user interfaces to enhance user experience, ensuring responsive design across various devices. \n• Develop prototypes and wireframes using tools like **Figma** and **Sketch** to visualize design concepts before implementation, leading to a **30%** increase in user feedback ratings. \n• Collaborate with designers and stakeholders to transform UX research findings into actionable design solutions, focusing on **user feedback** and **usability testing** to create systems that meet user expectations. \n• Implement robust front-end solutions using **HTML5**, **CSS**, and integrations with backend services, improving load times by **15%** through optimized coding practices. \n• Work closely with cross-functional teams to ensure seamless communication and project execution, enhancing project delivery times by **20%**.\n• Conduct usability testing sessions and analyze data visualization results to iterate on designs based on user interactions and gather meaningful insights for continuous improvement."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed high-quality user interfaces (UI) with a focus on **UX** and **responsive design**, utilizing **HTML5**, **CSS3**, and **JavaScript** to create dynamic web pages.\n• Created prototypes and wireframes using **Figma** and **Adobe Creative Suite**, ensuring alignment with user needs and feedback to enhance usability.\n• Engaged in usability testing to gather user feedback, driving iterative design improvements and optimizing user experience.\n• Collaborated in a team environment to design and implement scalable, responsive web applications using **React 12** as the front-end technology.\n• Employed data visualization techniques in dashboard development using **ChartJS**, integrating real-time data through Web API.\n• Participated in the design process with tools like **Sketch**, contributing to the overall aesthetic and functional aspects of the applications.\n• Ensured browser compatibility and responsive layouts through frameworks including **Angular 12** and **jQuery**, meeting the needs of diverse user groups.\n• Communicated effectively within cross-functional teams, contributing to the overall design strategy and end-user satisfaction."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Designed and developed responsive user interfaces that enhance user experience (UX) with a focus on **HTML5**, **CSS**, **Tailwind CSS**, and **Material UI**.\n• Utilized **Figma** and **Adobe Creative Suite** for prototyping and wireframing, producing efficient design workflows that resulted in a **30%** reduction in project turnaround times.\n• Conducted usability testing and user feedback sessions to continuously improve design standards, achieving a **15%** increase in user satisfaction ratings.\n• Collaborated with cross-functional teams to translate business requirements into functional UI features, leveraging data visualization strategies for better user communication.\n• Developed web applications using **Spring MVC**, **jQuery**, **JavaScript**, and AJAX controls, ensuring high-quality and engaging front-end performance.\n• Implemented CORS using **Node.js** and created **REST** services with **Node** and **Express**, enhancing application scalability and interoperability across platforms.\n• Gained expertise in various modern development tools such as **Git**, **Bower**, and **NPM**, which supported the adoption of agile methodologies in coding practices.\n• Involved in the design of **SSIS** packages to facilitate data export processes, contributing to data management solutions that optimize performance in **MS SQL Server** environments."
    }
  ],
  "skills": "Programming Languages:\n\tJava, C++, C#, Python, SQL, PLSQL, Kotlin\n\n**Backend Frameworks:**\n\tSpring, Spring Boot, Hibernate, Struts, JPA, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS\n\n**API Technologies:**\n\tREST APIs, SOAP, Microservices\n\n**Serverless and Cloud Functions:**\n\t\n\n**Databases:**\n\tMS SQL Server, Oracle, MongoDB, PostgreSQL, Redis\n\n**DevOps:**\n\tRabbit MQ\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tSOLID, DRY, LINQ, UX, UI, Figma, Sketch, Adobe Creative Suite, prototyping, wireframing, responsive design, data visualization, communication, user feedback, usability testing",
  "apply_company": "GlobalLogic"
}