{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Ruby Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Ruby Engineer with 13+ years of experience architecting high-performance applications across healthcare and financial sectors. Proficient in **AWS**, adept at deploying cloud-native systems and utilizing **Docker** for containerization. Well-versed in building robust applications with **JavaScript** and familiar with **Ruby** development, ensuring seamless integration within microservices architectures. Strong background in compliance-driven development, aligning solutions with critical standards. Experienced in predictive analytics and automation utilizing AI/ML technologies, showcasing an ability to leverage data effectively. Proven skills in CI/CD pipelines for accelerated delivery and deployment. Known for delivering high-quality software while fostering collaboration across teams.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Ruby Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS** for deploying applications and managing cloud resources, ensuring seamless scalability and security in line with healthcare and fintech standards.\nDeveloped and maintained applications using **Ruby** alongside modern JavaScript tools, focusing on performance and reliability across multiple platforms.\nImplemented containerization strategies with **Docker** to streamline development and deployment processes, significantly reducing release times by **30%**.\nCollaborated on cross-functional teams to deliver high-quality software products, leveraging tools like **Chef** for configuration management and automation.\nOptimized codebases for ease of maintenance and scalability, incorporating best practices in test-driven development (TDD).\nStreamlined data processing workflows using **SAS** and **R** for analytics, enhancing reporting efficiency by **40%** and improving data accuracy.\nConducted peer code reviews and mentoring sessions to enhance team productivity and knowledge sharing across the engineering department.\nEngaged with MS 365 for project management and documentation, enabling better collaboration and alignment with organizational goals.\n\nAdditional original strengths include:\n- Led the design and implementation of application architectures that adhere to security standards while facilitating rapid development iterations.\n- Participated in agile ceremonies to deliver software improvements aligned with user feedback and business requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Ruby** to develop and maintain high-performance applications, ensuring code quality and adherence to best practices through rigorous testing and documentation.\nImplemented efficient solutions on **AWS** cloud services, optimizing application deployment and scaling by leveraging tools like **Docker** for containerization.\nCollaborated closely with cross-functional teams to gather requirements and design features that enhanced user experience and functionality of financial applications.\nAdopted modern development methodologies, including Agile and DevOps practices, accelerating release cycles and improving team productivity, leading to a **25%** reduction in deployment time.\nLed code reviews and mentored junior developers, fostering a collaborative team environment and ensuring knowledge sharing of **JavaScript** frameworks including React.js and Vue 3.\nCreated and maintained CI/CD pipelines using **Chef**, streamlining application deployment processes and ensuring consistent delivery of high-quality software.\nAnalyzed application performance and implemented optimizations that resulted in a **30%** increase in application speed and responsiveness, enhancing overall user satisfaction.\nDeveloped automated scripts and tools utilizing **SAS** and **R** for data analysis, improving data processing efficiency by **40%** in financial reporting tasks.\nFacilitated the integration of **MS 365** services to enhance collaboration and document management within the development team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **AWS** services for deploying and managing scalable applications, ensuring high performance and availability of backend services in the e-commerce ecosystem.\nImplemented containerization strategies using **Docker** to streamline development and deployment processes, enhancing team collaboration and application stability.\nDeveloped and maintained robust backend services in **Ruby**, focusing on performance optimization and integration with key e-commerce functionalities.\nEmployed **JavaScript** frameworks alongside Ruby to create seamless full-stack applications, improving user experience and engagement.\nIntegrated automation tools such as **Chef** for configuration management, ensuring consistent environments across development and production phases.\nAnalyzed business operations using **SAS** and **R** to derive insights and recommendations for enhancing product offerings and user engagement.\nCollaborated with cross-functional teams to implement productivity tools within **MS 365**, ensuring effective communication and project management.\nOptimized microservices architecture for e-commerce applications, enhancing scalability and modularity of services.\nDesigned and executed test strategies to guarantee code reliability, performance, and compliance with established industry standards.\nFacilitated CI/CD practices to automate deployment processes, ensuring quicker delivery of updates and features to the production environment."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, Ruby, R, SAS\n\n **Backend Frameworks:**\n\tPython: FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Chef, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure: App Services, Blob Storage, SQL Database, MS 365\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "pharmtrace"
}