{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Full-Stack Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Proficient Full Stack Developer with 13+ years of experience specializing in Java, C#, and Oracle, complemented by a strong foundation in development tools such as **Eclipse**, **JUnit**, and version control with **Git**. Adept in agile methodologies utilizing **JIRA** and **Confluence** for project management and collaboration. Highly skilled in crafting high-performance applications in both frontend and backend development, leveraging technologies including **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, and **Flutter**.\n\nDemonstrated experience in building AI/ML-powered platforms incorporating predictive analytics, alongside robust expertise in deploying cloud-native systems on **AWS** and **Azure**. Proven capability in implementing microservices, event-driven architectures, and CI/CD pipelines. Knowledgeable in compliance-driven development frameworks aligning with HIPAA, FHIR, PCI DSS, and SOC 2 standards, coupled with a solid background in MLOps using **MLflow**, **Airflow**, and **Kubeflow** for model management.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Full-Stack Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained full-stack applications using **Java** and **C#**, ensuring effective integration with both front-end and back-end components.\nLeveraged version control tools like **Git** to manage code changes across multiple projects, fostering collaboration among team members through **JIRA** and **Confluence**.\nImplemented unit and integration testing utilizing **JUnit** to ensure high code quality and reliability across all developed features, achieving over **95%** test coverage.\nDesigned and executed robust QA workflows with **QF-Test**, ensuring application functionality aligns with business requirements and user stories.\nUtilized **Eclipse** as an IDE for developing applications, enhancing productivity and streamlining the development process.\nActively contributed to agile development processes, participating in daily stand-ups, sprint planning, and retrospectives, fostering continuous improvement and team accountability.\nFacilitated cross-functional collaboration to troubleshoot and resolve issues, providing technical support and guidance to both internal teams and clients.\nOptimized application performance and scalability by utilizing best practices in code optimization and database management with **Oracle**.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Java** to build scalable back-end solutions, ensuring robust performance in high-traffic environments by adopting best practices in microservices architecture.\nEmployed **C#** for developing interactive web applications, implementing responsive design principles to enhance user experience and accessibility.\nOptimized database management using **Oracle**, improving data retrieval times by **30%** through effective query strategies and indexing.\nCollaborated with cross-functional teams using **Eclipse** for development and deployment, ensuring streamlined workflows and efficient project management in an Agile environment.\nConducted unit testing and integration testing using **JUnit**, achieving over **80%** test coverage to maintain high code quality and reliability.\nVersion-controlled all project artifacts and documentation through **Git**, facilitating seamless collaboration among team members while maintaining project integrity.\nDocumented project specifications and progress using **JIRA** and **Confluence**, effectively tracking tasks and ensuring alignment with project deadlines.\nReduced testing cycle times by **25%** through automation using **QF-Test**, thereby enhancing overall efficiency and productivity in the development process."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained robust software solutions using **Java**, **C#**, and **Oracle**, ensuring high performance and scalability for diverse applications in a full-stack environment.\nOptimized build processes and automated testing using **JUnit** and **Git** for version control, enhancing developmental efficiency and minimizing deployment times by **30%**.\nUtilized **Eclipse** as the primary IDE for coding, debugging, and deploying applications, streamlining the development lifecycle and improving code quality through integrated tools.\nCollaborated in agile teams using **JIRA** and **Confluence** for project management, documentation, and tracking progress on sprints, leading to a **25%** increase in team productivity.\nDesigned automated testing frameworks with **QF-Test**, increasing test coverage by **40%** and ensuring application reliability before production deployments.\nBuilt responsive and user-friendly web interfaces integrating with backend services, ensuring seamless user experiences across web platforms.\nImplemented security best practices for application development, focusing on role-based access control (RBAC) and secure API handling to maintain user data integrity and confidentiality.\nLeveraged effective communication and collaboration skills to work closely with cross-functional teams, ensuring alignment on project goals and timely deliverables."
    }
  ],
  "skills": "Programming Languages:\n\tJava, C#, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Oracle\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, JIRA, Confluence, QF-Test, Git, JUnit, Eclipse"
}