{
  "name": "Tomasz Lee",
  "role_name": "Senior Analytics Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Analytics Engineer with 9+ years of experience in building data pipelines and leveraging **SQL**, **Python**, **Airflow**, **dbt**, and **Clickhouse** to create robust data solutions. Proficient in **Data Warehousing** and dashboarding with tools like **Metabase**, ensuring efficient data presentation and analysis. Strong analytical thinking, proactive communication, and stakeholder management skills foster collaboration and drive impactful decision-making. Proven track record in problem solving and structured working, combined with a technical background in **microservices architecture**, **distributed systems**, **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, **.NET**, and **C#**, bringing a comprehensive approach to analytics engineering.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Analytics Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **SQL** to optimize database queries and enhance data modeling processes, achieving a **20%** reduction in average query execution time.\nDesigned and implemented data pipelines with **Airflow**, enabling streamlined ETL processes and improving data processing efficiency by **30%**.\nDeveloped analytical dashboards using **Metabase**, providing stakeholders with clear insights and improving reporting capabilities.\nLeveraged **Python** for data analysis and transformation, aiding in the creation of reports and visualizations that supported decision-making processes.\nImplemented **dbt** for data transformations, ensuring data quality and consistency in reporting data sources.\nExecuted complex analytical solutions in **Clickhouse**, increasing query performance and data retrieval speed by **25%**.\nMaintained structured working processes and proactively communicated project milestones to stakeholders, enhancing project transparency and achieving timelines.\nDemonstrated strong analytical thinking and problem-solving skills by addressing data quality issues and improving overall pipeline reliability.\nCollaborated interactively with cross-functional teams to gather requirements for data warehousing projects, ensuring all stakeholder needs were met."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **SQL** for managing and optimizing databases (MSSQL and MySQL) to improve data storage and retrieval efficiency by 25%.\nDeveloped and implemented data pipelines using **Python**, ensuring seamless data flow and processing across multiple platforms.\nCreated dynamic dashboards with **Metabase** for visualizing key metrics and facilitating data-driven decision making, increasing stakeholder engagement by **30%**.\nEmployed **Airflow** for orchestrating complex workflows and automating repetitive tasks, resulting in a **20%** reduction in processing time.\nDesigned and maintained data warehousing solutions utilizing **Clickhouse**, enhancing data query performance significantly.\nCollaborated closely with stakeholders to define system requirements, ensuring projects align with business objectives and were delivered on time.\nApplied strong analytical thinking to solve complex data problems, leading to actionable insights for cross-functional teams.\nFostered proactive communication within the team and across departments, enhancing overall project collaboration.\nLed mentorship sessions for junior engineers, promoting a culture of continuous learning and team productivity.\nStructured working processes to optimize project timelines and minimize bottlenecks, improving delivery speed by **15%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **SQL** to manage and optimize data in a **Clickhouse** warehouse, enhancing reporting efficiency by **30%**.\nDesigned and maintained data pipelines using **Python** and **Airflow**, significantly improving data availability for analytics tasks by **25%**.\nDeveloped meaningful dashboards with **Metabase** to provide stakeholders with real-time insights, resulting in enhanced decision-making processes.\nImplemented data warehousing solutions that improved data integrity and accessibility, facilitating better analytical outcomes.\nApplied analytical thinking and problem-solving skills to troubleshoot data discrepancies that increased operational efficiency by **15%**.\nEngaged in proactive communication strategies with cross-functional teams to ensure alignment on data requirements and project goals.\nStructured working processes that improved data pipeline efficiency and stakeholder satisfaction.\nCollaborated with multiple stakeholders during the creation of analytical reports and visualizations, leveraging strong stakeholder management skills to drive project success.\nParticipated in regular project reviews to ensure adherence to best practices in data analytics and engineering."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, SQL\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Clickhouse\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tUX/UI Design, Git, GitHub, Analytical Thinking, Stakeholder Management, Proactive Communication, Problem Solving, Structured Working, Data Warehousing, Dashboarding, Data Pipelines, Airflow, dbt, Metabase",
  "apply_company": "Robin Cook"
}