{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Accomplished Senior Backend Engineer with 13+ years of experience in designing scalable and reliable backend systems across diverse industries, including healthcare and finance. Proficient in **Python**, with hands-on expertise in **AWS** cloud services for seamless deployment and infrastructure management. Demonstrated knowledge of message brokers such as **Kafka**, **RabbitMQ**, and **NATS** to ensure efficient data processing and communication.\n\nStrong experience in developing integrations and automation through **Workato** and building robust applications that meet high compliance standards. Known for effective mentorship and exceptional communication skills, I excel at fostering problem-solving environments that enhance team performance and drive project success.\n\nMy technical repertoire includes programming with **Java** and **Golang**, as well as a strong foundation in backend principles that support system scalability and reliability. I am passionate about leveraging technology to improve operational efficiencies and deliver high-quality solutions autonomously.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted comprehensive backend development and integration for high-performance applications using **Python** to ensure seamless scalability and reliability in healthcare and fintech sectors.\nLeveraged **AWS** services to enhance application performance, focusing on microservices architecture for efficient data handling and processing.\nImplemented messaging systems with **Kafka**, **RabbitMQ**, and **NATS** to streamline data communication and improve application responsiveness.\nDeveloped gRPC services to facilitate efficient inter-service communication, significantly reducing latency and enhancing system performance.\nUtilized advanced problem-solving skills to architect robust solutions that improved system reliability and maintainability, achieving a **30%** decrease in downtime.\nMentored junior developers in backend technologies, fostering a collaborative environment and enhancing team communication, driving project success through shared knowledge.\nCompeted challenging integration tasks using **Workato** to automate workflows and improve operational efficiency, achieving a **20%** increase in productivity.\nDesigned and delivered backend services adhering to best practices in coding and software development, utilizing **Java** and **Golang** where necessary for optimized performance.\nDemonstrated autonomy in project management, leading cross-functional teams to successful completion of integrations and backend developments.\nAnalyzed system performance metrics and implemented improvements, resulting in a **15%** increase in system throughput and user satisfaction.\nFacilitated effective communication with project stakeholders to translate technical designs into actionable plans, ensuring alignment with business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Node.js (NestJS/Express)** to modernize core financial platforms by migrating to microservices architecture, enhancing scalability and performance for high-volume transactional systems.\nImplemented **Kafka**, **RabbitMQ**, and **Azure Service Bus** to design and deploy a robust event-driven architecture, ensuring asynchronous communication across critical workflows.\nConfigured and maintained **AWS** infrastructure for seamless deployment, focusing on scalability and reliability of services.\nLed the development of ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, enabling the ingestion of financial data from both internal and third-party sources, supporting batch and real-time processing.\nMentored junior engineers on best practices in microservices design and efficient coding techniques, enhancing team collaboration and problem-solving capacities.\nCommunicated effectively with cross-functional teams to deliver real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing instant insights into transactions and anomalies.\nDeveloped and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection based on user behavior and transaction patterns, achieving a detection accuracy of **95%**.\nCreated machine learning pipelines for real-time credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, integrating model inference into backend services for enhanced decision-making processes.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed scalable backend services utilizing **Python** (with **FastAPI** and **Django**) and **Java** to meet the demands of a high-traffic global e-commerce platform.\n• Enhanced system reliability and performance by implementing **Kafka** and **RabbitMQ** for event-driven architecture, improving order processing times by **30%**.\n• Employed effective problem-solving techniques to troubleshoot and optimize application performance, achieving a **25%** reduction in latency on critical transaction flows.\n• Mentored junior developers, fostering a culture of continuous improvement and knowledge sharing within the engineering team, resulting in increased team efficiency by **15%**.\n• Ensured high availability and fault tolerance in distributed databases using **AWS** services and technologies like **MongoDB**, **PostgreSQL**, and **Redis**.\n• Leveraged autonomous development practices for feature implementations, promoting rapid deployment cycles through **gRPC** and **NATS** messaging protocols.\n• Streamlined integration processes through the use of tools like **Workato**, enabling seamless data exchange across third-party applications.\n• Communicated technical concepts clearly to both technical and non-technical stakeholders, improving collaboration and project understanding across teams.\n• Conducted rigorous testing and quality assurance on backend functionalities, achieving a **99.9%** uptime in production environments.\n• Designed and implemented feature flags for controlled rollouts, enhancing the scalability of platform updates while reducing risk.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Java, Golang, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tgRPC, Kafka, RabbitMQ, NATS\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAzure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tscalability, reliability, mentorship, communication, problem-solving, autonomy, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "PandaDoc"
}