{
  "name": "Patryk Zaslawski",
  "role_name": "Program Manager",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-driven Program Manager with 8+ years of experience in software engineering, specializing in **Project Management**, **Change Management**, and **Data Analysis**. Skilled in leading cross-functional teams to deliver high-performance solutions within e-commerce, financial, and healthcare sectors. Proficient in utilizing **GCP** for cloud-based applications, while maintaining robust documentation and effective communication across stakeholders. Expert in **Python** (FastAPI, Django, Flask, SQLAlchemy) and experienced in frontend frameworks such as **Angular**, **Vue**, **React**, and **Next.js**. Adept at implementing **microservices architecture** and developing **REST/gRPC APIs**. Strong focus on collaboration and time management to ensure project milestones are met, driving successful outcomes aligned with organizational goals.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Program Manager",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Managed project timelines, deliverables, and team collaboration for the Architectural design of a scalable, cloud-native Healthcare Experience Platform, leveraging **GCP** to enhance project efficiency and outcomes.\nExecuted change management strategies to facilitate the migration from monolithic to Python-based microservices deployed on **Kubernetes (AKS/EKS)**, resulting in improved scalability and resilience.\nConducted comprehensive data analysis to inform decisions regarding the integration of payment gateways (**Stripe, PayPal, Adyen**) into Python microservices for secure, multi-currency transactions processed through web and mobile platforms.\nPrepared detailed documentation for architectural design, ensuring compliance with **HIPAA, FHIR**, and **GDPR**, and thereby supporting improve communication amongst 10+ team members.\nFostered collaboration among cross-functional teams while guiding the architectural implementation of **RESTful and gRPC APIs** in Python with JWT-based authentication for secure financial and healthcare transactions.\nImplemented effective time management techniques to oversee the automation of healthcare workflows (e.g., patient scheduling, clinical data sharing) within Azure Functions and Logic Apps, achieving a **30%** reduction in process times.\nUtilized strong interpersonal communication skills to mentor junior engineers in Python and cloud-native design patterns, boosting team capabilities and adopting agile practices across workflows.\nFacilitated the integration of observability using **Prometheus, Grafana**, and the **ELK stack** for ongoing health checks and proactive issue resolution in systems.\nOrchestrated the development of ETL pipelines in Python incorporating **Apache Airflow** and **Kafka** for efficient data handling and transformation, supporting strategic operational insights and reporting."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Managed project timelines and deliverables, ensuring alignment with organizational goals and adherence to **GCP** methodologies to enhance project outcomes.\n• Coordinated cross-functional teams to implement change management processes, streamlining communication and collaboration for effective project execution.\n• Conducted extensive data analysis to inform project strategies, ensuring decisions are data-driven and aligned with business needs.\n• Developed comprehensive project documentation, maintaining clarity and fostering transparent communication among stakeholders.\n• Utilized strong time management skills to oversee multiple projects concurrently, ensuring timely completion and resource optimization.\n• Led collaborative efforts to enhance team performance and morale, driving a culture of open communication and shared goals.\n• Designed and implemented scalable solutions using **Python** (FastAPI, Django, Flask) microservices, improving system performance and maintainability.\n• Developed RESTful and gRPC APIs, facilitating secure communication and real-time updates for internal banking applications.\n• Refactored legacy systems from .NET/VB.NET to **Python**, ensuring modern compatibility and preserving essential business functionality.\n• Built dynamic frontends with **Angular**, **Vue**, **React**, and **Next.js**, utilizing **Redux/NgRx** for enhanced user experience.\n• Created a comprehensive real-time transaction monitoring dashboard using **Angular UI** and integrated with **Power BI** for advanced analytics.\n• Streamlined system integrations using **MuleSoft** and **Python** for efficient financial transactions, enhancing processing speed.\n• Implemented robust data protection mechanisms in **Python** services, adhering to compliance standards using encryption and **OAuth 2.0**. \n• Optimized data storage solutions with **SQL Server**, **DynamoDB**, and **Redis** via Python, ensuring quick access to transactional data.\n• Deployed event-driven architectures with **Kafka** and **RabbitMQ**, achieving high throughput for large-scale transaction processing.\n• Managed **Azure Service Bus** and Python workflows for effective message brokering, improving service modularity.\n• Established secure authentication protocols in APIs leveraging **OAuth 2.0** and **JWT**, ensuring data integrity.\n• Developed and integrated fraud detection systems in **Python**, utilizing **Azure Machine Learning** for proactive risk management.\n• Implemented payment gateways supporting ACH and credit card transactions, ensuring PCI compliance for secure operations.\n• Designed serverless components with **AWS Lambda** and **Azure Functions** to enhance system responsiveness and reduce infrastructure overhead.\n• Deployed the **ELK stack** for centralized logging and real-time monitoring of system performance.\n• Managed **Kubernetes** for deploying Python microservices, enhancing system reliability and enabling rolling updates.\n• Employed automated testing frameworks such as **PyTest** and **Selenium** to guarantee backend service quality.\n• Designed integration APIs with **MuleSoft** for secure financial data exchanges with external partners.\n• Contributed to the architecture of event-driven systems using **Kafka**, **RabbitMQ**, and **Azure Service Bus** for performance improvements.\n• Integrated CI/CD pipelines using **Azure DevOps** and **GitHub Actions**, ensuring streamlined development and deployment processes."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Exhibited **Project Management** skills by leading cross-functional teams to monitor and deliver e-commerce backend enhancements on **Python** using **FastAPI**, **Django**, and **Flask** while ensuring timely deployments.\n- Applied **Change Management** principles to streamline deployment processes, achieving a **40%** reduction in deployment time through efficient CI/CD pipelines with **GitHub Actions** and **Azure DevOps**.\n- Conducted **Data Analysis** on system performance metrics using **Prometheus** and **Grafana** for actionable insights leading to performance improvements by up to **30%**.\n- Developed comprehensive **Documentation** for system architecture, API integrations, and deployment processes to facilitate knowledge transfer within teams.\n- Fostered open **Communication** and **Collaboration** among teams to align on project milestones, ensuring all requirements for scalable **Python** applications were met.\n- Managed workloads and priorities using **Time Management** techniques, successfully juggling multiple projects, including the migration of legacy applications to **Python** microservices on **GCP**.\n- Oversaw the design and optimization of backend services, enhancing user experience by decreasing latency in payment processing workflows by **50%**.\n- Designed and implemented automated testing strategies, reducing manual testing time by **75%**, while maintaining high standards of quality through comprehensive testing frameworks like **PyTest**.\n- Coordinated project timelines and deliverables, adhering to deadlines for **GCP** deployments and ensuring alignment with business objectives.\n- Advocated for best practices in software development lifecycle management, contributing to team training sessions on **Change Management** techniques."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython \n\n **Backend Frameworks:** \n\tFastAPI, Django, Flask, Spring Boot \n\n **Frontend Frameworks:** \n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor \n\n **API Technologies:** \n\tREST & gRPC APIs \n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda), Azure (App Services) \n\n **Databases:** \n\tSQLAlchemy, Pydantic, Celery, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD \n\n **Cloud & Infrastructure:** \n\tAWS (RDS, S3), Azure (Blob, SQL), GCP \n\n **Other:** \n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Project Management, Change Management, Data Analysis, Documentation, Communication, Time Management, Collaboration"
}