{
  "name": "Damian Franciszek Pospiech",
  "role_name": "R&D Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven R&D Developer with 13+ years of experience in delivering high-performance applications, specializing in **Python**, **React**, **Next.js**, **FastAPI**, and **APIs**. Proven expertise in developing AI/LLM pipelines, real-time services, and innovative solutions, with strong proficiency in **Git** and **CI/CD** processes for efficient software development life cycle (SDLC) management. Experienced in deploying cloud-native systems across AWS and Azure, ensuring robust and scalable infrastructure.\nDemonstrated success in implementing high-impact projects across the healthcare and financial sectors, with a focus on compliance-driven development aligning with industry standards such as HIPAA and PCI DSS. A strong communicator with a background in innovation consulting, adept at translating complex technical concepts for diverse audiences.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "R&D Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **FastAPI** to design and implement real-time services and APIs, ensuring adherence to SDLC best practices.\nDeveloped intuitive front-end applications using **React** and **Next.js**, improving user engagement and accessibility by **30%**.\nIntegrated CI/CD workflows utilizing **Git** and industry best practices to streamline deployment processes, achieving **95%** automation in deployment tasks.\nImplemented innovative solutions incorporating AI/LLM pipelines to enhance functionality, resulting in improved performance metrics across live services.\nLed initiatives for innovation consulting, providing insights and recommendations that drove technology adoption and project success within teams.\nCollaborated effectively with cross-functional teams to ensure smooth communication in English, enhancing project alignment and implementation.\nReviewed and optimized existing codes and processes to leverage the latest technologies, resulting in a **20%** reduction in technical debt across projects.\nEngaged in continuous learning and adaptation of emerging technologies and trends to ensure the development of cutting-edge applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to develop scalable AI/LLM pipelines, enhancing data processing and model integration for innovative solutions.\nExecuted the full SDLC cycle for developing real-time services using **FastAPI**, ensuring robust API performance and adherence to development best practices.\nLeveraged **React** and **Next.js** (version **18**) to create cutting-edge front-end applications, significantly improving user interaction and engagement in R&D projects.\nImplemented CI/CD practices using **Git** to streamline deployment processes, reducing release times by **30%** and increasing code quality.\nLed cloud deployment strategies leveraging **Azure services**, ensuring efficient resource management and seamless application scaling across all stages of development.\nFostered innovation consulting discussions with stakeholders, ensuring alignment of technical solutions with business needs through effective **English communication**.\nDesigned unit tests and conducted thorough code reviews, enhancing system reliability and fostering a culture of continuous improvement within the development team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed high-performance backend services for innovative projects utilizing **Python** with frameworks such as **FastAPI** and **Django**, enabling efficient API design and integration within 9 key modules.\nEngineered scalable, real-time services leveraging **WebSockets** and an event-driven architecture powered by **Kafka** and **RabbitMQ**, achieving a response time improvement of up to **50%** during order processing.\nDesigned and implemented frontend applications using **React** (v18) and **Next.js**, optimizing user interfaces for both web and mobile platforms and enhancing user engagement metrics by **30%**.\nExecuted the strategic adoption of **AI/ML pipelines** integrating frameworks like **scikit-learn** and **TensorFlow**, fueling personalized user experiences and increasing conversion rates by **25%** through optimized product recommendations.\nImplemented CI/CD practices and automated deployment pipelines using **Git**, improving delivery timeframes by **40%** while maintaining high code quality throughout the **SDLC**.\nEmployed **Redis** for effective caching of frequently accessed resources, resulting in significant performance gains and reduced load times by **35%** across the application.\nAdopted cloud deployment strategies and used containerization with **Kubernetes** to enhance application reliability and scalability during peak traffic periods.\nUtilized **innovation consulting** principles to explore emerging technologies, continually enhancing product features and capabilities based on evolving industry trends.\nEngaged in proactive communication with stakeholders and team members, ensuring clarity of objectives and project milestones in fluent **English**.\nEstablished robust security practices including role-based access control (RBAC) and OAuth 2.0, achieving compliance with GDPR to safeguard user data integrity across platforms."
    }
  ],
  "skills": " **Programming Languages:**  \n\tPython,  \n\tJavaScript/TypeScript  \n\n **Backend Frameworks:**  \n\tFastAPI,  \n\tFlask,  \n\tDjango  \n\n **Frontend Frameworks:**  \n\tReact,  \n\tVue,  \n\tAngular,  \n\tNext.js  \n\n **API Technologies:**  \n\tAPIs  \n\n **Serverless and Cloud Functions:**  \n\tAWS: ECS, Lambda, RDS, S3,  \n\tAzure: App Services, Blob Storage, SQL Database  \n\n **Databases:**  \n\tPostgreSQL (Fintech),  \n\tMySQL (Healthcare),  \n\tMongoDB (Gaming),  \n\tRedis  \n\n **DevOps:**  \n\tDocker,  \n\tKubernetes,  \n\tGitHub Actions,  \n\tGitLab CI/CD,  \n\tCI/CD,  \n\tTerraform,  \n\tAnsible,  \n\tHelm,  \n\tDocker Compose  \n\n **Cloud & Infrastructure:**  \n\tcloud deployment  \n\n **Other:**  \n\tAI/LLM pipelines,  \n\treal-time services,  \n\tSDLC,  \n\tinnovation consulting,  \n\tEnglish communication,  \n\tKeycloak (OIDC, RBAC),  \n\tOAuth2,  \n\tJWT,  \n\tNginx,  \n\tLet’s Encrypt,  \n\tCertbot"
}