{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior React Native Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior React Native Software Engineer with 10+ years of experience proficiently developing high-performance applications utilizing **React Native**, **JavaScript**, **TypeScript**, and **RESTful APIs**. Demonstrated expertise in integrating **Bluetooth Low Energy (BLE)** technologies and building secure and maintainable solutions that adhere to UI/UX best practices. Strong command of **Git** for version control and leveraging CI/CD practices to streamline deployments. Experienced in creating native modules using **Swift** and **Kotlin** to enhance application capabilities, and knowledgeable in working with **BLE libraries** and **Jest** for comprehensive testing.\n\nFocused on delivering innovative solutions for IoT and smart home ecosystems, particularly in energy systems and EV charging technologies. Exceptional communication skills and a collaborative mindset, with a commitment to driving real-world impact through technology. Proven ability to lead projects from conception to delivery while ensuring compliance with industry standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior React Native Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented mobile applications using **React Native** and **JavaScript**, focusing on UI/UX best practices to ensure a smooth user experience, with innovative features that integrate **Bluetooth Low Energy (BLE)** technology.\n• Developed and maintained RESTful APIs to handle data communication between client-side applications and backend services, ensuring efficient and secure data transfer.\n• Collaborated with cross-functional teams to establish and promote a collaborative mindset, utilizing strong communication skills to effectively convey technical concepts and user requirements.\n• Established CI/CD pipelines with tools like **Git** and **Jest**, ensuring code quality through rigorous testing and continuous integration processes.\n• Leveraged native modules in both **Swift** and **Kotlin** to enhance mobile application functionality, contributing to a seamless user experience across platforms.\n• Integrated advanced **BLE libraries** to enable innovative capabilities for smart home and IoT solutions, including energy systems and **EV charging tech**.\n• Participated in the complete software development lifecycle, from conceptualization to deployment, ensuring high-quality deliverables.\n• Mentored junior developers on best practices in software development, enhancing team performance and knowledge sharing. \n• Conducted regular code reviews, implementing feedback for continual improvement of application performance and maintainability.\n• Stayed updated with industry trends and emerging technologies to propose innovative solutions that align with organizational goals."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and maintained high-quality mobile applications using **React Native** and **TypeScript**, ensuring adherence to **UI/UX best practices** for optimal user experience in smart home and energy systems.\nUtilized **RESTful APIs** for seamless integration with back-end services, enhancing communication and data exchange across platforms.\nImplemented CI/CD pipelines using **Git** and relevant tools, increasing deployment efficiency by **30%** and reducing time-to-market for app enhancements.\nCollaborated effectively within a cross-functional team, showcasing strong **communication skills** and a **collaborative mindset** to deliver features that aligned with project goals and stakeholder needs.\nIntegrated real-time Bluetooth Low Energy (BLE) functionalities into applications, optimizing device interaction within IoT ecosystems, resulting in improved user engagement metrics by **25%**.\nAdopted **JavaScript** frameworks and libraries, including **Jest** for robust testing and verification of code quality, ensuring high reliability of application features.\nEngaged in the full software development lifecycle, from concept through delivery, driving a **40%** improvement in feature rollout timelines by implementing agile methodologies in development processes.\nLeveraged native modules in **Swift** and **Kotlin** to enhance app performance on iOS and Android platforms, achieving improved app responsiveness and reduced load times by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed cross-platform mobile applications leveraging **React Native** and **TypeScript** to deliver seamless user experiences in smart home and energy systems applications.\nEngineered **RESTful APIs** for mobile interactions, ensuring efficient data communication and smooth integration with backend services using **JavaScript** and **Git** for version control.\nImplemented **UI/UX best practices** to optimize user interfaces for mobile platforms, leading to a **30%** increase in user engagement based on analytics.\nCollaborated in agile teams to enhance application performance and achieve **95%** test coverage using **Jest**, providing reliable software releases through robust **CI/CD** pipelines.\nUtilized **Bluetooth Low Energy (BLE)** libraries to enable connectivity features for smart home devices, enhancing user experience and device interoperability in energy systems, including **EV charging tech**.\nIncorporated native modules in **Swift** and **Kotlin** to expand application capabilities, allowing for seamless integration of device-specific features.\nApplied strong **communication skills** and a **collaborative mindset** to work effectively with cross-functional teams, driving project success and ensuring timely delivery of features.\nConducted code reviews and provided mentorship to junior developers, promoting best practices and fostering a culture of continuous improvement within the team.\n\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Frontend Frameworks:**\n\tReact, React Native, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tRESTful APIs\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Bluetooth Low Energy (BLE), Git, Jest, UI/UX best practices, Native modules (Swift), Native modules (Kotlin), BLE libraries, IoT, smart home, energy systems, EV charging tech, communication skills, collaborative mindset"
}