{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Backend Engineer with 9+ years of experience specializing in **Node.js**, **TypeScript**, and **JavaScript** for designing robust APIs and scalable SaaS solutions. Proficient in relational database management, particularly with **PostgreSQL**, and implementing **Asynchronous Communication** strategies. Strong foundation in **OOP** and **Design Patterns**, ensuring code quality and maintainability. Demonstrated success in developing serverless applications on **AWS** within the FinTech sector. Known for excellent problem-solving skills and a customer-focused approach, while adeptly collaborating with cross-functional teams to drive projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Node.js**, **TypeScript**, and **JavaScript** to design and develop scalable backend solutions, improving system performance by 30%.\nImplemented robust API services to enhance data interchange between the frontend and backend systems, promoting a seamless user experience.\nDesigned scalable microservices architecture to support a **SaaS** model, ensuring high availability and maintainability of applications.\nIntegrated **PostgreSQL** as a primary database solution, optimizing data storage and retrieval processes to achieve a **25%** reduction in query execution time.\nAdopted **OOP** principles and **Design Patterns** to enhance code quality and reusability, leading to a more maintainable codebase.\nExecuted serverless architecture on **AWS**, resulting in a 50% decrease in operational costs and improved scalability capabilities.\nFacilitated asynchronous communication strategies to enhance the responsiveness of applications, yielding a **15%** increase in user satisfaction.\nDeveloped solutions with a strong focus on **FinTech** applications, ensuring compliance with industry standards and fostering customer trust.\nExecuted problem-solving strategies that improved system resilience and performance, contributing to overall business goals.\nPrioritized customer-focused development by integrating feedback mechanisms, leading to a **20%** increase in user retention rates."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed robust and scalable backend solutions using **Node.js**, **TypeScript**, and **JavaScript**, contributing to a **15%** increase in team collaboration efficiency.\n• Designed and integrated **RESTful APIs** ensuring seamless data interaction with a **PostgreSQL** database, achieving real-time data access.\n• Implemented advanced **OOP** concepts and **Design Patterns** to optimize code structure and enhance maintainability, leading to improved project delivery timelines.\n• Architected a microservices framework with asynchronous communication protocols, enhancing system scalability and efficiency by **25%**.\n• Fostered continuous improvement by creating and managing **SaaS** applications, ensuring customer-focused solutions that align with business objectives.\n• Integrated caching mechanisms using Redis, which reduced latency in API calls by **25%**, therefore improving overall system performance.\n• Led adoption and implementation of CI/CD pipelines utilizing **AWS** policies and tools, reducing deployment errors by **30%**.\n• Mentored junior developers in best practices for **API** development and problem-solving strategies, increasing team productivity significantly.\n• Collaborated with cross-functional teams to gather system requirements, prioritizing features that enhance user experience, particularly in the **FinTech** domain.\n• Conducted thorough code reviews to ensure adherence to industry standards, emphasizing scalability and maintainability in all solutions."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed scalable backend services using **Node.js** and **TypeScript**, achieving a reduction in response times by **30%**.\n• Designed and implemented RESTful APIs for seamless data exchange, enhancing integration with third-party services.\n• Utilized **PostgreSQL** for efficient data management and improved query performance by **40%**.\n• Employed Object-Oriented Programming (OOP) principles and Design Patterns to create maintainable and robust codebases.\n• Implemented asynchronous communication strategies to handle high volumes of requests, improving system responsiveness.\n• Assisted in the deployment of Serverless applications on **AWS**, reducing hosting costs by up to **25%**.\n• Contributed to SaaS application development for the FinTech sector, focusing on customer-centric features and compliance.\n• Solved complex technical challenges by applying problem-solving techniques in a collaborative team environment.\n• Provided technical leadership in code reviews and architectural discussions to ensure the quality and scalability of applications.\n• Maintained focus on customer needs, continuously refining features based on user feedback and requirements."
    }
  ],
  "skills": " **Programming Languages**\n\t JavaScript, TypeScript, Python, Solidity\n\n **Backend Frameworks**\n\t Node.js, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL, API\n\n **Serverless and Cloud Functions**\n\t Serverless, AWS, Azure\n\n **Databases**\n\t PostgreSQL, MSSQL Server, MySQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\t CI/CD pipelines\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t UX/UI Design, Git, GitHub, Asynchronous Communication, OOP, Design Patterns, Problem Solving, Scalability, Customer Focus, Blockchain",
  "apply_company": "Deel"
}