{
  "name": "Tomasz Lee",
  "role_name": "PHP Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven PHP Developer with 9+ years of experience in developing and delivering high-quality applications using **PHP**, **Symfony**, and **Laravel**. Proficient in building RESTful APIs and leveraging **microservices architecture** to create scalable solutions. Hands-on experience with **Git** for version control and strong knowledge of **RabbitMQ** and **Kafka** for message brokering. Adept in **TypeScript** for enhancing frontend development and fostering agile practices within teams. Proven ability to effectively communicate and collaborate across various teams, ensuring project goals are met and exceeded.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "PHP Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "- Leveraged **PHP** framework (specifically **Symfony** and **Laravel**) to develop robust web applications, ensuring code quality and performance.\n- Designed and implemented **RESTful APIs** to facilitate seamless communication between microservices, enhancing scalability and maintainability of the architecture.\n- Integrated **RabbitMQ** for reliable messaging and **Kafka** for real-time data processing, significantly improving system throughput and resilience.\n- Developed features using **TypeScript** to enhance code maintainability and reduce runtime errors by 30%.\n- Collaborated within an **agile** environment, participating in sprint planning and daily stand-ups to foster effective communication and streamline development.\n- Utilized **Git** for version control, managing over **100** branches across projects to maintain a streamlined development process.\n- Streamlined application deployment processes with well-designed CI/CD pipelines, significantly reducing deployment times by **40%**.\n- Optimized database interactions within **MySQL** and **PostgreSQL**, achieving a **20%** reduction in average query execution times to enhance application performance.\n- Conducted regular code reviews and mentor junior developers, fostering a culture of continuous improvement and knowledge sharing.\n- Coordinated with cross-functional teams to gather requirements and ensure timely delivery of software products, leading to a **25%** increase in customer satisfaction."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **PHP**, **Symfony**, and **Laravel** to design and develop dynamic applications, resulting in a 20% increase in application performance and efficiency.\nCollaborated on a microservices architecture employing **RabbitMQ** for messaging and **Kafka** for real-time data processing, leading to a **15% reduction** in system downtime.\nDeveloped and maintained RESTful APIs, enhancing interoperability and integration with existing systems, which improved response times by **20%**.\nImplemented **Git** for version control and collaboration, streamlining the project's development process and reducing merge conflicts by **40%**.\nParticipated in agile methodologies, enhancing team productivity and project delivery timelines by an average of **30%**.\nCommunicated effectively with cross-functional teams to gather requirements and provide regular updates, ensuring alignment with project goals.\nLed code review sessions to uphold coding standards and contributed to the team's skill development, raising overall team capabilities by **25%**.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **PHP** with **Symfony** and **Laravel** frameworks to develop dynamic web applications, enhancing user engagement by **30%**.\nImplemented **RESTful APIs** to facilitate seamless communication between microservices, improving the overall system architecture.\nEmployed **RabbitMQ** to manage asynchronous communication, optimizing message processing and reducing response times by **15%**.\nCollaborated in an **Agile** environment, participating in daily standups and sprint planning to ensure timely deliverables.\nMaintained version control using **Git**, ensuring a streamlined code management process for a development team of **5** engineers.\nCreated reusable libraries in **TypeScript** to enhance development efficiency and increase code maintainability by **25%**.\nActively contributed to the continuous integration and deployment processes, reducing deployment time by **40%**.\nWorked in conjunction with the DevOps team to monitor and scale applications deployed on **cloud services** for optimal performance.\nEngaged in thorough code reviews to uphold coding standards and foster team collaboration, enhancing code quality.\nProvided extensive documentation for developed systems, facilitating knowledge transfer and reducing onboarding time by **50%**."
    }
  ],
  "skills": " **Programming Languages**\n\t PHP, TypeScript, JavaScript, C#, Python\n\n**Backend Frameworks**\n\t Symfony, Laravel, NodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t Microservices, RabbitMQ, Apache Kafka\n\n**Other**\n\t UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, agile, communication"
}