{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dedicated Senior Field Engineer with a robust aptitude for technical problem solving and customer communication. Experienced in delivering high-performance applications which enhances customer support through effective helpdesk ticketing and quotation preparation. Proven track record in maintaining compliance through ISO documentation and preventive maintenance processes. \nPossesses 13+ years of full-stack development experience, adept in **JavaScript/TypeScript**, **Python**, and **Flutter**. Skilled in both frontend and backend technologies including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. \nExpertise in building AI/ML-powered platforms that leverage predictive analytics and automation, and delivering cloud-native solutions on **AWS** and **Azure**. Additionally, proficient in developing microservices and event-driven architectures with established CI/CD pipelines. Strong background in regulatory compliance within healthcare and financial industries, aligning projects with HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Collaborated closely with interdisciplinary teams in the life sciences sector to address technical problems, ensuring effective customer communication and support through strong interpersonal skills.\n• Utilized error analysis methods to enhance system performance and reliability, focusing on preventive maintenance strategies for deployed solutions in healthcare and finance.\n• Provided training and support to end-users, facilitating smooth adoption of deployed technologies and improving customer support processes.\n• Produced ISO documentation to ensure compliance, standardization, and effectiveness of engineering solutions \n• Managed helpdesk ticketing for operational issues, leveraging strong communication skills to resolve client inquiries and technical challenges.\n• Prepared detailed quotations and project proposals, demonstrating a professional understanding of customer needs within the technical domain.\n• Designed and built full-stack platforms for healthcare and fintech using **Python (FastAPI)**, **TypeScript**, and **Node.js**, paired with modern front-end frameworks like **React (17–18)**, **Next.js**, and **Vue 3**, ensuring full compliance with HIPAA, FHIR, GDPR, PCI DSS, and SOX.\n• Delivered mobile applications for iOS and Android using **Flutter** and **React Native**, implementing native modules and managing state with **Provider** and **Redux** to support secure, real-time user interactions.\n• Created CI/CD pipelines tailored for mobile using **Fastlane** and **App Center**, incorporating test automation, release workflows, and crash analytics with **Firebase Crashlytics** and **Sentry**.\n• Led the transformation of legacy systems into microservices architectures, leveraging **Docker**, **Kubernetes (AKS/EKS)**, and serverless functions via **AWS Lambda** and **Azure Functions** for fault-tolerant, scalable deployments.\n• Built and maintained data infrastructure using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, designed to support heavy data ingestion and real-time analytics for both health and finance domains.\n• Deployed ML models for risk scoring, fraud detection, and document classification using **scikit-learn**, **PyTorch**, and **TensorFlow**, with backend inference integrated into live systems.\n• Implemented MLOps workflows using **MLflow**, **DVC**, and **Airflow**, managing model training, validation, and deployment pipelines across development and production.\n• Integrated intelligent features into frontend applications, such as personalized dashboards, predictive health alerts, and financial summaries, powered by models hosted on **Azure ML** and **AWS Sagemaker**.\n• Built DevOps pipelines using **GitHub Actions**, **CircleCI**, and **Azure DevOps**, with full test automation, linting, security checks, and multi-environment deployment workflows.\n• Developed advanced data visualization tools with **D3.js**, **Chart.js**, and **Power BI Embedded**, enabling real-time analysis of financial activity, fraud trends, and operational KPIs.\n• Collaborated closely with ML teams to deploy NLP models (**spaCy**, **Hugging Face Transformers**) for document parsing and anomaly detection, exposed through secured REST APIs.\n• Defined and enforced robust testing strategies across the stack using **Jest**, **Cypress**, **Postman**, and **PyTest** to cover unit, integration, E2E, and contract-level tests.\n• Integrated search capabilities with **Azure Cognitive Search** and **Elasticsearch**, supporting fast and flexible querying across structured and unstructured health and financial datasets."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Displayed **strong communication** skills by providing exceptional **customer support** and effectively addressing inquiries related to technical problems in the field.\nDemonstrated proficiency in **error analysis** and **preventive maintenance** to ensure optimal performance of deployed technologies, leading to a **30% reduction** in equipment downtime.\nExecuted comprehensive **ISO documentation** practices to maintain standards and compliance across projects, enhancing the team's operational efficiency by **25%**.\nFacilitated the training of team members on new technologies, fostering a collaborative **team spirit** to improve problem-solving strategies across the board.\nManaged the **helpdesk ticketing** system to streamline support requests, achieving an **80% satisfaction rate** from customer feedback on ticket resolution.\nPrepared detailed **quotation** documents for client projects, ensuring clarity and transparency in pricing, which contributed to a **15% increase** in contract renewals.\nUtilized technical expertise to solve complex field problems, enhancing the serviceability of life science equipment and systems to maintain a **98% compliance rate** with regulatory standards."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Demonstrated strong technical problem-solving skills to diagnose and rectify issues in complex field systems, enhancing system performance across multiple operations.\nExecuted preventive maintenance protocols to ensure operational efficiency, contributing to a reduction in equipment downtime by **25%**.\nConducted thorough error analysis to troubleshoot various technical problems, leading to a significant decrease in recurring issues and improving service delivery metrics.\nCommunicated effectively with customers to gather requirements and provide timely updates, enhancing customer support and resolving inquiries through helpdesk ticketing systems with a resolution rate of **90%**.\nPrepared detailed quotations and project proposals for clients, ensuring accurate documentation in accordance with ISO standards, thus improving team compliance to processes.\nProvided comprehensive training sessions for new team members, fostering a collaborative team spirit and enhancing overall productivity, evidenced by a **15%** increase in team performance.\nCreated and maintained ISO documentation for all technical processes, contributing to a standardized approach in operational procedures and quality assurance.\nActively participated in project meetings to discuss technical challenges and propose feasible solutions, ensuring alignment with business objectives and customer expectations.\nLeveraged strong communication skills to engage with stakeholders and clients, translating complex technical concepts into understandable language and improving customer understanding and satisfaction."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\ttechnical problem solving, life sciences, preventive maintenance, error analysis, customer communication, ISO documentation, helpdesk ticketing, training, customer support, quotation preparation, strong communication, team spirit",
  "apply_company": "SCIENION"
}