{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a results-driven Senior Field Engineer with a strong emphasis on **software** and **controllers**, I am adept at troubleshooting and integrating complex systems within electrotechnics and mechatronics environments. With 8 years of experience, I excel in providing exceptional customer service and communication to deliver high-performance solutions effectively. My extensive background encompasses full-stack development with **JavaScript/TypeScript**, **Python**, and **Flutter**, ensuring robust software applications are tailored to client needs. Additionally, I have led projects utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, and possess substantial cloud experience with **Azure** and **AWS**. My technical expertise is complemented by a strong understanding of compliance standards, enabling me to implement solutions that are both secure and reliable.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized strong troubleshooting skills to diagnose and resolve electrotechnics and mechanical issues in field operations, ensuring optimal functionality of systems and customer satisfaction.\nImplemented and maintained software controllers for various electromechanical systems, demonstrating proficiency in software development and mechatronics principles.\nProvided exceptional customer service, effectively communicating complex technical information to clients and stakeholders in a clear and concise manner.\nCollaborated with cross-functional teams to enhance product performance and reliability, ensuring all mechanical components met stringent standards and led to improved operational efficiency.\nConducted in-depth analysis of mechanical systems to identify areas for improvement and implemented strategic modifications, resulting in a **15%** increase in system efficiency.\nTrained junior engineers on troubleshooting techniques and mechanical systems principles, fostering a collaborative learning environment.\nExecuted preventive maintenance protocols, leading to a **20%** decrease in downtime and increasing overall system reliability.\nDeveloped comprehensive documentation for system specifications and maintenance procedures, facilitating knowledge transfer and improving team communication.\nLed on-site engineering support during installations and troubleshooting, reducing response time to customer inquiries by **30%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized exceptional **communication** skills to interface with clients, providing top-notch **customer service** in understanding their project requirements and troubleshooting field challenges.\nDemonstrated proficiency in integrating **electrotechnics** and **mechatronics** with **software** solutions, optimizing project effectiveness by applying mechanical and controller systems for operational efficiency.\nExpertly conducted troubleshooting on complex systems, ensuring minimal downtime and swift resolution of technical issues affecting customer satisfaction.\nProvided hands-on support and maintenance for systems, applying extensive knowledge of **controllers** and **mechanical** components, enhancing system performance by **30%**.\nCollaborated with cross-functional teams to streamline processes and improve operational efficiencies by utilizing standardized procedures, achieving a **15%** reduction in project turnaround times.\nDeveloped and executed detailed field engineering designs that incorporated advanced technologies, improving system reliability and user experience.\nMentored junior engineers and field technicians, fostering an environment of continuous improvement and knowledge sharing, which resulted in improved team performance and skill development."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Utilized **software** engineering principles to design and optimize backend services tailored for complex systems in electrotechnics and mechatronics, ensuring high reliability and performance.\n- Demonstrated advanced troubleshooting skills by integrating controllers and software solutions, resulting in a **15% reduction** in fault occurrences during system operations.\n- Communicated effectively with cross-functional teams to align project goals, enhancing collaboration and ensuring seamless integration of hardware and software components.\n- Provided exceptional customer service, addressing inquiries and technical issues promptly, which led to a **20% increase** in customer satisfaction ratings over **6 months**.\n- Developed and maintained detailed documentation for system configurations and procedures, facilitating smoother operational handovers and compliance with industry standards.\n- Conducted rigorous testing and debugging of electromechanical systems, ensuring optimal functionality and alignment with engineering specifications.\n- Trained junior engineers in troubleshooting techniques and customer service best practices, fostering a culture of knowledge sharing and continuous improvement.\n"
    }
  ],
  "skills": "**Other**\n\tsoftware, electrotechnics, mechatronics, mechanical, controllers, troubleshooting, customer service, communication\n\n**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure**\n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot\n\n**Artificial Intelligence & Machine Learning**\n\tMLflow, Airflow, Kubeflow",
  "apply_company": "Recruitment Team"
}