{
  "name": "Rei Taro",
  "role_name": "Product Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Accomplished Product Engineer with over 10 years of experience in backend development, specializing in high-performing APIs and scalable cloud-native architectures. Proficient in **Python** (specifically **Django**, **FastAPI**, and **Flask**) and cloud services such as **AWS**. Experienced in integrating **AI tools** and implementing Agile methodologies to drive successful project outcomes. Recognized for collaborative problem-solving and resourcefulness, I have a proven track record of delivering impactful solutions for leading organizations including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Product Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Python** to engineer backend services in **FastAPI** for efficient document automation, user onboarding, and reporting workflows.\nImplemented AI tools for enhanced decision-making and collaboration; leveraging **Django** frameworks to optimize web development processes.\nDeveloped event-driven solutions using **Celery** and **Redis** for managing asynchronous processing tailored for financial transaction requests, improving throughput by **30%**.\nDeployed microservices effectively on **Azure App Services**, utilizing **Terraform** for infrastructure as code, leading to a **25%** reduction in deployment time.\nCreated and maintained data pipelines for regulatory data exchange using **Apache Airflow** and **Azure Functions**, achieving timely and accurate data flow with **99%** reliability.\nConducted thorough security assessments, integrating **OAuth2** and **Azure AD B2C** to build secure, scalable authentication systems compliant with industry standards.\nCollaborated with cross-functional teams to address system integration challenges, ensuring compliance and overseeing release strategies while employing **Agile methodologies**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed backend systems in **Python** and **FastAPI** to automate document workflows, streamline user onboarding, and handle complex reporting processes.\n• Created event-driven microservices using **Celery** and **Redis**, enabling asynchronous processing of financial data and transaction requests.\n• Managed the deployment of microservices on **Azure App Services**, leveraging **Terraform** for infrastructure automation to maintain consistent and scalable environments.\n• Engineered data pipelines for the secure exchange of regulatory data, using **Apache Airflow** and **Azure Functions** to automate and streamline the data flow.\n• Performed security audits, ensuring compliance with industry standards, and integrated **OAuth2** and **Azure AD B2C** to manage authentication and secure access controls.\n• Collaborated with cross-functional teams to ensure smooth system integration, regulatory compliance, and successful release management with a focus on **Agile methodologies**.\n• Led initiatives to enhance UX/UI design using **Django** and **Vue.js**, improving customer satisfaction rates by over **30%**.\n• Implemented AI tools for data analysis, increasing processing efficiency by **20%**.\n• Demonstrated exceptional problem-solving skills by resolving issues in less than **48 hours**, ensuring minimal impact on operations.\n• Fostered collaboration and independence within the team, resulting in a **15%** increase in project delivery speed."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed backend services for trade execution, portfolio management, and account tracking using **Python**, **Flask**, and **PostgreSQL** to enhance trading operations.\n• Engineered real-time price feed processors with **asyncio**, **WebSockets**, and **Redis** to deliver up-to-the-minute trading data for high-frequency transactions, processing over **1000** transactions per second.\n• Collaborated closely with frontend teams to deliver data through **REST APIs** and **WebSocket** channels, ensuring smooth user interaction with the platform, improving response time by **30%**.\n• Ensured the platform met regulatory requirements, including **MiFID II** and **GDPR**, while adhering to internal data security protocols.\n• Implemented comprehensive test suites with **PyTest**, **tox**, and mock servers, streamlining QA and CI processes for efficient development cycles, reducing bugs by **15%**.\n• Introduced job queuing and scheduling solutions with **Celery** and **RabbitMQ**, optimizing backend task execution and process management, resulting in a **25%** increase in task efficiency."
    }
  ],
  "skills": "Programming Languages:\n\t**Python,**\n\nBackend Frameworks:\n\t**Django,**\n\nFrontend Frameworks:\n\t**Vue.js,**\n\nAPI Technologies:\n\t**REST/gRPC APIs,**\n\nServerless and Cloud Functions:\n\t**AWS,**\n\nDatabases:\n\t**PostgreSQL, MySQL, MongoDB, Redis,**\n\nDevOps:\n\t**Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD,**\n\nCloud & Infrastructure:\n\t**AWS (EC2, S3, Lambda), Azure,**\n\nOther:\n\t**Bash, JavaScript, FastAPI, Flask, Celery, AI tools, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, UX/UI design, Agile methodologies, Empathy, Collaboration, Problem-solving, Resourcefulness, Independence, Focus, PyTest, Git, Microservices, Kafka**"
}