{
  "name": "Marcin Karol Kotlinski",
  "role_name": "AI Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As an AI Software Engineer with 8 years of full stack development experience, I possess strong expertise in **Python**, **FastAPI**, and microservices architecture, crucial for developing scalable AI solutions. My technical skill set also includes **Flask**, **event-driven architecture**, and technologies such as **Kafka**, **SSE**, and **WebSocket**. My experience encompasses working with Large Language Models (LLMs) including **GPT**, **Claude**, and **Gemini**, as well as proficiency in fine-tuning, prompt engineering, and employing **vector databases** like **OpenSearch** and **FAISS**. I've implemented Retrieval-Augmented Generation (RAG) systems and developed AI agents, leveraging **OpenAI Chat Completion** and Assistant endpoints.\n\nIn addition to my technical capabilities, I have successfully led enterprise-grade platform development projects in healthcare and finance, integrating machine learning capabilities for predictive analytics. I maintain a strong foundation in developing robust applications that align with compliance standards such as HIPAA and PCI DSS, and I possess hands-on experience with CI/CD automation and MLOps workflows using **MLflow**, **Airflow**, and **Kubeflow**. My excellent problem-solving, communication, and collaboration skills further enhance my ability to deliver high-quality solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "AI Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and implemented AI-driven solutions using **Python** and **FastAPI**, focusing on scalable, microservices architecture to enhance application performance and user engagement.\nUtilized advanced techniques in **Large Language Models**, including **fine-tuning** and **prompt engineering**, to deploy AI algorithms that improved customer interaction through intelligent responses.\nCollaborated with cross-functional teams to deploy event-driven architectures with **Kafka** and **SSE**, ensuring high availability and real-time data processing for AI models.\nDesigned and optimized data storage solutions using **vector databases** and **OpenSearch**, providing efficient retrieval mechanisms for large datasets used in fine-tuning AI agents.\nIntegrated various retrieval-augmented generation (RAG) systems, leveraging models such as **GPT**, **Claude**, and **Gemini**, to deliver predictive and personalized experiences in client applications.\nLed initiatives to enhance system capabilities through **WebSocket** for real-time communication and **microservices architecture** for modular application development.\nImplemented robust testing strategies emphasizing problem-solving and collaboration skills, ensuring reliable deployment of AI applications with technologies like **Jest** and **Cypress**.\nEstablished effective communication channels to facilitate the seamless integration of AI features into existing workflows, enhancing overall system functionality and user satisfaction.\nWorked on deploying assistant endpoints, ensuring smooth operations of AI agents in various client applications, utilizing frameworks that support RESTful APIs.\nEngaged in continuous learning and knowledge sharing about emerging AI technologies and performance optimization strategies, modeling an innovative approach within the development team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed and implemented **microservices architecture** using **Python** (including frameworks like **FastAPI** and **Flask**) to enhance system performance and scalability in line with AI software engineering principles.\n- Designed an event-driven architecture utilizing **Kafka** and **WebSocket**, enabling real-time processing and asynchronous communication for high-frequency transaction systems.\n- Collaborated with cross-functional teams to integrate **AI agents** and large language models (**GPT, Claude, Gemini**) into existing systems, enhancing user interaction and automating complex workflows.\n- Engineered robust solutions for **Retrieval-Augmented Generation (RAG)** systems, leveraging **vector databases** and tools like **OpenSearch** and **FAISS** for efficient data retrieval and processing.\n- Spearheaded the deployment of AI/ML algorithms for fraud detection and prediction models, employing techniques for **fine-tuning** and **prompt engineering** to improve accuracy in identifying suspicious activities, achieving a detection rate improvement of **20%**.\n- Utilized **SSE** to enhance real-time data delivery in applications, resulting in a performance increase of up to **15%** for live updates and notifications.\n- Fostered a culture of problem-solving and collaboration within the team, leading to the successful launch of **3** major projects integrating AI solutions to streamline operations and improve user satisfaction across platforms."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **FastAPI** to design and optimize backend services for AI-driven applications, ensuring high availability, low latency, and scalability for AI features such as **Large Language Models** and **Retrieval-Augmented Generation**.\nImplemented event-driven architecture powered by **Kafka** and **WebSockets**, which enabled real-time features and responsive interactions, optimizing user experience across various AI solutions.\nCollaborated effectively with cross-functional teams to troubleshoot complex AI problems and present innovative solutions, honing strong **communication skills** throughout the project lifecycle.\nLeveraged **microservices architecture** to develop scalable AI components, enhancing modularity and simplifying integration with diverse systems.\nEngineered and fine-tuned AI models using **scikit-learn** and **TensorFlow**, achieving a **20%** improvement in model accuracy through effective **prompt engineering** and data optimization methods.\nBuilt and deployed **AI agents** using **OpenAI Chat Completion** and **Claude** for dynamic customer interactions, significantly enhancing user engagement and satisfaction metrics.\nIntroduced efficient data pipelines utilizing **vector databases** like **FAISS** and **OpenSearch** to store and retrieve high-dimensional data, ensuring swift and accurate responses in AI-driven applications.\nExecuted rigorous testing and quality assurance practices for AI features, resulting in reduced error rates and improved system reliability by **15%**.\nApplied **role-based access control (RBAC)** and **OAuth 2.0** to safeguard sensitive AI data, ensuring compliance with data protection regulations like GDPR while facilitating secure access for users.\nLed the adoption of **collaboration tools** to streamline workflows and improve team productivity during the development and deployment phases of AI solutions."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tWebSocket, SSE\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, vector databases, OpenSearch, FAISS\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tmicroservices architecture, event-driven architecture, Kafka, Large Language Models, fine-tuning, prompt engineering, GPT, Claude, Gemini, RAG systems, AI agents, OpenAI Chat Completion, Assistant endpoints, Retrieval-Augmented Generation, problem-solving, communication skills, collaboration"
}