{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Lead Website Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Lead Website Engineer with 13+ years of hands-on experience in **JavaScript technologies** and **front-end development**, delivering high-performance applications tailored for the healthcare and financial industries. Expert in **microservices architecture** and **UI/UX design**, proficient in integrating **martech stack** that align with SEO best practices. Demonstrated capability in providing **technical mentoring**, leveraging strong **communication**, **collaboration**, and **leadership skills** to guide teams towards innovative solutions. Additionally, skilled in backend development using **Node.js**, and implementing cloud-native systems on **AWS** and **Azure**. Experienced in building AI/ML-powered platforms that enhance predictive analytics, with a solid background in compliance-driven development aligned with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Lead Website Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **JavaScript technologies** to develop and enhance responsive front-end applications using frameworks like React (17–18), effectively improving UI/UX design.\nLed the adoption of **microservices architecture** for web applications to ensure scalability and maintainability, overseeing the transition from monolithic systems with tools like Docker and Kubernetes (AKS/EKS).\nProvided technical mentoring to junior developers, fostering a collaborative environment focused on continuous improvement and effective communication regarding project objectives.\nDrove the integration of martech stack components to streamline marketing operations and enhance SEO performance, actively utilizing analytics tools to measure impact.\nUtilized algorithms to optimize application performance, ensuring real-time data processing and user interactions across health and finance platforms.\nDeveloped front-end components with accessibility in mind, enhancing usability for diverse user groups and achieving compliance with industry standards.\nCollaborated closely with cross-functional teams, ensuring clear communication and alignment on project goals and timelines, resulting in timely delivery of features.\nDelivered project updates and technical insights in English to stakeholders, simplifying complex technical concepts for non-technical audiences.\nParticipated in leadership meetings to strategize on project direction, evaluating technology stack enhancements and best practices in **front-end development**.\nExecuted comprehensive code reviews, providing constructive feedback to enhance code quality and adherence to organizational standards.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **JavaScript technologies** to modernize core financial platforms by migrating to **microservices architecture** with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), resulting in enhanced scalability and performance for high-volume transactional systems.\n\nDrove **front-end development** initiatives by building interactive applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels.\n\nImplemented SEO best practices while delivering real-time analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, equipping operations teams with instant insights into transactions and anomalies.\n\nDesigned and deployed a robust event-driven architecture utilizing **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows including payments, alerts, and compliance, improving response times by up to **30%**.\n\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both **batch** and **real-time** processing, thus increasing data availability by **40%**.\n\nConstructed and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns, achieving a fraud detection accuracy of **95%**.\n\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services effectively.\n\nProvided **technical mentoring** and leadership to junior engineers, fostering a collaborative environment that encourages innovation and skill development within the team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Led the development of scalable and high-performance web applications using **JavaScript technologies** (React 18, Vue 3, Angular) and **Node.js** frameworks (NestJS, Express), enhancing user experience and driving site engagement across 100s of products.\nIntegrated **SEO** strategies to optimize website visibility on search engines, achieving a **30%** increase in organic traffic and improving site performance.\nCollaborated on **microservices architecture** enabling independent deployment and scalability of services, improving team productivity by **25%**.\nMentored junior developers in front-end development best practices, fostering technical growth and collaboration within the engineering team, resulting in enhanced code quality.\nApplied **UI/UX design** principles to create responsive and accessible interfaces, meeting **WCAG 2.1** compliance for better user engagement.\nDeveloped and optimized algorithms to enhance the **martech stack integration**, resulting in better customer journey mapping and personalization.\nExecuted effective communication strategies across cross-functional teams to ensure alignment and timely delivery of project milestones.\nDemonstrated strong leadership skills while overseeing the project lifecycle, driving team collaboration which successfully reduced time-to-market for product features by **15%**.\nFacilitated discussions and brainstorming sessions focused on innovation and improvement, boosting overall team morale and productivity.\nUtilized performance metrics and analytics to guide decision-making and improve site functionalities based on user feedback, achieving a **20%** increase in user satisfaction scores."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript/TypeScript\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n **Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\tfront-end development\n\n **API Technologies:**\n\tNginx\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS\n\tRDS\n\tS3\n\tAzure: Blob Storage\n\tSQL Database\n\n **Other:**\n\tSEO\n\tmartech stack integration\n\tmicroservices architecture\n\tUI/UX design\n\talgorithms\n\ttechnical mentoring\n\tleadership skills\n\tcommunication skills\n\tcollaboration skills\n\tEnglish proficiency"
}