{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior QA Engineer with 13+ years of experience in delivering quality assurance across healthcare and financial applications. Proficient in testing methodologies including manual and automated testing, with a strong background in API testing and adherence to ISTQB standards. Expertise in analysis, reporting, and maintaining comprehensive documentation to ensure system integrity and compliance. Notable experience working collaboratively with cross-functional teams to enhance product quality. \n\nIn addition to quality assurance, I am a Full Stack Developer skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**. I bring hands-on expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, enabling a holistic approach to software development. Experienced in building AI/ML-powered platforms for predictive analytics and real-time processing. Additionally, well-versed in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, event-driven architectures, and CI/CD pipelines.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Defined and enforced robust testing strategies across the stack using **Jest**, **Cypress**, **Postman**, and **PyTest** to ensure comprehensive coverage across unit, integration, E2E, and contract-level tests.\n- Utilized **API** testing methodologies to validate functionality and performance based on specifications and business requirements, ensuring alignment with **ISTQB** guidelines.\n- Led efforts for implementing automation in testing processes, enhancing efficiency and accuracy, and significantly reducing testing time by **40%**.\n- Collaboratively worked with cross-functional teams to develop and maintain documentation, facilitating clear communication regarding testing strategies, results, and defects.\n- Conducted detailed analysis of testing results to provide actionable insights and facilitate decision-making for stakeholders, enhancing overall software quality.\n- Created and maintained comprehensive test reporting frameworks to track quality benchmarks and project milestones, presenting findings to team members and management.\n- Leveraged collaborative tools to streamline testing processes, improving inter-team communication and version control in managing test scripts.\n- Ensured rigorous regression testing as part of CI/CD pipelines utilizing technologies such as **GitHub Actions**, reducing defect leakage to **1%** in production.\n- Implemented API performance testing tools and strategies to assess response times and reliability, achieving performance benchmarks of under **200 ms** for critical endpoints."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conduct comprehensive **manual** and **automated testing** of core financial applications and their **APIs** to ensure quality and compliance with specifications.  \nCollaborate with cross-functional teams to enhance overall software quality, leveraging **collaborative tools** for effective communication and bug reporting.  \nCreate detailed **documentation** of test plans, test cases, and reports to facilitate knowledge sharing and improve **analysis** of software performance and issues.  \nDevelop and execute robust testing strategies that align with **ISTQB** standards, ensuring thorough coverage and risk assessment for each release.  \nUtilize industry-leading **testing frameworks** to automate regression tests, reducing testing cycle time by **30%**.  \nAnalyze testing results and provide actionable insights to development teams to drive product improvements and ensure timely delivery and deployment of software updates.  \nEngage in regular **reporting** of testing progress, defects, and resolutions, maintaining transparency with all stakeholders throughout the project lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted thorough **API** testing to validate backend service functionalities across **Python** (FastAPI, Django) and **Node.js** (NestJS, Express) frameworks, ensuring the accountability and reliability of systems in a global e-commerce environment.\nExecuted extensive **manual** and **automation** testing methodologies using tools such as Selenium and Postman, enhancing product quality and adherence to industry standards while achieving a defect identification rate of over **95%** in pre-release evaluations.\nLeveraged **ISTQB** certified techniques to develop and refine comprehensive testing documentation, including test plans and detailed reports, facilitating traceability and transparency in testing processes.\nCollaborated with development teams using **collaborative tools** like JIRA and Confluence to streamline workflow, prioritize testing based on release cycles, and implement continuous integration testing strategies for real-time feedback.\nPerformed data analysis for test results, utilizing **reporting** tools to identify trends and evaluate project risks, which led to a **30%** reduction in post-release defects.\nParticipated in cross-functional teams to analyze requirements, ensuring thorough understanding and coverage of functional and non-functional specifications before project initiation.\nEstablished effective **testing** frameworks for both frontend (React 18, Vue 3, Angular) and backend (MongoDB, PostgreSQL) applications, which improved the speed and efficiency of the testing cycle by **40%**.\nEnhanced testing efficiency through the application of automated scripts, reducing regression testing time by **50%** and enabling faster deployment cycles.\nManaged documentation of testing processes and outcomes to facilitate knowledge sharing and onboarding of new team members, contributing to a **20%** improvement in team onboarding efficiency.\nActively participated in QA meetings and brainstorming sessions to foster a culture of continuous improvement and innovation in the testing processes."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Other:**\n\tautomation\n\ttesting\n\tmanual\n\tISTQB\n\treporting\n\tcollaborative tools\n\tanalysis\n\tdocumentation",
  "apply_company": "Fédération pour l'Entrepreneuriat Durable"
}