{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior JavaScript Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior JavaScript Engineer with 8 years of experience, I leverage my extensive expertise in **JavaScript**, **Node.js**, and cloud technologies such as **AWS Lambda** to develop high-performance B2B SaaS applications. My proficiency in API design and documentation, along with hands-on experience in **REST** and **SOAP** services, allows me to create seamless integrations that enhance user experience and drive business growth. I have a solid background in database management using **SQL**, **SQLite**, and **PostgreSQL**, ensuring robust data handling and storage solutions.\n\nI excel in building secure, scalable applications, employing automated testing practices and utilizing the **Serverless Framework** to streamline deployment processes. As a natural team leader, I emphasize strong communication and collaboration, cultivating problem-solving skills to navigate complex challenges. Furthermore, my experience developing in a microservices architecture and implementing CI/CD practices contributes to the deployment of efficient and compliant systems.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust, scalable web applications using **JavaScript**, **Node.js**, and modern frameworks while adhering to best practices in **API design** and **documentation**.\n- Implemented RESTful and SOAP web services to enhance communication with diverse microservices and third-party integrations, ensuring seamless data flow.\n- Designed efficient database architectures with **PostgreSQL** and **SQLite**, optimizing SQL queries for performance and scalability in data storage and retrieval.\n- Leveraged **AWS Lambda** for building serverless applications, utilizing **API Gateway** for managing APIs, enhancing deployment efficiency and reducing operational overhead.\n- Executed automated testing strategies with tools such as Jest and Cypress, ensuring high-quality code through rigorous unit and integration tests.\n- Led a cross-functional team in the development of B2B SaaS solutions, fostering an environment of collaboration and effective **communication**.\n- Spearheaded problem-solving initiatives to optimize existing workflows and enhance overall application performance, achieving a **30%** reduction in response times.\n- Provided technical leadership and mentorship to junior developers, facilitating knowledge sharing and promoting best practices in software engineering.\n- Collaborated closely with client stakeholders to gather specifications and create tailored features, resulting in a **95%** customer satisfaction score.\n- Drove the adoption of agile methodologies within the team, improving project delivery timelines by **20%** through effective sprint planning and execution."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed and maintained RESTful and SOAP APIs using **Node.js** (NestJS/Express), ensuring seamless integration and performance for high-volume financial transactions.\n- Leveraged **JavaScript** frameworks such as **React** (18) and **Vue 3** to build dynamic user-focused front-end applications, improving user engagement and satisfaction metrics by over **40%**.\n- Designed comprehensive API documentation and executed robust API testing to enhance the reliability of B2B SaaS products and services, resulting in a **30%** reduction in bugs reported post-release.\n- Collaborated with cross-functional teams, improving communication pathways and brainstorming problem-solving strategies to expedite project completion by **20%**.\n- Utilized **SQL** databases including **PostgreSQL** and **SQLite** for efficient data storage and retrieval in financial platforms, achieving a data query response time improvement of **15%**.\n- Led and mentored a team of developers, providing guidance in using **AWS Lambda** and **Serverless Framework** for scalable cloud deployments, which enhanced deployment frequency by **25%**.\n- Integrated automated testing protocols to ensure the reliability and performance of all solutions, significantly reducing deployment-related issues.\n- Championed API design focusing on user experience and technical feasibility, enhancing developer onboarding and lowering integration time for clients by **50%**.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and optimized RESTful APIs and services using **Node.js**, ensuring high performance and reliability in line with best practices for B2B SaaS applications.\n• Implemented automated testing strategies for backend systems, enhancing code reliability and delivery speed by **25%**.\n• Designed and documented APIs for internal and external consumption, creating comprehensive documentation to facilitate Team leadership and effective communication.\n• Leveraged **PostgreSQL** and **SQLite** for efficient data handling, ensuring seamless interaction with relational databases and adherence to SQL standards.\n• Integrated cloud services like **AWS Lambda** and **API Gateway** to implement serverless architecture, reducing operational costs by **30%**.\n• Led cross-functional teams to foster collaboration, improve problem-solving abilities, and drive project timelines, resulting in project completions ahead of schedule by an average of **15%**.\n• Supported the transition of legacy systems to modern frameworks, improving application maintainability and scalability through best coding practices and standards.\n• Conducted team training sessions to elevate skill levels in JavaScript frameworks, enhancing overall team performance and productivity.\n• Employed agile methodologies to manage workflows efficiently, ensuring delivery of high-quality features and bug fixes iteratively.\n• Championed security practices including API authentication and authorization standards, safeguarding application integrity and user data."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, Python, TypeScript\n\n**Backend Frameworks:**\n\tNode.js, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST, SOAP, API Gateway, API design, API documentation\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Serverless Framework\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, SQLite, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Automated testing, B2B SaaS, Team leadership, Communication, Problem-solving",
  "apply_company": "Memtime"
}