{
  "name": "Tomasz Lee",
  "role_name": "Senior Blockchain Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Blockchain Engineer with 9+ years of experience in developing and implementing robust applications and systems. Proficient in **Ethereum** and experienced in **Kubernetes**, **Terraform**, and **Ansible** for efficient infrastructure management and automation. Skilled in **AWS** and **GCP** for cloud services and deploying applications effectively. Demonstrated expertise in **Monitoring** frameworks such as **Grafana** and **Prometheus** to ensure system reliability. Possess a strong foundation in DevOps principles and **Site Reliability Engineering** for optimizing performance and enhancing security. Proven track record of improving collaboration and troubleshooting efforts across teams to deliver successful project outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Blockchain Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Spearheaded the design and development of a scalable **Ethereum** blockchain application, leveraging **Kubernetes** for container orchestration and deployment.\nImplemented **Terraform** for Infrastructure as Code, managing cloud resources on **AWS** and **GCP** efficiently and effectively.\nIntegrated **Prometheus** and **Grafana** for real-time monitoring and alerting, improving system uptime by **99.9%**.\nDeveloped and maintained CI/CD pipelines using **Ansible** and **Terraform**, slashing deployment times by **40%**.\nCollaborated with cross-functional teams to enhance the platform's reliability and performance, driving improvements in **Site Reliability Engineering** (SRE) practices.\nEmployed advanced troubleshooting techniques to resolve complex issues in production environments, maintaining system stability and security.\nUtilized best practices in **Security** to implement robust authentication methods, enhancing overall application protection.\nStreamlined **Platform Engineering** processes to ensure efficient resource utilization and project workflow.\nAchieved operational excellence through monitoring and optimizing application performance, leading to a **20%** reduction in resource consumption.\nActively participated in team collaboration sessions to innovate and refine product features, contributing to improved workflows."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Designed and developed cloud-based applications with a focus on **AWS** and **GCP**, ensuring robust deployment strategies in a dynamic environment.\n• Implemented **Kubernetes** for orchestration of containerized applications, facilitating a **30%** reduction in downtime during updates.\n• Utilized **Terraform** for Infrastructure as Code (IaC), enabling version control and reproducibility of infrastructure setups across **5** different environments.\n• Managed server performance and reliability by integrating **Prometheus** and **Grafana** for monitoring, leading to a **20%** increase in system uptime.\n• Collaborated effectively with cross-functional teams, ensuring smooth communication and project alignment, resulting in a **15%** enhancement in project delivery timelines.\n• Automated deployment processes and environment provisioning using **Ansible**, which decreased setup time by **40%**.\n• Developed governance protocols for blockchain transactions focusing on security and reliability in accordance with best practices for **Site Reliability Engineering**.\n• Engaged in thorough troubleshooting to maintain system integrity, diagnosing issues and implementing resolutions within **24 hours**.\n• Mentored junior engineers in best practices for DevOps and platform engineering, fostering a culture of continuous improvement and learning.\n• Orchestrated infrastructure scaling solutions using **Proxmox** and **MAAS**, enhancing resource allocation efficiency during peak demand."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Terraform** and **Ansible** for Infrastructure as Code practices, streamlining the deployment of blockchain solutions across various environments.\nImplemented **Kubernetes** for orchestrating containerized applications, enhancing scalability and reliability of services by **30%**.\nMonitored system performance using **Grafana** and **Prometheus**, increasing uptime and decreasing incident response time by **25%**.\nEngaged in Site Reliability Engineering (SRE) principles to maintain high availability and performance of blockchain applications.\nCollaborated effectively with cross-functional teams to enhance platform engineering processes, ensuring security and compliance in deployments.\nLed troubleshooting efforts for critical issues, reducing downtime and improving service recovery times by **15%**.\nProvided expertise in **AWS** and **GCP** cloud services to optimize infrastructure costs while maintaining performance metrics.\nFacilitated continuous integration and deployment strategies to accelerate the delivery of blockchain solutions to clients.\nCreated technical documentation and conducted training sessions to foster collaboration and enhance the team's skills in blockchain technologies.\nActively participated in code reviews, promoting best practices and enhancing the overall quality of code within the engineering team."
    }
  ],
  "skills": "  **Programming Languages**\n\tJavaScript, TypeScript, C#, Python, Solidity\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, GCP\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines, Kubernetes, Terraform, Ansible, Grafana, Prometheus, Site Reliability Engineering, Platform Engineering, Infrastructure as Code, Monitoring, Security\n\n  **Cloud & Infrastructure**\n\tProxmox, MAAS\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Collaboration, Troubleshooting, Ethereum",
  "apply_company": "Twinstake"
}