{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience in delivering high-performance applications focused on responsive design and web architecture. Expert in **JavaScript**, **HTML5**, and **CSS3**, with a strong command of **Angular** and **NgRx** for modern web applications. Proficient in building and optimizing **RESTful APIs** and employing **Git** for version control, alongside seamless integration of **CI/CD** practices to enhance deployment efficiency.\n\nDeeply experienced in deploying cloud-native systems, utilizing **AWS** and **Azure** services, complemented by backend capabilities in **Node.js**, **FastAPI**, and **Django**. Proven track record of developing AI/ML-powered platforms to implement predictive analytics and automation, while adhering to compliance standards such as HIPAA and PCI DSS. Exceptional skills in performance optimization, ensuring applications deliver robust user experiences.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented responsive design principles to enhance UI/UX for healthcare and fintech applications using **Angular** and **JavaScript**, ensuring consistency across devices and compliance with accessibility standards.\nDeveloped and optimized web architecture solutions, improving performance metrics by **30%** and ensuring seamless integration with backend services through **RESTful APIs**.\nUtilized **HTML5** and **CSS3** to create dynamic and interactive web pages, achieving a **25%** increase in user engagement through improved visual designs.\nManaged version control and collaboration processes using **Git**, streamlining code management and team workflows, and reduced code conflict occurrences by **40%**.\nDesigned and executed CI/CD pipelines utilizing **GitHub Actions** and **CircleCI**, achieving automated testing and deployment processes that reduced deployment times by **50%**.\nLeveraged **NgRx** for state management in large-scale applications, ensuring efficient data flow and application performance.\nImplemented advanced performance optimization techniques, achieving a **20%** reduction in load times and enhancing user satisfaction scores.\nCollaborated with backend teams to ensure RESTful APIs were efficient and secure, contributing to a more robust application infrastructure.\nConducted thorough code reviews and enforced best practices across the frontend stack to maintain high standards of code quality.\nEngaged in proactive problem-solving to identify performance bottlenecks, enhancing application responsiveness and user experience."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Angular** and **JavaScript** to build dynamic, high-performance front-end applications, optimizing user experience through responsive design and performance optimization techniques.\nImplemented **RESTful APIs** and integrated backend services to ensure seamless communication with financial platforms, significantly reducing data retrieval times by **30%**.\nCollaborated with cross-functional teams using **Git** for version control and adopted CI/CD processes to enhance deployment efficiency by **40%**.\nDeveloped sleek interfaces with **HTML5**, **CSS3**, and **NgRx**, focusing on maintainability and scalability of user interfaces for financial tools.\nEngaged in architectural discussions to innovate and optimize **web architecture**, ensuring systems are robust and responsive to user demands.\nApplied design principles to create applications that adhere to best practices for maintainable and responsive web experiences with frameworks like **Tailwind CSS**.\n\nAdapted existing codebases to newer standards by integrating modern tools and methodologies, enhancing application performance while reducing loading times by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed dynamic and responsive user interfaces utilizing **Angular** and **JavaScript** to enhance user engagement on the e-commerce platform, ensuring adherence to responsive design principles and performance optimization.\nEngineered RESTful APIs in line with best practices for seamless data interaction between frontend and backend services, improving communication efficiency across modules.\nUtilized **HTML5** and **CSS3** to create SEO-friendly web pages, ensuring compliance with accessibility standards (WCAG 2.1) and delivering a mobile-first experience for users across a variety of devices.\nImplemented advanced state management using **NgRx** to ensure consistent and performant application state across multiple views, enhancing the user experience during high-traffic periods.\nCollaborated with backend teams to establish CI/CD pipelines using **Git**, facilitating efficient code integration and deployment processes, reducing deployment times by **30%**.\nConducted thorough performance optimizations resulting in load times reduced by **20%**, contributing to increased user retention and satisfaction rates.\nParticipated in cross-functional teams to design scalable web architectures that support high availability and low latency across various functionalities such as product displays and user transactions.\nEngaged in rigorous testing practices, including unit tests and integration tests, to ensure the reliability and quality of deliverables in the production environment, leading to a **99.9%** uptime for the e-commerce platform.\nMaintained detailed documentation of frontend architecture and coding standards to facilitate ongoing maintenance and onboarding of new developers, improving team efficiency by **15%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, Python\n\n **Frontend Frameworks:**\n\tAngular, React, Vue, HTML5, CSS3\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tRESTful APIs\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, Terraform, Ansible, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Serverless and Cloud Functions:**\n\tLambda\n\n **Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, responsive design, performance optimization, web architecture, CI/CD, NgRx",
  "apply_company": "EPAM Systems"
}