{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Azure Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Azure Engineer with 8 years of experience specializing in **Azure**, **Linux**, **Kubernetes**, and **Docker** technologies in high-demand environments. Proficient in IT platform administration, change management, and monitoring, with a strong track record in SLA reporting and documentation. My problem-solving acumen is complemented by excellent customer interaction skills in both German and English.\nAs a seasoned Full Stack Developer, I bring a rich background in building high-performance solutions and a solid foundation in microservices architecture and CI/CD automation. I have effectively led enterprise-grade platform development leveraging **JavaScript**, **TypeScript**, **Python**, and **Flutter**. Additionally, my experience includes integrating AI/ML capabilities for predictive analytics and real-time data processing, utilizing tools such as **FastAPI**, **Django**, **MLflow**, **Airflow**, and **Kubeflow**. My deep understanding of cloud services with **Azure** and **AWS** positions me to contribute effectively in dynamic, compliance-focused environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Azure Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- **Implemented** Azure cloud services, ensuring efficient **IT platform administration** and management of **Linux** environments to strengthen infrastructure stability and performance.\n- Developed **Docker** containers and orchestrated deployments using **Kubernetes**, leveraging automation to facilitate seamless updates and scaling of applications.\n- Established comprehensive **monitoring** solutions for cloud applications, producing actionable **SLA reports** to enhance service reliability and performance metrics.\n- Led **change management** initiatives, contributing to improved system uptime and user experience through systematic planning and execution of upgrades and adjustments.\n- Produced and maintained detailed **documentation** on system architecture, processes, and operational guidelines, ensuring ease of use and knowledge transfer among team members.\n- Utilized strong **problem-solving** skills to troubleshoot and resolve complex system issues, enhancing application performance and user satisfaction through effective solutions.\n- Fostered impactful **customer interactions**, gathering feedback to refine cloud services and align solutions with client requirements, ensuring exceptional service delivery.\n- Conducted knowledge sharing sessions in both **German** and **English**, bridging communication gaps within diverse teams while empowering team members with enhanced technical knowledge.\n- Collaborated with cross-functional teams to integrate **monitoring** tools such as Azure Monitor and custom dashboards for enhanced visibility into system health and performance.\n- Participated in the deployment of solutions across Azure, scrutinizing performance and preparing for scale, contributing to strategic planning for future IT initiatives."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Documented and administered **Azure** platforms to ensure consistency and reliability across financial applications, focusing on **IT platform administration** and **SLA reporting**.\nImplemented containerization solutions using **Docker** and **Kubernetes**, enhancing deployment efficiency and scalability for high-availability systems.\nMonitored application performance and health on **Linux** servers, employing best practices for **Monitoring** and **Change management** to ensure 99.9% uptime.\nLed problem-solving initiatives to address integration issues, utilizing **documentation** to create detailed troubleshooting guides for operational teams.\nProvided impactful **customer interaction** support in both **German** and **English**, translating technical concepts into actionable solutions for stakeholders.\nEnhanced operational workflows and delivered insights based on data analysis, contributing to an **increase in throughput by 30%** on financial platforms.\nCollaborated with cross-functional teams to migrate legacy systems to modern architectures, resulting in a decline in maintenance costs by **15%** across IT platforms.\nDeveloped comprehensive documentation processes to streamline onboarding and knowledge transfer, contributing to a reduction in training time by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Managed **Azure** infrastructure deployments and configurations, ensuring optimal service delivery and compliance with SLA reporting standards across the organization.\nAdministered **Linux** systems and **Kubernetes** clusters for scalable application management, implementing **Docker** containers for seamless application deployments and environment consistency.\nMonitored system performance and operations using advanced monitoring tools to proactively identify and resolve issues, ensuring high system availability and reliability.\nImplemented change management strategies to facilitate smooth transitions during system upgrades and deployments, significantly improving system uptime by **30%**.\nCreated comprehensive documentation for operational procedures and troubleshooting guides, enhancing team efficiency and knowledge sharing across projects.\nUtilized problem-solving skills to address technical inquiries and issues, providing timely customer interaction in both **German** and **English**, leading to an **85%** customer satisfaction rating.\nCollaborated with cross-functional teams to design and uphold IT platform administration best practices, enhancing system performance and providing robust support for business operations.\nConducted SLA reporting to stakeholders, providing insights on system performance metrics and uptime, contributing to strategic decision-making within the organization."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tNone\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, Linux\n\n **Other:**\n\tIT platform administration, Monitoring, Change management, SLA reporting, Documentation, Problem-solving, Customer interaction, German, English, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow",
  "apply_company": "ifm"
}