{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior PowerBI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior PowerBI Engineer with over 13 years of full-stack development experience specializing in data visualization and analytics. Expert in **PowerBI**, **DAX**, **Power Query**, and **Dataflows**, with a strong foundation in **SQL Server** for robust data modeling and architecture. Proven proficiency in **Azure** cloud services and ETL processes, ensuring high-quality data integration and transformation for informed decision-making.\nSkilled in creating and managing APIs to facilitate seamless data flow and enhancing data quality through effective data governance practices. Excellent communication skills, enabling collaboration across cross-functional teams to deliver insightful business intelligence solutions. Additionally, adept in **JavaScript/TypeScript**, **Python**, and leading frameworks such as **React**, **Next.js**, and **Node.js**, with hands-on experience in crafting high-performance applications within the healthcare and financial sectors. Familiar with compliance-driven development adhering to HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior PowerBI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and developed data architecture and modeling strategies utilizing **SQL Server** to support PowerBI reporting and analytics, ensuring data quality and integrity across multiple sources.\nImplemented **ETL** processes and optimized dataflows, utilizing **Power Query** to transform and load data effectively into **PowerBI**, maximizing report performance and user accessibility.\nBuilt interactive dashboards and reports in **PowerBI** utilizing **DAX** for complex calculations, emphasizing usability and actionable insights.\nCollaborated with cross-functional teams to refine data communication strategies, enhancing information exchange through **APIs** and documentation.\nRegularly conducted data quality assessments and audits to ensure compliance with organizational standards and best practices, leading to a **25%** increase in data reliability.\nDeveloped and maintained data models, ensuring scalability and responsiveness in line with business needs, resulting in a **30%** faster report generation time.\nLeveraged **Azure** cloud services for scalable solutions to manage data storage and processing, enhancing deployment efficiency and reducing operational costs by **15%**.\nTrained stakeholders on using **PowerBI** tools, increasing team proficiency and reducing dependency on technical support.\nIntegrated **Excel** functionalities to enable advanced analytics and reporting, streamlining workflows and improving decision-making processes across departments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Power BI** in conjunction with **DAX** and **Power Query** to create dynamic financial dashboards and reports that deliver actionable insights, improving data-driven decision-making by **30%**.\nDesigned and implemented **data architecture** strategies, ensuring high scalability and performance of ETL processes to handle over **5 million** transactions daily using **Azure Data Factory**.\nDeveloped and maintained robust **SQL Server** databases, focused on optimizing queries for data retrieval and ensuring data quality across financial reports.\nCollaborated with cross-functional teams to establish **APIs** for seamless data integration and workflow automation, enhancing operational efficiency by **25%**.\nExecuted comprehensive data modeling initiatives to classify and structure financial data, supporting analysis and visualization efforts with **Power BI** and improving reporting accuracy by **15%**.\nInitiated and conducted **dataflows** for automated data ingestion processes, reducing manual input and errors while streamlining reporting timelines by **40%**.\nLed communication efforts within the team to align on best practices for data quality checks and standards, contributing to a **50%** increase in stakeholder satisfaction surveys regarding data reliability."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **PowerBI** to create interactive dashboards and reports, transforming complex datasets into actionable insights for stakeholders across the organization, enhancing decision-making and operational efficiency.\nEmployed **DAX** for advanced calculations and data analysis to develop robust data models that ensure high data quality and integrity in reports and dashboards.\nDeveloped and optimized **Power Query** processes for ETL workflows, streamlining data ingestion from various sources including **SQL Server**, and ensuring timely updates of essential business metrics.\nImplemented extensive **data architecture** strategies enabling seamless dataflows between systems, enhancing data accessibility and reporting capabilities for teams.\nDesigned efficient **data modeling** techniques to support performance analysis and trend reporting, which resulted in a **25%** increase in analysis speed and user engagement with the datasets.\nCollaborated with cross-functional teams to understand data requirements and foster clear communication, ensuring alignment on data-related objectives and deliverables.\nLeveraged **Azure** for data storage solutions, resulting in enhanced scalability and better resource management in the reporting pipeline.\nReengineered APIs to facilitate the integration of external data sources with PowerBI, improving data accuracy and timeliness of reports.\nExecuted regular data quality assessments and data cleansing workflows ensuring all data presented in PowerBI dashboards is reliable and precise, achieving a **98%** accuracy rate.\nProvided training and support to team members on PowerBI best practices, significantly increasing platform adoption across the organization."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\tJavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n **Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n **API Technologies:**\n\tAPIs\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda\n\tAzure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\tSQL Server\n\n **DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n **Other:**\n\tPowerBI\n\tDAX\n\tPower Query\n\tDataflows\n\tETL\n\tData modeling\n\tData architecture\n\tExcel\n\tData quality\n\tCommunication\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tMLflow\n\tAirflow\n\tKubeflow",
  "apply_company": "syffer"
}