{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior FrontEnd Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience in crafting high-performance applications, primarily utilizing **JavaScript**, **HTML**, **CSS**, and UI/UX design principles for responsive and adaptive interfaces. Proficient in **C#** and **.NET**, with a solid understanding of cross-browser compatibility and Git version control to ensure seamless integration and deployment. \nSkilled in both frontend and backend development, leveraging frameworks such as **React**, **Vue**, and **Next.js**, and experienced in **Python** for backend support. \nDemonstrated capability in delivering innovative AI/ML-powered solutions that enhance user experience through predictive analytics and real-time processing. \nFamiliar with cloud deployment on **Azure** and adept at implementing CI/CD pipelines, ensuring efficient and reliable development workflows. Committed to maintaining compliance with industry standards and enhancing overall application performance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior FrontEnd Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained web applications utilizing **C#** and **.NET** frameworks to create dynamic, high-performance user interfaces, ensuring exceptional **UI/UX** design and responsive layouts.\nImplemented HTML, CSS, and JavaScript, achieving cross-browser compatibility for **10+** major browsers and versions, enhancing user experience and accessibility across diverse platforms.\nCollaborated with cross-functional teams leveraging **Azure DevOps** for version control and CI/CD pipeline automation, improving deployment speed by **30%**.\nUtilized Git for source code management, facilitating seamless collaboration among **15+** developers, and maintaining code integrity across multiple environments.\nEnhanced frontend performance through adaptive design techniques, achieving load times reduced by **40%** across critical applications.\nParticipated in extensive testing protocols using modern tools ensuring the delivery of bug-free applications, utilizing frameworks and libraries to conduct comprehensive unit and integration tests.\nCreated engaging web components and features that adhere to industry standards while ensuring optimal development practices.\nEmployed progressive enhancement and responsive design principles to provide a consistent user experience across devices, including mobile and web interfaces.\nConducted code reviews and offered mentorship to junior developers, fostering a culture of continuous improvement and excellence within the engineering team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented responsive design principles using **HTML**, **CSS**, and **JavaScript**, ensuring cross-browser compatibility and enhancing user experience for high-quality web applications.\nUtilized **C#** and **.NET** for backend development, ensuring seamless integration with front-end components and robust functionality across multiple platforms.\nCreated and maintained comprehensive version control systems using **Git**, improving collaboration and code management among team members.\nDesigned intuitive UI/UX layouts prioritizing user satisfaction in financial applications, leveraging modern frameworks and best practices to achieve an engaging interface.\nDeveloped and implemented front-end solutions with **React (18)**, **Vue 3**, and **Next.js**, creating dynamic web applications for financial tools and dashboards.\nEmployed **Azure DevOps** for continuous integration and delivery, streamlining development processes and enhancing project delivery timelines.\nParticipated in cross-functional teams to ensure adaptive design strategies are effectively applied, optimizing applications for various devices and screen sizes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed engaging user interfaces and optimized front-end performance using **C#**, **.NET**, **HTML5**, **CSS3**, and **JavaScript**, ensuring responsive design principles applied across all devices.\nEngineered cross-browser compatible solutions, enhancing overall user experience and accessibility in line with industry best practices.\nCollaborated closely with backend developers to integrate APIs and services seamlessly, utilizing **Git** for version control and project management.\nEmployed **Azure DevOps** for continuous integration and deployment (CI/CD) processes, reducing deployment times by **30%** and enhancing collaboration across teams.\nDesigned adaptive user interfaces focusing on UI/UX, meeting specifications for responsiveness across devices and achieving an improved user engagement rate of **25%**.\nLed efforts in maintaining coding standards while ensuring compliance with SEO best practices, contributing to a **15%** increase in organic traffic.\nImplemented accessibility guidelines (WCAG 2.1), achieving compliance and ensuring a wider reach for users with disabilities.\nParticipated in code reviews and implemented feedback, enhancing code quality and fostering a culture of continuous improvement among team members.\nPresented project updates and performance metrics to stakeholders monthly, showing a structured approach to project management and transparency."
    }
  ],
  "skills": "**Programming Languages**\n\tC#, Python, JavaScript\n\n**Backend Frameworks**\n\t.NET, FastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tHTML, CSS, React, Vue, Angular\n\n**API Technologies**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions**\n\tAWS: Lambda, Azure: App Services\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Azure DevOps\n\n**Cloud & Infrastructure**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other**\n\tUI/UX, responsive design, adaptive design, cross-browser compatibility, Nginx, Let’s Encrypt, Certbot, MLflow, Airflow, Kubeflow",
  "apply_company": "Greenberg Traurig, LLP"
}