{
  "name": "Mariusz Jan Skobel",
  "role_name": "Expert Full-stack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Expert Full-Stack Engineer with 10+ years of experience in delivering high-performance software solutions. Proficient in **TypeScript**, **Vue**, **React**, **Node.js**, and adept at NoSQL databases including **Firestore**, **MongoDB**, and **DynamoDB**. Well-versed in developing and deploying **Serverless Architecture** applications, enhancing user experiences through **IDE Plugins** and testing frameworks such as **Playwright**. Demonstrated leadership and effective communication in guiding teams towards project success while ensuring adherence to best practices in full-stack development. Experienced in modern technologies including **Python**, **Flutter**, and an extensive tech stack featuring **React**, **Next.js**, **FastAPI**, and **Django**. Expertise in building and deploying cloud-native applications on **Azure** and **AWS**, along with a solid foundation in microservices architecture, CI/CD automation, and compliance standards such as HIPAA. Passionate about crafting intelligent, maintainable systems that have a meaningful real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Expert Full-stack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDemonstrated expertise in **Full-stack Development** by designing and implementing scalable solutions utilizing **TypeScript**, **React** (17–18), **Node.js**, and **Vue 3** for high-demand applications in healthcare and finance.\n•\tLeveraged **NoSQL** databases like **MongoDB** to optimize data storage and querying for large-scale applications, ensuring efficient data handling and retrieval.\n•\tOrchestrated the transition of traditional applications into **Serverless Architecture** using **AWS Lambda** and **Azure Functions**, achieving a 99.9% uptime and enhancing system resilience.\n•\tIntegrated advanced capabilities in hybrid cloud environments by deploying models and services on **Firebase** and **DynamoDB**, streamlining cross-platform functionalities.\n•\tFostered collaboration and effective communication with cross-functional teams to lead projects, ensuring alignment with best practices and business objectives.\n•\tPioneered innovative solutions for hybrid cloud applications, employing modern frameworks and tools to boost development efficiency and performance.\n•\tImplemented comprehensive IDE Plugins and automated testing protocols with **Playwright** and **Jest** to ensure high code quality and minimize bugs in production.\n•\tDelivered robust mobile applications with a focus on user experience across platforms by integrating frameworks like **Flutter** and **React Native**.\n•\tApplied leadership skills to guide development teams in adopting **DevOps** methodologies, enhancing build and deployment cycles through tools like **GitHub Actions**.\n•\tConceived and executed initiatives for continuous integration and delivery to maintain high standards of operational efficiency and project delivery timelines, achieving a 30% reduction in deployment times."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Demonstrated leadership in **Full-stack Development** for financial platforms, driving modernization through a microservices architecture with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), resulting in a **30%** increase in scalability and maintainability for high-volume transactions.\nDeveloped responsive, user-centric front-end applications utilizing **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, implementing **Redux Toolkit** and **Tailwind CSS** to enhance user experience for financial dashboards and admin portals, significantly improving user satisfaction metrics by **25%**.\nCrafted real-time transaction monitoring dashboards employing **React**, **D3.js**, and **Power BI Embedded**, enabling operational teams to effectively track financial activities and detect anomalies, leading to a **40%** reduction in response times for alerts.\nIntegrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to design a robust, event-driven architecture, facilitating asynchronous communication and real-time event processing for transactions, alerts, and compliance workflows, enhancing system responsiveness by **50%**.\nDeveloped and orchestrated ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, facilitating both batch and real-time ingestion of financial data from internal and external sources, improving data processing efficiency by **60%**.\nImplemented AI/ML-powered fraud detection systems utilizing **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, analyzing transaction patterns and user behavior to proactively flag suspicious activities and decreasing fraud incidents by **35%**.\nCreated ML pipelines for credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, seamlessly integrating model inference into backend services to support real-time decision-making, contributing significantly to operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Demonstrated expertise in **Full-stack Development** by designing and optimizing backend services for a global e-commerce platform leveraging **Python** (**FastAPI, Django**) and **Node.js** (**NestJS, Express**), ensuring high availability, low latency, and scalability across 3 key modules: checkout, cart, and order fulfillment.\n• Engineered dynamic, real-time features utilizing **WebSockets** and event-driven architecture powered by **Kafka** and **RabbitMQ**, facilitating responsive order updates and enhancing customer support capabilities.\n• Developed high-performing frontend applications using **React** (**18**), **Vue 3**, and **Angular**, combined with **TypeScript**, **Redux Toolkit**, and **Tailwind CSS**, to deliver fast, responsive user experiences on both web and mobile platforms.\n• Leveraged diverse databases including **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for distributed data storage solutions, ensuring rapid and fault-tolerant data access for high-traffic e-commerce workflows, achieving an up to **40%** reduction in access times through effective caching strategies.\n• Integrated AI/ML-driven recommendation systems using **scikit-learn**, **LightGBM**, and **TensorFlow** to enhance user engagement by personalizing product listings and optimizing search relevance, boosting conversion rates by **15%** based on real-time behavioral data.\n• Implemented **Redis** caching strategies for product metadata, shopping cart sessions, and search queries, resulting in a **25%** improvement in application responsiveness and reduced database read pressure.\n• Managed feature flags and blue-green deployment strategies using **LaunchDarkly** and **Kubernetes** namespaces, allowing for controlled rollouts and A/B testing to minimize disruption during major platform updates.\n• Created SEO-friendly, mobile-optimized e-commerce user interfaces using **Next.js**, **Vue 3 + Nuxt**, and **HTML5/CSS3**, focusing on compliance with accessibility standards (WCAG **2.1**).\n• Developed secure payment processing workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, ensuring compliance with **PCI** standards through tokenized transactions.\n• Enforced role-based access control (RBAC) and implemented **OAuth 2.0** strategies for secure customer and admin interactions, ensuring adherence to **GDPR** guidelines for user data protection."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs, GraphQL\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions, Serverless Architecture\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Firestore, DynamoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Hybrid Cloud Applications\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD\nLeadership, Communication, IDE Plugins, Playwright"
}