{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior IT Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior IT Engineer with 8 years of experience, I excel in troubleshooting and problem-solving across diverse environments, utilizing a robust **tech stack** that includes **AWS**, **Proxmox**, **ESXI**, **Linux**, **BSD**, **Grafana**, **ElasticSearch**, **Splunk**, **OpenVPN**, **IPSec**, **WireGuard**, and **pfSense**. My strong foundation in ITIL enables me to implement best practices for IT service management and enhance team management capabilities.\nI have a proven track record in building high-performance solutions in complex sectors, leveraging modern **JavaScript**, **TypeScript**, and **Python** frameworks such as **React**, **Next.js**, **Node.js**, and **FastAPI**. My experience also spans cloud services including **Azure** and **AWS**, complemented by the development of secure, enterprise-grade applications that meet compliance standards like HIPAA and PCI DSS. Additionally, I bring hands-on expertise in deploying **MLOps** workflows and integrating machine learning capabilities using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior IT Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS** for deploying and managing applications, ensuring high availability and fault tolerance in cloud environments.\nImplemented advanced troubleshooting and problem-solving techniques to address complex issues across systems, significantly reducing downtime by **30%**.\nManaged team dynamics and project workflows effectively, overseeing a cross-functional team of **5** engineers to deliver IT solutions aligned with business objectives.\nConfigured and monitored network configurations using **OpenVPN**, **IPSec**, and **WireGuard**, leading to enhanced security of data transfers and remote access.\nDeveloped monitoring dashboards using **Grafana** to visualize system performance metrics in real-time, increasing operational insights for system reliability by **25%**.\nExecuted server virtualization optimally using **Proxmox** and **ESXI**, improving resource allocation efficiency by **20%** across all server instances.\nEnsured system integrity and performance by implementing **ITIL** best practices, optimizing incident management processes, and elevating service delivery quality.\nResearched and deployed **ElasticSearch** to facilitate advanced search capabilities, effectively handling millions of records which expedited data retrieval times by **40%**.\nConducted security audits and assessments utilizing **Splunk**, identifying vulnerabilities and implementing necessary patches, thereby improving system security posture.\nInstalled and maintained Linux and BSD environments, applying best practices for system security and hardening, contributing to a **15%** reduction in system vulnerabilities.\nStreamlined operational procedures and enhanced troubleshooting protocols to improve overall IT service management efficiency across organizational units."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented and managed scalable cloud infrastructure solutions on **AWS**, ensuring optimal performance and reliability while adhering to **ITIL** best practices.\nPerformed extensive **troubleshooting** and **problem-solving** for complex systems, maintaining high availability across **Linux** and **BSD** environments, leading to a **99.9%** uptime for critical applications.\nDesigned and deployed virtualized solutions using **Proxmox** and **ESXI**, optimizing resource utilization for multiple server instances, enabling rapid provisioning and deployment of services.\nMonitored system performance and security using tools like **Grafana**, **ElasticSearch**, and **Splunk**, generating actionable insights to enhance system stability by **30%**.\nConfigured and secured remote access solutions with **OpenVPN**, **IPSec**, and **WireGuard**, ensuring encrypted communications and compliance with security policies.\nLed a cross-functional team of 5 IT professionals, fostering collaboration and mentorship, which improved team productivity by **25%**.\nDeveloped and implemented backup and disaster recovery solutions for critical systems, reducing recovery time objectives (RTO) to **1 hour** while ensuring comprehensive data protection.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Managed and optimized IT infrastructure utilizing **AWS** services, ensuring high availability and scalability for internal systems.\nImplemented virtualization solutions using **Proxmox** and **ESXI**, leading to a 30% increase in server efficiency and reduced operational costs.\nConfigured and maintained Linux and BSD servers, ensuring robust performance monitoring and system reliability.\nUtilized **Grafana** for real-time monitoring and visual analytics of system performance, enhancing troubleshooting capabilities and reducing downtime by 25%.\nDeployed enterprise logging solutions using **ElasticSearch** and **Splunk** to streamline log management and enhance problem-solving processes by providing actionable insights within minutes.\nImplemented secure remote access solutions using **OpenVPN**, **IPSec**, and **WireGuard**, ensuring data protection and compliance across all remote connections.\nMaintained firewall and network security configurations via **pfSense**, reducing potential security threats by 40% through proactive monitoring and management.\nLed a team of IT professionals in an Agile environment, fostering collaboration and ensuring project milestones were met on time.\nDeveloped ITIL-based workflows that improved service delivery efficiency and user satisfaction ratings by more than 15%.\nSuccessfully troubleshot complex IT issues using systematic approaches, enhancing overall service performance and user experience."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure (App Services, Blob, SQL), Proxmox, ESXI, Linux, BSD\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Grafana, ElasticSearch, Splunk, OpenVPN, IPSec, WireGuard, pfSense, ITIL, troubleshooting, problem-solving, team management",
  "apply_company": "Social Discovery Group"
}