{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Golang Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Golang Engineer with 10+ years of experience in delivering high-performance software solutions, focusing on robust cloud-native applications. Proficient in **Golang** and skilled in cloud services such as **Azure** and **AWS**. Expertise in AI and observability, with a strong emphasis on building secure, maintainable applications that comply with industry standards. Experienced in modern technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**, and hands-on knowledge of full stack development with frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven track record in utilizing microservices architecture, event-driven systems, and CI/CD automation, ensuring data security and integrity. Adept at MLOps, developing ML pipelines, managing production workflows, and integrating advanced analytics into enterprise platforms. Passionate about leveraging technology to drive real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Golang Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped **cloud**-native applications utilizing **Golang** to ensure secure, scalable, and efficient performance in healthcare and fintech environments.\n•\tImplemented advanced **search** capabilities by integrating ElasticSearch and Azure Cognitive Search, optimizing for complex queries across extensive datasets, enhancing retrieval efficiency for millions of records.\n•\tLeveraged **AI** technologies to create intelligent features such as predictive alerts and personalized recommendations, employing machine learning models from **Python** frameworks like TensorFlow and scikit-learn.\n•\tEnsured observability and security of applications by implementing comprehensive logging, monitoring, and security practices, maintaining compliance with regulatory standards like HIPAA and GDPR.\n•\tEngineered observability frameworks to monitor application performance and user engagement, using analytics and logging tools, facilitating continuous improvement in deployment cycles.\n•\tArchitected and maintained data ingestion pipelines with **PostgreSQL** and **MongoDB**, managing large-scale data volume, ensuring data integrity at an average throughput of **5000 records/s**.\n•\tCollaborated with multi-disciplinary teams to introduce AI-based features, improving user interaction and engagement metrics by **30%** through enhanced user interfaces and data processing techniques.\n•\tContributed to DevOps initiatives by employing CI/CD practices using **GitHub Actions** and **Azure DevOps**, automating deployment processes across **5** staging environments, improving deployment times by **50%**.\n•\tParticipated in code reviews and knowledge-sharing sessions, boosting the team's productivity and adherence to best practices within **Golang** and associated tech stacks.\n•\tCreated detailed documents and training materials to support team onboarding on core services and deployment strategies, resulting in a **40%** decrease in onboarding time for new engineers.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Golang** to enhance backend services, ensuring efficient processing and robustness for high-volume systems in financial platforms.\nDeveloped cloud-based solutions on **Azure** to improve deployment and scalability for applications, leveraging **observability** tools to monitor performance and optimize resource utilization.\nImplemented AI frameworks to build intelligent systems enabling fraud detection and predictive analytics, ensuring enhanced **security** and compliance in financial operations.\nConducted data analysis and built optimized search functionality, allowing users to quickly retrieve relevant financial insights and trends from large datasets.\nDesigned and maintained secure APIs enabling integration with external services, using best practices to safeguard sensitive financial data and maintain **security** standards.\nLed technical architecture discussions, focusing on modular and extensible designs using **cloud** infrastructure, facilitating future scalability and adaptation to business needs.\nCreated documentation and conducted training sessions to promote best practices in coding, enhancing team agility and onboarding for new team members."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Golang** for developing robust backend services, ensuring high performance and scalability in delivering low-latency responses for key workflows across the platform.\nEngineered AI-driven features leveraging machine learning techniques to enhance search functionalities, optimize data retrieval, and deliver personalized user experiences using technologies such as **TensorFlow** and scikit-learn.\nImplemented observability practices with tools like **Prometheus** and **Grafana** to monitor system performance, ensuring visibility into service health and quick diagnostics across the infrastructure.\nDesigned secure architectures incorporating **OAuth 2.0** and RBAC to safeguard sensitive data and maintain compliance with security standards, enhancing user trust and data protection.\nIntegrated cloud services (e.g., **AWS** and **Google Cloud**) for scalable data storage solutions, effectively managing load across **PostgreSQL**, **Redis**, and **Cassandra**.\nDeveloped and optimized searching capabilities within the application using advanced indexing techniques, boosting search performance by **60%** for high-traffic segments.\nCreated and managed CI/CD pipelines with **Jenkins** and **Docker**, reducing deployment time and improving release quality through automated testing and staging workflows, achieving a deployment frequency of **10 times/week**.\nCollaborated across teams to refine system architecture, successfully reducing application downtime by **30%** through proactive monitoring and incident response strategies."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript/TypeScript, Golang\n\n **Artificial Intelligence & Machine Learning:** \n\tMLflow, Airflow, Kubeflow, AI\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tJWT, OAuth2, Keycloak, OIDC, RBAC\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tcloud, observability\n\n **Other:** \n\tsecurity, search, data",
  "apply_company": "Elastic"
}