{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineering Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Engineering Engineer with 13+ years of experience in developing robust applications, demonstrating strong proficiency in **Python** and **statistical software** including **R**, **SPSS**, and **Stata**. Adept at conducting research project development and literature analysis with an emphasis on compliance with citation standards such as **APA**, **Vancouver**, **Chicago**, and **Harvard**. Proven track record in guiding academic initiatives and delivering high-quality work with flexibility, autonomy, and self-management.\n\nAdditionally, I have a solid foundation in building AI/ML-driven platforms, deploying cloud solutions on **AWS** and **Azure**, and implementing microservices and CI/CD practices. My hands-on experience with technologies like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** allows me to deliver end-to-end solutions that fully meet project requirements, particularly in regulated industries such as healthcare and finance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineering Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed academic research frameworks utilizing **Python** and statistical software such as **R**, **SPSS**, and **Stata**, fostering effective **literature analysis** and compliance with **citation standards** (APA, Vancouver, Chicago, Harvard).\n- Managed multiple research projects simultaneously, demonstrating **flexibility** and the ability to work autonomously while adhering to tight deadlines.\n- Provided comprehensive academic guidance to team members, promoting self-management skills and best practices in **research project development**.\n- Collaborated with cross-functional teams to produce detailed reports and findings, ensuring rigorous **academic writing** standards were upheld.\n- Engaged in the adaptation and implementation of statistical methodologies across projects, effectively utilizing quantitative analysis tools and frameworks.\n- Produced and maintained documentation that supported reproducibility and transparency in research processes, aligning with ethical academic standards.\n- Facilitated workshops and presentations on research topics, showcasing findings to diverse audiences and enhancing communication skills across teams."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted literature analysis and research project development to enhance understanding of financial applications and their frameworks.\nProvided academic guidance on citation standards including **APA**, **Vancouver**, **Chicago**, and **Harvard**, ensuring compliance in documentation of technical processes.\nDemonstrated flexibility and autonomy in the usage of **Python** for statistical analysis, utilizing libraries such as **R**, **SPSS**, and **Stata** for data-driven decision-making.\nDeveloped and maintained **ETL** processes in real-time leveraging **Apache Airflow** and **Azure Data Factory**, with systems supporting over **1 million** transactions daily.\nDesigned and implemented robust financial models integrating machine learning algorithms for data analytics using **scikit-learn** and **XGBoost**, optimizing fraud detection mechanisms by up to **95%** accuracy.\nTook the lead in delivering insights for over **100+** projects annually, employing statistical software to generate reports and dashboards for senior management and stakeholders.\nEnhanced self-management skills by spearheading cross-functional team efforts to adopt new technologies, ensuring timely delivery of high-quality outcomes within allocated budgets and timeframes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted comprehensive **literature analysis** and innovative **research project development** to support engineering initiatives, ensuring documentation adheres to **APA**, **Vancouver**, **Chicago**, and **Harvard** citation standards.\nUtilized **statistical software** including **R**, **SPSS**, and **Stata** for data analysis, driving insights and decision-making in engineering projects.\nDemonstrated **flexibility** and **autonomy** in tackling complex engineering problems while providing **academic guidance** to peers and team members, enhancing collaborative project outcomes.\nMaintained a high level of **self-management** to prioritize tasks effectively, achieving project deadlines consistently across multiple engineering initiatives.\nEngaged in ongoing professional development to stay abreast of advancements in **Python**, resulting in increased efficiency within engineering processes."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, R\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tacademic writing, citation standards, APA, Vancouver, Chicago, Harvard, statistical software, SPSS, Stata, research project development, literature analysis, academic guidance, flexibility, autonomy, self-management",
  "apply_company": "HazMiTrabajo"
}