{
  "name": "Tomasz Lee",
  "role_name": "Full-Stack Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Full-Stack Developer with over 9 years of experience in designing, developing, and implementing complex applications. Highly proficient in building **RESTful APIs** and leveraging **gRPC** for microservices communication. Demonstrated expertise in database management with **PostgreSQL**, **MySQL**, and **Neo4j**. Adept at deploying applications using **Kubernetes** and implementing **CI/CD** pipelines to streamline development processes. Strong advocate for clean coding practices and automation, complemented by a solid understanding of **data structures** and **algorithms**. Skilled in both frontend and backend technologies, including **ReactJS**, **NextJS**, **.NET**, and **C#**. Proven track record of delivering robust solutions, optimizing performance, and collaborating effectively across teams to lead development projects to successful completion.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Full-Stack Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and developed RESTful APIs to ensure seamless communication between front-end and back-end components, enhancing modularity and system integration.\nImplemented CI/CD pipelines that streamlined the deployment process, optimizing resource utilization and reducing deployment time by **40%**.\nUtilized **Kubernetes** for container orchestration, enabling efficient scaling and management of applications across clusters.\nEmployed **PostgreSQL** and **MySQL** for data storage solutions, ensuring robust data integrity and availability.\nDeveloped clean, maintainable code by adhering to automation practices and applying data structures and algorithms effectively, resulting in enhanced system performance.\nImproved application performance and response times by optimizing database queries and indexing, achieving a **20%** reduction in average query execution time.\nCollaborated closely with UX/UI designers to refine user interfaces, leading to increased user satisfaction and engagement.\nCreated a reporting engine using advanced libraries for interactive data visualizations, facilitating data-driven decision-making.\nImplemented best practices for security through **JWT** authentication methods, safeguarding user information effectively."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and integrated **RESTful APIs** using **.NET Core** with **PostgreSQL** and **MySQL**, facilitating real-time data access and ensuring system robustness.\nUtilized **Kubernetes** for container orchestration, enhancing deployment scalability by **40%**.\nImplemented **CI/CD** pipelines via **GitHub Actions**, leading to a **30% reduction** in production deployment errors and improving delivery timelines.\nDesigned microservices architecture incorporating **gRPC** for efficient communication between services, increasing system performance and scalability.\nApplied clean coding practices and data structures in software solutions, resulting in a **20% improvement** in code maintainability.\nCreated and maintained UI components using **ReactJS** and **Tailwind CSS**, contributing to a **25% increase** in user engagement.\nOptimized complex queries in **Neo4j** and other databases, enhancing retrieval speeds for applications.\nConducted code reviews and implemented automation practices, boosting team productivity and collaboration efficiency by **15%**.\nCollaborated with stakeholders to gather system requirements, leading to the successful delivery of **3 major projects** on schedule.\nDeveloped custom charts and graphs with **D3.js** for visualizing project statuses, aiding in effective reporting."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented **gRPC** and **RESTful APIs** to enhance communication between frontend and backend services, ensuring a robust and scalable architecture.\nApplied **PostgreSQL** and **MySQL** for optimized data storage and retrieval, improving query efficiency by **30%**.\nDeveloped efficient algorithms and data structures to improve overall application performance and responsiveness.\nParticipated in a **Kubernetes** driven CI/CD pipeline to streamline deployment processes, achieving deployment times reduced by **50%**.\nCollaborated with the team in applying clean coding practices, ensuring maintainable and high-quality code across projects.\nContributed to the development of an internal CRM system using **.NET Framework** and **Angular**, leading to a **20%** boost in sales team productivity.\nImplemented **RabbitMQ** for managing message queues, effectively processing customer notifications asynchronously and reducing system load during peak usage.\nCreated reusable components in **Angular** and **C#**, accelerating development timelines for future projects.\nAssisted in migrating legacy code from **ASP.NET WebForms** to **.NET Core**, enhancing system performance and maintainability.\nWorked with **SQL Server** to manage customer data, ensuring efficient and quick retrieval of information.\nCollaborated with the DevOps team to establish automated builds and releases in **Azure**, expediting deployment processes.\nProvided technical documentation and user guides, improving knowledge transfer and onboarding for internal systems.\nEngaged actively in daily standups and code reviews, aligning work with project goals and upholding coding standards."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful APIs, GraphQL, gRPC\n\n**Serverless and Cloud Functions:**\n\t\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, DynamoDB, CosmosDB, Neo4j\n\n**DevOps:**\n\tAWS, Azure, CI/CD pipelines, Kubernetes, Automation practices\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tGit, GitHub, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Clean coding, Data structures, Algorithms"
}