{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior iOS Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior iOS Developer with over 10 years of experience specializing in **Swift**, **UIKit**, and **SwiftUI** for building high-performance mobile applications. Expert in developing **RESTful APIs** and handling data with **Core Data** and **JSON**. Proficient in implementing **MVVM** design patterns and best practices including **SOLID principles** and **GCD** for effective concurrency management. Experienced in securing applications with **OAuth 2**, **PKCE**, and **SSO**, ensuring adherence to security best practices. Strong understanding of mobile UI/UX principles and agile methodologies, along with a proven track record in **CI/CD** practices. Passionate about contributing to the **FinTech** sector and leveraging technology for impactful software solutions.\n\nAdditionally skilled in utilizing **Git** for version control, **Xcode** for development, and using **Instruments** for performance tuning. Committed to maintaining a high standard of code quality through **Unit Testing** and **UI Testing**, while also recognizing the importance of open-source contributions in driving innovation and collaboration.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior iOS Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and developed iOS applications using **Swift**, **UIKit**, and **SwiftUI**, ensuring compliance with **mobile UI/UX principles** and delivering high-quality user experiences through adherence to **SOLID principles**.\n• Implemented **RESTful APIs** for seamless integration with backend services, utilizing **JSON** for data exchange and ensuring efficient application performance.\n• Coordinated with cross-functional teams in an **Agile methodology** environment to rapidly design, prototype, and iterate on features, enhancing user engagement in the **FinTech** sector.\n• Employed concurrency techniques such as **GCD** and **Async Await** to optimize app responsiveness and improve smoothness in user interactions within complex financial applications.\n• Familiar with advanced authentication and security practices including **OAuth 2**, **PKCE**, and **SSO** to safeguard sensitive user data, complying with industry-standard security **best practices**.\n• Developed and executed unit and UI testing strategies using **Xcode** integrated tools, ensuring reliability and maintainability of applications across **iOS versions** 13 to 16.\n• Collaborated with design and product teams to incorporate user feedback into rapid iterations of app features, leveraging knowledge of the **FinTech sector** to address user needs effectively.\n• Managed version control and continuous integration through **Git** and **CI/CD** practices, facilitating smooth deployments and open-source contributions to enhance community engagement.\n• Optimized application performance using **Instruments** to monitor and address memory usage, ensuring optimal responsiveness and reliability in high-traffic situations.\n• Contributed to discussions on mobile application architecture and design patterns, applying insights from various technical conferences to foster improvements within the development team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Focused on building robust **Swift** applications by implementing **UIKit**, **Core Data**, and adhering to **MVVM** architecture, ensuring high performance and maintainability of mobile solutions.\nDeveloped and maintained **RESTful APIs** to facilitate communication between mobile applications and backend services, incorporating **OAuth 2** and **PKCE** for secure user authentication and authorization.\nImplemented **Concurrency** features using **GCD** and **Async Await** to enhance the responsiveness of mobile applications, leading to a 50% reduction in loading time during peak operations.\nConducted **Unit Testing** and **UI Testing** utilizing **Xcode** and **Instruments** to ensure code quality and performance, achieving a 95% test coverage on critical modules.\nLeveraged **Agile methodologies** to collaborate effectively with cross-functional teams, delivering features and enhancements with a **CI/CD** pipeline that facilitates seamless integration and deployment.\nFocused on mobile UI/UX principles to design intuitive interfaces, contributing to a 30% increase in user engagement and satisfaction for financial applications.\nParticipated in open-source contributions, enhancing and sharing frameworks and libraries relevant to the **FinTech** sector, while advocating for **security best practices** in mobile development.\nDemonstrated a strong interest in finance, applying industry knowledge to develop features that meet user needs in the rapidly evolving financial landscape."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Designed and optimized mobile applications for iOS platforms using **Swift** and **SwiftUI**, ensuring seamless performance and user experience across various features while adhering to mobile UI/UX principles.\nDeveloped robust RESTful APIs for data interaction using **JSON**, implementing **OAuth 2.0** for secure user authentication and authorization, ensuring compliance with security best practices throughout the application.\nUtilized **Core Data** for efficient local data storage, enabling quick access to records while implementing **Concurrency** and **GCD** methods for optimizing performance in multi-threading scenarios.\nEmployed **MVVM** architecture to enhance code readability and maintainability, ensuring adherence to **SOLID principles** for scalable and manageable code.\nLeveraged **Xcode** for development and debugging, utilizing **Instruments** for performance profiling and optimization, ensuring application efficiency and responsiveness.\nExecuted unit testing and UI testing practices to guarantee code reliability and quality assurance, achieving a 95% test coverage goal for critical application components.\nIntegrated **CI/CD** pipelines to streamline deployment processes, facilitating rapid iteration and delivery of features in an Agile methodology environment with weekly sprints.\nContributed to open-source projects, showcasing commitment to community involvement and continuous learning within the **FinTech sector**.\nActively participated in code reviews, fostering collaborative team environments and driving improvements in code quality across development workflows.\nMaintained compliance with security best practices, ensuring that user data is protected and financial transactions adhere to industry standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Swift\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, UIKit, SwiftUI\n\n **API Technologies:**\n\tRESTful APIs, JSON, OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Core Data\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, GCD, Concurrency, MVVM, PKCE, SSO, SOLID principles, Async Await, Git, Xcode, Instruments, Unit Testing, UI Testing, Agile methodologies, mobile UI/UX principles, open-source contributions, FinTech sector knowledge, security best practices, interest in finance"
}