{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience specializing in **React**, **TypeScript**, and **UI/UX** design to deliver high-performance applications across diverse industries. Demonstrated expertise in **Agile** methodologies and developing seamless user interfaces, ensuring optimal user experiences. \nPassionate about crafting responsive web applications that leverage **Asynchronous Communication** principles for improved performance and interactivity. Furthermore, experienced in backend collaboration using **Scala** and cloud environments like **GCP**. \nProficient in deploying innovative solutions with a strong foundation in compliance-driven development, aligning with industry standards. Proven track record in integrating AI/ML capabilities and optimizing application performance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained scalable frontend applications using **React** (17–18) and **TypeScript**, ensuring high performance and responsiveness across all platforms.\n- Implemented best practices in **UI/UX** design to enhance user satisfaction and engagement within the complex healthcare and fintech domains.\n- Actively participated in an **Agile** development environment, collaborating with cross-functional teams to deliver features on time and within budget.\n- Utilized asynchronous communication techniques to ensure continuous integration and seamless collaboration among team members.\n- Designed and modified components to meet evolving user needs, focusing on modularity and reusability within the **React** ecosystem.\n- Ensured best practices in code quality through the implementation of centralized testing strategies using tools like Jest and Cypress.\n- Participated in the architectural design discussions, contributing to technology choices around **React** and **TypeScript** in alignment with modern design patterns.\n- Contributed to performance optimization efforts, resulting in up to **30%** reduction in load times for key features.\n- Conducted code reviews and mentor junior developers, facilitating knowledge sharing around **React**, **TypeScript**, and best coding practices.\n- Engaged in user testing and feedback sessions, successfully implementing user-driven enhancements that improved overall usability ratings by over **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed visually appealing and user-friendly front-end applications using React (18), TypeScript, and **Next.js**, ensuring optimal UI/UX design to enhance user engagement and accessibility.\nCollaborated in an Agile environment to iterate quickly on product features and enhancements, effectively communicating with cross-functional teams to deliver high-quality software solutions.\nUtilized **Redux Toolkit** and **Tailwind CSS** to implement responsive designs and state management, achieving a **25%** increase in application performance and user satisfaction metrics.\nIntegrated asynchronous communication strategies using **Kafka** and **RabbitMQ**, improving data handling efficiency and enabling real-time updates across applications by **30%**.\nCreated and maintained documentation for the front-end architecture and development processes, reducing onboarding time for new developers by **40%**.\nLeveraged cloud services such as **GCP** for deployment, ensuring scalable and reliable access to applications across multiple environments.\nAnalyzed user behavior and feedback to continuously improve design and functionality, resulting in a **15%** decrease in user churn over a **6-month** period.\nParticipated in code reviews and maintained coding standards to promote best practices and enhance the overall quality of the software delivery process."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed dynamic and interactive user interfaces using **React (18)** and **TypeScript**, ensuring high performance and responsiveness in a complex e-commerce environment.\nCollaborated within an **Agile** framework, participating in sprint planning, retrospectives, and daily stand-ups to enhance team productivity and project outcomes.\nEngineered applications with a focus on **UI/UX** design principles, optimizing user journey and engagement on both web and mobile platforms.\nEmployed asynchronous communication patterns to enhance application performance, facilitating smoother data transitions and user interactions.\nImplemented responsive design techniques utilizing **HTML5/CSS3** to create visually appealing and accessible interfaces compliant with **WCAG 2.1**.\nUtilized cloud services provided by **GCP** for backend integration, ensuring scalability and reliability of frontend applications in high traffic scenarios.\nMentored junior developers on best practices in **React** and **TypeScript**, fostering a culture of continuous learning and improvement across the team.\nEnhanced application interoperability by integrating third-party APIs and services, ensuring seamless user experiences and functionality.\nOptimized frontend performance metrics, achieving load times under **3 seconds** and ensuring a smooth navigation experience for over **500,000** monthly users.\nCreated modular components within the application to adhere to **SCSS** styling conventions, promoting reusability and maintainability across the codebase."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, TypeScript, Scala\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **API Technologies:**\n\t\n\n  **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n  **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n  **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, GCP\n\n  **Other:**\n\tMLflow, Airflow, Kubeflow, UI/UX, Agile, Asynchronous Communication, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, CI/CD (Docker Compose)",
  "apply_company": "Hopper"
}