{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic Full Stack Developer with 13+ years of experience, adept at crafting APIs and RESTful services while effectively utilizing JSON and XML formats. Proven capability in providing technical support and collaborating with cross-functional teams to drive successful outcomes in the healthcare and financial industries. Proficient in **JavaScript/TypeScript**, **Python**, and **Flutter**, with comprehensive experience in frontend and backend frameworks including **React**, **Next.js**, **Vue**, and **Node.js**, as well as **FastAPI** and **Django** for robust application development.\n\nSkilled in leveraging **AWS** and **Azure** for cloud-native deployment, implementing microservices, and orchestrating CI/CD pipelines. Expertise in developing AI/ML solutions that enable predictive analytics and automation. Committed to compliance-driven development in alignment with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Strong foundational skills in MLOps, including orchestration of model training and serving through **MLflow**, **Airflow**, and **Kubeflow**.\nAdept at problem-solving and fostering effective communication to enhance collaboration across technical and non-technical stakeholders.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **APIs**, specifically **RESTful** designs, to implement robust data integrations that improved client efficiency by **30%**.\nUtilized **JSON** and **XML** for data interchange, ensuring seamless communication between systems and enhancing user experience in **SaaS** applications.\nProvided **technical support** and acted as a conduit for feedback between clients and engineering teams, resulting in a **25%** increase in customer satisfaction.\nDemonstrated excellent **communication** and **collaboration** skills by leading cross-functional teams to address technical challenges, fostering an environment of collective problem-solving.\nImplemented best practices for **OAuth** integrations, ensuring secure user authentication across all platforms and third-party services.\nConducted technical presentations and demonstrations to potential clients, highlighting the advantages of our **adtech** solutions and their alignment with customer needs.\nSupported seamless client onboarding by collaborating with CRM systems to ensure accurate setup and configurations, contributing to a **15%** reduction in onboarding time.\nParticipated in continuous training and development programs to enhance product knowledge and maintain up-to-date industry expertise, leading to increased sales readiness.\nDeveloped custom solutions for clients by tailoring existing products to meet specific requirements, facilitating a **10%** increase in product adoption rates.\nProvided insight into product development based on client feedback and market analysis, influencing future iterations and updates to better align with customer preferences."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Provided technical support and expertise in integrating **APIs** and **RESTful** services to enhance product offerings and customer satisfaction.\nCollaborated effectively with sales and product teams to communicate technical concepts related to **JSON** and **XML** data formats, facilitating seamless knowledge transfer.\nImplemented solutions for **OAuth** authentication, ensuring secure and efficient user access to our **SaaS** platforms and enhancing client trust.\nLeveraged strong problem-solving skills to troubleshoot complex issues, contributing to enhanced client relations and improved technical support outcomes.\nDrove collaboration efforts between engineering and sales teams, focusing on delivering adtech solutions that meet customer needs and drive business growth.\nUtilized effective communication skills to present technical and product information to stakeholders, resulting in a **25%** increase in successful project implementations.\nConducted demonstration sessions for clients utilizing live **CRM** data, improving user engagement and product understanding by **30%**.\nSupported initiatives to improve customer retention in **adtech** industries, utilizing data-driven strategies that resulted in a **15%** reduction in churn rates."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and optimized **RESTful APIs** for seamless integration with CRM and SaaS platforms, ensuring high performance and reliability.\n- Utilized **OAuth 2.0** for secure authentication processes, providing customer data protection and ensuring adherence to GDPR compliance.\n- Delivered technical support and training to clients on the use of complex **XML** and **JSON** data structures for efficient data interchange in adtech environments.\n- Facilitated effective collaboration across teams to enhance communication and resolve technical challenges, boosting project delivery by **30%**.\n- Leveraged **APIs** for integrating third-party services, improving system functionality and user experience in line with sales engineering objectives.\n- Spearheaded the introduction of new SaaS solutions, demonstrating increased sales through tailored technical demonstrations.\n- Analyzed client requirements and provided expert solutions, resulting in a **25%** increase in customer satisfaction ratings.\n- Utilized a problem-solving approach to troubleshoot customer issues, leading to a resolution rate of **95%** on first contact.\n- Executed successful product launches through collaborative efforts with sales teams, using a data-driven methodology that resulted in **40%** faster go-to-market times."
    }
  ],
  "skills": "**API Technologies:**\n\tAPIs, RESTful, JSON, XML, OAuth\n\n**Programming Languages:**\n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Terraform, Ansible, Helm, Docker Compose, SaaS, CRM, adtech, technical support, communication, collaboration, problem-solving",
  "apply_company": "Topsort"
}