{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Back End Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven Back End Engineer with 13+ years of experience in creating scalable applications within the healthcare and financial sectors. Proficient in **Java**, **Spring Boot**, and **Micronaut**, with extensive knowledge of deploying and managing applications using **Kubernetes** and **Docker**. Experienced in designing and implementing secure applications and robust database architectures, ensuring compliance with industry standards. Demonstrated expertise in **AWS** services and **Kafka** for building event-driven systems and leveraging event sourcing. Adept at **stakeholder collaboration** and resolving technical issues, with a strong commitment to mentoring team members and fostering skill development. Proven ability in aligning software design with organizational goals, underpinned by solid experience in implementing microservices and CI/CD practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Back End Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust applications and services using **Java**, **Spring Boot**, and **Micronaut**, ensuring secure application development practices and adherence to high software design standards.\n- Leveraged **Kubernetes** and **Docker** for efficient deployment and management of microservices, enhancing scalability and reliability of back-end systems.\n- Implemented event sourcing patterns with **Kafka** to streamline data handling and processing across multiple services, improving data consistency and responsiveness.\n- Collaborated with stakeholders to define system requirements, ensuring alignment between technical solutions and business objectives.\n- Managed technical issue resolution, minimizing downtime and improving system availability by over **30%**.\n- Designed and optimized database architectures with emphasis on effective database design and performance tuning.\n- Mentored junior engineers in secure coding practices and best software development methodologies, fostering a culture of knowledge sharing.\n- Participated in code reviews and contributed to team-wide implementations of testing strategies using tools like Jest and Postman, improving code quality and coverage.\n- Transformed legacy codebases to modern microservices, significantly reducing system dependencies and improving maintainability by **40%**.\n- Engaged in stakeholder collaboration to ensure timely delivery of features and functionalities that meet evolving business needs."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Java** and **Spring Boot** to develop scalable back-end services, implementing microservices architecture for improved performance and maintainability across high-traffic applications.\nDesigned and managed containerized applications using **Docker** and orchestrated them with **Kubernetes**, achieving a deployment efficiency increase by **40%**.\nImplemented **Kafka** for real-time data event streaming, enhancing system reliability and data processing speed by **25%**.\nConducted secure application development practices to protect sensitive data, successfully passing external audits with a **100% compliance rate**.\nCollaborated with stakeholders to gather requirements, ensuring alignment with business goals and technical feasibility, resulting in a **30%** reduction in project delivery time.\nExecuted comprehensive database design strategies for optimal schema structure, facilitating faster query responses and reduced load times by **15%**.\nMentored junior developers in best practices for software design and technical issue resolution, fostering a collaborative environment that boosted team productivity by **20%**.\nPromoted event sourcing methodologies to enhance data consistency and traceability within applications, aligning with industry standards for architectural integrity."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized backend services using **Java**, **Spring Boot**, and **Micronaut** to ensure high availability and scalability across key e-commerce modules, achieving a **99.9%** uptime.\nCollaborated effectively with stakeholders to gather requirements and enhance software design, contributing to the successful launch of **5** major backend features annually.\nImplemented secure application development practices by integrating tools and frameworks such as **Kubernetes**, **Docker**, and AWS components, significantly reducing security vulnerabilities by **30%**.\nEngineered event sourcing and messaging systems using **Kafka**, enhancing data flow and reliability across the platform, leading to a **25%** improvement in response times.\nDeveloped and executed database design strategies leveraging **AWS RDS** and other database solutions, supporting applications handling over **1 million** daily transactions.\nLed mentoring sessions and guided junior developers on best practices in software architecture and database interactions, resulting in a more knowledgeable team and improved project delivery times by **20%**.\nResearched and resolved technical issues within the backend architecture efficiently, maintaining a high standard of code quality and application performance.\nFacilitated technical discussions and collaborative sessions to ensure alignment between development teams and business objectives, fostering a productive work environment."
    }
  ],
  "skills": " **Programming Languages:** \n\tJava, Python, JavaScript/TypeScript\n\n **Backend Frameworks:** \n\tSpring Boot, Micronaut, FastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tKafka, OAuth2, JWT\n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, ECS, RDS, S3\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS, Azure: App Services, Blob Storage, SQL Database\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, secure application development, software design, database design, stakeholder collaboration, technical issue resolution, mentoring, event sourcing"
}