{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior Backend Engineer with 8 years of experience, I excel in designing and implementing robust backend solutions using **AWS**, **Kubernetes**, **TypeScript**, **Node.js**, **Python**, **Golang**, and **MySQL**. My technical acumen encompasses CI/CD practices, observability, performance tuning, and security, ensuring the development of scalable and secure applications. \nI have led multiple projects focused on system design, where I successfully integrated third-party services, including **FusionAuth**, **Retool**, **Twilio**, and **SendGrid**, to enhance system capabilities. I leverage modern development methodologies and tools, encouraging efficient collaboration via **GitHub**. With a strong background in microservices and event-driven architectures, I consistently deliver high-performance solutions while maintaining seamless communication with cross-functional teams.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable back-end services using **TypeScript** and **Node.js**, optimizing performance and security for high-traffic environments, achieving a **30% increase** in response times.\n• Implemented **CI/CD** pipelines utilizing **GitHub Actions** for automated testing and deployment, reducing deployment times by **40%** and enhancing system observability.\n• Designed and deployed microservices-based architectures using **Kubernetes**, enabling seamless scalability and resilience, with a focus on system design principles to enhance modularity.\n• Collaborated with cross-functional teams to ensure the integration of **AWS** cloud services for hosting and infrastructure management, achieving a **99.9% uptime** record through effective monitoring and performance tuning.\n• Conducted performance tuning and security audits on back-end services, focusing on **Python** and **Golang**, elevating the overall security posture while maintaining compliance with industry standards.\n• Developed comprehensive documentation for implemented systems and components to facilitate communication across teams and ensure knowledge sharing.\n• Integrated third-party services like **Twilio** and **SendGrid** to enhance communication channels, achieving a **25%** increase in user engagement through timely notifications.\n• Actively maintained databases such as **MySQL** to ensure data integrity and performance, handling large datasets efficiently with queries optimizing response times by **20%**.\n• Engaged in regular code reviews and provided mentorship to junior developers, fostering a culture of continuous improvement and effective communication within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented scalable, high-performance backend systems using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing system design and performance tuning for financial platforms.\nUtilized **AWS** and **Kubernetes** for deploying microservices architectures, improving the scalability and maintainability of platforms handling over **1 million** transactions daily.\nManaged version control and collaboration using **GitHub**, streamlining CI/CD processes for rapid deployment cycles, achieving a deployment increase of **30%** efficiency.\nDeveloped secure and efficient database interactions with **MySQL**, ensuring optimal performance and stability for financial transactions by implementing security best practices.\nStreamlined communication between systems with **RabbitMQ** and **Kafka**, achieving real-time processing for over **5,000** transactions per second.\nCreated dynamic, user-centric applications in **TypeScript** and **React** (18), enhancing observability and user experience in financial dashboards and admin portals.\nCollaborated effectively across teams to integrate various third-party services such as **FusionAuth**, **Twilio**, and **SendGrid**, facilitating smooth user authentication and notification processes.\nImplemented robust observability measures to monitor the performance of systems, ensuring they respond within **200ms** during peak loads.\nDeveloped and maintained ETL processes via **Apache Airflow** and **Azure Data Factory**, improving financial data ingestion and processing times by **40%** for batch operations.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and optimized backend services using **Python** (Django, FastAPI) and **Node.js** (Express, NestJS), achieving 99.99% uptime and scalability.\n• Leveraged **AWS** cloud services for deployment, enhancing system reliability and security in high-traffic environments.\n• Implemented **Kubernetes** for container orchestration, improving deployment efficiency and enabling zero-downtime updates.\n• Designed and implemented CI/CD pipelines using **GitHub Actions**, reducing deployment time by 50% and automating testing processes.\n• Engineered systems with observability in mind, integrating performance tuning methodologies that increased application efficiency by 30%.\n• Developed real-time features with event-driven architecture, enabling features like instant notifications and real-time updates for over **100,000** concurrent users.\n• Utilized **MySQL** and **Redis** for data management, ensuring low latency for data retrieval and enhancing application performance for e-commerce transactions.\n• Integrated third-party services using **Twilio** for SMS notifications and **SendGrid** for email communications, streamlining customer interactions.\n• Designed secured systems using **FusionAuth** for user authentication and authorization, ensuring compliance with GDPR and secure access management.\n• Applied system design principles to architect microservices that improved service isolation and deployment agility by 40%. \n• Collaborated with cross-functional teams to enhance communication and achieve project milestones aligned with strategic goals while mentoring junior engineers."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript, Golang\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tTwilio, SendGrid, FusionAuth\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, system design, observability, performance tuning, security, communication",
  "apply_company": "bunch"
}