{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Frontend Tech Lead",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Frontend Tech Lead with 13+ years of expertise in delivering high-performance applications, specializing in **React**, **TypeScript**, **Next.js**, and UI/UX design. Proven track record in implementing **i18n** using **Crowdin**, and optimizing performance through **Turborepo**, **analytics**, **AB tests**, **SEO optimizations**, and **PageSpeed improvements**. Highly skilled in integrating **third-party integrations** and developing robust **APIs** to ensure seamless functionality.\nDemonstrates advanced proficiency in **Figma** for design, and maintains good English communication skills to collaborate effectively with cross-functional teams. Also brings hands-on experience in crafting AI/ML-powered platforms, deploying applications on **AWS** and **Azure**, and ensuring compliance with industry regulations such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Frontend Tech Lead",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Led the architectural design and implementation of robust, scalable frontend applications using **React** (17–18) and **Next.js**, ensuring optimal performance and SEO optimizations for enhanced visibility.\n• Collaborated with cross-functional teams to integrate third-party services and APIs, leveraging **TypeScript** for type safety and improved code quality during all stages of development.\n• Enhanced user experiences through UI/UX design principles, utilizing tools like **Figma** for wireframing and prototyping, and applied **i18n** strategies for multilingual support and integration with **Crowdin**.\n• Conducted comprehensive analytics tracking on frontend applications, implementing **AB tests** to optimize user engagement and retention while focusing on **PageSpeed improvements** to enhance performance metrics.\n• Developed reusable components with modern tooling frameworks like **NX** and **Turborepo**, significantly increasing efficiency and reducing build times by up to **30%**.\n• Implemented comprehensive testing strategies using frameworks such as Jest, enhancing code reliability and maintaining high standards across all components, achieving **95%** test coverage in critical areas.\n• Engaged in continuous improvement of the development workflow, collaborating closely with the engineering team and facilitating knowledge sharing on best practices in frontend development.\n• Optimized site architecture for better loading time and overall performance, achieving a **20%** reduction in bounce rates via attentive code reviews and performance monitoring tools.\n• Actively contributed to the evolution of project standards and practices, ensuring the team remains updated on emerging frontend technologies and methodologies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed and maintained interactive front-end applications using **React** (18), **Next.js**, and **TypeScript**, ensuring optimal performance and user experience through SEO optimizations and PageSpeed improvements.\nLed **third-party integrations** and built robust APIs to facilitate seamless communication between front-end components and back-end services, utilizing tools like **Crowdin** for internationalization (i18n) and localization.\nImplemented advanced analytics features by designing dynamic dashboards that leverage **D3.js** and analytics tools for AB tests, providing actionable insights into user behavior and application performance metrics.\nManaged UI/UX design processes with **Figma**, translating wireframes into high-quality user interfaces that enhance usability and responsiveness.\nStreamlined development processes using **Turborepo** and **NX**, enabling efficient build configurations and promoting code quality across teams, leading to a **30%** increase in productivity.\nConducted regular performance reviews and user testing sessions, driving iterative improvements that resulted in **25%** faster load times and enhanced user engagement.\nMentored team members in effective use of **React** and technical best practices, fostering a collaborative environment that promotes continuous learning and development.  \nUtilized strong English communication skills to effectively convey technical concepts to non-technical stakeholders, ensuring alignment on project goals and updates."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **React (18)** and **Next.js** to architect and deliver robust, responsive user interfaces, ensuring alignment with **i18n** standards for multilingual support.\nCollaborated with product teams to implement analytics solutions and conduct A/B tests, leveraging insights to drive UI/UX improvements and **SEO optimizations** that increased organic traffic by **35%**.\nManaged integrations with third-party APIs to enhance functionality and streamline user experiences, implementing systems for real-time data interaction and automation across the platform.\nEmployed **TypeScript** to improve code quality and maintainability, facilitating easier onboarding for new team members and reducing bug reports by **25%**.\nStreamlined development workflows using **Turborepo** for efficient build processes and module management, significantly improving code deployment times.\nCoordinated the design process using **Figma** and involved in UI/UX reviews ensuring compliance with accessibility standards which led to a **20%** improvement in user satisfaction ratings.\nImplemented best practices for performance optimization, achieving PageSpeed improvements of up to **40%**, leading to enhanced user engagement and retention rates.\nLed the development of internationalization features in partnership with **Crowdin**, ensuring consistent experience across diverse platforms and languages.\nFacilitated collaboration among cross-functional teams, promoting good communication in English to align objectives and drive project delivery on time.\n"
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tAPIs, third-party integrations\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, i18n, Crowdin, NX, Turborepo, analytics, AB tests, SEO optimizations, PageSpeed improvements, UI/UX, Figma, good English skills"
}