{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior JavaScript Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior JavaScript Engineer with 10+ years of experience delivering high-performance software solutions. Proficient in **JavaScript**, **Node.js**, and API development, with a strong focus on **REST** and **SOAP** services. Expert in database management with hands-on experience in **SQL**, **SQLite**, and **PostgreSQL**. Skilled in creating robust serverless applications using **AWS Lambda**, **API Gateway**, and **Serverless Framework**. Demonstrated ability in **Automated Testing** and delivering exceptional **API Design** and documentation. Strong leadership skills with a deep commitment to **customer-oriented** solutions.\n\nIn addition to technical skills, my background encompasses proficiency in modern frameworks including **React**, **Next.js**, and **Vue**, ensuring scalability and maintainability of the applications developed. Experienced in deploying applications on both **Azure** and **AWS**, with knowledge of microservices architecture and CI/CD automation.\n\nI bring practical experience in leading development teams while solving complex problems and fostering effective communication. My passion lies in building systems that are technically sound and deliver measurable impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior JavaScript Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDesigned and implemented robust backend solutions utilizing **JavaScript**, **Node.js**, and various SQL databases such as **PostgreSQL** and **SQLite**, ensuring high performance and reliability in line with modern development practices.\n•\tDeveloped and maintained RESTful and SOAP APIs, focusing on clear **API documentation** and seamless integration with front-end services, enhancing user experience and system interoperability.\n•\tIntegrated automated testing frameworks such as Jest and Cypress to standardize **automated testing**, ensuring quality and consistency of code across all projects.\n•\tLed architectural discussions and decisions in translating complex business requirements into scalable solutions, showcasing strong **team leadership** and **problem-solving** abilities.\n•\tCommunicated effectively with stakeholders to gather requirements and deliver customer-oriented solutions, fostering an environment of collaboration and continuous improvement.\n•\tUtilized **AWS Lambda** with **API Gateway** to implement serverless solutions, optimizing resource usage and reducing operational costs.\n•\tFacilitated version control and collaboration through Git and GitHub, ensuring disciplined code management and team engagement in the development workflow.\n•\tCollaborated with teams to enhance user interfaces, using technologies like **React**, and developed engaging front-end components that improved application performance metrics.\n•\tMentored junior developers, promoting best coding practices and providing guidance on project challenges, enhancing team productivity and skill development.\n•\tManaged database migrations and query optimizations using **PostgreSQL**, contributing to overall system speed and efficiency, achieving up to **50%** reduction in load times.\n•\tConceived and delivered innovative solutions that met business goals reliably, directly impacting company projects with measurable results.\n•\tImplemented **API design** best practices that improved clarity and reliability, achieving a **95%** satisfaction rate in API usability surveys."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed and maintained scalable APIs using **Node.js** (NestJS/Express) adhering to **REST** standards, significantly enhancing application performance and providing seamless integration with **AWS Lambda** and **API Gateway**.\n• Led a team in designing and implementing robust database solutions using **PostgreSQL** and **SQLite**, managing over **500k** financial records with efficient query optimization techniques.\n• Executed end-to-end automated testing strategies for the financial platforms, ensuring high-quality delivery with streamlined **API Documentation** practices and improved reliability by **30%**.\n• Spearheaded the modernization of financial systems through innovative microservices architecture, increasing system throughput by over **150%** for high-volume transactions.\n• Championed customer-oriented solutions by effectively communicating technical concepts and collaborating with cross-functional teams to address user needs and drive project success.\n• Utilized **JavaScript** frameworks including React (18) and Next.js to create responsive and dynamic user interfaces for financial dashboards, enhancing user engagement and satisfaction by **25%**.\n• Implemented best practices for API Design and documentation to improve team efficiency and project scalability, catering to the evolving dynamic of the financial sector.\n• Fostered a culture of problem-solving and continuous improvement within the team, mentoring junior developers and facilitating knowledge-sharing sessions."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and optimized robust backend services using **Node.js** frameworks (NestJS, Express) for an efficient e-commerce platform, focusing on **REST** APIs to ensure high availability and scalability.\n• Implemented **SQL** databases, including **PostgreSQL** and **SQLite**, ensuring effective data management and integration with **AWS Lambda** for serverless operations that handled over **10,000** requests per minute.\n• Led automated testing initiatives to enhance the reliability of APIs, applying best practices in **API Design** and documentation to streamline development processes across teams.\n• Fostered team leadership capabilities by mentoring junior developers and promoting effective **communication** and **problem-solving** strategies during project execution.\n• Ensured customer-centric solutions by deploying secure, efficient e-commerce experiences with an emphasis on **REST**ful service architecture and responsive UI design principles.\n• Collaborated effectively across teams to contribute to platform improvements, focusing on delivering enhanced functionality that meets customer needs and optimizes workflows.\n• Spearheaded the transition of antiquated systems to modern frameworks, successfully reducing retrieval times by over **30%** and boosting system throughput.\n• Played a key role in designing and documenting APIs, significantly improving accessibility for multiple stakeholders and external partners.\n• Innovated client-side features utilizing JavaScript, resulting in a **20%** increase in user engagement metrics across multiple touchpoints."
    }
  ],
  "skills": "**Programming Languages**\n\tJavaScript, Python, TypeScript\n\n**Backend Frameworks**\n\tNode.js, FastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tREST, SOAP, API Design, API Documentation, API Gateway\n\n**Serverless and Cloud Functions**\n\tAWS Lambda, Serverless Framework\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, SQLite, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other**\n\tAutomated Testing, Team Leadership, Problem-solving, Communication, Customer-oriented, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow",
  "apply_company": "Memtime"
}