{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 8 years of experience in crafting high-performance, responsive web applications. Proficient in **JavaScript**, **HTML5**, **CSS3**, and passionate about leveraging **Angular** for innovative web solutions. Strong understanding of **RESTful APIs** and adept with **Git** for collaborative development. Skilled in implementing **CI/CD** practices to streamline deployment processes, ensuring optimal performance and security.\n\nMy background includes designing scalable web architecture with a focus on responsive design and performance optimization. I have a proven track record of integrating complex functionalities while adhering to high standards of compliance. My robust problem-solving skills and dedication to continuous improvement have consistently driven successful outcomes in challenging environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed responsive web applications using **Angular**, **JavaScript**, **HTML5**, and **CSS3**, ensuring adherence to modern front-end development best practices.\n- Architected RESTful APIs for seamless interaction between frontend interfaces and backend systems, enhancing application performance and scalability.\n- Implemented CI/CD pipelines leveraging **Git**, enabling automated deployments and version control across multiple environments, reducing deployment time by **30%**.\n- Enhanced application responsiveness and performance optimization, achieving load times under **2 seconds** across various devices, thereby improving user experience.\n- Collaborated closely with UI/UX designers to create intuitive, user-friendly interfaces that align with business goals and requirements.\n- Designed and implemented state management solutions using **NgRx**, leading to a **40%** reduction in data management complexity within applications.\n- Ensured cross-browser compatibility and performed extensive testing for adherence to web standards, achieving **95%** test coverage using Jest and Cypress.\n- Led architectural design discussions for improving web architecture, focusing on scalability and maintainability of applications under high load scenarios.\n- Conducted performance audits and implemented enhancements that boosted application responsiveness and front-end load efficiency by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed dynamic, user-focused front-end applications using **Angular**, **JavaScript**, **HTML5**, and **CSS3**, applying state management with **NgRx** for scalability and performance optimization in financial dashboards and admin portals.\nImplemented responsive design principles to ensure a seamless user experience across various devices, enhancing usability and accessibility of applications by **30%**.\nCollaborated in the design and integration of **RESTful APIs** with backend services, ensuring data flow and system interoperability.\nManaged source control and version control through **Git**, enabling collaborative development and continuous integration practices.\nUtilized **CI/CD** pipelines to streamline application deployment, reducing release times by **15%** and minimizing production risks.\nContinually optimized performance metrics, achieving load times of under **2 seconds** for critical financial applications.\nExecuted rigorous testing and maintenance protocols to uphold application reliability and support for **1000+** active users.\nParticipated in architectural discussions and contributed to the overall web architecture strategy, ensuring high-quality code and adherence to best practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed high-performance frontend applications leveraging **Angular** (version 13) and **JavaScript**, ensuring responsive design principles and performance optimization for an enhanced user experience on both desktop and mobile platforms.\nCreated aesthetically pleasing UIs using **HTML5** and **CSS3**, implementing responsive design strategies to maintain accessibility compliance (WCAG 2.1) across all devices and screen sizes.\nEngineered RESTful APIs and integrated with backend services to optimize and streamline data exchange, ensuring seamless interactions and high availability essential for user engagement.\nUtilized **Git** for version control and collaboration within a CI/CD pipeline, enabling efficient code deployment and continuous integration to improve development workflow.\nImplemented state management solutions using **NgRx** to enhance application performance and maintainability, facilitating improved user-interaction speeds.\nOptimized web architecture by employing various performance optimization techniques, leading to a reduced load time of up to **50%** in key modules, thereby enhancing the overall user experience.\nCollaborated with backend teams to understand system architecture and client requirements, ensuring the delivery of robust, scalable, and efficient solutions.\nParticipated in code reviews and mentoring sessions, fostering a knowledge-sharing culture to improve team productivity and technical competence."
    }
  ],
  "skills": " **Frontend Frameworks:**\n\tAngular, JavaScript, HTML5, CSS3, React, Vue\n\n **API Technologies:**\n\tRESTful APIs\n\n **Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, CI/CD, NgRx, responsive design, performance optimization, web architecture",
  "apply_company": "EPAM Systems"
}