{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Data Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Dynamic and detail-oriented Senior Data Engineer with 8 years of extensive experience in **Azure**, **AWS**, **SQL**, and **Snowflake**. Demonstrated expertise in **ETL**, **Data Governance**, and **Data Integration**, leveraging advanced data architecture strategies to drive organizational innovation. Proficient in building robust, scalable data pipelines and implementing effective data strategies that align with business objectives. Proven ability to optimize data workflows and enhance data accessibility for advanced analytics and artificial intelligence applications.\n\nI have a strong foundation in machine learning concepts, including developing predictive analytics solutions using **Python**, and deploying AI-driven insights to support decision-making. My experience in cross-functional teamwork and client-oriented approaches ensures that I deliver high-impact results that meet user and business needs. I'm adept at navigating complex challenges and bringing innovative solutions to the forefront of data engineering initiatives.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented data architecture solutions on **Snowflake**, enabling seamless **ETL** processes and efficient data warehousing tailored for healthcare and financial sectors. \nDeveloped and maintained data integration strategies using **SQL** for robust querying and reporting, ensuring high availability and error-free data flow through Azure and **AWS** cloud services. \nDesigned and enforced data governance frameworks that cater to regulatory compliance, significantly enhancing data quality and security. \nCollaborated closely with cross-functional teams to define and implement data strategies that advance analytical capabilities and support business decision-making. \nLeveraged **Artificial Intelligence** for advanced analytics, driving insights from large datasets and enabling innovative features in applications, including predictive analytics models for patient care and financial forecasting. \nFacilitated teamwork through regular contributions to project planning and execution, ensuring timely delivery of high-quality solutions aligned with client orientations. \nUtilized cloud-native solutions for data architecture, optimizing for performance and scaling to meet the demands of real-time data processing and analysis. \nEngaged in continuous learning and innovation by integrating emerging technologies into data workflows to enhance operational efficiency. \nPromoted a culture of data-driven decisions, advising clients on best practices in data management and usage while tailoring solutions to meet specific business needs."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Leveraged **Snowflake** to design and implement data architecture that enhances data governance and streamlined data integration processes.\n• Developed and optimized ETL processes using **Azure Data Factory** and **Python**, enabling batch and real-time data ingestion from diverse financial data sources, achieving a **40%** reduction in processing time.\n• Implemented advanced analytics solutions leveraging **Azure**, focusing on data strategy to improve data accessibility and usability for business intelligence.\n• Collaborated with cross-functional teams to establish best practices in data governance, ensuring compliance with regulatory standards while fostering teamwork and innovation.\n• Designed and executed complex **SQL** queries to manage large datasets for reporting and analytics, enhancing decision-making capabilities for stakeholders.\n• Pioneered AI and machine learning initiatives using **Azure Machine Learning** to conduct predictive analysis, increasing accuracy in financial forecasting by **25%**.\n• Contributed to the enhancement of data architecture by integrating **AWS** with **Azure**, facilitating seamless data movement and storage across platforms, leading to improved operational efficiency.\n• Championed a client-oriented approach by providing tailored data solutions that aligned with business needs, enhancing client satisfaction ratings by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and implemented **ETL** processes leveraging **Snowflake**, enhancing data integration and architecture for streamlined access to critical data insights.\nDeveloped data governance strategies ensuring compliance with industry standards and policies, while optimizing data quality and accessibility through **Azure** and **AWS** cloud services.\nExecuted advanced analytics techniques to derive insights from large datasets, incorporating **Artificial Intelligence** and machine learning principles to enhance decision-making processes across teams and client engagements.\nCollaborated cross-functionally with stakeholders to define data strategies that promote innovation and foster teamwork, optimizing data workflows and reporting systems.\nArchitected robust data pipelines and structures using **SQL** and other relevant tools for efficient data ingestion and processing, ensuring high performance in all operations across platforms.\nSpearheaded initiatives to effectively integrate data from diverse sources into cohesive frameworks, enhancing the data architecture to support impactful analytics and reporting.\nImplemented innovative solutions and tools for enhanced data processing and visualization, leading to substantial improvements in data accessibility and client orientation in project deliveries.\nDrove continuous improvement in data processes, incorporating feedback and integrating advanced technologies to meet evolving business needs and bolster team efficiency."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS RDS, Azure Blob, SQL\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Data Governance, Data Strategy, Data Integration, Data Architecture, Artificial Intelligence, Advanced Analytics, ETL, Teamwork, Client Orientation, Innovation",
  "apply_company": "Logicalis Spain"
}