{
  "name": "Tomasz Lee",
  "role_name": "Senior Performance Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Performance Engineer with 9+ years of experience in software design, planning, and concept creation. Proficient in **Java**, **Jakarta**, **Kubernetes**, **Docker**, and **Go**, with a strong understanding of performance monitoring tools like **Grafana**, **Prometheus**, and **Open-Telemetry**. Demonstrated expertise in distributed systems and microservices architecture with hands-on experience. Proven track record in delivering robust software solutions and optimizing performance metrics. Excellent collaboration and leadership skills in cross-functional teams, ensuring successful project delivery.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Performance Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and optimized software design practices to enhance overall system performance, utilizing **Open-Telemetry** for efficient monitoring and tracing.\n• Implemented containerization strategies using **Docker** and **Kubernetes** to ensure scalability and high availability of applications.\n• Created planning and concept creation sessions to identify performance bottlenecks, resulting in a reduction of system latency by **30%**.\n• Managed deployment pipelines and configurations on **JBoss** and **Wildfly**, ensuring seamless application delivery and improved system reliability.\n• Leveraged performance monitoring tools such as **Grafana** and **Prometheus** for real-time insights, optimizing resource utilization by **25%**.\n• Collaborated with cross-functional teams to design architectural strategies that align with industry best practices.\n• Conducted performance testing using **JVM** profiling techniques to enhance the efficiency of Java-based applications.\n• Mentored junior engineers in software design principles and performance optimization techniques."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Java** and **Go** to design and implement high-performance applications, contributing to improved system responsiveness and stability.\nEngineered and deployed **Docker** containers for application services, ensuring consistent environments and simplifying deployments.\nDeveloped scalable microservices utilizing **Kubernetes** for orchestration and management, streamlining resource allocation.\nImplemented monitoring solutions with **Grafana** and **Prometheus**, resulting in a **40%** increase in system insight and troubleshooting efficiency.\nExecuted thorough software design and planning for new features, leading to on-time project delivery with a **20%** reduction in estimated effort.\nCreated comprehensive documentation for software architecture and development processes, enhancing team knowledge transfer and onboarding efficiency.\nCollaborated in cross-functional teams to define and escalate performance targets, aligning with business goals to enhance user experience.\nLed efforts in creating custom telemetry instrumentation using **Open-Telemetry**, contributing to improved observability of application performance metrics.\nParticipated in code reviews, ensuring quality and adherence to software design principles, fostering a culture of continuous improvement within the team.\nMentored junior engineers in leveraging **Jakarta** and **JBoss/Wildfly** frameworks, enhancing their application development skills and overall project contribution."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Java**, **Kubernetes**, and **Docker** to design and implement scalable performance testing solutions, enhancing application reliability.\nEmployed **Grafana** and **Prometheus** for monitoring system performance metrics and analyzing real-time data, which improved response times by **30%** during load tests.\nDeveloped performance benchmarks and stress tests using **Jakarta** frameworks, identifying bottlenecks and optimizing system throughput.\nImplemented **Open-Telemetry** for distributed tracing, enabling detailed visibility into the performance of microservices across different environments.\nCollaborated with cross-functional teams to plan and create software designs that meet rigorous performance standards, elevating project results by **25%**.\nLed efforts to containerize applications using **Docker**, leading to a more efficient deployment process and a reduction in configuration errors by **40%**.\nContributed to the development of CI/CD pipelines within a **Kubernetes** environment, streamlining deployment processes and minimizing downtime.\nFacilitated knowledge transfer through technical documentation and workshops, enhancing team capabilities in performance engineering practices.\nEngaged in daily standups and code reviews to ensure adherence to performance engineering principles and coding excellence."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, Go, HTML, CSS, JavaScript, TypeScript, Python, C#, Solidity\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, JBoss, Wildfly\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tDocker, Kubernetes, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tGrafana, Prometheus, Open-Telemetry\n\n**Other**\n\tUX/UI Design, Git, GitHub, Software Design, Planning, Concept Creation, Microservices, Messaging & Caching, Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Dedalus"
}