{
  "name": "Rei Taro",
  "role_name": "Senior Software Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Software Engineer with over 10 years of experience in developing and delivering high-quality backend systems. Proficient in **PHP**, **MySQL**, **Postgres**, **Kafka**, **RabbitMQ**, and **API** design. Skilled in creating robust, event-based architectures and collaborating effectively in team environments. Strong command of object-oriented programming and version control using **Git**. Proven success in leveraging feedback to enhance project outcomes in top-tier organizations, including VISA, Sii Poland, and Reply Polska. Additionally, adept in automating processes and building scalable services using **Python** (FastAPI, Django, Flask) and cloud platforms like **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed and maintained APIs using **PHP** and **MySQL** to enhance application interaction and data retrieval, improving performance by **30%**.\nImplemented event-driven architecture with **Kafka** and **RabbitMQ** to optimize data processing workflows, increasing system efficiency by **25%**.\nLeveraged **Postgres** for robust data storage solutions, ensuring minimal downtime and data integrity across applications during transactions.\nUtilized **React** for building dynamic user interfaces, significantly improving user experience and engagement metrics by **40%**.\nChampioned best practices in **object-oriented** design and **event-based** programming to deliver high-quality, maintainable code in a team environment.\nEmployed **Git** for version control and collaborative coding, facilitating efficient code reviews and team input on projects.\nPromoted a culture of **teamwork** and continuous **feedback**, resulting in enhanced team performance and project delivery timelines."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **PHP** and **MySQL** to develop robust backend systems, enhancing the efficiency of document workflows, user onboarding processes, and reporting capabilities by **30%**.\nImplemented **event-based** microservices using **RabbitMQ** and **Kafka**, facilitating real-time transaction processing and financial data management with up to a **50%** increase in system responsiveness.\nCollaborated with DevOps to automate deployments using **Git** and **NIX**, ensuring seamless integration and management of cloud environments while reducing deployment times by **40%**.\nEngineered backend solutions that incorporated **API** design principles to enhance system scalability and performance, achieving a **99.9%** uptime rate.\nConducted thorough security audits and implemented best practices, including the use of OAuth2 for authentication and secure access control measures, thus improving security compliance ratings by **25%**.\nWorked effectively within a multidisciplinary team, facilitating teamwork and continuous feedback to promote innovation and deliver projects on time."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Leveraged **PostgreSQL** and **RabbitMQ** to design and implement backend services for trade execution, portfolio management, and account tracking, enhancing trading operations and resulting in a **40%** improvement in response times.\nUtilized **API** design principles to collaborate closely with frontend teams, ensuring seamless integration through robust REST APIs and **WebSocket** channels for real-time user interaction, achieving a **99.9%** uptime.\nAdhered to regulatory standards such as MiFID II and GDPR, maintaining strict compliance while implementing internal data security measures, resulting in zero compliance issues over **3 years**.\nDeveloped comprehensive test suites with **PyTest** and **tox**, improving QA processes and CI/CD pipelines, which reduced overall development cycle times by **30%**.\nEngineered real-time price feeds using **asyncio**, **WebSockets**, and **Redis**, delivering up-to-the-millisecond trading data for high-frequency transactions, successfully supporting an increase in transaction volumes by over **50%**.\nImplemented job queuing and scheduling solutions with **Celery**, optimizing backend task execution, ultimately enhancing system performance by **25%**.\nEncouraged teamwork and facilitated constructive feedback sessions, promoting a collaborative environment that led to a **15%** increase in team productivity."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, PHP\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\tReact\n\n  **API Technologies**\n\tREST/gRPC APIs, API\n\n  **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps\n\n  **Cloud & Infrastructure**\n\tNIX, CI/CD\n\n  **Other**\n\tKafka, RabbitMQ, object-oriented, event-based, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, teamwork, feedback, PyTest, Git",
  "apply_company": "ChargePoint"
}