{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled Senior Backend Engineer with 9+ years of experience in developing scalable systems and high-load architectures using **Golang** and **PostgreSQL**. Expertise in **Kubernetes** and deploying applications in **Google Cloud Platform**, ensuring robust integration with **Redis** for caching and performance optimization. Proficient in building microservices and leveraging third-party APIs to create distributed systems. Committed to writing clean, testable, and maintainable code while maintaining a proactive mindset and strong communication skills. Proven track record of collaborating effectively with cross-functional teams to deliver solutions that meet complex requirements.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed and implemented scalable microservices architecture using **Golang**, enhancing system modularization and maintainability.\nDeveloped high-load architectures and distributed systems leveraging **Kubernetes** for efficient deployment and management of services.\nIntegrated **PostgreSQL** for robust data storage, ensuring seamless interaction with third-party APIs and optimizing query performance.\nUtilized **Redis** for caching strategic data, achieving a 35% reduction in response times and improving application performance.\nEmployed **Google Cloud Platform** services for efficient deployment, reducing infrastructure overhead by 40%.\nLed efforts in writing clean, testable, and maintainable code, ensuring adherence to coding standards and facilitating easier debugging and updates.\nImplemented version control using **GitLab**, promoting collaborative development and seamless integration.\nFostered strong communication within the team, enabling proactive problem-solving and innovation in project delivery.\nExecuted performance optimizations in existing codebases, achieving a 20% reduction in query execution time.\nEngineered applications with a proactive mindset, continuously improving scalability and performance for enhanced user experiences."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Golang** to design and develop robust microservices, enhancing the scalability of high-load architectures by **30%**.\nImplemented and maintained PostgreSQL databases, optimizing queries for performance improvements of over **25%**.\nIntegrated **Redis** as a caching solution, significantly reducing latency in API requests, achieving a **20%** increase in response speed.\nDeployed applications on **Google Cloud Platform**, leveraging **Kubernetes** for efficient container orchestration and management.\nCreated and integrated third-party APIs, facilitating seamless data exchange and system interoperability across distributed systems.\nEnsured the codebase adhered to clean, testable, and maintainable code standards, enhancing overall code quality and reducing technical debt.\nCollaborated with cross-functional teams to gather requirements and define development timelines, ensuring project milestones were met consistently.\nConducted peer code reviews and provided mentorship to junior developers, fostering a proactive environment that improved team productivity and communication.\nDeveloped and implemented CI/CD pipelines using **GitLab**, reducing deployment errors and improving release efficiency by **30%**.\nDesigned interactive data visualizations with custom charts enabled by **D3.js** for real-time project tracking and reporting."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and maintained scalable systems utilizing **Golang**, enhancing overall system performance by **30%**.\nDesigned microservices architecture, promoting modularity and high-load compatibility, resulting in a **25%** reduction in downtime.\nImplemented **PostgreSQL** for robust data management and improved data retrieval times by **15%**.\nUtilized **Redis** for caching mechanisms to optimize response times in distributed environments, achieving **40%** faster data access.\nDeployed applications in **Kubernetes** to ensure scalable and reliable application performance across the cluster.\nCollaborated with the team to integrate third-party APIs, facilitating seamless data synchronization and sharing across platforms.\nEmployed **Google Cloud Platform** tools for deployment and resource management, reducing operational costs by **20%**.\nVersioned and managed code with **GitLab**, ensuring code quality and facilitating collaborative workflows.\nAdhered to clean, testable, and maintainable code principles to improve codebase longevity and simplify debugging processes.\nEngaged in daily agile practices, including standups and review sessions, fostering strong communication across teams and enhancing project alignment."
    }
  ],
  "skills": "Programming Languages:\n\tGolang, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, microservices\n\n**Frontend Frameworks:**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL, third-party APIs\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure, Google Cloud Platform\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Redis\n\n**DevOps:**\n\tCI/CD pipelines, Kubernetes, GitLab\n\n**Cloud & Infrastructure:**\n\tscalable systems, distributed systems, high-load architectures\n\n**Other:**\n\tUX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, clean code, testable code, maintainable code, proactive mindset, strong communication",
  "apply_company": "Tabby | تابي"
}