{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience in high-performance application development, skilled in **.NET**, **C#**, **ASP.NET MVC**, **ASP.NET Core**, and **Entity Framework**. Proficient in building robust Web APIs and backend systems with a strong foundation in **JavaScript**, **TypeScript** and **Angular** frameworks, ensuring seamless integration with front-end technologies. Experienced in testing and performance optimization using **NUnit** and **Mock** frameworks. Highly knowledgeable in database management, including **MS SQL Server**, **PostgreSQL**, and **Oracle**.\n\nAdept in developing cloud-native systems, implementing CI/CD pipelines, and ensuring compliance with industry standards. Committed to delivering reliable solutions that enhance operational efficiency. Strong communication skills with a proactive approach to problem-solving, built on a foundation of hands-on expertise in both frontend and backend development.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained robust backend systems utilizing **.NET**, **C#**, and **ASP.NET Core** to ensure high-quality code and optimal performance.\nImplemented RESTful **Web API** services that efficiently handled requests, utilizing **NUnit** for unit testing and ensuring code reliability through mock testing techniques.\nDesigned and optimized database solutions using **MS SQL Server**, **PostgreSQL**, and **Oracle**, improving data retrieval speeds by up to **30%** through effective indexing and query optimization strategies.\nCollaborated with frontend developers using **JavaScript**, **TypeScript**, and **Angular** to create seamless integration between frontend and backend systems, enhancing user experience and functionality.\nUtilized version control systems like **Git** and **SVN** to manage source code and maintain project history, facilitating team collaboration and code reviews.\nParticipated in the design and implementation of enterprise-level applications, leveraging the **Entity Framework** for data manipulation and ORM capabilities, achieving a reduction in data access times of up to **25%**.\nConducted meticulous testing strategies, covering unit, integration, and contract-level tests to ensure application reliability and durability across various environments.\nStreamlined development workflows by integrating CI/CD practices into project pipelines, enhancing deployment frequency by **40%** and reducing the time to market for new features.\nEngaged in code reviews and mentorship activities, fostering best practices among junior developers and improving team coding standards.\nMaintained comprehensive documentation of backend services and workflows to aid future development and onboarding, contributing to a **20%** increase in onboarding efficiency for new team members."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **.NET** technologies including **C#**, **ASP.NET Core**, and **Entity Framework** to modernize backend services, improving performance and maintainability for enterprise applications.\nImplemented **Web API** for seamless integration with front-end frameworks, ensuring robust communication between various application components.\nUtilized **MS SQL Server**, **PostgreSQL**, and **Oracle** to design and optimize database schemas, achieving a **30%** improvement in query performance for high-load environments.\nEmployed version control systems like **Git** and **SVN** to facilitate collaborative development, resulting in a **25%** reduction in deployment time through streamlined workflows.\nCreated and executed unit tests using **NUnit** and mock frameworks, enhancing code quality and reliability, leading to a **20%** decrease in bugs during production rollouts.\nDeveloped user interfaces with **JavaScript**, **TypeScript**, and **Angular**, crafting dynamic and responsive web applications that improved user engagement by **15%**.\nImplemented best practices for CSS and **SASS** styling methodologies, ensuring scalable and maintainable CSS architecture in applications.\nParticipated in architecture design sessions, contributing to a transition towards microservices, which enhances the application's modularity and scalability."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized scalable backend services for high-performance applications using **.NET** and **C#**, ensuring robust functionality and responsiveness.\nEngineered Web APIs utilizing **ASP.NET Core** to facilitate seamless data exchange and integration between different system components.\nImplemented robust database solutions with **MS SQL Server**, **PostgreSQL**, and **Oracle**, ensuring efficient data storage, retrieval, and management in line with application requirements.\nUtilized **Entity Framework** for streamlined database access and manipulation, aiding in rapid development and maintenance of persistence layers across applications.\nConducted unit testing and integration testing using **NUnit** and **Mock**, achieving over **90%** code coverage to ensure high code quality and reliability.\nManaged version control systems effectively using **Git** and **SVN**, enhancing collaboration and code integrity in development teams.\nEngaged in frontend development utilizing **JavaScript**, **TypeScript**, and **Angular** to produce dynamic user interfaces and ensure a cohesive user experience.\nApplied **CSS** and **SASS** for tailored styling solutions, creating visually appealing and responsive layouts compatible across various devices and screen sizes.\nCollaborated with cross-functional teams to align backend services with frontend frameworks, resulting in a cohesive architecture that improves user experience and performance metrics.\nEmphasized adherence to best practices in coding, documentation, and deployment strategies to maintain high standards in system integrity and performance."
    }
  ],
  "skills": "    **Programming Languages:**\n\tC#, .NET, JavaScript, TypeScript\n\n    **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n    **Backend Frameworks:**\n\tFastAPI, Flask, Django, ASP.NET MVC, ASP.NET Core, Entity Framework\n\n    **API Technologies:**\n\tWeb API\n\n    **Serverless and Cloud Functions:**\n\tAWS Lambda\n\n    **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, MS SQL Server, Oracle\n\n    **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n    **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob Storage, SQL Database)\n\n    **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, NUnit, Mock, SVN, DOM, CSS, SASS",
  "apply_company": "Creatio"
}