{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Salesforce Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a results-driven Senior Salesforce Engineer, I leverage my expertise in **Salesforce**, **Sales Cloud**, **Flow Builder**, and **Lightning App Builder** to design and implement high-performance solutions that drive business growth. I possess strong skills in **Data Loader**, **CRM best practices**, and project management to ensure data accuracy and optimize CRM functionalities.\nWith 8 years of experience in full-stack development utilizing **JavaScript**, **Python**, **React**, and **Node.js**, I combine technical prowess with a deep understanding of enterprise solutions to create scalable applications. My background includes significant cloud experience with **Azure** and **AWS**, and the application of secure software practices that align with compliance standards.\nAdditionally, I have successfully led projects integrating predictive analytics and automation, employing tools like **HubSpot**, **Outreach**, and **Gong** to streamline workflows. My meticulous approach to data management and system integration ensures robust application performance, enhancing end-user satisfaction.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Salesforce Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed customized solutions on **Salesforce** leveraging **Sales Cloud**, **Flow Builder**, and **Lightning App Builder** to enhance user engagement and streamline sales processes.\n- Managed data imports and exports using **Data Loader**, ensuring data accuracy and integrity, achieving a data accuracy rate of **99%**.\n- Implemented and optimized **HubSpot** and **Outreach** integrations, increasing lead generation efficiency by **30%** through seamless data synchronization.\n- Utilized **Gong** and **ZoomInfo** to analyze sales calls and optimize outreach strategies, improving conversion rates by **25%**.\n- Developed and maintained **CPQ** solutions, enabling sales teams to generate quotes rapidly, reducing time to quote from **5 days** to **1 day**.\n- Led project management initiatives to ensure timely delivery of Salesforce enhancements, employing agile methodologies and collaboration tools.\n- Conducted regular audits of CRM practices, resulting in the identification of key areas for improvement that increased data hygiene and user adoption.\n- Trained cross-functional teams on best practices in relation to **Salesforce**, promoting user engagement and maximizing platform utilization.\n- Collaborated with IT and data teams to execute data quality initiatives, leveraging analytics tools to identify and rectify discrepancies within the system.\n- Established a feedback loop with stakeholders, ensuring continuous improvement and adherence to changing business requirements.\n- Engaged in the development of performance metrics and KPIs to assess the effectiveness of implemented Salesforce strategies, presenting findings to senior management."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Salesforce**, **Sales Cloud**, and **Lightning App Builder** to design and implement scalable CRM solutions, enhancing user engagement and driving sales performance by over **30%**.\nDeveloped automated workflows with **Flow Builder**, streamlining processes and improving team efficiency in project management across **5** key departments.\nEnsured data accuracy and integrity through robust integration with **Data Loader**, facilitating accurate reporting and insights for decision-making.\nLeveraged tools like **HubSpot**, **Outreach**, and **Gong** for lead tracking and customer interaction analysis, boosting conversion rates by **25%**.\nConducted comprehensive system audits and operational reviews to align strategies with **CRM best practices**, achieving a customer satisfaction score increase of **15%**.\nCollaborated cross-functionally to implement **CPQ** solutions that optimized pricing strategies and streamlined the sales pipeline, reducing the average deal closure time from **45** to **30** days.\nManaged training and support initiatives enhancing team proficiency in Salesforce tools, fostering a culture of continuous improvement and innovation."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Utilized **Salesforce** and **Sales Cloud** to enhance CRM solutions, ensuring data accuracy and compliance with CRM best practices through meticulous management of customer information and workflows.\nDesigned and implemented automation solutions using **Flow Builder** to streamline business processes, improving efficiency and reducing operational costs by up to **30%**.\nDeveloped custom applications and dashboards using **Lightning App Builder**, accelerating data retrieval and enhancing user experience with interactive visualizations.\nConducted comprehensive data analysis and migration efforts with **Data Loader**, ensuring smooth data transitions and integrity across various platforms, achieving a **99%** data accuracy rate.\nCollaborated with cross-functional teams utilizing **HubSpot**, **Outreach**, and **Gong** to drive sales strategies and improve lead management, contributing to a **15%** increase in pipeline efficiency.\nLeveraged **ZoomInfo** for enriched contact data, driving targeted marketing campaigns and enhancing communication strategies.\nImplemented **CPQ** solutions to streamline the quoting process, reducing quote generation time by **40%** and improving sales efficiency.\nApplied project management methodologies to oversee Salesforce implementations and enhancements, ensuring timely delivery and meeting project milestones.\nAdvised on best practices for customer engagement and relationship management, driving improved customer satisfaction through tailored solutions."
    }
  ],
  "skills": "**Salesforce, Sales Cloud, Flow Builder, Lightning App Builder, Data Loader, HubSpot, Outreach, Gong, ZoomInfo, CPQ, CRM best practices, Project Management, Data Accuracy**\n\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Artificial Intelligence & Machine Learning**\n\n\tMLflow, Airflow, Kubeflow\n\n**DevOps & Cloud**\n\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Authentication & Security**\n\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Databases & Caching**\n\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**CI/CD & Infrastructure as Code**\n\n\tTerraform, Ansible, Helm, Docker Compose",
  "apply_company": "Commit"
}