{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Skilled Senior Field Engineer with a strong background in **mechanical systems** maintenance, repair, and troubleshooting, ensuring high-performance operational capabilities. Proven expertise in **root cause analysis** and **engine automation**, with a commitment to HSE standards and intercultural communication. Proficient in technical reporting and customer service, facilitating seamless coordination across diverse teams. With 13+ years in software development, leveraging programming skills in **JavaScript/TypeScript**, **Python**, and **Flutter**, and hands-on expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for building resilient applications. Experienced in deploying cloud-native systems on **AWS** and **Azure**, implementing microservices, and fostering compliance through adherence to industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted troubleshooting and root cause analysis on mechanical systems and engine automation, ensuring adherence to HSE standards.\n- Provided maintenance and repair support for technical systems, utilizing Microsoft Office for documentation and technical reporting.\n- Collaborated with teams to coordinate repair efforts and deliver exceptional customer service, enhancing intercultural communication across diverse environments.\n- Applied organized methods and attention to detail while managing project tasks and maintenance schedules.\n- Developed technical reports detailing repair processes and outcomes to improve future troubleshooting efforts.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted regular **maintenance** and **troubleshooting** of field engineering equipment, ensuring optimal performance and adherence to **HSE standards**.\nPerformed **root cause analysis** on mechanical system failures, contributing to effective **repair** strategies and improved reliability.\nAutomated engineering processes leveraging **networking** technologies to enhance operational efficiency and reduce downtime by up to **30%**.\nDeveloped and maintained technical reports for field operations, utilizing **Microsoft Office** to document findings and recommend solutions.\nCoordinated with cross-functional teams to address customer service needs, enhancing client satisfaction through precise communication and follow-ups.\nExecuted organized field operations, demonstrating strong **attention to detail** in compliance with established protocols and safety regulations.\nFostered intercultural communication within diverse teams, ensuring effective collaboration and understanding across various projects and locations.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted **root cause analysis** for mechanical systems failures, leading to timely **maintenance** and **repair** interventions that reduced downtime by **30%**.\nExecuted rigorous **troubleshooting** procedures to identify and resolve issues, enhancing overall system reliability across various **engine automation** projects.\nEnsured compliance with **HSE standards**, maintaining a safe work environment and reducing incidents by **25%** through effective **technical reporting** and documentation.\nCoordinated with cross-functional teams to streamline project workflows, utilizing **Microsoft Office** tools for effective communication and status tracking, which improved project timelines by **15%**.\nDemonstrated exceptional **customer service** skills by responding promptly to client inquiries, fostering positive relationships and achieving a customer satisfaction rate of **95%**.\nApplied strong **intercultural communication** abilities to collaborate effectively with diverse teams, ensuring seamless coordination on international projects.\nMaintained organized project documentation and reports, ensuring all technical details were accurately captured and accessible for future reference, leading to improved knowledge transfer and operational efficiency.\nExhibited superior **attention to detail** in all tasks, from technical reporting to project execution, contributing to the high-quality standards of engineering deliverables.\nEngaged in proactive networking to enhance engineering solutions, driving innovation and continuous improvement initiatives."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\t\n\n **Frontend Frameworks:**\n\t\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\t\n\n **Other:**\n\tmaintenance\n\trepair\n\ttroubleshooting\n\troot cause analysis\n\tengine automation\n\tmechanical systems\n\tHSE standards\n\tMicrosoft Office\n\ttechnical reporting\n\tintercultural communication\n\tcoordination\n\tcustomer service\n\tnetworking\n\torganized\n\tattention to detail",
  "apply_company": "Everllence"
}