{
  "name": "Rei Taro",
  "role_name": "Senior Security Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Security Engineer with over 10 years of experience in cloud security, threat hunting, and SOC operations. Expert in employing **AWS**, **Azure**, and various SIEM tools like **Sentinel** and **Splunk** to ensure robust security postures. Proficient in developing and implementing security strategies and automation tools using **Python** and **PowerShell**. Demonstrated ability to enhance security measures in financial platforms and manage EDR, CSPM, and DLP solutions effectively. Known for strong communication and collaboration skills, contributing to critical projects at renowned organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented robust **cloud security** measures using **Azure** and **AWS**, ensuring compliance with security standards and best practices.\nConducted threat hunting activities and managed **SIEM** solutions like **Splunk** and **Sentinel** to identify and mitigate potential security threats effectively.\nEngineered backend services in **Python** for security monitoring, emphasizing performance and reliability in **SOC operations**.\nIntegrated **EDR** and **CSPM** tools for proactive monitoring and response to security incidents across cloud environments.\nUtilized **PowerShell** for automation of security-related tasks, enhancing efficiency and alert response times by **30%**.\nDeveloped and maintained security dashboards and reporting workflows to provide team insights on threat landscape and system vulnerabilities, leading to a **25%** reduction in incident response time.\nFostered strong communication and collaboration with cross-functional teams to ensure comprehension and adherence to security protocols in all deployments.\nManaged security incidents and developed remediation strategies, resulting in enhanced operational resilience and a **40%** improvement in threat detection capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Azure** and **AWS** to implement cloud security measures, ensuring compliance with industry standards and enhancing system integrity.\nExecuted **SOC operations** and conducted **threat hunting** activities to identify and mitigate security vulnerabilities in the infrastructure.\nImplemented security monitoring solutions with **SIEM**, including **Sentinel** and **Splunk**, to enhance threat detection capabilities and improve incident response times by **30%**.\nDeveloped secure scripting solutions using **Python** and **PowerShell** to automate routine security tasks and streamline operations, achieving a **25%** reduction in manual efforts.\nManaged and secured deployment of applications in cloud environments, applying **CSPM** practices to ensure compliance with security policies.\nConducted thorough audits to assess security protocols, integrating **DLP** solutions to safeguard sensitive information and reduce data breaches by **15%**.\nCollaborated closely with cross-functional teams to enhance communication and ensure effective security measures are seamlessly integrated into existing workflows."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Implemented robust **cloud security** protocols to safeguard sensitive data while ensuring compliance with security standards of MiFID II and GDPR.\nConducted **SOC operations** and **threat hunting** to identify and mitigate potential vulnerabilities, leveraging tools such as **Splunk** and **Rapid7**.\nUtilized **Azure** and **AWS** services to enhance infrastructure security and streamline deployment processes for security solutions.\nDeveloped automated scripts using **Python** and **PowerShell** to facilitate rapid response and incident management, improving operational efficiency by **25%**.\nCollaborated effectively with cross-functional teams to communicate and address security issues, resulting in a **15%** reduction in incident response time.\nLeveraged SIEM tools like **Sentinel** to monitor system activities, ensuring early detection of security threats across the organization.\nDesigned and implemented **EDR** and **CSPM** strategies to improve endpoint protection and secure cloud configurations, contributing to a **30%** increase in overall security posture.\n"
    }
  ],
  "skills": "****Programming Languages****\n\tPython (3.8+), SQL, Bash, JavaScript, PowerShell\n\n****Backend Frameworks****\n\tFastAPI, Flask, Django, Celery\n\n****Frontend Frameworks****\n\t\n\n****API Technologies****\n\tREST/gRPC APIs, Microservices\n\n****Serverless and Cloud Functions****\n\tAWS (EC2, S3, Lambda), Azure\n\n****Databases****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps****\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n****Cloud & Infrastructure****\n\tcloud security, SOC operations, threat hunting, SIEM, Sentinel, Splunk, Rapid7, EDR, CSPM, DLP\n\n****Other****\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, PyTest, Git, communication, collaboration",
  "apply_company": "Novanta Inc."
}