{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Fullstack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Fullstack Engineer with 10+ years of experience in delivering high-performance software solutions, leveraging a strong skill set that includes **Java**, **Go**, **Jakarta**, **Angular**, **JavaScript**, **TypeScript**, **Docker**, **Kubernetes**, and robust database management with **Oracle** and **SQL**. Demonstrated expertise in developing and deploying cloud-native applications with proficiency in **JBoss**, **Wildfly**, and CI/CD automation, ensuring solutions are efficient and secure. Proven ability in software design, planning, and concept creation, with a focus on building maintainable enterprise platforms. Additionally, brings hands-on experience in microservices architecture and event-driven systems, ensuring compliance with industry standards. Passionate about creating impactful, scalable solutions that enhance user experience and drive business success.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions using **Java**, **Go**, and **Typescript**, ensuring adherence to software design principles and planning methodologies.\n• Developed enterprise applications leveraging **Angular**, **Java**, and **Docker**, enhancing user experience and maintaining high performance in production.\n• Led migration of traditional architectures to microservices using **Kubernetes** and **Docker**, improving scalability and deployment efficiency by **40%**.\n• Utilized **Oracle** and **SQL** for efficient data management and storage solutions, optimizing performance for high-throughput transaction processing.\n• Implemented rigorous test strategies using **JMeter** and automated testing tools, achieving **95%** test coverage across multiple services.\n• Collaborated with cross-functional teams in concept creation and planning, resulting in streamlined workflows and improved project delivery timelines by **30%**.\n• Developed and maintained APIs using **Java** and **Spring Boot** for seamless integration with client-side applications, ensuring smooth data flow and user engagement.\n• Integrated advanced networking solutions to enhance application communication and resolved performance bottlenecks, reducing latency by **25%**.\n• Mentored junior developers in **Java**, **Go**, and **Typescript**, fostering a culture of continuous learning and code excellence in the engineering team.\n• Engaged in code reviews and architectural discussions, contributing to the overall improvement of software quality and maintaining a high standard of engineering practices."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Leveraged **Java** and **Go** to develop and maintain robust software solutions within high-traffic environments, ensuring scalability and performance.\n- Collaborated in an Agile environment using **Kubernetes** to orchestrate containerized applications with **Docker**, enhancing deployment efficiency by **40%**.\n- Engaged in the design and development of data-centric applications utilizing **Oracle** and **SQL**, improving query performance and database interactions by **25%**.\n- Implemented front-end solutions using **Angular** and **Typescript** to enhance user engagement and satisfaction, resulting in a **30%** increase in application adoption rates.\n- Enhanced software design processes by applying best practices and methodologies, leading to a **20%** reduction in project delivery timelines.\n- Conducted performance testing and optimization using **JMeter**, identifying bottlenecks and improving response times by **15%**.\n- Developed microservices and ensured effective network configurations, supporting high availability and resilience within distributed architectures.\n- Spearheaded the planning and concept creation of new features, consistently receiving positive feedback from stakeholders.\n- Maintained and upgraded existing systems including setups involving **JBoss** and **Wildfly**, ensuring seamless operations during transitions.\n- Directly contributed to code reviews and mentorship for junior engineers, fostering a collaborative team environment and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Kubernetes** and **Docker** for container orchestration and deployment, enhancing application scalability and resource management across distributed environments.\nDeveloped robust backend services utilizing **Java** and **Go**, employing best practices in **Software Design** to ensure maintainability and efficiency of the codebase.\nImplemented APIs and microservices in **JBoss** and **Wildfly**, facilitating smooth integration with various front-end technologies and supporting high-demand e-commerce functionalities.\nEngaged in **Planning** and **Concept Creation** for application features and enhancements, adhering to Agile methodologies to drive project success and timely delivery.\nEmployed **SQL** and **PL/SQL** for complex data queries and database management, optimizing performance for high-traffic scenarios and ensuring data integrity.\nCreated dynamic web applications using **Angular** along with **JavaScript** and **TypeScript**, focusing on building responsive user interfaces that provide seamless user experiences.\nConducted performance testing using **JMeter** to identify and mitigate bottlenecks, ensuring system reliability under varying loads.\nFostered strong networking capabilities to enhance communication between microservices and external API integrations, improving overall system interoperability.\nCollaborated with cross-functional teams to implement best practices in project management, ensuring effective resource allocation and timely completion of deliverables."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Go, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, JBoss, Wildfly\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, OIDC\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Oracle, SQL, PL/SQL, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNetworking, CI/CD & Infrastructure as Code\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, JMeter, Software Design, Planning, Concept Creation",
  "apply_company": "Dedalus HealthCare GmbH"
}