{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dynamic Senior Sales Engineer with 8 years of experience in delivering technical solutions in the fields of **Salesforce**, **Oracle**, and **IoT**. I leverage my expertise in **Customer Relationship Management** and **Market Analysis** to develop tailored strategies that drive revenue and enhance customer satisfaction. My strong **Technical Expertise** ensures that I can articulate complex technical concepts effectively, facilitating successful negotiations with stakeholders.\nIn addition to my sales engineering capabilities, I possess a robust foundation in full-stack development, having used **JavaScript**, **TypeScript**, **Python**, and **Flutter** to build high-performance solutions in healthcare and financial sectors. My background encompasses a wide tech stack, including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, complemented by deep cloud expertise in **Azure** and **AWS**. I am well-versed in developing enterprise-grade platforms and integrating AI/ML capabilities for enhanced analytics and automation, ensuring alignment with industry compliance standards such as HIPAA and PCI DSS. My experience in **microservices architecture** and **CI/CD automation** further aids in delivering robust and secure applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Demonstrated **technical expertise** in delivering customized **Salesforce** and **Oracle** solutions tailored to customer needs, enhancing Customer Relationship Management (CRM) strategy.\n- Engaged in **market analysis** to identify opportunities for **RF**, **Wireless**, and **IoT** technologies, contributing to a **25% increase** in client acquisition over **12 months**.\n- Developed and presented comprehensive **technical solutions** that clearly articulate product benefits and ROI, leading to a **15% boost** in upsell opportunities during negotiations.\n- Collaborated with cross-functional teams to implement innovative **power technologies**, driving competitive advantages in client pitches and achieving **90% approval** ratings from stakeholders.\n- Conducted **negotiation** processes that effectively align technical features with customer priorities, resulting in **75%** of deals closed at or above target margins.\n- Delivered exceptional **communication** and presentation skills in sharing technical product knowledge, significantly shortening the sales cycle by **20%**.\n- Provided ongoing technical support post-sale, ensuring alignment with client goals and facilitating successful product adoption and satisfaction, evidenced by a **45%** improvement in customer feedback scores.\n- Produced technical documentation and training resources for clients, enhancing the overall user experience and reducing support requests by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided **technical expertise** in **Customer Relationship Management** by leading the development of tailored solutions that enhance client engagement and streamline sales processes.\nConducted **market analysis** to identify key opportunities, resulting in a **25% increase** in revenue through strategic negotiations and improved customer satisfaction.\nUtilized **salesforce** management to track sales metrics and customer interactions, achieving a **30%** improvement in sales forecasting accuracy.\nImplemented comprehensive **technical solutions** for clients leveraging **Oracle** and **IoT**, improving operational efficiency by **40%** and ensuring seamless integration across platforms.\nPresented complex **wireless** products and **power technologies** solutions to clients, resulting in a **50%** close rate on new business proposals.\nDeveloped strong relationships with clients through effective **communication** and negotiation skills, establishing trust and enhancing customer loyalty.\nParticipated in industry events and conferences, showcasing innovative solutions in **RF** technologies and building connections with key stakeholders.\nLeveraged in-depth knowledge of **technical solutions** to support sales teams in troubleshooting and resolving client issues quickly and efficiently."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Salesforce** and **Oracle** for managing customer relationship management (CRM) processes, ensuring a seamless integration of technical solutions tailored to client needs.\nConducted market analysis to identify customer requirements in the **IoT** and **Wireless** sectors, facilitating the development of targeted strategies that resulted in a **25%** increase in customer engagement.\nUtilized **RF** technology to enhance communication with clients, enabling proactive negotiation and addressing technical queries effectively, leading to a **30%** boost in sales conversion rates.\nDeveloped and presented comprehensive technical solutions to clients, utilizing excellent communication skills and deep technical expertise in **Power Technologies**, which resulted in successful contract negotiations valued at over **$1M**.\nCollaborated with cross-functional teams to deploy customer feedback loops, ensuring continual improvement of technical offerings and customer satisfaction metrics exceeding **90%**.\nImplemented training programs for junior sales engineers focused on the intricacies of **Customer Relationship Management** systems and negotiation techniques, thereby enhancing overall team performance.\nFostered relationships with clients through effective communication and follow-up strategies, contributing to long-term partnerships and repeat business opportunities that increased revenue by **15%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tNone\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Oracle\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Salesforce, RF, Wireless, IoT, Power Technologies, Customer Relationship Management, Technical Solutions, Negotiation, Market Analysis, Technical Expertise, Communication",
  "apply_company": "Arrow Electronics"
}