{
  "name": "Rei Taro",
  "role_name": "Senior Java Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Java Engineer with over 10 years of experience in creating robust backend systems leveraging **Java**, **Spring**, and REST APIs. Proficient in implementing SOA principles and employing software design patterns to enhance system architecture. Demonstrated expertise in delivering high-quality solutions through **Scrum**-based development methodologies and unit testing practices. Extensive background in financial platforms and automation tools. Proven ability to drive impactful projects at leading organizations, including VISA, Sii Poland, and Reply Polska, while cultivating high-performing and scalable services.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented **REST APIs** and developed scalable, service-oriented architecture (**SOA**) solutions using **Java** and **Spring** frameworks.\nDesigned and executed unit testing strategies to ensure code reliability and robustness, improving overall system quality by **30%**.\nCollaborated effectively within **Scrum** teams to drive project deliverables, ensuring timely completion of objectives and enhancing team productivity by **20%**.\nApplied key **software design patterns** throughout the development process to enhance maintainability and scalability of applications.\nParticipated in architectural discussions to align development methodologies with business goals, contributing to a successful system overhaul for a legacy application that reduced load times by **40%**.\nMentored junior developers in best practices for software development, fostering a culture of continuous improvement and innovation within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Java 11** and **Spring Boot** to develop robust backend systems, focusing on efficient implementation of **REST APIs** for seamless integration.\nApplied effective **software design patterns** to enhance application maintainability and scalability, resulting in a 30% reduction in code complexity.\nImplemented **unit testing** strategies to improve code quality, achieving over 85% code coverage across critical components.\nEngaged in **Scrum** methodology to foster an agile development environment, leading to a 20% increase in delivery efficiency during sprint cycles.\nDesigned and developed service-oriented architectures (SOA) to improve system interoperability and reduce overall latency by 15%.\nCollaborated with frontend developers using **Angular** to create responsive user interfaces, ensuring a cohesive customer experience across platforms.\nParticipated in rigorous code reviews and collaborative design sessions to uphold high standards of code quality and functionality.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Leveraged **Java** and **Spring** frameworks to develop and maintain high-performance backend services aligned with business requirements.\nDesigned and implemented **REST APIs** to enable seamless integration between backend and frontend systems, enhancing user experience utilizing **Angular**.\nApplied **SOA** principles to streamline application architecture, improving system scalability and maintainability.\nConducted thorough **unit testing** using advanced methodologies, ensuring code quality and functionality with a focus on test automation and coverage metrics.\nParticipated in **Scrum** methodology for efficient project management and timely delivery of functionalities, contributing to sprint planning and retrospectives.\nUtilized software design patterns to develop reusable components and modules, enhancing development efficiency and reducing redundancy in the codebase.\nAchieved a software performance improvement of **25%** and reduced bugs in production by **30%** through an iterative development process.\nCollaborated with cross-functional teams to document and enforce development standards, ensuring consistent implementation of best practices."
    }
  ],
  "skills": " **Programming Languages**\n\t Java, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\t Spring, FastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t Angular\n\n**API Technologies**\n\t REST APIs, REST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\t AWS (EC2, S3, Lambda), Azure\n\n**Other**\n\t AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Scrum, unit testing, software design patterns, development methodologies, PyTest, Git",
  "apply_company": "Nortal"
}