{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior AI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior AI Engineer with 13+ years of experience specializing in **Python**, **MachineLearning**, and proficient in frameworks such as **TensorFlow**, **PyTorch**, and **HuggingFace**. Expertise in data manipulation and analysis using **Pandas** and building models that leverage **LLM**, **LangChain**, and **ONNX** for efficient AI solutions. Skilled in applying AI ethics and ensuring data privacy throughout the development process. \nDemonstrated ability in delivering high-performance applications across the healthcare and financial industries, with a strong focus on predictive analytics, automation, and real-time processing. Proven experience in compliance-driven development, aligning with HIPAA, FHIR, PCI DSS, and SOC 2 standards. \nAdept in Agile methodologies, showcasing exceptional problem-solving and communication skills to collaborate effectively with cross-functional teams.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** along with **TensorFlow** and **PyTorch** to develop machine learning models for predictive analytics, ensuring compliance with **Data Privacy** and **AI Ethics** standards.\nCollaborated with cross-functional teams, employing **Agile** methodologies and strong **Communication** skills to drive project success and deliver high-quality AI solutions.\nEmployed **Pandas** for data manipulation and analysis, optimizing data pipelines to enhance model training processes.\nDesigned and implemented large-scale AI systems, integrating **HuggingFace** models for advanced **Machine Learning** tasks such as document classification and natural language processing.\nDeveloped effective problem-solving strategies to troubleshoot AI model discrepancies and enhance performance metrics across deployments.\nConducted thorough analyses of model performance, leveraging metrics to iterate and improve AI functionalities continuously.\nCreated technical documentation and presented findings to stakeholders, demonstrating technical and business acumen in **Machine Learning** innovations.\nMentored junior engineers, promoting knowledge sharing and fostering an innovative environment that encourages effective solutions to complex problems."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and implemented machine learning solutions using **Python**, **scikit-learn**, **XGBoost**, and **TensorFlow** to enhance fraud detection capabilities, improving detection rates by **30%**.\n- Utilized **Pandas** for data manipulation and analysis, optimizing data preprocessing pipelines for over **1 million** transactions.\n- Created and maintained robust ML pipelines for real-time credit scoring and churn prediction, integrated through **Airflow** and **MLflow**, resulting in a **40%** increase in timely decision-making.\n- Applied **AI Ethics** principles throughout model development stages to ensure compliance with **Data Privacy** regulations, positively impacting audit outcomes.\n- Engaged in clear and effective communication of complex AI concepts to cross-functional teams, fostering collaboration and enhancing project outcomes.\n- Participated in **Agile** methodologies, leading sprint planning, and retrospectives to refine project deliverables and ensure alignment with business goals.\n- Researched and implemented advanced NLP techniques utilizing **HuggingFace** and **LangChain** for innovative language model applications, improving processing speed by **25%**.\n- Collaborated with stakeholders to define and prioritize AI project roadmaps, ensuring alignment with strategic objectives and measurable business impact."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and advanced libraries such as **Pandas**, **TensorFlow**, and **PyTorch** to develop and optimize AI-driven features, enhancing overall platform functionality and performance by **30%**.\nEngineered and integrated machine learning models with frameworks like **HuggingFace** and **LangChain** to provide real-time insights and recommendations, improving user engagement metrics by **25%**.\nImplemented robust data privacy measures in accordance with GDPR, ensuring secure handling of sensitive information within AI applications, consequently reducing data breaches to **0%**.\nCollaborated with cross-functional teams in an **Agile** environment, applying strong communication and problem-solving skills to achieve project milestones ahead of deadlines by **15%**.\nDesigned and prototyped AI/ML algorithms that assess data inputs for quality and relevance, resulting in enhanced decision-making processes across the organization.\nConducted ongoing research in **AI Ethics**, ensuring that models comply with ethical standards and promoting responsible AI practices across all projects.\nUtilized **ONNX** for model interoperability, allowing flexibility and reliability in deploying models across various platforms and environments.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React\n\tJavaScript/TypeScript: Vue\n\tJavaScript/TypeScript: Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC)\n\tOAuth2\n\tJWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS\n\tAWS: RDS\n\tAWS: S3\n\tAzure: Blob Storage\n\tAzure: SQL Database\n\n**Other:**\n\tPandas\n\tMachine Learning\n\tLLM\n\tTensorFlow\n\tPyTorch\n\tHuggingFace\n\tLangChain\n\tONNX\n\tAI Ethics\n\tData Privacy\n\tProblem Solving\n\tCommunication\n\tAgile",
  "apply_company": "Resolve To Save Lives"
}