{
  "name": "Tomasz Lee",
  "role_name": "Senior LLM Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior LLM Engineer with 9+ years of comprehensive experience in microservices and event-driven design, specializing in scalable architecture and robust application development. Proficient in **Python**, **FastAPI**, **LangChain**, **LangGraph**, and **LangSmith**, with a strong background in cloud services including **AWS** and **Azure**. Extensive expertise in messaging queues such as **RabbitMQ** and **Apache Kafka**. Proven track record in leading technical roadmaps, code reviews, and providing mentorship to foster team growth. Exceptional skills in optimizing performance and streamlining development processes, driven by a commitment to delivering high-quality solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior LLM Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop scalable and high-performance web applications, enhancing application response times by **30%**.\nLed the design and implementation of **event-driven design** patterns with **LangChain**, improving system flexibility and maintainability.\nCrafted and optimized **microservices** architecture to support integration with diverse services and applications, ensuring seamless data flow across platforms.\nImplemented **AWS** and **Azure** cloud services to optimize application deployment and resource management, increasing operational efficiency by **25%**.\nIntegrated various **messaging queues** for asynchronous communication between services, enhancing system reliability and scalability.\nMentored junior developers, providing code reviews and fostering a culture of continuous improvement and knowledge sharing.\nOwned the technical roadmap for the development of cutting-edge solutions, aligning project goals with organizational objectives to ensure timely delivery of projects.\nContributed to the development of a reporting framework integrating with **LangGraph** and **LangSmith** for advanced data analysis and visualization.\nImplemented robust security protocols for application access, enhancing overall system security through best practices in authentication and authorization."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed high-performance APIs using **Python** and **FastAPI**, resulting in a 30% boost in request handling efficiency.\nDesigned and implemented **LangChain**, **LangGraph**, and **LangSmith** for rich application frameworks, enhancing the versatility of data processing.\nUtilized **AWS** and **Azure** platforms for cloud deployment, achieving a **99.9% uptime** rate for hosted services.\nCreated an event-driven architecture leveraging **Messaging Queues** for asynchronous task processing, improving system responsiveness by **40%**.\nLed mentorship initiatives, significantly elevating team competencies and satisfaction as measured by a **20% improvement** in performance reviews.\nConducted regular **code reviews** to enforce best practices and coding standards, leading to a **15% reduction** in bugs reported post-deployment.\nOwned the technical roadmap for future-proofing system architecture, ensuring alignment with corporate objectives and innovative strategies.\nCollaborated with cross-functional teams to define system requirements, facilitating timely delivery of projects with an **85% on-time completion** rate.\nDesigned microservices for modular functionalities, enhancing the scalability of applications by enabling independent deployment and updates.\nImplemented **RAG** strategies for risk assessment and management in ongoing projects, thus maintaining project timelines effectively."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed scalable microservices using **Python** and **FastAPI** to enhance system performance and resilience.\nDesigned and implemented event-driven architectures with **LangChain** and **LangGraph**, resulting in a 30% improvement in data processing speed for retrieval tasks.\nUtilized **AWS** and **Azure** services to enhance cloud functionality, ensuring high availability and reliability of applications.\nEstablished effective messaging queues with **RabbitMQ** for asynchronous communication, reducing latency by 15% during peak operations.\nMentored junior developers on best practices for code quality and architecture, leading to a 25% decrease in onboarding time.\nOwned and executed the technical roadmap for projects, aligning objectives with business goals and technology strategies across teams.\nConducted regular code reviews to uphold coding standards, improving overall codebase quality by 20%.\nIntegrated various third-party APIs to facilitate A2A communications, enhancing data interoperability and reducing manual entry by 40%.\nAuthored comprehensive technical documentation and user guides, boosting team knowledge sharing and onboarding efficiency.\nParticipated in agile processes, including daily standups and sprint planning, to ensure project milestones were met in a timely manner."
    }
  ],
  "skills": " **Programming Languages**\n\t Python\n\n**Backend Frameworks**\n\t FastAPI, NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\t HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD pipelines, Messaging queues\n\n**Cloud & Infrastructure**\n\t A2A, Event-driven design\n\n**Other**\n\t UX/UI Design, Git, GitHub, Redux, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Mentorship, Technical roadmap ownership, Code review, LangChain, LangGraph, LangSmith, RAG"
}