{
  "name": "Tomasz Lee",
  "role_name": "Senior SQA Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Senior SQA Engineer with 9+ years of comprehensive experience in Software Quality Assurance, specializing in Manual Testing, Test Case Creation, and Test Plan Organization. Proficient in using testing tools like **TestRail**, **Jira**, and **POSTMAN**, as well as methodologies such as Agile and BDD. Adept at both Black Box and Gray Box Testing techniques, with a strong focus on REST API Testing and Selenium. Possess a solid foundation in microservices architecture and distributed systems, leveraging knowledge of **Apache Kafka**, **RabbitMQ**, and **Redis** to understand complex application structures. Proven track record of enhancing solution quality and streamlining QA processes by fostering collaboration across teams and leading testing initiatives to successful outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior SQA Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted **manual testing** and **black box testing** to ensure software quality and compliance with user requirements.\nCreated and organized test plans and executed test case creation using **TestRail** to maintain thorough documentation and tracking of quality assurance processes.\nPerformed **REST API testing** using **POSTMAN**, validating functionality and performance, which led to a **30% reduction** in bug reports.\nWorked collaboratively within an **Agile** team environment, using **Jira** for issue tracking and sprint planning, enhancing team productivity by **15%**.\nImplemented **BDD** (Behavior Driven Development) techniques to improve collaboration between development and testing teams, increasing transparency in the testing process.\nUtilized **Selenium** and **Katalon** for automated testing solutions, which improved regression testing coverage by **50%.** \nEngaged in **gray box testing** and **white box testing** to validate integration points and internal logic, ensuring comprehensive test coverage.\nAchieved and maintained ISTQB certifications to stay current with software quality assurance best practices and methodologies.\nFostered continuous improvement within the QA process, reducing the overall defect rate by **20%** over six months."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Conducted comprehensive **Software Quality Assurance** processes, including **Manual Testing** and **REST API Testing** using **POSTMAN**, to ensure the reliability of developed features.\nDeveloped and organized detailed **Test Plans** and **Test Cases**, enhancing test coverage and clarity within the team.\nUtilized **Jira** for issue tracking and progress monitoring, contributing to a 30% increase in workflow efficiency during the SDLC.\nImplemented **Black Box**, **Gray Box**, and **White Box Testing** methodologies to evaluate functionality and performance across applications.\nLeveraged **TestRail** for managing test case documentation and reporting, achieving a 20% reduction in testing time.\nCollaborated in an **Agile** environment with regular sprint reviews to align testing efforts with development goals and timelines, ensuring prompt delivery of quality products.\nLed continuous integration testing efforts, particularly with **Selenium** and **Katalon**, resulting in a decrease in regression errors by **25%**.\nMentored junior testers on best practices and methodologies, fostering a culture of excellence and skill development within the team.\nEngaged in **Behavior Driven Development (BDD)** initiatives, working closely with development teams to enhance the testing process from the inception of software development.\nParticipated actively in code reviews, ensuring quality and adherence to best practices, which improved overall code performance and maintainability."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Implemented comprehensive **Software Quality Assurance (SQA)** strategies including Manual Testing and Automation Testing to ensure high-quality deliverables across various projects.\nUtilized **TestRail** and **Jira** for **Test Case Creation** and **Test Plan Organization**, improving test management efficiency by **30%**.\nExecuted **REST API Testing** with tools like **POSTMAN** to verify the functionality and reliability of backend services, achieving **95%** coverage on critical endpoints.\nConducted various testing methodologies such as **Black Box Testing**, **Gray Box Testing**, and **White Box Testing** to validate system behaviors and performance under different scenarios.\nEngaged in **Behavior-Driven Development (BDD)** practices to enhance collaboration between development and testing teams, leading to a **25%** reduction in defect rates.\nParticipated in **Agile** ceremonies including sprint planning and retrospectives to ensure continuous improvement and alignment with project timelines.\nUtilized **Selenium** and **Katalon** for automating acceptance tests, significantly decreasing regression testing time by **40%**.\nManaged the quality assurance lifecycle by developing detailed **Test Plans** and executing plan compliance checks.\nCollaborated with cross-functional teams to integrate testing efforts throughout the software development lifecycle, ensuring seamless communication and coordination.\nObtained **ISTQB** certification to validate professional expertise and adherence to international testing standards."
    }
  ],
  "skills": "  \n**Programming Languages**  \n\tJavaScript, TypeScript, Python, C#, Solidity  \n\n**Backend Frameworks**  \n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices  \n\n**Frontend Frameworks**  \n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS  \n\n**API Technologies**  \n\tRESTful API, GraphQL, REST API Testing, POSTMAN  \n\n**Serverless and Cloud Functions**  \n\t  \n\n**Databases**  \n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB  \n\n**DevOps**  \n\tAWS, Azure, CI/CD pipelines  \n\n**Cloud & Infrastructure**  \n\t  \n\n**Other**  \n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Manual Testing, TestRail, Jira, Software Quality Assurance, Black Box Testing, Gray Box Testing, White Box Testing, Test Case Creation, Test Plan Organization, BDD, Agile, Katalon, ISTQB",
  "apply_company": "Aylo"
}