{
  "name": "Rei Taro",
  "role_name": "Senior Support Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Support Engineer with a strong foundation in Customer Support and Technical Problem Solving. Proficient in leveraging **SaaS** solutions to enhance user experience and resolve technical issues efficiently. Experienced in utilizing **SQL** for data analysis and reporting, along with tools such as **Metabase**, **Zendesk**, **JIRA**, and **Linear** for project management and customer interaction. Known for a keen **Analytical Mindset** and excellent **Communication** skills to facilitate user-centric solutions. With over 10 years in backend development, I bring a wealth of expertise in designing cloud-native architectures and building scalable APIs with technologies like **Python** (**FastAPI**, **Django**, **Flask**) and cloud platforms (**AWS**, **Azure**), further complemented by a deep curiosity and commitment to continuous improvement in technical environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** to analyze customer queries and troubleshoot technical problems, ensuring high levels of **Customer Support** and satisfaction.\nDemonstrated strong **Technical Problem Solving** skills by accurately diagnosing 95% of issues reported through **Zendesk** and providing timely solutions.\nImplemented and optimized **SaaS** applications using **Metabase** for data visualization and reporting, resulting in a 30% improvement in team efficiency.\nManaged project tracking and issue resolution through **JIRA** and **Linear**, ensuring clear communication and enhanced collaboration with cross-functional teams.\nDeveloped and maintained integrations with **Sendgrid** to streamline customer communication, achieving a 20% increase in response rates.\nExhibited an **Analytical Mindset** by leveraging data and metrics to refine processes and improve service delivery, contributing to a 15% reduction in resolution times.\nFostered a culture of **Curiosity** within the team, encouraging exploration of new technical solutions and tools to enhance customer support operations."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilize **Zendesk** and **Metabase** to provide exceptional customer support and troubleshoot technical issues, ensuring user satisfaction across **9** support tickets daily.\nDemonstrate mastery in technical problem-solving by diagnosing and resolving **95%** of customer-reported issues on the first contact.\nEngage in effective communication with users, utilizing SQL to analyze data trends and enhance support strategies by capturing customer feedback across **3** main product lines.\nLeverage **JIRA** and **Linear** for project management, tracking resolution progress for more than **50** user inquiries each week.\nImplement customer-focused SaaS solutions, ensuring rapid deployment and ongoing improvements based on customer needs and feedback.\nShow analytical mindset by systematically gathering and synthesizing user feedback, improving support processes by up to **20%** through thoughtful iteration and adjustment.\nFoster curiosity by proactively seeking to understand complex issues, ultimately enhancing the quality of support provided to clients."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **SQL** for analyzing and optimizing customer data related to trade execution and portfolio management services, ensuring a seamless customer support experience.\nDeveloped technical solutions to resolve customer queries related to the backend services built on **Python**, **Flask**, and **PostgreSQL**, enhancing overall customer satisfaction.\nProvided ongoing support for SaaS applications by leveraging customer feedback and insights to drive iterative improvements.\nFacilitated communication between technical teams and clients using **JIRA** and **Zendesk**, documenting and resolving issues efficiently with a focus on customer problem solving.\nImplemented **Metabase** dashboards for analytics and reporting, improving internal decision-making processes with data-driven insights.\nDemonstrated an analytical mindset by troubleshooting technical issues and performing root cause analysis, ensuring high-quality platform performance meeting **MiFID II** and **GDPR** compliance.\nCollaborated with cross-functional teams to maintain and improve platform reliability, engaging in product discussions through **Linear**.\nMonitored and improved support workflows, utilizing tools like **Sendgrid** for customer communications and keeping response times under **24 hours**.\nGuided newer team members by sharing knowledge and encouraging a culture of curiosity and continuous learning within the support team."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices, Sendgrid\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tCustomer Support, Technical Problem Solving, SaaS, Zendesk, Metabase, JIRA, Linear, Analytical Mindset, Communication, Curiosity",
  "apply_company": "Sona"
}