{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior .NET Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-oriented Senior .NET Engineer with 13+ years of experience delivering high-performance applications, with a strong focus on compliance-driven development. Proficient in **.NET**, **C#**, and **Microsoft Azure SQL Database**, and skilled in frontend development utilizing **ReactJS** and backend technologies. Familiar with **Docker** and **Kubernetes (K8s)** for containerization and orchestration, as well as implementing CI/CD pipelines in cloud environments.\nExpert in leveraging **Azure AI services** for data-driven decision-making, while also applying **TypeScript** to enhance application scalability and maintainability. Experienced in managing Agile development processes using **SCRUM** methodologies. Proven track record in building AI/ML-powered platforms, supporting predictive analytics, and real-time processing. Well-versed in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and event-driven architectures. Noteworthy experience in MLOps, including model training and orchestration using **MLflow**, **Airflow**, and **Kubeflow** while aligning solutions with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior .NET Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **.NET** and **C#** to design and build scalable and secure applications for healthcare and fintech sectors, ensuring compliance with industry standards including HIPAA and PCI DSS.\nDeveloped robust applications using **ReactJS** (17–18) and **TypeScript** to create dynamic user interfaces that enhance user experience and engagement.\nImplemented cloud solutions utilizing **Microsoft Azure** and **Azure AI services** to provide secure data solutions and leverage AI for predictive analytics, achieving improved operational efficiency by over **30%**.\nDesigned and maintained databases using **Microsoft Azure SQL Database** to support data-driven applications, managing extensive datasets for real-time analytics.\nAdopted **Docker** and **K8s** for containerization and orchestration, simplifying deployment and enabling consistent environments across development and production with **95% uptime**.\nLed Agile development initiatives within a **SCRUM** framework, promoting collaboration across teams to increase project delivery speeds and enhance software quality.\nBuilt data pipeline integrations with **Apache SOLR** for enhanced search capabilities, enabling quick and effective retrieval of critical data in various applications.\nDeveloped and deployed CI/CD pipelines tailored for .NET applications, improving deployment frequency by incorporating automated testing and continuous integration practices.\nManaged source code using Git and maintained version control, facilitating team collaboration and ensuring code quality through regular reviews and improvements.\nPerformed performance tuning and optimization of existing applications, resulting in a **25%** increase in application responsiveness and efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **.NET** and **C#** to build and modernize core financial applications, enhancing scalability and robustness for high-volume transactional systems.\nDeployed applications within **Microsoft Azure** environments, leveraging **Azure SQL Database** for optimized data management and retrieval processes.\nDeveloped interactive front-end applications using **ReactJS** (18), incorporating **TypeScript** for type safety and maintenance, ensuring efficient and responsive user interfaces for financial tools and admin panels.\nImplemented CI/CD pipelines using **Docker** and **K8s (Kubernetes)** for streamlined deployment and management of microservices, achieving a **50% reduction** in deployment times.\nParticipated in **SCRUM** methodologies for agile project management, improving developmental workflows and ensuring timely delivery of features.\nEnhanced system performance and user experience by optimizing code and database queries, achieving a **35% increase** in application responsiveness.\nLeveraged **Azure AI services** to create intelligent features that deliver real-time insights into user transactions and enhance decision-making processes.\nConducted regular performance reviews and optimizations on **Apache SOLR**, increasing search efficiency within applications and decreasing response times by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered scalable backend solutions utilizing **.NET** and **C#**, ensuring high performance and reliability across functionalities, including transaction processing and user management within the platform.\nImplemented enterprise-level cloud solutions leveraging **Microsoft Azure** and **Azure SQL Database** for efficient data management, processing, and storage, effectively supporting 24/7 operations with **99.9%** uptime.\nDesigned and developed responsive web applications using **ReactJS** and **TypeScript**, enhancing user interfaces for both desktop and mobile devices to achieve a **30%** increase in user engagement.\nUtilized containerization strategies with **Docker** and orchestration via **Kubernetes (K8s)** to streamline deployment processes, resulting in a **40%** reduction in deployment time and improved scalability of applications.\nApplied search engine optimization techniques and configured **Apache SOLR** for enhanced searching capabilities, leading to a **25%** improvement in search query response times for users.\nCollaborated with cross-functional teams using **SCRUM** methodologies to ensure timely delivery of new features and product releases, driving a **15%** improvement in team productivity.\nLeveraged Azure AI services to integrate intelligent features into applications, providing personalized experiences and leveraging machine learning to improve operational efficiency.\n\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, .NET, Python, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, ReactJS, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, Azure AI services\n\n**Databases:**\n\tMicrosoft Azure SQL Database, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes (K8s), GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: S3, RDS, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, SCRUM, Nginx, Let’s Encrypt, Certbot, Apache SOLR",
  "apply_company": "ABB"
}