{
  "name": "Tomasz Lee",
  "role_name": "Back-end Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Proficient Back-end Developer with 9+ years of experience specializing in developing and implementing robust applications using **Golang**, **Java**, **PostgreSQL**, **MySQL**, and **Microservices** architecture. Expertise includes building RESTful and gRPC services while optimizing performance using **Kubernetes**, **Docker**, and cloud services like **AWS**. Highly skilled in automated testing, code reviews, and ensuring data protection and security standards are met. Demonstrated ability to enhance development processes and collaborate effectively in remote environments, all while delivering high-quality solutions on time.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Back-end Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and maintained microservices using **Golang** and **Java** to improve application scalability and effectiveness.\nImplemented REST and **gRPC** APIs for seamless communication between services, enhancing system performance and reliability.\nUtilized **PostgreSQL** and **MySQL** for database management, achieving a data retrieval efficiency improvement of 30%.\nWorked with **Kubernetes** for container orchestration, ensuring high availability and automated deployment of services.\nManaged CI/CD workflows using **Github Actions** and **Bazel**, which accelerated deployment cycles by 50%.\nConducted thorough code reviews and implemented **automated testing** strategies, resulting in a reduction of bugs by 25%.\nMonitored application performance using **Datadog**, addressing performance bottlenecks and enhancing the reliability of the system.\nEnsured application security and data protection by implementing best practices in authentication, authorization, and encryption techniques.\nCollaborated in a remote team setting, demonstrating strong communication skills to align project goals and milestones.\nParticipated in the architectural design of new features ensuring adherence to microservices principles and best practices."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and maintained microservices architecture utilizing **Golang** and **Java**, enhancing system scalability and flexibility.\nImplemented RESTful APIs integrating with both **PostgreSQL** and **MySQL** databases for efficient data retrieval and management.\nEmployed **Docker** for containerization of applications, streamlining deployment processes and ensuring consistency across development environments.\nUtilized **Kubernetes** for orchestration of containerized applications, improving resource management and uptime.\nIntegrated CI/CD practices using **GitHub Actions**, resulting in a **30%** reduction in deployment errors.\nConducted thorough code reviews and provided mentorship to junior developers, fostering a culture of quality and continuous improvement in coding standards.\nImplemented **gRPC** for efficient inter-service communication, reducing latency in data queries.\nEnsured data protection and security compliance through rigorous testing and best practices, contributing to a more secure application environment.\nCollaborated with cross-functional teams to define system requirements and project scope, supporting timely delivery of development milestones.\nDeveloped and executed automated tests, enhancing code reliability and performance validation prior to release.\nMaintained communication with remote teams to facilitate coordination efforts, effectively managing project timelines and expectations."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and maintained microservices architecture utilizing **Golang** and **Java**, enhancing system scalability and performance by **30%**.\nImplemented REST and gRPC to optimize API communication, increasing response speed by **15%** and improving client interactions.\nDesigned and managed databases with **PostgreSQL** and **MySQL**, leading to a **25%** reduction in data retrieval time through optimized query practices.\nLeveraged **Kubernetes** for container orchestration and deployment, ensuring **99.9%** uptime for critical applications.\nUtilized **AWS** for cloud deployment, reducing infrastructure costs by **20%** while improving application reliability.\nIntegrated **Docker** to streamline CI/CD processes, allowing rapid deployment cycles through automated builds using **Github Actions**.\nConducted thorough code reviews, enforcing coding standards and best practices to maintain code quality and security.\nImplemented automated testing strategies to increase software reliability and reduce bugs by **40%** in production releases.\nMaintained a strong focus on security and data protection, ensuring systems comply with best practices and industry regulations.\nCommunicated effectively in a fully remote environment, facilitating collaboration across teams and ensuring alignment with project goals."
    }
  ],
  "skills": "🚀 **Programming Languages**\n\tGolang, Java, JavaScript, TypeScript, Python\n\n🚀 **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Microservices\n\n🚀 **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n🚀 **API Technologies**\n\tRESTful API, GraphQL, gRPC\n\n🚀 **Serverless and Cloud Functions**\n\tAWS\n\n🚀 **Databases**\n\tPostgreSQL, MySQL, MongoDB, DynamoDB, CosmosDB, MSSQL Server\n\n🚀 **DevOps**\n\tDocker, Kubernetes, CI/CD pipelines, Git, GitHub, GitHub Actions, Bazel, Datadog\n\n🚀 **Cloud & Infrastructure**\n\tAzure\n\n🚀 **Other**\n\tSecurity, Data Protection, Code Reviews, Automated Testing, UX/UI Design, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Remote Work, Communication Skills"
}