{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Mechanical Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a highly skilled Senior Mechanical Engineer with a robust background in **3D CAD**, **CATIA V5**, **Siemens NX**, **SolidWorks**, and **Creo**, I offer 8 years of experience in delivering innovative mechanical designs and solutions. My expertise extends to Product Lifecycle Management (PLM) using **3DExperience**, **Enovia**, **Teamcenter**, and **Windchill**, ensuring efficient project management and collaboration throughout the design process.\nI have a proven track record in advanced analysis techniques including **FEA** and **CFD**, enabling the development of high-quality products while adhering to industry standards and best practices. My process-oriented approach emphasizes **additive manufacturing** and **rapid prototyping**, combined with a strong command of GD&T and design for manufacture and assembly, optimizing product feasibility and manufacturability.\nAdditionally, I excel in problem-solving and time management, leveraging effective communication and collaboration skills to foster teamwork and drive project success.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Mechanical Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **3D CAD** software such as **CATIA V5**, **Siemens NX**, and **SolidWorks** to design and develop complex mechanical systems that optimize manufacturing processes and assembly efficiency.\nConducted **FEA** and **CFD** simulations to validate and improve product designs, ensuring compliance with industry standards and performance requirements for **additive manufacturing** and **rapid prototyping** projects.\nDeveloped detailed design documentation and drawings following **GD&T** principles to facilitate clear communication between engineering and manufacturing teams, resulting in a reduction of errors by **20%** in the production phase.\nCollaborated with cross-functional teams to implement **PLM** solutions on platforms like **3DExperience**, **Enovia**, and **Teamcenter**, leading to enhanced product lifecycle management and reducing time-to-market by **15%**.\nApplied effective problem-solving techniques and conducted **tolerance analysis** to refine designs, leading to improved fits and assemblies in final products.\nLed workshops to educate team members on **design for manufacture** and **design for assembly** best practices, fostering a culture of continuous improvement and collaboration within the engineering team.\nManaged project timelines and deliverables effectively, utilizing robust **time management** skills to oversee multiple projects, resulting in consistent on-time delivery of mechanical engineering solutions.\nDeveloped prototypes to test theoretical designs, utilizing hands-on skills in **additive manufacturing** and iterative testing to enhance product development cycles by **30%**.\nEngaged in regular communication with stakeholders to gather feedback and drive design improvements, ensuring final products met or exceeded client expectations.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Led the design and development of mechanical components using **3D CAD** tools such as **CATIA V5**, **Siemens NX**, and **SolidWorks**, improving manufacturing efficiency and product quality through precision design methodologies.\nUtilized finite element analysis (**FEA**) and computational fluid dynamics (**CFD**) to evaluate product performance and optimize designs, achieving a **30%** reduction in prototype iterations.\nCollaborated with cross-functional teams to implement **PLM** practices using **3DExperience** and **Teamcenter** for better project tracking and version control, enhancing communication and collaboration across departments.\nConducted tolerance analysis and GD&T practices to ensure manufacturability and assembly efficiency, leading to a **20%** decrease in assembly time.\nExecuted rapid prototyping and additive manufacturing techniques for innovative design iterations, shortening the development cycle by **25%** and increasing project delivery speed.\nApplied problem-solving skills to address and resolve design challenges, utilizing analytical tools and methodologies in the engineering workflow.\nManaged project timelines effectively, ensuring adherence to schedules and deliverables in a fast-paced, continuous improvement environment."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **3D CAD** software including **CATIA V5**, **Siemens NX**, and **SolidWorks** to design and develop mechanical components, ensuring precision and functionality for complex engineering projects.\nExecuted detailed tolerance analysis and **GD&T** principles for ensuring manufacturability and assembly efficiency in products, achieving a **15% reduction** in production time.\nImplemented **PLM** solutions such as **Teamcenter** and **Enovia** to streamline product lifecycle management processes, enhancing collaboration among teams and maintaining data integrity across the board.\nApplied **FEA** and **CFD** analysis techniques to predict and improve product performance under real-world conditions, resulting in **20%** increase in design reliability and durability.\nLed rapid prototyping initiatives using **additive manufacturing** technologies, reducing prototype cycle time by **40%** while maintaining high-quality standards.\nFacilitated communication and collaboration across interdisciplinary teams to address engineering challenges and optimize designs, fostering an environment of collective problem-solving.\nManaged time effectively, prioritizing tasks to meet tight deadlines in project timelines, and ensuring deliverables are met with quality in mind.\nConducted regular design reviews and technical presentations to stakeholders, enhancing project visibility and ensuring alignment with strategic objectives.\nDrove innovative design for manufacture and design for assembly practices, streamlining production processes and reducing costs by **25%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tNginx, Certbot\n\n **Other:**\n\t3D CAD, CATIA V5, Siemens NX, SolidWorks, Creo, PLM, 3DExperience, Enovia, Teamcenter, Windchill, FEA, CFD, additive manufacturing, rapid prototyping, GD&T, design for manufacture, design for assembly, tolerance analysis, problem-solving, communication, collaboration, time management",
  "apply_company": "Lumina"
}