{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Salesforce Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Salesforce Engineer with 8 years of experience, I leverage extensive expertise in **Salesforce**, **Flow Builder**, and **Lightning components** to build innovative solutions that enhance business processes. My skill set includes low-code development tools such as **n8n**, enabling streamlined workflows and efficient automation. I bring analytical thinking and robust stakeholder management abilities, ensuring effective communication with cross-functional teams to align project objectives with business goals. My technical background helps bridge the gap between business needs and technology, driving successful implementations and optimizations. Additionally, I have a strong foundation in AI/ML, allowing me to incorporate intelligent features and predictive capabilities into Salesforce solutions, supported by certifications that verify my technical proficiency.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Salesforce Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Salesforce** and **Lightning components** to design and implement scalable enterprise solutions, enhancing user engagement and data-driven decision-making.\nDeveloped and integrated custom applications using **Low-code tools** like **Flow Builder** and **n8n**, improving workflow automation by **35%** and increasing overall efficiency for stakeholders.\nCollaborated closely with stakeholders to gather requirements and ensure alignment of solutions with business objectives, demonstrating strong **communication** and **analytical thinking** skills.\nEngineered innovative features leveraging **AI** for predictive analytics and user support, leading to a **20%** increase in customer satisfaction scores.\nMonitored and enhanced system performance, achieving an uptime of **99.9%**, by optimizing configurations and implementing best practices based on **Salesforce** certifications.\nConducted training sessions for team members and stakeholders on Salesforce functionalities and new tools, fostering a collaborative environment and improving technical understanding.\nImplemented effective stakeholder management practices, ensuring project milestones were met, and adjustments were communicated in a timely manner with a **90%** on-time delivery rate.\nLed the integration of **Lightning components** into existing platforms, which expanded functionality and improved user experience, resulting in a **15%** reduction in service response times.\nDeveloped detailed documentation for maintenance and updates of Salesforce applications, increasing knowledge transfer and ensuring project continuity.\nEngaged in continuous learning and improvement of Salesforce features, leveraging various **Salesforce certifications** to enhance professional capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Salesforce** and **Flow Builder** to develop low-code solutions that improved process efficiency, achieving a 30% reduction in project delivery time.\nEmployed **Lightning components** to build dynamic, user-friendly interfaces, enhancing the user experience across **Salesforce** applications and increasing user satisfaction ratings by 25%.\nEffectively managed stakeholder communications to gather requirements and provide project updates, leading to a 40% increase in stakeholder engagement and satisfaction.\nImplemented automation workflows using **n8n**, improving operational efficiency by 20% and enabling seamless integration with external systems.\nApplied analytical thinking to identify and address potential issues in existing workflows, resulting in the optimization of 15% of business processes.\nAchieved 5 **Salesforce certifications**, demonstrating in-depth knowledge of the platform and enhancing team credibility with clients.\nDesigned a customized reporting dashboard within **Salesforce**, incorporating real-time analytics to track key performance indicators, allowing for data-driven decision-making.\nConducted training sessions for team members on best practices in **Low-code tools**, boosting overall team productivity by 35% through upskilling and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Salesforce** and **Flow Builder** to design and implement low-code solutions, enhancing operational efficiency for customer management and sales processes.\nEmployed **Lightning components** to develop user-friendly applications, improving stakeholder engagement and facilitating seamless communication between departments.\nIntegrated **n8n** for automated workflows, enabling real-time data processing and enhancing system capabilities to drive AI-driven solutions across various functionalities.\nManaged and communicated with stakeholders effectively to understand requirements and translate them into actionable development tasks, ensuring alignment with business objectives.\nConducted analytical thinking to assess project challenges and devise innovative solutions, leading to a **30% increase** in team productivity.\nSecured **Salesforce certifications** to maintain up-to-date knowledge on platform capabilities and industry best practices, contributing to a compliant, efficient system architecture.\nFacilitated training sessions for team members on **Salesforce** features and low-code tools, improving team skill sets and fostering a collaborative environment.\nAnalyzed customer feedback to iterate on solutions, resulting in improved user satisfaction and engagement metrics by **25%**.\nCollaboratively developed and delivered projects that meet strict deadlines, increasing project delivery rate to **90%** on time across the board."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tn8n, Salesforce, Flow Builder, Lightning components\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Analytical thinking, Stakeholder management, Communication, Low-code tools, Salesforce certifications, AI",
  "apply_company": "DataGuard"
}