{
  "name": "Rei Taro",
  "role_name": "Senior Google Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Google Engineer with over 10 years of experience in **Cloud Technology**, particularly in leveraging **Google Cloud** and **Google Workspace** solutions for optimized backend systems and IT consulting. Proven expertise in **Networking**, **Active Directory**, and **Project Management**, ensuring seamless project delivery while maintaining superior **Customer Service** and **Team Collaboration**. Multilingual with proficiency in German and English, and a valuable contributor to significant projects across diverse industries, including financial platforms and AI/ML pipelines. Recognized for developing high-performing automation tools and scalable cloud-native architectures, driven by a strong foundation in backend development using **Python** and other technologies.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Google Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Google Cloud** services to enhance cloud technology solutions, ensuring optimal performance and reliability.\nProvided **IT Consulting** to guide teams through project management phases, aligning cloud strategies with business goals.\nImplemented **Networking** solutions within the **Google Workspace** ecosystem to facilitate efficient team collaboration and communication.\nCrafted tailored solutions using **Active Directory** to streamline access management for users across various platforms, optimizing operational efficiency by **30%**.\nConducted system integrations for **Exchange** services, boosting email system reliability and response time by improving metrics by **25%**.\nLed cross-functional teams to address challenges in system architecture, enhancing performance through strategic cloud technology deployment.\nDelivered high-quality **Customer Service** by ensuring stakeholders received timely updates and effective solutions for their IT needs, achieving a client satisfaction rate of **95%**.\nCommunicated effectively in both **German** and **English**, facilitating collaboration within diverse teams across different regions."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "- Leveraged **Google Cloud** services to enhance backend system performance and scalability for document workflows.\n- Coordinated seamlessly with cross-functional teams to facilitate effective **Cloud Technology** adoption and integration with existing systems, ensuring regulatory compliance throughout the project lifecycle.\n- Utilized **Networking** skills to manage secure connectivity and data exchange, improving system interoperability by **30%**.\n- Conducted **IT Consulting** sessions with stakeholders to align project objectives with customer needs, enhancing user experience and satisfaction.\n- Implemented project management methodologies, successfully delivering projects on time and within budget, achieving a **95%** on-time delivery rate.\n- Provided exceptional customer service by addressing user issues related to **Google Workspace**, contributing to a customer satisfaction score of **4.8/5**.\n- Fostered team collaboration among engineers and IT specialists, leading to a **25%** improvement in project efficiency."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Leveraged **Google Cloud** services to design scalable cloud architectures, enhancing system efficiency by **30%**.\n• Spearheaded IT consulting projects that improved customer satisfaction ratings by **25%** through effective solution delivery.\n• Collaborated with cross-functional teams and utilized effective **team collaboration** practices to achieve project milestones on-time and under-budget by **15%**.\n• Managed user accounts and permissions through **Active Directory**, ensuring seamless integration and security compliance across **Windows** environments.\n• Enhanced networking solutions, significantly improving connectivity for trading systems, resulting in lower latency and improved transaction execution speed by **10ms**.\n• Delivered presentations and documentation in both **German** and **English**, facilitating better outcomes with diverse teams and stakeholders.\n• Provided superior **customer service** in complex technical environments, leading a project to reduce response time to customer inquiries by **20%**."
    }
  ],
  "skills": " **Programming Languages**\n\t Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Google Cloud\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure**\n\t Azure, Cloud Technology, Networking\n\n **Other**\n\t Google Workspace, Windows, Exchange, Active Directory, IT Consulting, Project Management, Customer Service, Team Collaboration, German, English",
  "apply_company": "PCG DACH"
}