{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Customer Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior Customer Engineer with 8 years of experience specializing in customer success through effective communication and collaboration. Proficient in SQL, API development, and SaaS solutions, with hands-on experience in integrating CRM and ERP systems. Adept at utilizing tools like Intercom and Slack to enhance customer interaction and engagement.\nCombining technical acumen with a strong foundation in **JavaScript/TypeScript**, **Python**, and **Flutter**, I develop high-performance solutions that bolster customer satisfaction in the healthcare and financial sectors. My expertise in full-stack development includes working with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.\nWith a solid background in cloud services including **Azure** and **AWS**, I have led the creation of enterprise-grade platforms integrating advanced technologies for predictive analytics and real-time data processing. My experience encompasses designing and implementing microservices architecture, event-driven systems, and CI/CD automation, ensuring robust security and adherence to compliance standards like HIPAA and PCI DSS. I also possess practical knowledge in developing machine learning pipelines and MLOps workflows leveraging tools such as **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **SQL** to query and optimize data storage and retrieval processes, enhancing the efficiency of customer success operations.\nDesigned and maintained robust **API** integrations to connect **SaaS** solutions with CRM and ERP systems, improving data flow between platforms.\nImplemented automated workflows and integrations using **Intercom** and **Slack**, enhancing team communication and collaboration for better customer support.\nDemonstrated strong customer success initiatives by adapting workflows to streamline user experiences, leveraging **curiosity** to explore and implement optimal solutions.\nFostered a team-oriented environment by leveraging **communication** skills, ensuring a collaborative approach to problem-solving and engineering tasks.\nEmployed adaptability in addressing client needs and evolving project requirements, showcasing agility in software delivery and support.\nParticipated actively as a **team player** during cross-functional projects, contributing to timely and high-quality deliverables for clients.\nOptimized operational efficiency through seamless **ESP** integration, allowing for enhanced customer engagement and feedback collection.\nUtilized metrics to measure customer satisfaction and success, leading to a **30%** improvement in resolution times.\nChampioned the usage of customer feedback tools and methodologies, leading to a **25%** increase in customer retention through data-driven decisions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** to manage and optimize databases for enhanced data retrieval and reporting in customer-focused applications, ensuring efficient and effective data handling for financial operations.\nDeveloped and integrated **APIs** for seamless communication between various services, enhancing the interoperability of financial platforms and improving user experiences across **SaaS** applications.\nCollaborated with multi-functional teams via **Slack** and **Intercom** to gather customer feedback and ensure alignment with customer success goals, improving communication efficiency by **30%**.\nExhibited adaptability and curiosity by quickly mastering and implementing new technologies, contributing to the overall success of the team and boosting project delivery rates by **25%**.\nEngaged in proactive customer success strategies, leveraging **CRM** insights to tailor solutions that address specific client needs, contributing to a **15%** increase in customer satisfaction metrics.\nCoordinated with teams to ensure integration of **ERP** and **ESP** systems, streamlining processes and providing holistic solutions for clients.\nDemonstrated exceptional teamwork and communication skills by mentoring junior engineers and promoting a collaborative environment, resulting in a more productive team atmosphere and reduced onboarding time by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Utilized **SQL** for efficient database querying and management, ensuring data integrity and optimizing performance for customer success initiatives.\n- Developed and maintained **API** integrations with **CRM** systems and various **SaaS** products, enhancing communication and collaboration tools such as **Intercom** and **Slack** among teams.\n- Collaborated with cross-functional teams to drive customer success, demonstrating strong communication skills and adaptability in addressing customer needs and requirements.\n- Applied critical thinking and curiosity to analyze customer feedback, enabling continuous improvements in service delivery and product offerings.\n- Participated as a vital **team player** in projects aimed at developing scalable and effective solutions, contributing to the overall success of the organization.\n- Managed integrations with data platforms to track customer interactions, leveraging analytics to inform product and service enhancements, improving customer engagement metrics by **15%** in **2023**.\n- Designed customer support workflows that increased response time by **25%**, utilizing tools such as **Intercom** for streamlined communication.\n- Conducted training sessions for the team on the best practices for leveraging customer data, resulting in enhanced collaboration and knowledge sharing across departments.\n- Developed documentation and resources to improve onboarding and process workflows for new team members, facilitating a smoother transition with a **30%** reduction in onboarding time.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Azure Functions\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, SaaS, CRM, ESP, ERP, Intercom, Slack, customer success, communication, team player, adaptability, curiosity",
  "apply_company": "Hightouch"
}