{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Software Engineer with 10+ years of experience specializing in developing high-performance software solutions. Proficient in modern programming languages and frameworks such as **Java**, **Spring**, **TypeScript**, **React**, **Angular**, **Python**, and **Go**. Deep expertise in building scalable applications using diverse technologies, including **Kubernetes**, **Vue.js**, and **Apache Kafka**. Strong skills in operating within a **Linux** environment and leveraging **Helm** for application deployment. Proven ability to lead the development of enterprise-level platforms with an emphasis on microservices architecture, CI/CD automation, and cloud-native applications. Experienced in deploying solutions on platforms like Azure and AWS, ensuring compliance with standards such as HIPAA and PCI DSS. Brings practical experience in MLOps—from developing ML pipelines to managing workflows—with tools like MLflow and Airflow. Passionate about creating robust systems that not only function technically but also deliver significant real-world value.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable, full-stack solutions leveraging **Java**, **Spring**, **React**, and **TypeScript**, adhering to regulatory standards like HIPAA and GDPR in healthcare and finance domains.\n• Implemented microservices architecture using **Kubernetes** for deployment, ensuring high availability and scalability of applications.\n• Designed high-performing web applications with **Angular** and **Vue.js**, enhancing user experience and engagement in fintech platforms.\n• Automated deployment processes utilizing **Helm** and continuous integration tools to streamline releases while maintaining code quality.\n• Built robust data pipelines using **Apache Kafka** for real-time data processing and analytics, optimizing transaction monitoring in financial applications.\n• Collaborated with cross-functional teams to integrate **Python** for backend functionality, improving response times and system efficiency.\n• Enhanced application performance through efficient use of **Linux** operating environments, reducing downtime by **30%**.\n• Established comprehensive testing frameworks using **Jest** and **Cypress**, achieving **95%** unit test coverage across services.\n• Developed advanced analytics dashboards facilitating data-driven decision-making, leading to a **25%** increase in operational efficiency.\n• Enhanced system reliability and performance, achieving a **99.9%** uptime with efficient management of deployment processes and environments.\n• Provided mentorship to junior developers, improving team productivity and coding standards through pair programming and code reviews.\n• Integrated third-party APIs for enhanced system capabilities, reducing development time by **15%** with strategic vendor selection and integration planning."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring** frameworks to enhance backend service performance and reliability in scalable applications, achieving a **20%** reduction in response times.\nDesigned and developed responsive user interfaces using **Angular** and **React** (v18) alongside **TypeScript**, focusing on improving user engagement and accessibility in financial applications.\nImplemented container orchestration using **Kubernetes** for streamlined deployment, scaling, and management of applications, resulting in an operational cost reduction of **15%**.\nIntegrated messaging systems such as **Apache Kafka** and **RabbitMQ** to create a reliable event-driven architecture that supports asynchronous processing and enhanced system reliability.\nCollaborated with cross-functional teams to create and maintain CI/CD pipelines using **Helm** for managing Kubernetes applications, deploying updates to production with **zero downtime**.\nEngaged in systems design and troubleshooting on **Linux** servers to optimize application performance and security, effectively resolving **95%** of critical issues on the first attempt.\nDived into developing advanced data processing and machine learning models with **Python** for detecting fraud and predictive analytics, successfully increasing detection rates by **25%**.\nContributed to the architectural design of applications using **Go** for optimizing high-performance systems, ensuring fast and efficient handling of financial transactions.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Spring** to develop and optimize backend services for a global e-commerce platform, ensuring high availability and scalability across key modules like checkout, cart, and order fulfillment.\nLeveraged **Kubernetes** for container orchestration, facilitating seamless deployment and management of microservices, improving overall system reliability and performance.\nEngineered real-time features with **Apache Kafka**, enabling responsive order updates and dynamic inventory tracking, enhancing customer support experiences.\nDeveloped high-performance frontend applications using **React**, **Angular**, and **Vue.js**, enhanced with **TypeScript** and optimized for both web and mobile access, resulting in faster, more engaging user experiences.\nImplemented **Linux** as the foundational operating system for development and deployment environments, ensuring consistent, efficient resource management.\nIntegrated caching strategies using **Redis**, reducing application response times by **30%** and lightening the load on primary databases.\nUtilized **Go** for microservices development, enhancing application performance and improving team productivity with simplified concurrency features.\nDeployed feature flags and blue-green deployments leveraging **Kubernetes** namespaces, allowing for controlled rollouts and effective A/B testing.\nCreated responsive, SEO-friendly e-commerce UIs using **Angular** and **HTML5/CSS3**, adhering to mobile-first designs and WCAG 2.1 accessibility standards.\nImplemented secure payment processing systems integrated with services like Stripe and PayPal, with a focus on PCI compliance and safeguarding sensitive transaction data.\nApplied role-based access control (RBAC) and **OAuth 2.0** for security protocols, ensuring GDPR compliance and robust user data protection throughout the platform."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, Go, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tSpring, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Angular, Vue.js\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n**Cloud & Infrastructure:**\n\tLinux\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "WALTER GROUP"
}