{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior AI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior AI Engineer with over 13 years of experience specializing in AI, machine learning, and cloud architectures. Proficient in **Python**, with advanced skills in **C++**, **PyTorch**, and **ONNX** for building and deploying neural networks and high-performance computing solutions. Experienced in data processing frameworks and leveraging **cloud-native** systems to optimize performance tuning and automation.\n\nDemonstrated ability to develop and implement machine learning models, ensuring effective problem-solving and collaboration across cross-functional teams. Strong focus on integrity and autonomy in delivering compliant solutions that meet industry standards. Proven success in creating AI/ML-powered applications with predictive analytics and real-time processing capabilities.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and deployed AI solutions leveraging **Python**, **C++**, **PyTorch**, and **ONNX** to enhance performance tuning and high-performance computing capabilities in existing systems.\n- Designed machine learning models that utilize **neural networks** for advanced data processing, resulting in a **20% improvement** in predictive accuracy compared to previous implementations.\n- Collaborated with cross-functional teams to integrate cloud architectures, ensuring scalability and reliability across **AWS** and **Azure** environments.\n- Conducted rigorous performance tuning and optimization efforts that led to a **30% reduction** in computation times for data processing frameworks.\n- Implemented autonomous systems leveraging AI to enhance data processing workflows while maintaining a focus on integrity and compliance with industry standards.\n- Optimized algorithms for real-time decision-making in complex environments, applying problem-solving skills to tackle unique challenges in machine learning.\n- Fostered collaboration within teams to develop cutting-edge AI features resulting in substantially improved accuracy in real-time applications.\n- Enhanced existing workflows by integrating state-of-the-art models into operational systems, thereby increasing efficiency in data-driven decision-making processes."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and implemented **machine learning** models for fraud detection using **Python**, **scikit-learn**, **XGBoost**, and **Azure ML**, enhancing transaction security and generating proactive alerts for suspicious activities.\n• Designed and built robust **cloud architectures** utilizing **Azure** and **Kafka** for real-time data processing and event-driven workflows, improving system reliability by **30%**.\n• Leveraged **data processing frameworks** and ETL pipelines with **Apache Airflow** and **Azure Data Factory** for ingesting and processing financial data, achieving a throughput of **1,000 transactions per minute** in batch and real-time scenarios.\n• Optimized performance tuning for **neural networks** and machine learning algorithms, resulting in a **15%** increase in model accuracy and reducing inference time by **25%**.\n• Collaborated with cross-functional teams to ensure seamless integration of **AI** solutions with existing financial platforms, fostering a culture of **collaboration** and **integrity** in all projects.\n• Utilized **C++** to enhance the performance of critical components in AI workflows, ensuring high-performance computing capabilities and responsiveness at scale.\n• Conducted extensive problem-solving sessions to address and troubleshoot system bottlenecks, improving overall system efficiency by **20%** while maintaining autonomy in project delivery."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** to develop AI-driven backend services, enhancing performance in machine learning tasks and supporting high-performance computing capabilities for real-time data processing.\nEngineered neural network models using **PyTorch** and **ONNX**, applying advanced algorithms to optimize data processing frameworks, resulting in a **25%** increase in model accuracy and efficiency.\nCollaborated with cross-functional teams to troubleshoot and resolve complex AI/ML challenges, demonstrating strong problem-solving skills and a commitment to integrity and excellence.\nDesigned scalable cloud architectures that improved processing speeds by **30%**, implementing strategies for disaster recovery and data redundancy.\nConducted performance tuning for AI applications, enhancing execution speeds and responsiveness, which significantly reduced time-to-insight for critical data analysis tasks.\nApplied advanced machine learning techniques in real-time applications, producing solutions that handled **1M+** data points efficiently and effectively.\nActively participated in peer code reviews and knowledge-sharing sessions, promoting a culture of collaboration and continuous improvement within the team.\nMaintained autonomy while driving projects forward, ensuring timely delivery while adhering to project specifications and quality standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C++\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tNginx, Let’s Encrypt, Certbot, Keycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tCloud architectures\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, AI, machine learning, neural networks, data processing frameworks, high-performance computing, performance tuning, problem-solving, collaboration, integrity, autonomy",
  "apply_company": "Ampere"
}