{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a dedicated Senior Sales Engineer with a strong emphasis on Cybersecurity solutions, I bring extensive knowledge in Cloud Security, SASE, Proxy, IPS, DLP, CASB, and CNAPP. With 8 years of experience in the tech industry, I leverage my technical acumen to drive value selling through effective presentations and demonstrations, aiding clients in understanding the importance of robust security practices. My hands-on experience with compliance standards, including CISSP and CCNP, enhances my ability to deliver tailored security solutions that meet complex enterprise needs.\n\nIn my previous role as a Full Stack Developer, I specialized in building high-performance applications across healthcare and financial sectors, utilizing modern **JavaScript/TypeScript, Python**, and **Flutter** technologies. My technical background includes **React, Next.js, Vue, Node.js, FastAPI**, and **Django**, complemented by cloud expertise in **Azure** and **AWS**. I have a proven track record of leading the development of platforms that integrate AI/ML capabilities for predictive analytics and intelligent automation. My strong foundation in microservices architecture, event-driven systems, and CI/CD automation allows me to create secure and compliant applications efficiently.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Demonstrated expertise in **Cloud Security** frameworks while presenting complex network architectures and solutions to clients, aligning with their security needs.\nLeveraged **Cybersecurity** principles in technical demonstrations, showcasing protective measures such as **IPS** and **DLP** to mitigate risks effectively.\nEngaged in **Value Selling** by articulating the advantages of advanced **CASB** and **SASE** solutions during client presentations, influencing decision-making processes.\nUtilized in-depth knowledge of **CNAPP** to address client inquiries and pain points regarding cloud application security, directly contributing to sales success.\nLed client training sessions, delivering impactful **Presentations** that explained the integration of **Proxy** services for enhanced security within their cloud environments.\nCollaborated with cross-functional teams to develop strategies for large organizations, ensuring compliance with **CISSP** and **CCNP** best practices in cybersecurity.\nContributed to the creation and delivery of tailored Solutions Architecture documentation, enhancing clarity and promoting client understanding of solutions.\nImplemented client feedback to refine solutions, ultimately improving delivery of security outcomes.\nNegotiated complex sales contracts involving multiple stakeholders, ensuring alignment with client needs and organizational goals.\nCultivated strong relationships with decision-makers, providing ongoing support including technical demonstrations related to **Cloud Security** innovations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Demonstrated expertise in **Cloud Security** by integrating appropriate security measures within financial platforms, ensuring compliance with top-tier cybersecurity standards including **CISSP** and industry best practices.\nPresented complex technical solutions and product demonstrations to clients, showcasing the value of **Cybersecurity** measures including **DLP** (Data Loss Prevention) and **CASB** (Cloud Access Security Broker) to mitigate risks and enhance organizational security by **30%**.\nLeveraged knowledge of **SASE** (Secure Access Service Edge) to deliver streamlined and secure cloud solutions, ensuring optimal functionality in hybrid and multi-cloud environments.\nSuccessfully led the technical side of sales processes, utilizing **Proxy** and **IPS** (Intrusion Prevention Systems) as pivotal tools in securing client infrastructures and enhancing protection against cyber threats.\nUtilized **CNAPP** (Cloud-Native Application Protection Platform) to assess and improve cloud security posture for client applications, leading to a **25%** increase in compliance adherence.\nFacilitated effective internal and external communication through engaging presentations, ensuring clarity of technical solutions and showcasing their impact on enhancing cybersecurity measures.\nEngaged in value selling by linking technical advantages to business outcomes, articulating how integrated security solutions align with clients' strategic goals and objectives, resulting in a revenue growth of **15%**.\nConducted technical training sessions and design workshops for clients to educate them on advanced cybersecurity technologies and their application in safeguarding organizational assets."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Emphasized **Cloud Security**, **Cybersecurity**, and **DLP** solutions through tailored presentations and demonstrations, enhancing client understanding and engagement during sales processes.\nUtilized knowledge of **CASB** and **CNAPP** to articulate the advantages of integrating security services into client infrastructures, driving value selling and aligning solutions with customer needs.\nConducted informative product demonstrations involving **IPS**, showcasing capabilities that cater to specific industry regulations and requirements, thus boosting confidence in proposal acceptance.\nStrengthened the sales team's technical expertise by delivering training sessions on **SASE**, **Proxy**, and relevant cybersecurity frameworks, enabling a seamless transition from technical discussions to successful close rates.\nCollaborated with the engineering team to understand and relay technical features of security products, ensuring prospects received comprehensive insights regarding architecture and deployment strategies.\nAnalyzed competitive landscapes and user feedback to refine product pitches and identify unique selling propositions, contributing to a **25%** increase in sales closure rates.\nProvided strategic input for sales strategies and product innovations based on prevalent cybersecurity trends and customer requirements, yielding a **15%** growth in market share.\nFacilitated cross-departmental cooperation to optimize lead generation techniques and align with product development, enhancing overall efficiency and driving a **30%** improvement in sales cycle duration.\n\n"
    }
  ],
  "skills": "**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Cloud Security, Cybersecurity, IPS, DLP, CASB, CNAPP, CISSP\n\n**Programming Languages:**\n\tPython (FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t(missing API technologies)\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Value Selling, Presentations, Demonstrations, CCNP",
  "apply_company": "Zscaler"
}