{
  "name": "Tomasz Lee",
  "role_name": "Modern C++ Software Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Modern C++ Software Developer with 9+ years of experience, proficient in **C++ 20**, **Boost.Asio**, **unit testing**, and **asynchronous programming**. Exceptional skills in **UML design**, **FIX protocol**, and **MetaTrader API**. Adept at applying **object-oriented programming** and **design patterns** to develop efficient solutions. Strong problem-solving capabilities combined with excellent communication and interpersonal skills. Previously designed and implemented robust applications utilizing a strong tech stack, including **ReactJS**, **NextJS**, **.NET**, and **C#**, ensuring high-performance and optimal development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Modern C++ Software Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Applied **C++ 20** to develop robust software solutions, enhancing system performance and maintainability.\nUtilized **Boost.Asio** for asynchronous programming, significantly improving application responsiveness and throughput.\nEmployed unit testing frameworks to ensure code reliability and reduce bug rates by over 30%.\nConducted UML design to create clear system architecture diagrams, facilitating better team communication and project planning.\nIntegrated **FIX protocol** to enhance trading communications, achieving faster transaction processing by 15%.\nLeveraged the **MetaTrader API** to develop trading applications, streamlining user interactions and increasing user engagement.\nImplemented design patterns to promote reusable code and optimize development workflows, reducing development time by 20%.\nExecuted problem-solving strategies to troubleshoot and resolve complex software issues swiftly and efficiently.\nCollaborated with cross-functional teams, enhancing communication skills and fostering a supportive development environment.\nIncorporated object-oriented programming principles to structure software solutions, improving code clarity and reducing maintenance overhead.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **C++ 20** to design and implement robust software solutions, enhancing performance and reliability in real-time applications.\nEmployed **Boost.Asio** for asynchronous programming to boost system responsiveness and throughput.\nDeveloped unit tests to ensure code quality, achieving a 98% code coverage on critical modules, streamlining the debugging process.\nLeveraged object-oriented programming principles and design patterns to create scalable and maintainable codebases in collaboration with team members.\nApplied UML design techniques to facilitate clear communication of software architecture and design among team stakeholders.\nIntegrated the **FIX protocol** for secure and efficient financial transactions, optimizing trade execution times by 15%.\nUsed the **MetaTrader API** for developing automated trading strategies, improving trading efficiency and reducing manual errors.\nDemonstrated strong problem-solving capabilities by addressing complex software challenges and delivering effective solutions.\nFostered effective interpersonal skills through cross-departmental collaboration, ensuring alignment on software requirements and development timelines.\nConducted regular code reviews and provided mentorship for junior developers, leading to a 20% increase in team productivity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **C++ 20** and **Boost.Asio** to develop high-performance applications with efficient asynchronous programming, achieving a 30% increase in processing speed.\nImplemented unit testing to ensure code reliability, which reduced critical bugs by **25%** in production.\nApplied object-oriented programming principles and design patterns to create modular code, enhancing maintainability and scalability of applications.\nDesigned UML diagrams for system architecture, facilitating clearer communication and understanding among team members.\nDeveloped integration solutions leveraging the **MetaTrader API** and **FIX protocol** for real-time trading systems, improving data accuracy and response time by **15%**.\nContributed to problem-solving efforts, successfully identifying and resolving performance bottlenecks in existing codebases.\nCollaborated effectively with team members to ensure alignment on project objectives, utilizing strong communication and interpersonal skills.\nParticipated in code reviews to maintain coding standards and promote best practices within the team.\nProduced and maintained technical documentation to assist with onboarding and knowledge transfer for new team members."
    }
  ],
  "skills": " **Programming Languages** \n\t C++, C#, JavaScript, TypeScript, Python\n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, .NET\n\n **Frontend Frameworks** \n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies** \n\t RESTful API, GraphQL, MetaTrader API\n\n **Serverless and Cloud Functions** \n\t AWS, Azure\n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps** \n\t CI/CD pipelines\n\n **Cloud & Infrastructure** \n\t Microservices\n\n **Other** \n\t UX/UI Design, Git, GitHub, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, unit testing, asynchronous programming, UML design, FIX protocol, object-oriented programming, design patterns, problem-solving, communication skills, interpersonal skills"
}