{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Mobile Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a results-driven Senior Mobile Engineer with 8+ years of software engineering experience, I possess a robust skill set in **C#**, **Appium**, and **SQL**, specializing in both manual and automated testing to ensure the delivery of high-quality applications. I excel in implementing **REST API** services and have a solid background in **agile** methodologies, ensuring seamless collaboration within cross-functional teams. My strengths lie in my ability to adapt quickly to changing requirements while maintaining the integrity and performance of applications. Additionally, I leverage my experience in microservices architecture and cloud technologies such as **AWS** and **Azure** to build secure and scalable mobile solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Mobile Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and maintained automated testing frameworks in **C#** using **xUnit** for mobile applications to ensure high-quality releases and adherence to agile methodologies.\nConducted manual and automated testing of mobile applications, validating functionality and performance against requirements, achieving a **98%** success rate in test coverage.\nCollaborated with cross-functional teams to design and implement **REST API** integrations for mobile platforms, ensuring seamless data exchange and user experience.\nUtilized **SQL** for database validation and testing, ensuring data integrity and consistency across mobile application backends.\nParticipated in agile ceremonies, including sprint planning and retrospectives, fostering team collaboration and continuous improvement of testing processes.\nImplemented performance testing strategies using tools like Appium for mobile applications, significantly reducing page load times by **30%** and enhancing user satisfaction.\nMentored junior engineers in best practices for mobile testing and development, promoting knowledge sharing and skill enhancement within the team.\nManaged and executed test cases for mobile applications, reducing critical bugs in production by **50%** through rigorous testing and feedback loops.\nEngaged in code reviews and provided constructive feedback to ensure adherence to coding standards and efficient testing practices.\nCollaborated closely with UI/UX designers to ensure mobile applications met design specifications, achieving a consistent score of **4.8** on app stores for user experience."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained high-quality mobile applications using automated testing frameworks and methodologies, ensuring robust functionality through automated testing practices like **xUnit**.\n• Created and integrated **REST APIs** for seamless communication between mobile applications and backend services, optimizing data exchange and user experience.\n• Conducted thorough manual and automated testing processes to ensure the integrity and performance of mobile applications, accelerating deployment cycles in an **agile** environment.\n• Collaborated with cross-functional teams to identify software requirements and specifications, contributing to the continuous improvement of mobile development processes.\n• Managed project timelines effectively, delivering features on schedule and within a **9%** increase in productivity.\n• Provided mentorship and guidance to junior engineers, fostering a culture of knowledge sharing and continuous learning.\n• Utilized version control (e.g., Git) for source code management, facilitating collaboration and ensuring code quality.\n• Implemented best practices in software development, including unit testing and continuous integration processes, to enhance overall application reliability.\n• Actively participated in sprint planning and retrospectives to refine upcoming user stories and translations into technical tasks."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Executed automated testing strategies using **Appium**, improving software reliability and user experience across mobile applications by **30%**.\nConducted manual testing for mobile applications with a focus on user interface and functionality, contributing to a **15%** increase in app quality ratings.\nDeveloped and maintained robust REST APIs to enhance integration between mobile clients and backend systems, ensuring a seamless customer experience.\nUtilized **C# and xUnit** to create comprehensive unit tests, enhancing code coverage by **25%** and reducing bugs in production.\nParticipated in agile methodologies to streamline the development process, improving time-to-market for new features by **20%**.\nDesigned and implemented SQL database queries for mobile application data management, optimizing performance and ensuring efficient data retrieval.\nCollaborated with cross-functional teams in an agile environment, aligning mobile app features with business objectives and enhancing overall product value.\nEngaged in continuous integration and delivery practices, ensuring quick turnaround of application updates and bug fixes.\nAnalyzed and reported test metrics to stakeholders, facilitating informed decision-making regarding software releases and enhancements.\nMentored junior testing team members, fostering skill development in automated and manual testing practices."
    }
  ],
  "skills": "Programming Languages:\n\tC#, Python (FastAPI, Django, Flask)\n\nBackend Frameworks:\n\tSpring Boot, SQLAlchemy, Pydantic, Celery\n\nFrontend Frameworks:\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\nAPI Technologies:\n\tREST & gRPC APIs, REST API\n\nServerless and Cloud Functions:\n\tAWS (Lambda), Azure (App Services)\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\nCloud & Infrastructure:\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\nOther:\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Appium, manual testing, automated testing, xUnit, agile",
  "apply_company": "AMCS Group"
}