{
  "name": "Rei Taro",
  "role_name": "Senior Automation Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Automation Engineer with 10+ years of experience in backend system design and delivery, specializing in automation solutions that integrate various tools and platforms. Proficient in building and optimizing **REST APIs**, leveraging **webhooks**, and implementing **OAuth** for secure application interactions. Strong knowledge of **n8n** for automation workflows, along with hands-on experience with **SQL** for data management. Familiar with **HubSpot**, **Airtable**, **Slack**, **Notion**, **Stripe**, and **Google Workspace** to create seamless integrations and enhance operational efficiency. Recognized for exceptional problem-solving abilities, strong communication skills, and a meticulous attention to detail, with a commitment to ownership and continuous learning in fast-paced environments. Successfully contributed to transformative projects at leading organizations such as VISA and Sii Poland.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Automation Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Designed and implemented **REST APIs** and **webhooks** for automation workflows, enhancing system integration and communication between applications.\nDeveloped solutions for integrating **Stripe** and **Airtable** for streamlined payment processing and data management, resulting in a **30%** improvement in transaction efficiency.\nManaged and optimized data workflows using **ETL** processes, ensuring high-quality data integrity for stakeholders across **9** departments.\nAutomated repetitive tasks through **n8n** to facilitate seamless user onboarding and operational efficiency, reducing manual tasks by **40%**.\nImplemented security protocols with **OAuth** for robust authentication, maintaining compliance with industry standards.\nFostered problem-solving and communication among cross-functional teams to develop solutions that are detail-oriented and meet project requirements on … time.\nLed the integration of **Google Workspace** and **Slack** for enhanced team coordination, achieving a **25%** increase in productivity.\nPromoted a culture of curiosity and ownership by mentoring junior engineers and collaborating on innovative automation projects."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed and integrated **REST APIs** to facilitate seamless communication between systems and enable automation of workflows, ensuring efficient orchestration of over **100** document processing events per day.\nImplemented webhooks with **n8n** to automate data synchronization between applications such as **HubSpot** and **Airtable**, improving data accuracy by **30%** and reducing manual data entry.\nEngineered data transformation processes using **ETL** strategies within **SQL** databases, increasing reporting speed by over **40%** and ensuring compliance with data regulations.\nApplied **OAuth** protocols for secure authentication and access control, resulting in a **50%** reduction in unauthorized access incidents.\nUtilized **JavaScript** for building interactive user interfaces that improved user onboarding time by **20%**, enhancing user experience and satisfaction.\nDeployed innovative solutions in a distributed cloud environment using **Google Workspace** and integrated automation tools like **Slack** for enhanced team collaboration and communication.\nAdopted a detail-oriented approach in problem-solving during system integrations, ensuring compliance with marketplace standards and achieving successful rollout of projects within **2** weeks.\nDemonstrated ownership over project milestones, actively engaging with stakeholders to gather feedback and drive continuous improvement initiatives."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed automated workflows using **n8n** and **webhooks** to integrate platforms like **HubSpot**, **Airtable**, and **Slack** for seamless data flow and improved operational efficiency.\nEngineered **REST APIs** for efficient communication between platforms, ensuring data accuracy and adherence to service standards.\nDesigned and implemented intricate ETL processes using **SQL** and **JSON**, enhancing data accessibility and analysis across multiple services.\nUtilized **OAuth** for secure API authentication, protecting sensitive data interactions within automated systems.\nCollaborated cross-functionally with teams to align automation strategies with organizational goals, enhancing problem-solving and communication capabilities.\nImplemented structured usage of **Stripe** and **Google Workspace** for streamlined payment processing and project management.\nMonitored and maintained automation processes to ensure reliability and performance, showing strong ownership and attention to detail throughout the lifecycle.\nFostered a culture of curiosity by regularly exploring new tools and technologies to enhance productivity and efficiency in automation tasks."
    }
  ],
  "skills": " \n**Programming Languages** \n\tPython (3.8+), SQL, JavaScript \n\n**Backend Frameworks** \n\tFastAPI, Flask, Django, Celery \n\n**Frontend Frameworks** \n\t(Airtable, HubSpot, Notion, Slack, Google Workspace) \n\n**API Technologies** \n\tREST/gRPC APIs, REST APIs, webhooks, OAuth, JSON \n\n**Serverless and Cloud Functions** \n\tAWS (EC2, S3, Lambda), Azure \n\n**Databases** \n\tPostgreSQL, MySQL, MongoDB, Redis \n\n**DevOps** \n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD \n\n**Cloud & Infrastructure** \n\t(AWS, Azure) \n\n**Other** \n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, ETL, Microservices, Kafka, PyTest, Git, problem-solving, communication, detail-oriented, curiosity, ownership, marketplace",
  "apply_company": "Pet Media Group (PMG)"
}