{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Java Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Java Engineer with over 10 years of experience in backend development, specializing in high-performance software solutions. Expert in **Java**, **Git**, and **Maven**, with a solid understanding of **Thread-safe** programming and **REST-API** design. Proficient in utilizing **Docker** for containerization, and experienced in **Linux** environments for seamless application deployment. Demonstrated skill in applying **Clean Code** principles and performing thorough **Debugging** using **JUnit** and **Mockito** to ensure the delivery of robust software. Adept at employing **Redis** for caching and data storage solutions, and leveraging **MongoDB** for database management. Knowledgeable in CI/CD practices using **GitHub Actions** and **GitLab CI** to streamline development workflows.\n\nA proactive Full Stack Developer skilled in modern technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**. Hands-on expertise with frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven track record in deploying cloud-native applications on **Azure** and **AWS**, developing enterprise platforms that incorporate AI/ML capabilities for impactful real-time analytics and automation. Strong background in **microservices architecture** and **event-driven systems** while ensuring compliance with industry standards like HIPAA and PCI DSS. Passionate about driving innovation and building secure, maintainable solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust **backend** solutions for high-performance applications using **Java**, **Maven**, and **Git**, ensuring code quality and maintainability through **Clean Code** practices and debugging techniques.\n• Implemented efficient caching mechanisms utilizing **Redis** to optimize performance and reduce latency for data-intensive applications, achieving response time improvements of up to **30%**.\n• Designed and integrated **REST-API** services with **MongoDB** as the primary database, enabling seamless data interaction and retrieval in multi-threaded environments.\n• Utilized frameworks such as **Spigot**, **Bukkit**, and **Paper** to enhance server performance and stability while ensuring thread-safe operations in concurrent environments.\n• Established CI/CD pipelines with **GitHub Actions** and **GitLab CI**, automating build and deployment processes and reducing deployment times by **40%**.\n• Implemented unit testing and integration testing strategies using **JUnit** and **Mockito**, increasing test coverage to **85%** across all services.\n• Engaged in system architecture discussions, utilizing **Docker** for containerization to support microservice architecture across various environments.\n• Developed infrastructure automation scripts using **Ansible**, ensuring consistent configuration across development and production servers.\n• Integrated third-party libraries and tools for enhanced functionality, utilizing **ProtocolLib** for advanced protocol handling in game server environments.\n• Led code reviews and mentored junior developers, fostering a culture of quality and adherence to best practices in software development."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Java** to develop and maintain high-quality backend solutions, ensuring code adheres to **Clean Code** principles and is thoroughly **debugged** to provide seamless functionality in the gaming industry.\nImplemented **REST-API** services to facilitate communication between various game components, enhancing performance and user experience across multiple platforms.\nLeveraged **Maven** for project management and dependency resolution, ensuring consistency and reliability in build processes across versions.\nDeveloped and maintained **Thread-safe** systems using **Spigot**, **Bukkit**, and **Paper**, optimizing server performance for real-time user interactions in a multiplayer gaming environment.\nIntegrated **Redis** for efficient data caching, significantly reducing response times and database load during peak user activity.\nEmployed **NMS** and **ProtocolLib** to customize and extend game server functionalities, adding new features and enhancing gameplay based on user feedback.\nCollaborated with cross-functional teams using **Git** for version control, ensuring robust development workflows and seamless integration of code through **GitHub Actions** and **GitLab CI**.\nImplemented containerization strategies with **Docker** to streamline development and deployment processes, achieving a **50%** reduction in setup time for staging and production environments.\nConfigured and automated deployment processes using **Ansible**, resulting in improved operational efficiency and reduced deployment errors by **30%**.\nManaged **MongoDB** databases, optimizing query performance and ensuring data integrity with a transaction success rate of over **95%**.\nConducted unit testing and behavior-driven development using **JUnit** and **Mockito** to enhance code reliability and ensure the alignment of features with business requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Engineered robust backend solutions for high-performance applications using **Java** and **Spring Boot**, ensuring thread-safe operations and seamless integration with **Rest-API** protocols.\nDeveloped and maintained **Maven**-based build systems and package management, facilitating streamlined project workflows and dependencies across **GitHub Actions** and **GitLab CI** environments.\nApplied best practices in **Clean Code** principles and thorough **Debugging** methods, achieving a 30% reduction in code defects and increasing overall application maintainability.\nDesigned and implemented **Redis** caching strategies to optimize data retrieval and enhance application performance, reducing average response times by up to **40%**.\nUtilized **MongoDB** for effective data modeling and storage solutions, ensuring rapid access and scalability for high-traffic applications.\nParticipated in building server-side functionality using **NMS** and **ProtocolLib** for game servers, enhancing user interaction and experience. \nCollaborated on multi-threading solutions to improve application efficiency and manage concurrent processes without performance degradation.\nManaged deployment operations using **Docker** containers and automated server setups with **Ansible**, leading to improved deployment times by **50%**.\nConducted unit testing with **JUnit** and **Mockito**, elevating code quality and coverage to **85%**, allowing for quicker identification of issues during the development cycle.\nImplemented CI/CD pipelines enhancing deployment frequency while minimizing downtime, showcasing infrastructure reliability and scalability across all environments."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Backend, Spigot, Bukkit, Paper, Thread-safe, NMS, ProtocolLib, REST-API\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST-API\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Ansible, Terraform, Helm, Docker Compose, Git, Maven\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, Docker, Kubernetes\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, CI/CD, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Clean Code, Debugging, JUnit, Mockito",
  "apply_company": "Interwebmedia GmbH"
}