{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 8 years of comprehensive experience in building high-performance web applications with a strong focus on **React**, **JavaScript**, **HTML**, and **CSS**. Highly proficient in translating design requirements into functional user interfaces, leveraging **Figma** for UI/UX design collaboration. Demonstrates a deep understanding of Object-Oriented Programming (OOP) principles and Agile methodologies to drive project success and ensure timely delivery. \n\nIn addition to frontend expertise, I have a robust background in full-stack development, utilizing **Next.js** and **Vue** alongside backend technologies such as **Node.js** and **Django**. My extensive cloud experience with **Azure** and **AWS** enhances application scalability and security compliance. I have successfully led the implementation of enterprise platforms with compliance to standards like HIPAA and PCI DSS, ensuring robust security protocols. Passionate about continuous learning and application refinement, I thrive in dynamic environments where innovation meets efficiency.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and optimized user interfaces for healthcare and financial platforms using **React** (versions 17-18), ensuring responsive design and seamless user experience through **JavaScript**, **HTML**, and **CSS**.\nLed the implementation of Agile methodologies in frontend development, collaborating with cross-functional teams to deliver high-quality products on time.\nDesigned and executed high-fidelity prototypes using **Figma**, facilitating effective communication of concepts and user flows to stakeholders.\nAdhered to Object-Oriented Programming (OOP) principles to enhance code quality, maintainability, and scalability of frontend applications.\nIntegrated various libraries and tools for state management, routing, and user interactions to streamline application performance and enhance user engagement.\nConducted A/B testing and user feedback sessions, achieving a **25%** increase in user satisfaction ratings through iterative improvements.\nImplemented continuous integration practices using tools such as GitHub Actions, ensuring smooth deployments and consistency in development workflows.\nCollaborated closely with backend teams to integrate RESTful APIs, ensuring seamless data flow and user functionalities in the applications.\nOptimized applications for cross-browser compatibility and performance, leveraging code splitting and lazy loading techniques, resulting in a **30%** increase in load speed.\nEstablished comprehensive testing strategies using tools like Jest and Cypress to ensure robust quality assurance across all frontend components."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed dynamic, user-centric front-end applications using **React (18)**, **JavaScript**, **HTML**, **CSS**, and **Figma**, enhancing user experience for financial dashboards and admin portals.\nEmployed **OOP** principles to ensure scalable and maintainable code architecture, leading to a reduction in bug rates by **30%** across projects.\nAdopted **Agile** methodologies to streamline development processes, resulting in a **25%** increase in team productivity and a **40%** faster project delivery timeline.\nCollaborated closely with UX/UI designers to translate prototypes into functional web applications, improving design iterations by **15%** based on user testing feedback.\nOptimized application performance by implementing best practices in code splitting and lazy loading, decreasing load times by **50%** in user-facing interfaces.\nActively participated in code reviews and mentoring of junior developers, fostering a culture of knowledge sharing and continuous improvement within the team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed responsive frontend applications using **React (18)**, **JavaScript**, **HTML5**, and **CSS3**, showcasing advanced programming skills and delivering fast, user-friendly experiences on both web and mobile platforms.\nCollaborated with design teams utilizing **Figma** for interface design, ensuring pixel-perfect implementation and adherence to UI/UX best practices in an **Agile** environment.\nEmployed **OOP** principles to build maintainable and scalable code, enhancing team efficiency and facilitating smoother onboarding for new developers by leveraging best practices.\nEnhanced application performance through optimization techniques, reducing load times by **30%** while ensuring compatibility across multiple devices and browsers.\nIntegrating tools for continuous feedback and improvements, facilitated **user testing** sessions that contributed to a **15%** increase in customer satisfaction metrics.\nWorked within an **Agile** team to iteratively develop features based on user feedback, leading to a **20%** faster release cycle and improved product readiness.\nRegularly conducted code reviews and provided mentorship within the team, fostering a culture of quality and collaboration which led to a **10%** decrease in technical debt."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, Python\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, OOP, Agile, Figma",
  "apply_company": "SOFTSWISS"
}