{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Go Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a skilled Senior Go Engineer with 8+ years of experience in software engineering, I excel in developing robust and efficient solutions, leveraging proficiency in **Go**, **Docker**, **Kubernetes**, and **CI/CD** practices. My background in **Python** allows me to enhance system capabilities, while my understanding of **Linux** ensures optimal deployment and maintenance of applications. I possess strong knowledge of computer networks and version control using **GitLab**, making me adept at delivering high-performance systems. My experience in working within collaborative environments is complemented by my effective communication and teamwork skills, further strengthened by my ability to work with async programming and AI technologies. I aim to align cutting-edge software development with strategic business objectives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Go Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed and maintained containerized applications using **Docker** and managed deployment on **Kubernetes**, ensuring high availability and scalability in line with best practices.\n• Collaborated with cross-functional teams to implement CI/CD pipelines in **GitLab**, increasing deployment efficiency by **30%** through automation and stringent code quality checks.\n• Engineered solutions in **Go** for backend services, focusing on building efficient, high-performance applications that utilize asynchronous programming methods for optimal resource usage.\n• Designed and executed robust microservices architectures, integrating state-of-the-art communication protocols and adhering to **computer networks** principles for seamless service interactions.\n• Leveraged **Linux** environments to optimize application performance and resource management, leading to a **25%** reduction in operational costs.\n• Championed AI-driven solutions to enhance application features and user experience, making significant contributions to project deliverables and strategic developments.\n• Fostered a culture of teamwork and communication within the engineering group, resulting in improved collaboration and project outcomes.\n• Participated in code reviews and mentoring sessions, promoting best coding practices and facilitating knowledge sharing among team members.\n• Implemented effective performance monitoring tools and logging strategies within the **Go** applications to ensure reliability and maintainability of production systems.\n• Ensured compliance and security in developed applications through adherence to industry standards and the integration of secure coding practices."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained scalable applications using **Go** in a **Docker** and **Kubernetes** environment, enhancing deployment efficiency and system reliability.\n• Implemented CI/CD pipelines utilizing **GitLab** to automate testing and deployment processes, achieving a **30%** reduction in release cycles.\n• Leveraged asynchronous programming in **Go** to improve throughput and responsiveness of applications, contributing to a **15%** performance increase in service response times.\n• Collaborated with cross-functional teams to design computer network solutions that optimized data flow and communication, enhancing overall system performance.\n• Successfully integrated **AI** solutions into existing platforms, fostering improvements in data analysis and decision-making processes.\n• Actively participated in team workshops and code reviews to promote best practices in **Go** development and maintain high-quality code standards.\n• Championed Linux-based server environments to ensure seamless application deployment and management, contributing to a **99.9%** uptime for production services.\n• Engaged in continuous learning and knowledge sharing to stay updated with the latest technologies and tools in the **Go** and cloud ecosystems."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and optimized high-performance backend services using **Go** and **Docker**, significantly increasing application scalability and reducing latency by **30%**.\nImplemented robust CI/CD pipelines with **GitLab** and **Docker**, facilitating consistent delivery and deployment of features with **90%** automation, enhancing development workflows.\nDesigned and maintained microservices deployed on **Kubernetes**, ensuring high availability and efficient resource utilization across a cloud infrastructure.\nLeveraged **Linux** for server management and deployment tasks, enhancing the security and performance of production environments.\nEmployed asynchronous programming in **Go** to streamline processes and improve the responsiveness of services handling concurrent requests.\nCollaborated with cross-functional teams to develop solutions leveraging **AI**, improving user experiences and operational efficiency through intelligent automation.\nUtilized expert knowledge in computer networks to architect reliable service communications and optimize data flow between microservices.\nFostered a culture of teamwork and effective communication, leading to improved project outcomes and enhancing team performance.\nAutomated testing frameworks for **Go** applications to ensure code quality and reduce manual effort in regression testing, achieving coverage of **85%**.\nConducted performance testing and tuning to optimize the application for handling high traffic volumes, achieving **maximum throughput** under load.\nIntegrated observability tools within the application stack, improving monitoring and ensuring robust performance tracking in production environments."
    }
  ],
  "skills": " **Programming Languages:**\n\tGo, Python, async\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQLAlchemy\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Linux\n\n **Other:**\n\tPydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, computer networks, AI, communication, teamwork",
  "apply_company": "Vecima"
}