{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Operations Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior Operations Engineer with 10+ years of experience in automation, incident response, and performance tuning, equipped with a robust technical skill set including **GCP**, **Linux**, **Windows**, **Python**, **Bash**, **PowerShell**, **Ansible**, **Puppet**, **Chef**, **Prometheus**, and **Cloud Monitoring**. Specializing in cloud infrastructure management and implementing effective disaster recovery strategies, I bring a proven ability to ensure system reliability and efficiency through comprehensive backup and performance optimization solutions. \n\nDemonstrated expertise in cloud storage management and IAM, coupled with a strong foundation in task management and documentation practices. Leveraging my background as a Full Stack Developer, I have delivered high-performance software solutions and led enterprise platform development. My passion for innovation ensures that every system I build not only meets compliance standards but also drives real-world impact in healthcare and finance.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Operations Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tAutomated deployment processes using **Ansible**, **Puppet**, and **Chef**, ensuring a streamlined infrastructure setup and consistent application delivery in both **Linux** and **Windows** environments.\n•\tManaged and optimized cloud resources on **GCP** for performance tuning and disaster recovery, implementing effective backup strategies to maintain high availability across systems.\n•\tImplemented monitoring solutions utilizing **Prometheus** and **Cloud Monitoring** tools to provide real-time insights and incident response capabilities, improving system reliability by **25%**.\n•\tDesigned comprehensive documentation practices for infrastructure and operational procedures, enhancing team collaboration and knowledge sharing.\n•\tConducted performance tuning on servers and applications, reducing response times by up to **30%** through optimization of resource allocation and task management.\n•\tDeveloped automation scripts in **Bash** and **Python** to facilitate daily operational tasks, streamlining workflows and increasing team efficiency by **40%**.\n•\tImplemented Identity and Access Management (IAM) policies to secure cloud environments, ensuring compliance with industry standards and best practices.\n•\tPerformed thorough incident response analysis, leading post-mortem reviews and developing strategies to mitigate future risks and improve resilience.\n•\tSupported cloud storage solutions, effectively managing data lifecycle and retention policies to optimize costs and enhance access speeds.\n•\tCollaborated with cross-functional teams to address performance bottlenecks, leveraging task management tools to track progress and deliver results consistently."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **GCP** to enhance cloud infrastructure and establish efficient virtual private cloud (VPC) systems, improving overall system reliability and performance by **30%**.\nImplemented automation scripts using **Bash**, **PowerShell**, and **Python** to streamline operational processes, reducing manual interventions and increasing task efficiency by **25%**.\nDeveloped and maintained comprehensive documentation for operational procedures and incident response strategies, ensuring team alignment and compliance with best practices.\nExecuted performance tuning and monitoring of systems through **Prometheus** and **Cloud Monitoring**, achieving a **20%** increase in application performance and response times.\nConfigured and managed backup and disaster recovery solutions, limiting downtime to within **1 hour** for critical systems through a robust incident response framework.\nLeveraged configuration management tools like **Ansible**, **Puppet**, and **Chef** to automate deployment and update tasks across various environments, ensuring consistency and reducing deployment times by **40%**.\nConducted regular system audits on **Linux** and **Windows** platforms, enhancing security and compliance through effective IAM strategies and configurations.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented cloud-based infrastructure solutions on **GCP**, ensuring robust performance tuning and incident response protocols across the platform, enhancing system stability and uptime by **99.9%**.\nAutomated deployment processes using **Ansible**, **Puppet**, and **Chef**, reducing manual overhead and deployment times by **30%** while maintaining rigorous documentation standards.\nDeveloped comprehensive backup and disaster recovery strategies, achieving data recovery time objectives (RTO) under **2 hours** and recovery point objectives (RPO) under **15 minutes**.\nManaged Linux and Windows environments, troubleshooting issues with **Bash** and **PowerShell** scripts to streamline operational performance and reduce downtime by **25%**.\nUtilized **Cloud Monitoring**, **Prometheus**, and custom logging solutions for real-time system health checks, enhancing system reliability and facilitating proactive incident management.\nControlled resource allocation securely using **IAM** and **VPC** settings, ensuring compliance with security best practices and safeguarding sensitive data.\nCollaborated on task management initiatives, incorporating effective automation tools and documentation strategies to enhance team efficiency in operations support and problem resolution.\nConducted performance tuning for various applications, leveraging cloud storage solutions and optimizing resource consumption for cost efficiency.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Bash, PowerShell\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Ansible\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Helm, Docker Compose, Puppet, Chef, Prometheus\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Cloud Monitoring, Cloud Storage, IAM, VPC, Linux, Windows\n\n**Other:**\n\tAutomation, Documentation, Task Management, Incident Response, Performance Tuning, Backup, Disaster Recovery",
  "apply_company": "Capgemini"
}