{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Electrical Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Senior Electrical Engineer with 13+ years of experience in **Electrical System Design**, **Power Distribution**, and **Load Flow Analysis**. Proven expertise in implementing **Direct Liquid Cooling** solutions and conducting **Short-Circuit Analysis** to ensure reliable and efficient power systems. Familiar with NEC/IEC Codes and adept at achieving **Tier Certification** standards. \nDemonstrates exceptional **problem-solving** abilities and strong **communication** skills, facilitating effective **collaboration** across cross-functional teams. Skilled in leveraging advanced technologies and methodologies to drive innovative solutions in engineering challenges.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Electrical Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and built optimized **electrical systems** focused on **power distribution** and **load flow analysis** to support critical infrastructure projects.\n• Conducted comprehensive **short-circuit analysis** to ensure system reliability and adherence to **NEC/IEC codes** for compliance in regulated environments.\n• Collaborated effectively with multidisciplinary teams, utilizing strong **communication** and **collaboration** skills to drive project success and meet engineering specifications.\n• Implemented innovative solutions for **direct liquid cooling** systems, enhancing thermal management and energy efficiency in electrical setups.\n• Led the **tier certification** process for electrical installations, guaranteeing compliance with industry standards and certifications.\n• Developed problem-solving frameworks to swiftly address technical issues in **electrical system design**, improving project timelines by **30%**.\n• Streamlined project workflows by integrating standard engineering practices, resulting in a **15%** increase in team productivity and output quality.\n• Trained junior engineers on industry best practices and NEC/IEC compliance requirements, fostering knowledge sharing and skill development.\n• Created detailed technical documentation and reports to communicate design decisions, modifications, and upgrades to stakeholders.\n• Engaged in continuous improvement by assessing existing systems and proposing upgrades based on technological advancements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Applied strong **Electrical System Design** principles while leading the design of high-efficiency power distribution systems, ensuring compliance with **NEC/IEC Codes** for safety and reliability.\nConducted detailed **Load Flow Analysis** and **Short-Circuit Analysis** to optimize system performance, resulting in a **20%** increase in energy efficiency across multiple projects.\nEffectively collaborated with cross-functional teams to develop innovative solutions for **Direct Liquid Cooling** systems, enhancing thermal management in high-density environments.\nImplemented rigorous **Tier Certification** processes to validate system design against industry standards, achieving certification for **3** major projects within the timelines.\nUtilized advanced problem-solving skills to troubleshoot and resolve electrical system issues, maintaining a **99%** uptime for critical electrical infrastructures.\nCommunicated effectively with stakeholders to discuss system requirements and design modifications, ensuring alignment and satisfaction throughout the project lifecycle.\nFacilitated workshops and brainstorming sessions to promote **collaboration** among engineers in the design process, enhancing project outcomes and team efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Conducted extensive **Load Flow Analysis** and **Short-Circuit Analysis** for electrical system design, ensuring efficient power distribution while maintaining compliance with **NEC/IEC Codes**.\n• Designed and optimized **Electrical System Design** for high-performance projects, incorporating **Direct Liquid Cooling** strategies to enhance thermal management and operational efficiency.\n• Collaborated effectively with cross-functional teams to implement strategies for Tier Certification projects, demonstrating strong **Communication** and **Collaboration** skills.\n• Problem-solved complex electrical design challenges, leading to successful project outcomes and adherence to specifications.\n• Engaged in continuous improvement efforts for power distribution systems, achieving measurable enhancements in performance and energy efficiency.\n• Facilitated presentations and technical documentation to convey design specifications and project updates, ensuring clear communication with stakeholders.\n• Collaborated in testing and validation phases, contributing expertise in **Load Flow Analysis** to derive actionable insights that drive project success.\n• Maintained up-to-date knowledge of industry innovations and best practices to apply cutting-edge solutions and improve project efficiency."
    }
  ],
  "skills": "{"
}