{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-oriented Senior Frontend Engineer with 8 years of experience specializing in high-performance SaaS solutions. Proficient in **JavaScript**, **TypeScript**, **React**, **HTML**, and **CSS**, I have a strong focus on web architecture, web performance optimization, and user interface design. My capability in **database design** and **web server optimization** ensures quality outcomes while maintaining compliance with industry standards. \n\nWith a proven track record in cross-functional collaboration and mentoring, I excel at problem-solving, effective communication, and adaptability in dynamic environments. I leverage modern technologies and frameworks to build robust applications that meet the needs of users while enhancing overall user experience.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged **JavaScript**, **TypeScript**, and **React (17-18)** to develop and optimize user interfaces for scalable web applications in a SaaS environment, ensuring exceptional **Web Performance** and **User Interface Design**.\n- Collaborated cross-functionally with backend teams to enhance **Web Architecture** and ensure seamless integration with data services, showcasing strong **Problem Solving** and **Communication** skills.\n- Designed and implemented effective **Database Design** strategies utilizing **PostgreSQL** and **MongoDB** for efficient data querying and retrieval.\n- Conducted **Web Server Optimization** to improve loading times and enhance user experiences in healthcare and financial platforms.\n- Mentored junior developers in best practices for **HTML**, **CSS**, and modern frontend technologies, demonstrating expertise in **Cross-functional Collaboration**.\n- Adapting and maintaining code in line with industry best practices, ensuring that the applications meet and exceed current standards and user expectations.\n- Implemented rigorous testing strategies using **Jest**, **Cypress**, and **Postman**, achieving comprehensive coverage across unit, integration, and E2E tests, enhancing overall code quality by **30%**.\n- Played a pivotal role in the successful launch of **8+** major product features within deadlines, contributing to improved user retention rates.\n- Actively participated in Agile ceremonies and sprint planning, adapting to changing project requirements while delivering results on time."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to build dynamic, user-focused front-end applications using **React** (18), **Vue 3**, **Next.js**, and **Tailwind CSS**, achieving responsive and performant user interfaces for financial dashboards and admin portals.\nEnhanced web performance through effective **Web Architecture** and **Web Server Optimization**, leading to a **30%** improvement in loading times and user experience.\nCollaborated cross-functionally with product and design teams to implement user interface designs that align with business goals and user needs, fostering a collaborative environment that resulted in a **25%** reduction in project delivery timelines.\nMentored junior developers on best practices in **Web Performance** and **User Interface Design**, improving team skill sets and driving quality standards across projects.\nDesigned and maintained database schema for optimal data retrieval, impacting overall system performance by reducing queries load time by **40%**.\nAdapted quickly to changes in application requirements and technologies, demonstrating adaptability while solving complex technical problems throughout the software development lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed user interfaces using **React (18)**, **TypeScript**, and **HTML5/CSS3**, implementing modern design principles for an appealing and responsive user experience in a **SaaS** environment.\n• Enhanced web performance through structured **Web Architecture** practices, ensuring optimal loading times and user engagement at scale.\n• Collaborated cross-functionally with backend teams using **Node.js (NestJS, Express)** to streamline API consumption, ensuring seamless integration for frontend applications.\n• Conducted database design and optimization in conjunction with teams, leveraging **MongoDB**, **PostgreSQL**, and caching strategies with **Redis** to handle high traffic efficiently.\n• Proactively mentored junior team members in **JavaScript**, **CSS**, and effective coding practices, fostering a culture of continuous learning and improvement.\n• Employed effective communication skills to articulate project requirements and collaborate effectively with stakeholders across different teams, enhancing project outcomes.\n• Utilized **Web Server Optimization** techniques to boost application response times and improve overall application performance, achieving a **30% reduction** in load times.\n• Adapted features dynamically based on user feedback and analytics, demonstrating flexibility in strategies to meet evolving project requirements.\n• Leverage advanced **User Interface Design** principles to create accessible platforms that meet compliance standards such as **WCAG 2.1**.\n• Applied responsive web design principles to ensure compatibility across **mobile** and **desktop** platforms, resulting in a **40% increase** in mobile user engagement."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, SaaS, Web Performance, Web Architecture, Database Design, Web Server Optimization, User Interface Design, Cross-functional Collaboration, Mentoring, Problem Solving, Communication, Adaptability",
  "apply_company": "PLAYTOMIC"
}