{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Ruby Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Ruby Engineer with 13+ years of experience in delivering high-performance applications across diverse industries, including healthcare and finance. Proficient in **Ruby** and **Ruby on Rails**, with a strong emphasis on TDD, continuous integration, and secure coding practices. Experienced in designing and implementing RESTful APIs and collaborating within agile development teams to enhance product delivery.\n\nSkilled in **JavaScript/TypeScript**, and familiar with technologies such as **React** for frontend development, complemented by a robust backend expertise using **PostgreSQL**. Well-versed in DevOps practices, deploying cloud-native solutions on **AWS** while ensuring clean code principles and effective code reviews are upheld.\n\nAdditionally, I have a proven track record of leveraging AI/ML techniques within applications, including predictive analytics and automation. My comprehensive background in compliance-driven development aligns solutions with industry standards, contributing to operational excellence and reliable system performance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Ruby Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained **RESTful APIs** using **Ruby on Rails**, ensuring adherence to **secure coding** practices while implementing **TDD** methodologies to drive code quality and reliability.\n• Led efforts in **Continuous Integration** and **Continuous Delivery** pipelines utilizing **Git**, **GitHub**, and **GitLab**, ensuring seamless deployment processes across multiple environments.\n• Collaborated with cross-functional teams to design and implement backend solutions, incorporating **PostgreSQL** for database management, and applying principles of **Agile** to optimize workflows and project delivery.\n• Contributed to code reviews, promoting **Clean Code** principles and fostering a culture of collaboration and continuous improvement within the development team.\n• Enhanced application performance and user experience by integrating **React** and **TypeScript** for front-end development, refining UI interactions in line with user feedback and testing results.\n• Implemented robust testing strategies across the stack, using industry-standard frameworks to ensure comprehensive coverage and minimize technical debt.\n• Championed secure coding practices throughout the development lifecycle, addressing vulnerabilities and promoting best practices in software security.\n• Actively participated in remote work initiatives, adapting workflows to maintain productivity and team cohesion in distributed environments."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **RESTful APIs** and enhanced application performance by adhering to **TDD** principles and employing **Continuous Integration** practices in a **Ruby on Rails** environment, ensuring high-quality delivery and reduced bug rates.\nContributed to code repositories using **Git**, **GitHub**, and **GitLab**, performing thorough **Code Reviews** to maintain clean and secure coding standards that comply with best practices in **Secure Coding**.\nCollaborated effectively within an **Agile** team, delivering features and improvements in iterative sprints, while maintaining a balance between functionality and performance on core systems.\nOrchestrated the deployment of applications on **AWS** infrastructure, implementing **Continuous Delivery** methods to ensure rapid and reliable releases.\nFostered team collaboration and communication in a **Remote Work** environment, sharing knowledge and assisting team members in achieving project goals.\nExecuted database management and optimization techniques using **PostgreSQL**, applying careful analysis to improve data retrieval times by **30%**.\nUtilized **React** and **TypeScript** to refine user interfaces, creating engaging and streamlined applications that enhanced user experience with improved response times by **25%**.\nApplied **DevOps** methodologies to streamline development processes, significantly reducing deployment times by up to **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented robust **RESTful APIs** and backend services leveraging **Ruby** and **Ruby on Rails**, ensuring high performance and secure transaction flow while adhering to **TDD** principles.\nConducted extensive **Code Reviews** to maintain clean code standards and optimize the codebase, achieving a reduction in bug rates by **30%** through proactive collaboration with team members.\nExecuted deployment strategies utilizing **Continuous Integration** and **Continuous Delivery** methodologies on AWS, enabling streamlined deployment cycles and reducing rollback incidents to **1%**.\nCollaborated in an **Agile** environment to deliver iterative features and enhancements, improving team velocity by **25%** through effective sprint planning and execution.\nIntegrated data management solutions using **PostgreSQL** to handle complex queries and transactions within e-commerce applications, ensuring consistency and reliability under high load conditions.\nDeveloped user interfaces with **React** and **TypeScript** for enhanced performance and maintainability, driving user engagement with a **20%** increase in session duration on planned feature rollouts.\nEnforced **Secure Coding** practices across the development lifecycle, contributing to the overall security and compliance of the application pertaining to GDPR regulations.\nFostered collaboration and remote work capabilities by utilizing tools like **Git**, **GitHub**, and **GitLab** for code management and version control, facilitating seamless team contributions and communication.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Ruby\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Ruby on Rails\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Continuous Integration, Continuous Delivery, TDD, Git\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Agile, Code Review, Collaboration, Remote Work, Clean Code, Secure Coding",
  "apply_company": "Oyster®"
}