{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cloud Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Cloud Engineer with 8 years of experience, specializing in delivering scalable solutions within cloud environments and proficient in **AWS**, **GCP**, **Terraform**, **Ansible**, **Docker**, **Jenkins**, **Kubernetes**, **Grafana**, **Prometheus**, and **Graphite**. Expert in implementing CI/CD pipelines, Infrastructure as Code strategies, and Cloud Security protocols to ensure robust and secure deployments, employing methodologies such as Blue/Green Deployment and Continuous Deployment.\n\nProficient in programming languages including **Python**, **Bash**, **Golang**, and **Java**, with a strong foundation in full-stack development. My background includes developing enterprise-grade platforms utilizing modern frameworks such as **React**, **Next.js**, **Vue**, and back-end technologies like **Node.js**, **FastAPI**, and **Django**. I have successfully led initiatives integrating AI/ML capabilities for predictive analytics and intelligent automation while ensuring compliance with industry standards like HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented enterprise-level CI/CD pipelines using **Jenkins**, ensuring continuous integration and delivery for scalable cloud applications.\nArchitected cloud infrastructure using **AWS** and **GCP** with **Terraform** and **Ansible**, promoting Infrastructure as Code and enhancing deployment consistency across environments.\nLeveraged containerization technologies such as **Docker** and orchestrated applications using **Kubernetes**, enhancing scalability and resilience of applications across **9+** cloud regions.\nDeveloped robust cloud security strategies, ensuring compliance with industry standards and practices, protecting sensitive data across healthcare and financial services, effectively reducing security vulnerabilities by **40%**.\nUtilized monitoring and observability tools including **Grafana**, **Prometheus**, and **Graphite** to maintain system health and optimize resource utilization, leading to improved system performance metrics by **30%**.\nExecuted blue/green deployment strategies, minimizing downtime and risks associated with software releases, achieving **100%** successful deployment rates.\nCollaborated in a multi-functional team to enhance automation solutions, applying **Bash** and **Golang** to optimize operational workflows, reducing manual workload by **50%**.\nEngaged in continuous deployment practices, utilizing **Python**, ensuring the timely rollout of new features while maintaining the integrity of existing services.\nIntegrated comprehensive monitoring solutions, leading to actionable insights and incident response enhancements, improving incident resolution time by **25%**.\nParticipated in design discussions and code reviews, contributing extensive knowledge in Cloud and DevOps practices, fostering a culture of continuous improvement within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **AWS**, **GCP**, and **Terraform** to provision and manage cloud infrastructure, ensuring high availability and security for financial applications.\nDesigned and implemented **CI/CD** pipelines using **Jenkins** and **Docker** to automate deployment processes, reducing release time by **30%** and increasing deployment frequency to **weekly**.\nOrchestrated containerized applications using **Kubernetes**, facilitating seamless management of microservices across different environments and enhancing overall system scalability.\nDeveloped infrastructure automation scripts in **Python** and **Bash**, enabling repeatable and consistent deployments while adhering to **Infrastructure as Code** principles.\nIntegrated **Ansible** for configuration management, reducing manual setup errors and improving system reliability.\nMonitored system performance and availability with **Grafana**, **Prometheus**, and **Graphite**, achieving **99.9%** uptime and quickly resolving operational issues.\nApplied **Blue/Green Deployment** techniques to minimize downtime during application upgrades, enhancing user experience in high-availability financial systems.\nImplemented **Cloud Security** best practices and protocols, ensuring compliance with industry standards and safeguarding sensitive financial data against potential threats."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **AWS** and **GCP** to design and manage scalable cloud infrastructure, implementing **Terraform** for Infrastructure as Code to provision resources and automate deployments across environments.\nUtilized **Docker** for containerization of applications, facilitating consistent environments and enabling CI/CD pipelines with **Jenkins** for efficient software delivery.\nEngineered, deployed, and maintained microservices architecture with **Kubernetes** to orchestrate containers, ensuring high availability and scalability while monitoring performance using **Grafana**, **Prometheus**, and **Graphite**.\nImplemented **Blue/Green Deployment** strategies to minimize downtime, contributing to **99.9%** uptime and enhancing user experience during system updates.\nDeveloped backend services and APIs using **Python** and **Bash**, focusing on performance optimization and integration with various cloud services for enhanced functionality and security.\nAutomated infrastructure management using **Ansible**, ensuring consistent configurations and deployments across all environments, resulting in a **40%** reduction in manual intervention.\nApplied **Cloud Security** best practices to safeguard sensitive data and infrastructure, ensuring compliance with industry standards, including GDPR and PCI regulations.\nOrchestrated **Continuous Deployment** workflows, providing faster and safer releases with automated testing and rollback capabilities, enhancing deployment frequency to **multiple times per day**.\nCollaborated with cross-functional teams to identify and address architectures and cloud infrastructure challenges, driving operational efficiencies and contributing to a more agile development lifecycle.\nImplemented monitoring solutions to proactively identify performance bottlenecks, leading to an overall system performance improvement of **30%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Bash, Java, Golang\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), GCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose, CI/CD, Infrastructure as Code, Cloud Security, Blue/Green Deployment, Continuous Deployment\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Grafana, Prometheus, Graphite",
  "apply_company": "Cint"
}