{
  "name": "Patryk Zaslawski",
  "role_name": "Analytics Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As an Analytics Engineer with 8+ years of experience, I specialize in **data engineering concepts**, **data transformation**, and **data modeling** to deliver insightful analytics solutions. Proficient in **SQL** and experienced with **dbt** and **SQLMesh**, I excel at query optimization to enhance data retrieval efficiency. My background also includes leveraging **AI-driven tools** for advanced data analysis and utilizing blockchain data analysis for innovative solutions. Additionally, I bring strong programming skills in **Python** (FastAPI, Django, Flask, SQLAlchemy) and experience with **cloud platforms** like **AWS** and **Azure**. I have successfully developed high-performance applications in sectors such as e-commerce, finance, and healthcare, focusing on secure and scalable architecture using modern frontend frameworks including **Angular**, **Vue**, **React**, and **Next.js**. My thorough understanding of database systems, including **PostgreSQL**, **MySQL**, and **MongoDB**, ensures optimal performance and reliability in all solutions I deliver.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Analytics Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and optimized data transformations and analysis using **SQL** and **dbt** to support blockchain data analysis and reporting for complex datasets.\n- Implemented data modeling and query optimization techniques to ensure efficient data retrieval and processing, enhancing performance metrics by up to **30%**.\n- Collaborated on the development of **AI-driven tools** for predictive analytics and data insights, leveraging advanced algorithms to improve decision-making.\n- Engaged in data engineering concepts to facilitate the integration of disparate data sources, ensuring consistency and accuracy in data processing.\n- Managed and transformed data pipelines, utilizing tools like **SQLMesh** to automate and streamline data workflows, leading to a **25%** reduction in processing times.\n- Spearheaded smart contracts analysis and blockchain integration efforts, supporting secure and transparent data transactions across platforms.\n- Executed advanced data analysis techniques for qualitative and quantitative data, providing actionable insights to stakeholders, thereby increasing data-driven decisions.\n- Championed best practices in data governance and security when handling sensitive information, ensuring compliance with industry standards and regulations.\n- Mentored junior engineers on data engineering practices and provided technical guidance on **SQL** and data transformation strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Performed **blockchain data analysis** to extract insights from decentralized systems and integrated findings into data workflows.\nDeveloped and optimized **SQL** queries within data models to support efficient data transformation strategies, leveraging **dbt** for streamlined workflow management.\nEngineered robust data pipelines utilizing **SQLMesh** for improved data modeling and transformation processes, ensuring high-quality data ingestion and preparation.\nUtilized **AI-driven tools** for advanced analytics and predictive modeling to enhance data-driven decision-making and operational efficiency.\nImplemented systematic **data transformation** practices that aligned with best engineering concepts, optimizing data structure for analytical purposes.\nDesigned and documented comprehensive data models supporting various business use cases, ensuring scalability and adaptability of data assets.\nCollaborated in multi-functional teams to ensure seamless integration of **smart contracts** and blockchain technologies into existing data frameworks, enhancing data security and integrity.\nConducted **query optimization** to enhance database performance and efficiency, reducing processing time by up to **30%**.\nMonitored and maintained data integrity across various pipelines, utilizing automated tools for quality assurance and data consistency checks.\nLeveraged advanced analytics to provide actionable insights, contributing to strategic decision-making and business growth. "
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Leveraged **SQL** and **dbt** for data modeling and transformation, ensuring high-quality data pipelines that support analytics initiatives with a focus on **query optimization**.\nDesigned and implemented robust blockchain data analysis processes to extract actionable insights from smart contracts, applying advanced analytical techniques to enhance data-driven decisions.\nConducted thorough data transformations using **SQLMesh**, optimizing data flows and ensuring seamless integration across multiple data sources.\nUtilized AI-driven tools to automate repetitive data engineering tasks, improving workflow efficiency and reducing errors in the data pipeline by **30%**.\nCollaborated with cross-functional teams to develop clear data models that align with business objectives, improving accessibility and usability of data assets.\nPerformed rigorous data quality checks and validations to maintain data integrity, contributing to an overall reduction of data inconsistencies by **25%**.\nEnhanced data retrieval processes by implementing advanced SQL queries, reducing execution time on complex joins by **40%**.\nCreated comprehensive documentation for data schemas and processes to facilitate knowledge sharing and simplify onboarding for new team members.\nWorked with modern data visualization tools to present insights and trends derived from blockchain data analysis, enhancing stakeholder engagement and decision-making processes.\nDesigned and executed training programs for team members on emerging data engineering concepts, fostering a culture of continuous learning and innovation within the analytics team.\nParticipated in regular code review sessions to ensure adherence to best practices in data engineering and coding standards, contributing to a collaborative and quality-focused team environment."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, SQLAlchemy, Pydantic, Celery, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tblockchain data analysis, dbt, SQLMesh, smart contracts, data modeling, data transformation, data engineering concepts, query optimization, AI-driven tools, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}