{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Reliability Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Reliability Engineer with a strong foundation in performance analysis and root cause analysis, I leverage my 8 years of experience in the healthcare and financial sectors to enhance system reliability and efficiency. My structured working method ensures thorough documentation management, critical for compliance and improved operational metrics. I utilize machine learning insights to develop predictive maintenance strategies, optimizing Mean Time Between Repairs (MTBR). \nMy background includes overseeing the integration of mechanical systems, including pumps and mechanical seals, which are crucial for maintaining optimal performance. Additionally, I possess excellent English communication skills to convey complex technical concepts to cross-functional teams, ensuring alignment in project goals.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Reliability Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted root cause analysis and performance analysis of mechanical systems, particularly focusing on **pumps** and **mechanical seals** to ensure operational reliability and longevity.\n- Developed and maintained documentation management systems for mechanical engineering projects, ensuring clarity and accessibility for all stakeholders in compliance with industry standards.\n- Implemented a structured working method to enhance team collaboration and efficiency, facilitating improved communication in **English** across diverse teams.\n- Analyzed Mean Time Between Repairs (**MTBR**) to identify trends and improve maintenance schedules, ultimately increasing uptime of mechanical equipment by **15%**.\n- Collaborated with cross-functional teams to devise engineering solutions, implementing strategies that resulted in a **20%** reduction in downtime.\n- Created detailed performance reports on mechanical systems, enhancing data-driven decision-making and operational strategies.\n- Leveraged instrumentation techniques to monitor equipment performance and reliability, leading to enhancements in operational efficiencies.\n- Led initiatives that optimized mechanical system designs, contributing to refined engineering processes and reducing failure rates by **10%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted thorough **root cause analysis** to identify and resolve mechanical failures in pumps and mechanical seals, improving system reliability by **25%**.\nMonitored and optimized performance metrics of mechanical systems, achieving a **15% increase** in Mean Time Between Repair (MTBR) through systematic **performance analysis**.\nDeveloped and maintained comprehensive documentation management systems, ensuring that all technical specifications and operational procedures were up-to-date and easily accessible for stakeholders.\nEmployed a **structured working method** to implement instrumentation techniques for continuous monitoring of mechanical systems, effectively reducing downtime and enhancing efficiency.\nCollaborated with cross-functional teams to integrate mechanical engineering principles into reliability strategies, delivering innovative solutions tailored to operational needs.\nCommunicated complex technical information in **English** for diverse audiences, ensuring clarity in project requirements and outcomes.\nTrained junior engineers on best practices in reliability engineering, promoting a culture of continuous improvement across teams and contributing to team development."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized structured working method to conduct root cause analysis on mechanical failures, improving MTBR by **15%** through effective identification and implementation of solutions in pump systems.\nCreated detailed documentation management processes to facilitate knowledge sharing and improve performance analysis across departments, enhancing overall team efficiency by **20%**.\nEngineered and optimized mechanical systems and components, including pumps and mechanical seals, ensuring enhanced reliability and performance standards were achieved and maintained.\nEmployed instrumentation techniques to monitor system performance, enabling proactive maintenance strategies that reduced downtime by **25%** and increased operational efficiency.\nCollaborated with cross-functional teams to drive continuous improvement initiatives, using performance data and analysis to propose innovative solutions that aligned with organizational goals.\nConducted training sessions and workshops in English to elevate team skills on reliability engineering practices and documentation standards, leading to improved workforce competency.\nImplemented advanced monitoring systems to analyze pump and seal performance data, allowing for timely interventions and reducing unexpected failures by **30%**."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow, documentation management, English, performance analysis, structured working method, root cause analysis, MTBR, instrumentation, pumps, mechanical seals, mechanical engineering",
  "apply_company": "EagleBurgmann"
}