{
  "name": "Rei Taro",
  "role_name": "Senior Field Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Proficient Senior Field Engineer with over 10 years of experience in delivering exceptional customer service and problem-solving in complex engineering environments. Skilled in diagnostics and maintenance, with a strong understanding of standards such as **IEC60601-1** and **IEC62353**. Experienced in utilizing **SAP Field Service Management** to enhance operational efficiency. Known for effective communication and teamwork skills, ensuring seamless collaboration with clients and team members. Background includes significant contributions to high-stakes projects in financial platforms and AI/ML pipelines, leveraging technologies like **Python** (**FastAPI**, **Django**, **Flask**) and cloud solutions such as **AWS** and **Azure**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Applied problem-solving skills to diagnose and maintain diverse robotic systems, ensuring compliance with **IEC60601-1** and **IEC62353** standards.\n• Utilized **SAP Field Service Management** to efficiently coordinate service activities, enhancing customer service and communication with clients.\n• Developed and implemented diagnostic software solutions that streamlined maintenance tasks, resulting in a **25%** reduction in downtime.\n• Coordinated with cross-functional teams to resolve technical issues and ensure adherence to quality protocols, demonstrating exceptional teamwork.\n• Provided hands-on maintenance support, achieving a **95%** customer satisfaction rate through effective communication and resolution strategies.\n• Engaged in continuous improvement initiatives that led to a **15%** increase in operational efficiency in field service processes."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized diagnostic software for debugging and troubleshooting of equipment, ensuring functionality as per IEC60601-1 and IEC62353 standards to enhance the quality of maintenance services.\nImplemented and maintained **SAP Field Service Management** to optimize service operations, ensuring effective communication and coordination within the team and with clients.\nExercised strong problem-solving skills to address technical issues swiftly, resulting in a **20% reduction** in downtime and improving overall customer satisfaction ratings.\nCollaborated with cross-functional teams to deliver effective technical solutions and execute seamless service integration, contributing to **95% on-time project delivery**.\nChampioned customer service initiatives that included direct interaction and support, fostering positive relationships and ensuring clarity in communication and expectations.\nDeveloped and led training sessions for field service representatives, enhancing teamwork capabilities and ensuring adherence to technical standards, improved competency by **30%** among staff."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized strong problem-solving abilities to troubleshoot and maintain robotic systems and diagnostic software, ensuring operational efficiency and compliance with **IEC60601-1** and **IEC62353** standards.\nDemonstrated excellent communication skills while providing exceptional customer service, addressing client concerns, and delivering technical support effectively.\nCollaborated with cross-functional teams to streamline processes and uphold service quality within **SAP Field Service Management**, enhancing overall project outcomes.\nExecuted proactive maintenance strategies to minimize system downtime, resulting in a **20%** reduction in service calls and improved customer satisfaction ratings.\nMaintained detailed records of service activities, diagnostics, and repairs, contributing to a **15%** improvement in operational workflows.\nLed training sessions for junior engineers and service personnel, fostering teamwork and knowledge-sharing to elevate team performance and skill sets."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t\n\n **API Technologies**\n\tREST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure**\n\t\n\n **Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, robotics, maintenance, diagnostic software, IEC60601-1, IEC62353, SAP Field Service Management, problem solving, communication, customer service, teamwork",
  "apply_company": "Johnson & Johnson MedTech"
}