{
  "name": "Tomasz Lee",
  "role_name": "Senior Engineering Manager Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Engineering Manager with 9+ years of experience leading development projects and teams in a fast-paced environment. Proficient in Agile methodologies and skilled in fostering a culture of Diversity and Inclusion while ensuring strong Communication across teams. Expertise in Data-Driven decision-making and Product Management, complemented by a focus on Customer Focus and Curiosity. Proven track record of overseeing complex application architectures utilizing **Angular**, **PHP**, **MySQL**, and **Symfony**. Adept at implementing innovative strategies and optimizing development processes to enhance team performance and deliver high-quality solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineering Manager Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Led a cross-functional team utilizing **Agile** methodologies to drive the development of technical solutions for customer management, enhancing productivity by **30%**.\nManaged and prioritized product development using **Product Management** principles to ensure alignment with customer-focused objectives and market needs.\nFacilitated effective communication across diverse teams, promoting **Diversity and Inclusion** and improving collaborative efforts through **Team Leadership**.\nStreamlined engineering processes by implementing data-driven decision-making, resulting in an increase in project success rates by **20%**.\nDeveloped and maintained strong relationships with stakeholders to ensure alignment on deliverables, enhancing customer focus across the board.\nFostered a culture of **Curiosity** among team members, encouraging innovative thinking and continuous learning leading to a **15%** improvement in project turnaround times.\nDirected the architecture and execution of solutions using **Angular**, **PHP**, and **MySQL**, ensuring a robust tech stack to meet the evolving needs of the platform.\nContributed to ongoing projects with the application of **Symfony** and enhanced system performance through strategic improvements."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Led the development and implementation of project management tools using **Angular** and **PHP**, improving team collaboration and project tracking efficiency by **15%**.\n• Championed Agile methodologies, ensuring a data-driven approach to decision-making and enhancing team communication and collaboration.\n• Managed **MySQL** databases, optimizing storage and retrieval processes to improve performance metrics by **25%**.\n• Designed scalable microservices with a focus on customer-centric features, leveraging **Symfony** for backend development and enhancing product management strategies.\n• Facilitated regular communication with stakeholders to define system requirements, improving project delivery timelines by **30%**.\n• Implemented and reinforced practices of diversity and inclusion within the team, fostering an innovative and collaborative work environment.\n• Mentored junior developers and led code review sessions, enhancing overall team capability and productivity by fostering a culture of curiosity and learning.\n• Developed RESTful APIs and utilized advanced frameworks while staying ahead in technology trends to drive project success.\n• Spearheaded the integration of performance analytics, mobilizing data-driven insights for improved project trajectory assessments."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Led the development team utilizing **Angular** and **PHP** to build robust applications that enhanced customer focus and engagement, achieving a **25%** increase in user satisfaction ratings.\n• Championed Agile methodologies to foster a collaborative environment that led to the successful delivery of over **15** projects within deadlines.\n• Oversaw the architecture and database management with **MySQL**, optimizing queries which resulted in a performance increase of **30%** in data retrieval time.\n• Implemented **Symfony** frameworks to create flexible and reusable components that accelerated the development cycle by **40%**.\n• Cultivated a diverse team culture promoting inclusion, which improved team productivity and morale as reflected by internal survey scores.\n• Facilitated communication across cross-functional teams, ensuring alignment on project goals and driving successful product management practices.\n• Conducted regular training sessions to inspire curiosity and foster an environment of continuous learning within the organization.\n• Engaged in team leadership responsibilities, mentoring junior engineers to enhance their technical skills and contribute to their professional growth.\n• Actively participated in code reviews and retrospectives, emphasizing data-driven decision making to refine processes and improve project outcomes. "
    }
  ],
  "skills": " **Programming Languages** \n\t JavaScript, TypeScript, C#, PHP, Python \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, Symfony, .NET \n\n **Frontend Frameworks** \n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL \n\n **Serverless and Cloud Functions** \n\t AWS, Azure \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n **DevOps** \n\t CI/CD pipelines \n\n **Cloud & Infrastructure** \n\t Cloud technologies \n\n **Other** \n\t UX/UI Design, Git, GitHub, Agile, Diversity and Inclusion, Communication, Team Leadership, Customer Focus, Curiosity, Data-Driven, Product Management, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis",
  "apply_company": "Click&Boat"
}