{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior MES Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior MES Engineer with 13+ years of experience in delivering high-performance applications tailored for the healthcare and financial sectors. Proficient in **JavaScript/TypeScript**, **Python**, and **Flutter**, adept at developing both frontend and backend solutions utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in implementing **MES** systems that comply with FDA and GMP regulations, focusing on **CSV** processes to ensure quality and reliability. Skilled in deploying cloud-native architectures on **AWS** and **Azure**, with a strong foundation in microservices, event-driven architectures, and CI/CD pipelines. Familiar with compliance-driven development principles, particularly pertaining to HIPAA, FHIR, PCI DSS, and SOC 2 standards. Proven background in **AI/ML** applications for predictive analytics automation and real-time data processing, including MLOps for model orchestration using **MLflow**, **Airflow**, and **Kubeflow**, ensuring efficient and compliant workflows.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior MES Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and built full-stack platforms ensuring compliance with **FDA**, **GMP**, and **CSV** standards while utilizing **Python (FastAPI)**, **TypeScript**, and **Node.js**.\nDelivered applications for iOS and Android with a focus on quality and security, leveraging **Flutter** and **React Native** for mobile development to adhere to **GMP** regulations.\nDeveloped CI/CD pipelines optimized for compliance workflows using **Fastlane** and **App Center**, integrating test automation tools and ensuring traceability in accordance with **FDA** requirements.\nLed modernization projects converting legacy systems into microservices with a focus on compliance via **Docker**, **Kubernetes (AKS/EKS)**, and serverless functions to support **GMP**-compliant processes.\nMaintained data infrastructures adhering to **FDA** and **CSV** compliance using **PostgreSQL**, **MongoDB**, and **Redis**, designed to support rigorous data handling protocols.\nImplemented comprehensive testing strategies for compliance validation using tools such as **Jest**, **Cypress**, and **Postman**, ensuring applications met **GMP** standards.\nCollaborated with cross-functional teams to ensure systems operate smoothly within the MES landscape, integrating with technologies like **Opcenter**, **PharmaSuite**, and **Camstar** to optimize manufacturing processes.\nEnsured multilingual support in applications, facilitating seamless operations in both **English** and **French** while maintaining a compliance-focused approach in documentation and reporting.\nExecuted data analytics and visualization tasks using tools and frameworks aligned with compliance standards, maintaining stringent adherence to **GMP**.\nIntegrated quality control measures into all stages of development and operations, ensuring compliance with **PAS|X** protocols and enhancing overall system efficiencies."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Opcenter** and **PharmaSuite** to modernize core manufacturing execution systems (MES) by migrating to a microservices architecture, enhancing scalability and performance for high-volume production environments.\nImplemented compliance solutions in adherence to **FDA** and **GMP** standards, ensuring seamless operation within regulated industries and safeguarding product quality.\nUtilized **CSV** processes for validation and software quality assurance, facilitating 100% compliance during audits and inspections.\nDesigned and developed interactive front-end interfaces using **React** for real-time data visualization in manufacturing processes, delivering a user-friendly experience.\nIntegrated **POMS** and **Camstar** for maintaining system integrity and performance reliability across various production workflows, achieving a **30%** reduction in downtime.\nCollaborated effectively with cross-functional teams, providing support in **English** and **French**, to drive projects while ensuring critical milestones and deadlines were met.\nEstablished event-driven communication strategies using **Kafka** and **RabbitMQ**, streamlining information flow across essential manufacturing processes, such as production alerts and compliance messaging.\nConducted training sessions for staff using **MES** tools, improving operational capabilities by **25%** through enhanced user adoption and system proficiency.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Ensured compliance with **GMP** standards in the development and optimization of manufacturing execution systems (MES) tailored for the pharmaceutical industry, enhancing production efficiency and product quality.\nConducted comprehensive **CSV** (Computer Software Validation) processes to ensure that all MES applications are compliant with regulatory standards enforced by **FDA**, leading to a **30%** reduction in validation times.\nArchitected and maintained system integrations using **Opcenter**, **PharmaSuite**, and **Camstar** to streamline operations across various production environments, achieving a **25%** increase in operational efficiency.\nDeveloped and deployed features in MES applications adhering to **PAS|X** standards, which facilitated seamless data exchange and interoperability among production systems, thus improving real-time data accuracy by **40%**.\nLed training sessions in **English** and **French** for team members and stakeholders, improving system usability and ensuring smooth adoption of MES technologies across diverse teams.\nImplemented data analytics solutions that harness insights from production data, delivering real-time dashboards and reporting capabilities utilizing tools like **XFP** to enhance decision-making processes.\nUtilized **POMS** and **MES** software technologies to ensure high availability and scalability of systems in support of critical manufacturing operations, achieving a **99.9%** uptime for production processes.\nCollaborated with cross-functional teams to align MES features with business requirements, improving stakeholder satisfaction ratings by **20%** through enhanced communication and transparency in the development lifecycle."
    }
  ],
  "skills": "  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n  **API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n  **Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3; Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n  **Other:**\n\tEnglish, French, MES, FDA, GMP, CSV, PAS|X, Opcenter, PharmaSuite, XFP, POMS, Camstar",
  "apply_company": "Accenture"
}