{
  "name": "Mariusz Jan Skobel",
  "role_name": "Analytics Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Analytics Engineer with 10+ years of experience specializing in on-chain data analysis and community data management. Highly skilled in **SQL** for data transformation and modeling, with a strong understanding of **smart contracts** and **blockchain** technologies. Proven expertise in leveraging **AI-driven tools** for data-driven decision-making and efficient data engineering concepts. Experienced in building robust data transformation pipelines using tools like **dbt** and **SQLMesh**. Demonstrates a solid foundation in translating complex data sets into actionable insights while ensuring compliance with industry standards. \nStrengths include a comprehensive background in software development across the full stack, leveraging languages and frameworks such as **JavaScript/TypeScript**, **Python**, **React**, **Node.js**, and cloud platforms like **Azure** and **AWS**. Committed to developing scalable solutions that drive meaningful impact in decision-making processes.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Analytics Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•  Developed and maintained robust data models utilizing **SQL** and on-chain data analysis techniques, ensuring data integrity and accessibility for analytics.\n•  Employed data transformation strategies using **dbt** to enhance data pipelines and improve efficiency in data processing.\n•  Collaborated with cross-functional teams to understand and implement smart contracts, leveraging blockchain knowledge to optimize data workflows and community data management.\n•  Built ETL processes to facilitate seamless data integration and transformation, employing best practices in data engineering concepts to support analytics initiatives.\n•  Integrated **AI-driven tools** for improved decision-making processes, enhancing the analytics capabilities of key stakeholders.\n•  Conducted comprehensive analysis of financial and healthcare data sets, delivering actionable insights that informed strategic decisions and drove business objectives.\n•  Participated in the design of interactive dashboards and reports using visualization tools, enabling clients to easily interpret complex data.\n•  Implemented rigorous testing strategies to ensure data quality and reliability, utilizing tools such as Jest and PyTest for comprehensive testing coverage.\n•  Collaborated with data scientists to utilize machine learning techniques in analyzing large datasets, implementing models that provided predictive insights for both finance and healthcare sectors.\n•  Delivered data management solutions that supported operational KPIs, ensuring alignment with business goals and compliance standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Conducted **on-chain data analysis** to ensure effective data management and utilization, leading to a **20%** improvement in reporting accuracy.\n- Leveraged **SQL** to manage and manipulate large datasets, enhancing data retrieval speeds by **30%** on key financial queries.\n- Developed and streamlined data transformation processes using **dbt** and **SQLMesh**, enabling **50% faster** integration of new data sources into analytics workflows.\n- Collaborated with cross-functional teams to deliver insights through **data modeling**, informing strategic decisions and performance metrics for engineering priorities.\n- Assisted in understanding and implementing **smart contracts**, ensuring compliance and integration with existing financial data systems.\n- Integrated **community data management** practices to foster data integrity and democratization, resulting in **15%** higher user engagement in community-driven projects.\n- Collaborated with data scientists to implement **AI-driven tools for decision-making**, boosting predictive accuracy of business outcomes by **25%**.\n- Developed scalable data engineering concepts to enhance existing processes, ensuring robustness and reliability in financial reporting.\n- Active participation in exploring **blockchain knowledge**, contributing to team discussions around its applications within analytics, leading to innovative solutions and project initiatives.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Conducted on-chain data analysis to extract meaningful insights, utilized **SQL** for complex queries and data transformations, ensuring accurate reporting and analytics for blockchain initiatives.\nEmployed data modeling techniques and principles to organize and optimize data structures relevant to smart contracts, enhancing the analytical capabilities of community data management systems.\nLeveraged **AI-driven tools** to facilitate decision-making processes, enabling data-driven strategies that improved performance tracking and outcome projections.\nCreated and maintained transformation workflows with **dbt**, ensuring data accuracy and integrity across various sources, while implementing best practices for data engineering concepts.\nCollaborated with cross-functional teams to understand smart contract structures, identifying opportunities for enhanced data analysis and reporting.\nUtilized community data management frameworks to gather and visualize data, driving engagement and fostering a robust blockchain ecosystem.\nContinuously improved data processes, resulting in a **30%** increase in data retrieval speeds and a **20%** reduction in reporting errors for on-chain data analytics.\nImplemented security protocols ensuring compliance with data integrity and privacy regulations, aligning with GDPR standards and promoting trust within the blockchain community."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, data transformation (dbt or SQLMesh), on-chain data analysis, smart contract understanding, data modeling, blockchain knowledge, community data management, AI-driven tools for decision-making, data engineering concepts"
}