{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Programming Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Programming Engineer with over 13 years of extensive experience in software development, specializing in **C#**, **Java**, and **Python**. Proven expertise in building robust applications while integrating innovative pedagogical skills to enhance user experience, creativity in problem-solving, and patience in mentoring team members.\n\nAdvanced proficiency in **JavaScript/TypeScript**, alongside hands-on experience in frontend and backend development using frameworks such as **React**, **Node.js**, and **Django**. Strong background in leveraging cloud platforms like **AWS** and **Azure** for deploying and managing scalable, high-performance applications.\n\nAdept in implementing microservices, event-driven architectures, and CI/CD pipelines, with a proven track record in delivering compliance-driven development aligned with industry standards. Committed to continuous learning and adapting new technologies to optimize application performance and enhance user engagement.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Programming Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C#**, **Java**, **Python**, and **C++** to design and develop software solutions, ensuring optimal performance and maintainability across multiple applications.\nImplemented creative problem-solving techniques and pedagogical skills to mentor junior developers, fostering an environment of learning and growth.\nDeveloped engaging educational software for platforms like **Minecraft** and **Scratch**, enhancing user interaction and learning experiences through gamification.\nDemonstrated patience and creativity in debugging complex software issues, ensuring timely delivery of project milestones and high-quality end products.\nCollaborated with cross-functional teams to enhance coding practices and software design principles, contributing to a cohesive development process.\nApplied version control systems effectively to manage codebase and documentation, ensuring project transparency and continuity.\nParticipated in code reviews, providing constructive feedback and fostering a culture of improvement within the engineering team.\nMaintained documentation for software design and development processes, ensuring compliance with industry best practices and standards."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged proficiency in **C#**, **Java**, and **Python** to modernize core financial platforms by migrating to microservices architecture using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, enhancing scalability and performance for high-volume transactional systems.\nUtilized **React (18)**, **Vue 3**, **Next.js**, and **TypeScript** to build interactive front-end applications with Redux Toolkit and **Tailwind CSS**, creating sleek, responsive interfaces for financial tools and admin panels.\nDelivered real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies.\nDesigned and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing, handling over **1M transactions** daily.\nBuilt and deployed machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns, achieving a **95% accuracy** rate.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, processing **10,000+ predictions** per minute."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **C#** to design and optimize backend services for various applications, ensuring performance and maintainability while adhering to best practices.\nUtilized **Java** and **C++** for developing robust solutions and enhancing existing applications, improving efficiency by **25%** through optimized algorithms and data structures.\nDemonstrated exceptional **pedagogical skills** by mentoring junior developers and leading training sessions on best coding practices, fostering a collaborative learning environment.\nExhibited **creativity** in problem-solving by implementing innovative features that transformed user interactions and engagement metrics, leading to a **30%** increase in user satisfaction.\nApplied **patience** and attention to detail when debugging complex systems, ensuring high-quality delivery with a bug resolution rate of **95%** within deadlines.\nDeveloped interactive applications using **Unity**, leveraging game development principles to enhance user experience and engagement in educational software.\nEngaged with learners of diverse backgrounds through gamified experiences with **Scratch** and **Minecraft**, promoting coding literacy and engagement in programming.\nImplemented agile methodologies to streamline the software development process, resulting in a **20%** reduction in project turnaround time and improved team cohesion."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, Java, Python, C++, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, RDS, S3\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Creativity, Patience, Pedagogical skills, Minecraft, Scratch, Unity",
  "apply_company": "Coding Giants España"
}