{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Back-end Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As a skilled Back-end Software Engineer with 8 years of experience, I excel in utilizing **Node.js**, **JavaScript**, **TypeScript**, and **AWS** services including **Lambda**, **Serverless**, **SNS**, and **SQS** to create scalable applications. My expertise in **Event-driven architecture** and working with databases like **MongoDB** ensures robust back-end solutions. I have a proven track record in practicing **Continuous Integration** within Agile and Scrum methodologies, ensuring timely delivery and high-quality code through comprehensive **Unit testing**.\n\nWith a strong background in building high-performance solutions for healthcare and financial sectors, I also possess experience in modern front-end frameworks such as **React** and **Next.js**. My ability to communicate effectively and collaborate with cross-functional teams enhances project outcomes, making sure that solutions are not only innovative but also aligned with compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Back-end Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained back-end components and APIs using **Node.js** and **TypeScript**, focusing on performance and scalability to support high-demand applications.\n• Implemented serverless architectures utilizing **AWS Lambda**, **SNS**, and **SQS** to enhance application responsiveness and reduce costs, enabling event-driven architecture.\n• Designed and integrated databases with **MongoDB** to facilitate efficient data storage and retrieval for complex data sets, managing over **1 million** records seamlessly.\n• Led continuous integration initiatives employing **AWS** tools to automate testing and deployment processes, ensuring smooth delivery of features under **Agile** and **Scrum** methodologies.\n• Conducted unit testing leveraging frameworks and tools like Jest to ensure software reliability, contributing towards a **95% test coverage** across critical modules.\n• Collaborated closely with front-end development teams using **React** and **Next.js** to integrate user-facing elements, ensuring a consistent and responsive user experience.\n• Facilitated efficient communication within development teams, leveraging collaboration skills to resolve integration challenges promptly, leading to improved team dynamics and throughput.\n• Participated in code reviews to maintain code quality and adherence to best practices, helping to reduce bugs by **30%** post-deployment.\n• Provided technical guidance and mentorship to junior engineers, elevating team capabilities in handling back-end technologies effectively."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed backend services utilizing **Node.js**, **JavaScript**, and **TypeScript** to enhance system performance and reliability in a microservices architecture, improving scalability for high-volume transactions.\n• Implemented an efficient event-driven architecture using **AWS Lambda**, **SNS**, and **SQS** to facilitate real-time communication within the application, achieving a processing time reduction of **30%**.\n• Collaborated with front-end development teams leveraging **React** and **Next.js** to create seamless user experiences, ensuring that backend services integrate smoothly with the UI components.\n• Configured and managed databases using **MongoDB**, optimizing data storage and retrieval processes that supported over **1 million** financial transactions daily.\n• Led Agile and Scrum practices to enhance project delivery speed by **25%**, promoting continuous integration and supporting team collaboration through effective communication.\n• Applied unit testing strategies to ensure software reliability and quality control, achieving a test coverage improvement from **60% to 85%**.\n• Participated in knowledge sharing sessions focusing on serverless architecture and event-driven programming, enhancing team capabilities in **AWS** services and best practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed scalable backend services for a global e-commerce platform utilizing **Node.js** and **JavaScript**, ensuring high availability and low latency across crucial modules such as checkout and order fulfillment.\nEngineered event-driven architecture with **AWS Lambda**, facilitating responsive order updates and dynamic inventory tracking through the effective use of **SQS** and **SNS** for message queuing.\nImplemented **MongoDB** for distributed data storage, achieving fast and fault-tolerant access for high-traffic workflows, with performance enhancements through efficient data retrieval strategies.\nUtilized **React** and **Next.js** for building responsive, SEO-friendly user interfaces, optimizing for mobile engagement, and enhancing user experience through TypeScript integration and unit testing best practices.\nInstituted continuous integration and deployment practices within an **Agile** and **Scrum** environment, fostering collaboration and communication among team members to deliver features iteratively and efficiently.\nApplied role-based access control (RBAC) and **Event-driven architecture** to ensure secure customer and admin access, firmly adhering to GDPR compliance standards.\nConducted unit testing and implemented quality assurance protocols to maintain high standards of software performance and reliability.\nEngaged in collaborative problem-solving sessions to optimize workflows and enhance project outcomes through effective communication skills and teamwork.\nLeveraged cloud services and modern development practices to streamline backend processes and increase productivity, contributing to an overall reduction in the average response time by **25%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js, .NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Next.js\n\n**API Technologies:**\n\tAWS (Lambda, SNS, SQS), Serverless, Event-driven architecture\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tAuthentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Agile, Scrum, Unit testing, Communication skills, Collaboration"
}