{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Frontend Engineer with 8 years of experience, I specialize in leveraging **React**, **TypeScript**, and **Next.js** to create high-performance applications. My expert knowledge in **Tailwind** enhances my ability to design responsive and elegant user interfaces while implementing A/B testing and feature flags for optimized user experiences. In addition to my frontend capabilities, I have a strong foundation in modern engineering practices and UX design, ensuring that applications are not only functional but also intuitive and user-friendly.\n\nMy tech stack includes a diverse range of technologies such as **Python**, **Flutter**, **Node.js**, as well as backend frameworks like **FastAPI** and **Django**, and robust cloud experience across **Azure** and **AWS**. Furthermore, I have led the development of enterprise-grade platforms integrating AI/ML capabilities for data processing and automation, ensuring compliance with standards including HIPAA and PCI DSS. My background in microservices architecture and CI/CD automation further supports my ability to deliver secure and scalable solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and enhanced user interfaces using **React** (17-18), ensuring optimal performance and user experience aligned with **UX design** principles.\n- Utilized **TypeScript** and **Next.js** for building scalable and maintainable web applications, increasing code stability and reducing bugs by **30%**.\n- Incorporated **A/B testing** and **feature flags** to experiment with new features and improve user engagement, resulting in a **25%** increase in user retention rates.\n- Collaborated closely with designers to implement responsive and visually appealing layouts using **Tailwind**, ensuring adherence to design specifications and enabling consistent look and feel across platforms.\n- Conducted debugging and optimization of existing applications, reducing load times by **40%** through efficient coding practices and performance best practices.\n- Engaged in regular code reviews and mentorship of junior developers, sharing best practices in **React** and **TypeScript** to elevate team coding standards.\n- Integrated API functionalities and state management to enhance application interactivity, employing tools such as Redux as needed.\n- Stayed updated with emerging frontend technologies, continuously seeking to enhance application performance and user satisfaction.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **React (18)**, **TypeScript**, and **Tailwind CSS** to design and implement user-focused front-end applications, enhancing UX design for financial dashboards and admin portals.\nExecuted **Next.js** for server-side rendering, improving page load speeds by **30%** and overall user engagement.\nEmployed A/B testing and feature flags to iteratively improve UI components, resulting in a **20%** increase in user satisfaction scores.\nBuilt responsive and performant interfaces that cater to high-volume transaction systems, ensuring maintainability and scalability.\nCollaborated with cross-functional teams to refine UX design strategies, addressing user feedback and optimizing functionality.\nIntegrated real-time data visualization libraries within applications, enhancing user experience by providing comprehensive, interactive analytics dashboards."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed dynamic and responsive frontend applications using **React (18)**, **Next.js**, and **TypeScript**, enhancing user experiences while ensuring compliance with **WCAG 2.1** accessibility guidelines.\nImplemented feature flags and A/B testing strategies to optimize user engagement and conversion rates, driving data-informed decisions for product enhancements.\nUtilized **Tailwind CSS** for efficient design implementations, creating visually appealing and user-friendly interfaces tailored for mobile-first engagement.\nCollaborated closely with UI/UX designers to ensure the application architecture aligns with the best practices in UX design, promoting seamless navigation and improved user satisfaction.\nIntegrated performance monitoring tools to analyze and enhance user interaction, achieving a **30%** improvement in page load times.\nEmployed responsive design techniques to ensure application compatibility across multiple devices, improving mobile usage by **25%**.\nParticipated in code reviews and maintained documentation, improving team knowledge sharing and onboarding processes, contributing to an overall **15%** increase in team productivity."
    }
  ],
  "skills": "Frameworks & Technologies:\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular, Next.js), Tailwind\n\nArtificial Intelligence & Machine Learning:\n\tMLflow, Airflow, Kubeflow\n\nDevOps & Cloud:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\nAuthentication & Security:\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\nDatabases & Caching:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\nCI/CD & Infrastructure as Code:\n\tTerraform, Ansible, Helm, Docker Compose\n\nOther:\n\tA/B testing, Feature flags, UX design",
  "apply_company": "Relocify"
}