{
  "name": "Tomasz Lee",
  "role_name": "Senior React Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Senior React Engineer with 9+ years of experience specializing in **React.js**, **TypeScript**, and **JavaScript**. Proficient in implementing state management solutions using **Redux**, **Zustand**, and **Context API** while ensuring optimal web performance through **SSR** and **SSG** techniques. Expertise in building robust REST APIs and GraphQL services to enhance application functionality. Demonstrated understanding of **CI/CD** practices and automated testing to ensure high-quality releases. Strong background in microservices architecture and distributed systems, with hands-on experience in technologies like **Apache Kafka**, **RabbitMQ**, and **Redis**. Proven ability to lead development projects, collaborate effectively across teams, and streamline processes for impactful solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior React Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Leveraged **React.js**, **TypeScript**, and **JavaScript** to enhance the performance and maintainability of the web-based customer management platform, improving user satisfaction by **25%**.\n• Implemented **Redux** and **Zustand** for state management, improving data flow efficiency within the application.\n• Applied Web Performance Optimization techniques to achieve faster load times and responsiveness, increasing overall user engagement.\n• Developed server-side rendering (SSR) and static site generation (SSG) capabilities to enhance SEO and user experience across the platform.\n• Established CI/CD pipelines utilizing **Azure DevOps**, significantly reducing deployment time by **40%**.\n• Developed RESTful APIs, including the integration of **GraphQL** for more efficient data retrieval mechanisms.\n• Collaborated in Agile teams to enhance project delivery timelines and adapt to evolving requirements.\n• Integrated automated testing frameworks to ensure high-quality code delivery and application stability.\n• Spearheaded the design of a microservices architecture using **.NET Core**, promoting modularity and simplifying system management.\n• Enhanced application resilience through the integration of **Apache Kafka** for real-time data streaming and **RabbitMQ** for effective task queuing.\n• Utilized **Redis** for caching, resulting in a **35%** improvement in response times and reduced load on the primary database.\n• Optimized **MSSQL** database queries and indexing techniques, which reduced average query execution time by **20%**.\n• Collaborated with UX/UI designers to create an intuitive user interface, significantly improving user experience.\n• Constructed an interactive reporting engine utilizing **D3.js** and **Three.js** to visualize complex data.\n• Implemented JWT-based authentication and authorization strategies to ensure secure access to the application."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **React.js**, **TypeScript**, and **JavaScript** to develop user-friendly interfaces that improved web performance by **25%**.\nEmployed **Redux** and **Zustand** for state management, enhancing application scalability and maintainability.\nImplemented **SSR** and **SSG** strategies to optimize load times, resulting in a **20%** increase in overall user engagement.\nLed the development of **REST APIs** and integrated **GraphQL** for efficient data fetching, improving frontend-backend communication.\nDeveloped and executed automated testing strategies that increased code reliability, reducing bugs in production by **30%**.\nOversaw CI/CD processes using **GitHub Actions**, streamlining deployment cycles and reducing lead time for production releases.\nCollaborated within an **Agile** framework to adapt to changing specifications and deliver high-quality software solutions on time.\nConducted training and mentorship for junior developers in modern **React** practices, scaling team expertise effectively.\nAnalyzed user feedback and performance metrics to identify areas for optimization, contributing to an enhanced interactive experience."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **React.js**, **TypeScript**, and **JavaScript** to develop high-performance user interfaces, boosting user engagement by **25%**.\nImplemented **Redux** and **Zustand** for state management in applications, improving application scalability and maintainability.\nExecuted web performance optimization strategies, resulting in a **30%** reduction in load times across all applications.\nApplied **CI/CD** practices to streamline deployment processes, increasing release frequency to **bi-weekly**.\nConducted automated testing using Jest and React Testing Library, enhancing code reliability and reducing bugs by **40%**.\nDesigned and developed **REST APIs** and **GraphQL** endpoints for seamless communication between the frontend and backend services.\nCollaborated with cross-functional teams in an **Agile** environment to align product features with user requirements and timelines.\nParticipated in code reviews and technical discussions to uphold coding standards and best practices, resulting in a **50%** improvement in code quality efficiency.\nDelivered comprehensive technical documentation and user guides, increasing cross-team collaboration and knowledge sharing among **3 different departments**."
    }
  ],
  "skills": "  \n**Frontend Frameworks**  \n\tReactJS, TypeScript, JavaScript, Redux, Zustand, Context API, Web Performance Optimization, SSR, SSG, Agile, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS  \n  \n**Backend Frameworks**  \n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices  \n  \n**API Technologies**  \n\tRESTful API, GraphQL  \n  \n**Messaging & Caching**  \n\tApache Kafka, RabbitMQ, Redis  \n  \n**Databases**  \n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB  \n  \n**Cloud & Infrastructure**  \n\tAWS, Azure  \n  \n**DevOps**  \n\tCI/CD pipelines, automated testing  \n  \n**Other**  \n\tUX/UI Design, Git, GitHub, Python, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "INNOCV Solutions"
}