{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Field Engineer with 13+ years of robust experience in delivering technical support across healthcare and financial domains. Expertise in Imaging Systems and equipped with a strong foundation in IT Diagnosis and Network Connectivity. Competent in providing preventative maintenance and software diagnosis, ensuring seamless mechanical and electronic systems performance. Customers benefit from outstanding service and troubleshooting skills. \n\nFurther solidifying my technical acumen, I have hands-on experience with **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside proficiency in front-end and back-end development technologies such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. With a proven track record of building AI/ML-powered platforms, I have successfully integrated predictive analytics and automation into cloud-native systems on **AWS** and **Azure** utilizing microservices and event-driven architectures. Committed to quality, I implement CI/CD pipelines adhering to compliance-driven development standards including HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Provided technical support for imaging systems, ensuring optimal performance and minimal downtime through effective **preventative maintenance** and **software diagnosis** procedures.\n- Conducted **electro-engineering** assessments to troubleshoot and repair imaging systems, ensuring compliance with safety standards.\n- Delivered exceptional customer service by addressing client inquiries and resolving issues related to imaging technology and **network connectivity**.\n- Executed field operations, performing installations and technical support for advanced imaging systems in over **50 healthcare facilities**, leading to a client satisfaction rate of **95%**.\n- Managed remote service operations, utilizing diagnostic tools to identify and resolve **IT diagnosis** issues, improving first-call resolution rates by **30%**.\n- Collaborated with mechanical teams to perform diagnostics on imaging systems, applying strong **mechanical diagnosis** skills to optimize system functionality.\n- Facilitated training sessions for staff on imaging equipment, enhancing their understanding of software tools and maintenance protocols.\n- Coordinated preventative maintenance schedules for imaging systems, reducing equipment failures by **20%**.\n- Enhanced troubleshooting processes by developing detailed documentation for imaging systems, improving **remote service** workflows and customer communication.\n- Implemented new support strategies that improved **technical support** responsiveness by **40%**, ensuring timely intervention on critical imaging issues."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Provided **technical support** and **IT diagnosis** for imaging systems, ensuring seamless operation and customer satisfaction through effective troubleshooting and preventative maintenance.\nExecuted **remote service** solutions to address network connectivity issues, showcasing strong **customer service** skills by delivering timely support to clients.\nConducted **software diagnosis** on mechanical and electro-engineering systems, enhancing the reliability of field operations through systematic problem-solving techniques.\nCoordinated preventative maintenance schedules that improved equipment uptime by **25%**, implementing proactive strategies for device health monitoring and repairs.\nEffectively diagnosed and resolved mechanical issues, successfully reducing downtime by **15 hours** per equipment incident, thereby enhancing productivity.\nLeveraged data analysis tools and techniques to track performance metrics, resulting in an **18% improvement** in service response times across the region.\nDeveloped and maintained comprehensive documentation of service requests and technical interventions, ensuring a knowledge base that improved future onboarding of support personnel."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Provided **technical support** for imaging systems, ensuring optimal performance and uptime for clients through effective **preventative maintenance** strategies.\n- Delivered **software diagnosis** for various imaging applications, identifying and troubleshooting issues to maintain system integrity and functionality.\n- Conducted **electro-engineering** diagnostics to resolve complex technical problems, enhancing the reliability of imaging systems in high-demand environments.\n- Offered **mechanical diagnosis** expertise to ensure equipment met operational standards, achieving a 99% equipment uptime through rigorous maintenance inspections.\n- Delivered **customer service** excellence by responding to inquiries and providing timely solutions for imaging systems, achieving a customer satisfaction rating of **98%**.\n- Implemented **IT diagnosis** protocols to address network connectivity issues, reducing resolution times by **30%** through streamlined troubleshooting processes.\n- Executed remote service operations, utilizing cloud-based tools to provide immediate support and maintenance for imaging systems in diverse locations, increasing efficiency by **25%**.\n- Integrated comprehensive field reporting and documentation to enhance communication with internal teams and customers, improving incident tracking and service outcomes.\n- Coordinated with cross-functional teams to develop innovative solutions, contributing to the development of advanced imaging features and customer-centric enhancements."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tImaging Systems, Technical Support, Electro-engineering, Mechanical Diagnosis, Software Diagnosis, Preventative Maintenance, Customer Service, IT Diagnosis, Network Connectivity, Remote Service",
  "apply_company": "Philips"
}