{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Casino Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Casino Engineer with over 10 years of experience specializing in data-driven strategies and performance optimization within the casino industry. Proven track record in project management and campaign management, leveraging **Excel**, **Power BI**, and various **CRM** tools to drive actionable insights and enhance communication across teams. Skilled in negotiation and presentations, effectively fostering stakeholder engagement to achieve common goals.\n\nBrings a strong technical background as a Full Stack Developer with hands-on experience in **JavaScript/TypeScript**, **Python**, and **Flutter**, utilizing frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept in cloud-native application development on **Azure** and **AWS**, significantly contributing to enterprise platforms that harness AI/ML capabilities for real-time analytics and automation. Experienced in microservices architecture and CI/CD automation, ensuring compliance with standards like HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about creating impactful systems that are both technically robust and aligned with business objectives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Casino Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Delivered data-driven solutions to optimize performance in casino operations by implementing modern analytics frameworks like **Power BI** for real-time insights into player behavior and game performance metrics.\n• Managed the integration of customer relationship management (CRM) systems to enhance player engagement and retention through targeted campaigns and effective negotiation strategies.\n• Utilized **Excel** for advanced financial modeling and reporting, providing critical insights that facilitated project management and strategic decision-making across various casino departments.\n• Designed and executed comprehensive campaign management strategies, leveraging data analytics to maximize player participation and profitability in gaming events.\n• Spearheaded performance optimization initiatives, employing data analysis techniques to identify and resolve operational inefficiencies, enhancing overall visitor experience and satisfaction.\n• Collaborated with cross-functional teams to develop and present compelling visual presentations, utilizing data narratives to communicate project progress and outcomes to stakeholders.\n• Implemented structured project management methodologies to ensure timely delivery of casino engineering projects, fostering effective communication among diverse teams and stakeholders."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Led data-driven development projects aimed at enhancing casino operations, focusing on performance optimization and project management to ensure timely delivery of high-quality solutions.\nLeveraged **Power BI** to create interactive dashboards, enabling effective campaign management and performance analysis for casino marketing initiatives.\nUtilized **Excel** for in-depth data analysis and reporting, presenting findings to stakeholders to support strategic decision-making in casino management.\nImplemented CRM tools to improve user engagement and retention strategies, resulting in a measurable increase in customer loyalty and satisfaction.\nFostered strong communication channels within teams and across departments through effective presentation of project milestones and technical solutions, enhancing collaboration among stakeholders.\nApplied negotiation skills to secure favorable project terms and vendor agreements, optimizing resource allocation and project costs.\nUtilized performance optimization strategies during development to enhance application speed, reliability, and user experience in various casino software solutions.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented data-driven strategies to enhance performance optimization and campaign management for casino systems in a fast-paced environment.\nLed project management efforts, ensuring timely delivery and alignment with business goals, resulting in a **15%** increase in overall campaign efficiency.\nUtilized **Excel** and **Power BI** to analyze performance metrics, providing actionable insights for decision-making and stakeholder presentations.\nLeveraged **CRM** systems to enhance customer engagement and retention strategies, fostering stronger relationships and improving overall user experience.\nFacilitated communication across teams to ensure cohesive collaboration while negotiating and managing contracts with third-party vendors, leading to cost savings of up to **20%**.\nDesigned and optimized systems that facilitate real-time data access and analytics, ensuring responsiveness and agility in casino operations.\nApplied cutting-edge technologies to streamline workflow processes and improve system efficiencies, ultimately driving better experience for users and stakeholders."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython (FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t(Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tdata-driven, casino, negotiation, Excel, Power BI, CRM, campaign management, performance optimization, project management, communication, presentation",
  "apply_company": "Ludicrum"
}