{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer in Test",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a results-driven Senior Software Engineer in Test with 8+ years of experience, I possess a comprehensive skill set in **Playwright**, **REST Assured**, **k6**, **GitLab CI/CD**, **Docker**, **TypeScript**, and **Java**. My expertise in **SQL** underpins robust data interactions, while my deep understanding of the **Defect Lifecycle**, **Testing Processes**, and **Test Design Techniques** ensures the delivery of high-quality software solutions. I excel in collaboration, time management, and clear communication, fostering effective teamwork to achieve project objectives. Additionally, my background as a Full Stack Developer includes proficiency in **Python** (FastAPI, Django, Flask, SQLAlchemy), frontend frameworks like **Angular**, **Vue**, **React**, and **Next.js**, and cloud platforms such as **AWS** and **Azure**. I am committed to leveraging my skills to enhance system performance and reliability, driving successful outcomes aligned with industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer in Test",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Playwright** for end-to-end testing of cloud-native applications, ensuring functionality and performance across multiple browsers and devices, improving test coverage by **30%**.\nImplemented **REST Assured** for RESTful API testing, validating endpoints and response formats, which reduced defects reported by stakeholders by **25%**.\nAutomated load testing using **k6**, simulating user traffic and analyzing performance metrics, resulting in optimized response times by **20%**.\nConfigured CI/CD pipelines with **GitLab CI/CD** to streamline testing and deployment processes, achieving reliable version control and automated test executions.\nContainerized applications and testing environments using **Docker**, enhancing consistency across development, testing, and production stages.\nDeveloped robust test scripts in **TypeScript** and **Java**, utilizing best practices in test design techniques to ensure thorough validation of functionalities in healthcare platforms.\nCollaborated with cross-functional teams, enhancing project outcomes through clear communication and effective collaboration, leading to a **15%** increase in project efficiency.\nManaged the defect lifecycle meticulously, employing attention to detail to track, prioritize, and resolve issues quickly, decreasing overall bug resolution time by **40%**.\nCoordinated and managed time effectively across multiple testing initiatives, ensuring deliverables met project timelines and quality standards.\nConducted thorough SQL-based database testing to validate data integrity and accuracy, ensuring seamless integration with application data flows.\nGuided junior engineers in testing processes and methodologies, fostering a culture of quality and continuous improvement within the team.\nChampioned the integration of test design techniques to align with agile practices, enhancing the adaptability and responsiveness of testing efforts to meet evolving project needs.\nPromoted effective communication strategies to keep stakeholders informed on testing progress and outcomes, facilitating timely decisions and project advancements."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Designed and implemented comprehensive testing solutions using **Playwright**, **REST Assured**, and **k6** to validate and enhance application performance and reliability across diverse environments.\nDeveloped and executed test scripts in **Java** and **TypeScript**, ensuring compatibility with existing microservices and backend architecture, while applying robust test design techniques to improve coverage and effectiveness.\nIntegrated **Docker** for containerization of testing environments, streamlining processes and enabling consistent test execution across various platforms.\nManaged **GitLab CI/CD** pipelines for automated testing, ensuring prompt feedback and adherence to quality assurance standards in collaboration with development teams.\nMonitored and improved test processes, focusing on defect lifecycle management, enhancing issue identification, and resolution efficiency, contributing to overall project success.\nCollaborated with cross-functional teams to communicate test results, share insights, and foster a culture of continuous improvement in testing methodologies.\nImplemented detailed documentation on testing processes, promoting clear communication and knowledge sharing among team members.\nApplied strong time management and attention to detail to balance multiple testing projects, ensuring deadlines were met while maintaining quality and standards.\nContributed to training and mentoring junior team members in **Java/Kotlin** testing frameworks and methodologies, enhancing their skills and expanding team capabilities.\nConducted regular code reviews to ensure adherence to testing best practices, fostering a collaborative environment focused on excellence in software development and testing."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Executed comprehensive testing processes to ensure the quality and performance of backend services for an e-commerce platform using **Java**, **Python** (FastAPI, Django, Flask) and **SQL** technologies.\nLeveraged **Docker** for containerization, streamlining the deployment of applications and ensuring consistent test environments across multiple setups.\nDesigned and implemented test strategies using **REST Assured** for API testing, validating endpoints handling high-volume transactions and ensuring robust functionality.\nDeveloped automated test cases utilizing **TypeScript** and **Playwright** for frontend testing, enhancing cross-browser compatibility and user interface performance.\nCollaborated with development teams to establish a CI/CD pipeline using **GitLab CI/CD** to ensure continuous integration and early defect detection throughout the software development lifecycle.\nManaged performance testing procedures with **k6** to simulate real-world traffic, identifying bottlenecks and optimizing application performance to handle user load effectively.\nApplied attention to detail in defect lifecycle management, ensuring swift resolution of issues and seamless communication among team members.\nConducted exploratory and regression testing across different modules, fostering collaboration to validate business requirements and enhance end-user experience.\nUtilized unit testing frameworks in **Java/Kotlin** and **Python** (such as JUnit and PyTest) to maintain high code coverage and improve software quality.\nImplemented test design techniques to create efficient, reusable test cases, significantly reducing testing time while maintaining thorough coverage.\nCoordinated closely with cross-functional teams, demonstrating effective clear communication and strong time management skills to prioritize tasks and meet tight deadlines.\nMaintained documentation for testing processes and defect tracking, ensuring clarity and consistency throughout the testing efforts."
    }
  ],
  "skills": "  **Programming Languages:**\n    Python, TypeScript, Java, Java/Kotlin, SQL\n\n  **Backend Frameworks:**\n    FastAPI, Django, Flask, Spring Boot\n\n  **Frontend Frameworks:**\n    Angular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n  **API Technologies:**\n    REST & gRPC APIs, REST Assured\n\n  **Serverless and Cloud Functions:**\n    AWS (Lambda), Azure (App Services)\n\n  **Databases:**\n    PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n  **DevOps:**\n    Docker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n  **Cloud & Infrastructure:**\n    AWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n  **Other:**\n    SQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, k6, Playwright, Defect Lifecycle, Testing Processes, Test Design Techniques, Clear Communication, Collaboration, Time Management, Attention to Detail",
  "apply_company": "ProgressSoft Corporation"
}