{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Support Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "A results-driven Senior Support Engineer with extensive technical expertise in **SaaS** applications and **SQL** databases, adept at leveraging tools such as **Zendesk**, **JIRA**, **Linear**, and **Sendgrid** to deliver exceptional customer support. Recognized for exceptional **Technical Writing** and strong **Communication** skills, I excel in **Problem Solving** and **Analytical Thinking**, ensuring seamless operations and user satisfaction. With 8 years of experience as a Full Stack Developer, I have a proven track record of building high-performance solutions, focusing on **JavaScript**, **TypeScript**, **Python**, and **Flutter** technologies, while utilizing frameworks and libraries such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My strong cloud background encompasses **Azure** and **AWS**, and I have led the development of features that integrate AI/ML capabilities for enhanced functionality, alongside solid experience in microservices architecture, event-driven systems, and CI/CD automation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided exceptional **Customer Support** for software-as-a-service (**SaaS**) products, ensuring customer satisfaction and timely resolution of issues, leading to a **30%** increase in positive feedback ratings.\nDeveloped and maintained SQL queries for data analysis and reporting using **Metabase**, improving visibility into customer data and operational performance by **25%**.\nUtilized **Zendesk** to manage support tickets efficiently, achieving a **20%** reduction in response time through effective ticket prioritization and resolution.\nCollaborated closely using **JIRA** and **Linear** to track progress on customer-reported issues and enhancements, ensuring clear communication across teams and timely updates for stakeholders.\nDemonstrated **Technical Writing** skills by creating comprehensive documentation for product updates and support procedures, enhancing the onboarding experience for new customers by **15%**.\nEmployed **Problem-Solving** skills to troubleshoot and resolve complex technical issues, leading to improved customer retention by **10%**.\nMaintained clear and effective **Communication** with clients and team members, fostering strong **Relationship Building** that resulted in better resolution times and customer loyalty.\nApplied **Analytical Thinking** to identify trends in support requests, allowing proactive updates and feature requests that aligned with customer needs and business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Provided expert **customer support** for SaaS applications, ensuring high availability and satisfaction for users conducting financial transactions.\n- Analyzed and resolved technical issues efficiently through the use of **SQL** queries and database troubleshooting in a **PostgreSQL** environment, achieving a **95%** resolution rate on first contact.\n- Collaborated with cross-functional teams using **JIRA** and **Linear**, enabling better communication, project tracking, and fostering strong relationships among stakeholders.\n- Created and maintained comprehensive **technical writing** documents, user guides, and troubleshooting articles, enhancing support resources and reducing repetitive queries by **30%**.\n- Leveraged **Metabase** for effective data visualization and reporting, enabling stakeholders to derive insights from operational metrics, thus improving decision-making processes.\n- Engaged actively in **problem-solving** initiatives, utilizing analytical thinking to identify recurring issues and develop sustainable solutions, contributing to a **20%** reduction in customer complaints.\n- Coordinated the integration and usage of **Sendgrid** for automated customer communications regarding updates and notifications, resulting in increased engagement.\n- Fostered strong communication and relationship-building with clients, ensuring their needs were prioritized and effectively managed throughout the support lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Delivered exceptional **customer support** by leveraging analytical thinking to resolve technical issues related to backend services and integrations.\nUtilized **SQL** for effective data analysis and reporting, enhancing support processes and ensuring accurate troubleshooting for customers.\nManaged and tracked support queries using **JIRA** and **Zendesk**, improving communication and relationship building with stakeholders through timely updates and resolutions.\nDesigned and documented technical processes and workflows to facilitate knowledge sharing, enhancing team efficiency and support quality. Leveraged **Metabase** for data visualization to identify common support issues and areas for improvement.\nApplied problem-solving skills to handle complex support requests, ensuring a seamless customer experience and fostering positive relationships with users.\nCollaborated with development teams to communicate customer needs and feedback, driving iterative improvements to the SaaS platform.\nDeveloped training materials and conducted technical writing for team members, enhancing overall team knowledge and capabilities.\nImplemented a self-service support model utilizing **Sendgrid** for automated communication, improving response times and customer satisfaction rates.\nActively utilized **customer support** metrics to analyze trends and propose data-driven enhancements to support operations, contributing to a **20% improvement** in resolution time.\nEnsured compliance and security measures were adhered to during customer interactions, maintaining high standards for **GDPR** compliance while handling sensitive information."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, SQL, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Customer Support, SaaS, Metabase, Zendesk, JIRA, Linear, Sendgrid, Technical Writing, Problem Solving, Communication, Relationship Building, Analytical Thinking",
  "apply_company": "Sona"
}