{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Sales Engineer with 13+ years of experience in delivering high-performance solutions for diverse industries, including healthcare and finance. Exceptional communication and negotiation skills, with a proven track record in customer consulting and proposal preparation to understand and meet client needs effectively.\nExpertise in utilizing CRM tools and MS Office for streamlined sales processes, enhancing customer relations, and driving growth. Bilingual in Italian, English, and German, facilitating engagement with a broader client base.\nPossesses a strong technical foundation in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, combined with hands-on experience in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in developing AI/ML-based platforms and deploying cloud-native solutions on **AWS** and **Azure**. Skilled in implementing **microservices**, **event-driven architectures**, and **CI/CD** pipelines, and well-versed in compliance standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed strong relationships with clients through effective **communication** and **customer consulting**, leading to **increased sales** performance.\nPrepared and delivered technical proposals that align with client needs, utilizing expertise in **MS Office** to create compelling presentations and documents.\nUtilized **CRM** systems to manage and track customer interactions, ensuring timely follow-ups and effective client engagement.\nConducted in-depth **negotiations** to secure contracts while maximizing profitability, demonstrating an ability to balance technical knowledge with **sales** prowess.\nFostered a multilingual environment by supporting clients in **Italian**, **English**, and **German**, enhancing customer satisfaction and retention.\nCollaborated with technical teams to provide tailored solutions based on deep understanding of **electrical engineering** products and services, driving effective problem-solving.\nLed training sessions on product features and benefits to empower the sales team, improving overall productivity and consistency in **proposal preparation**.\nAchieved a **20%** growth in territory sales through strategic planning and execution of market penetration initiatives.\nAnalyzed customer feedback to inform product development, leveraging insights to enhance the overall client experience and adjust sales tactics.\nMaintained comprehensive knowledge of industry trends and competitive landscape to effectively position products and services during client discussions."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **MS Office** for developing sales presentations and proposals, ensuring clarity and professionalism in communications to prospective clients.\nUtilized **CRM** systems to track customer interactions and sales pipeline activity, enhancing customer satisfaction and retention rates.\nDeveloped technical presentations and led discussions with clients, applying strong **communication** and **negotiation** skills to meet customer needs effectively.\nPerformed in-depth assessments of electrical engineering solutions and communicated these to customers in **Italian**, **English**, and **German** to support diverse clientele.\nCollaborated with cross-functional teams to deliver customized proposals, resulting in a **20%** increase in successful contract bids over **12 months**.\nFacilitated customer consulting sessions by providing tailored solutions based on thorough analysis of their requirements and industry best practices.\nConsistently achieved sales targets with a **15%** year-over-year growth in revenue through effective strategy and relationship building with key stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized exceptional **communication** skills to engage with clients, ensuring a thorough understanding of their needs and aligning solutions with their business requirements.\nConducted **customer consulting** sessions to identify potential electrical engineering solutions, leveraging expertise to drive **proposal preparation** and enhance client satisfaction.\nFacilitated numerous successful negotiations, consistently achieving favorable terms and increasing sales by **15%** within **6 months**.\nMaintained and operated the **CRM** system to track customer interactions and sales activities, leading to improved response times and efficiency in client communications.\nDeveloped dynamic presentations utilizing **MS Office** tools to effectively showcase product offerings and technical specifications to diverse client bases in **Italian**, **English**, and **German**.\nEngineered tailored solutions for clients in the electrical engineering sector, fostering long-term relationships that resulted in **20%** annual revenue growth.\nParticipated in the development and enhancement of client proposals, ensuring comprehensive documentation and alignment with technical specifications, showcasing the firm’s capabilities effectively.\nChampioned the delivery of customer feedback to internal teams, utilizing insights to refine product offerings and enhance overall market competitiveness.\nLed cross-functional teams in a collaborative approach to identify client challenges and implement strategic sales initiatives that increased market presence by **30%**. \nRegularly provided training and support to junior sales staff on effective negotiation techniques and customer relationship management strategies, fostering team development."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code:\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tSales, Electrical Engineering, Customer Consulting, Proposal Preparation, CRM, MS Office, Negotiation, Communication, Italian, English, German",
  "apply_company": "Personalberatung Rochus Mummert"
}