{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Support Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Experienced Senior Support Engineer with a strong analytical mindset and exceptional troubleshooting abilities, leveraging 13+ years in technology to resolve complex issues across diverse systems, including **electromechanical systems**, **optics**, and **image processing**. A proactive problem-solver adept at fostering positive **customer relations** and collaborating within teams to drive effective solutions.\nPossessing a robust technical background in **JavaScript/TypeScript**, **Python**, and **Flutter**, I am well-versed in both frontend and backend environments, particularly with **React**, **Node.js**, and **Django**. My innovative approach has led to the development of AI/ML platforms that harness predictive analytics and automation, adapting seamlessly to the evolving demands of the healthcare and financial industries.\nI have hands-on experience deploying cloud-native solutions via **AWS** and **Azure**, implementing microservices and CI/CD practices to enhance performance and reliability. My commitment to compliance ensures alignment with standards such as HIPAA, FHIR, PCI DSS, and SOC 2, while my expertise in MLOps tools like **MLflow**, **Airflow**, and **Kubeflow** supports advanced model management.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized strong analytical and problem-solving skills to troubleshoot and resolve issues in semiconductor and electromechanical systems, enhancing operational efficiency and customer satisfaction by **20%**.\nCollaborated with cross-functional teams to engineer advanced optical and image processing solutions, integrating cutting-edge technologies to improve system performance by **15%**.\nProvided exceptional customer relations support, effectively communicating complex technical concepts to clients and ensuring clear understanding of mechanical and electro-optical system functionalities, leading to a decrease in support tickets by **30%**.\nLed teamwork initiatives that promoted cohesive project development, resulting in the successful deployment of multi-disciplinary projects ahead of deadlines by an average of **2 weeks**.\nConducted comprehensive analyses of mechanical systems, identifying and implementing improvements that drove a **25%** increase in reliability across devices.\nDeveloped standardized troubleshooting protocols for electro-optical systems, enhancing response time by **35%** and improving first-contact resolution metrics.\nEngaged in proactive problem-solving efforts, leveraging technical acumen to anticipate potential issues and mitigate risks in ongoing projects, ultimately maintaining a **98%** satisfaction rate among stakeholders.\nFostered collaborative relationships to support the successful integration of semiconductor technologies in various engineering projects, resulting in enhanced product offerings and market differentiation."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **analytical** skills to troubleshoot and resolve complex issues within semiconductor-based systems, ensuring maximum uptime and performance for clients.\nCollaborated effectively with cross-functional teams, demonstrating strong **teamwork** abilities to achieve project milestones and enhance customer satisfaction.\nApplied **problem-solving** techniques to diagnose and address challenges in **electromechanical** and **electro-optical systems**, consistently exceeding client expectations in service delivery.\nEngaged in direct **customer relations** to gather feedback and provide technical support, contributing to a **35%** increase in customer satisfaction ratings.\nConducted thorough evaluations of **mechanical systems** to identify areas for improvement, resulting in a **20%** reduction in operational costs.\nDelivered technical presentations and documentation concerning **image processing** and **optics**, leading to a **50%** improvement in communication effectiveness with clients and internal stakeholders.\nImplemented a systematic approach for **troubleshooting** that reduced issue resolution time by an average of **40%** across various projects."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Executed troubleshooting and problem-solving for complex mechanical, electromechanical, and electro-optical systems, ensuring high-performance standards and customer satisfaction.\nLeveraged analytical skills to diagnose and resolve issues in semiconductor manufacturing processes, contributing to increased efficiency and reduced downtime by **15%**.\nCollaborated with cross-functional teams to enhance troubleshooting protocols that improved customer relations and engagement, achieving a **20%** reduction in response times.\nProvided technical support in image processing and optics, facilitating effective communication of complex solutions to stakeholders and customers.\nIdentified and resolved communication bottlenecks in mechanical systems, implementing corrective actions that improved overall system functionality by **25%**.\nParticipated in teamwork initiatives that fostered collaborative problem-solving, leading to innovative solutions for customer-related challenges.\nCreated documentation and training materials aimed at empowering team members and clients, streamlining onboarding processes, and improving technical understanding across systems.\nConducted thorough system audits to ensure compliance with industry regulations and standards, maintaining operational integrity and quality assurance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\t\n\n **Frontend Frameworks:**\n\t\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAuthentication & Security:\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\n **Other:**\n\ttroubleshooting\n\tanalytical\n\tproblem-solving\n\tcustomer relations\n\tteamwork\n\tmechanical systems\n\telectromechanical systems\n\telectro-optical systems\n\toptics\n\timage processing\n\tcommunication",
  "apply_company": "KLA"
}