{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Geotechnical Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Proficient in **Project Management**, with a strong emphasis on **Problem Solving**, **Teamwork**, and **Communication**, bringing over 13 years of experience in engineering and technical project execution. Demonstrated ability to manage complex site investigations and design processes within the geotechnical field while ensuring compliance with industry standards. Adept in delivering projects that integrate advanced engineering principles and collaborate seamlessly with multidisciplinary teams. Additionally, I possess a robust background in Full Stack Development, skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in both frontend and backend technologies such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in leveraging cloud services like **AWS** and **Azure**, and implementing microservices architectures. My technical portfolio also includes AI/ML platforms developed for predictive analytics, alongside a strong adherence to compliance with regulations such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Geotechnical Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted site investigations to assess soil conditions and potential geotechnical issues, ensuring compliance with design specifications and regulatory requirements.\nImplemented advanced geotechnical design strategies for projects, utilizing effective problem-solving techniques to address complex site challenges.\nManaged multiple civil engineering projects from inception to completion, including planning, execution, and resource allocation, ensuring alignment with project timelines and budgets.\nCollaborated with cross-functional teams, fostering effective communication and teamwork to deliver high-quality geotechnical solutions under tight deadlines.\nEstablished and maintained project documentation and reports, enhancing transparency and accountability across project stakeholders.\nLed geotechnical assessments and analyses, applying methods grounded in sound engineering principles to inform project design and specifications.\nDeveloped innovative geotechnical engineering solutions, leveraging technology and industry best practices to optimize project outcomes.\nOversaw site investigation operations, including borehole drilling and sampling, to collect critical data for geotechnical analysis and modeling.\nPresented findings and project updates to clients and stakeholders, ensuring clear communication of technical concepts and recommendations.\nConducted risk assessments for potential geotechnical hazards, contributing to enhanced project safety and sustainability."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted site investigations and assessments, applying advanced **design** principles and structural integrity evaluations to ensure the stability and safety of geotechnical projects.\nUtilized **project management** skills to oversee multiple projects simultaneously, ensuring adherence to timelines and budget constraints while delivering exceptional results.\nCollaborated with cross-functional teams to effectively communicate complex engineering concepts, fostering a cohesive environment focused on achieving project objectives and client satisfaction.\nImplemented innovative **problem-solving** techniques to address unforeseen geotechnical challenges, resulting in enhanced project efficiency and risk mitigation.\nLed the development and execution of geotechnical engineering strategies, applying **Civil Engineering** expertise to produce high-quality designs and comprehensive reports.\nCultivated strong teamwork across disciplines to enhance project delivery, leveraging diverse perspectives to drive successful outcomes in the field.\nPresented findings and recommendations to stakeholders, demonstrating strong **communication** skills to facilitate informed decision-making in project planning and execution."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conduct comprehensive site investigations to assess geological conditions and inform design decisions, ensuring adherence to best practices in **Geotechnical Engineering** and **Site Investigation**.\nManage multidisciplinary project teams, fostering **Teamwork** and effective **Communication**, while ensuring project timelines and budgets are met.\nDesign and evaluate geotechnical structures, incorporating innovative methodologies and **Problem Solving** strategies to address complex engineering challenges.\nUtilize advanced software tools and technology, including **Civil Engineering** design software, to simulate and visualize project outcomes for stakeholder presentations and documentation.\nLead the planning and execution of projects, coordinating closely with contractors and other engineering disciplines to ensure successful design implementation and compliance with engineering standards.\nPrepare detailed reports and presentations, clearly articulating findings, recommendations, and design concepts to clients and project stakeholders, emphasizing key project metrics.\nConduct risk assessments and develop contingency plans to address potential site and project challenges, ensuring project resilience and stakeholder confidence.\nFacilitate project meetings and technical discussions, promoting open feedback channels and collaborative problem resolution among team members and clients.\nTrain and mentor junior team members on best practices in **Civil Engineering**, enhancing team capabilities and contributing to professional development within the organization."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\n **Frontend Frameworks:**\n\n **API Technologies:**\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code:\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\n **Other:**\n\tCivil Engineering\n\tGeotechnical Engineering\n\tSite Investigation\n\tDesign\n\tProject Management\n\tProblem Solving\n\tTeamwork\n\tCommunication",
  "apply_company": "Binnies"
}