{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Product Manager",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a results-driven Senior Product Manager with over 8 years of cross-functional collaboration experience, I excel in product management and strategic planning. My expertise in **User Experience (UX)** design and **Data Analysis** enhances product development, ensuring alignment with market needs and customer discovery initiatives. Skilled in **A/B Testing** to validate product features, I prioritize stakeholder alignment and roadmap management, driving decisions that support product excellence. With strong communication skills and a focus on **SaaS** solutions, I bridge technical and business teams to deliver successful outcomes. My background in software engineering as a Senior Python Full Stack Developer ensures a deep understanding of technology, having developed modern applications using **Python** (FastAPI, Django, Flask, SQLAlchemy) and frontend frameworks like **Angular**, **Vue**, **React**, and **Next.js**. I am well-versed in deploying applications on **AWS** and **Azure**, optimizing databases with **PostgreSQL**, **MySQL**, and **MongoDB**, and applying microservices architecture alongside **REST**/gRPC API development.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Product Manager",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Conducted data analysis to inform the development of a scalable Healthcare Experience Platform, prioritizing user experience (UX) and aligning product features with stakeholder needs.\n- Collaborated cross-functionally with engineering, design, and marketing teams to define the product roadmap and ensure alignment with customer discovery insights and market research.\n- Managed A/B testing processes to evaluate feature effectiveness and improve user engagement within the product using **Python**, leading to a **30%** increase in user satisfaction.\n- Facilitated communication among stakeholders, synthesizing feedback and data to guide product decision-making, enhancing product outreach in the SaaS healthcare marketplace.\n- Established strong prioritization strategies for product features based on user feedback and competitive analysis, resulting in a **15%** improvement in feature adoption rates.\n- Leveraged my expertise in **Python** and cloud-native practices to advise on technical feasibility of product features while maintaining a focus on user experience and compliance.\n- Fostered an environment of continuous improvement by mentoring junior team members on best practices in product management, communication, and collaboration, thereby streamlining the product development process.\n- Championed customer discovery initiatives through interviews and surveys, leading to actionable insights that informed the product roadmap and user experience enhancements.\n- Developed detailed market research reports to support decision-making, facilitating discussions on product direction and aligning team efforts towards common goals.\n- Orchestrated regular cross-functional meetings to ensure stakeholder alignment and communicate progress, risks, and opportunities related to the product lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Collaborated cross-functionally to drive product roadmap management, ensuring alignment with business goals and stakeholder expectations.\nConducted market research and data analysis to inform product decisions, maximizing user experience (UX) and addressing customer needs through iterative A/B testing strategies.\nLed customer discovery initiatives to prioritize features and enhancements, leveraging insights to improve product usability and performance.\nFacilitated communication between engineering, design, and marketing teams to enhance collaboration and streamline products as SaaS solutions.\nManaged the development lifecycle of product features, ensuring timely delivery and adherence to product specifications while employing effective prioritization techniques.\nUtilized agile methodologies to enhance decision-making processes, ensuring the alignment of team efforts towards achieving product objectives and timely releases.\nAnalyzed user feedback and engagement data to inform product iterations, ensuring a continuous improvement cycle based on real-time insights.\nExecuted initiatives that improved user retention by **25%** through enhanced UX strategies derived from customer research findings and A/B testing results.\nDeveloped comprehensive product documentation and presentations for key stakeholders, effectively communicating vision and updates to ensure alignment and support throughout the organization.\nMaintained close monitoring of product performance metrics and KPIs, making data-driven decisions to refine product strategy and execution.\nFostered a culture of collaboration and innovation within teams, ensuring that all contributions towards the product's success were recognized and valued."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Led cross-functional collaboration to define product roadmaps and prioritize features based on market research and customer discovery insights, driving the execution of strategies for a SaaS e-commerce platform.\nManaged stakeholder alignment processes, ensuring clear communication and expectations across teams resulting in a **30%** increase in project delivery speed.\nAnalyzed data through A/B testing to enhance user experience (UX) and optimize product features, contributing to a **25%** uplift in user engagement metrics.\nUtilized strategic decision-making to navigate product lifecycle challenges, aligning development efforts with business objectives and market needs.\nFacilitated the development of user-centric features, leveraging rigorous customer feedback loops and usability testing for continual enhancement.\nConducted in-depth market research to identify emerging trends and inform product direction, ensuring competitive positioning in the marketplace.\nCoordinated with engineering and design teams to ensure seamless integration and implementation of product features, maintaining high standards of quality and user satisfaction.\nPresented product vision and roadmap updates to stakeholders, enhancing transparency and facilitating informed decision-making throughout the organization.\nUtilized data analysis skills to extract insights from user interactions, guiding the prioritization of product features and improvements for maximum impact.\nFostered an environment of collaboration amongst diverse teams, cultivating strong communication skills to share progress and challenges effectively."
    }
  ],
  "skills": "**Product Management**\n\tProduct Management, SaaS, User Experience (UX), A/B Testing, Customer Discovery, Data Analysis, Cross-Functional Collaboration, Roadmap Management, Stakeholder Alignment, Market Research, Communication Skills, Prioritization, Decision Making\n\n**Frameworks & Technologies**\n\tPython (FastAPI, Django, Flask), SQLAlchemy, Pydantic, Celery, REST & gRPC APIs, Spring Boot, Angular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Cloud & DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Database Management & Optimization**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**API Technologies**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions**\n\tAWS Lambda, Azure Functions\n\n**Other**\n\tCommunication Skills, Decision Making"
}