{
  "name": "Tomasz Lee",
  "role_name": "AI Full-stack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven AI Full-stack Engineer with 9+ years of experience in developing robust applications, specializing in cloud deployment strategies and web services. Proficient in **React.js**, **Node.js**, **Python**, and frameworks such as **FastAPI**, **Flask**, and **Django**. Expertise in building RESTful APIs and integrating machine learning capabilities into applications. Experienced in cloud services including **AWS**, **Azure**, and **GCP**, along with containerization technologies like **Docker**. Strong background in agile methodologies and effective communication, with a proven track record of leading projects to successful completion and optimizing performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "AI Full-stack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed scalable web applications utilizing **React.js** and **Node.js**, contributing to an increase in user engagement by **20%**.\nDesigned and implemented RESTful APIs to ensure seamless integration with machine learning models, leveraging technologies such as **FastAPI** and **Flask**.\nCollaborated with cross-functional teams in an **Agile** environment to deliver high-quality software solutions within tight deadlines.\nEmployed cloud deployment strategies on **AWS**, **Azure**, and **GCP**, ensuring high availability and optimized performance of applications.\nIntegrated containerization techniques using **Docker**, resulting in streamlined development and deployment processes.\nUtilized advanced AI and machine learning techniques to enhance application capabilities, improving data processing efficiency by **30%**.\nEnsured secure application architecture through effective implementation of authentication and authorization protocols like JWT.\nFacilitated effective communication across teams to align on project objectives and deliverables, leading to a remarkable **15%** increase in project success rates.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and maintained RESTful APIs using **Node.js** and **FastAPI** to support AI-driven applications, ensuring seamless integration with various web services.\nDesigned and implemented cloud deployment strategies on **AWS** and **Azure**, facilitating a scalable infrastructure for AI solutions that improved deployment times by **20%**.\nUtilized **React.js** for building interactive user interfaces, contributing to a **15%** increase in user adoption rates for AI applications.\nCollaborated with cross-functional teams to define project requirements and managed agile methodologies, ensuring timely completion of deliverables.\nImplemented web services with **Flask** and **Django**, improving data processing speed and enhancing user experience for machine learning models.\nCreated high-performance containerized applications using **Docker**, streamlining development and reducing deployment errors by **25%**.\nLeveraged machine learning frameworks for data analysis and AI model training, enabling predictive insights for end-users.\nConducted code reviews and provided mentorship to junior developers, fostering skill growth and enhancing team productivity by **30%**.\nEngaged in effective communication with stakeholders to align project goals and manage expectations throughout the development lifecycle."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **React.js** to develop engaging user interfaces, enhancing the customer experience by 30%.\nImplemented **Node.js** and **Express** for backend development of scalable RESTful APIs that increased response times by 25%.\nDesigned and deployed AI-driven solutions using **Python** and **Flask**, resulting in improved data processing speeds by 40%.\nLeveraged **FastAPI** to build high-performance web services, achieving over 99% uptime across applications.\nIntegrated cloud deployment strategies using **AWS** and **Azure**, leading to a 50% reduction in deployment times and improving scalability.\nCollaborated in an **agile** development environment, participating in daily standups and sprint reviews to ensure project alignment and timely delivery.\nImplemented **Docker** for containerization of applications, simplifying the deployment process and efficiency.\nDeveloped machine learning models that enhanced predictive analytics capabilities, increasing accuracy by 35%.\nProvided technical documentation and user guides for all systems created, significantly improving knowledge transfer and support efficiency.\nSupported the integration of AI-driven features into existing platforms, facilitating seamless user interaction with the systems."
    }
  ],
  "skills": " **Programming Languages** \n\t Python, JavaScript, TypeScript\n\n **Backend Frameworks** \n\t Node.js, ExpressJS, NestJS, FastAPI, Flask, Django, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks** \n\t React.js, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies** \n\t RESTful APIs, GraphQL, web services\n\n **Serverless and Cloud Functions** \n\t AWS, Azure, GCP\n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps** \n\t CI/CD pipelines, Docker\n\n **Cloud & Infrastructure** \n\t cloud deployment strategies\n\n **Other** \n\t UX/UI Design, Git, GitHub, Redux, Agile, AI, machine learning, messaging & caching tools, Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum"
}