{
  "name": "DANIEL HE",
  "role_name": "Quantitative Python Developer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Results-oriented Quantitative Python Developer with expertise in Python and **pandas** for data processing and analysis. Skilled in SQL for database management and API development, while adept at employing **Pytest** for robust testing and maintaining high-quality code. Strong capabilities in **Linux** environments, multithreading, and multiprocessing to enhance application performance. Knowledgeable in object-oriented and functional programming, statistics, time series analysis, and financial mathematics. Proven track record of delivering scalable and efficient solutions across various sectors, ensuring a user-centric approach through clean and maintainable code practices.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Quantitative Python Developer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **pandas** to perform data processing and analysis, improving data handling efficiency by 50%.\nDeveloped and integrated robust **APIs** to facilitate seamless data retrieval and management, streamlining processes by 30%.\nImplemented **SQL** queries for advanced data manipulation and extraction, enhancing reporting accuracy by 40%.\nCreated unit and integration tests with **Pytest**, achieving a 95% code coverage and ensuring high-quality deliverables.\nLeveraged **Linux** environments for application deployment and management, reducing operational issues by 25%.\nEmployed **multithreading** and **multiprocessing** techniques to optimize resource usage, enhancing application performance by 35%.\nApplied object-oriented programming principles to design scalable and maintainable code, while incorporating functional programming concepts for efficient coding practices.\nConducted statistical analysis and time series forecasting on financial data, improving predictive accuracy by 20%.\nUtilized concepts from **financial mathematics** to develop quantitative models, driving actionable insights and business decisions."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Utilized **Python** and **pandas** for data processing, enhancing data handling efficiency by 30%.\nDeveloped **SQL** queries to analyze performance metrics, leading to data-driven decision-making that improved operational efficiency by 15%.\nImplemented APIs for seamless integration with external systems, achieving a 99% success rate for data retrieval.\nConducted automated testing using **Pytest**, decreasing the bug rate in production by 40%.\nLeveraged **Linux** for deployment and environment management, increasing system stability and performance.\nApplied **multithreading** and **multiprocessing** to optimize data processing workflows, improving performance by 35%.\nUtilized **object-oriented programming** and **functional programming** techniques to enhance code reusability and maintainability across modules.\nApplied statistical methods and time series analysis for predictive modeling, contributing to a 25% increase in forecast accuracy.\nUtilized techniques in financial mathematics for quantitative analysis, supporting critical financial operations and risk management."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Utilized **Python** and **pandas** for efficient data processing, optimizing workflows and reducing overall time by **25%**.\nDeveloped and maintained robust **SQL** databases for data storage and retrieval, ensuring **99%** query performance efficiency.\nDesigned and implemented high-performance **APIs** for data access and manipulation, facilitating smoother data workflows with a response time improvement of **50%**.\nExecuted comprehensive testing strategies using **Pytest**, resulting in a **20%** reduction in bugs and issues during deployment.\nImplemented multithreading and multiprocessing techniques to enhance application performance, achieving a processing increase of over **30%**.\nEmployed strong object-oriented and functional programming principles in code development, enhancing maintainability and scalability of projects.\nConducted statistical analysis and time series evaluation to derive financial insights, contributing to data-driven decision-making."
    }
  ],
  "skills": " **Programming Languages** \n\tJava, JavaScript (React, Vue.js, Angular, Pixi.js, Vanilla JS, Node.js, TypeScript), Go, Python, SQL, Swift, Kotlin\n\n **Backend Frameworks** \n\tSpring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n **Frontend Frameworks** \n\tReact, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest\n\n **API Technologies** \n\tRESTful API design, APIs\n\n **Serverless and Cloud Functions** \n\tAWS (EKS, RDS, CloudFront, S3, Lambda), API Gateway\n\n **Databases** \n\tMySQL, PostgreSQL, Redis, MongoDB\n\n **DevOps** \n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline\n\n **Cloud & Infrastructure** \n\tGit, CloudWatch, ELK Stack\n\n **Other** \n\tMicroservices, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies, pandas, data processing, Pytest, Linux, multithreading, multiprocessing, object-oriented programming, functional programming, statistics, time series, financial mathematics"
}