{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience in building robust applications and systems across multiple industries. Expert in **AWS**, with a solid grasp of utilizing **CI/CD pipelines** and implementing **Microservices** architecture for scalable solutions. Proficient in **GitLab** for version control and collaboration, as well as adept in working with various **Databases**.\n\nStrong background in programming languages including **Golang**, **Kotlin**, and **PHP**, enhancing backend capabilities. Skilled in JavaScript/TypeScript and Python, with practical experience in **FastAPI** and **Django** for capable backend development. Proven ability in delivering high-performance applications with a focus on compliance-driven development, ensuring adherence to standards such as HIPAA and PCI DSS. Demonstrated expertise in building AI/ML-powered platforms, and implementing event-driven architectures.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed high-performance backend solutions in **Golang** and **PHP**, implementing efficient microservices architecture to enhance system scalability and maintainability, reducing deployment time by **30%**.\n• Designed robust and scalable **AWS** cloud infrastructure, optimizing resource usage and improving uptime to **99.9%** through the use of **CI/CD** pipelines and automated testing.\n• Collaborated with cross-functional teams to integrate various **databases** including PostgreSQL and MongoDB, ensuring high availability and consistency of data across multiple services.\n• Managed source code and version control effectively using **GitLab**, ensuring seamless collaboration among team members and maintaining code quality through continuous integration practices.\n• Enhanced application performance by implementing Caching strategies for **databases**, substantiated by a **25%** improvement in response times.\n• Conducted system architecture reviews, leading to the adoption of advanced microservices patterns that decreased system complexity by **40%** and supported easier feature rollouts.\n• Mentored junior developers on best practices in **AWS**, microservices design, and deployment strategies, improving team productivity and code quality.\n• Drove the adoption of **CI/CD** practices across projects, leading to a reduction in production bugs by **35%** and increasing deployment frequency to several times a day.\n• Ensured seamless integration of various **databases** into a cohesive backend system, optimizing schema design and query performance for key applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **AWS** and container orchestration tools in developing and deploying microservices, aligning with best practices for high-availability in financial applications.\nUtilized **Golang** and **Kotlin** to enhance backend services, ensuring optimal performance and maintainability across various microservices with **CI/CD** pipelines integrated via **GitLab** for streamlined development and deployment.\nDesigned data storage solutions with relational and NoSQL **databases** to efficiently manage and query large datasets, ensuring data integrity and security across applications.\nCollaborated in agile teams to optimize processes and improve code quality, reducing deployment times by **30%** while ensuring adherence to industry standards.\nImplemented unit and integration testing strategies to enhance code reliability, achieving **95%** code coverage and minimizing post-deployment issues.\nDeveloped comprehensive API documentation using Swagger, facilitating easier integration for internal and external developers across a team of **15** engineers.\nConducted performance tuning and monitoring using real-time logging and monitoring tools, reducing system downtime by **25%** and improving application response times significantly.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and optimized backend services using **Golang** and **Kotlin** for microservices architecture, ensuring high performance and scalability to support over **100,000** concurrent users on a global e-commerce platform.\n- Designed, implemented, and maintained CI/CD pipelines with **GitLab** to automate testing and deployment processes, reducing deployment times by **40%**.\n- Leveraged AWS services for hosting and managing applications, ensuring high availability across different regions and improving disaster recovery capabilities.\n- Collaborated with cross-functional teams to integrate existing databases, utilizing **PostgreSQL** and **Redis** for caching mechanisms, thus enhancing data access speed by **30%** during peak transactional loads.\n- Employed microservices architecture to enhance system modularity and maintainability, implementing features that improved overall system reliability by **25%**.\n- Conducted regular code reviews and implemented best practices for version control with **Git**, fostering a culture of quality and innovation within the development team.\n- Monitored and fine-tuned application performance, identifying bottlenecks under high load, leading to a **20%** reduction in latency across critical services while upholding service level agreements (SLAs).\n- Implemented robust logging and monitoring solutions to track application health and performance in real-time, resulting in quicker incident response and resolution times.\n- Participated in the design and planning of system architecture, focusing on the integration of scalable solutions, effectively aligning business requirements with technical capabilities."
    }
  ],
  "skills": " **Programming Languages:**\n\tGolang, Kotlin, PHP, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Microservices",
  "apply_company": "OLX"
}