{
  "name": "Tomasz Lee",
  "role_name": "Software Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Software Developer with 9+ years of experience in delivering high-quality applications. Proficient in **Java**, **Spring Boot**, **Hibernate**, and **SQL**, with expertise in **Microservice Architecture** and **Distributed Systems**. Skilled in utilizing **AWS** for cloud services and implementing solutions with **Python** and **MongoDB**. Strong understanding of data structures, algorithms, and complexity analysis. Additionally, experienced in leveraging **Redis** for caching solutions and integrating **AI Coding Tools**. Proven track record in collaborating effectively with teams, leading projects from conception through to execution, and optimizing development processes to enhance software performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Java** and **Spring Boot** to develop scalable applications, ensuring high performance and reliability in distributed systems.\nDesigned and developed scalable microservices architecture, promoting modularity and maintainability of applications.\nIntegrated **MongoDB** for data storage solutions, enabling efficient data management and retrieval.\nEnhanced application performance by implementing **Redis** for caching, improving response times by **35%**.\nCollaborated with cross-functional teams to articulate technical requirements and solutions, demonstrating strong **English Communication** skills.\nImplemented complex data structures and algorithms to optimize software performance and resource management.\nLeveraged **AWS** for deploying and managing applications in the cloud, ensuring high availability and fault tolerance.\nDeveloped RESTful APIs with appropriate security measures, using **JWT-based** authentication for safeguarding user data.\nImplemented CI/CD practices using modern tools, improving deployment efficiency by **40%**.\nDesigned data-driven solutions using **SQL** and optimized queries for better performance, achieving a reduction in execution time by **20%**.\nEngaged AI coding tools for enhanced development processes, ensuring adherence to best practices in coding standards."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Java** and **Spring Boot** to architect and develop microservices, optimizing application performance and ensuring seamless integration.\nImplemented **Redis** for caching mechanisms, achieving a **25%** reduction in latency for database queries and improving response times.\nDesigned and deployed **AWS** solutions for scalability and reliability, resulting in a **15%** increase in system uptime.\nDeveloped RESTful APIs, employing **Hibernate** for ORM, ensuring efficient data handling and integration with **MongoDB** and **SQL** databases.\nApplied data structures and algorithms to enhance application efficiency, impacting processing speeds positively by **20%**.\nConducted complexity analysis to refine code performance and optimize resource utilization within the software lifecycle.\nLeveraged **AI coding tools** to assist in code generation and enhancements, boosting development speed and accuracy.\nCollaborated effectively with cross-functional teams to define system requirements in English, ensuring comprehensive communication and project alignment.\nMentored junior developers in best practices for software development and distributed systems, fostering a culture of continuous learning and improvement.\nDeveloped and maintained quality assurance protocols via unit tests, contributing to a **30%** reduction in defects pre-release."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Java** and **Spring Boot** to develop scalable microservices, enhancing system modularity and reducing deployment times by **30%**.\nImplemented RESTful APIs to integrate with **MongoDB** and **Redis** for optimized data storage and quick retrieval, resulting in an average query response time decrease of **25%**.\nApplied **Python** for data analysis processes, utilizing libraries that improve the efficiency of algorithms and data structures within projects.\nDesigned architecture for distributed systems, ensuring robust communication between microservices and reducing overall system downtime by **15%**.\nEngaged in rigorous complexity analysis to optimize existing code, leading to performance improvements in critical application components.\nCollaborated with cross-functional teams to establish best practices in coding, employing AI coding tools to enhance code quality and reduce bugs.\nEnhanced English communication with team members and stakeholders to facilitate effective knowledge sharing and project updates, ensuring project alignment and success.\nParticipated in system design discussions, contributing innovative ideas to engineering challenges and solutions while adhering to Agile methodologies.\nDocumented technical specifications, enhancing onboarding processes for new team members and improving team efficiency."
    }
  ],
  "skills": "  **Programming Languages**\n\tJava, SQL, Python, JavaScript, TypeScript\n\n  **Backend Frameworks**\n\tSpring Boot, NodeJS, ExpressJS, NestJS, C#, .NET, Microservice Architecture, Hibernate\n\n  **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, Azure\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Redis\n\n  **DevOps**\n\tCI/CD pipelines\n\n  **Cloud & Infrastructure**\n\tAWS, Azure\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, English Communication, Data Structures, Algorithms, Complexity Analysis, AI Coding Tools"
}