{
  "name": "Rei Taro",
  "role_name": "Senior System Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-oriented Senior System Engineer with over 10 years of experience in implementing DevOps practices and Infrastructure as Code for scalable backend systems. Proficient in **Linux**, **Ansible**, and **CI/CD** methodologies, ensuring seamless integration and delivery. Expertise in programming with **Python** and **Go**, enabling the development of robust automation tools and high-performing APIs. Skilled in managing cloud infrastructure using **GCP** and adept at networking protocols such as **TCP/IP** and **HTTP**. Proven ability to contribute to significant projects at leading organizations like VISA and Reply Polska, leveraging strong analytical skills and technical acumen using frameworks like **FastAPI**, **Django**, and **Flask**.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior System Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Go** to develop robust backend services, enhancing system performance and reliability.\nImplemented **Infrastructure as Code** using **Terraform** for efficient deployment and management of cloud resources on **Azure App Services**.\nAutomated system configurations and deployments through **Ansible**, achieving a deployment time reduction of **30%**.\nManaged CI/CD pipelines to facilitate rapid application updates and streamlined development workflows, achieving a **40%** decrease in delivery times.\nMonitored and optimized system performance in a **Linux** environment, ensuring high availability and system integrity.\nConfigured comprehensive network protocols including **TCP/IP**, **HTTP**, and **DNS** to ensure seamless systems integration and communication across architectures.\nConducted system security assessments and implemented security best practices, including adherence to **DevOps** principles and automated compliance checks.\nLed the implementation of scalable solutions for diverse projects, improving collaboration with cross-functional teams and enhancing project delivery outcomes."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop robust backend systems for automating document workflows, enhancing user onboarding, and efficiently managing complex reporting processes.\nImplemented microservices architecture powered by **Celery** and **Redis** for event-driven, asynchronous processing of financial data and transaction requests, achieving a 50% reduction in processing time.\nLeveraged **Azure App Services** for the deployment of microservices, employing **Terraform** for infrastructure automation to maintain reliable and scalable environments, managing over **100** microservices.\nEngineered secure data pipelines for regulatory compliance using **Apache Airflow** and **Azure Functions**, automating data exchange processes and improving operational efficiency by **30%**.\nConducted meticulous security audits to ensure adherence to industry standards, integrating **OAuth2** and **Azure AD B2C** for authentication management and robust access control, impacting over **500** users.\nCollaborated with cross-functional teams to ensure seamless system integration, regulatory compliance, and effective release management, contributing to projects with timelines of under **3 months**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **Go** to develop robust backend services for trade execution, ensuring high reliability in portfolio management and account tracking for trading operations.\nImplemented **Infrastructure as Code** principles with **Ansible** to automate server configurations in a **Linux** environment, leading to a 30% reduction in setup time across **9** environments.\nCollaborated with frontend teams to expose data through REST APIs, enhancing user experiences in high-frequency transactions by ensuring real-time data access via **HTTP** and **WebSocket** protocols.\nEnsured compliance with regulatory requirements like MiFID II and GDPR while following internal data security protocols, achieving 100% compliance during audits across **3** quarters.\nDeveloped comprehensive testing frameworks using **PyTest** and tactical strategies with mock servers, improving CI/CD cycles and reducing bugs in production by **25%**.\nIntroduced job scheduling and queuing mechanisms using **Celery** and **RabbitMQ**, effectively managing backend tasks and improving process efficiency by **40%**."
    }
  ],
  "skills": "Programming Languages:\n\t**Python**, Go, SQL, Bash, JavaScript, PHP\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\t**REST/gRPC APIs**, Microservices\n\n**Serverless and Cloud Functions:**\n\t**AWS (EC2, S3, Lambda)**, GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, **Ansible**, **CI/CD**, **DevOps**, **RHCSA**, **RHCE**\n\n**Cloud & Infrastructure:**\n\t**Linux**, DNS, TCP/IP, HTTP, **Infrastructure as Code**\n\n**Other:**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, PyTest, Git",
  "apply_company": "Hostinger"
}