{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior AI Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior AI Engineer with 10+ years of experience in developing advanced AI solutions leveraging **Python**, **AWS**, **GCP**, and **Azure**. Expertise in **MLOps** practices encompassing data engineering, **data pipelines**, and prompt engineering, with a robust understanding of frameworks such as **LangChain**, **LlamaIndex**, and methodologies for articulating evaluation frameworks. Proficient in applying **NLP** techniques, machine learning algorithms, and real-time analytics to drive intelligent decision-making.\n\nSkilled in utilizing modern technologies including **JavaScript/TypeScript**, **Flutter**, and frameworks across the full stack such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven experience in designing and deploying cloud-native applications and developing enterprise platforms with integrated AI/ML capabilities. Strong background in agile methodologies, microservices architecture, event-driven systems, and CI/CD automation, consistently focused on delivering secure and maintainable solutions that align with compliance standards including HIPAA, FHIR, PCI DSS, and SOC 2.\n\nPassionate about creating impactful systems that not only meet technical requirements but also address real-world challenges.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDesigned and implemented scalable, full-stack solutions with a focus on **AI**, **ML**, and **NLP** for healthcare and finance sectors using **Python** (FastAPI) and modern frameworks like **TypeScript**, ensuring compliance with regulatory standards like HIPAA and GDPR.\n•\tBuilt and deployed cross-platform mobile applications using **Flutter** and **React Native**, delivering optimal user experiences for health and fintech products on both iOS and Android, integrating native modules.\n•\tLed the transformation of applications into microservices-based architectures utilizing **Docker**, **Kubernetes** (AKS/EKS), and serverless technologies (**AWS Lambda**, **Azure Functions**), achieving high availability metrics by up to **99.99%**.\n•\tDesigned and maintained cloud-native data architectures using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, optimized for handling over **1 million** healthcare and financial records efficiently.\n•\tDeveloped machine learning models for diverse applications such as patient risk prediction and financial fraud detection using **Python** libraries (**scikit-learn**, **PyTorch**, **TensorFlow**) and integrated real-time inference services into backend systems.\n•\tCreated MLOps pipelines using **MLflow**, **DVC**, and **Apache Airflow** to facilitate continuous training and deployment of models, reducing deployment times by **30%** across environments.\n•\tImplemented AI-driven features in client applications, including real-time dashboards and predictive alerts, utilizing models hosted on **Azure ML** and **AWS Sagemaker**.\n•\tEstablished enterprise-level DevOps pipelines with **GitHub Actions**, **Azure DevOps**, and **CircleCI**, integrating automated testing with a coverage increase of **25%** for both web services and APIs.\n•\tDeveloped complex financial data visualizations using **D3.js**, **Chart.js**, and **Power BI Embedded**, providing insights into trends and KPIs.\n•\tCollaborated with data scientists to integrate advanced NLP models employing **spaCy** and **Hugging Face Transformers** for document parsing, deploying them via RESTful APIs.\n•\tImplemented robust test strategies using **Jest**, **Cypress**, **PyTest**, and **Postman**, ensuring comprehensive unit, integration, and contract testing across both frontend and backend systems.\n•\tIntegrated advanced search capabilities using **Azure Cognitive Search** and **ElasticSearch**, optimizing search across millions of structured and unstructured documents."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Leveraged advanced **AI** and **ML** techniques to develop large language models (LLM) and integrated frameworks such as **LangChain** and **LlamaIndex** for NLP applications, enhancing text comprehension and actionable insights by **15%**.\nDesigned and implemented robust data pipelines with **Python** and **Apache Airflow** for efficient data engineering, resulting in a **30%** reduction in data processing time and increasing throughput for complex AI models.\nDeveloped and deployed machine learning models on cloud platforms including **AWS**, **GCP**, and **Azure**, ensuring seamless integration and scalability with existing infrastructure for various AI applications.\nConducted prompt engineering practices to optimize natural language processing tasks, improving response accuracy and relevance by **20%**.\nMonitored and evaluated AI models using industry-standard evaluation frameworks, ensuring performance benchmarks and compliance with agile methodologies throughout the development lifecycle.\nCollaborated in an Agile environment with cross-functional teams to deliver high-quality AI solutions, fostering continuous integration and delivery practices, achieving **95%** on-time project completion rate.\nUtilized MLOps strategies to automate model deployment and monitoring processes, enhancing operational efficiency and easing scalability in response to fluctuating demand."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** to develop and optimize scalable AI-driven applications, incorporating frameworks such as **LangChain** and **LlamaIndex** for enhanced workflows in Natural Language Processing (NLP).\nDesigned and implemented robust data pipelines and MLOps processes in cloud environments leveraging **AWS**, **GCP**, and **Azure**, ensuring efficient data handling and model deployment across the organization.\nDeveloped and fine-tuned AI/ML models utilizing cutting-edge algorithms, achieving a performance improvement of **30%** on prediction tasks and driving engagement through personalization using various **LLM** techniques.\nEngineered real-time data processing solutions for large-scale datasets, achieving a throughput of **500+ events per second** using event-driven architectures with **Kafka**, **RabbitMQ**, and custom Python scripts.\nImplemented evaluation frameworks to monitor AI model performance, facilitating continuous improvement and adherence to KPIs through regular testing and validation in an **agile** environment.\nIntegrated prompt engineering techniques for AI interfaces, enhancing user interaction and content generation capabilities while ensuring outputs align with organizational standards.\nCollaborated with cross-functional teams to establish best practices for data engineering, enhancing data accessibility and quality for different ML applications through efficient architecture design.\nLed initiatives in the application of Retrieval-Augmented Generation (**RAG**) methodologies, ensuring models utilize the freshest data to improve user experience and relevancy of output.\nPublished and documented data workflows and AI processes, providing training to junior engineers and fostering a culture of innovation and best practice sharing across the team."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython,\n\n **Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango,\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript (React,\n\tVue,\n\tAngular),\n\n **API Technologies:**\n\tNginx,\n\tJWT,\n\tOAuth2,\n\tKeycloak (OIDC,\n\tRBAC),\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS,\n\tLambda,\n\tRDS,\n\tS3),\n\tAzure (App Services,\n\tBlob,\n\tSQL),\n\tGCP,\n\n **Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\n **DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose,\n\n **Cloud & Infrastructure:**\n\tAWS,\n\tAzure,\n\tGCP,\n\n **Other:**\n\tAI,\n\tML,\n\tNLP,\n\tLLM,\n\tLangChain,\n\tLlamaIndex,\n\tMLOps,\n\tdata engineering,\n\tdata pipelines,\n\tprompt engineering,\n\tRAG,\n\tevaluation frameworks,\n\tagile",
  "apply_company": "Blackshark"
}