{
  "name": "Tomasz Lee",
  "role_name": "Roku Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Roku Developer with 9+ years of experience in creating exceptional user experiences through technologies such as **React**, **React Native**, and **RESTful APIs**. Proficient in **Git** for version control and skilled in implementing **CI/CD automation** to streamline delivery processes. Demonstrated expertise in integrating **analytics SDKs** and developing **streaming services** that enhance application performance. With a solid background in **Agile delivery**, I excel in debugging and team collaboration to ensure timely project completion. My original strengths as a .NET Full Stack Developer further enhance my ability to innovate and deliver robust solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Roku Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **BrightScript** and **SceneGraph** to develop interactive applications for Roku, ensuring compliance with streaming service standards.\nDesigned and implemented **RESTful APIs** to facilitate communication between frontend interfaces and backend services, delivering seamless data access for various applications.\nCollaborated with the analytics SDKs to track user interactions and enhance data-driven decisions, improving user experiences significantly.\nApplied **Git** for version control and collaboration among team members, streamlining the development process and enhancing Agile delivery capabilities.\nExecuted **CI/CD automation** using tools like Azure DevOps, achieving a **40%** reduction in deployment time while ensuring high-quality deliverables.\nConducted rigorous debugging processes to identify and resolve technical issues, resulting in improved application stability and user satisfaction.\nImproved collaboration and teamwork through cross-functional meetings, enabling a robust development culture focused on innovative solutions.\nFocused on enhancing user experiences by collaborating with UX/UI designers and implementing feedback into application design.\nImplemented user authentication and authorization methods to secure applications, ensuring compliance with industry standards.\n"
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed and maintained **RESTful APIs** to facilitate robust communication between the client-side applications built with **React** and backend services, ensuring seamless integration with **streaming services**.\nUtilized **Git** for version control and collaboration in an **Agile delivery** environment to enhance team productivity and project iterations.\nLed the design and implementation of engaging user interfaces and experiences using **React** and **React Native**, resulting in an increase of user satisfaction scores by **20%**.\nImplemented **CI/CD automation** pipelines to streamline deployment processes, reducing the time required for releases by **40%**.\nConducted debugging sessions leveraging analytics SDKs to enhance application performance and troubleshoot issues effectively, improving overall system reliability.\nCollaborated with cross-functional teams to gather requirements and feedback, fostering a strong teamwork culture that led to the successful delivery of projects on schedule.\nCreated custom components with **SceneGraph** for interactive multimedia experiences, enabling richer user interactions.\nMentored junior developers, sharing best practices in coding and project management, resulting in a **30%** improvement in their productivity metrics.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "- Developed **RESTful APIs** and integrated analytics SDKs for enhanced data tracking and reporting in the Roku platform, ensuring seamless connectivity with streaming services.\n- Implemented **CI/CD automation** strategies using **Git**, improving deployment efficiency by **30%** and enhancing the delivery cycle.\n- Collaborated with cross-functional teams in an Agile environment to deliver high-quality user experiences, actively participating in daily standups and code reviews.\n- Created and optimized interactive user interfaces utilizing **React** and **React Native**, resulting in a **25%** increase in user engagement.\n- Engaged in debugging efforts to troubleshoot and resolve issues, leading to reduced resolution time by **15%**.\n- Developed technical documentation and best practices for the team to streamline processes and enhance knowledge transfer.\n- Assisted in the integration and optimization of third-party services, improving functionality and performance within the Roku app ecosystem.\n- Participated in sprints focusing on continuous improvement and innovation, driving enhanced teamwork across departments."
    }
  ],
  "skills": " **Programming Languages**\n\tBrightScript, Python, JavaScript, TypeScript\n\n**Frontend Frameworks**\n\tReactJS, React Native, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful APIs, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, CI/CD automation\n\n**Cloud & Infrastructure**\n\tCloud & DevOps\n\n**Other**\n\tGit, GitHub, UX/UI Design, Agile delivery, teamwork, debugging, analytics SDKs, streaming services, testing tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum"
}