{
  "name": "Andrzej Ito",
  "role_name": "Senior AI Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior AI Engineer with over 9 years of experience, I specialize in **Python**, **ML**, **PyTorch**, **TensorFlow**, and **AI** to design and build scalable software solutions. I excel in implementing **CI/CD** practices and utilizing **Git** for version control, ensuring efficient collaboration and delivery. My strong background in developing **APIs** and working with **relational databases**, along with cloud expertise in **Azure**, **AWS**, and **GCP**, allows me to craft high-performing applications. I have a proven track record of leading cross-functional teams in **Scrum** and **Agile** environments, mentoring junior engineers, and driving projects with a strong focus on user experience, performance, and innovation while enhancing accessibility and technical excellence.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Lead the development of machine learning models utilizing **Python**, **PyTorch**, and **TensorFlow** in a cloud environment, specifically on **AWS**, **Azure**, and **GCP** to enhance AI capabilities.  \n• Implement CI/CD strategies to automate deployment processes, ensuring seamless integration and delivery of AI solutions, utilizing tools such as **Git** and **Jenkins**.  \n• Collaborate with cross-functional teams following **Agile** and **Scrum** methodologies to develop scalable and efficient API services for machine learning applications.  \n• Expertly manage relational databases including **Oracle**, **MySQL**, **MS SQL**, and **PostgreSQL** to store and retrieve data effectively, ensuring a 99.9% uptime for service reliability.  \n• Communicate complex technical concepts clearly and effectively to stakeholders and team members, fostering collaboration and understanding across diverse teams and disciplines.  \n• Demonstrated proficiency in developing robust solutions that leverage machine learning to analyze data, resulting in a 30% increase in predictive accuracy over previous models."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed AI models using **Python** and **TensorFlow** for machine learning applications, producing models with an accuracy improvement of **15%**.\n• Collaborated in an Agile environment utilizing **Scrum** methodologies to ensure timely project delivery, participating in **2-week** sprint cycles.\n• Implemented Continuous Integration and Continuous Deployment (**CI/CD**) pipelines using **Git** for version control, efficiently managing code with **99%** integration success.\n• Integrated RESTful APIs to facilitate data exchange between AI algorithms and front-end applications, achieving a **50%** reduction in load times.\n• Leveraged cloud technologies, specifically **AWS** and **Azure**, to deploy scalable machine learning solutions, with a focus on architecture that supports **10,000+** concurrent users.\n• Employed **PyTorch** to enhance model training processes, achieving training time reduction by **30%** through optimization techniques.\n• Conducted performance testing of ML models and documented results to improve system robustness, effectively communicating findings across teams to foster collaboration.\n• Managed and maintained relational databases to store and retrieve critical data, ensuring data integrity and availability for analytics and predictions."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed and deployed machine learning models using **Python** and frameworks such as **TensorFlow** and **PyTorch** to enhance predictive capabilities in web applications.\n• Led CI/CD efforts to streamline deployment processes, ensuring the utilization of best practices in version control using **Git** and related tools.\n• Collaborated with cross-functional teams within an **Agile** framework to deliver robust AI features, facilitating effective communication and alignment on project objectives.\n• Designed and implemented RESTful APIs to connect applications with relational databases and ensure smooth data transactions between systems.\n• Configured cloud services such as **AWS**, **Azure**, and **GCP** to host machine learning models, optimizing for performance and cost-effectiveness while managing resources efficiently.\n• Conducted data preprocessing and model evaluations, successfully reducing processing time by **30%** compared to previous methodologies.\n• Contributed to the development of real-time data pipelines using **Node.js**, enhancing the capability to handle large volumes of incoming data and improving response times.\n• Engaged in Scrum meetings to deliver project milestones and increase team productivity by incorporating agile methodologies."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, C++, C#, Python, Kotlin\n\n**Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA, Microservices, CI/CD\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tSOAP, REST APIs, API\n\n**Serverless and Cloud Functions**\n\tAWS, Azure, GCP, cloud\n\n**Databases**\n\tSQL, PLSQL, MS SQL Server, Oracle, MongoDB, PostgreSQL, Redis, relational databases\n\n**DevOps**\n\tGit\n\n**Cloud & Infrastructure**\n\tcloud\n\n**Other**\n\tSOLID, DRY, LINQ, Scrum, Agile, communication, ML, PyTorch, TensorFlow, AI",
  "apply_company": "Version 1"
}