{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented Senior Sales Engineer with a strong foundation in Sales, Customer Relationship Management, and Market Analysis. Over 9 years of experience in automation solutions and new product development, leveraging a comprehensive understanding of Pneumatic Systems and Electrical Automation. Proven track record of analyzing market trends and utilizing reporting tools to drive business growth. Additionally, adept in technical software development with expertise in **.NET**, **C#**, **ReactJS**, **NextJS**, and cloud services. Excels in collaborating with cross-functional teams to deliver client-focused solutions and enhance operational efficiency.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged expertise in **Customer Relationship Management (CRM)** to enhance client engagement and drive sales growth within the organization.\nDeveloped complex reporting mechanisms utilizing **D3.js** for data visualization, improving reporting accuracy and efficiency by **30%**.\nAutomated sales processes by integrating **automation tools**, reducing manual entry efforts by up to **50%**.\nConducted comprehensive **market analysis** to identify potential growth areas, resulting in a **15%** increase in market share.\nDesigned and executed strategies for **new product development**, collaborating with cross-functional teams to ensure timely launches.\nUtilized **electrical automation** expertise to streamline operational workflows, contributing to a **20%** reduction in operational costs.\nCommunicated fluently in **German** and **English**, enhancing customer relations and expanding market reach across diverse clientele.\nApplied knowledge of **pneumatic systems** to recommend product solutions, leading to improved sales performance and customer satisfaction.\n\nOriginal strengths:\n- Spearheaded customer engagement initiatives that led to outperforming sales targets by **35%** last quarter.\n- Successfully trained new sales engineers on product features and effective sales strategies.\n- Fostered collaborative relationships with key clients, resulting in long-term partnerships and contracts."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Conducted market analysis to identify potential customers and enhance customer relationship management, leading to a 15% increase in sales engagement.\n• Automated reporting processes using advanced tools, resulting in a 30% reduction in time spent on generating reports.\n• Spearheaded new product development initiatives that improved client satisfaction and contributed to a 25% boost in overall sales performance.\n• Collaborated with clients to assess needs and integrate pneumatic systems and electrical automation solutions, thereby elevating sales opportunities by 20%.\n• Delivered technical presentations in both German and English to educate customers on product features and benefits, increasing customer retention rates.\n• Managed the sales pipeline effectively, utilizing CRM tools for tracking and performance analysis, achieving a 19% growth in quarterly revenue.\n• Trained new sales engineers on automation techniques and customer engagement strategies to ensure a high-performance sales team.\n• Developed case studies and performance reports to highlight successes and identify areas for market improvement, resulting in improved stakeholder awareness and support."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and integrated customer relationship management strategies, enhancing client engagement and improving sales team productivity by **20%**.\n• Conducted market analysis to identify growth opportunities and contributed to new product development initiatives that align with customer needs.\n• Automated reporting processes using **Azure** DevOps, streamlining sales operations and enhancing data accuracy.\n• Created reusable components within the CRM platform to facilitate efficient system updates and feature enhancements.\n• Collaborated with cross-functional teams to analyze customer feedback and refine sales strategies, resulting in improved service delivery.\n• Provided technical expertise on electrical automation and pneumatic systems, supporting integration efforts with potential clients.\n• Delivered comprehensive training and user guides to sales teams, improving adoption rates and operational efficiency across different regions.\n• Fostered bilingual communication in **German** and **English** settings, bridging gaps and enhancing customer relations in diverse markets."
    }
  ],
  "skills": " **Programming Languages**\n\t Python, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, .NET, Microservices\n\n**Frontend Frameworks**\n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t Redis, Apache Kafka, RabbitMQ\n\n**Other**\n\t UX/UI Design, Git, GitHub, Testing Tools (NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest), Sales, Automation, Customer Relationship Management, Market Analysis, Reporting, New Product Development, Pneumatic Systems, Electrical Automation, German, English, Microservices",
  "apply_company": "SMC Deutschland"
}