{
  "name": "Tomasz Lee",
  "role_name": "Senior Ruby Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Ruby Engineer with 9+ years of experience in developing high-performance applications, particularly in **Ruby on Rails**. Proficient in leveraging **AWS** for cloud services, **PostgreSQL** for robust database management, and **Docker** for containerization to enhance deployment workflows. Strong understanding of **CI/CD** practices integrated with tools like **GitHub** and **TeamCity** to ensure seamless delivery and a streamlined development process. Proven experience in microservices architecture and Agile methodologies, enhancing team collaboration and project delivery. Original strengths include optimizing performance, leading cross-functional teams, and delivering complex solutions efficiently.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Ruby Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Ruby on Rails** to design and develop scalable web applications, resulting in a 30% faster time-to-market for new features.\nImplemented **PostgreSQL** for database management, optimizing data storage and retrieval processes, leading to a 25% increase in application performance.\nManaged deployment pipelines using **Docker**, streamlining the development process and ensuring consistent application environments across all stages.\nCollaborated with teams employing **AWS** for cloud solutions, enhancing system reliability and scalability by leveraging its vast ecosystem.\nEmployed **GitHub** for version control and team collaboration, resulting in a 50% reduction in merge conflicts and enhancing team productivity.\nConfigured **TeamCity** for continuous integration and delivery, achieving automated build and test processes that improved deployment frequency by 40%.\nUtilized **BuildKit** for efficient image builds and optimizations, reducing image sizes by 20% and deployment times.\nImplemented performance monitoring using **NewRelic**, improving application uptime and user satisfaction by 15%.\nAdopted a **microservices** architecture to improve service isolation and decrease downtime, enhancing system resilience and agility.\nWorked in an **Agile** environment, participating in sprint planning and retrospectives, driving continuous improvement in project execution and delivery timelines."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Ruby on Rails** to design and develop a cloud-based project management tool, enhancing team collaboration efficiency by 15%.\nImplemented **AWS** services for deployment and storage solutions, optimizing resource utilization and reducing server costs.\nCreated a microservices architecture leveraging **Docker** containers, ensuring high scalability of applications.\nDeveloped efficient RESTful APIs integrated with a **PostgreSQL** database for real-time data retrieval, improving response times by 20%.\nLed CI/CD pipeline implementations using **GitHub** and **TeamCity**, resulting in a 30% decrease in production deployment errors.\nImproved system performance by integrating **NewRelic** for monitoring, achieving a 25% boost in response rates through effective issue tracking.\nManaged and maintained **MySQL** databases, executing optimized queries that led to a 15% reduction in data access times.\nCollaborated in an Agile environment with stakeholders to define project requirements and development timelines, ensuring timely project delivery.\nConducted code reviews and provided mentorship to junior developers, increasing team productivity and knowledge sharing.\nPrepared and designed custom reports and charts using data visualization techniques for effective project status tracking."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed scalable microservices using **Ruby on Rails** for optimal performance, enabling a **25%** increase in application responsiveness.\n• Utilized **PostgreSQL** for efficient data management, resulting in a **30%** improvement in query retrieval times.\n• Implemented containerization using **Docker** for development environments, streamlining workflows and reducing deployment times by **40%**.\n• Managed source code using **GitHub** to ensure version control and collaboration across teams, enforcing best practices in code management.\n• Automated CI/CD pipelines with **TeamCity** and **BuildKit**, enhancing delivery speed and minimizing deployment failures by **15%**.\n• Monitored application performance using **NewRelic**, enabling proactive identification of issues and optimizing user experiences.\n• Engaged in Agile methodologies, participating in sprints and daily standups to drive project goals and high-quality outcomes.\n• Collaborated with cross-functional teams to integrate systems with AWS services, enhancing scalability and cloud capabilities.\n• Contributed to technical documentation to facilitate knowledge sharing and improve onboarding processes for new team members.\n• Conducted code reviews to maintain code quality and adherence to company standards, fostering a culture of continuous improvement."
    }
  ],
  "skills": "Programming Languages:\n\tRuby on Rails, Python\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tDocker, CI/CD, TeamCity, BuildKit, NewRelic\n\n**Cloud & Infrastructure:**\n\tCI/CD pipelines\n\n**Other:**\n\tGit, GitHub, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Agile",
  "apply_company": "Capgemini Engineering"
}