{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Node Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Node Engineer with 8 years of experience, I excel in **Node.js**, **API** development, and **system integration**, leveraging my proficiency in **Docker** for containerization and deployment. I am well-versed in implementing industry-standard protocols such as **OAuth2**, **SAML**, and **SSO**, alongside building RESTful services to ensure seamless communication between systems. My solid background in **React** enables me to create dynamic user interfaces that interact confidently with backend services, enhancing the client-facing experience.\n\nI have a strong commitment to CI/CD practices, utilizing **infrastructure-as-code** methodologies to automate deployments and maintain reliability. Additionally, I possess substantial experience in debugging and documentation, ensuring that robust solutions are not only effective but also maintainable. My unique blend of technical prowess, including a familiarity with **Golang** and **module bundling**, is complemented by my ability to communicate effectively with stakeholders and client teams, driving project success.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Node Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Node.js** to develop and integrate RESTful APIs ensuring system integration across various platforms for seamless user experiences.\nEmployed **Docker** for containerization, facilitating the deployment of microservices and enabling efficient scaling and operations management.\nImplemented CI/CD pipelines using **GitHub Actions** and other tools to automate testing, linting, and deployments, resulting in a **30%** increase in development efficiency.\nConducted client-facing communications to gather requirements and provide technical documentation, enhancing collaboration and project alignment.\nDesigned and executed OAuth2 and SAML protocols for secure Single Sign-On (SSO) integrations, improving user authentication processes.\nPerformed extensive debugging and troubleshooting using modern techniques and tools, leading to a **25%** reduction in production errors.\nOptimized the module bundling process to improve client-side performance, significantly reducing load times by **40%**.\nCollaborated with cross-functional teams to ensure high-quality documentation of APIs and system architecture, resulting in improved onboarding processes.\n\nOriginal Contributions:\nArchitected and developed scalable, full-stack healthcare and financial platforms using **TypeScript**, **Python (FastAPI)**, and modern front-end frameworks including **React (17-18)**, **Next.js**, and **Vue (3.x)**.\nDesigned and maintained cloud-native data architecture using **PostgreSQL**, **MongoDB**, and **GraphQL** for large-scale data ingestion and querying.\nIntegrated AI-based features into client-facing applications using **Azure ML** and **AWS Sagemaker**, enhancing user engagement with real-time insights.\nEstablished test strategies employing **Jest**, **Cypress**, and **PyTest** for thorough coverage of both front-end and backend services."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and integrated robust APIs using **Node.js** (NestJS/Express) to enhance system integration and support seamless communication with various services and platforms.\n• Led containerization efforts using **Docker** to ensure consistency across development, testing, and production environments, improving deployment speed by **30%**.\n• Implemented CI/CD pipelines promoting **infrastructure-as-code** principles, enhancing development workflows and reducing deployment time by **50%**.\n• Collaborated with client-facing teams to communicate technical solutions effectively and gather requirements, ensuring alignment with business objectives.\n• Conducted comprehensive debugging of applications using JavaScript frameworks such as **React** (18) and **TypeScript**, reducing the average bug resolution time by **40%**.\n• Designed and documented software systems, ensuring clear and maintainable documentation for future reference and team onboarding process.\n• Utilized OAuth2 and SAML protocols to establish secure Single Sign-On (SSO) capabilities, enhancing user authentication across platforms.\n• Integrated **REST**ful services to improve client-side communication for dynamic user interfaces in financial applications, increasing user satisfaction ratings by **20%**.\n• Engaged in module bundling strategies to optimize loading times and performance of client-side applications, enhancing the overall user experience."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Node.js** to develop and enhance RESTful APIs for seamless system integration, ensuring efficient data exchange and functionality across platforms while focusing on high-performance architecture.\nImplemented CI/CD practices with **Docker** for faster deployment cycles and streamlined integration processes, promoting agile development and continuous delivery enhancements.\nOptimized backend services for high availability and scalability, engaging in debugging to resolve issues, streamline performance, and improve user interactions.\nLed client-facing communication to gather feedback and requirements, ensuring that all deliverables align with business needs and user expectations.\nDesigned system architectures employing **OAuth2**, **SAML**, and **SSO** strategies for secure authentication and user access management, enhancing user experience and security across the application.\nIntegrated robust logging and monitoring solutions within the application, optimizing error tracking and performance analysis with a focus on increasing system reliability.\nEmployed **React** with advanced module bundling techniques, enhancing frontend loading times and user experience, ensuring responsive designs across various devices.\nProduced high-quality documentation for implemented features and APIs, facilitating knowledge sharing and onboarding for team members, ultimately ensuring the longevity and maintainability of projects.\nEngaged in performance tuning of applications, reducing latency by as much as **40%**, which significantly improved user engagement and retention rates.\nConducted regular code reviews to promote best practices and adherence to coding standards, fostering a culture of quality and continuous improvement within the team."
    }
  ],
  "skills": "  **Backend Frameworks**\n\tPython(FastAPI, Flask, Django), Node.js\n\n  **Frontend Frameworks**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n  **API Technologies**\n\tAPI, REST, OAuth2, SAML, SSO\n\n  **Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n  **Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure**\n\tinfrastructure-as-code\n\n  **Other**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, debugging, documentation, client-facing communication, module bundling",
  "apply_company": "Bonapolia"
}