{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Customer Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-oriented Full Stack Developer with 10+ years of experience in delivering high-performance software solutions, particularly in the healthcare and finance sectors. Expertise in **SQL**, **API**, and cloud-based platforms like **AWS** and **Azure** to design and implement SaaS applications that enhance customer engagement and operational efficiency. Adept at collaborating with cross-functional teams, leveraging strong **communication** and **organizational** skills to drive project success and foster teamwork.\n\nProficient in modern technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on experience across the full stack using frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Demonstrated ability to build and deploy cloud-native applications with a focus on integrating CRM solutions and leveraging tools like Intercom and Slack for improved customer interactions. \n\nDeep understanding of microservices architecture, event-driven systems, and CI/CD automation. Strong background in building secure, maintainable solutions that comply with industry standards such as HIPAA and PCI DSS, while also embedding AI/ML capabilities for enhanced decision-making. Passionate about developing systems that deliver measurable impact and value to the customer.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Customer Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tLeveraged **SQL** for managing and querying large databases that support customer-facing applications in SaaS environments, ensuring data integrity and availability.\n•\tDeveloped and maintained **APIs** to facilitate seamless interactions between CRM systems, external tools like Intercom, and internal applications, enhancing customer engagement through integrated functionalities.\n•\tUtilized collaboration tools such as **Slack** for effective communication within cross-functional teams, fostering a culture of transparency and teamwork.\n•\tImplemented robust organizational strategies for customer feedback loops, increasing overall user satisfaction by **30%**.\n•\tCollaborated on projects designed to integrate sophisticated SaaS solutions into existing **ERP** systems, driving transformative results for client operations.\n•\tCoordinated with product teams to deploy applications using tools like **Azure DevOps** for version control and CI/CD pipelines, improving deployment speed by **25%**.\n•\tFacilitated workshops and training sessions for clients to maximize the utilization of **CRM** integrations and **ESP** platforms, enhancing user adoption rates.\n•\tConducted regular reviews and assessments of tools like **Intercom** and other communication platforms to optimize customer engagement strategies and communication processes.\n•\tParticipated in cross-departmental projects designed to streamline processes, which resulted in a **20%** improvement in operational efficiency and customer service response time."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** to optimize database queries, enhancing data retrieval speeds by **35%** for customer-related transactions and analytics.\nDesigned and integrated robust **APIs** for seamless communication between internal systems and external SaaS platforms, improving data exchange processes and user experience for **CRM** applications by **20%**.\nCollaborated with cross-functional teams using tools like **Slack** and **Intercom** to ensure effective communication and organizational success during project implementations, resulting in a **15%** increase in overall project delivery efficiency.\nImplemented comprehensive **ERP** solutions that streamlined customer onboarding processes, reducing the average onboarding time by **25%**.\nLed the development of customer support enhancements within the financial platform, utilizing **ESP** technologies to improve customer engagement and satisfaction.\nFostered teamwork and collaborative strategies to troubleshoot issues, ensuring ongoing support remains in line with customer requirements and expectations.\nProvided training and support to team members on best practices for utilizing software tools, demonstrating strong communication and organizational skills to elevate team performance."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **SQL** for efficient data querying and management, ensuring seamless integration of customer data within **CRM** systems to enhance user interaction.\nDeveloped and maintained robust **API** interfaces to facilitate communication between e-commerce platforms and **SaaS** applications, optimizing workflow for customer engagement initiatives.\nStreamlined customer support processes leveraging **Intercom** and **Slack** to enhance communication and organizational efficiency across teams, improving response times by **30%**.\nCoordinated efforts among cross-functional teams using effective teamwork strategies, leading to a **25%** reduction in project turnaround time for platform updates and feature rollouts.\nArchitected solutions for integrated workflows with **ERP** systems, ensuring alignment between operations and customer service, thereby improving transactional accuracy and data consistency.\nImplemented and optimized e-commerce features, driving utilization of customer insights from **ESP** tools to improve customer experience and increase engagement metrics by **15%**.\nFostered a culture of open communication and collaboration across departments, enhancing organizational capabilities and aligning project goals with customer needs.\nDemonstrated strong problem-solving skills by addressing customer feedback and unexpected challenges, leading to a **20%** increase in overall customer satisfaction ratings.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, SaaS, CRM, ESP, ERP, Intercom, Slack, communication, organizational, teamwork",
  "apply_company": "Hightouch"
}