{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior .Net Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior .NET Engineer with 13+ years in delivering high-performance applications, particularly in the healthcare and financial sectors. Proficient in **C#**, **ASP.NET**, **T-SQL**, and **SQL Server**, with extensive experience in developing web services and integrating with various systems including **Salesforce**, **SAP**, and **Oracle**.\nSkilled in technical problem solving, unit testing, and ensuring compliance with standards such as HIPAA and PCI DSS. Demonstrated ability in utilizing **JavaScript** and **HTML** for frontend development while effectively managing backend services. Strong communication skills facilitate collaboration with cross-functional teams to deliver robust solutions. Experienced in deploying and maintaining applications that enhance operational efficiency.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior .Net Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained robust web services using **ASP.NET**, **C#**, and **T-SQL**, ensuring high performance and reliability across applications based on structured and unstructured data.\n• Implemented secure Single Sign-On (SSO) and SAML authentication frameworks to enhance user identity management for applications in complex enterprise environments.\n• Engaged in technical problem solving and architected solutions utilizing **Microsoft SQL Server** for improved data storage and retrieval, handling queries for up to **10 million records** efficiently.\n• Designed and integrated efficient data synchronization between systems like **Salesforce**, **PeopleSoft**, and **SAP** using **XML** and EAI principles to streamline operations.\n• Collaborated with cross-functional teams to deliver user-centric applications with **JavaScript**, **HTML**, and CSS, enhancing user experience while adhering to modern web standards.\n• Conducted unit testing and drive quality assurance practices using **Postman** and other testing tools to ensure code robustness and security compliance.\n• Utilized **Oracle** and **Siebel** for customer management solutions, contributing to a **30%** improvement in client satisfaction metrics through timely support and updates.\n• Engaged in effective communication between engineers and stakeholders to ensure project alignment and clarity in requirements and deliverables.\n• Streamlined development processes and improved deployment practices through integration of DevOps methodologies with successful use of tools like GitHub Actions and Azure DevOps."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **C#** and **ASP.Net** to modernize core financial platforms, ensuring seamless integration with existing systems and improving performance metrics significantly.\nEngaged in technical problem solving by implementing **Web services** for smooth communication between internal applications and third-party platforms like **Salesforce** and **PeopleSoft**.\nDeveloped and maintained SQL queries using **T-SQL** for **SQL Server** databases, achieving a **20%** increase in data retrieval efficiency and optimizing reporting processes.\nDesigned and implemented Single Sign-On (SSO) and SAML protocols to enhance security measures, resulting in a **30%** decrease in authentication-related support tickets.\nCollaborated with cross-functional teams to resolve technical challenges efficiently, enhancing overall project delivery timelines by **15%** through improved communication strategies.\nConducted unit testing and debugging to ensure robust code quality across multiple platforms, leading to a **25%** reduction in post-deployment issues.\nEngaged with enterprise application integration (EAI) efforts to ensure smooth workflow across systems such as **SAP**, **Oracle**, and **Siebel**, fostering an ecosystem of interconnectivity.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and optimized **ASP.NET** applications, focusing on business logic and backend services performance for robust e-commerce solutions, ensuring smooth functionality in high-traffic environments with **SQL Server** integration.\n• Implemented secure **web services** using **C#** and **JavaScript**, enhancing application interoperability and enabling seamless communication between various software components and third-party tools.\n• Leveraged expertise in **unit testing**, delivering high-quality, bug-free code, improving overall system reliability by **30%** through effective test-driven development practices.\n• Collaborated with cross-functional teams to deploy features via **SSO** and **SAML**, ensuring secure, streamlined user authentication and authorization mechanisms.\n• Engineered data access and manipulation processes with **T-SQL**, facilitating efficient data retrieval and manipulation, optimizing performance for complex queries by **25%**.\n• Utilized **EAI** strategies for connecting legacy systems like **Salesforce** and **SAP** with modern applications, enhancing data flow and integration efficiency across platforms.\n• Solved technical problems and collaborated closely with stakeholders to communicate developments, addressing issues proactively and enhancing user satisfaction ratings by **15%**.\n• Designed interfaces using **HTML** and **CSS**, adhering to best practices to create clean, user-friendly experiences, compliant with accessibility standards (WCAG 2.1).\n• Continuously improved system performance using strategic redesigns for core modules, resulting in a **10%** increase in page load speeds and system responsiveness.\n• Developed secure solutions using industry standards, showcasing commitment to data protection and regulatory compliance in all project phases."
    }
  ],
  "skills": "Programming Languages:\n\tC#, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tASP.Net, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML\n\n**API Technologies:**\n\tWeb services, SSO, SAML\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tSQL Server, PostgreSQL, MySQL, MongoDB, Redis, Oracle\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, XML, Salesforce, PeopleSoft, SAP, Siebel, EAI, Technical problem solving, Unit testing, Communication, Nginx, Let’s Encrypt, Certbot, Terraform, Ansible, Helm, Docker Compose",
  "apply_company": "Cornerstone OnDemand"
}