{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Innovative Software Developer with 13+ years of experience specializing in **C++**, **Python**, **React**, **Microservices**, and **Agile** methodologies. Demonstrated expertise in building scalable applications utilizing **Git**, **Linux**, and **Kubernetes**, along with strong knowledge of **Cmake** and **GoogleTest** for robust software testing and development. Skilled in implementing event-driven architectures and deploying applications within a **RabbitMQ** and **Cassandra** infrastructure.\nProficient in collaborating within cross-functional teams, fostering effective communication and teamwork while adhering to compliance standards. Proven ability to deliver high-performance applications tailored to meet healthcare and financial sector needs while harnessing AI/ML technology. Versatile in leveraging cloud services and automation to enhance system performance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and managed microservices architectures utilizing **Kubernetes** for scalable and resilient applications, aligning with Agile development practices.\n- Collaborated with cross-functional teams to ensure effective teamwork and communication, enhancing software quality and project outcomes.\n- Implemented version control and collaboration workflows using **Git**, fostering seamless code management and team collaboration.\n- Designed and optimized C++ modules as necessary, ensuring performance and reliability in high-load environments.\n- Employed **CMake** for cross-platform builds, streamlining project setup and dependencies to enhance development workflow.\n- Integrated testing frameworks, such as **GoogleTest**, to establish robust unit and integration tests, ensuring high-quality software delivery.\n- Built responsive user interfaces with **React** to deliver optimal user experiences, utilizing a component-based architecture for maintainability.\n- Engaged in continuous learning and integration of **Linux** systems to support application deployment and performance monitoring.\n- Participated in performance optimization and tuning of backend services leveraging **Python** to improve overall system efficiency.\n- Contributed to architectural discussions and design definitions, playing a key role in team decision-making.\n- Adopted best practices for software development and ensured adherence to coding standards across the codebase."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)** and **Python** frameworks to modernize core financial platforms through microservices architecture, enhancing scalability and performance for high-volume transactional systems.\nDeveloped applications using **C++** and **Node.js** alongside testing frameworks like **GoogleTest**, ensuring high code quality and reliability in software development.\nImplemented **Git** version control for collaborative projects, enhancing team productivity and code management during Agile sprints.\nDesigned and executed strategies for deploying applications within containerized environments using **Kubernetes** and **OpenStack**, improving development lifecycle and resource management.\nManaged background job processing with **RabbitMQ**, ensuring efficient asynchronous communication across critical workflows, such as payment processing and alert systems.\nConducted code reviews and enforced best practices, fostering effective **teamwork** and enhancing software functionality through constructive **communication**.\nLeveraged **Linux** as the primary operating system for deployment and application monitoring, ensuring robustness and system reliability under high-load conditions.\nImplemented performance tuning on applications and database queries, improving response times by up to **30%** in production environments.\nCollaborated with cross-functional teams to align software development efforts with user needs and business objectives, catalyzing a **25%** increase in user satisfaction scores."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C++** for development and enhancement of software modules within a microservices architecture, ensuring modularity and maintainability across **9** deployed services.\nDeveloped interactive user interfaces using **React** (18), focusing on responsive design and performance, successfully reducing load times by **30%** on both web and mobile platforms.\nCollaborated in an Agile environment, facilitating effective communication and teamwork, leading to a **20%** improvement in sprint completion times.\nImplemented and maintained continuous integration/continuous deployment (CI/CD) pipelines with **Git** and **Kubernetes**, significantly reducing deployment times by **40%** and enhancing reliability.\nConducted comprehensive testing using **GoogleTest** and unit testing methodologies for C++ applications to ensure software quality and reliability, achieving a test coverage of over **85%**.\nConfigured and managed **OpenStack** environments to simulate production scenarios for rigorous testing, enabling consistent performance evaluation of all deployed services.\nLeveraged **Linux** for server environments and development workflows, enhancing operational efficiency and compatibility with industry-standard tools.\nImplemented messaging and queuing services using **RabbitMQ** to support asynchronous processing and improve system responsiveness, processing over **100,000** messages daily.\nEngaged in strategic planning and documentation activities, driving successful project outcomes through effective communication of technical concepts to team members and stakeholders."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, C++, JavaScript/TypeScript\n\n **Frontend Frameworks:**\n\tReact\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Microservices\n\n **API Technologies:**\n\tRabbitMQ, SIP, IMS\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, Azure: App Services, GoogleTest\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Cassandra\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm\n\n **Cloud & Infrastructure:**\n\tAWS: S3, RDS, Azure: Blob Storage, SQL Database, OpenStack\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Git, Linux, Agile, Keycloak, OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Teamwork, Communication, Redis"
}