{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a skilled Software Engineer with 8 years of full stack development experience, I am proficient in technologies such as **Java**, **PHP**, **HTML**, **CSS**, and **Git**, which align well with the demands of this role. My competencies extend to using **React**, **Vue**, and various frameworks like **Laravel** and **Coldbox** to create intuitive, user-centered applications that adhere to accessibility standards and responsive design principles.\nI have a solid background in software development methodologies, leveraging tools like **Jira** and **Confluence** for project management, and **Azure DevOps** for CI/CD practices. Additionally, my experience extends to cloud services, particularly **Azure**, ensuring efficient deployment and scalability.\nMy technical journey has also encompassed machine learning applications and data processing, where I led the development of enterprise solutions, ensuring they meet high-performance standards and regulatory compliance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained robust web applications using **React**, **Vue**, and **Angular**, focusing on responsive design and ensuring adherence to accessibility standards.\n• Participated in the full software development lifecycle, utilizing **Git**, **GitHub**, and **Azure DevOps** for version control and project management with tools like **Jira** and **Confluence** for task tracking.\n• Implemented and optimized backend services using **PHP** and **MySQL**, achieving a **30%** improvement in query performance and reducing load times by **20%**.\n• Collaborated effectively with cross-functional teams to ensure seamless user experiences and efficient workflows, integrating user feedback into design iterations.\n• Enhanced system functionalities by integrating frontend frameworks with backend technologies, ensuring data consistency and optimizing user interfaces across various devices.\n• Delivered timely project milestones while enforcing coding standards and best practices across **HTML**, **CSS**, and **Java** technologies for increased maintainability and scalability.\n• Led performance tuning and optimization tasks for existing applications, resulting in **25%** faster page load times and improved user engagement metrics.\n• Conducted thorough testing protocols and implemented automated testing frameworks for quality assurance, covering unit and integration tests.\n• Employed version control best practices to manage code changes and maintain project stability, contributing to an efficient code review process.\n• Developed documentation and guides for development processes, encouraging knowledge sharing among team members and enhancing overall team productivity."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Git** and **GitHub** for version control, enabling seamless collaboration with team members and ensuring code integrity through feature branching and pull request workflows.\nDesigned and developed user-friendly web applications adhering to **responsive design** principles, utilizing **HTML**, **CSS**, and **JavaScript** frameworks such as **React** (18) and **Vue.js** (3) to enhance user experience and accessibility.\nCollaborated in an Agile environment using **Jira** and **Confluence** to manage project timelines and documentation effectively, resulting in a **30%** increase in project delivery speed.\nImplemented server-side components using **PHP**, ensuring smooth integration with frontend interfaces and databases like **MySQL** and **SQL Server**, achieving **99.9%** uptime in production.\nConducted code reviews and maintained coding standards using **Subversion**, ensuring high code quality and adherence to **accessibility standards** across projects.\nCoordinated with cross-functional teams to establish a **CI/CD pipeline** with **Azure DevOps**, which improved deployment frequency by **25%** and reduced release time to production.\nParticipated in the development of robust back-end logic and interactions using **Coldbox** and **Laravel**, which improved data processing capabilities and maintainability.\nEngaged in continual learning and adoption of new technologies such as **Angular** and **jQuery**, facilitating the enhancement of existing systems and expanding technological capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized robust web applications using **React** (18), **Vue** 3, and **Angular**, ensuring adherence to **accessibility standards** (WCAG 2.1) and **responsive design** principles for seamless user experiences across devices.\nImplemented version control and collaboration tools such as **Git**, **GitHub**, and **Azure DevOps** to facilitate efficient team workflows, achieving a **30%** reduction in deployment time.\nDesigned, developed, and maintained backend services using **PHP** and **MySQL**, achieving improved data retrieval times by **25%** through optimized queries and effective database indexing.\nEngaged in Agile methodologies by utilizing **Jira** and **Confluence** for project management and documentation, enhancing team communication and tracking project progress.\nCreated visually appealing and user-friendly interfaces leveraging **HTML5** and **CSS3** standards, ensuring consistency and performance across the site to elevate user engagement.\nWorked with **Coldbox** and **Laravel** frameworks to build dynamic web applications, increasing development speed by leveraging their robust libraries and features.\nApplied front-end frameworks and libraries, including **jQuery** for enhanced interactivity, thus improving user satisfaction ratings by **15%** as measured by back-end analytics.\nConducted thorough UX testing and implemented changes based on user feedback, resulting in a **20%** increase in user retention over a **6-month** period.\nCollaborated with cross-functional teams to enhance application workflows and implement best practices in software development for long-term scalability."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, PHP, Coldfusion, Java\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, jQuery, Laravel, Coldbox, CSS, HTML\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, SQL Server, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Azure DevOps, Git, Subversion\n\n **Cloud & Infrastructure:**\n\tGitHub, Jira, Confluence\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, UX, accessibility standards, responsive design"
}