{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Lead Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Lead Software Engineer with 13+ years of experience in high-performance application development across healthcare and financial industries. Expertise in **Java**, **Spring Boot**, and **Python**, with strong proficiency in **Microservices**, **CI/CD** pipelines, and cloud platforms including **AWS**, **Azure**, and **GCP**. Skilled in **Docker**, **Kubernetes**, and implementing Infrastructure as Code for optimizing deployment processes.\nPassionate about Agile methodologies and Test-Driven Development (TDD) to ensure high code quality and efficient team collaboration. Proven track record of leading cross-functional teams, fostering communication, and ensuring adherence to project timelines.\nAdditionally, I have developed AI/ML-powered platforms using **React**, **Node.js**, **FastAPI**, and **Django**, with a solid foundation in compliance-driven development aligned with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. My background in MLOps encompasses model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Lead Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Led the design and development of full-stack solutions utilizing **Java** and **Spring Boot**, ensuring adherence to Agile methodologies and TDD best practices.\nDeveloped robust microservices architectures to improve application scalability and maintainability, leveraging **Docker** and **Kubernetes** for container orchestration and deployment in cloud environments including **AWS** and **Azure**.\nImplemented comprehensive CI/CD pipelines incorporating **GitHub Actions** and **Azure DevOps**, achieving a deployment frequency of over **50** releases per month while maintaining high code quality standards.\nMentored and guided a team of software engineers, fostering collaboration and communication to enhance project outcomes and facilitate career development within an Agile framework.\nEstablished Infrastructure as Code (IaC) practices using tools like **Terraform** and **CloudFormation**, enabling consistent and repeatable infrastructure deployment across environments and reducing setup time by **75%**.\nEnsured thorough testing practices by integrating automated testing frameworks, improving overall code reliability with a test coverage of **90%** across all services.\nSuccessfully managed cross-functional teams, leading project reviews and facilitating discussions to align technical objectives with business goals, achieving a **20%** increase in project delivery speed.\nActively participated in architectural reviews and design discussions, promoting best practices in code quality and documentation, resulting in improved maintainability and scalability of the codebase.\nUtilized **Python** in conjunction with advanced machine learning libraries such as **TensorFlow** and **scikit-learn** to implement features for risk management and fraud detection within financial applications.\nOversaw the deployment of cloud-based applications, enhancing performance and availability through effective monitoring and incident response strategies."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Led the modernization of core financial platforms by implementing microservices architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), resulting in a **30%** increase in system scalability and a **25%** boost in performance for high-volume transactional systems.\nChampioned the development of interactive front-end applications using **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, with Redux Toolkit and Tailwind CSS, achieving a **40%** improvement in user engagement for financial tools and admin panels.\nDesigned and deployed real-time analytics dashboards by integrating **React**, **D3.js**, and **Power BI Embedded**, which provided operations teams with instant insights into transactions and anomalies, enhancing operational efficiency by **35%**.\nImplemented a robust event-driven architecture utilizing **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring efficient asynchronous communication for critical workflows including payments, alerts, and compliance efforts.\nDeveloped ETL pipelines for ingesting financial data from both internal and third-party sources with **Python**, **Apache Airflow**, and **Azure Data Factory**, enabling both batch and real-time processing capabilities.\nLeveraged machine learning technologies like **scikit-learn**, **XGBoost**, and **Azure ML** to build and deploy models for proactive fraud detection, enhancing security by identifying suspicious activity based on user behavior and transaction patterns.\nCreated ML pipelines for real-time applications such as credit scoring, churn prediction, and transaction classification, employing **MLflow** and **Airflow** for seamless integration of model inference into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Led the design and optimization of backend services using **Java**, **Spring Boot**, and **Python** frameworks, ensuring high availability and scalability in a global e-commerce setting with support for **Microservices** architecture.\nManaged and coordinated Agile projects with a focus on **DevOps** practices, integrating CI/CD pipelines utilizing **Docker** and **Kubernetes** to streamline deployments and improve code quality.\nImplemented **Automated testing frameworks** to enhance the reliability of applications through Test-Driven Development (**TDD**), resulting in a **30%** reduction in production bugs over **6 months**.\nOversaw team management and mentorship, promoting effective communication and collaboration within an Agile team focused on delivering high-quality software solutions.\nLeveraged cloud services such as **AWS**, **Azure**, and **GCP** for deploying applications, ensuring robust infrastructure management through **Infrastructure as Code** practices.\nDesigned modular, efficient microservices for key features, improving application performance metrics by **40%** and supporting up to **100,000** simultaneous users.\nFacilitated cross-functional communication, fostering a culture of teamwork and continuous delivery over **2 years**, which increased project delivery speed by **25%**.\nApplied best coding practices and conducted code reviews, ensuring adherence to security protocols and enhancing overall code maintainability.\nPromoted a culture of learning and development, resulting in a **15%** increase in team productivity through ongoing training and knowledge sharing sessions."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Boot\n\n **Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **API Technologies:**\n\tMicroservices, Keycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tGCP\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\tCI/CD, Automated testing frameworks\n\tInfrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n **Other:**\n\tAgile, TDD, Code quality, Communication, Team management, Line management"
}