{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dedicated Senior Software Engineer with 9+ years of experience in designing and developing applications using **Python**, **Rust**, and **microservices** architectures. Proficient in **Docker** and **Kubernetes** for containerization and orchestration, alongside **gRPC** and **REST** for efficient API design. Adept in CI/CD methodologies to streamline the development process. Strong collaborative skills with a proven track record in leading projects to successful completion. Experienced in full-stack development, combining frontend technologies such as **ReactJS** and **NextJS** with backend solutions using **.NET** and **C#**. Exceptional team spirit and communication skills in English, enabling productive interactions across teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **gRPC** for building scalable microservices architecture, enhancing system resilience and reducing latency significantly.\nDesigned and developed REST APIs to seamlessly integrate with existing services, leveraging tools like **Docker** and **Kubernetes** for container orchestration and deployment.\nImplemented CI/CD pipelines using Azure DevOps, leading to a **40%** reduction in deployment time and improving overall workflow efficiency.\nCollaborated with cross-functional teams to adopt best practices in data management and architecture, fostering a **team spirit** in achieving project milestones.\nContributed to the transition from monolithic to microservices architecture, resulting in improved flexibility and maintainability of the codebase.\nOptimized system performance through advanced data analytics and query optimization, achieving a **20%** reduction in average query execution time.\nDeveloped comprehensive documentation in **English** to facilitate knowledge sharing and onboarding processes.\nEmployed **Docker** for environment consistency and scalability across multiple deployment stages, ensuring reliable application performance.\nSupported agile methodologies and participated in sprint planning sessions to align team goals with project requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed a microservices architecture using **Docker** and **Kubernetes**, implementing **gRPC** for efficient service communication, leading to a 30% increase in deployment efficiency.\n• Designed and implemented RESTful APIs with **Python** and **Rust** for high-performance applications, achieving a response time reduction by 20%.\n• Spearheaded CI/CD pipeline development with **Docker** and other automated tools, reducing production deployment errors by 30% across multiple environments.\n• Worked with PostgreSQL and **MySQL** databases, optimizing data retrieval queries for up to 40% faster performance and improved data handling.\n• Collaborated with a cross-functional team to define requirements and guided project phases, ensuring timely delivery of milestones within a scope of **7** key features.\n• Integrated monitoring solutions to track application performance data, leveraging insights to enhance scalability across services by **15%**.\n• Nurtured team spirit through mentoring and conducting code reviews, enhancing overall team productivity by **25%**.\n• Contributed to meetings in **English** to discuss technical challenges, leading to improved team cohesion and project alignment.\n• Enhanced system performance by integrating **Redis** for cache management, resulting in reduced latency in API calls by **20%**.\n• Created custom data visualizations and interactive charts using **D3.js**, improving project status reporting and transparency for stakeholders."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **Rust** to develop scalable microservices, enhancing application performance by **30%**.\nDesigned and implemented CI/CD pipelines using **Docker** and **Kubernetes** for container orchestration, reducing deployment time by **40%**.\nDeveloped and integrated high-performance **gRPC** APIs for efficient data transfer between services, ensuring real-time communication.\nCollaborated with cross-functional teams to migrate monolithic applications to a microservices architecture, improving system reliability.\nParticipated in daily standups and code reviews to foster team spirit and maintain high coding standards.\nCreated technical documentation and user guides to facilitate knowledge sharing among teams, improving onboarding process.\nLeveraged **REST**ful APIs to integrate the platform with third-party services, enabling seamless data sharing across systems.\nConducted performance testing and optimization of existing systems using modern data strategies, increasing data processing speeds by **25%**.\nImplemented best practices for software development and maintenance, enhancing system maintainability and scalability over versions."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, Rust\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL, gRPC\n\n **Serverless and Cloud Functions**\n\tAWS, Azure\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tDocker, Kubernetes, CI/CD pipelines\n\n **Cloud & Infrastructure**\n\tData\n\n **Other**\n\tUX/UI Design, Git, GitHub, Redis, Apache Kafka, RabbitMQ, Selenium, Moq, Postman, Cypress, JMeter, Jest, Solidity, Ether.js, Web3.js, Ethereum, team spirit, English",
  "apply_company": "Bending Spoons"
}