{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven **Senior Frontend Engineer** with 13+ years of experience mastering **JavaScript**, **TypeScript**, and **React** to deliver high-performance applications. Proficient in **Angular** and adept at building dynamic user interfaces aligned with **Agile** methodology and best practices in **DevOps** and **CI/CD**. Skilled in developing microservices and employing design patterns, ensuring scalable and maintainable code utilizing **SOLID** principles.\nSpecialized in deploying cloud solutions on **AWS** and managing container orchestration with **Kubernetes**, contributing to robust and efficient software architecture. Experienced with databases including **DynamoDB**, **Oracle**, **MySQL**, **MongoDB**, and **Elasticsearch**, to enhance data management and retrieval.\nRecognized for excellent bilingual communication skills and a commitment to aligning development processes with business needs.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** and **Angular** frameworks to develop sophisticated user interfaces, ensuring seamless integration with backend services and APIs.\nEmployed **TypeScript** to enhance code quality and maintainability across frontend applications, resulting in a **30%** reduction in bugs during production.\nCollaborated on **Agile** development teams, fostering strong communication and project management skills to deliver features on time and within scope.\nImplemented **DevOps** practices using **GitLab CI** for automated continuous integration and deployment processes, improving deployment frequency by **40%**.\nArchitected and developed performant microservices, ensuring adherence to **SOLID** principles and **Design Patterns**, which facilitated easy scalability and maintenance.\nManaged containerization and orchestration of applications with **Kubernetes**, achieving **99.9%** uptime across production and staging environments.\nInterfaced with various databases like **MongoDB**, **MySQL**, and **Elasticsearch** to handle data queries and storage for dynamic web applications, optimizing query performance by **25%**.\nEnsured application security and compliance with best practices while integrating AWS services for cloud-based functionality.\nDesigned responsive and intuitive user experiences while meeting business requirements, contributing to a **15%** increase in user engagement.\nAssisted in mentoring junior developers, promoting knowledge sharing and professional growth within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)**, **Angular**, **JavaScript**, and **TypeScript** to build interactive front-end applications, ensuring seamless user experience for complex financial tools and admin panels.\nImplemented **microservices** architecture principles, integrating various services through effective design patterns for improved scalability and maintainability.\nCollaborated with cross-functional teams in an **Agile** environment, delivering high-quality software solutions aligned with business needs and ensuring continuous integration using **GitLab CI**.\nDeveloped robust RESTful APIs ensuring adherence to **SOLID** principles to support integrations between front-end applications and backend services.\nEmployed **DevOps** practices, including containerization with **Kubernetes** and cloud deployment on **AWS**, streamlining build, test, and deployment processes.\nEnhanced performance by optimizing data queries across **DynamoDB**, **Oracle**, **MySQL**, and **MongoDB**, achieving a **30%** increase in response times.\nFacilitated internationalization for applications with bilingual support, improving accessibility for diverse user groups.\nFostered excellent communication with stakeholders, gathering requirements, and implementing features that align with the strategic objectives of the company."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed responsive frontend applications using **React (18)**, **Angular**, and **TypeScript**, focusing on delivering fast, dynamic user experiences for e-commerce platforms.\n• Collaborated in an **Agile** environment to iterate on user stories and requirements, ensuring timely delivery of high-quality features.\n• Optimized application performance through best practices in **JavaScript** including **SOLID** principles and various **Design Patterns**, enhancing maintainability and scalability.\n• Participated in continuous integration and deployment (CI/CD) processes using **GitLab CI**, ensuring seamless updates and reduced downtime during releases.\n• Implemented microservices architecture focusing on modular design, improving system reliability and allowing parallel development on multiple frontend components.\n• Integrated with cloud services such as **AWS** for scalable backend operations, enhancing application resiliency and load management.\n• Utilized **Kubernetes** for orchestrating containerized applications, enabling effective deployment and management of applications in diverse environments.\n• Maintained best practices in code versioning and collaboration through **GitLab**, enhancing team communication and project tracking. \n• Engaged in regular code reviews and pair programming sessions to foster a culture of continuous learning and knowledge sharing among engineering teams.\n• Ensured application accessibility and compliance with standards, including WCAG 2.1, to provide an inclusive experience for all customers.\n• Actively participated in user testing and feedback sessions to iterate on designs and enhance usability based on customer insights."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tAngular, React\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS, Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, DynamoDB, Oracle\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tBilingual, Communication, Agile, Microservices, SOLID, Design Patterns, MLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Redis, Elasticsearch",
  "apply_company": "Ticketmaster"
}