{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Backend Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a highly skilled Senior Backend Engineer with 8 years of experience, I excel in backend technologies, integrating **Java**, **Spring Boot**, and **Postgres** to develop scalable and efficient financial products. I am proficient in working with **Docker** and **Kubernetes** for containerization and orchestration, ensuring seamless deployments and high availability. My focus on Test-Driven Development (TDD) enables the delivery of robust and maintainable code, while my knowledge of databases like **MongoDB** and **Cassandra** allows me to design and implement effective data storage solutions.\nIn addition to my backend expertise, I have a strong foundation in machine learning, leveraging it to enhance product functionality and drive data-driven decisions. I have led initiatives integrating machine learning capabilities and possess solid mathematical skills that support analytical reasoning and problem-solving. My strong communication skills facilitate collaboration within teams and ensure accountability and ownership across projects, contributing to successful outcomes in dynamic environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented scalable backend solutions using **Java** and **Spring Boot**, ensuring robust integration with **Postgres** and **MongoDB** to support complex financial products and data processing.\nDeveloped microservices architectures utilizing **Docker** and **Kubernetes** for deployment and scaling, promoting high availability and seamless performance across services.\nEmployed Test Driven Development (TDD) methodologies to enhance code quality and maintainability, implementing comprehensive testing strategies with tools like JUnit and Mockito, yielding a **30% reduction in bugs** post-deployment.\nCollaborated with cross-functional teams to deliver effective solutions in financial markets, leveraging strong communication skills and fostering a sense of ownership and accountability throughout the project lifecycle.\nDesigned and optimized data models in **Cassandra** and **Postgres** for rapid access and querying of financial data, resulting in a **40% increase in query performance** for critical operations.\nUtilized machine learning techniques to create predictive models that analyze stock market trends, enhancing decision-making processes for financial stakeholders.\nDeveloped internal APIs for integration with additional services, ensuring seamless data exchange and real-time processing of financial transactions.\nConducted code reviews and provided mentorship to junior developers, supporting the growth of team capabilities and the adoption of best practices.\nEstablished efficient CI/CD pipelines to streamline deployment processes, significantly reducing release times by **50%** through the integration of automated testing and deployment strategies.\nMaintained high standards of security and compliance within financial products, adapting to regulations and improving the overall durability of software solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Implemented robust backend solutions using **Java** and **Spring Boot** to enhance financial platforms, ensuring high availability and performance for processing **9 million+** transactions daily.\nDesigned database schemas and optimized queries using **Postgres** and **MongoDB**, achieving a **30%** increase in data retrieval efficiency for financial reports and dashboards.\nUtilized **Docker** and **Kubernetes** to create a consistent and scalable deployment environment, reducing deployment times by **50%** and improving service reliability.\nEmployed Test Driven Development (TDD) practices to deliver high-quality code with **90%** test coverage, significantly minimizing production issues and ensuring adherence to financial compliance standards.\nIntegrated **Astra-DB** and **Cassandra** for handling large-scale data storage and retrieval, enhancing scalability to support complex financial products and stock market data analytics.\nCollaborated with cross-functional teams to deliver financial services, demonstrating strong communication, ownership, and accountability, ensuring project milestones were met on time.\nApplied Machine Learning techniques to improve transaction classification and fraud detection, resulting in a **15%** reduction in false positives and enhancing security within financial products.\nFostered teamwork by mentoring junior developers and conducting code reviews, leading to a **25%** improvement in team productivity and cohesion."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Spring Boot** to design and optimize backend services for a global financial platform, ensuring high availability, low latency, and scalability in critical services, including payment processing and transaction handling.\nEmployed **Postgres** and **MongoDB** for data management, ensuring fast, reliable access to transactional data and enabling high-performance query optimization for data-heavy operations.\nImplemented **Kubernetes** and **Docker** to streamline deployment processes, achieving consistent environments and facilitating easy scaling across multiple microservices with over **99.9%** uptime.\nConducted **Test Driven Development (TDD)** practices to enhance code quality and reduce defects by **30%**, ensuring robust and maintainable backend systems that support critical financial operations.\nIntegrated machine learning capabilities using algorithms to enhance financial product recommendations, utilizing advanced mathematics to improve predictive accuracy and provide valuable insights for stock market analytics.\nFostered a culture of ownership and accountability, leading cross-functional teamwork initiatives that resulted in a **25%** faster delivery of key project milestones.\nTransformed legacy workflows into modern architectures by adopting a microservices approach, enabling the development of scalable solutions that align with current technology trends and customer needs.\nActively communicated technical concepts to non-technical stakeholders, ensuring alignment across teams while advocating for user-centered design in financial product development.\nEmphasized strong collaboration with product teams to build secure features, applying role-based access control (RBAC) and data protection strategies compliant with GDPR regulations."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, Java, JavaScript/TypeScript, Ruby \n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django, Spring Boot, Ruby on Rails \n\n **Frontend Frameworks:** \n\tReact, Vue, Angular \n\n **API Technologies:** \n\tOAuth2, Keycloak (OIDC, RBAC), JWT \n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL) \n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis, Cassandra, Astra-DB \n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose \n\n **Cloud & Infrastructure:** \n\tAWS, Azure \n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Test Driven Development, Financial Products, Stock Market, Mathematics, Communication, Ownership, Accountability, Teamwork ",
  "apply_company": "wealthAPI"
}