{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Frontend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Frontend Engineer with 13+ years of experience specializing in high-performance application development. Expertise in **JavaScript**, **TypeScript**, **React**, **Vue.js**, and building **RESTful APIs** to deliver scalable, maintainable, and optimized solutions. Proficient in applying **CI/CD** practices, component-based architecture, and frontend testing strategies to enhance project quality and deployment speed.\nStrong focus on performance optimization, accessibility, responsiveness, and usability, ensuring end-user satisfaction across complex applications. Adept at working in **Unix environments** and maintaining code integrity with **version control** practices.\nDemonstrated organizational and communication skills, effectively managing stakeholder expectations while driving project success. Additionally, I bring valuable experience from the healthcare and financial sectors, enabling compliance-driven development aligned with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and optimized user interfaces using **JavaScript** frameworks including **React (17–18)** and **Vue.js**, ensuring high performance, accessibility, and responsiveness across all devices.\n• Collaborated with backend teams to design and consume **RESTful APIs**, focusing on scalability and usability requirements for responsive web applications in the healthcare and fintech sectors.\n• Championed **CI/CD** practices by implementing automated testing and deployment strategies using **GitHub Actions** and **CircleCI**, achieving a 30% reduction in deployment times and improved development workflows.\n• Led the adoption of component-based architecture principles to enhance code reusability, maintainability, and testability, benefiting several projects with enhanced frontend testing strategies.\n• Engaged stakeholders effectively to gather and analyze requirements, ensuring project timelines and organizational priorities were met, leading to a 25% increase in stakeholder satisfaction metrics.\n• Conducted performance optimization techniques to ensure rapid load times and fluid user experiences, contributing to a 40% increase in user retention.\n• Established best practices for responsive design and scalable styling, enhancing the overall usability and user experience for diverse application interfaces.\n• Mentored junior team members in **TypeScript** and frontend technologies, fostering skilled collaboration and improved communication within the team.\n• Maintained version control using tools like Git, facilitating smooth code management and collaborative development across projects in Unix environments."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to enhance user experiences and optimize performance using **React (18)** and **Vue 3** for high-quality, responsive frontend applications.\nImplemented rigorous **frontend testing strategies** to ensure code reliability and improved application performance, achieving a **30% reduction** in bugs during production.\nDeveloped and maintained **RESTful APIs** to facilitate smooth communication between frontend components and backend services, ensuring data integrity and efficiency.\nEmployed **CI/CD** practices for streamlined deployment processes, reducing deployment time by **50%** and ensuring high availability of applications in a **Unix environment**.\nCreated and implemented **component-based architecture** leading to increased code reusability and maintainability, resulting in a **40% faster** development cycle.\nOptimized application responsiveness and usability, achieving an **impressive 95%** user satisfaction rate based on feedback surveys.\nEnsured accessibility standards across all applications, adhering to the latest **WCAG 2.1** guidelines to enhance usability for all users.\nDemonstrated strong **communication and organizational skills** while effectively managing stakeholder expectations and aligning project objectives with business goals.\nMentored junior developers in best practices for **scalable styling** and application design to foster team growth and elevate collective expertise."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and deployed high-performance applications using **React (18)** and **Vue.js (3)**, ensuring responsiveness and usability across various devices.\n• Utilized **TypeScript** to enhance code reliability and maintainability, improving overall development efficiency.\n• Collaborated with backend teams to design and implement robust **RESTful APIs**, optimizing performance to handle up to **10,000** concurrent users efficiently.\n• Established CI/CD processes that accelerated deployment cycles, reducing time-to-market for new features by **40%**.\n• Championed component-based architecture, leading the development of reusable UI components, significantly improving development speed and consistency across the platform.\n• Conducted thorough frontend testing strategies using frameworks like Jest and Cypress, ensuring adherence to quality standards and reducing bug reports by **30%**.\n• Applied performance optimization techniques to enhance site load times by **50%**, ensuring a seamless user experience.\n• Ensured web applications adhered to accessibility guidelines (WCAG 2.1), enhancing usability for all users, including those with disabilities.\n• Fostered excellent communication and organizational skills, leading cross-functional meetings to align on project goals and timelines, ensuring stakeholder management is executed effectively.\n• Worked in **Unix environments** and utilized **Git** for version control, maintaining a clear project history and facilitating team collaboration.\n• Developed scalable styling solutions that improved frontend performance and minimized load times, contributing to a better overall user experience."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tRESTful APIs\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3; Azure: App Services, Blob Storage, SQL Database\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tCI/CD, Component-based architecture, Frontend testing strategies, Performance optimization, Scalable styling, Unix environments, Version control, Accessibility, Responsiveness, Usability, Communication, Organizational skills, Stakeholder management",
  "apply_company": "Storyblok"
}