{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior Software Engineer with 8 years of experience, expertly skilled in **TypeScript**, **React**, **Azure**, **AWS**, **CI/CD**, and **Terraform**. Proven success in building high-performance applications across the healthcare and financial sectors, focusing on asynchronous services and stream processing. My comprehensive tech stack includes **.NET**, **Kubernetes**, along with modern frameworks like **Node.js** and **FastAPI**. \n\nI have a strong foundation in developing enterprise-grade platforms with an emphasis on microservices architecture, AI/ML capabilities, and real-time data processing. My hands-on experience in deploying robust solutions is complemented by my work in edge software deployment and integration with digital identity and open banking systems. \n\nI excel at collaborating with cross-functional teams, producing clear user stories and design documents, and ensuring projects align with compliance standards such as HIPAA and PCI DSS. I am also adept at implementing MLOps workflows with tools like **MLflow** and **Airflow**, driven by a commitment to quality, security, and regulatory adherence.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack applications focusing on **TypeScript**, **React**, and **C#** within the **.NET** framework, ensuring high performance and reliability.\n• Developed CI/CD pipelines for application deployment using modern tools, including **Azure DevOps** and **Terraform**, achieving an average deployment time reduction of **30%**.\n• Integrated cloud services with **AWS** and **Azure**, ensuring secure and efficient resource management and compliance with industry standards.\n• Architected asynchronous services, enhancing application responsiveness and performance by **25%** through effective stream processing techniques.\n• Managed containerized applications leveraging **Kubernetes**, resulting in improved scalability and easy orchestration across **5** different environments.\n• Collaborated with cross-functional teams to deliver user stories and design documents that align technical solutions with business goals.\n• Established robust communication channels within the team, leading to improved project clarity and efficiency, contributing to a **15%** improvement in project delivery timelines.\n• Enhanced code quality through unit testing frameworks such as **Jest** and **Cypress**, achieving **90%** test coverage across critical components.\n• Spearheaded efforts to utilize edge software deployment strategies, significantly reducing latency for end users by **40%**.\n• Provided mentorship on best practices for integration of digital identity solutions and verifiable credentials in line with open banking standards.\n• Engaged in the continuous improvement of development processes, leading to an increase in team productivity by **20%** through agile methodologies and feedback loops."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** and **React (18)** to develop and enhance dynamic, responsive user interfaces for financial applications, ensuring top-notch performance and user satisfaction.\nEmployed **C#** and **.NET** frameworks for backend development, focusing on creating efficient and maintainable code for enterprise-level applications.\nImplemented **Azure** services to streamline deployment processes and enhance the scalability of applications, achieving a 30% reduction in deployment time and improved resource management.\nLed the transition to **Kubernetes** for managing containerized applications, resulting in a 50% increase in application stability and improved resource utilization.\nIncorporated **CI/CD** practices to automate build and deployment processes, enhancing the delivery pipeline's efficiency and reducing time-to-market by **20%**.\nDesigned, developed, and maintained asynchronous services using **Azure Service Bus** and **RabbitMQ**, supporting real-time event processing and system responsiveness.\nCollaborated on creating design documents and user stories to ensure clear communication of project requirements and objectives across teams, improving alignment and reducing development cycles by **15%**.\nFostered an environment of continuous improvement through regular communication of project updates, facilitating stakeholder engagement and satisfaction.\nExplored and integrated **Terraform** for infrastructure-as-code practices, improving project reproducibility and reducing configuration errors by **25%**.\nEngaged with open banking frameworks and implemented digital identity solutions, ensuring compliance with industry standards and enhancing user trust in financial services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed scalable and high-performance backend services leveraging **C#**, **.NET**, and **Azure** for a seamless global e-commerce platform, achieving **99.9% uptime** and reduced latency across checkout and order processing modules.\n• Engineered asynchronous services using **Rust** and **Go**, processing over **100,000** real-time events daily via **stream processing** frameworks, enhancing user experience and operational efficiency.\n• Created user-friendly frontend applications using **TypeScript** and **React** (18) with a commitment to performance optimization, increasing page load speeds by **30%** on mobile platforms.\n• Implemented CI/CD pipelines in **AWS** and **Terraform** to automate deployments, reducing deployment times by **50%** and enhancing release management across development teams.\n• Orchestrated containerized applications with **Kubernetes**, optimizing deployment and scaling of microservices under high traffic scenarios with a focus on reliability and performance.\n• Collaborated on user stories and design documents to align development with business objectives, enhancing communication between cross-functional teams, resulting in a **20%** increase in stakeholder satisfaction.\n• Integrated digital identity solutions and verifiable credentials, ensuring compliance with **open banking** standards to protect sensitive user information during transactions.\n• Applied rigorous testing strategies and utilized A/B testing frameworks, achieving up to **25%** enhancements in user engagement with new features rolled out via feature flags.\n• Leveraged edge software deployment techniques, optimizing data processing and responsiveness of AI agent authorizations, establishing a robust architecture for customer interactions."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript, C#, Rust, Go, C++\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, .NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOpen Banking, Digital Identity, Verifiable Credentials, AI Agent Authorization\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tAsynchronous services, Stream processing, User stories, Design documents, Communication, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Propellerhead"
}