{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a results-driven Senior Sales Engineer with 8 years of experience, I excel in delivering technical solutions and driving customer-focused outcomes. My strong knowledge in **Elektrotechnik** and **Energieanlagenelektroniker** underpins my contributions to complex projects, where I implement efficient and innovative electrical systems tailored for client needs.\nI possess exceptional skills in project management and create engaging presentations that effectively communicate technical ideas to stakeholders. I am adept at identifying project requirements through meticulous Ausschreibungen and demonstrating the value of our products through persuasive storytelling and presentations.\nIn addition to my technical acumen, I bring a proactive approach and creative thinking to tackle challenges, enabling me to deliver high-quality solutions that align with client expectations. My experience also includes a solid foundation in developing and integrating modern technologies, backed by a robust understanding of system dynamics.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Demonstrated **technical knowledge** in **electrical engineering** by devising and delivering customized technical solutions for clients, ensuring high levels of **customer orientation** through active engagement.\nUtilized **project management** skills to oversee the lifecycle of multiple sales projects, ensuring timely completion within budgetary constraints, resulting in a **25% increase** in client satisfaction scores.\nShowcased strong **presentation skills** by effectively presenting complex technical concepts to diverse stakeholders, increasing engagement and understanding by **30%**.\nLed workshops on **technical solutions** and proposals for **tender submissions**, enhancing the team's quote success rate by **20%**.\nApplied **creative thinking** and **initiative** to develop innovative strategies that addressed client needs, positioning the company as a key partner in their projects.\nCollaborated closely with engineering teams to ensure all proposals accurately represented current technological advances, thereby improving response accuracy by **15%**.\nMaintained strong client relationships through regular follow-ups and presentations of new technologies and solutions, resulting in a **40% increase** in repeat business.\nUtilized advanced **electrical engineering** principles to troubleshoot and resolve technical challenges presented by clients, ensuring efficient resolution in **95%** of cases."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided technical solutions and support as a **Senior Sales Engineer**, demonstrating strong **technical knowledge** in **Energieanlagenelektronik** and **Elektrotechnik** to meet client needs and enhance customer satisfaction.\nSuccessfully managed **9** project proposals and presentations, ensuring alignment with client requirements and showcasing our innovative solutions to increase client engagement and trust.\nImplemented customer-oriented strategies to improve **Kundenorientierung**, conducting in-depth market analysis and developing tailored proposals based on customer feedback and project specifications.\nHarnessed **Eigeninitiative** to spearhead the development of technical solutions and strategies, leading to a **15%** increase in project approvals by addressing client challenges directly.\nEmployed creative thinking to devise effective responses to **Ausschreibungen**, enhancing the company's competitive stance and securing new contracts with a win rate of **30%** through compelling and detailed submissions.\nLed project management efforts for the implementation of various energy systems, collaborating with cross-functional teams to ensure timely delivery of solutions based on client specifications and project deadlines.\nUsed effective presentation skills to communicate complex technical information clearly to clients and stakeholders, facilitating better understanding of proposed projects and fostering strong client relationships."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized advanced **technological solutions** to design and implement customized **lighting systems (Notbeleuchtungssysteme)** that meet client specifications, ensuring optimal energy efficiency and reliability.\nDemonstrated **technical expertise in electrical engineering (Elektrotechnik)** by advising clients on suitable energy installations, enhancing customer satisfaction through tailored solutions.\nConducted thorough presentations of **lighting technologies** and energy systems to clients, showcasing their benefits and generating interest through informative sessions and engaging narratives.\nManaged project timelines, budgets, and resources effectively, demonstrating **project management** skills that resulted in the timely delivery of over **15 major projects** across diverse industries.\nExercised **initiative and creativity** in developing innovative proposals for system designs and enhancements, leading to increased sales and a **30% improvement** in client retention rates.\nWorked closely with clients to define project scopes, developing detailed proposals and **bid documentation** that addressed client needs and project specifications.\nApplied strong **customer orientation** skills to foster long-term relationships and address client concerns proactively, resulting in a **25% increase** in upsell opportunities.\nCollaborated with cross-functional teams to deliver high-quality technical solutions, ensuring alignment with product capabilities and client expectations.\nMaintained up-to-date knowledge of **industry trends** and product developments, leveraging this knowledge to provide insights during client meetings and discussions.\nDeveloped and delivered customized training programs to clients on the operation of lighting systems and energy solutions, enhancing user proficiency and satisfaction."
    }
  ],
  "skills": "Programming Languages:\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Kundenorientierung, Technische Lösungen, Präsentationen, Ausschreibungen, Projektmanagement, Eigeninitiative, Kreatives Denken, Technisches Wissen, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Eaton"
}