{
  "name": "Tomasz Lee",
  "role_name": "Senior Frontend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 9+ years of experience in developing user-centric web applications. Proficient in **React**, **TypeScript**, and **GCP**, with a strong focus on enhancing user experience and delivering top-tier digital wallet and payment services solutions. Demonstrated expertise in collaborating across cross-functional teams and executing autonomous decision-making processes to optimize workflow efficiency. Known for spearheading innovations in fraud detection mechanisms and streamlining application performance, leveraging skills in both frontend and backend technologies to create scalable applications.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **React** and **TypeScript** to enhance the development of web applications, driving a **25%** increase in user satisfaction through intuitive design and functionality.\nCollaborated cross-functionally with UX/UI designers to improve user experience, ensuring that design elements align with user needs and trends.\nImplemented asynchronous decision-making processes for streamlined workflow, resulting in increased team autonomy and efficiency in building features.\nDeveloped fraud detection measures by integrating robust payment services in the digital wallet application, improving transaction security by **30%**.\nSpearheaded the adoption of **GCP** for cloud services, enhancing system scalability and performance metrics by **20%**.\nDesigned and maintained high-quality web applications, focusing on developing reusable components and improving code quality.\nParticipated in code reviews and peer programming sessions, fostering a culture of continuous improvement and knowledge sharing within the team.\nUtilized Agile methodologies to ensure timely delivery of product features and enhancements, increasing overall productivity by **15%**.\nEnsured application performance optimization by implementing best practices and tools, reducing load times by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and maintained **React** components with **TypeScript**, enhancing user experience and engagement by **25%** on web applications.\n• Collaborated cross-functionally to define user requirements and timelines, ensuring timely deliveries with high-quality standards.\n• Implemented **GCP** for deployment and scaling of web applications, contributing to improved reliability and performance.\n• Designed asynchronous decision-making processes for fraud detection in digital wallet transactions, increasing security and reducing fraud incidence.\n• Built payment services within a microservices architecture, facilitating secure and efficient transactions for users.\n• Conducted user experience research to optimize interface designs, resulting in a **15%** increase in user satisfaction scores.\n• Led mentorship sessions with junior developers, fostering a culture of autonomy and continuous improvement within the team.\n• Engaged in regular code reviews to ensure quality and adherence to best practices, enhancing overall team productivity by **30%**.\n• Developed analytics dashboards using **D3.js**, providing stakeholders with vital insights and tracking capabilities.\n• Managed complex data interactions between web applications and databases like **PostgreSQL**, ensuring real-time data flow and integrity."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed responsive web applications using **React** and **TypeScript**, enhancing user experience and cross-platform compatibility by 30%.\n• Implemented **GCP** services for hosting and scaling applications, achieving a 25% reduction in operational costs.\n• Designed and integrated digital wallet functionality within web applications, streamlining payment services for over 10,000 users.\n• Conducted fraud detection analytics, ensuring secure transactions and reducing fraudulent activities by 15%.\n• Collaborated cross-functionally with backend developers and design teams to ensure cohesive application functionality and design.\n• Championed asynchronous decision-making processes, fostering autonomy within the engineering team and improving response time to user feedback.\n• Maintained and updated existing web applications, successfully migrating two legacy systems to modern frameworks enhancing maintainability and performance.\n• Participated in daily standups and code reviews, ensuring adherence to coding standards and project goals.\n• Delivered comprehensive technical documentation and user guides, improving knowledge transfer among teams and reducing onboarding time by 40%."
    }
  ],
  "skills": " **Programming Languages** \n\t React, TypeScript, Python, Scala\n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks** \n\t HTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies** \n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions** \n\t AWS, Azure, GCP\n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps** \n\t CI/CD pipelines\n\n **Cloud & Infrastructure** \n\t AWS, Azure, GCP\n\n **Other** \n\t UX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Fraud Detection, Digital Wallet, Payment Services, Web Applications, User Experience, Cross-functional Collaboration, Autonomy, Asynchronous Decision Making",
  "apply_company": "Hopper"
}