{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior VoIP Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior VoIP Engineer with 13+ years of experience, specializing in **VoIP**, **SIP**, **PBX**, and **WebRTC** technologies. Proficient in implementing and maintaining **Amazon Connect** solutions and **AWS Lambda** functions, ensuring high-performance communication systems. Strong analytical skills demonstrated through the use of **WireShark** for protocol analysis and troubleshooting. Experienced in collaboration with cross-functional teams using **Jira Software**, **Confluence**, and design collaboration tools such as **Visio** and **Miro**. \n\nAdditionally skilled in **Python** and bringing a robust background in full stack development with technologies such as **React**, **Node.js**, **FastAPI**, and more. Proven track record in cloud-native architectures with **AWS** and **Azure**, alongside a solid understanding of compliance standards including HIPAA and PCI DSS. Adept in leveraging Agile methodologies for effective project management.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior VoIP Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** for developing customized VoIP solutions, employing frameworks such as **AWS Lambda** for scalable function-based architecture and seamless integration with **Amazon Connect** services.\nDesigned and implemented voice communication systems leveraging **SIP** protocols and **WebRTC**, ensuring high-quality audio and video performance in real-time.\nManaged and configured **PBX** systems, utilizing **VoIP** best practices to enhance call quality and system reliability across multiple platforms.\nDeveloped workflow diagrams using **Visio** and collaborated on project artifacts with **Miro** and **Confluence**, ensuring clear team communication and project alignment.\nLed troubleshooting efforts with **WireShark** for packet analysis, significantly reducing call drop rates by **25%** through targeted optimizations and network adjustments.\nEmployed Agile methodologies in project management using **Jira Software**, facilitating iterative developments and timely deliverables across **9**+ projects.\nConducted training sessions for team members and stakeholders about VoIP systems and **AWS Lambda** integrations, leading to a **30%** increase in team efficiency.\nExecuted comprehensive testing strategies focusing on performance and reliability, utilizing tools like **Excel** for data analysis and metrics tracking.\nCollaborated closely with cross-functional teams to integrate VoIP systems with existing software solutions, maintaining a seamless user experience.\nDocumented system architectures and processes to maintain transparency and reference, ensuring compliance with internal standards and protocols."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leverage **AWS Lambda** and **Amazon Connect** to create scalable voice solutions that integrate with existing VoIP systems, ensuring high availability and reliability.\nUtilize **Python** scripts combined with **Visio** and **Miro** for designing and documenting VoIP architectures, facilitating better stakeholder understanding and project planning.\nImplement and maintain **SIP**, **PBX**, and **SBC** configurations to enhance communication pathways, improving voice clarity and reducing latency by up to **30%**.\nConduct root cause analysis using **WireShark** and other monitoring tools to diagnose and resolve audio quality issues, ensuring service uptime above **99.9%**.\nLead agile project management initiatives using **Jira Software** and **Confluence**, driving cross-functional collaboration and timely delivery of VoIP solutions.\nFacilitate training sessions on VoIP technologies, cultivating team skills and achieving a **25%** increase in onboarding efficiency.\nGenerate comprehensive reports using **Excel**, analyzing system performance metrics to inform strategic improvements and future investments in VoIP technology."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** in the development and optimization of VoIP backend services, ensuring high availability and scalability across PBX and SBC modules to support real-time communication activities.\nEngineered VoIP solutions incorporating **SIP** and **WebRTC** technologies, ensuring low latency and high-quality voice and video transmission for global telecommunication clients.\nImplemented AWS-powered VoIP applications using **Amazon Connect** and **AWS Lambda**, enhancing workflow efficiency and optimizing operational costs by up to **30%**.\nAnalyzed network traffic and call quality using **Wireshark**, resolving issues related to packet loss and jitter, thus maintaining optimal service levels for over **1,000** concurrent users.\nDeveloped dynamic diagrams and workflows for VoIP systems with **Visio** and **Miro**, streamlining project planning and integration processes across teams and leading to a **25%** increase in project delivery speed.\nCollaborated in an Agile environment using tools like **Jira Software** and **Confluence**, facilitating sprint planning and documentation for efficient project tracking and communication.\nConducted comprehensive performance testing and optimization of VoIP systems, resulting in a **15%** reduction in call setup time and improved overall user experience.\nChampioned role-based access control (RBAC) frameworks and security protocols to safeguard VoIP applications, ensuring GDPR compliance and protecting sensitive user data across the platform.\nLeveraged advanced data analysis skills using **Excel** to evaluate VoIP performance metrics, driving continuous improvements and enhancement strategies for system efficiency."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tAWS Lambda\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS\n\tAzure\n\n**Other:**\n\tVoIP\n\tSIP\n\tPBX\n\tSBC\n\tWebRTC\n\tAmazon Connect\n\tWireShark\n\tVisio\n\tMiro\n\tJira Software\n\tConfluence\n\tExcel\n\tAgile\n",
  "apply_company": "Northius"
}