{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented Senior Software Engineer with 9+ years of experience in developing robust applications using **Ruby**, **Ruby on Rails**, **TypeScript**, and **React**. Proficient in **Postgres** and **Redis**, and skilled in leveraging cloud infrastructure with **AWS** and containerization through **Docker**. Strong background in building APIs and ensuring cybersecurity measures throughout the development lifecycle. Exceptional collaborator with a keen focus on code review and problem-solving, capable of leading teams to efficiently deliver high-quality software solutions while optimizing performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **Ruby on Rails** and **Postgres** for backend development, improving system efficiency by 30%.\nDeveloped scalable web applications using **React** and **TypeScript**, achieving a user base growth of 15% month over month.\nImplemented robust API services to ensure secure data transactions and system integration, enhancing data security and adherence to **Cybersecurity** best practices.\nUtilized **Redis** for optimized caching, improving page load times by 40% and reducing database queries significantly.\nDesigned and executed **Docker** containers for application deployment, streamlining development and testing processes, leading to a **50%** reduction in environment setup time.\nContributed to the design and implementation of CI/CD pipelines with **AWS CDK**, achieving faster and more reliable deployments.\nEngaged in **Code Reviews** to maintain code quality and implemented best practices across the team, which improved overall code maintainability by 25%.\nCollaborated with cross-functional teams to troubleshoot and resolve complex issues, employing strong **Problem Solving** skills, which enhanced overall project delivery timelines.\nDrove team collaboration efforts, increasing productivity by 20%, and fostering a culture of knowledge-sharing and mutual support."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed highly efficient and scalable web applications utilizing **Ruby** on **Rails** and **TypeScript**, leading to a 20% reduction in feature development time.\n• Streamlined API integrations with **Postgres** and **Redis** for data storage, enhancing data retrieval performance by 25%.\n• Designed and implemented microservices architecture using **Docker** for containerization, resulting in improved deployment processes.\n• Collaborated with cross-functional teams to enhance collaboration, significantly increasing project delivery speed by 30%.\n• Led code reviews and provided mentorship to junior developers, fostering a culture of continuous improvement.\n• Utilized **AWS** services for deploying cloud applications, maintaining a 99.9% uptime within **AWS CDK** environments.\n• Implemented **cybersecurity** best practices in all development stages to protect sensitive data.\n• Improved user interaction by integrating front-end components with **React** frameworks, achieving a 25% increase in user engagement.\n• Facilitated problem-solving sessions to address technical challenges, reducing bug resolution times by 40%."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and maintained robust applications utilizing **Ruby on Rails** and **React**, ensuring high-quality code and performance optimization.\n• Designed and implemented RESTful **API** services, facilitating seamless interactions between front-end and back-end systems.\n• Leveraged **Postgres** for efficient data management and retrieval, achieving a **30%** improvement in query performance over legacy systems.\n• Implemented **Redis** for caching solutions, resulting in a **25%** reduction in database load during peak times.\n• Utilized **AWS** for cloud services and managed deployment pipelines with **Docker**, improving deployment consistency and scalability.\n• Collaborated with cross-functional teams in an agile environment, actively participating in code reviews and daily standups to maintain project alignment.\n• Employed **Cybersecurity** best practices in application design to mitigate vulnerabilities and enhance system security.\n• Developed technical documentation and user guides, fostering improved collaboration and knowledge transfer among team members.\n• Proactively engaged in problem-solving sessions, applying analytical skills to address issues and enhance application functionality.\n• Coordinated the integration of third-party APIs, enabling improved system capabilities and client satisfaction."
    }
  ],
  "skills": " **Programming Languages**\n\t Ruby, TypeScript, JavaScript, C#, Python\n\n **Backend Frameworks**\n\t Ruby on Rails, NodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t React, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL, API\n\n **Serverless and Cloud Functions**\n\t AWS, AWS CDK\n\n **Databases**\n\t Postgres, MSSQL Server, MySQL, MongoDB, DynamoDB, CosmosDB, Redis\n\n **DevOps**\n\t CI/CD pipelines, Docker\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t UX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Cybersecurity, Collaboration, Code Review, Problem Solving",
  "apply_company": "Tines"
}