{
  "name": "Andrzej Ito",
  "role_name": "Senior Sales Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Sales Engineer with over 9 years of experience, I excel in leveraging my expertise in **CRM** tools and developing sales strategies to drive B2B success. I possess a strong foundation in communication, analytics, and research skills, enabling me to optimize email campaigns and implement effective outbound and cold calling tactics. My collaborative nature and adaptability have helped me lead cross-functional teams, while my grit ensures that I consistently overcome challenges. I am committed to enhancing user experiences and delivering high-impact projects that prioritize innovation and performance.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Leverage strong **communication** skills to effectively engage with clients and internal teams, ensuring alignment on B2B sales strategies.  \n• Conduct in-depth **research** and analytics to tailor **email campaigns** and **cold calling** efforts, achieving a **25% increase** in outreach effectiveness.  \n• Collaborate with diverse teams, showcasing exceptional **teamwork** and **adaptability** in a fast-paced environment, helping to exceed quarterly sales targets by **15%**.  \n• Develop and execute effective **sales strategies** that incorporate **outbound** tactics, increasing lead conversion rates by **20%** within **6 months**.  \n• Utilize **CRM** tools for tracking leads and managing customer relationships, enhancing customer retention rates.  \n• Demonstrate **grit** in overcoming challenges and objections during the sales process, leading to successful negotiations and closures."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Utilized analytical skills to conduct thorough research and identify potential B2B leads, enhancing the outbound sales strategy by **25%**.\n• Collaborated with cross-functional teams to develop CRM solutions that improved communication efficiency and customer engagement by **30%**.\n• Designed and executed email campaigns that achieved an open rate of **40%**, utilizing social selling techniques to boost outreach effectiveness.\n• Engaged in cold calling initiatives that generated **50+** qualified leads per month, demonstrating grit and adaptability in achieving sales targets.\n• Analyzed sales performance metrics and provided strategic insights to refine the sales process, leading to a **15%** increase in conversion rates.\n• Fostered teamwork through regular training sessions on effective sales strategies and tools, resulting in improved collaboration and performance across the sales team.\n• Leveraged modern analytics to assess campaign effectiveness and customer engagement, refining tactics for ongoing success."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Conducted in-depth **research** and **analytics** to identify and qualify potential B2B leads through effective **outbound** strategies.\n• Developed and managed successful **email campaigns** to engage prospects and retain clients, enhancing customer relationships using various **CRM** tools.\n• Executed **cold calling** strategies to drive client acquisition, resulting in a **20%** increase in pipeline opportunities over **6 months**.\n• Collaborated with cross-functional teams to create comprehensive **sales strategies**, leveraging exceptional **communication** skills for seamless execution.\n• Demonstrated strong **teamwork** and **adaptability** by effectively coordinating with marketing and sales teams to optimize the lead generation process.\n• Utilized **social selling** techniques on platforms like LinkedIn to foster genuine relationships and nurture leads through personalized interactions, leading to a **30%** higher response rate.\n• Exhibited **grit** and dedication by consistently following up on leads and adjusting tactics based on feedback and analytics for continuous improvement."
    }
  ],
  "skills": " **Programming Languages** \n\t Java, C++, C#, Python, Kotlin, SQL, PLSQL \n\n **Backend Frameworks** \n\t Spring, Spring Boot, Hibernate, Struts, JPA, Node.js \n\n **Frontend Frameworks** \n\t React, Vue, Angular \n\n **API Technologies** \n\t SOAP, REST APIs \n\n **Databases** \n\t MS SQL Server, Oracle, MongoDB, PostgreSQL, Redis \n\n **Other** \n\t SOLID, DRY, LINQ, Microservices, B2B, outbound, CRM, email campaigns, social selling, cold calling, communication, research, sales strategy, analytics, teamwork, adaptability, grit",
  "apply_company": "Netcore"
}