{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Automation Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Automation Engineer with 13+ years of experience primarily focused on Quality Assurance and Automation in high-performance applications within the healthcare and financial sectors. Expert in **Java**, **JavaScript**, **C#**, **Golang**, and test automation tools such as **Selenium** and **JUnit**. Adept in implementing UI and API testing strategies, ensuring alignment with Agile methodologies and Test-Driven Development practices.\nHighly skilled in developing seamless user interfaces with **HTML**, **CSS**, and manipulating the DOM, while leveraging **Git** for version control.\nDemonstrated ability in deploying cloud-native systems on **AWS** and **Azure**, implementing CI/CD pipelines, and utilizing modern frameworks like **React**, **Next.js**, and **Vue** for frontend solutions. Strong background in MLOps and building AI/ML-powered platforms that enhance predictive analytics and automation, leveraging tools such as **FastAPI**, **Django**, **MLflow**, and **Airflow**. Committed to compliance-driven development practices, aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Automation Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented automated testing frameworks using **Selenium** and **JUnit** to enhance **Quality Assurance** processes across multiple platforms, ensuring comprehensive coverage of UI and API functionalities.\nDeveloped and maintained CI/CD workflows leveraging **Git** to support **Agile** methodologies, facilitating seamless integration and deployment of applications while adhering to **Automation** best practices.\nExecuted and optimized **Test-Driven Development** processes to ensure code quality in applications developed in **Java**, **Golang**, and **C#**, conducting thorough unit tests and integration tests to meet project standards.\nCollaborated with cross-functional teams to develop responsive user interfaces utilizing **JavaScript**, **HTML**, and **CSS**, ensuring compliance with modern web standards and enhancing overall user experience.\nManaged database interactions and API endpoints while ensuring robust testing strategies and automating regression tests for RESTful services to improve the stability of new features.\nImplemented advanced testing strategies to automate testing procedures, covering various aspects including UI, API, and performance metrics through integrated solutions like **Postman**.\nUtilized **Git** for version control and collaboration, ensuring code integrity and maintaining development best practices within the team during the lifecycle of projects.\nDemonstrated strong problem-solving skills by identifying and resolving issues in application performance and functionality through systematic debugging and testing methodologies.\nConducted code reviews and mentoring sessions for junior engineers, fostering a culture of quality and high-performance standards in line with **Quality Assurance** objectives."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and implemented automated UI testing frameworks using **Selenium** and **JUnit**, enhancing test coverage and reliability for web applications and ensuring quality user experiences.\nDeveloped and integrated APIs for seamless communication between front-end and back-end systems utilizing **Node.js** and **Java** to streamline functionality within automation processes.\nUtilized **Git** for version control and collaboration, managing code repositories and facilitating agile workflows within a team of **9+** engineers to boost productivity and code quality.\nApplied best practices in **Agile** methodologies and **Test-Driven Development (TDD)** to improve consistency and reduce defects in application releases.\nConducted quality assurance activities by performing manual and automated testing, ensuring adherence to functional and non-functional requirements and achieving a defect reduction of **30%**.\nCollaborated closely with cross-functional teams to define test cases and acceptance criteria, playing a key role in delivering compliant automation solutions and improving project outcomes.\nManaged end-to-end testing cycles, optimizing testing processes with automation tools, and completing projects within **3 weeks** while achieving **100%** test coverage in critical areas.\nProactively identified and resolved defects, implementing extensive logging and monitoring solutions to enhance overall system stability and performance during testing phases."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized **UI** components for automated testing, ensuring high efficiency and reliability of user interfaces across various applications using **JavaScript**, **HTML**, and **CSS**.\nCollaborated in Agile teams to automate test cases for **APIs**, driving improvements in code quality and accelerating project timelines through continuous integration practices.\nImplemented automated testing frameworks utilizing **Selenium** and **JUnit**, resulting in a **30%** reduction in manual testing time and enhancing overall testing coverage.\nUtilized **Git** for version control and collaboration, facilitating a streamlined workflow among team members and enabling efficient tracking of code changes across the development cycle.\nCrafted test scripts in **Golang** and **C#**, achieving consistent test results and expediting the identification of application bugs in both web and mobile applications.\nExecuted test-driven development (TDD) methodologies, leading to early detection of defects and ensuring that **100%** of critical features are covered by automated tests.\nReviewed and refined existing automated tests and processes to boost efficiency, reliability, and maintainability, contributing to a **15%** decrease in overall test execution time.\nMaintained a focus on quality assurance principles, promoting effective practices and standards that align with the goals of the organization to ensure high-quality deliverables.\nParticipated in bi-weekly sprints to assess progress and adapt testing strategies as necessary, fostering continuous improvement within the automation processes."
    }
  ],
  "skills": "**Programming Languages:**\n\tGolang, Java, C#, JavaScript, Python, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS, DOM, UI\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tAPI, OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Agile, Test-Driven Development, Quality Assurance, Automation, Selenium, JUnit, Git",
  "apply_company": "Consensus"
}