{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Website Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Website Engineer with 8 years of experience, I excel in **JavaScript** and have a strong foundation in front-end development paired with technical leadership. My journey encompasses expertise in collaborative design and effective communication, ensuring alignment with project goals and team dynamics. I have hands-on experience with **CMS** platforms, and I am adept in integrating **AI** technologies to enhance user engagement and website performance. I am skilled in implementing tools like **Marketo**, **Wistia**, and **Chili Piper** to optimize the digital landscape and drive targeted outcomes. My original strengths include a proven track record in building high-performance solutions, leveraging modern **JavaScript/TypeScript**, and utilizing frameworks such as **React** and **Next.js**. Additionally, I bring deep knowledge of cloud services including **AWS** and **Azure**, ensuring robust deployments with CI/CD practices.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Website Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Led the design and development of dynamic front-end features utilizing **JavaScript** and modern frameworks such as React, ensuring seamless user experiences across web applications.\n- Collaborated with cross-functional teams to enhance website performance, implementing **SEO** best practices to improve organic search visibility and ensure alignment with digital marketing strategies.\n- Acted as a technical leader in the integration of **AI**-driven tools and features such as personalized content recommendations and intelligent search functionalities, enhancing user engagement.\n- Managed and optimized content management systems (**CMS**) for efficient content delivery and workflow, resulting in a **30%** reduction in content update times.\n- Coordinated with stakeholders and team members to articulate project requirements, fostering effective **communication** and ensuring alignment with project goals.\n- Established and mentored team members in advanced **Front-end Development** methodologies, promoting knowledge sharing and enhancing team performance.\n- Developed and implemented test strategies using industry-standard tools for continuous integration and delivery, ensuring code quality and robustness across all web applications.\n- Designed and executed website design enhancements aligned with the latest trends, emphasizing user experience and interface improvements.\n- Collaborated with marketing teams to integrate third-party tools such as **Wistia** for video content and **Marketo** for automated marketing campaigns, improving lead generation by **25%**.\n- Drove initiatives to streamline workflows in relation to **Chili Piper** for scheduling meetings, enhancing client interaction efficiency and satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Demonstrated **Technical Leadership** by guiding the development team in building dynamic, user-focused front-end applications using **JavaScript** frameworks including **React (18)**, **Vue 3**, and **Next.js**, while applying **TypeScript**, **Redux Toolkit**, and **Tailwind CSS** for responsive design in financial dashboards and admin portals.\n- Spearheaded collaboration efforts across departments to gather requirements and deliver solutions that enhance **SEO** practices within web applications, ensuring high visibility in search engine results.\n- Created engaging content management systems (CMS) that streamline user interactions and improve overall user experience, contributing to higher client satisfaction.\n- Leveraged AI technologies to implement **AI/ML**-powered fraud detection systems using **scikit-learn** and **XGBoost**, effectively analyzing transaction patterns and enhancing security measures for over **1,000** financial transactions per minute.\n- Fostered a culture of cross-team **Collaboration** and **Communication** to improve deployment quality and speed, leading to a **30%** reduction in development time for new features in web applications.\n- Led the modernization of existing financial platforms through a **microservices-based architecture** using **Node.js** (both **NestJS** and **Express**) and **Python** (**FastAPI**, **Django**), resulting in a **25%** increase in system throughput for high-volume transactions.\n- Developed and integrated real-time transaction monitoring dashboards utilizing **D3.js** and **Power BI Embedded**, which enable operations teams to track financial activity and drive insights for decision-making based on **50%** faster data processing.\n- Established event-driven architectures using **Kafka**, **RabbitMQ**, and **Azure Service Bus** to facilitate robust asynchronous communications for environments handling over **10,000** transactions daily.\n- Orchestrated **ETL pipelines** utilizing **Python**, **Apache Airflow**, and **Azure Data Factory** for efficient data ingestion and processing from both internal and third-party financial data streams, enabling timely analytics.\n- Engineered ML pipelines for critical business functions including credit scoring and churn prediction using **MLflow** and **Airflow**, enhancing real-time decision-making with integrated model inference directly into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Focused on **Front-end Development** with expertise in **JavaScript** frameworks to create responsive e-commerce UIs using Next.js, Vue 3 + Nuxt, and HTML5/CSS3, optimized for mobile-first engagement and accessibility compliance (WCAG **2.1**).\nDemonstrated **Technical Leadership** by designing and executing robust backend services by leveraging powerful technologies like **Python** (FastAPI, Django) and **Node.js** (NestJS, Express), serving millions of transactions globally.\nEnhanced user engagement through effective **SEO** strategies, ensuring rapid loading times and improved search engine rankings leading to a **15% increase** in organic traffic.\nUtilized AI technologies for feature implementation by integrating AI/ML-based recommendation engines using **scikit-learn**, **LightGBM**, and **TensorFlow**, which boosted conversion rates through personalized user experiences.\nFacilitated collaboration across teams by integrating modern tools like **Marketo**, **Wistia**, and **Chili Piper** for streamlined digital marketing campaigns, showcasing strong **Communication** skills.\nSpearheaded real-time application features using **WebSockets**, with an emphasis on **event-driven architecture** powered by **Kafka** and **RabbitMQ**, improving order processing speeds by **30%**.\nImplemented security measures, including role-based access control (RBAC) and **OAuth 2.0**, ensuring GDPR compliance and secure handling of customer data transactions across platforms.\nLed the integration of secure payment systems with **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI compliance while processing over **1 million** transactions securely each month.\nDesigned and optimized CMS solutions tailored for dynamic content updates, aligning with strategies that improved user retention and engagement.\nMaintained performance by employing **Redis** caching for product metadata and active shopping cart sessions, resulting in a **40% decrease** in database read pressure."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tAI, SEO, CMS, Marketo, Wistia, Chili Piper, Front-end Development, Technical Leadership, Design, Collaboration, Communication",
  "apply_company": "360Learning"
}