{
  "name": "Patryk Zaslawski",
  "role_name": "Sr. Incident Response Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a proficient Sr. Incident Response Engineer with 8+ years of experience, I excel in incident response, security solutions, and cloud infrastructure management, leveraging my extensive knowledge of **AWS**, **Azure**, and diagnostic tools. I possess robust skills in managing Windows Server environments, Exchange, SQL Server, SharePoint, and Active Directory, allowing for effective GPO and LAPS implementations. My background includes deploying comprehensive backup solutions and disaster recovery strategies, ensuring system resilience and business continuity. With hands-on experience in VMware, Microsoft Hyper-V, and dynamic VPN setups (including **IPsec tunnels**), I am well-versed in networking concepts and endpoint protection. My prior role as a Senior Python Full Stack Developer equipped me with a unique combination of software engineering skills, allowing me to design high-performance applications using **Python** (FastAPI, Django, Flask), frontend frameworks (**Angular**, **Vue**, **React**, **Next.js**), and data management tools (**PostgreSQL**, **MySQL**, **MongoDB**), integrating secure, efficient solutions aligned with industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Sr. Incident Response Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Executed incident response strategies, employing **Windows Server** and **Active Directory** to identify and mitigate security incidents effectively.\nAdministered **SQL Server** instances, ensuring data integrity and availability during incident response protocol execution.\nManaged communication and data sharing through **SharePoint**, enhancing collaborative incident response efforts across teams.\nImplemented Group Policy Objects (GPO) to enforce security configurations and requirements during incidents.\nConfigured **Backup solutions** and established robust disaster recovery protocols to safeguard critical infrastructure and data integrity for incident management.\nUtilized **MDT** for rapid deployment of recovery systems in response to incidents involving Windows Servers.\nConducted security assessments using **Diagnostic tools** to proactively identify vulnerabilities in incident response processes.\nExecuted incidents involving **VMware** and **Microsoft Hyper V** environments, ensuring performance and security during recovery measures.\nLeveraged **VPN** technologies to secure remote access for incident response teams, enabling efficient management of remote incidents.\nDeveloped and enforced security solutions across incidents, including **MFA** and **endpoint protection** measures to safeguard user access during investigations.\nProvided troubleshooting support for **Citrix** platforms as part of incident resolutions, ensuring remote desktop services remained operational during downtime.\nIntegrated **Cisco** networking concepts into incident response strategies, establishing secure communication channels and traffic monitoring during security breaches.\nImplemented **Dynamic VPN** and **IPsec tunnels** to secure sensitive data during incident investigations and responses.\nEnhanced cloud infrastructure security by utilizing **Azure** and **AWS** services to ensure compliance with security best practices during incident recovery.\nAdditionally, mentored junior staff on incident response best practices while sharing knowledge on **security solutions** and networking concepts."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Windows Server** and **Active Directory** to manage user accounts and permissions for secure access to systems, ensuring incident response protocols are followed.\nDeveloped and implemented **SCCM** for efficient software deployment and patch management, enhancing incident response capabilities across the organization.\nPerformed comprehensive monitoring and diagnostics using **Diagnostic tools**, ensuring timely detection and resolution of incidents within a **VMware** virtual environment.\nConfigured **Backup solutions** and disaster recovery strategies, including **Azure** and **AWS**, to safeguard critical systems and ensure minimal downtime during incidents.\nExecuted incident response tactics involving **VPN** and **remote desktop** technologies for secure access to affected systems during investigations.\nLeveraged **SharePoint** for knowledge management, documenting incident response procedures and outcomes for enhanced organizational learning and readiness.\nImplemented **MFA** and endpoint protection measures to bolster security and reduce incident response timelines across endpoints.\nEngaged with **Cisco** networking tools to monitor and manage network traffic, enabling proactive identification of anomalies related to security events.\nManaged **IPsec tunnels** to secure communications between remote systems and corporate infrastructure, ensuring integrity and confidentiality during incident responses.\nConducted post-incident reviews using statistical data to analyze trends and refine incident management processes, reducing recurrence by **20%**.\nMaintained **GPO** policies across Windows environments to enforce security standards and prevent unauthorized access during incident handling.\nUtilized **NetApp** storage solutions for efficient data management and retrieval during incident investigations, improving response efficacy by **30%**.\nDeveloped training programs on **Dynamic VPN** configurations and effective response techniques for IT teams, enhancing overall incident response readiness.\nWorked with **Microsoft Hyper V** for virtualization management, ensuring quick recovery options during disaster-related incidents.\nConfigured **Citrix** environments for secure remote user access, streamlining incident response workflows for off-site personnel."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Managed incident response processes utilizing **Windows Server** and **Active Directory** to ensure rapid and effective resolution of security incidents impacting business operations.\nOversaw the implementation and configuration of **SQL Server** for tracking incident data and trends, enhancing database integrity and performance analytics.\nConducted detailed security assessments and audits on systems using **GPO** and endpoint protection solutions, identifying vulnerabilities and recommending remediation strategies.\nDeveloped and executed disaster recovery plans for critical infrastructure leveraging **Veeam** and **Azure** solutions to minimize downtime during incidents, achieving a **99.9%** uptime target.\nConfigured and managed **SCCM** for centralized endpoint management and Patching, ensuring compliance with organizational security policies while reducing operational costs by **20%**.\nUtilized **VPN** technology and **Remote Desktop** services to secure remote connections for incident response teams, improving incident investigation speed and working efficiency.\nImplemented security solutions including **MFA** and diagnostic tools to enhance system integrity and protect against unauthorized access, reducing incident response time by up to **30%**.\nConducted training for IT staff on **Cisco** networking concepts and **Disaster Recovery** procedures to ensure effective response strategies during incidents.\nAssisted in the deployment and management of cloud infrastructure components within **Azure** and **AWS**, maintaining flexibility and scalability in incident response capabilities.\nWorked with virtualization technologies like **VMware** and **Microsoft Hyper-V** to optimize resource allocation and improve incident resolution times through efficient use of environments.\nMonitored and maintained **Citrix** environments to ensure accessibility for remote users during incidents, facilitating uninterrupted access to resources.\nDesigned and implemented **dynamic VPN** services and **IPsec tunnels** for secure, encrypted communications, enhancing overall incident security posture.\nRegularly analyzed and reported on incident response metrics and performance, facilitating continual improvement and alignment with industry best practices."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL Server\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Cloud infrastructure\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Incident Response, Windows Server, Exchange, SharePoint, Active Directory, GPO, LAPS, SCCM, MDT, VMware, Microsoft Hyper V, Backup solutions, Disaster recovery, VPN, Remote Desktop, Citrix, Diagnostic tools, Networking concepts, Security solutions, MFA, Endpoint protection, Cisco, NetApp, Dynamic VPN, IPsec tunnels"
}