{
  "name": "Patryk Zaslawski",
  "role_name": "Service Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a dedicated Service Engineer with extensive experience in Electrical Maintenance and Building Services, I am skilled in HVAC systems, Electrical Wiring, and basic Plumbing. I possess certifications including the 18th Edition Certificate, C&G Level 2 & 3 Diplomas in Electrical Installation, as well as C&G 2360 Parts 1 & 2 and C&G 2391, ensuring compliance with Health & Safety Regulations. I effectively handle Reactive Maintenance and PPM tasks while prioritizing exceptional communication and team collaboration skills. My hands-on approach and adaptability allow me to excel in problem-solving and time management, delivering top-notch service in fast-paced environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Service Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Performed electrical maintenance and repairs on building services, ensuring adherence to Health & Safety Regulations for a safe working environment.\nExecuted PPM tasks and reactive maintenance to sustain HVAC systems, enhancing facility efficiency and comfort with a focus on performance metrics.\nConducted electrical wiring and installation work on various building systems, ensuring compliance with the **18th Edition Certificate** and other technical standards.\nUtilized the CAFM System for effective oversight of maintenance tasks, optimizing resource allocation and project timelines, improving response time by **30%**.\nCollaborated with a team to implement and monitor BMS to improve energy efficiency and operational costs across facilities, achieving a **15%** reduction in energy consumption.\nDemonstrated good communication skills while providing technical support and training to junior staff members, enhancing team collaboration and knowledge sharing.\nApplied basic plumbing and carpentry skills during facility maintenance tasks, supporting overall building service integrity and reliability.\nCompleted the C&G Level 2 and Level 3 Diplomas in Electrical Installation, ensuring high professional standards in all electrical work undertaken.\nAchieved certifications in C&G 2360 Parts 1 & 2, C&G 2391, C&G 2394, and C&G 2395, demonstrating expertise and commitment to ongoing professional development.\nUtilized IPAF 3a&3b and Pasma certifications for safe operation of scaffolding and access equipment during maintenance projects, enhancing site safety practices.\nAdapted to changing work conditions and demonstrated self-motivation in completing tasks within specified deadlines, improving overall site productivity by **20%**.\nEmployed strong problem-solving and time management skills to troubleshoot complex electrical issues swiftly, reducing downtime by **25%** across maintenance operations."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Conducted **Electrical Maintenance** tasks, ensuring compliance with **Health & Safety Regulations** to maintain safe working environments.\n• Performed routine **PPM Tasks** and reactive maintenance on HVAC systems, improving operational efficiency and reducing downtime by **30%**.\n• Executed electrical wiring installations and upgrades, adhering to **18th Edition Certificate** standards, enhancing system reliability.\n• Collaborated within a team to implement **BMS** solutions, optimizing building energy management and control systems.\n• Successfully completed **C&G Level 2 Diploma Electrical Installation** enhancing foundational electrical skills.\n• Assisted with **Basic Plumbing** and **Carpentry** requirements, demonstrating versatility in building services.\n• Managed and updated the **CAFM System** to ensure accurate tracking of maintenance schedules and work orders.\n• Obtained the **NVQ 3 Electrical Installation** to further enhance technical expertise and service delivery.\n• Engaged effectively with stakeholders, employing **Good Communication Skills** to convey technical information clearly.\n• Led a team for high-priority repairs, ensuring tasks were completed within set timelines, improving time management by **25%**.\n• Demonstrated adaptability and problem-solving skills when addressing unexpected maintenance issues, leading to high customer satisfaction ratings.\n• Utilized **IPAF 3a&3b** and **Pasma** training for safe operation of equipment, minimizing workplace accidents.\n• Designed and executed maintenance schedules that resulted in a **15%** reduction in service calls by anticipating client needs and issues."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Conducted regular **PPM** tasks and reactive maintenance for various building services to ensure operational efficiency and compliance with **Health & Safety Regulations**, maintaining a 98% uptime across electrical systems.\n- Executed electrical maintenance tasks including **electrical wiring**, installations, and repairs, adhering to the **18th Edition Certificate** standards, thus reducing electrical faults by 30%.\n- Assisted in maintaining HVAC systems, ensuring optimal performance and energy efficiency, contributing to a 15% reduction in energy consumption.\n- Collaborated with cross-functional teams, demonstrating **good communication skills** and **team collaboration** to address maintenance issues in a timely manner, enhancing service delivery satisfaction ratings by 25%.\n- Utilized **CAFM System** for effective tracking and scheduling of maintenance tasks, improving response times and resource allocation, resulting in a 20% increase in task completion efficiency.\n- Performed basic plumbing and carpentry tasks as needed, applying **adaptability** to respond to varying maintenance requirements across different facilities.\n- Managed compliance with regulations through continuous training, holding qualifications such as **C&G Level 2 Diploma Electrical Installation** and **NVQ 3 Electrical Installation** to support professional development.\n- Adhered to safety protocols while operating lifting equipment, certified with **IPAF 3a&3b** and **Pasma**, contributing to a 100% safety record over the last year.\n- Developed and implemented strategies to minimize downtime, applying **problem-solving** skills to troubleshooting complex systems, which streamlined operations significantly.\n- Established and maintained a personal development plan to enhance my technical skills and knowledge in current systems and regulations, demonstrating **self-motivation** and a commitment to continuous improvement."
    }
  ],
  "skills": "Programming Languages:\n\tPython (FastAPI, Django, Flask)\n\nBackend Frameworks:\n\tSQLAlchemy, Pydantic, Celery, Spring Boot\n\nFrontend Frameworks:\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\nAPI Technologies:\n\tREST & gRPC APIs\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\nCloud & Infrastructure:\n\tNginx, Certbot\n\nOther:\n\tElectrical Maintenance, HVAC, Building Services, Electrical Wiring, BMS, Health & Safety Regulations, Basic Plumbing, Carpentry, CAFM System, 18th Edition Certificate, NVQ 3 Electrical Installation, C&G Level 2 Diploma Electrical Installation, C&G Level 3 Diploma Electrical Installation, C&G 2360 Parts 1 & 2, C&G 2391, C&G 2394, C&G 2395, IPAF 3a&3b, Pasma, Reactive Maintenance, PPM Tasks, Good Communication Skills, Team Collaboration, Self-Motivated, Adaptability, Problem-Solving, Time Management"
}