{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior AI Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior AI Engineer with 13+ years of experience in developing scalable applications across healthcare and financial services. Expert in **Python** and adept at leveraging **docker** for containerization, with a strong understanding of **cloud infrastructure** including **AWS**, **Azure**, and **GCP**. Proficient in utilizing **AI third-party services** and implementing **LLM frameworks** to build robust AI-driven solutions.\nSkilled in **CI/CD** pipelines and **IaC**, ensuring smooth deployment and management of infrastructure, while employing **scalability patterns** for optimal performance. Experienced with **Streamlit** and **Gradio** for creating interactive applications.\nDemonstrated ability in **prompt engineering**, effective **problem-solving**, and critical thinking. Strong communicator, capable of translating complex technical concepts into a clear, actionable strategy for diverse stakeholders.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and optimized AI-driven applications utilizing **Python** and integrating advanced **LLM frameworks** to enhance functionality and user experience across various projects.\n• Employed **Docker** for containerization, ensuring smooth deployment of applications in cloud environments, maintaining scalability and flexibility.\n• Utilized cloud services, including **AWS** and **Azure**, to host and manage AI models and applications, optimizing for performance and cost efficiency under high load conditions.\n• Designed CI/CD pipelines for automated deployment using **Git** and **IaC** strategies, facilitating seamless integration and delivery of new solutions.\n• Applied **CI/CD** best practices in pipeline implementation, achieving a deployment frequency improvement of **50%** and reducing downtime to **99.9%**.\n• Engaged in architecture design for **LLM Applications**, focusing on creating scalable models that deliver robust performance while addressing real-time data needs.\n• Employed **Streamlit** and **Gradio** for building interactive applications that allow for effective model demonstrations and user feedback collection.\n• Demonstrated problem-solving and critical thinking skills to troubleshoot and optimize existing AI workflows and machine learning operations, applying best practices in **Prompt Engineering**.\n• Communicated effectively with cross-functional teams to identify needs, aligning technical solutions with business goals and ensuring stakeholder satisfaction.\n• Achieved improvements in model inference speed by **40%** through optimization techniques and innovations in AI deployment strategies.\n• Collaborated with AI teams to integrate third-party AI services, enhancing application capabilities and providing unique solutions tailored to user requirements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Docker** to develop scalable and resilient microservices for AI applications, applying **cloud infrastructure** solutions such as **AWS**, **Azure**, and **GCP** for deployment and orchestration.\nEngineered interactive data applications using **Streamlit** and **Gradio** to visualize AI model outputs, enhancing user engagement and accessibility with real-time dashboards tailored for diverse stakeholders.\nOrchestrated CI/CD pipelines to automate the deployment of machine learning models and applications, ensuring continuous integration and delivery with version control through **Git**.\nImplemented best practices in **Infrastructure as Code (IaC)** to streamline environment setup and promote reproducibility of AI workloads, contributing to operational efficiency and reducing deployment times by **30%**.\nApplied advanced **prompt engineering** and **LLM frameworks** to optimize model responses tailored to specific business needs, achieving a **15%** increase in accuracy for user queries.\nConceived and developed scalable patterns to support high-availability AI applications, mitigating downtime and ensuring optimal performance during peak usage periods.\nUtilized **Azure** services for building and deploying machine learning models, leading to a **25%** reduction in latency for real-time predictions in high-stakes environments.\nCultivated strong communication and teamwork skills to collaborate with cross-functional teams, facilitating problem-solving sessions to address challenges in AI model integration and deployment across platforms."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and various **LLM frameworks** to design and optimize backend architectures for scalable AI-driven applications, ensuring high performance and reliability in production environments.\nEmployed **Docker** for containerization of AI services, facilitating seamless deployment across **AWS**, **Azure**, and **GCP** cloud infrastructures while maintaining environment consistency.\nImplemented **CI/CD** pipelines for automated testing and deployment of AI applications, enhancing efficiency and reducing deployment times by over **50%**.\nLeveraged **AI third-party services** such as **Streamlit** and **Gradio** for rapid prototyping and deployment of machine learning models, improving speed to market for new features by **30%**.\nArchitected solutions using **Infrastructure as Code (IaC)** to automate infrastructure provisioning, achieving better resource management and reducing overhead costs by **20%**.\nChampioned **scalability patterns** to ensure applications can handle increased loads, leading to improved service availability and user satisfaction metrics trending upwards by **40%**.\nDesigned and developed robust prompt engineering strategies to refine AI interactions, optimizing query responses based on user behavior analytics and improving model efficiency by **25%**.\nApplied advanced problem-solving and critical thinking to address complex technical challenges and deliver innovative solutions within tight deadlines, enhancing team productivity and project outcomes.\nFostered open communication and collaboration across cross-functional teams to align project goals, resulting in a cohesive work environment and elevated project success rates.\nConducted code reviews and provided mentorship to junior engineers, improving team capability and ensuring adherence to best practices in AI development and deployment."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, \n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, \n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Streamlit, Gradio, \n\n**API Technologies:**\n\tAI third-party services, \n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database, GCP, \n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, \n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, IaC, Terraform, Ansible, Helm, Docker Compose, \n\n**Cloud & Infrastructure:**\n\tCloud infrastructure, \n\n**Other:**\n\tLLM frameworks, scalability patterns, Architecture for LLM Applications, Prompt Engineering, problem-solving, critical thinking, communication",
  "apply_company": "dLocal"
}