{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Machine Learning Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Machine Learning Engineer with 10+ years of experience in developing and deploying advanced machine learning solutions across multiple platforms. Strong expertise in **Python**, **PyTorch**, **TensorFlow**, **ML infrastructure**, and **Deployment**, with proven ability to lead ML projects from conception to deployment using frameworks such as **Dask** and **PySpark**. Proficient in utilizing **AWS**, **GCP**, and **Azure** cloud services for scalable solutions, alongside containerization technologies including **Docker** and **Kubernetes** for efficient application management. Familiar with real-time monitoring and debugging strategies to optimize ML workflows effectively.\nSkilled in machine learning practices, including model optimization, monitoring, and collaboration within cross-functional teams to ensure the successful delivery of AI-driven applications. History of building impactful systems within the healthcare and finance sectors, adhering to compliance standards such as HIPAA and PCI DSS. Excels in leveraging modern technologies such as **Apache Beam** and **LangChain** for sophisticated data processing and analytics, while fostering trust and collaboration across project teams.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Machine Learning Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Leveraged **Python** and machine learning frameworks like **PyTorch** and **TensorFlow** to design, implement, and deploy machine learning models for advanced use cases, including patient risk prediction and financial fraud detection.\n• Developed and optimized MLOps pipelines using **MLflow** and **Apache Airflow**, ensuring continuous training, validation, versioning, and deployment of models across development and production environments, enhancing model accuracy by over **15%**.\n• Collaborated with cross-functional teams using **Docker** and **Kubernetes** to build scalable, microservices-based architectures, improving application response time by **30%**.\n• Designed and maintained cloud infrastructure on **AWS** and **Azure**, implementing real-time inference services and optimizing cloud resources for cost efficiency by up to **20%**.\n• Integrated AI-based features in applications, enhancing user engagement and experience for healthcare and financial products, leveraging tools like **Azure ML** and **AWS Sagemaker**.\n• Conducted thorough debugging and optimization practices in line with best practices and deployed enterprise-level solutions ensuring high availability and fault tolerance.\n• Established collaborative workflows and governance for deploying machine learning models across multiple platforms, introducing best practices that foster trust and transparency in AI outcomes.\n• Employed **Apache Beam** and **Spark** for data processing at scale, handling millions of records efficiently and ensuring seamless integration with existing data streams.\n• Monitored and enhanced model performance post-deployment by analyzing feedback from monitoring tools, implementing regular updates to improve predictive accuracy.\n• Executed integration of **GenAI** features using **Transformers**, contributing to intelligent applications that adapt to user needs and enhance overall functionality."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **AWS**, **GCP**, and **Azure** to deploy and monitor machine learning models and ensure robust ML infrastructure, enhancing model performance by **25%** through optimized deployment strategies.\nDeveloped and implemented machine learning algorithms for fraud detection and predictive analytics, leveraging **Python** and frameworks such as **scikit-learn**, **XGBoost**, and **TensorFlow** to improve accuracy by **30%** over previous models.\nCreated and maintained ML pipelines for various applications including credit scoring and churn prediction, ensuring seamless integration with backend services using **Apache Airflow** and **MLflow** to support real-time decision-making and enhance efficiency by **40%**.\nCollaborated effectively with cross-functional teams to design scalable solutions using **Docker** and **Kubernetes**, streamlining deployment processes and reducing downtime by **15%**.\nEngaged in monitoring and debugging ML systems, employing techniques to optimize performance and ensure reliability across different environments, thus improving system uptime to **99.9%**.\nConducted research on emerging technologies such as **PyTorch**, **Transformers**, and **LangChain** to innovate and refine existing ML models, ensuring they remain competitive and trustworthy by addressing current financial industry challenges.\nImplemented advanced data processing techniques with **Apache Spark**, **Dask**, and **PySpark** to handle large datasets efficiently, enhancing processing time by **50%** and enabling real-time data access for analytics.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **AWS**, **GCP**, and **Azure** to design and optimize scalable machine learning infrastructure, ensuring high availability and efficiency across various deployment environments.\nEngineered real-time machine learning solutions utilizing **Spark**, **Dask**, and **PySpark** to enable predictive analytics and dynamic insights in business workflows, leading to a **30%** improvement in processing times.\nDeveloped and integrated **TensorFlow**, **PyTorch**, and **Transformers** libraries for end-to-end model training, tuning, and deployment pipelines, resulting in a **25%** increase in model accuracy and performance.\nApplied advanced machine learning techniques and algorithms using **GenAI** capabilities to personalize user experiences and enhance product recommendations, significantly driving engagement and conversion rates.\nImplemented effective monitoring and debugging strategies in deployed models utilizing **Kubernetes** and **Docker** containers, achieving a **15%** reduction in downtime and issues post-deployment.\nCollaborated closely with cross-functional teams to streamline development processes and foster a culture of trust and teamwork, enabling efficient project execution and knowledge sharing.\nUtilized **Apache Beam** for data processing workflows, ensuring smooth integrations across Google Cloud and optimizing ETL jobs, which improved data handling efficiency by **20%**.\nWorked on deploying optimized machine learning models and solutions, ensuring compliance with industry standards and regulations such as GDPR and PCI, maintaining high security and user data protection levels.\nImplemented role-based access control (RBAC) and **OAuth 2.0** security measures across applications, facilitating secure and controlled user access to sensitive data while promoting collaboration and trust in the platform."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), GCP\n\n **Other:**\n\tMachine Learning, GenAI, MLflow, Airflow, Kubeflow, Spark, Dask, PySpark, Apache Beam, PyTorch, TensorFlow, Transformers, LangChain, LangGraph, Vertex AI, ML infrastructure, Deployment, Monitoring, Debugging, Optimization, Collaboration, Trust"
}