{
  "name": "Tomasz Lee",
  "role_name": "Senior Frontend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with 9+ years of expertise in building scalable frontend architectures using **React**, **TypeScript**, **HTML**, **CSS**, and **API** integrations. Proven track record in performance optimization and testing methodologies, ensuring efficient and high-quality code output. Experienced in implementing state management solutions and leveraging AI-assisted coding tools such as **Claude Code**. Versatile in adapting to various tech stacks while maintaining a strong focus on user experience and collaboration across teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed scalable frontend architecture utilizing **React** and **TypeScript**, enhancing performance and maintainability of web applications.\n• Created dynamic user interfaces with **HTML** and **CSS**, leading to a 25% increase in user satisfaction.\n• Implemented state management solutions to efficiently handle app data flow successfully.\n• Conducted testing to ensure robust performance, achieving a 40% reduction in deployment time through optimized CI/CD pipelines on **Azure DevOps**.\n• Spearheaded the design and implementation of RESTful APIs to streamline data access improvements.\n• Leveraged performance optimization techniques to enhance application responsiveness, achieving a 35% increase in load times with integrated **Redis**.\n• Collaborated with UX/UI designers to refine UI, resulting in elevated user experience metrics and increasing engagement.\n• Developed interactive data visualizations using **D3.js** and **Three.js**, enhancing report functionality with real-time data access.\n• Employed AI-assisted coding platforms, like **Claude Code**, for efficient and innovative development practices.\n• Integrated robust authentication mechanisms, ensuring secure application access and compliance."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Designed and developed responsive frontend applications utilizing **React** and **TypeScript**, which improved user engagement by **25%**.\n• Implemented a scalable frontend architecture incorporating **HTML** and **CSS**, ensuring optimal performance and user experience.\n• Developed and integrated RESTful APIs for efficient data communication, enhancing real-time access to project information.\n• Leveraged state management strategies to streamline application state and reduce complexity, resulting in a **15%** increase in collaboration efficiency.\n• Executed rigorous testing protocols to ensure code quality and reduce production errors by **30%** through effective CI/CD pipelines with **GitHub Actions**.\n• Participated in performance optimization initiatives, utilizing caching mechanisms to achieve a **25%** improvement in system speed.\n• Collaborated with cross-functional teams to define requirements and timelines, ensuring timely delivery of features and enhancements.\n• Mentored junior developers by conducting code reviews and providing AI-assisted coding guidance with tools like **Claude Code**.\n• Created interactive data visualizations with **D3.js** to enhance reporting and project status tracking capabilities, aiding in stakeholder decision-making.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Designed and implemented scalable frontend architectures using **React**, **TypeScript**, **HTML**, and **CSS**, enhancing user experience by 30%.\n• Improved API integration and state management for seamless data flow and performance optimization, achieving a **15% increase** in application efficiency.\n• Developed reusable components and libraries for frontend applications, reducing development time by **25%** across multiple projects.\n• Conducted extensive testing and performance analysis of frontend applications, ensuring compliance with coding standards and reducing load times by **40%**.\n• Collaborated with cross-functional teams to integrate AI-assisted coding tools, streamlining code development and improving overall productivity.\n• Delivered comprehensive technical documentation and user guides for the internal systems, facilitating knowledge sharing and onboarding by **50%** faster.\n• Participated actively in daily standups and code reviews, promoting best practices in UI/UX design and enhancing team cohesion.\n• Worked alongside backend developers to ensure seamless integration with third-party APIs and external services, ensuring data accuracy and reliability."
    }
  ],
  "skills": "Programming Languages:\n\tPython, TypeScript\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL, API\n\n**Serverless and Cloud Functions:**\n\t\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tAWS, Azure, CI/CD pipelines\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tUX/UI Design, Git, GitHub, Redux, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Performance Optimization, Scalable Frontend Architecture, AI-assisted coding, Claude Code, State Management",
  "apply_company": "team.blue"
}