{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior PHP Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior PHP Backend Engineer with over 13 years of experience in delivering high-performance applications, predominantly in the healthcare and financial sectors. Proficient in **PHP**, **Symfony**, **Laravel**, and OOP, with a strong command of **RESTful APIs**, **MySQL**, **NoSQL databases** like **MongoDB** and **DynamoDB**, and cloud services such as **AWS**. Skilled in designing and implementing microservice architectures, event-driven systems, and service-oriented architectures, while utilizing **Docker** for containerization and **CI/CD pipelines** for efficient deployment. Demonstrated ability in applying **SOLID principles** and software engineering best practices to enhance code quality.\nAccomplished in developing AI/ML-powered platforms that leverage predictive analytics and automation. Adept in deploying cloud-native solutions with infrastructure-as-code methodologies. Strong collaboration and problem-solving skills, enabling seamless team interactions and adaptability to emerging technologies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **PHP** frameworks such as **Symfony** and **Laravel** to design and build backend systems adhering to **OOP** and **SOLID principles** within a **microservice architecture**.\nImplemented **RESTful APIs** ensuring seamless integration with **MySQL** and **NoSQL databases** like **MongoDB** and **DynamoDB** to manage data efficiently across multiple domains.\nDeveloped CI/CD pipelines using **Git** and **Docker**, enhancing deployment processes and code quality with automated testing and security checks, resulting in a **30% reduction** in deployment time.\nLeveraged **Docker** and **AWS** for scalable microservices, enabling fault-tolerant deployments with minimal downtime, achieving **99.9% uptime** across the platforms.\nDesigned and deployed event-driven systems utilizing messaging frameworks to enhance real-time data processing and system communication.\nCollaborated with cross-functional teams to refine **software engineering practices** and drive effective team collaboration, resulting in a **15% increase** in overall productivity.\nApplied **infrastructure-as-code** principles to automate provisioning and manage cloud resources, reducing manual configurations and deployment time by **40%**.\nAdapted solutions to quickly changing requirements, demonstrating strong **problem-solving** skills and the ability to deliver high-quality software products amidst tight deadlines.\nMaintained comprehensive documentation and code reviews to ensure adherence to industry standards and best practices, fostering a culture of continuous improvement within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and maintained **RESTful APIs** using **PHP** with **Symfony** and **Laravel**, ensuring adherence to **OOP** and **SOLID principles** for scalable code architecture.\n- Implemented CI/CD pipelines using **Git**, **Docker**, and **AWS**, promoting efficient deployment workflows and minimizing downtime during updates.\n- Engineered robust **event-driven systems** by utilizing **messaging** technologies like **Kafka** and **RabbitMQ** to facilitate asynchronous communication in microservice architecture.\n- Designed database schemas and managed data integrity using **MySQL** and **NoSQL databases** such as **MongoDB** and **DynamoDB**, optimizing query performance for high-load scenarios.\n- Streamlined deployment processes through **infrastructure-as-code** practices, ensuring reliable and repeatable server provisioning across environments.\n- Collaborated closely with cross-functional teams to ensure software quality through adherence to industry-standard **software engineering practices** and thorough problem-solving techniques.\n- Exercised strong **team collaboration** and **adaptability** skills to meet evolving project requirements and foster an innovative development environment."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed robust backend services with **PHP** frameworks such as **Symfony** and **Laravel**, leveraging **OOP** and **SOLID principles** to create scalable, maintainable code for critical e-commerce functionalities.\n- Engineered and maintained **RESTful APIs** ensuring seamless integration between frontend and backend, enhancing system interoperability and making services more reliable across multiple platforms.\n- Implemented **MySQL** for structured data management and **NoSQL databases** like **MongoDB** and **DynamoDB** for flexible data storage solutions, achieving a **99.9% uptime** on data accessibility.\n- Utilized **Docker** for containerization and **CI/CD pipelines** to streamline deployment processes, reducing deployment times by **50%** and ensuring consistent testing environments.\n- Designed event-driven systems and messaging queues to enable a responsive architecture, improving data processing speeds and allowing real-time updates for users.\n- Collaborated with cross-functional teams to enhance software engineering practices, ensuring adherence to quality standards and project deadlines through structured teamwork and adaptability.\n- Applied **infrastructure-as-code** principles with tools like **AWS** to facilitate seamless scaling and management of resources, resulting in cost-effective cloud operations.\n- Developed microservice architecture as part of a service-oriented strategy, enabling independent deployment and maintenance of services, which enhanced system resilience.\n- Addressed troubleshooting and problem-solving challenges, implementing effective solutions that decreased downtime incidents by **30%** and improved user satisfaction.\n- Enhanced application performance and security through the implementation of best practices in role-based access control (RBAC) and careful handling of sensitive data, achieving compliance with GDPR standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tSymfony, Laravel, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS Lambda, serverless technologies\n\n **Databases:**\n\tMySQL, PostgreSQL, MongoDB, DynamoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, CI/CD pipelines\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, SQL Database), infrastructure-as-code, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tOOP, SOLID principles, software engineering practices, event-driven systems, messaging, service-oriented architecture, microservice architecture, problem-solving, team collaboration, adaptability"
}