{
  "name": "Patryk Zaslawski",
  "role_name": "Mid-Level Full Stack Engineer (Backend-Focused)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a dedicated Mid-Level Full Stack Engineer with expertise in **C#**, **.NET**, and advanced skills in **JavaScript** and **TypeScript**, I bring 8+ years of software engineering experience, specializing in backend-focused development. Proficient in database management with **MySQL**, **PostgreSQL**, and **DynamoDB**, I ensure robust data solutions that scale. My technical proficiency includes building dynamic frontends using **React** and implementing cloud services on **AWS**, **GCP**, and **Azure** to enhance application performance and reliability. Familiar with modern development methodologies, I employ **Gherkin** and **SpecFlow** for behavior-driven development, and utilize **Terraform** for infrastructure as code. My background in Agile practices and commitment to delivering high-quality software solutions demonstrates my ability to meet business needs effectively.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Mid-Level Full Stack Engineer (Backend-Focused)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed robust backend solutions in **C#** and **.NET** that ensured high performance and reliability within the context of a **Mid-Level Full Stack Engineer (Backend-Focused)** role.\nCreated and managed database operations with **MySQL**, **PostgreSQL**, and **DynamoDB**, optimizing queries and enhancing data integrity for applications handling over **1M** transactions monthly.\nEnhanced user interfaces using **React** and **JavaScript**, improving UX through optimized state management with **TypeScript**.\nContributed to AWS and **Azure** cloud infrastructure setups, utilizing **Terraform** to automate provisioning and maintain high availability across multiple environments.\nImplemented Agile methodologies within a team of **10+** engineers, fostering collaboration and swift adaptation to changing project requirements.\nLed the development of RESTful APIs in **C#** with efficient data handling practices, ensuring robust security measures in accordance with industry standards.\nUtilized **PostgreSQL** optimization techniques including indexing and partitioning that enhanced query performance by up to **30%**.\nIntegrated **SpecFlow** for Behavior-Driven Development (BDD) and automated acceptance testing, improving application reliability and stakeholder satisfaction.\nMaintained CI/CD processes for backend services in cloud environments, ensuring seamless deployment cycles and integration of **Gherkin** specifications to facilitate team understanding of business requirements.\nMentored junior engineers in backend development practices including **C#**, agile workflows, and database management strategies to cultivate team growth and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained backend systems using **Python (FastAPI, Django, Flask)**, ensuring seamless data management with **PostgreSQL** and **MySQL** while enhancing scalability and performance by 30%.\n• Integrated user-friendly frontends using **JavaScript**, **TypeScript**, and **React**, optimizing responsiveness and user experience through efficient state management with Redux.\n• Collaborated in an Agile environment, successfully leading a team through **7 projects** with a focus on delivering high-quality software on time.\n• Built and optimized RESTful APIs, ensuring secure transaction processing by implementing encryption and authentication strategies like OAuth 2.0 and JWT, complying with industry standards.\n• Created an event-driven architecture leveraging **AWS** and **Azure** technologies, enhancing the transaction throughput capacity by **25%** using **Kafka** and **RabbitMQ**.\n• Managed deployments on **Azure** and utilized **Terraform** for infrastructure as code, resulting in a **40%** reduction in provisioning time.\n• Implemented CI/CD practices using **GitHub Actions** and **Azure DevOps**, improving development cycles and deployment frequency by **50%**.\n• Conducted unit testing with **PyTest** and integration testing using **SpecFlow**, resulting in a **20%** increase in code coverage.\n• Designed reliable data pipelines utilizing **DynamoDB** and **PostgreSQL**, achieving **99.9%** availability for critical applications.\n• Leveraged **Kubernetes** for orchestrating **Python** microservices with built-in scaling features, enhancing system resilience.\n• Documented and standardized processes in the development lifecycle, contributing to knowledge sharing and effective team collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and optimized backend services using **C#** and **.NET** for a robust e-commerce platform, significantly improving scalability and performance across key modules, including checkout, cart, and order fulfillment.\nDesigned and implemented efficient RESTful APIs to manage high-volume transactions, ensuring seamless integration between frontend applications and backend systems for improved real-time customer interactions.\nLeveraged **PostgreSQL**, **MySQL**, and **DynamoDB** for effective database management, optimizing query performance by 30% and reducing latency during peak transaction periods.\nUtilized **JavaScript**, **TypeScript**, and frameworks like **React** for building responsive, dynamic frontends that offer a seamless user experience, with a focus on performance and accessibility.\nIntegrated CI/CD practices using **GitHub Actions** and **Terraform** to automate deployments and ensure consistent feature delivery while reducing manual testing efforts by 40%.\nContainerized applications using **Docker**, enabling efficient deployment and scalability across different environments with zero downtime.\nConducted thorough unit and integration testing utilizing **Gherkin** and **SpecFlow**, achieving a code coverage of 85% and enhancing software reliability before releases.\nImplemented observability in systems using cloud services like **AWS**, **GCP**, and **Azure**, employing tools to track application performance and identify bottlenecks efficiently.\nMigrated legacy systems into hybrid architectures, enhancing functionality while preserving core business processes, achieving a migration success rate of 95% without service interruptions.\nOptimized database interactions by implementing advanced caching strategies using **Redis**, which resulted in 50% faster response times for frequently accessed data.\nBuilt secure payment processing systems incorporating popular services like **Stripe** and **PayPal**, ensuring compliance with PCI standards and maintaining transaction integrity.\nCollaborated in an **Agile** environment, participating in sprint planning and reviews, driving initiatives that improved team productivity by 20% in delivering customer-focused solutions."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, JavaScript, Python, TypeScript\n\n**Backend Frameworks:**\n\t.NET, FastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, DynamoDB\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Gherkin, SpecFlow, Agile"
}