{
  "name": "Tomasz Lee",
  "role_name": "Senior Frontend Developer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Proficient Senior Frontend Developer with 9+ years of experience in delivering high-quality web applications using **React**, **TypeScript**, and **Vite**. Expertise in client-side architecture, design patterns, and browser optimization, ensuring seamless user experiences. Well-versed in state management with **Redux** and **MobX**, as well as UI libraries like **Material UI**, **Chakra UI**, and **NextUI**. Strong communication skills and a proactive approach to problem-solving differentiate me in collaborative environments. Alongside my frontend capabilities, I possess foundational knowledge in backend technologies, contributing to comprehensive and robust solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Developer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed responsive user interfaces utilizing **React**, **TypeScript**, and **Vite**, enhancing front-end performance and accessibility across devices by 30%.\n• Implemented state management solutions with **Redux** and **MobX**, streamlining data flow and improving application efficiency.\n• Optimized PWA features to enhance user engagement, resulting in a **20%** increase in mobile user retention.\n• Designed mobile-first components using **Material UI**, **Chakra UI**, and **Bootstrap**, dramatically improving the user experience and interface consistency.\n• Leveraged client-side architecture and design patterns to create maintainable codebases and facilitate easier transitions between development teams.\n• Conducted thorough browser optimization techniques which improved page load speed by **40%**, meeting modern performance standards.\n• Engaged in proactive problem-solving discussions with cross-functional teams to address user feedback promptly and effectively.\n• Maintained strong communication skills while collaborating with UX/UI designers to create intuitive interfaces based on user-centered design principles.\n• Actively contributed to code reviews and knowledge sharing sessions, fostering a culture of continuous improvement within the development team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and developed user interfaces using **React** and **TypeScript**, enhancing user experience and increasing usability by **30%**.\nImplemented **Redux** and **MobX** for state management, improving application performance and responsiveness.\nCreated Progressive Web Applications (PWAs) to ensure a seamless experience across devices, achieving a user retention rate of **85%**.\nDeveloped reusable components with **Material UI**, **Chakra UI**, and **NextUI**, leading to a **20%** reduction in development time for new features.\nOptimized client-side architecture and design patterns to improve load times and performance metrics by **15%**.\nCollaborated with back-end developers to integrate APIs, ensuring clear communication and streamlined workflows, resulting in a **10%** increase in development team efficiency.\nConducted browser optimization techniques that improved application speed, enhancing overall user satisfaction.\nMentored junior developers in modern JavaScript frameworks, fostering a collaborative team environment and improving overall productivity by encouraging proactive problem solving.\nLed team meetings to discuss technical challenges and project updates, ensuring effective communication among team members."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed responsive user interfaces using **React** and **TypeScript**, leading to a 30% enhancement in user engagement metrics.\nImplemented **Redux** and **MobX** for state management, ensuring efficient data flow and improved application performance.\nDesigned Progressive Web Applications (**PWA**) that increased mobile user retention by **15%**, adapting effectively to various devices and screen sizes.\nUtilized **Vite** for faster builds and optimized development processes by reducing time to deployment by **40%**.\nEngaged in client-side architecture designs that emphasized scalable components using **Material UI** and **Chakra UI**, resulting in a consistent user experience across the platform.\nConducted thorough code reviews and utilized design patterns that strengthened the codebase quality and adherence to best practices, maintaining a **90%** code coverage rate in testing.\nExecuted browser optimization techniques that improved load times by **25%**, enhancing overall app performance.\nCollaborated closely with cross-functional teams, demonstrating strong communication skills and proactive problem-solving to meet project deadlines and client requirements.\n"
    }
  ],
  "skills": "**Frontend Frameworks**\n\tReact, TypeScript, Vite, PWA, Redux, MobX, Material UI, Chakra UI, NextUI, Bootstrap, HTML, CSS, JavaScript, NextJS, VueJS, NuxtJS, Angular, TailwindCSS, Three.js, D3.js, React Native, Flutter\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Database Systems**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tGit, GitHub\n\n**Other**\n\tUX/UI Design, Python, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, design patterns, client-side architecture, browser optimization, communication skills, proactive problem solving, Blockchain: Solidity, Ether.js, Web3.js, Ethereum"
}