{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Software Engineer with 10+ years of experience delivering high-performance software solutions, proficient in **Java**, **Spring**, and **REST** APIs. Demonstrated expertise in **MySQL**, **PostgreSQL**, and deploying applications in **AWS** environments. Skilled in using **Docker** for containerization and implementing CI/CD practices to streamline development processes. Strong background in agile methodologies, particularly **Scrum**, and building **SaaS** applications.\n\nIn addition, adept at modern technologies including JavaScript/TypeScript, Python, and Flutter, with hands-on expertise across the full stack using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven experience in leading the development of enterprise platforms incorporating AI/ML capabilities for real-time analytics and automation while ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Passionate about building secure and maintainable solutions that drive significant real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable microservices using **Java**, **Spring**, and **REST** for healthcare and financial applications, enhancing system resilience and responsiveness.\n• Developed and optimized databases using **MySQL** and **PostgreSQL**, managing data storage and retrieval for applications with over **10 million** records, ensuring high performance and reliability.\n• Built and deployed CI/CD pipelines utilizing **Docker** and cloud services like **AWS** to automate workflows, reducing deployment times by **30%** and improving overall code quality through continuous integration practices.\n• Collaborated in an Agile environment following **Scrum** methodology, facilitating planning sessions and ensuring timely delivery of software features through effective team dynamics and communication.\n• Leveraged the **Elastic Stack** to enhance logging and monitoring capabilities, enabling better troubleshooting and performance analysis across diverse applications.\n• Delivered solutions with a focus on SaaS architecture principles, significantly improving deployment speeds and scalability to meet the growing demands of the market.\n• Implemented rigorous testing strategies, covering unit and integration tests, resulting in a **40%** reduction of bugs post-deployment through continuous testing solutions.\n• Played a key role in the transition to a microservices architecture, optimizing existing monolithic structures into efficient, maintainable services to foster a culture of rapid innovation and development."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring** frameworks to enhance existing financial applications, ensuring RESTful APIs are efficient and maintainable, thereby increasing system reliability by **30%**.\nDeveloped and optimized high-performance database solutions using **MySQL** and **PostgreSQL**, achieving a **25%** improvement in query response times to support real-time financial transactions.\nDesigned scalable, cloud-based applications and services using **AWS** and **Docker**, allowing for a flexible infrastructure that supports a **50%** increase in user demand.\nImplemented end-to-end **CI/CD** pipelines to automate deployment processes, resulting in a **40%** reduction in time to production deployment.\nCollaborated in an Agile **Scrum** environment to manage project timelines and deliverables, fostering continuous feedback loops for iterative improvement.\nDeveloped and integrated financial SaaS solutions that streamline user experiences and reduce operational costs by **20%** through automation.\nContributed to the Elastic Stack enhancement for operational logging and monitoring, improving incident response times through actionable insights and reporting.\nConducted code reviews and mentored junior developers, enhancing team productivity and skillsets across the application stack with a **15%** increase in developer efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized scalable backend services for web applications utilizing **Java** and **Spring**, ensuring high availability and performance across various modules, including user management, data processing, and transaction handling.\nDesigned and implemented RESTful APIs to facilitate seamless communication between frontend and backend systems, adhering to industry standards and best practices.\nLeveraged **MySQL** and **PostgreSQL** databases for efficient data storage and retrieval, achieving a **50%** improvement in query performance through indexing and optimized schema design.\nCreated microservices architectures using **Docker** for containerization, enhancing deployment consistency and enabling rapid scaling in cloud environments such as **AWS**.\nImplemented CI/CD pipelines utilizing tools like Jenkins and GitLab CI, streamlining the deployment processes for new features and updates with minimal downtime.\nParticipated in Agile methodology, using **Scrum** frameworks to ensure timely delivery of high-quality software, engaging in sprint planning and daily stand-ups.\nUtilized the **Elastic Stack** for logging and monitoring, improving system observability and response time to incidents by **30%**.\nManaged system configurations and dependencies through **Docker**, ensuring that application environments are replicable and reducing onboarding time by **40%**.\nCollaborated on the development of SaaS solutions, enhancing user experience and accessibility across multi-tenant applications while maintaining data isolation and security.\nUtilized effective backlog management in a team environment to prioritize features and foster continuous improvement across development processes."
    }
  ],
  "skills": "Programming Languages:\n\tJava, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tSpring, Flask, Django, FastAPI\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tMySQL, PostgreSQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tScrum, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Elastic Stack, SaaS",
  "apply_company": "Brightflag"
}