{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Sales Engineer with 8 years of experience in driving B2B sales and fostering strategic customer relationships within the healthcare and financial sectors. Proficient in leveraging CRM systems and sales productivity tools to enhance customer engagement and streamline sales processes. My expertise includes developing strategic account plans and delivering impactful communication to clients, ensuring their needs are met effectively. \n\nI use analytical skills to identify opportunities for condition monitoring and plant asset management, contributing to increased sales productivity. With a strong foundation in technical integration, I combine my sales strategies with a robust understanding of **JavaScript**, **TypeScript**, **Python**, and **Flutter** to craft personalized solutions that resonate with clients. I excel in team collaboration, thereby enhancing project outcomes through effective communication. My problem-solving abilities have enabled me to lead initiatives that bridge technology and sales, ensuring client satisfaction and loyalty.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed strategic account plans to enhance **Customer Relationships**, leveraging tools such as **MS Office** for effective presentations and reporting.\n- Utilized **CRM** systems to manage and nurture client relationships, leading to a **30%** increase in customer engagement and conversion rates.\n- Demonstrated expertise in **B2B** sales methodologies, fostering strong partnerships with key stakeholders to drive revenue growth and expand market presence.\n- Implemented innovative **Sales Productivity Tools** to streamline workflows and improve sales team efficiency, resulting in a **20%** reduction in response time to customer inquiries.\n- Collaborated with cross-functional teams to devise solutions for **Condition Monitoring** and **Plant Asset Management**, ensuring technical alignment with client objectives and industry standards.\n- Conducted in-depth presentations for potential clients, effectively communicating technical concepts and solutions, which contributed to a **15%** uplift in new client acquisition.\n- Engaged in extensive travel to meet clients, gather requirements, and conduct product demos, reinforcing customer trust through effective **Communication** and support.\n- Championed regular reviews of installed systems to evaluate effectiveness and facilitate enhancements based on client feedback, driving continuous improvement in service delivery."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Cultivated strong **Customer Relationships** and **Communication** skills by effectively engaging with clients to understand B2B needs, resulting in improved customer satisfaction and **30%** increase in retention rates.\nDeveloped and executed **Strategic Account Plans** tailored to clients in the financial sector, leveraging **Sales Productivity Tools** to track progress and optimize sales strategies, achieving **25%** growth in annual sales.\nUtilized **MS Office** suite for data analysis and presentation, creating impactful reports for stakeholders that enhanced transparency and informed decision-making processes.\nImplemented and monitored **Condition Monitoring** systems to assess client operational health, improving identification of upsell opportunities within **Plant Asset Management** sectors.\nParticipated in technical discussions with clients to demonstrate product value, significantly improving engagement and helping to close deals with a **40%** success rate.\nProvided ongoing support and training to clients, ensuring they maximize product utilization and satisfaction, which contributed to a **15%** increase in upsell opportunities during quarterly reviews.\nLeveraged extensive industry knowledge to prepare and deliver persuasive technical presentations, facilitating inquiry and fostering trust with clients during business travels."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained relationships with B2B clients, ensuring optimal plant asset management through effective communication and customer support strategies.\nCreated strategic account plans to enhance sales productivity tools implementation, driving significant improvements in overall sales outcomes by **30%** year-over-year.\nUtilized CRM systems for tracking sales performance and customer interactions, contributing to a **25%** increase in customer satisfaction scores.\nExecuted condition monitoring strategies that led to a **15%** reduction in equipment downtime, optimizing client operations and fostering long-term partnerships.\nImplemented effective communication methods to provide updates and insights to clients, enhancing customer relationships and driving further engagement.\nConducted regular travel to client locations for presentations and training sessions, contributing to customer retention and satisfaction, resulting in a **40%** increase in repeat business.\nLeveraged MS Office suite to create detailed reports and presentations, improving the clarity of information shared with stakeholders and assisting in informed decision-making.\nProvided recommendations for sales productivity tools that align with client needs, leading to successful product implementations and increased adoption rates within client organizations."
    }
  ],
  "skills": "**Backend Frameworks**:\n\tPython(FastAPI, Flask, Django)\n\n**Frontend Frameworks**:\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**Databases**:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**API Technologies**:\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Artificial Intelligence & Machine Learning**:\n\tMLflow, Airflow, Kubeflow\n\n**Other**:\n\tB2B, CRM, Condition Monitoring, Plant Asset Management, Sales Productivity Tools, MS Office, Strategic Account Plans, Customer Relationships, Communication, Travel",
  "apply_company": "Emerson"
}