{
  "name": "Rei Taro",
  "role_name": "Senior Solr Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Skilled Senior Solr Engineer with 10+ years of experience in developing robust backend systems, with a focus on search technologies using **Apache Solr**, **Elasticsearch**, and **OpenSearch**. Proficient in Java and Kotlin, applying frameworks like **SpringBoot** and **Rails** to design high-performance applications. Extensive experience with cloud platforms, including **AWS**, and containerization tools like **Docker**, ensuring scalable and efficient solutions. Strong background in agile methodologies, coupled with excellent communication and problem-solving skills, demonstrated through impactful contributions to major financial platforms and AI/ML projects for renowned organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Solr Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed and optimized search solutions using **Apache Solr**, **Elasticsearch**, and **Opensearch** to enhance data retrieval and indexing performance, improving search response times by **30%**.\nEngineered backend solutions in **Java** and **Kotlin** utilizing **SpringBoot** for scalable and maintainable application architecture, resulting in a reduction of deployment times by **25%**.\nImplemented microservices with **Docker** for containerization, facilitating a streamlined CI/CD pipeline.\nCollaborated in an **Agile** environment to deliver project milestones on time, improving team productivity by **15%**.\nLed technical documentation and communication strategies across cross-functional teams to address integration challenges and enhance collaborative problem-solving.\nDeployed robust solutions on **AWS** cloud, increasing system availability and reliability while managing costs effectively.\nUtilized **MongoDB** for efficient data storage, ensuring smooth data flow for application needs and enhancing querying speed by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Implemented advanced search functionalities using **Apache Solr** and **Elasticsearch** to enhance document retrieval performance, achieving a 30% increase in search speed compared to previous systems.\nDesigned and optimized data ingestion pipelines with **MongoDB** and **Java** to efficiently handle large volumes of data from external sources, facilitating real-time data processing.\nLed the creation of scalable microservices using **SpringBoot** and **Docker**, achieving a deployment frequency of 25 times per year with zero downtime.\nCollaborated with cross-functional teams using **Agile** methodologies to ensure timely project delivery and successful integration of search solutions within existing platforms.\nEnhanced system security by implementing robust authentication mechanisms, including **OAuth2** for third-party integrations and ensuring compliance with relevant industry standards.\nResolved complex search-related issues and bottlenecks, utilizing **Kotlin** to develop optimized algorithms that reduced response time by 15%.\nConducted comprehensive testing and quality assurance, leading to a bug reduction rate of 20% during the release phase."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Demonstrated expertise in **Apache Solr**, optimizing search and indexing capabilities for data retrieval and enhancing query performance, achieving up to **90%** faster response times.\nUtilized **Elasticsearch** for full-text search features, ensuring data integrity and relevancy in search results across high-volume datasets of **over 100 TB**.\nImplemented microservices architecture using **SpringBoot** to enhance application scalability and maintainability, supporting projects with **10+** concurrent users without performance degradation.\nLeveraged **AWS** cloud services for efficient deployment and management of applications, ensuring high availability and resilience with **99.99%** uptime.\nDeveloped complex queries and search algorithms, utilizing **Kotlin** and **Java**, to improve data processing speed by **30%** compared to previous models.\nAdopted **Docker** for containerization of applications, ensuring consistent environments across staging and production systems, reducing deployment time by **50%**.\nEngaged in agile methodologies to enhance project workflows, fostering transparent communication between cross-functional teams to meet deadlines and exceed project objectives.\nExecuted strategic problem-solving techniques to diagnose and resolve issues within search functionalities, significantly reducing mean time to resolution (MTTR) by **40%**."
    }
  ],
  "skills": " **Programming Languages**\n\t Java, Kotlin, Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\t SpringBoot, FastAPI, Flask, Django, Celery, Rails, Laravel\n\n **Frontend Frameworks**\n\t \n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda)\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n **Cloud & Infrastructure**\n\t AWS, Azure\n\n **Other**\n\t Apache Solr, Elasticsearch, Opensearch, Kafka, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, agile, communication, problem-solving, PyTest, Git",
  "apply_company": "Breuninger"
}