{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Java Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Java Engineer with over 10 years of experience in designing and delivering high-performance software solutions. Expert in **Java**, **Spring Boot**, and **SQL**, with a proven track record in developing robust ETL processes and Spring Batch applications. Proficient in **Docker** for containerization and experienced in implementing message-driven architectures using **Kafka**. Demonstrated ability to work with both **SQL** and **NoSQL** databases to optimize data storage and retrieval. Fluent in Technical English, facilitating effective communication and documentation.\nAdditionally, skilled in modern front-end and back-end technologies including **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on experience in frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Strong background in building cloud-native applications on **Azure** and **AWS**, coupled with expertise in microservices architecture and CI/CD automation. Passionate about developing secure, maintainable software solutions that comply with industry standards and regulations.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped high-performance, scalable applications using **Java** and **Spring Boot**, focusing on efficient processing of large data sets with **ETL** strategies for both healthcare and financial domains.\n•\tDesigned and implemented batch processing systems using **Spring Batch** to optimize data workflows and enhance data accuracy, achieving processing speeds of up to **2x** faster than previous systems.\n•\tUtilized **Docker** for containerization, ensuring consistent development and production environments while reducing deployment times by **30%**.\n•\tManaged messaging systems with **Kafka**, facilitating real-time data streaming and reducing latency in service communication.\n•\tArchitected data storage solutions using **SQL** and **NoSQL** databases, ensuring efficient data retrieval and management for applications handling millions of transaction records.\n•\tMaintained comprehensive technical documentation in **Technical English**, fostering clear communication across cross-functional teams and simplifying knowledge transfer.\n•\tIntegrated automated testing frameworks, contributing to improved application reliability and reducing bug density by **40%** through unit and integration tests.\n•\tCollaborated with cross-functional teams to leverage cloud-native services and optimize continuous integration/continuous deployment (CI/CD) processes, enhancing team productivity.\n•\tLed code reviews and mentoring sessions for junior engineers, increasing team skill levels in modern development practices and technologies."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring Boot** to design and develop backend services, ensuring high performance and scalability in financial applications.\nBuilt and orchestrated ETL processes using **Spring Batch** for efficient data processing, enabling seamless integration of financial data from various sources.\nImplemented containerization with **Docker** to streamline deployment and improve scalability of microservices architecture.\nDeveloped asynchronous messaging solutions using **Kafka** to enhance system reliability and enable real-time event processing.\nCreated and optimized both **SQL** and **NoSQL** databases, ensuring efficient data storage and retrieval in high-transaction environments.\nExecuted dynamic, user-focused front-end components leveraging **React** (18) and **TypeScript**, leading to improved user experiences in financial dashboards.\nLed teams in the adoption of modern software frameworks and paradigms to boost maintainability and throughput of high-volume transaction systems, increasing throughput by **30%**.\nEffectively communicated technical concepts in **Technical English**, facilitating collaboration across cross-functional teams and enhancing team productivity by **15%**.\nInstrumented monitoring and logging frameworks to ensure system reliability and compliance, resulting in a **40%** reduction in incident response time."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "- Developed and optimized backend services using **Java** and **Spring Boot**, ensuring robust performance and scalability in high-traffic environments with transaction processing across **9** core modules including ETL and batch processing.\n- Designed and implemented ETL pipelines, leveraging **Spring Batch** for efficient data processing and integration, enhancing operational workflows by processing over **100,000** records per hour.\n- Collaborated in creating containerized applications using **Docker**, facilitating streamlined deployments and testing environments, contributing to a **30%** reduction in deployment time.\n- Engaged with distributed messaging systems powered by **Kafka** for real-time data streaming, ensuring enhanced data availability and reliability across interconnected services.\n- Utilized SQL and NoSQL databases to efficiently manage and query data, maintaining a performance consistency under load, achieving access times under **20ms** on average.\n- Communicated complex technical documents and specifications in **Technical English**, ensuring clear understanding across multi-disciplinary teams and stakeholders, which improved project timelines by **25%**.\n- Implemented CI/CD practices for seamless integration and deployment cycles, enhancing the team's agility and responsiveness to change in business requirements.\n- Applied robust security protocols, including tokenization and encryption measures, to ensure data protection and compliance with standards, reducing vulnerabilities by **40%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tSpring Boot, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, NoSQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tAuthentication & Security (Keycloak, OIDC, RBAC), MLflow, Airflow, Kubeflow, Kafka, ETL, Spring Batch, Technical English",
  "apply_company": "Future Connections"
}