{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Product Manager",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a results-driven Senior Product Manager with 8+ years of experience, I excel in **Product Strategy**, **Agile**, **Scrum**, and **User-Centered Design**. Leveraging my B2B knowledge and experience with **SAP**, I drive the development of **AI-driven Applications** through **Cross-Functional Collaboration**. I am adept at enhancing organizational efficiency and customer focus by fostering open communication channels and implementing strategies that prioritize user needs. Additionally, I bring a strong technical background as a Senior Python Full Stack Developer, proficient in **Python** (FastAPI, Django, Flask, SQLAlchemy), with expertise in frontend frameworks such as **Angular**, **Vue**, **React**, and **Next.js**. My experience with cloud platforms like **AWS** and **Azure**, and database optimization using **PostgreSQL**, **MySQL**, and **MongoDB**, enables me to deliver high-performance solutions tailored to business objectives. I am committed to adhering to industry best practices while focusing on delivering impactful results.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Product Manager",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and executed **product strategies** focusing on user-centered design principles to enhance the overall healthcare experience.\n- Collaborated cross-functionally with engineering, design, and marketing teams to ensure alignment with business goals and customer needs, utilizing **Agile** and **Scrum** methodologies.\n- Actively engaged in communication with stakeholders to gather feedback and prioritize features based on **B2B knowledge** and customer insights, contributing to product roadmap decisions.\n- Mentored team members in effective project organizational skills, fostering agile practices across the development lifecycle to enhance productivity.\n- Implemented **AI-driven applications** to optimize healthcare workflows, improving user engagement metrics by **30%**.\n- Ensured thorough documentation and dissemination of product requirements, leveraging strong communication skills to maintain transparency among teams.\n- Directed the development of user stories and acceptance criteria in **Agile** sprints, effectively translating user feedback into actionable development tasks.\n- Facilitated cross-functional collaboration sessions, using insights from user engagement to inform product enhancements and updates.\n- Spearheaded initiatives to improve customer focus within product development, leading to a **25%** increase in user satisfaction scores.\n- Established clear KPIs and metrics to measure product success, leading to data-driven decision-making and continuous improvement efforts."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Developed and executed **product strategy** aligning with user-centered design principles to enhance customer experience and drive B2B success in a competitive market.\nLed cross-functional collaboration across teams using **Agile** methodologies and **Scrum** practices to efficiently deliver high-quality features and improvements.\nImplemented customer feedback loops to drive **AI-driven applications**, ensuring that the product development aligns with user needs and market trends, contributing to a **25%** increase in customer satisfaction.\nCommunicated product vision and strategy effectively to stakeholders, fostering transparency and alignment on objectives, resulting in more informed decision-making.\nOrganized product roadmaps and prioritized backlogs by incorporating insights from market research and user testing, improving on-time delivery of features by **30%**.\nFacilitated design thinking workshops and brainstorming sessions with teams to cultivate user-centric solutions, leading to a **40%** reduction in user pain points, validated through user testing.\nApplied **SAP** solutions in product integration and management, streamlining processes and enhancing organizational efficiency.\nDrove the development of **real-time** analytics dashboards ensuring superior organizational communication and enabling proactive decision-making based on data insights.\nManaged end-to-end product lifecycle, from ideation to launch, for **AI-driven applications**, leveraging industry best practices to ensure quality and compliance with business objectives.\nMonitored the impact of product changes and adaptations post-launch, using **communication skills** to present findings and recommendations to various stakeholders, enhancing overall product strategy effectiveness."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Led **Product Strategy** initiatives to align backend development with the company's vision, focusing on user-centered design to enhance customer engagement and satisfaction.\n• Collaborated cross-functionally with engineering, design, and marketing teams to deliver e-commerce solutions that meet business objectives while maintaining agile methodologies (Scrum).\n• Conducted user research and analysis to inform product development strategies, ensuring alignment with **AI-driven Applications** and market needs.\n• Implemented features based on B2B knowledge, effectively integrating customer feedback into the product roadmap to improve user experience.\n• Fostered open communication within teams, promoting a collaborative environment that enhances organizational productivity and effectiveness.\n• Established agile workflows, ensuring timely delivery of product features using tools such as **Jira** for project management and tracking.\n• Championed customer-focused solutions, leveraging data insights to prioritize features that drive user satisfaction and business growth.\n• Maintained comprehensive documentation for the product lifecycle, including version control and iterative feedback loops, ensuring clarity and alignment across all product stakeholders.\n• Strengthened relationships with stakeholders, ensuring transparency in communication and support for product decisions based on user feedback and data analysis.\n• Developed KPIs to measure the success of product initiatives, ensuring continuous improvement aligned with business goals and customer needs."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython\n\n **Backend Frameworks:** \n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:** \n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:** \n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\tSQLAlchemy, Pydantic, Celery, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:** \n\tNginx, Certbot\n\n **Other:** \n\tProduct Strategy, Agile, Scrum, User-Centered Design, B2B Knowledge, SAP, AI-driven Applications, Cross-Functional Collaboration, Communication Skills, Organizational Skills, Customer Focus"
}