{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior IT Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior IT Engineer with 8 years of experience, I possess extensive expertise in **Microsoft 365**, **Azure**, **PowerShell**, **Microsoft Graph**, and **Conditional Access**. My technical abilities include managing **Intune**, **SharePoint**, **Exchange Online**, and **Teams**, ensuring robust security through tools like **Defender** and implementing **RBAC**, **OAuth**, **OIDC**, and **SAML**. I have a strong foundation in network fundamentals and a proven track record in designing and enforcing **Azure Policy** and utilizing **Microsoft Sentinel** for incident response and automation.\n\nAdditionally, I bring a background in full-stack development with experience in **React**, **Next.js**, **Node.js**, and **Django**, combined with cloud expertise in **AWS**. My experience includes developing enterprise-grade applications that incorporate AI/ML features for predictive analytics, while I ensure compliance with standards like HIPAA and PCI DSS. I have a solid understanding of CI/CD automation, microservices architecture, and event-driven systems, enhancing my ability to deliver secure and scalable IT solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior IT Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained secure, scalable IT solutions using **Microsoft 365**, **Azure**, and **PowerShell**, ensuring compliance with organizational security policies and standards.\n• Implemented and configured **Entra ID**, **Conditional Access**, and **OAuth** for robust identity and access management within an enterprise setting.\n• Automated routine IT tasks and incident response protocols using scripts and **Automation** frameworks, enhancing efficiency across departments.\n• Collaborated with cross-functional teams to manage and optimize **Microsoft Graph** for streamlined data access and integration across services like **SharePoint** and **Exchange Online**.\n• Designed and implemented data loss prevention (DLP) strategies to protect sensitive information shared through **Teams** and other collaboration tools.\n• Managed security and compliance for Azure resources, applying **Azure Policy** and integrating **Microsoft Sentinel** for enhanced threat detection and response.\n• Spearheaded collaboration initiatives using **Teams**, facilitating improved communication and productivity amongst teams amid remote working conditions.\n• Implemented **RBAC** for role-based access control across multiple cloud services, ensuring that users have appropriate access based on their role.\n• Established advanced incident response workflows to rapidly address and mitigate IT security threats utilizing **Microsoft Defender** and other security tools.\n• Provided technical guidance and training on cloud services, collaboration tools, and security practices to promote a culture of security awareness and best practices.\n• Conducted regular audits and assessments of IT policies and systems to maintain best practices in **Network Fundamentals** and ensure ongoing security compliance.\n• Optimized and maintained Azure workloads, implementing best practices for performance and cost efficiency.\n• Designed and implemented a governance framework using **Purview** for better data management and compliance adherence across the organization."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented and managed security protocols using **Microsoft Entra ID**, **OAuth**, **OIDC**, and **SAML** to safeguard applications and data, ensuring compliance and security across the organization.\nOrchestrated the deployment and governance of cloud solutions in **Azure**, integrating security measures with **Azure Policy**, **Microsoft Sentinel**, and **DLP** to enhance incident response and risk management capabilities.\nAutomated administrative tasks using **PowerShell**, maintaining operational efficiency and reducing manual intervention by **30%**.\nDeveloped and facilitated collaboration strategies using **Microsoft 365**, **Teams**, and **SharePoint** to enhance productivity across cross-functional teams, improving project delivery timelines by **20%**.\nEnsured role-based access control (RBAC) for sensitive information within applications through the use of **Conditional Access** and identity governance strategies, aligning with industry standards.\nManaged compliance reports and data governance using **Microsoft Purview**, ensuring transparency and adherence to data privacy regulations.\nMonitored and responded to security incidents in real-time using automated alerts and workflows, decreasing average incident response time by **15%**.\nProvided training and support for teams on **Teams**, **Exchange Online**, and other collaboration tools, increasing user engagement and proficiency in the workplace by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied **RBAC** and **OAuth 2.0** for secure customer and admin access, ensuring GDPR compliance and user data protection throughout the platform.\nImplemented **PowerShell** scripts for automation of routine tasks and improved operational efficiency by **30%**.\nLeveraged **Microsoft Graph** API to integrate various Microsoft 365 services, enhancing productivity and collaboration across teams, resulting in a **25%** increase in user engagement.\nDeveloped and maintained security protocols using **Conditional Access** across applications to enforce compliance and protect sensitive data, contributing to improved security scores by **40%**.\nManaged user identities and access with **Entra ID**, streamlining login processes and improving user experience for over **10,000** employees.\nConfigured and integrated security monitoring solutions with **Microsoft Sentinel** for incident response and threat detection, achieving a response time reduction to **15 minutes**.\nImplemented data loss prevention (DLP) policies using **Intune** to safeguard organizational data, leading to a completed compliance audit with **100%** effectiveness.\nUtilized **SharePoint** for document management and collaboration projects, resulting in a more efficient workflow for content storage and retrieval.\nFacilitated virtual collaboration using **Teams**, coordinating meetings and communications across geographically dispersed teams, improving project turnaround times by **20%**.\nConfigured **Azure Policy** to enforce organizational standards and assess compliance, ensuring all resources were aligned with budgetary constraints and security best practices.\n"
    }
  ],
  "skills": "**Programming Languages**:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**:\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**:\n\tReact, Vue, Angular\n\n**API Technologies**:\n\tMicrosoft Graph, OAuth, OIDC, RBAC, SAML\n\n**Serverless and Cloud Functions**:\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**:\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**:\n\tMicrosoft 365, Entra ID, Azure Policy, Automation\n\n**Other**:\n\tMLflow, Airflow, Kubeflow, Conditional Access, Intune, DLP, SharePoint, Exchange Online, Teams, Defender, Network Fundamentals, Microsoft Sentinel, Purview, Incident Response, Collaboration",
  "apply_company": "Netrix Global"
}