{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Machine Learning Specialist",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Machine Learning Specialist with 13+ years of experience, skilled in **Python** and a strong background in various **ML frameworks** for building robust AI/ML applications. Proficient in **supervised learning**, **unsupervised learning**, **deep learning**, and **reinforcement learning**, with an extensive history of delivering high-performance applications in healthcare and financial sectors. Experienced in developing cloud-based workflows on **AWS** and **Azure**, implementing **probabilistic modeling**, and using **natural language processing** techniques to drive data insights. Demonstrated ability to communicate complex technical concepts clearly, fostering collaboration across teams. Knowledgeable in deploying scalable architectures and implementing compliance-driven development aligned with standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Machine Learning Specialist",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **ML frameworks** such as **scikit-learn**, **PyTorch**, and **TensorFlow** to design and implement machine learning models for risk scoring, fraud detection, and document classification, reaching a performance improvement of **15%** over previous systems.\nApplied **natural language processing** techniques leveraging libraries like **spaCy** and **Hugging Face Transformers** for document parsing and anomaly detection, integrated through secured REST APIs to enhance data handling capabilities.\nDeveloped and optimized cloud-based workflows using **AWS Lambda** and **Azure Functions**, enabling serverless machine learning model deployment, achieving reduced latency of **30%** in model inference.\nImplemented supervised and unsupervised learning strategies to improve data analytics performance, leading to more accurate predictions in both healthcare and finance domains.\nEstablished advanced data science workflows using **MLflow**, **DVC**, and **Airflow**, ensuring efficient model training, validation, and deployment pipelines, resulting in streamlined development processes.\nBuilt and maintained comprehensive data infrastructure with **PostgreSQL**, **MongoDB**, and **GraphQL** to support large-scale data ingestion and real-time analytics, managing data volumes up to **2TB** daily.\nCollaborated with multidisciplinary teams to ensure clear communication of complex machine learning concepts and project progress, fostering collaboration across development and production environments.\nEngaged in probabilistic modeling techniques to refine model accuracy and reliability, while exploring reinforcement learning methods to enhance decision-making processes within applications.\nDeveloped and maintained user-friendly dashboards fueled by intelligent features, leveraging insights from chaotic datasets to drive decision-making in finance and healthcare sectors.\nExecuted robust testing strategies across the stack using tools like **Jest**, **Cypress**, and **PyTest** to guarantee the reliability of machine learning applications, covering unit, integration, and end-to-end tests."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Python** and various **ML frameworks** to develop and deploy machine learning models for fraud detection, achieving a **95%** accuracy rate in identifying suspicious activities based on user behavior and transaction patterns.\nUtilized supervised and unsupervised learning techniques to create ML pipelines for real-time credit scoring and churn prediction, enhancing customer retention by **20%**.\nImplemented data science methodologies to analyze and interpret large datasets, generating actionable insights and improving decision-making processes.\nConducted robust experiments incorporating deep learning and reinforcement learning strategies, resulting in improved model performance and reliability.\nDeveloped cloud-based workflows using **Azure ML** for model training and deployment, ensuring scalability and efficiency in production environments.\nCommunicated complex machine learning concepts clearly to stakeholders, fostering collaboration and understanding across cross-functional teams.\nDesigned and executed probabilistic modeling efforts to enhance prediction accuracy, integrating findings into financial systems to support critical business operations.\nFacilitated the integration of natural language processing techniques into financial tools, enhancing user interaction and analysis capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and various **ML frameworks** to develop and enhance machine learning models, focusing on supervised learning and unsupervised learning techniques that improved prediction accuracy by over **30%**.\nDesigned and implemented cloud-based workflows to leverage **ML** capabilities in scalable environments, ensuring model training and inference could handle data loads exceeding **1 million** records per day.\nApplied advanced statistical techniques including probabilistic modeling, boosting model performance on complex datasets typical in natural language processing tasks, achieving precision improvement rates of **15%**.\nExecuted deep learning solutions using **TensorFlow** and **scikit-learn** for various tasks, such as sentiment analysis and recommendation systems, streamlining operations and enhancing user engagement metrics by **25%**.\nCommunicated complex data science concepts clearly to stakeholders, ensuring clear understanding and alignment across diverse teams to support project objectives.\nParticipated in reinforcement learning projects, testing methods and algorithms that led to learning and optimization improvements within dynamic environments.\nCollaborated within cross-functional teams to integrate AI/ML solutions with existing systems, fostering a culture of innovation and efficient problem-solving in tech-driven projects.\n"
    }
  ],
  "skills": " **Programming Languages**\n\tPython\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n **API Technologies**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure**\n\tcloud-based workflows\n\n **Other**\n\tmachine learning, natural language processing, supervised learning, unsupervised learning, deep learning, reinforcement learning, probabilistic modeling, ML frameworks, data science, clear communication"
}