{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior WebTest Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "Senior WebTest Engineer with 8 years of hands-on experience in leveraging **Playwright**, **Selenium**, **TypeScript**, **Python**, and **React** to ensure high-quality software delivery. I possess a solid understanding of test automation frameworks and methodologies, and I have utilized tools like **Celery**, **RabbitMQ**, and **Django** to enhance application performance and reliability. My proficiency in **SQL Alchemy**, **PostgreSQL**, and **Redis** supports efficient data handling and management.\n\nI am well-versed in cloud services, specifically **Azure**, **Heroku**, and **GCP**, and have orchestrated containerized applications using **k8s** with infrastructure as code practices utilizing **Terraform** and **Helm**. I thrive in Agile environments and excel at problem-solving, ensuring the delivery of compliant applications aligned with industry standards.\n\nMy strong communication skills facilitate seamless collaboration with cross-functional teams, driving the development of enterprise-grade solutions. Additionally, I have led testing strategies that incorporate CI/CD automation using **GitHub Actions**, emphasizing quality and efficiency throughout the development process.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior WebTest Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Playwright** and **Selenium** to automate end-to-end testing for web applications, ensuring high-quality software releases with a **95% pass rate** on automated test cases.\nDeveloped and maintained test frameworks leveraging **TypeScript** and **Python**, collaborating with cross-functional teams to implement CI/CD pipelines using **GitHub Actions** for continuous integration and deployment.\nDesigned and executed performance tests utilizing **k8s** and optimized server resources to handle up to **10,000 concurrent users**, achieving a response time of under **200ms**.\nImplemented API testing using **OpenAPI** specifications, ensuring compliance and functionality for functional endpoints with **100% coverage** of critical API services.\nLed initiatives to integrate **Celery** and **RabbitMQ** for task scheduling and message brokering in test environments, improving resource utilization and reducing execution time by **40%**.\nConducted thorough code reviews and provided mentorship to junior engineers on best testing practices, enhancing team productivity and code quality.\nCollaborated with developers to troubleshoot issues in applications built using **Django** and **React**, fostering strong communication channels and problem-solving workflows.\nUtilized database technologies such as **PostgreSQL** and **Redis** to set up test datasets and manage state, improving testing efficiency by approximately **30%**.\nCreated comprehensive documentation of testing protocols and results using Agile methodologies, facilitating clear communication with stakeholders and project management teams.\nDeveloped regression test suites for both web and API services, ensuring that new features did not negatively impact existing functionalities.\nUtilized **Terraform** and **Helm** for infrastructure management and deployment of test environments across **Azure**, **Heroku**, and **GCP**, enhancing environment reliability and scalability.\nParticipated in daily stand-ups and sprint planning, effectively communicating testing progress and aligning with project deadlines."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Playwright** and **Selenium** for automated testing and validation of web applications built with **React** and **TypeScript**, ensuring high-quality user experiences through comprehensive test coverage.\nImplemented test-driven development and continuous integration practices using **GitHub Actions**, resulting in a **35% reduction** in deployment time and increased code reliability across **12** projects.\nCollaborated effectively in an **Agile** environment, improving team communication and productivity by facilitating daily stand-ups and retrospectives, enhancing the overall project delivery process by **20%**.\nDeveloped and maintained back-end services using **Python (Django)** and **SQL Alchemy**, integrating with **PostgreSQL** and **Redis** for data persistence and caching, enhancing performance by **40%** in data retrieval operations.\nEstablished reliable message queue systems with **RabbitMQ** and **Celery** to manage asynchronous tasks and improve application responsiveness, leading to timely processing of over **1 million** transactions per month.\nExecuted cloud infrastructure management using **Terraform**, **k8s**, and **Helm** on **Azure** and **GCP** platforms, ensuring a robust and scalable deployment model for the development environment.\nLed the integration of **OpenAPI** specifications to document and test various APIs, improving developer onboarding time by **50%** and fostering better communication between front-end and back-end teams.\nDeveloped and implemented efficient testing strategies that facilitated faster bug detection and resolution, contributing to a culture of proactive problem-solving and continuous improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** (including **Django** and **FastAPI**) to develop and maintain high-quality test cases for backend services, reinforcing thorough testing strategies while ensuring alignment with the **OpenAPI** specifications for clear documentation.\nImplemented **TypeScript** and utilized **React** to design automated tests for frontend applications, enhancing the reliability of UI components with a focus on user experience.\nLeveraged **Selenium** and **Playwright** for cross-browser testing, ensuring seamless functionality across **React** (v18) applications and maintaining compatibility with both modern and legacy systems.\nStreamlined test execution and reporting processes with **GitHub Actions**, achieving an **80%** reduction in deployment times through early bug detection methodologies.\nDeveloped distributed task management with **Celery** and message queues using **RabbitMQ**, substantially improving the execution of asynchronous testing tasks and enabling real-time feedback.\nCollaborated in an **Agile** environment to enhance communication among cross-functional teams, resulting in the identification of critical testing opportunities and adhering to project timelines effectively.\nCreated comprehensive test plans that encompassed storage systems like **PostgreSQL** and **Redis**, ensuring efficient handling of database interactions and validating performance under load conditions.\nDesigned and implemented automated functional tests, using **SQL Alchemy** for database interaction validation, ensuring respective data integrity and compliance with accepted standards.\nManaged cloud resources with **Terraform** for provisioning test infrastructures in **Azure**, **Heroku**, and **GCP**, optimizing resource allocation and test environments similar to production configurations.\nDrove continuous improvement in testing frameworks by conducting retrospectives; adopted metrics-based approach to refine testing strategies, ensuring secure and efficient delivery of applications."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks:**\n\tReact\n\n **API Technologies:**\n\tOpenAPI\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure, Heroku, GCP\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes (k8s), GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tSelenium, Playwright, RabbitMQ, Agile, Problem-solving, Communication, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MLflow, Airflow, Kubeflow, Docker Compose",
  "apply_company": "Sphera"
}