{
  "name": "Tomasz Lee",
  "role_name": "Senior Sales Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Sales Engineer with 9+ years of experience in leveraging technical expertise to drive sales and improve customer relationship management. Proficient in providing technical support and developing market strategies that enhance product offerings. Strong negotiation skills, combined with the ability to engage clients effectively and foster long-term relationships. An adept communicator with a solid understanding of mechatronics concepts, ensuring alignment between customer needs and technical solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed strong relationships with clients by providing exceptional **technical support** during product demonstrations, contributing to a **25% increase** in customer satisfaction.\nUtilized **Customer Relationship Management (CRM)** systems to manage client interactions and streamline communication, enhancing organizational efficiency.\nConducted market development strategies that resulted in a **15% growth** in sales revenue through targeted engagements and negotiations.\nLed negotiations with key accounts, achieving a **30% improvement** in contract terms and conditions favorable to the company.\nCollaborated with engineering teams to provide comprehensive product knowledge, ensuring that clients receive tailored solutions that meet their needs.\nResponded promptly to client inquiries and issues with a focus on improving customer experience and satisfaction levels, contributing to a **40% reduction** in response times.\nFacilitated training sessions on newly developed products and technology, ensuring clients understand the value and usage of **Mechatronics** solutions.\nAnalyzed market trends and competitor activity to develop effective strategies that enhance the company's market position.\nUtilized **English** proficiency to communicate effectively with diverse clients and stakeholders to ensure high levels of customer satisfaction and project success."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed technical support documentation and training materials for sales team on **Mechatronics** solutions, improving product knowledge by **40%**.\nCollaborated with customers to understand their needs and deliver tailored sales presentations, enhancing customer satisfaction ratings by **25%**.\nUtilized **Customer Relationship Management (CRM)** tools to track and analyze client interactions and sales performance, resulting in a **15%** increase in repeat business.\nNegotiated contracts and pricing with clients to close deals effectively, achieving a **10%** increase in sales revenue.\nConducted market development research to identify new opportunities and generate leads, contributing to a **30%** expansion in market share.\nProvided technical support to clients during and after the sales process, reducing customer complaints and troubleshooting time by **20%**.\nMaintained up-to-date knowledge of industry trends and competitor products, ensuring competitive advantage during negotiations.\nPresented complex technical concepts in clear, concise English to non-technical stakeholders, enhancing communication and understanding.\nEngaged in regular follow-ups with clients to ensure satisfaction and identify opportunities for up-selling or cross-selling products."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Leveraged strong negotiation skills to effectively manage customer relationships, increasing sales opportunities by 15%.\n• Utilized technical support expertise to assist clients in resolving issues related to the internal CRM system, enhancing user satisfaction by 25%.\n• Contributed to market development strategies, identifying new business opportunities through technical insights and customer feedback.\n• Advised on integrating mechatronics solutions to improve sales pitches, resulting in a sales conversion rate increase of **30%**.\n• Developed customer-focused presentations that showcased product capabilities using **PowerPoint** and **Excel**, leading to a **40%** boost in client engagement.\n• Collaborated with cross-functional teams to support product launches, ensuring timely delivery and alignment with market needs.\n• Conducted technical workshops and training sessions in English, effectively educating clients and sales teams about product features and benefits.\n• Maintained up-to-date knowledge of industry trends and competitor offerings, providing valuable insights to enhance sales strategies.\n• Provided continuous feedback on CRM functionality and market effectiveness, helping to inform product development and improvements."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tCloud Infrastructure\n\n**Other**\n\tUX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Mechatronics, Sales, Customer Relationship Management, Negotiation, Market Development, Technical Support, English",
  "apply_company": "LHH"
}