{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Mobile App Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Mobile App Developer with 8 years of experience, I specialize in building high-performance mobile applications utilizing **Google Flutter**, **Dart**, and **BLoC Architecture**. My proficiency encompasses mobile app design, state management, and implementing **Cubit** to ensure efficient and responsive user interfaces. I have a proven track record in developing engaging mobile applications while leveraging my strong communication skills in remote work settings. In addition to my mobile development expertise, I possess a solid foundation in **JavaScript/TypeScript**, **Python**, and full-stack technologies such as **React**, **Node.js**, and **FastAPI**. I have successfully led projects in healthcare and financial sectors that integrate AI/ML capabilities for advanced analytics while ensuring compliance with standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Mobile App Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Google Flutter** and **Dart** to architect and develop mobile applications, ensuring outstanding **Mobile App Design** and user experience on both iOS and Android platforms.\nEmployed **BLoC Architecture** and **Cubit** for effective **State Management** in cross-platform apps, resulting in a scalable and maintainable codebase for high-demand healthcare and fintech solutions.\nProduced beautiful UIs and optimized mobile apps with **Flutter**, leading to an increase in user engagement by **30%** on deployed applications.\nMaintained seamless communication and collaboration with cross-functional teams in a **Remote Work** setting, ensuring timely project delivery and adherence to best practices.\nDemonstrated strong problem-solving skills and strategic thinking when directing workflows and app features, significantly reducing deployment time by utilizing efficient processes.\nRefined and executed app design strategies focused on user-centered experiences, achieving a **95%** customer satisfaction rate based on feedback and app reviews.\nConsolidated project documentation and guidelines, facilitating effective communication among stakeholders and ensuring continuity in development processes for future scaling.\nActively contributed to team brainstorming sessions, bringing innovative ideas to life, which resulted in a **25%** increase in project outputs and quicker feature deployment.\nDelivered real-time updates and improvements to applications based on user feedback, enhancing the overall usability and effectiveness of mobile solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Designed and developed mobile applications using **Google Flutter** and **Dart**, implementing **BLoC Architecture** for efficient state management and delivering high-quality user experiences.\nCollaborated remotely in a distributed team environment to enhance communication and project coordination, successfully meeting deadlines on **3 major app releases** in the past year.\nApplied mobile app design principles to create responsive and intuitive interfaces, improving user satisfaction ratings by **25%** in user feedback surveys.\nUtilized **Cubit** for state management in mobile applications, ensuring a streamlined and efficient development process.\nEngaged in regular code reviews and shared best practices, contributing to a **15% reduction** in development time for subsequent projects.\nParticipated in the development of cross-platform mobile solutions, achieving seamless operation on both Android and iOS devices.\nLeveraged agile methodologies to adapt to changing project requirements and deliver client-focused mobile solutions within **4-week sprint cycles**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed high-quality mobile applications using **Google Flutter** and **Dart**, focusing on performance and responsiveness to deliver exceptional user experiences.\nImplemented **BLoC Architecture** and **Cubit** for effective state management, enhancing code maintainability and scalability across the application.\nDesigned and executed mobile app interfaces grounded in user-centric mobile app design principles, ensuring an engaging and intuitive user experience.\nUtilized **remote work** collaboration tools to maintain effective communication with cross-functional teams, achieving project milestones on time and within budget.\nLeveraged strong communication skills to articulate project requirements, gather feedback, and iterate on designs based on user testing and analytics.\nConducted regular code reviews and performance testing, ensuring adherence to best practices and continuous integration pipelines in a **Flutter** environment.\nEmployed versioning of applications to manage updates effectively, ensuring smooth transitions from **version 1.0** to subsequent releases with minimal user disruption.\nAnalyzed user feedback and performance metrics regularly, leading to feature enhancements that improved user engagement by **30%** over **6 months**.\nParticipated in sprint planning and stand-up meetings, ensuring alignment with all stakeholders and fostering a collaborative team culture within a **remote work** setup."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Dart\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, Google Flutter\n\n **API Technologies:**\n    Cubit, BLoC Architecture\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Remote Work, Communication, Mobile App Design, State Management"
}