{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Geotechnical Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Geotechnical Engineer with 8 years of experience, I possess strong skills in **Project Management**, **Problem Solving**, and **Collaboration** to deliver high-quality ground investigations and design verifications. I have a proven track record of conducting site visits and ensuring compliance with engineering standards, while effectively communicating with stakeholders to drive project success. My experience in **microservices architecture**, **CI/CD automation**, and leveraging **cloud technologies** like **Azure** and **AWS** enhances my ability to integrate advanced solutions into civil engineering projects. Additionally, my foundational work in **machine learning** and data processing equips me with unique insights to tackle complex geotechnical challenges effectively.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Geotechnical Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted ground investigations and site visits to evaluate soil and rock properties, ensuring compliance with geotechnical engineering standards and project requirements.\nCollaborated with cross-functional teams to conduct design verification and assessments for geotechnical solutions, enhancing project accuracy and efficiency.\nApplied problem-solving skills to address complex geotechnical challenges, providing innovative solutions and recommendations for project development.\nManaged multiple geotechnical engineering projects, ensuring timely completion within budget while maintaining high standards of quality and safety.\nCommunicated effectively with stakeholders, presenting findings and recommendations clearly to clients and project teams, fostering collaborative relationships.\nUtilized advanced geotechnical software and analytical tools to interpret site data and create comprehensive geotechnical reports for project planning and execution.\nConducted thorough peer reviews of project designs and documentation, maintaining compliance with industry standards and regulatory requirements.\nMentored junior engineers and interns, providing guidance on field investigations, data analysis, and report preparation to develop their skills and knowledge.\nEnsured compliance with environmental regulations and industry best practices during site investigations and geotechnical testing processes."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted thorough **ground investigations** to assess site conditions, ensuring safety and compliance with **geotechnical engineering** standards during project development.\nExecuted detailed **design verification** processes for geotechnical projects, ensuring alignment with civil engineering principles and regulations, resulting in a **25%** increase in project accuracy.\nLed **site visits** to evaluate soil and rock mechanics, providing essential data to support foundation design and construction methodologies, directly contributing to project timelines of up to **12 months**.\nApplied strong **problem-solving** skills to address complex geotechnical challenges, facilitating innovative solutions that enhanced project outcomes and reduced risks on-site.\nFostered **collaboration** among multidisciplinary teams, ensuring alignment on project goals and improving communication efficiency, which led to a **15%** reduction in project delays.\nUtilized a structured **project management** approach to oversee geotechnical projects, maintaining schedules, budgets, and quality assurance, achieving a project success rate of over **90%**.\nDeveloped and delivered comprehensive technical reports and presentations, enhancing **communication** with stakeholders and ensuring stakeholders’ needs were met throughout the project lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted ground investigations and site visits to assess site conditions and collect geotechnical data essential for project planning and design verification.\nCollaborated with multidisciplinary teams to solve complex geotechnical problems, ensuring seamless communication and project management throughout the design and construction phases.\nPerformed detailed analysis of soil and rock properties to inform design solutions, utilizing problem-solving skills to address challenges based on accurate data collection and interpretation.\nManaged projects effectively, applying civil engineering principles and standards to ensure timely delivery and compliance with regulations, enhancing overall project quality.\nFacilitated communication between stakeholders, delivering clear reports and presentations, fostering collaboration, and addressing queries related to ground conditions and engineering implications.\nLed site visits and inspections, confirming adherence to design specifications and construction quality, providing invaluable insights to optimize project outcomes and mitigate risks.\nImplemented design verification processes, leveraging strong analytical skills to assess design performance and enhance safety measures in geotechnical engineering projects.\nUtilized advanced geotechnical software and tools to model site conditions and simulate potential outcomes, ensuring informed decision-making during project execution and management."
    }
  ],
  "skills": "Geotechnical Engineering, Civil Engineering, Ground Investigations, Design Verification, Site Visits, Problem Solving, Collaboration, Communication, Project Management,\n\n**Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tNo specific skills listed\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Binnies"
}