{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Staff Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Staff Software Engineer with 13+ years of experience in software design principles and performance tuning, specializing in building high-quality, scalable applications. Proficient in **Ruby**, **Ruby on Rails**, and **Postgres**, ensuring robust data flows and high code quality in all projects. Demonstrated expertise in async collaboration and mentoring junior developers to foster a culture of continuous improvement. Skilled in JavaScript/TypeScript, Python, and Flutter, utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** to deliver innovative solutions. Experienced in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices with CI/CD pipelines. Strong track record in developing AI/ML-powered platforms focused on automation, predictive analytics, and real-time processing, as well as aligning solutions with compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Staff Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed platform features using **Ruby** and **Ruby on Rails** to enhance user experience, ensuring alignment with performance tuning and software design principles.\n• Designed and optimized data flows for post-production use, leveraging **Postgres** for effective data management and retrieval.\n• Collaborated with cross-functional teams in an asynchronous manner to drive innovative solutions, improving communication and project outcomes.\n• Ensured high code quality through rigorous code reviews, mentorship of junior developers, and implementation of best practices for maintainable software.\n• Led performance tuning initiatives that improved application response times by **30%**, significantly enhancing user satisfaction.\n• Mentored team members on **Ruby** best practices and architecture patterns, fostering a culture of continuous learning and improvement.\n• Actively participated in planning and design sessions, employing strong communication skills to articulate technical concepts clearly to non-technical stakeholders.\n• Instrumented comprehensive testing approaches, ensuring stability and reliability throughout development phases aligned with overall quality assurance processes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented software design principles to enhance core financial platforms, modernizing architecture and migration strategies.\nConducted performance tuning and optimizations for high-volume transactional systems, ensuring scalability and reliability.\nMaintained code quality standards through rigorous code reviews and automated testing practices, ensuring continuous integration and deployment effectiveness.\nMentored junior developers in best practices, fostering a collaborative and learning-focused environment to elevate team capabilities.\nUtilized **Ruby** and **Ruby on Rails** for building robust backend services, enhancing data flows and integration with **Postgres** for efficient data management.\nFacilitated effective async collaboration across teams to streamline development processes and improve project delivery timelines.\nHarnessed data-driven insights to inform decisions and enhance software features through effective communication with cross-functional teams."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Ruby** on **Rails** to design and optimize backend services, ensuring adherence to software design principles and enhancing overall system performance and scalability for high-traffic applications.\nImplemented complex data flows within **Postgres** databases, leading to improved performance tuning and efficient data access for multiple modules.\nEnhanced code quality by applying rigorous code reviews and best practices, mentoring junior developers in leveraging **Ruby** and **Rails** effectively while promoting asynchronous collaboration across teams.\nAnalyzed performance metrics and optimized application functionalities, achieving a **30%** reduction in response time for critical endpoints.\nFostered a culture of open communication, enabling seamless interaction between frontend developers, product managers, and stakeholders for project alignment and success.\nLed initiatives to improve overall software quality, implementing strategies that resulted in a **20%** decrease in bug reports through proactive testing and refactoring efforts.\nGuided teams through complex software design challenges, applying principles of scalability and maintainability in **Rails** architecture.\nEncouraged knowledge sharing and continuous learning within the team, establishing regular mentorship sessions that helped to enhance overall team performance.\nPromoted best practices for documentation and code management, facilitating smoother onboarding of new team members and enabling a robust development environment."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript/TypeScript, Ruby\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django, Ruby on Rails\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, Azure: App Services\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, software design principles, async collaboration, performance tuning, code quality, mentorship, communication"
}