{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Frontend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Frontend Engineer with 8 years of experience, I possess a strong proficiency in **JavaScript**, **HTML5**, **CSS3**, and frameworks such as **React**, alongside design tools like **Figma**. I have a proven track record in creating visually appealing, user-friendly interfaces, utilizing tools like **Tailwind**, **Bootstrap**, and **Foundation** to enhance web applications. My experience includes implementing responsive design practices and ensuring cross-browser compatibility.\n\nI excel at collaborating with cross-functional teams to create optimized **REST APIs** and have hands-on experience with version control systems including **GitHub** and **GitLab**. With a keen understanding of **SEO** practices, I focus on building high-performing web applications that attract and retain users.\n\nIn addition, I have demonstrated success in leading projects, enhancing user engagement, and employing agile methodologies to deliver quality solutions on time. My holistic approach blends technical skills with a commitment to user-centric design, evidenced by my ability to integrate both frontend aesthetics and functionality into every project.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **HTML5**, and **CSS3** to develop responsive and user-friendly front-end applications for healthcare and financial platforms, ensuring seamless user experiences for both web and mobile.\nImplemented robust designs with frameworks such as **React** and **Tailwind**, creating intuitive UI/UX that enhances user interaction and satisfaction across applications.\nCollaborated with cross-functional teams to integrate **REST APIs** and leverage **WooCommerce** for enhanced e-commerce functionalities within financial services, deploying consistent and scalable solutions.\nDesigned and streamlined workflows using **GitHub** and **GitLab** for version control, fostering collaboration and efficient project management among development teams.\nLed optimization strategies for SEO, significantly enhancing the organic reach of web applications by implementing best practices and performance tuning.\nCreated and maintained design prototypes and wireframes utilizing tools like **Figma**, ensuring alignment with user requirements and stakeholder feedback.\nImplemented responsive design principles through frameworks like **Bootstrap** and **Foundation**, ensuring cross-browser compatibility and accessibility for diverse user bases.\nConducted user testing and gathered feedback to iterate and improve the UI/UX design, resulting in a measurable increase in user engagement by **30%**.\nDeveloped mapping strategies for effective content presentation and navigation, ensuring a **95%** user satisfaction score on post-launch reviews.\nEngaged in knowledge sharing and mentorship practices within the engineering team to foster a culture of continuous learning and innovation."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed dynamic, user-focused front-end applications using **React (18)**, **Tailwind CSS**, and **JavaScript**, enhancing user experience and interface design for financial dashboards and admin portals.\nCollaborated with design teams using **Figma** to create wireframes and prototypes that improved UI/UX for various applications.\nLeveraged **HTML5**, **CSS3**, and **Bootstrap** to build responsive layouts, ensuring compatibility across devices and enhancing accessibility standards.\nImplemented RESTful APIs to integrate with back-end services, streamlining data flow and enhancing application performance.\nUtilized **GitHub** and **GitLab** for version control, enabling seamless collaboration among team members and maintaining code integrity across projects.\nEnsured application performance and SEO optimization to boost visibility and user engagement, contributing to a positive online presence for financial products.\nConducted A/B testing and user feedback sessions, leading to a **30%** increase in user satisfaction scores.\nMaintained best practices in code quality and documentation, driving a **20%** reduction in bug reports after deployment."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed responsive, SEO-friendly frontend applications using **React** (18) and **Next.js**, integrating **HTML5**, **CSS3**, and **Tailwind CSS** to deliver fast, user-centric experiences on both web and mobile platforms.\nEngineered user interfaces for e-commerce solutions by implementing **JavaScript** frameworks such as **Vue 3** and **Angular**, enhancing accessibility compliance (WCAG 2.1) and ensuring seamless user interactions.\nCreated and maintained custom themes for WordPress and **WooCommerce**, streamlining the deployable codebase and improving site performance and maintainability by **30%**.\nCollaborated closely with UI/UX designers using **Figma** to improve design processes, resulting in a **25%** increase in customer engagement through optimized user journeys.\nIntegrated REST APIs to connect frontend components with backend services, facilitating dynamic content updates and improved load times by **40%**.\nImplemented version control and code collaboration tools using **GitHub** and **GitLab**, enhancing team productivity and reducing deployment errors by **15%**.\nOptimized sites for search engines through strategic use of **SEO** techniques, increasing organic traffic by **20%** within the first quarter after deployment.\nUtilized CSS frameworks such as **Bootstrap** and **Foundation** for responsive design, ensuring consistent layout and functionality across different devices and screen sizes.\nLed agile development sprints, ensuring adherence to best coding practices and performance benchmarks, facilitating timely project deliveries within **2-week** cycles."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tJavaScript, HTML5, CSS3, React, Tailwind, Bootstrap, Foundation, Figma, UI/UX, WooCommerce\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**API Technologies:**\n\tREST API\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), SEO",
  "apply_company": "Remote Office"
}