{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Software Engineer, I leverage extensive experience in key technologies such as **React**, **Java**, **Spring Boot**, and **Postgres** to craft high-performance applications in dynamic environments. My solid background in modern software development allows me to create scalable and efficient solutions, employing **CircleCI** and **Spinnaker** for seamless CI/CD automation.\nWith 8 years of experience in full stack development, I also possess proficiency in **Ruby on Rails**, ensuring robust back-end functionalities. My commitment to building secure applications aligns with industry compliance standards. I additionally bring expertise in integrating emerging technologies like AI/ML, enhancing applications for predictive analytics and intelligent automation, and implementing MLOps workflows.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained full-stack applications using **React (17-18)**, **Java**, and **Spring Boot**, ensuring high performance and responsiveness across platforms.\n- Collaborated on the migration of legacy systems to the **PostgreSQL** database, optimizing queries for better performance with datasets exceeding **1 million** records.\n- Led the implementation of CI/CD processes using **CircleCI**, ensuring automated testing and deployment for seamless integration and delivery.\n- Enhanced existing applications by integrating with third-party services using **Ruby on Rails** and **Kotlin**, increasing application functionality and user satisfaction.\n- Built scalable microservices architecture utilizing **Spring Boot**, facilitating a **30%** increase in system reliability and performance.\n- Designed and implemented user interfaces in **React**, adhering to UX principles to improve user engagement by at least **25%**.\n- Developed RESTful APIs with **Java** and **Spring Boot**, enabling efficient data exchange between front-end applications and backend services.\n- Established robust logging and monitoring solutions using **CircleCI** and **Spinnaker** for real-time observability of all deployments, reducing troubleshooting time by **40%**.\n- Actively participated in code reviews and mentorship sessions to promote best coding practices and foster a collaborative team environment.\n- Conducted performance tuning of existing applications, achieving up to **50%** reductions in response times for key endpoint services."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained dynamic, user-focused front-end applications using **React** (18), ensuring seamless integration with back-end services in a microservices architecture.\nUtilized **Java** and **Spring Boot** to design robust back-end services that support high-volume transactions, enhancing performance and system reliability.\nImplemented efficient database solutions with **Postgres**, optimizing data retrieval and management for financial applications.\nCollaborated in agile teams, employing continuous integration and continuous deployment methodologies using **CircleCI** and **Spinnaker**, resulting in the rapid delivery of high-quality software updates.\nConducted thorough code reviews and unit testing to maintain excellent code quality, leading to a **30%** reduction in production bugs.\nDesigned scalable architectures and component libraries aligned with business requirements, improving system performance by **25%**.\nExplored the use of **Kotlin** and **Ruby on Rails** for potential future projects, ensuring the team stays ahead of technology trends and best practices.\nMentored junior developers in best coding practices and project architecture, fostering a collaborative development environment."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and maintained robust applications using **React** (18), ensuring a seamless user experience on e-commerce platforms.\n• Collaborated on backend services using **Java** and **Springboot**, focusing on high performance and scalability to support growing traffic, leveraging features like caching and optimization for **Postgres** storage.\n• Employed CI/CD practices with **CircleCI** and **Spinnaker** to manage deployment pipelines, improving deployment frequency by **30%** and reducing rollback incidents through streamlined version control.\n• Designed RESTful APIs integrating with blockchain technologies to enhance transaction security and transparency, ensuring compliance with industry standards.\n• Improved system architecture with microservices design principles using **Springboot**, enabling independent deployment and reducing technical debt by **25%**.\n• Integrated third-party services, such as payment gateways, utilizing **Kotlin** for server-side development to enhance code efficiency and maintainability.\n• Conducted comprehensive unit and integration tests, achieving a **95%** test coverage rate, significantly enhancing reliability and reducing production errors.\n• Collaborated with cross-functional teams to gather requirements and provide technical solutions, enhancing feature delivery speed and team throughput.\n• Mentored junior developers on best practices in coding and architecture, contributing to a **40%** increase in team productivity.\n• Developed application monitoring solutions, leveraging logging and metrics to ensure system operability and respond to incidents within **10 minutes**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, Kotlin, Ruby\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Springboot, Ruby on Rails\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tNginx, Keycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CircleCI, Spinnaker, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMachine Learning, AI, MLflow, Airflow, Kubeflow, Let’s Encrypt, Certbot",
  "apply_company": "AlphaSights"
}