{
  "name": "Tomasz Lee",
  "role_name": "Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Software Engineer with 9+ years of experience in designing, developing, and implementing scalable applications leveraging **Ruby**, **Rails**, **TypeScript**, and **Postgres**. Proficient in **API integration** and adept at driving automation strategies to enhance development efficiency. Experienced with **Docker** for containerization and cloud services such as **AWS CDK** to ensure resilient and efficient solutions. Strong background in both frontend and backend technologies including **React** and **Redis**, with a proven track record in code review and optimizing application performance. Excellent collaborator with a history of leading cross-functional teams to successful project completions while focusing on high-level programming languages and maintaining system scalability and resiliency.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed scalable and resilient applications using **Ruby on Rails** and **TypeScript**, improving maintainability and team collaboration.\n• Integrated with **Postgres** for efficient data storage solutions, ensuring high availability and performance.\n• Implemented caching strategies with **Redis**, reducing response times and enhancing system performance by up to **35%**.\n• Utilized **Docker** for containerization, streamlining development workflows and enhancing application portability across environments.\n• Designed and deployed automated CI/CD pipelines using **AWS CDK**, achieving a **40%** reduction in deployment time.\n• Conducted code reviews to maintain code quality and facilitate knowledge sharing among team members.\n• Collaborated on integrating **React** for front-end development, maximizing user engagement and satisfaction ratings.\n• Focused on API integrations to ensure seamless connections between various services, enhancing overall system functionality.\n• Ensured software scalability by adopting microservices architecture, contributing to a structured and maintainable codebase.\n• Leveraged automation tools to improve development efficiency and reduce manual intervention in processes."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed scalable and resilient software solutions using **Ruby on Rails** and **TypeScript**, enhancing system performance and maintainability.\nDesigned and implemented exposed **RESTful APIs** for **Postgres** databases, ensuring efficient data access and integration.\nUtilized **React** for frontend development, creating responsive user interfaces that improved user engagement by 25%.\nIntegrated **Redis** as a caching solution, achieving a 25% reduction in latency during high-frequency API calls.\nCreated automated deployment processes using **AWS CDK** and **Docker**, improving deployment efficiency and reducing errors by 30%.\nLed the design and deployment of microservices architectures, enhancing system scalability through effective orchestration strategies.\nConducted thorough code reviews and provided mentorship on best practices, fostering a more productive engineering team.\nCollaborated with cross-functional teams to gather and interpret project requirements, ensuring alignment with business objectives and timely delivery.\nImplemented automation tools and strategies for testing and deployment, streamlining development workflows.\nDeveloped custom data visualization tools for project tracking, creating intuitive reports based on dynamic datasets."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Ruby** and **Rails** to develop scalable applications, enhancing system performance and reducing downtime by 30%.\nEmployed **TypeScript** with **React** to create interactive user interfaces, improving user engagement metrics by 25%.\nIntegrated **Postgres** and **Redis** for efficient data management and caching solutions, achieving a 40% reduction in query response times.\nDeveloped automated deployment pipelines using **Docker** and **AWS CDK**, accelerating deployment frequencies to multiple times per day.\nFacilitated API integration with third-party services, optimizing data exchange and increasing system interoperability.\nEngaged in rigorous code reviews to maintain high coding standards and ensure code quality, reducing bugs in production by 15%.\nApplied best practices for scalability and resiliency in application architectures, enhancing system robustness under high load conditions.\nParticipated in agile ceremonies including daily standups and iterative planning sessions, aligning team efforts with project deliverables.\nCreated comprehensive technical documentation and user guides, streamlining onboarding and knowledge sharing among teams."
    }
  ],
  "skills": " **Programming Languages**\n\t Ruby, TypeScript, Python, High-level programming languages\n\n **Backend Frameworks**\n\t Rails, NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL, API integration\n\n **Serverless and Cloud Functions**\n\t AWS, AWS CDK\n\n **Databases**\n\t Postgres, MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, Redis\n\n **DevOps**\n\t CI/CD pipelines, Docker, Automation, Code review\n\n **Cloud & Infrastructure**\n\t Azure\n\n **Other**\n\t UX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Scalability, Resiliency"
}