{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented Senior Software Engineer with 9+ years of experience in designing, developing, and implementing scalable applications leveraging **Golang**, **SQL**, **API design**, and **cloud computing**. Proficient in building **SaaS** solutions with a strong focus on **security** and **transactions management**. Experienced in working with **relational databases** and ensuring high scalability of applications. Originally specialized in **microservices architecture** and distributed systems with hands-on experience in technologies such as **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, and **.NET**. Demonstrated history of delivering robust solutions, optimizing performance, and enhancing development processes. A proactive team collaborator with strong logical thinking abilities and a continuous curiosity to learn and grow.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Leveraged **Golang** for developing scalable microservices within the customer management platform, enhancing system performance by **30%**.\n• Designed and implemented a robust API architecture tailored for **SaaS** applications, promoting seamless integration with external services.\n• Utilized **SQL** and **MongoDB** for effective data management, ensuring high data integrity and optimized relational database performance.\n• Developed secure API endpoints with JWT-based authentication, enhancing application security and user data protection.\n• Implemented **cloud computing** solutions on **Azure**, resulting in a **40%** reduction in operational costs through efficient resource management.\n• Actively contributed to team collaborations, driving proactive documentation practices that improved project transparency and knowledge sharing.\n• Enhanced transactions management features, reducing processing time by **25%** and increasing user satisfaction.\n• Conducted in-depth logical thinking exercises to architect resilient solutions, meeting evolving customer requirements.\n• Collaborated with cross-functional teams ensuring successful delivery of project milestones, improving overall project efficiency by **20%**.\n• Maintained up-to-date documentation outlining system architecture and API designs, facilitating knowledge transfer among team members."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed cloud-based solutions utilizing **Golang** and **cloud computing** strategies, enhancing system scalability and efficiency.\n• Designed RESTful APIs with a focus on **API design**, enabling seamless integration with **relational databases** such as **PostgreSQL** and **MSSQL** for real-time data access.\n• Created robust SaaS applications to support team collaboration, resulting in a **25%** increase in user engagement through effective UI components built with **ReactJS** and **Tailwind CSS**.\n• Implemented scalable microservices architecture using **RabbitMQ** and **Apache Kafka**, improving data flow and processing by **30%** in handling event-driven data streams.\n• Optimized database queries for **MySQL** and **PostgreSQL**, leading to a **15%** reduction in latency and improved transaction management within applications.\n• Spearheaded the creation of continuous integration and deployment (CI/CD) pipelines with **GitHub Actions**, decreasing production deployment errors by **30%**.\n• Authored comprehensive documentation to facilitate knowledge sharing, fostering a culture of curiosity and continuous improvement within the team.\n• Conducted thorough code reviews and mentorship sessions that resulted in enhanced team collaboration and productivity by **25%**.\n• Successfully integrated caching mechanisms using **Redis**, which contributed to a **25%** boost in overall system performance.\n• Collaborated with cross-functional teams and stakeholders to define system requirements and development priorities, ensuring timely delivery of software solutions."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Implemented **API design** strategies to seamlessly integrate with third-party systems, improving data flow and accessibility.\n• Developed and managed **relational databases** using **SQL** to ensure efficient transactions management, resulting in a **30%** improvement in query response times.\n• Leveraged **cloud computing** principles to enhance the scalability and reliability of applications, ensuring smooth operations during increased loads.\n• Created comprehensive technical documentation and user guides, facilitating knowledge transfer among teams and fostering a culture of **curiosity** and **proactive** learning.\n• Collaborated with cross-functional teams to ensure **team collaboration** on projects, actively participating in daily standups and code reviews.\n• Designed and implemented solutions in **Golang** for system enhancements, focusing on performance and security while maintaining high standards of code quality.\n• Improved system performance through **scalability** strategies that accommodated a **50%** increase in user traffic without service disruptions.\n• Engaged in continuous improvement processes, showcasing strong **logical thinking** to anticipate potential roadblocks and proactively address them before they escalate.\n• Participated in the development of a SaaS platform, which streamlined operations and increased customer satisfaction by **25%**."
    }
  ],
  "skills": "Frontend Frameworks: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n\tBackend Frameworks: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n\tProgramming Languages: Golang, Python\n\n\tAPI Technologies: RESTful API, GraphQL, API design\n\n\tDatabase Systems: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL, relational databases\n\n\tCloud & Infrastructure: AWS, Azure, cloud computing\n\n\tDevOps: CI/CD pipelines\n\n\tOther: UX/UI Design, Git, GitHub, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, SaaS, scalability, security, documentation, transactions management, logical thinking, proactive, curiosity, team collaboration",
  "apply_company": "Mambu Payments"
}