{
  "name": "Damian Franciszek Pospiech",
  "role_name": "DevOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "DevOps Engineer with 13+ years of experience in cloud infrastructure, specifically in deploying and managing applications on **AWS** and **Azure**. Proficient in **CI/CD** processes and tools including **GitHub Actions**, **Bitbucket**, and **AWS CodeBuild**. Demonstrated expertise in leveraging technologies such as **Java**, **Python**, and **C#**, supported by hands-on skills in **Linux** environments and database management.\nStrong background in implementing microservices and event-driven architectures, with practical knowledge of TCP/IP, HTTP protocols, and caching strategies. Experienced in adhering to compliance standards like **ISO27001** and **SOC 2**, ensuring solutions are robust and secure.\nExcellent analytical problem-solving abilities complemented by strong communication and collaboration skills. Committed to enhancing software development lifecycle processes through automation and innovative approaches.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "DevOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained **CI/CD** pipelines utilizing **GitHub Actions**, ensuring streamlined code integrations and deployments across **AWS** and cloud infrastructure.\n• Collaborated with cross-functional teams to adhere to **ISO27001** and **Soc2** standards, enhancing security and compliance in software delivery processes.\n• Built and managed containerized applications using **Docker** and orchestration tools like **Kubernetes** for scalable deployment strategies in cloud environments.\n• Automated testing workflows using frameworks such as **JUnit** and **PyTest**, ensuring comprehensive coverage across all stages of the software development lifecycle.\n• Implemented effective database solutions leveraging both SQL (PostgreSQL) and NoSQL (MongoDB) technologies to optimize data storage and retrieval processes.\n• Streamlined application deployment processes using **AWS CodeBuild** and **Bitbucket**, enhancing collaboration and reducing time to market by **30%**.\n• Utilized **Linux** for system management and server configurations, ensuring uptime and reliability of deployment environments.\n• Actively engaged in analytical problem-solving to troubleshoot and optimize **Java** and **C#** applications, improving performance metrics by **20%**.\n• Established robust communication channels within development teams, fostering collaboration that led to successful project completions with minimal friction.\n• Contributed to knowledge sharing sessions about **microservices architecture** and cloud technologies, elevating team proficiency and awareness of modern practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **AWS** for cloud infrastructure management, optimizing deployment strategies and ensuring high availability of financial applications.\nImplemented **CI/CD** pipelines using **GitHub Actions** and **Bitbucket**, enhancing deployment efficiency and reducing integration time by **40%**.\nDeveloped and maintained robust **Linux** environments for application deployment, ensuring systems are secure and compliant with **ISO27001** and **Soc2** standards.\nCreated automated build processes using **maven**, **npm**, and **make**, facilitating seamless integration across multiple projects and achieving a **30%** reduction in build times.\nDesigned and managed databases, focusing on performance tuning and backup strategies to accommodate high transaction volumes, ensuring **99.9%** uptime.\nImplemented asynchronous communication through message queues like **RabbitMQ** and **Kafka**, improving the efficiency of data processing workflows by **50%**.\nCollaborated with cross-functional teams to enhance analytical problem-solving techniques, streamlining workflows and increasing overall productivity.\nMaintained version control through **GitHub Actions**, ensuring code quality and enabling efficient collaboration among team members.\nProvided training and support for team members on **Java** and **C#**, fostering a culture of continuous learning and collaboration in software development practices."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Implemented CI/CD pipelines using **GitHub Actions** and **AWS CodeBuild** to streamline software deployment processes, promote collaboration, and reduce release cycles by up to **30%**.\n- Managed **AWS** infrastructure for high availability and scalability, ensuring robust cloud deployment for backend services.\n- Developed and maintained containerized applications using **Docker** and orchestrated with **Kubernetes**, enabling efficient environment management and version control across applications.\n- Enhanced backend services by integrating caching strategies using **Redis**, which improved application response times by **25%**.\n- Applied analytical problem-solving skills to troubleshoot and resolve operational issues within the application architecture, ensuring uptime and performance reliability.\n- Collaborated with cross-functional teams to implement **Linux** based server deployments, enhancing system reliability and reducing operational downtime by **15%**.\n- Conducted performance optimizations and monitoring using **AWS CloudWatch**, ensuring system health and timely issue resolution.\n- Utilized version control and management practices using **Bitbucket** and **npm**, facilitating efficient code management across teams and projects.\n- Ensured compliance with **ISO27001** and **Soc2** standards during deployment and operational processes, enhancing security and risk management.\n- Streamlined the software development lifecycle by implementing modern DevOps practices, fostering communication and collaboration across development and operations teams."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Java, C#, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tHTTP, OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, S3\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS Codebuild, Terraform, Ansible, Helm, Docker Compose, Bitbucket\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, cloud infrastructure, Linux\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, analytical problem solving, communication skills, collaboration skills, software development lifecycle, ISO27001, Soc2, caching, queues, maven, make, npm, TCP/IP, Java Application servers, .net deployment frameworks"
}