{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Full-Stack Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Full-Stack Developer with 8 years of experience, adept in utilizing **Java**, **C#**, and **Oracle** to deliver high-performance solutions. Proficient in using **Eclipse** for development processes and implementing robust testing practices with **JUnit**. Skilled in version control with **Git** and project management using **JIRA** and **Confluence** to streamline workflows. Beyond core responsibilities, I leverage modern frameworks like **React**, **Next.js**, **Node.js**, and **Django** alongside cloud services (**Azure**, **AWS**) to build scalable applications. My background in AI/ML integration enables predictive analytics and real-time data processing within enterprise environments. Committed to adhering to compliance standards such as HIPAA and PCI DSS, I have a strong foundation in microservices architecture and CI/CD automation for resilient application development.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Full-Stack Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed scalable applications using **Java** and **C#** to enhance full-stack healthcare solutions, ensuring compliance with key regulatory standards.\n- Implemented version control and collaboration tools, including **Git**, while utilizing **JIRA** and **Confluence** for efficient project management and documentation.\n- Designed automated testing frameworks using **JUnit** and integrated tests into CI/CD pipelines for continuous deployment and delivery.\n- Fostered collaboration within cross-functional teams to manage project workflows and issue tracking in **JIRA**, ensuring on-time delivery of features and enhancements.\n- Created user-friendly interfaces while leveraging IDEs like **Eclipse** to streamline development processes and improve code quality.\n- Collaborated on enhancing software reliability with **QF-Test**, focusing on testing automation across various stages of the software development lifecycle.\n- Developed advanced data handling features and integrations for full-stack applications, ensuring high performance and responsiveness for end-users.\n- Optimized application performance through the incorporation of best coding practices and architectural principles, targeting a reduction in load time by up to **30%**.\n- Improved system security and compliance through code reviews and constant adherence to industry standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and maintained robust back-end solutions for financial applications utilizing **Java** and **C#**, ensuring high performance and reliability across platforms.\nImplemented database integrations with **Oracle** to support efficient data retrieval and storage, enhancing operational efficiency by **30%**.\nCreated automated testing frameworks using **JUnit** to ensure code quality and minimize bugs in production deployments, achieving a reduction in post-release issues by **25%**.\nUtilized **Git** for version control and collaboration, contributing to a streamlined development process and maintaining code integrity in projects.\nManaged project documentation and workflows through **JIRA** and **Confluence**, improving project tracking and team communication by **40%**.\nConducted application testing using **QF-Test** for ensuring functionality and performance, leading to improved user satisfaction metrics.\nActively participated in code reviews and agile ceremonies, promoting knowledge sharing and best practices within the team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **C#** to develop and optimize full-stack applications, ensuring robust backend architecture and seamless interaction with frontend components.\nCollaborated with cross-functional teams using **JIRA** and **Confluence** for project management, enhancing team productivity and transparency through agile methodologies.\nImplemented continuous integration and deployment (CI/CD) pipelines leveraging **Git**, enabling efficient code version control and collaboration across development teams, with over **75%** reduction in deployment time.\nDeveloped and executed unit tests using **JUnit**, improving code quality and reliability, achieving **95%** code coverage across critical applications.\nApplied **Oracle** database management for efficient data storage and retrieval processes in large-scale applications, optimizing query performance by **30%**.\nManaged and organized project artifacts using **Eclipse**, facilitating an organized coding environment and reducing developer onboarding time by **20%**.\nEngaged in automated testing frameworks to ensure software quality and performance, employing tools like **QF-Test** for maintaining high-quality user experiences.\nLeveraged innovative coding techniques and best practices for building frontend interfaces, aligning user experience with back-end functionalities while adhering to technical specifications."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, C#, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Oracle\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Git, JIRA, Confluence, QF-Test, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, JUnit, Eclipse"
}