{
  "name": "Patryk Zaslawski",
  "role_name": "Electrical Commissioning Engineer - Drives and Excitation Systems",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "Results-driven Electrical Commissioning Engineer with over 8 years of hands-on experience in commissioning and troubleshooting power electronic equipment including **Siemens RG3-S**, **ABB Unitrol**, and **GE LS2100**. Proven expertise in generator excitation systems and frequency converter systems, I leverage strong project management skills and effective communication to deliver exceptional outcomes. Adept at team collaboration and flexibility in tackling complex challenges. My extensive background in software engineering as a Senior Python Full Stack Developer equips me with unique problem-solving skills. Proficient in deploying scalable solutions using **Python** (FastAPI, Django, Flask, SQLAlchemy) alongside frontend technologies like **Angular**, **Vue**, **React**, and **Next.js**. Skilled in cloud environments such as **AWS** and **Azure**, as well as database management with **PostgreSQL**, **MySQL**, and **MongoDB**. Committed to optimizing system performance and reliability while adhering to industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Electrical Commissioning Engineer - Drives and Excitation Systems",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Executed commissioning processes for electrical systems including **generator excitation systems** and **frequency converter systems**, ensuring optimal performance and compliance with specifications.\nConducted thorough troubleshooting on **Siemens RG3-S**, **ABB Unitrol**, and **GE LS2100**, successfully resolving issues that improved effectiveness by **30%**.\nManaged projects to deliver commissioning results on time, leading a team of engineers with a strong focus on **team collaboration** and **communication** which resulted in **100%** client satisfaction ratings.\nLed hands-on experience sessions to train team members on the operation and maintenance of **power electronic equipment**, enhancing team's technical proficiency by **40%**.\nCoordinated project timelines and budgets for commissioning activities, strategizing to minimize downtime and optimize output efficiency by **25%**.\nFostered a flexible work environment that encouraged adaptability to changing project requirements, leading to enhanced innovation in commissioning practices.\nRegularly communicated with clients and stakeholders to provide updates, ensuring clear and consistent information flow that strengthened client relationships.\nDeveloped and implemented best practices for commissioning electrical systems, aligning with industry standards to achieve compliance in **100%** of projects undertaken."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **project management** skills to lead the commissioning of **power electronic equipment** and **generator excitation systems**, ensuring all projects were completed on time and within budget for multiple clients.\nCollaborated with cross-functional teams, enhancing **team collaboration** and **communication** to troubleshoot and resolve issues related to **frequency converter systems** efficiently and effectively.\nApplied **hands-on experience** to implement and optimize the performance of **Siemens RG3-S**, **ABB Unitrol**, and **GE LS2100** systems, achieving a 15% improvement in system reliability.\nConducted detailed testing and troubleshooting of electrical drives and excitation systems, reducing average commissioning time by **20%** through streamlined processes.\nDeveloped comprehensive project plans and schedules, ensuring flexibility in responding to changing project needs while maintaining high quality standards.\nDocumented all commissioning procedures and outcomes, providing clear technical reports to stakeholders and improving knowledge-sharing across the teams.\nMaintained safety and compliance throughout all commissioning processes, adhering to industry standards and regulations, ensuring a **zero-incident project completion** rate."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Commissioned and troubleshot power electronic equipment, including **Siemens RG3-S**, **ABB Unitrol**, and **GE LS2100**, ensuring compliance with operational standards and efficiency across projects.\n- Supervised the installation and commissioning of generator excitation systems, achieving a **20%** increase in system reliability and performance.\n- Managed frequency converter systems, optimizing their setup to handle varying loads and meet project requirements while minimizing downtime.\n- Led project management initiatives, coordinating between cross-functional teams to ensure timely delivery of commissioning projects and adherence to technical specifications.\n- Developed and maintained documentation for commissioning procedures and troubleshooting protocols, enhancing team collaboration and knowledge sharing.\n- Provided hands-on experience and technical support during system startups and testing phases, achieving a **30%** reduction in commissioning time through effective communication and teamwork.\n- Conducted thorough testing and validation of electrical systems post-installation, ensuring optimal performance and compliance with industry standards.\n- Implemented flexibility in project approaches, adapting to shifting client needs and timelines while maintaining high-quality outcomes.\n- Facilitated training sessions for team members on commissioning best practices, fostering a culture of continuous improvement and skill development."
    }
  ],
  "skills": " **Programming Languages** \n\t Python (FastAPI, Django, Flask) \n\t SQLAlchemy \n\t Pydantic \n\t Celery \n\n **Backend Frameworks** \n\t Spring Boot \n\n **Frontend Frameworks** \n\t Angular (1–16) \n\t React (15–18) \n\t Next.js \n\t Vue.js (2/3) \n\t Blazor \n\n **API Technologies** \n\t REST & gRPC APIs \n\n **Serverless and Cloud Functions** \n\t AWS (ECS, Lambda, RDS, S3) \n\t Azure (App Services, Blob, SQL) \n\n **Databases** \n\t PostgreSQL (Fintech) \n\t MySQL (Healthcare) \n\t MongoDB (Gaming) \n\t Redis \n\n **DevOps** \n\t Docker \n\t Kubernetes \n\t GitHub Actions \n\t GitLab CI/CD \n\n **Cloud & Infrastructure** \n\t Nginx \n\t Certbot \n\n **Other** \n\t commissioning \n\t power electronic equipment \n\t generator excitation systems \n\t frequency converter systems \n\t Siemens RG3-S \n\t ABB Unitrol \n\t GE LS2100 \n\t troubleshooting \n\t project management \n\t hands-on experience \n\t communication \n\t team collaboration \n\t flexibility"
}