{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineering Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Engineering Engineer with a strong focus on programming skills, including **Python** for statistical and data analysis. Proficient in utilizing **R**, **SPSS**, and **Stata** for academic writing and research projects. Adept in applying citation standards such as APA, Vancouver, Chicago, and Harvard in technical documentation. Experienced in self-management and achieving autonomy in demanding environments.\n\nWith over 13 years of experience in full stack development across the healthcare and financial industries, I bring a wealth of knowledge in delivering high-performance applications. I possess strong skills in **JavaScript/TypeScript**, and **Flutter**, alongside hands-on expertise in frontend frameworks like **React**, **Next.js**, and **Vue**, as well as backend technologies including **Node.js**, **FastAPI**, and **Django**. My background includes building AI/ML-powered platforms for predictive analytics and real-time processing, with proficiency in deploying cloud-native systems on **AWS** and **Azure**. I have a proven track record in implementing microservices, event-driven architectures, and CI/CD pipelines while ensuring compliance with regulatory standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineering Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Demonstrated proficiency in programming by designing and building full-stack platforms for healthcare and fintech using **Python (FastAPI)** and incorporating statistical software methodologies applied to data for research advancements.\nConducted extensive research, analyzing data with **R**, **SPSS**, and **Stata**, resulting in high-quality academic publications adhering to various citation standards including **APA**, **Vancouver**, **Chicago**, and **Harvard**.\nImplemented robust CI/CD pipelines, emphasizing self-management and autonomy, utilizing tools such as **GitHub Actions** and **CircleCI**, ensuring efficient deployment workflows and comprehensive testing of software versions.\nManaged and integrated advanced statistical models for decision-making and predictive analytics, deploying them seamlessly within applications, backed by comprehensive data infrastructure using **PostgreSQL** and **MongoDB**.\nLed initiatives in resolving complex statistical research problems by leveraging critical programming skills in **Python** to develop algorithms tailored for data analysis that improved efficiency by **30%** in project timelines.\nCollaborated effectively within cross-functional teams to conduct research and statistical analysis, enhancing product features tailored to user needs and abiding by ethical standards of statistical integrity.\nComposed detailed technical documentation and implemented testing strategies that upheld quality assurance across various programming environments using tools such as **Jest** and **Cypress**.\nUtilized language proficiency to communicate complex technical concepts and findings clearly to stakeholders, fostering collaborative efforts toward common research goals.\nExercised autonomy in project management, taking ownership of the coding process and ensuring milestones were met ahead of deadlines, demonstrating time management skills in a fast-paced development environment."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized strong **Python** programming skills to develop statistical models and data analyses, ensuring accurate financial insights and reporting.\nConducted rigorous research and analysis of financial data using **R**, **SPSS**, and **Stata** to inform strategic decisions, demonstrating proficiency in statistical software.\nImplemented data-driven decision-making processes through meticulous academic writing, adhering to **APA**, **Vancouver**, **Chicago**, and **Harvard** citation standards.\nLeveraged self-management and autonomy to maintain high-quality work standards while working independently on complex engineering projects.\nOptimized financial data processes by programming ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, enhancing data ingestion efficiency by **30%**.\nDeveloped and maintained machine learning models for fraud detection utilizing **scikit-learn**, **XGBoost**, and **Azure ML**, improving detection rates by **25%**.\nDesigned interactive front-end applications using **React (18)**, **Vue 3**, and **Next.js** to facilitate user-friendly financial tools, leading to a **40%** increase in user engagement.\nArchitected an event-driven system with **Kafka**, **RabbitMQ**, and **Azure Service Bus**, streamlining communication for more than **1000** transactions per minute."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and implemented complex programming solutions utilizing **Python** and data analysis tools such as **R**, **SPSS**, and **Stata** to enhance data-driven decision-making processes.\n• Conducted comprehensive research and statistical analysis, ensuring adherence to citation standards (APA, Vancouver, Chicago, Harvard) for all academic and technical documentation.\n• Managed and prioritized projects autonomously, ensuring timely delivery of high-quality technical solutions while demonstrating strong self-management skills.\n• Collaborated on cross-functional teams to deliver innovative engineering projects, applying a combination of analysis and programming expertise to optimize services and systems.\n• Demonstrated language proficiency in technical documentation, ensuring clarity and compliance with professional standards across diverse projects.\n• Worked with data visualization and statistical software to interpret complex datasets, facilitating insightful reporting and optimized project outcomes.\n• Applied rigorous academic writing principles to translate technical findings into accessible documentation for varying audiences."
    }
  ],
  "skills": "Programming Languages:\n\tPython, R, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tacademic writing, research, statistical software, citation standards, APA, Vancouver, Chicago, Harvard, language proficiency, self-management, autonomy",
  "apply_company": "HazMiTrabajo"
}