{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Full Stack Engineer with 13+ years of experience specializing in delivering high-performance applications in the healthcare and financial sectors. Proficient in **JavaScript**, **TypeScript**, **Node.js**, and **VueJS**, with robust skills in frontend and backend development using **React**, **Next.js**, and **Django**. Expertise in crafting AI-driven solutions, emphasizing predictive analytics and automation. Skilled in implementing CI/CD pipelines and microservices architecture, leveraging **Git**, **npm**, and build tools such as **Webpack**. Experienced with cloud platforms **AWS** and **Azure**, ensuring the deployment of cloud-native applications. Familiar with compliance-oriented development standards, including HIPAA and PCI DSS. Notable strengths in MLOps, employing tools like **MLflow**, **Airflow**, and **Kubeflow** for model management and orchestration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Expertly designed and developed full-stack applications leveraging **Node.js**, **TypeScript**, and **VueJS** to deliver scalable solutions in healthcare and fintech environments.\nImplemented robust code structures and maintained high-quality standards using **JavaScript** frameworks, including extensive use of **Webpack** and **npm** for efficient project management and deployment workflows.\nUtilized CSS pre-processors like **SASS** and **PostCSS** to enhance styling capabilities, ensuring top-notch UI aesthetics while adhering to responsive design principles.\nLed the deployment of CI/CD pipelines with **Git** using tools such as GitHub Actions, enhancing collaboration and software delivery speed with a focus on reliability and test automation.\nCreated dynamic user interfaces and integrated intelligent features using **HTML** and **CSS**, delivering a seamless user experience in compliance with industry standards.\nDeveloped testing strategies using **Mocha**, **Jest**, and **Cypress**, achieving over **90% code coverage** and ensuring all major features were rigorously tested, including unit, integration, and E2E tests.\nSuccessfully applied AI technologies and machine learning models to improve application functionalities, enhancing performance and user engagement across platforms.\nFacilitated collaboration with cross-functional teams to drive project success and adopt best practices in software development across the tech stack."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** (NestJS/Express) and **Python** (FastAPI, Django) to modernize core financial platforms by migrating to microservices architecture, resulting in enhanced scalability and performance for high-volume transactional systems.\nDeveloped dynamic front-end applications using **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, incorporating **Redux Toolkit** and **Tailwind CSS** to deliver responsive interfaces for financial tools and admin panels, achieving a 30% increase in user engagement.\nEngineered real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, equipping operations teams with actionable insights into transactions and anomalies, which improved response times by 25%.\nDesigned and implemented a robust event-driven architecture leveraging **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication for critical workflows, streamlining payment processes by **50%**.\nCreated and maintained ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, accommodating both batch and real-time processing in less than **5 minutes**.\nEngineered and deployed machine learning models for fraud detection utilizing **scikit-learn**, **XGBoost**, and **Azure ML**, facilitating proactive detection of suspicious activities, leading to a **40%** reduction in fraud incidences.\nEstablished ML pipelines for real-time credit scoring, churn prediction, and transaction classification, employing **MLflow** and **Airflow** to seamlessly integrate model inference into backend services, achieving processing times of under **2 seconds**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and optimized full-stack applications leveraging **Node.js** (Express, NestJS), **VueJS** (3), and **JavaScript**, ensuring high performance and responsiveness across the entire application.\n- Engineered AI-based features that personalize user experiences, utilizing powerful libraries like **TensorFlow** and **scikit-learn** for enhanced product recommendations.\n- Implemented and maintained robust CSS architectures with **SASS** and **PostCSS**, ensuring a modular design approach for scalable styling in both web and mobile applications.\n- Utilized **HTML5/CSS3** and **TypeScript** to create accessible and SEO-friendly interfaces, improving user engagement by over **30%** and boosting conversion rates significantly.\n- Managed version control and code collaboration using **Git**, ensuring continuous integration and delivery (CI/CD) practices were followed throughout the development cycle.\n- Conducted rigorous testing and optimization of applications using **Mocha** and **Jest**, leading to a reduction in bugs by **25%** post-deployment.\n- Implemented responsive designs and component reuse strategies with modern frameworks, resulting in a **40%** decrease in development time for new features.\n- Contributed to the overall architecture and strategy by effectively utilizing **Webpack** for asset management, creating streamlined build processes that improved load times by **20%**.\n- Integrated with third-party payment solutions, ensuring secure transactions and compliance with industry standards such as PCI, using tools like **Stripe** and **PayPal**.\n- Collaborated with cross-functional teams to leverage **npm** for dependency management, ensuring up-to-date libraries and frameworks for continuous application evolution."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, VueJS, CSS, HTML, PostCSS, SASS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js, Symfony\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot\n\tTerraform, Ansible, Helm, Docker Compose, Mocha, Jest",
  "apply_company": "Skipso"
}