{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Ruby Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Ruby Engineer with 13+ years of experience in building scalable applications with a strong focus on **AWS** and **Docker**. Proficient in **JavaScript**, leveraging skills in **Ruby** to enhance backend development. Hands-on expertise in cloud-native architectures and deploying dynamic systems using CI/CD principles. Experienced in compliance-driven development, aligning solutions to industry standards including HIPAA and PCI DSS. Strong problem-solving skills highlighted by a proven track record in delivering high-performance applications in diverse sectors such as healthcare and finance, along with a robust understanding of data analytics and machine learning methodologies.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Ruby Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust applications using **Ruby** and **JavaScript**, focusing on efficient and scalable solutions for healthcare and fintech sectors.\n- Designed CI/CD pipelines leveraging **Docker** for seamless deployment and containerization, ensuring smooth integration and delivery of applications in **AWS** environments.\n- Collaborated with cross-functional teams to implement microservices architectures, enhancing system resilience and scalability with **Docker** and cloud services such as **AWS**.\n- Enforced rigorous testing strategies across the stack using tools like Jest and PyTest, ensuring high-quality code and functionality in production.\n- Applied **AWS** cloud services to optimize application performance, managing resources and scaling solutions as needed.\n- Spearheaded migration projects to modern tech stacks, improving application performance by up to **30%** and reducing technical debt.\n- Analyzed data patterns and integrated intelligent features into applications, utilizing advanced analytics with **SAS** and **R**, achieving insights for timely decision-making.\n- Built and maintained automation scripts and configuration management using **Chef**, streamlining operational workflows and reducing deployment times by approximately **25%**.\n- Worked on the integration of Office 365 tools into applications, enhancing team collaboration and documentation accuracy.\n- Developed real-time analytics tools enabling dynamic data visualizations that support monitoring and decision-making, resulting in improved operational efficiency.\n- Collaborated with teams to ensure adherence to compliance standards, enhancing system security with proper data handling procedures."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Employed **AWS** and **Docker** for containerized application deployment, enhancing service scalability and reliability in cloud environments.\nDeveloped and maintained robust backend applications in **Ruby** leveraging frameworks such as Ruby on Rails (6) to ensure efficient data processing and API integration.\nUtilized **JavaScript** frameworks like React (18) and Vue 3 to craft intuitive user interfaces that enhance user experience across financial applications.\nImplemented CI/CD pipelines with tools like Chef to automate deployment processes, resulting in a 30% decrease in deployment time.\nApplied data analysis techniques using **SAS** and **R** to derive insights from financial data, supporting business intelligence and strategic decision-making.\nDesigned and executed microservices architecture to improve application modularity, allowing for **70%** faster feature delivery and easier maintenance.\nCollaborated with cross-functional teams to gather requirements and translate them into technical specifications, improving team efficiency by 25%.\nLed code reviews and mentoring sessions to elevate team proficiency in best practices for **Ruby** development and cloud engineering."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized ***AWS*** for cloud infrastructure management, ensuring high availability and scalability of applications in alignment with best practices.\nDeveloped robust backend solutions in ***Ruby*** on Rails, focusing on performance optimization and maintainability for critical business applications.\nImplemented containerization strategies using ***Docker*** to streamline development workflows and application deployments, achieving a 30% reduction in deployment time.\nCollaborated with cross-functional teams using ***JavaScript*** frameworks to design and enhance user interfaces, resulting in improved user engagement metrics by over 25%.\nConducted data analysis and reporting using ***R*** and ***SAS***, providing actionable insights that drove product enhancements and marketing strategies, increasing user acquisition by 15%.\nAutomated infrastructure management processes with ***Chef***, enhancing system reliability and reducing configuration drift across production environments.\nIntegrated ***MS 365*** solutions to enhance collaboration among teams, achieving a 40% increase in productivity through efficient communication tools.\nParticipated in Agile development processes, contributing to sprint planning and retrospectives, which improved overall team performance metrics by 20%.\nLeveraged test-driven development (TDD) practices to maintain high code quality and reduce defect rates in deployed applications.\nAdopted best practices in security and performance monitoring, ensuring compliance with industry standards and enhancing application resilience."
    }
  ],
  "skills": "**Programming Languages:**\n\tRuby, JavaScript/TypeScript, Python\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, SAS, R, Chef, MS 365",
  "apply_company": "pharmtrace"
}