{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Full Stack Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Dynamic Full Stack Developer with 8 years of experience, proficient in **TypeScript**, **React**, **Next.js**, and **Node.js**. I leverage modern frameworks and tools to create high-performance applications, focusing on robust database solutions with **PostgreSQL**. My strong communication skills in English (C1 level) and Polish (C1 level or native) enhance collaboration in diverse teams and projects. I excel in the Software Development Lifecycle, demonstrating self-motivation and a positive attitude while fostering a willingness to learn and innovate. My expertise includes full-stack development with a tech stack that encompasses **React Native**, **Expo**, and cloud services on **Azure** and **AWS**, ensuring scalable and compliant solutions across varying sectors. Enthusiastic about building secure applications, I thrive in team environments while driving projects from concept through deployment.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript**, **React** (17-18), **Next.js**, and **Node.js** to architect and develop scalable full-stack solutions, ensuring adherence to the Software Development Lifecycle (SDLC).\nCollaborated effectively with cross-functional teams, demonstrating strong **communication skills** while sharing knowledge and promoting teamwork.\nImplemented data architecture using **PostgreSQL** for optimized data storage and querying in complex healthcare and financial systems, enhancing overall system efficiency by **30%**.\nDeveloped cross-platform mobile applications with **React Native** and **Expo**, achieving user-friendly experiences on both iOS and Android platforms, with seamless integration of state management solutions like Redux.\nContributed to CI/CD pipelines utilizing tools like **Fastlane** and **App Center**, ensuring consistent and automated testing, release management, and crash reporting, which reduced deployment time by **20%**.\nFacilitated the transition of monolithic applications to microservices architecture leveraging **Docker** and **Kubernetes** (AKS/EKS), resulting in increased system flexibility and scalability.\nDesigned and integrated advanced data visualization tools with **D3.js** and **Power BI Embedded**, providing key insights into fintech operations and transaction trends.\nEnhanced applications with AI capabilities, deploying machine learning models using tools like **scikit-learn** and **TensorFlow**, leading to improved financial predictions and health recommendations.\nEstablished effective testing strategies using **Jest** and **Cypress**, achieving full coverage for unit, integration, and end-to-end tests across both frontend and backend services, thus increasing overall code quality by **25%**.\nDeveloped business-critical features with a focus on user experience, utilizing agile methodologies to adapt and learn quickly in a rapidly changing environment, displaying a **self-motivated** approach with a strong desire for continuous learning."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript**, **React (18)**, **Next.js**, and **Node.js** to develop scalable full-stack applications, enhancing performance and user experience in financial systems.\nDesigned responsive front-end applications, leveraging **Redux Toolkit** and **Tailwind CSS** for dynamic user interfaces, improving customer engagement scores by **25%**.\nCollaborated on the Software Development Lifecycle, applying best practices in project management and agile methodologies to ensure timely product delivery while maintaining high-quality standards.\nEngaged in effective communication with stakeholders in fluent **English (C1 level)** and **Polish (C1 level or native)**, facilitating team collaboration and project alignment across cross-functional teams.\nImplemented a microservices architecture that increased system throughput by **40%**, allowing for seamless integration with **PostgreSQL** databases and external APIs for data retrieval and management.\nContributed to team efforts through effective teamwork and self-motivated work ethic, achieving project milestones ahead of schedules by an average of **15%**.\nPursued continuous learning to stay abreast of emerging technologies in the financial sector, demonstrating a positive attitude toward adapting and enhancing current skill sets."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** to develop and optimize robust, scalable applications in both backend and frontend for a high-traffic e-commerce platform, enhancing maintainability and developer efficiency.\nEngineered dynamic web interfaces with **React (18)** and **Next.js**, ensuring responsive and user-friendly designs while maintaining high accessibility standards (WCAG 2.1).\nImplemented server-side rendering capabilities and SEO optimization techniques in **Next.js** to improve page load speeds and search engine visibility, contributing to a **30% increase** in organic traffic.\nDeveloped RESTful APIs using **Node.js** (Express) for seamless integration between the frontend and backend, catering to over **10,000 daily users**.\nCollaborated with cross-functional teams to define project requirements and deliver updates through effective communication and teamwork, resulting in a **95% satisfaction rate** in stakeholder feedback.\nManaged data persistence and querying using **PostgreSQL**, ensuring efficient data management for **over 1 million** products and facilitating quick access to high-demand data.\nLeveraged agile methodologies throughout the **Software Development Lifecycle**, enhancing project transparency and adaptability to changes in requirements.\nImplemented and maintained version control systems to track changes and manage collaborative development effectively.\nCreated mobile applications using **React Native** and **Expo**, streamlining operations and allowing access to critical features for mobile users, contributing to a **20% increase** in mobile engagement.\nMaintained a positive attitude and a self-motivated approach, contributing to a collaborative and innovative work environment, fostering a culture of learning and growth within the team."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django, Node.js\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular, Next.js, React Native, Expo\n\n **API Technologies:** \n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:** \n\tAI & ML (MLflow, Airflow, Kubeflow), Communication Skills, Teamwork, Software Development Lifecycle, Self-motivated, Willingness to Learn, Positive Attitude, English (C1 level), Polish (C1 level or native), Authentication & Security (Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot)"
}