{
  "name": "Mariusz Jan Skobel",
  "role_name": "DevOps Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "DevOps Engineer with 10+ years of experience in automating and optimizing high-performance software development processes. Expertise in **CI/CD** using tools such as **GitLab**, **Jenkins**, and **Azure DevOps**, along with a strong background in **Infrastructure-as-Code** with **Terraform** and **Ansible**. Proficient in cloud computing platforms including **AWS**, **Azure**, and **GCP** for deploying and managing cloud-native applications. Skilled in programming languages such as **Python**, **JavaScript**, and **TypeScript**, along with scripting in **Bash** for automation tasks.\n\nExperienced in developing and implementing QA flows and test automation concepts, ensuring robust testing processes are integrated within DevOps practices. Known for collaboration and a proactive learning mindset that fosters team growth and continuous improvement. Proven ability to lead development initiatives that focus on intelligent automation and integrate AI/ML capabilities to enhance decision-making and analytics in enterprise solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "DevOps Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Utilized **Terraform** and **Ansible** to implement Infrastructure-as-Code solutions, automating deployment processes across **AWS**, **Azure**, and **GCP**, resulting in a **30%** reduction in provisioning time.\n• Built scalable CI/CD pipelines using **GitLab**, **Jenkins**, and **Azure DevOps**, incorporating automation for testing and deployment, increasing deployment frequency by **50%**.\n• Designed and maintained automation testing frameworks using **Python** and **JavaScript**, enforcing QA flows and test automation concepts, achieving a test coverage increase of **40%** across services.\n• Collaborated effectively with cross-functional teams to integrate **DevOps** best practices, promoting a proactive learning mindset among team members to enhance overall collaboration and efficiency.\n• Developed scripts in **Bash** and **Python** to streamline daily operations, contributing to improved productivity and reducing manual errors.\n• Simplified monitoring and alerting processes by implementing solutions on **AWS** and **Azure**, ensuring high availability and performance of applications, with uptime exceeding **99.9%**.\n• Engaged in continuous learning and proactive research on emerging **DevOps** tools and practices, fostering a culture of innovation and improvement in team operations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Terraform** and **Ansible** to automate infrastructure provisioning and configuration management, enhancing deployment speed and efficiency in cloud environments such as **Azure** and **AWS**.\nImplemented CI/CD pipelines using **GitLab**, **Jenkins**, and **Azure DevOps**, achieving a **40%** reduction in deployment times and increasing release frequency to **bi-weekly** updates.\nDeveloped script automation using **Bash** and **Python**, streamlining routine tasks and improving operational efficiency in managing cloud infrastructure and deployment workflows.\nCollaborated with software engineering teams to foster a culture of collaborative development and proactive learning, leading to improved integration of services and cross-team communication.\nDesigned and executed automation testing strategies, ensuring robust **QA flows** and adherence to test automation concepts, resulting in a **30%** increase in overall application reliability.\nMaintained version control of infrastructure as code using **Git**, facilitating smooth rollbacks and version tracking throughout the development process.\nPromoted a proactive learning mindset within the team, continuously exploring and adopting new tools and strategies to enhance DevOps practices and infrastructure management."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented Infrastructure-as-Code using **Terraform** and **Ansible** to automate and streamline deployment processes across **AWS**, **Azure**, and **GCP**, achieving a **40%** reduction in deployment times.\nDeveloped and maintained CI/CD pipelines using **GitLab** and **Jenkins**, ensuring optimized workflows and reducing error rates by **30%** in application deployments.\nUtilized **Python**, **Bash**, and **Go** scripts for automating configuration management and system monitoring, significantly improving operational efficiency.\nCollaborated with cross-functional teams to integrate **CI/CD** practices within QA flows, enhancing the overall quality assurance process and promoting a proactive learning mindset in the team.\nManaged source code versioning using **Git**, maintaining change logs and overseeing code reviews to ensure high code quality and collaborative development practices.\nDesigned and implemented automated testing frameworks focusing on test automation concepts, resulting in a **25%** increase in regression test coverage and reducing manual testing efforts.\nEnsured 24/7 application availability through proactive system monitoring and incident management protocols, maintaining service level objectives (SLOs).\nStreamlined cloud resource management to achieve cost savings of **15%** by optimizing usage of cloud services on **Azure** and **AWS** platforms.\nFacilitated continuous improvement through participation in retrospectives and knowledge-sharing sessions, promoting collaboration and agile best practices within the team."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript, Go\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Azure DevOps, CI/CD, Automation Testing, Git, GitLab\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose, Infrastructure-as-Code, GCP\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Collaboration, Proactive Learning Mindset"
}