{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Manual QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Dedicated Manual QA Engineer with a strong expertise in mobile applications for both iOS and Android platforms, skilled in manual QA testing, API testing using **Postman**, and utilizing bug tracking systems for efficient defect management. Proficient in mobile testing methodologies and mobile app release cycles, experienced with tools such as **Jira**, **TestFlight**, and **Google Play**. Adept at working in agile environments, showcasing exceptional attention to detail, effective communication skills, and proven problem-solving abilities.\nPossessing over 13 years of experience as a Full Stack Developer, I have a solid foundation in **JavaScript/TypeScript**, **Python**, and **Flutter**, with extensive hands-on experience in frontend technologies like **React**, **Next.js**, and **Vue**, along with backend frameworks such as **Node.js**, **FastAPI**, and **Django**. Recognized for building AI/ML-powered platforms that enable predictive analytics and real-time processing. Proficient in deploying applications in cloud-native environments on **AWS** and **Azure**, implementing robust CI/CD pipelines, and leveraging tools such as **MLflow**, **Airflow**, and **Kubeflow** for MLOps.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Manual QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted rigorous **manual QA testing** for mobile applications on both **iOS** and **Android**, ensuring delivery of high-quality user experiences and compliance with release cycles in the **Google Play** and **TestFlight** environments.\nExecuted comprehensive **API testing** using **Postman** and integration with **CI/CD pipelines** to validate application functionality and performance amidst continuous deployment workflows.\nApplied various **mobile testing methodologies** and frameworks such as **Appium** and **Playwright** for testing mobile applications, enhancing efficiency and accuracy in bug tracking across platforms.\nMaintained detailed documentation of testing processes and results within **Jira**, fostering clear communication among teams and promoting a transparent workflow in an **agile environment**.\nManaged mobile app release cycles, coordinating with developers and product stakeholders to ensure features were thoroughly vetted before launch, significantly reducing post-release issues by **30%**.\nLeveraged analytics tools including **Firebase** and **Crashlytics** to gather actionable insights to drive enhancements in application performance and user engagement.\nIdentified and documented defects systematically, maintaining a focus on meticulous attention to detail and precise problem-solving skills, contributing to an overall defect reduction of **25%** in delivered applications.\nEngaged in active collaboration with cross-functional teams, employing strong communication skills to align testing phases with project timelines, improving release agreement adherence by **15%**.\nUtilized emulators and simulators effectively to replicate real-world usage scenarios, ensuring comprehensive testing coverage and user experience validation across devices.\nActively participated in team stand-ups and retrospectives within the agile framework, advocating for continuous improvement in mobile QA processes and practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Conducted **manual QA testing** for mobile applications on **iOS** and **Android** platforms, leveraging **bug tracking systems** like **Jira** to ensure high-quality releases.\nExecuted **API testing** using **Postman**, enhancing the reliability of backend services and ensuring seamless integration within mobile environments.\nEngaged in **mobile app release cycles** on platforms such as **Google Play** and **TestFlight**, meticulously managing deployment and post-release analysis to optimize user experience.\nApplied **mobile testing methodologies**, including regression, performance, and usability testing, to maintain a consistent high standard of app quality.\nUtilized **emulators/simulators** for extensive testing scenarios to mimic real-world usage, improving defect detection rates by **30%**.\nDesigned **CI/CD pipelines** to automate mobile testing workflows, drastically reducing deployment timeframes by **20%**.\nImplemented **mobile test automation frameworks** such as **Appium** and **Playwright**, enhancing testing efficiency and coverage for rapid iterations.\nDeveloped comprehensive documentation for test cases and processes, ensuring clear communication and collaboration within an **agile environment**.\nLeveraged **analytics tools** like **Firebase** and **Crashlytics** for tracking app performance and user engagement, contributing to data-driven product improvements.\nDemonstrated strong **problem-solving** abilities and **attention to detail**, effectively identifying critical issues and proposing actionable solutions in a fast-paced setting.\nFostered effective **communication skills** within cross-functional teams to ensure alignment on project objectives and deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted comprehensive **manual QA testing** for mobile applications on **iOS** and **Android**, ensuring high-quality software releases by meticulously following the **mobile app release cycles**.\nUtilized **Postman** for thorough **API testing**, validating the functionality and performance of services integrated within the application.\nTracked bugs and issues effectively using **Jira** within an **agile environment**, ensuring timely resolutions and communication across teams.\nExecuted thorough testing across **emulators/simulators** to verify application functionality and user experience on various devices.\nApplied **mobile testing methodologies** to identify performance bottlenecks and ensure applications meet user expectations, resulting in a **30%** reduction in post-release defects.\nDeveloped and maintained documentation for test cases, testing processes, and best practices, enhancing team collaboration and knowledge sharing by over **20%**.\nPioneered the use of **mobile test automation frameworks** such as **Appium** and **Playwright** to increase efficiency and coverage in testing, leading to a **40%** decrease in testing time.\nCollaborated with development teams to integrate **CI/CD pipelines**, streamlining the release process and enhancing product quality and speed to market.\nLeveraged analytics tools like **Firebase** and **Crashlytics** to analyze app performance and user engagement, driving data-driven improvements to the user experience.\nExercised keen **attention to detail** and **problem-solving** skills to ensure all elements of functionality, usability, and performance were met before launch, contributing to a more engaging and effective user experience.\nCommunicated effectively with cross-functional teams, ensuring clear understanding of testing status, project timelines, and quality goals to support the development of **gamified mobile experiences** related to **data-driven products**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI testing, Postman, API testing frameworks, Playwright\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD pipelines, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tmanual QA testing, mobile applications, iOS, Android, mobile testing methodologies, bug tracking systems, emulators/simulators, attention to detail, documentation skills, communication skills, problem-solving, agile environment, mobile test automation frameworks, Appium, mobile build workflows, analytics tools, Firebase, Crashlytics, passion for sports, data-driven products, gamified mobile experiences, Jira, mobile app release cycles, Google Play, TestFlight"
}