{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Staff Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven Staff Software Engineer with 13+ years of experience in **data analysis** and delivering high-performance applications, particularly within the healthcare and financial industries. Skilled in **AI**, and **machine learning**, leveraging advanced technologies to develop innovative solutions. Proven expertise in **collaboration** and **mentorship** to foster high-performing teams dedicated to **product feature development** and aligning technology with business strategy.\n\nProficient in **Java** and adept in **JavaScript/TypeScript**, **Python**, and **Flutter** for both frontend and backend development, using frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms for predictive analytics, automation, and real-time processing. Skilled in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and CI/CD pipelines.\n\nStrong background in compliance-driven development, ensuring alignment with HIPAA, FHIR, PCI DSS, and SOC 2 standards, while proficient in MLOps practices, including model training, serving, and orchestration with tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Staff Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Java** to enhance backend services, ensuring robust performance and scalability across healthcare and fintech platforms.\nLeveraged AI and **machine learning** models for advanced data analysis and predictive insights, demonstrating strong analytical abilities to drive product feature development.\nCollaborated effectively with cross-functional teams, providing mentorship and fostering a culture of collaboration to streamline development processes and align on business strategy.\nDesigned data-driven solutions using **Amplitude** and **Looker** for real-time analytics, empowering stakeholders with insights gathered from data analysis.\nSupported documentation and business strategy initiatives by utilizing **Excel** for data manipulation and reporting, ensuring clarity in project deliverables and objectives.\nMaintained a strong focus on product feature development, coordinating with teams to align software capabilities with business goals and customer needs.\n\nAchievements:\n- Delivered high-impact features leading to a **30%** increase in user engagement and satisfaction scores in <6 months.\n- Championed a successful mentorship program that onboarded **10 new developers** over **12 months**.\n- Implemented data analysis strategies that reduced project delivery times by **15%** creating efficiencies in team collaboration."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Java** to support product feature development, driving innovation and enhancing user experience across financial applications.\nImplemented data analysis strategies using **Amplitude** and **Looker** to identify key business insights and inform decision-making processes, resulting in a **20%** improvement in user engagement metrics.\nCollaborated with cross-functional teams to align business strategies with technical implementation, fostering a unified approach to product development.\nProvided mentorship to junior developers, enhancing team skills and cohesion, which contributed to the successful delivery of projects ahead of schedule by **15%**.\nIntegrated machine learning algorithms into financial systems for improved user outcomes, leveraging expertise in **AI** and **machine learning** to enhance analytics capabilities.\nEngaged in rigorous data analysis and Excel reporting to support financial assessments and operational decisions, maintaining data accuracy and integrity.\nFacilitated collaboration initiatives, ensuring the alignment of development roadmaps with business objectives, which streamlined workflows and reduced project timelines by **10%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Java** to develop scalable e-commerce solutions, enhancing system performance and reliability across multiple platforms.\nCollaborated with cross-functional teams to gather requirements and ensure alignment between business strategy and product feature development, resulting in a 25% improvement in project delivery times.\nMentored junior developers in **machine learning** techniques and data analysis, fostering a collaborative and innovative work environment that enhances skill sets and productivity.\nEmployed **AI** and **Amplitude** analytics for data-driven decision making, leading to the implementation of targeted features that improved user engagement by **15%**.\nImplemented data visualization tools such as **Looker** to translate complex data sets into actionable insights, supporting strategic business initiatives and enhancing stakeholder presentations.\nConducted in-depth data analysis using **Excel** to identify trends and patterns, enabling informed business strategy planning and execution.\nDesigned and executed product feature development sprints, actively participating in planning meetings and continuous feedback loops, achieving a **30%** reduction in feature release cycles.\nPromoted a culture of collaboration across teams to improve processes and deliver high-quality software solutions, resulting in enhanced team performance and project outcomes."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Java, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tAI, Machine Learning, MLflow, Airflow, Kubeflow, Amplitude, Looker, Excel, Data Analysis, Collaboration, Mentorship, Product Feature Development, Business Strategy"
}