{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in the Software Development Lifecycle, specializing in delivering high-performance applications in the healthcare and financial sectors. Proficient in **JavaScript**, **TypeScript**, and **Python**, with hands-on expertise in both frontend and backend development utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in Continuous Integration practices and Source Control methodologies.\n\nDemonstrated ability to implement stringent Data Security measures while aligning development processes with regulatory standards. Strong analytical skills paired with technical documentation proficiency, ensuring clarity and transparency throughout the software lifecycle. A customer-focused approach to software solutions, supporting effective communication and collaboration across teams.\n\nExperienced in building AI/ML-powered platforms for predictive analytics and real-time processing, and proficient in deploying cloud-native systems using **AWS** and **Azure**. Proven track record in developing microservices, event-driven architectures, and CI/CD pipelines, enhancing operational efficiency and responsiveness.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed software solutions leveraging **C**, **C++**, and **Scripting** languages within the Software Development Lifecycle to enhance productivity and meet project deadlines.\n- Implemented Continuous Integration practices to streamline code deployment and maintain high-quality standards across all software projects.\n- Established strong Data Security measures throughout the development process to protect sensitive customer information and ensure compliance with industry regulations.\n- Authored comprehensive Technical Documentation to facilitate knowledge sharing and support team collaboration.\n- Exhibited Analytical Skills to troubleshoot complex software issues and optimize performance efficiently.\n- Provided exceptional Customer Service by collaborating with stakeholders to gather requirements and deliver user-friendly software solutions.\n- Designed and built full-stack platforms for healthcare and fintech using Python (FastAPI), TypeScript, and Node.js, paired with modern front-end frameworks like React (17-18), Next.js, and Vue 3, ensuring full compliance with HIPAA, FHIR, GDPR, PCI DSS, and SOX.\n- Delivered mobile applications for iOS and Android using Flutter and React Native, implementing native modules and managing state with Provider and Redux to support secure, real-time user interactions.\n- Created CI/CD pipelines tailored for mobile using Fastlane and App Center, incorporating test automation, release workflows, and crash analytics with Firebase Crashlytics and Sentry.\n- Led the transformation of legacy systems into microservices architectures, leveraging Docker, Kubernetes (AKS/EKS), and serverless functions via AWS Lambda and Azure Functions for fault-tolerant, scalable deployments.\n- Built and maintained data infrastructure using PostgreSQL, MongoDB, Redis, and GraphQL, designed to support heavy data ingestion and real-time analytics for both health and finance domains.\n- Deployed ML models for risk scoring, fraud detection, and document classification using scikit-learn, PyTorch, and TensorFlow, with backend inference integrated into live systems.\n- Implemented MLOps workflows using MLflow, DVC, and Airflow, managing model training, validation, and deployment pipelines across development and production.\n- Integrated intelligent features into frontend applications, such as personalized dashboards, predictive health alerts, and financial summaries, powered by models hosted on Azure ML and AWS Sagemaker.\n- Built DevOps pipelines using GitHub Actions, CircleCI, and Azure DevOps, with full test automation, linting, security checks, and multi-environment deployment workflows.\n- Developed advanced data visualization tools with D3.js, Chart.js, and Power BI Embedded, enabling real-time analysis of financial activity, fraud trends, and operational KPIs.\n- Collaborated closely with ML teams to deploy NLP models (spaCy, Hugging Face Transformers) for document parsing and anomaly detection, exposed through secured REST APIs.\n- Defined and enforced robust testing strategies across the stack using Jest, Cypress, Postman, and PyTest to cover unit, integration, E2E, and contract-level tests.\n- Integrated search capabilities with Azure Cognitive Search and Elasticsearch, supporting fast and flexible querying across structured and unstructured health and financial datasets."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized analytical skills to modernize core financial platforms by migrating to microservices architecture with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), improving scalability and performance for high-volume transaction systems by **30%**.\nEmployed software development lifecycle best practices while building interactive front-end applications using **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels, resulting in a **25%** increase in user engagement.\nImplemented source control strategies to deliver real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies.\nApplied continuous integration practices to design and deploy a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance with an **uptime of 99.9%**.\nDeveloped ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing, successfully processing over **5 million** records daily.\nCreated and deployed machine learning models for fraud detection utilizing **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns, achieving a **reduction in fraud rates by 15%**.\nDesigned ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services efficiently."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Demonstrated strong **Software Development Lifecycle** expertise by leading the design and optimization of backend services in high-traffic environments, resulting in a **30%** improvement in system performance and scalability.\nUtilized **Continuous Integration** practices to streamline development workflows, improving deployment frequency by **50%** and minimizing rollout errors across production environments.\nApplied advanced **Technical Documentation** skills to create clear and comprehensive guides for software architecture and service integrations, facilitating knowledge transfer and onboarding for new team members.\nExhibited proficiency in **Scripting** for automating repetitive tasks and optimizing workflows, reducing manual intervention time by **25%**.\nEngaged in **Source Control** management, using tools like Git to ensure version control and collaborative coding practices, thereby enhancing team workflow.\nApplied critical **Analytical Skills** in troubleshooting complex issues within the system infrastructure, reducing downtime by **40%** through swift and effective problem resolution.\nEnhanced **Data Security** measures through the implementation of RBAC and OAuth 2.0, ensuring all customer and admin interactions are secure and compliant with GDPR regulations.\nDelivered exceptional **Customer Service** by collaborating with stakeholders to gather requirements and address user feedback effectively during the development cycles."
    }
  ],
  "skills": "**Programming Languages:**\n\tAssembler, C, C++, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n**Other:**\n\tScripting, Software Development Lifecycle, Source Control, Continuous Integration, Data Security, Technical Documentation, Analytical Skills, Customer Service",
  "apply_company": "Fujitsu"
}