{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Senior Software Engineer with over 9 years of experience in backend development and distributed systems. Proficient in **GoLang**, **Kubernetes**, **AWS**, **GCP**, **Azure**, **PostgreSQL**, **GCP Pub/Sub**, **gRPC**, and **REST**, with a strong focus on cloud platforms and microservices architecture. Demonstrated expertise in CI/CD practices using **GitLab CI** and **ArgoCD**, along with performance-tuning skills that enhance application efficiency. Highly adept at debugging and optimization, with a proven ability to deliver complex solutions and streamline development processes. Excellent collaboration and problem-solving skills, complemented by strong English communication, adaptability, and a proactive approach to project leadership.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and optimized backend services using **GoLang**, implementing distributed systems to enhance scalability and performance.\n• Deployed and managed containerized applications with **Kubernetes**, ensuring high availability and resource efficiency.\n• Designed solutions on **AWS** and **GCP**, leveraging cloud services for enhanced data storage and processing.\n• Utilized **PostgreSQL** for relational database management, optimizing query performance and ensuring data integrity.\n• Integrated **GCP Pub/Sub** for reliable message-driven communication within microservices, improving event-driven architecture.\n• Implemented **gRPC** for efficient service-to-service communication, reducing latency by up to 30%.\n• Developed and maintained RESTful APIs to facilitate interoperability between services, enhancing system modularity.\n• Monitored application performance using **Prometheus**, **Grafana**, and **Loki**, proactively identifying and troubleshooting issues.\n• Established CI/CD pipelines using **GitLab CI** and **ArgoCD**, reducing deployment time by **40%** and improving code quality.\n• Engaged in collaborative problem-solving sessions, leveraging adaptability and proactivity to address complex technical challenges.\n• Applied debugging techniques to pinpoint performance bottlenecks, achieving overall application performance improvements by **20%**.\n• Documented technical processes and solutions in English, ensuring clear communication among team members."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **GoLang** for backend development of distributed systems, improving application performance by **20%**.\nDeployed applications on **AWS**, **GCP**, and **Azure**, ensuring high availability and scalability of services across cloud platforms.\nImplemented **Kubernetes** for container orchestration, enhancing deployment efficiency by **30%** through automated scaling and management.\nDeveloped efficient and optimized REST APIs to interface with **PostgreSQL** databases, achieving a **15%** reduction in response time for data retrieval.\nEmployed **cloud object storage** solutions to manage data effectively, facilitating secure and efficient data access and storage.\nIntegrated **GCP Pub/Sub** for real-time messaging and event-driven architectures, streamlining data flow across systems.\nDesigned and managed CI/CD pipelines using **GitLab CI** and **ArgoCD**, which successfully decreased deployment errors and improved production releases by **25%**.\nUtilized **Prometheus**, **Grafana**, and **Loki** for logging, monitoring, and observability, enhancing system reliability.\nCollaborated with cross-functional teams to gather system requirements, fostering improved communication and adaptability within the project scope.\nConducted performance-tuning and optimization strategies across various layers of the system, resulting in a **40%** increase in system throughput.\nMentored junior developers in **DevOps practices**, improving overall team efficiency and knowledge sharing through regular code reviews and sessions."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "- Developed and optimized distributed systems using **GoLang**, enhancing backend performance and scalability.\n- Designed and implemented CI/CD pipelines with **GitLab CI** and **ArgoCD**, reducing deployment times by **30%**.\n- Utilized **AWS** and **GCP** for cloud infrastructure management, improving system resilience and reducing downtime by **15%**.\n- Implemented **REST** APIs to facilitate communication between microservices, ensuring seamless integration.\n- Led performance-tuning initiatives using **Prometheus** and **Grafana**, achieving a **25%** reduction in application response times.\n- Collaborated with teams on debugging and optimization of existing applications, leading to a **40%** decrease in bug-related downtime.\n- Worked closely with **Kubernetes** for container orchestration, streamlining application deployment and scaling.\n- Engaged in knowledge transfer sessions improving English communication among team members.\n- Participated in daily standups and code reviews to maintain alignment with project goals and coding standards.\n- Delivered comprehensive technical documentation and user guides for internal systems, facilitating better understanding across teams."
    }
  ],
  "skills": "Programming Languages:\n\tGoLang, HTML, CSS, JavaScript, TypeScript, Python\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks:**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL, gRPC\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure, GCP, cloud platforms\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tCI/CD pipelines, Git, GitHub, GitLab CI, Kubernetes, ArgoCD, Prometheus, Grafana, Loki, Tempo, cloud object storage, CI/CD, DevOps practices\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n**Other:**\n\tUX/UI Design, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain, Solidity, Ether.js, Web3.js, Ethereum, Redis, Apache Kafka, RabbitMQ, debugging, optimization, performance-tuning, problem-solving, collaboration, adaptability, proactivity, English communication"
}