{
  "name": "Tomasz Lee",
  "role_name": "Senior Integration Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Integration Engineer with 9+ years of experience in problem solving and debugging complex applications. Proficient in **JavaScript** and familiar with operating systems and OS abstraction, coupled with advanced knowledge in **Crash Reporting**, **Sandboxing**, and **Hardening** techniques. Demonstrated ability to collaborate remotely and lead development projects efficiently. Adept at leveraging modern technologies to deliver robust solutions while streamlining development processes using **ReactJS**, **NextJS**, **.NET**, and **C#**. Committed to optimizing performance and implementing innovative strategies in system integration.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Integration Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Leveraged **JavaScript** expertise to integrate intricate user interfaces in a web-based customer management platform, enhancing interactivity and user satisfaction by **25%**.\n• Applied advanced **problem-solving** techniques to spearhead the design and development of a system using **.NET 7**, **ReactJS**, and **Next.js**.\n• Developed robust debugging and crash reporting frameworks to enhance system reliability, effectively identifying and resolving issues.\n• Collaborated remotely with cross-functional teams to ensure a seamless integration of **microservices architecture** utilizing **.NET Core** for scalability and maintainability.\n• Employed **C++** and **Rust** technologies where applicable to optimize performance and security features, leading to enhanced application robustness.\n• Integrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, significantly improving system resilience and throughput metrics.\n• Utilized **Redis** for caching to mitigate database load, improving response times by **35%** through effective OS abstraction techniques.\n• Developed RESTful APIs with **.NET**, seamlessly connecting to a **MongoDB** database for efficient data access across various services.\n• Automated deployment processes using **Azure DevOps**, reducing deployment time by **40%** through CI/CD pipeline implementation.\n• Optimized **MSSQL** database queries and indexing, achieving a **20%** reduction in average query execution time.\n• Engaged in **sandboxing** and **hardening** strategies to secure application components, implementing JWT-based authentication and authorization.\n• Designed interactive and visually appealing reports using **D3.js** and **Three.js**, improving analytical insights and user engagement."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **JavaScript** to integrate various components and improve application performance, resulting in a **30%** reduction in debugging time.\nEmployed **crash reporting** tools to proactively identify and resolve issues in production, significantly enhancing system stability.\nImplemented **C++** and **Rust** for performance-critical modules, which improved processing speed by **20%**.\nDeveloped and maintained robust **operating systems** integration strategies, ensuring seamless interaction between applications and the underlying OS.\nImplemented **OS abstraction** techniques to ensure cross-platform compatibility, enhancing application reach to multiple operating systems.\nDesigned secure environments through effective **sandboxing** practices, reducing vulnerabilities by **15%**.\nApplied **hardening** techniques during deployment phases, leading to a more secure application environment.\nProduced high-quality documentation and engaging technical content to facilitate effective **remote collaboration**.\nEngaged in problem-solving sessions to address complex challenges, fostering a collaborative team environment and promoting knowledge sharing.\nProvided mentorship and conducted code reviews for junior developers, leading to improved coding standards and practices."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **JavaScript** (specifically **Angular** and **Vue.js**) to enhance frontend capabilities, increasing user engagement metrics by **30%**.\nLed debugging sessions to troubleshoot integration issues, applying strong **problem-solving** skills to identify and resolve critical bugs, which resulted in a **25%** reduction in bug-related downtime.\nImplemented robust **C++** and **Rust** components for efficient OS abstraction, contributing to overall system stability and performance improvements during a project that reached **99.9%** uptime.\nConducted comprehensive crash reporting analysis to identify underlying issues, enhancing the reliability of integrated applications in diverse operating system environments.\nCollaborated with remote teams to facilitate seamless integrations, employing effective **remote collaboration** techniques and tools to ensure successful project delivery across time zones.\nDeveloped hardening strategies to secure integration points within various operating systems, significantly minimizing vulnerabilities and ensuring compliance with industry standards.\nParticipated in sandboxing exercises to simulate environment conditions, which improved application security and stability during critical updates.\nProvided mentorship to junior engineers on debugging techniques, fostering an environment of knowledge sharing and personal growth within the team.\nDocumented technical processes and integration methodologies, enhancing team resources and accessibility for future projects."
    }
  ],
  "skills": " **Programming Languages** \n\t C++, Rust, JavaScript, TypeScript, Python \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices \n\n **Frontend Frameworks** \n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL \n\n **Serverless and Cloud Functions** \n\t AWS, Azure \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB \n\n **DevOps** \n\t CI/CD pipelines \n\n **Cloud & Infrastructure** \n\t \n\n **Other** \n\t UX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Problem Solving, Debugging, Remote Collaboration, Crash Reporting, Operating Systems, OS Abstraction, Sandboxing, Hardening",
  "apply_company": "Mozilla"
}