{
  "name": "Tomasz Lee",
  "role_name": "Senior Superintendent Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented Senior Superintendent Engineer with a strong foundation in **Mechanical Engineering** and **Mechatronic Engineering**, coupled with over 9 years of experience in **Project Management**, **Troubleshooting**, and **Root Cause Analysis**. Demonstrated expertise in **Field Maintenance Procedures** and **Engine Automation**, ensuring adherence to **HSE Standards** while delivering exceptional **Customer Support**. Skilled in technical reporting and effective usage of **Microsoft Office**. Known for strong organizational skills and adaptability, successfully leading teams in complex troubleshooting scenarios, optimizing processes, and driving continuous improvement.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Superintendent Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Led effective **project management** initiatives for engineering projects, ensuring adherence to **HSE standards** and enhancing team collaboration by 30%.\nConducted comprehensive **root cause analysis** and troubleshooting to resolve engineering issues, achieving a 20% reduction in downtime during field maintenance procedures.\nManaged the implementation of **engine automation** technologies, leading to a 15% improvement in system efficiency.\nProvided customer support by delivering technical reporting and documentation, which facilitated client understanding of maintenance processes and recommendations.\nUtilized **Microsoft Office** tools for creating detailed project reports and presentations, enhancing communication within project teams.\nDeveloped and implemented **organized maintenance schedules**, streamlining operations and ensuring consistent adherence to **field maintenance procedures**.\nCollaborated with cross-functional teams to optimize workflows and improve organizational skills, effectively managing multiple projects simultaneously.\nFacilitated training programs for new engineering techniques, promoting adaptability among team members and improving skill sets by 25%.\nMaintained networking relationships with vendors and engineering partners to foster collaboration and innovation in engineering practices."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Managed project workflows and timelines to ensure compliance with **HSE Standards**, exhibiting strong **Project Management** abilities.\nUtilized **Technical Reporting** to provide detailed updates on project status to stakeholders, enhancing transparency and communication.\nTroubleshot engineering issues and performed **Root Cause Analysis**, leading to a 20% reduction in downtime during maintenance procedures.\nLed the implementation of **Field Maintenance Procedures** which improved operational efficiency by 15%.\nAssured compliance with **Mechatronic Engineering** principles to enhance engine automation systems, resulting in a 30% increase in reliability metrics.\nConducted regular engine maintenance checks, ensuring adherence to precise **Mechanical Engineering** standards, which decreased failure rates by 25%.\nProvided exceptional **Customer Support** through training sessions and technical guidance, enhancing client satisfaction scores by 40%.\nDemonstrated strong **Organizational Skills** by managing cross-functional teams, effectively facilitating project completion within a defined timeframe.\nUtilized **Microsoft Office** tools for developing project documentation and reports, improving team communication efficiency by 35%.\nAdapted quickly to changing project requirements and technological advancements, ensuring continuous improvement in engineering processes."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Led project management initiatives in the development of mechanical and mechatronic systems, driving project completion rates to **95%**.\n• Conducted root cause analysis and troubleshooting for engineering challenges, resolving issues with a **98%** success rate.\n• Ensured adherence to HSE standards during the execution of field maintenance procedures, maintaining **100%** compliance on all projects.\n• Provided exceptional customer support and technical reporting, resulting in a **30%** increase in client satisfaction scores.\n• Utilized **Microsoft Office** tools for comprehensive project presentations and documentation, enhancing organizational skills across teams.\n• Coordinated with engineering teams to implement engine automation processes, reducing operational downtime by **15%**.\n• Developed and maintained effective communication strategies to enhance adaptability within cross-functional teams, boosting efficiency.\n• Monitored networking setups and configurations to support engineering projects, optimizing connectivity.\n• Delivered technical training and support for engineers in field maintenance procedures, contributing to ongoing professional development."
    }
  ],
  "skills": " **Programming Languages** \n\tJavaScript, TypeScript, Python, C#, Solidity\n\n **Backend Frameworks** \n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks** \n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies** \n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions** \n\t\n\n **Databases** \n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps** \n\tAWS, Azure, CI/CD pipelines\n\n **Cloud & Infrastructure** \n\t\n\n **Other** \n\tTesting Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, UX/UI Design, Git, GitHub, Organizational Skills, Adaptability, Mechanical Engineering, Mechatronic Engineering, Engine Maintenance, Project Management, Troubleshooting, Root Cause Analysis, Field Maintenance Procedures, Engine Automation, HSE Standards, Customer Support, Technical Reporting, Microsoft Office, Networking",
  "apply_company": "Everllence"
}