{
  "name": "Patryk Zaslawski",
  "role_name": "Golang Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "With over 8 years of software engineering experience, I am a proficient Golang Engineer skilled in **Golang**, **Kubernetes**, **OpenStack**, and **container orchestration**. I excel at building and maintaining scalable applications utilizing **CI/CD pipelines**, **monitoring** tools like **Prometheus** and **Grafana**, and implementing **load balancing** strategies for enhanced performance. My background in Agile methodologies drives my ability to deliver efficient solutions in collaborative environments. I also bring valuable experience in **Terraform**, **OpenShift**, and **Helm**, automating infrastructure provisioning and deployment processes. Previously, I have designed secure, high-performance Python applications using **FastAPI**, **Django**, and **Flask**, along with a strong command of frontend frameworks including **Angular**, **Vue**, **React**, and **Next.js**. Additionally, I have expertise in database optimization with **PostgreSQL**, **MySQL**, and **MongoDB**, always prioritizing system reliability and efficiency.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Golang Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **Golang** for developing scalable and efficient backend services, ensuring high performance in cloud-native applications.\nImplemented container orchestration using **Kubernetes**, managing deployments, scaling, and operations to optimize resource use and availability.\nDesigned and maintained **CI/CD pipelines** for streamlined deployments, enhancing development workflows and reducing time-to-market by **30%**.\nIntegrated **Prometheus** and **Grafana** for real-time monitoring and alerting of application performance, significantly improving response times and uptime.\nExecuted **Terraform** scripts for infrastructure as code, automating resource provisioning and eliminating manual configuration errors across multiple environments.\nManaged network configurations and load balancing strategies within **OpenStack** environments, optimizing service delivery and fault tolerance for user applications.\nLed and participated in Agile methodologies to improve team collaboration and project management, resulting in a **25%** increase in project delivery rate.\nSpearheaded the adoption of event-driven architectures, leveraging **Kafka** for efficient asynchronous communication between distributed services.\nDeveloped and deployed applications utilizing **Helm** to package Kubernetes applications, streamlining deployment processes and version control.\nEnhanced application resilience by implementing robust monitoring and logging solutions using **Prometheus** and **Grafana**, improving incident response times by **40%**.\nBuilt, tested, and deployed microservices using **Go** (Golang) in a **Kubernetes** environment, ensuring high availability and scalability across applications.\nMentored team members in **Golang** best practices and container orchestration techniques, fostering a culture of continuous learning and improvement.\nIntegrated third-party services and tools for enhanced functionality and performance, ensuring seamless interactions across platforms.\nConducted performance benchmarking and optimization tasks for applications written in **Golang**, achieving a **20%** reduction in latency.\nCollaborated cross-functionally with stakeholders to define project requirements and deliver solutions that meet business objectives effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Developed and maintained high-performance applications using **Golang**, ensuring adherence to best practices in software development and design patterns.\n- Designed and implemented **CI/CD pipelines** using tools like **GitHub Actions** and **Azure DevOps** for efficient deployment processes, leading to a **30% reduction** in deployment time.\n- Managed and orchestrated containerized applications using **Kubernetes** to ensure scalability and availability, successfully deploying over **50 microservices** in the cluster environment.\n- Implemented monitoring solutions using **Prometheus** and **Grafana** to track application performance and health metrics, enhancing system reliability by **25%**.\n- Designed network architectures incorporating **load balancing** strategies to optimize resource utilization and enhance application performance in a cloud environment.\n- Developed infrastructure as code (IaC) configurations with **Terraform** to automate the provisioning of cloud resources, significantly reducing setup time to less than **1 hour** per environment.\n- Worked with **OpenShift** for container orchestration, ensuring compliance with industry standards and facilitating easy application scaling.\n- Collaborated in Agile teams, participating in **sprint planning**, reviews, and retrospectives to deliver high-quality software within deadlines.\n- Developed custom Helm charts to package applications for deployment on Kubernetes, achieving a streamlined deployment process with minimal manual updates.\n- Contributed to knowledge-sharing sessions on **Gophercloud** and **OpenStack** to foster team understanding of cloud management and orchestration principles.\n- Assisted in infrastructure monitoring and alerting system using built-in tools resulting in proactive incident resolution and improved uptime metrics by **15%**.\n- Conducted training sessions on **container orchestration** and effective deployment strategies to enhance team capabilities in handling complex applications."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Developed and maintained scalable applications using **Golang**, leading initiatives in **container orchestration** with **Kubernetes** to ensure seamless deployments across cloud environments.\nUtilized **Terraform** for infrastructure as code, managing and provisioning cloud resources effectively to support application deployments with **OpenStack**.\nImplemented **CI/CD pipelines** to automate the build, testing, and deployment processes, enhancing the software development lifecycle efficiency by reducing deployment time by **50%**.\nLeveraged **Prometheus** and **Grafana** for monitoring system performance and health, ensuring applications are operating optimally, and setting up automated alerting mechanisms to preemptively address issues.\nEmployed **Agile methodologies** to manage project workflows and ensure timely deliverables, participating in daily stand-ups and sprint planning with the development team.\nConducted load balancing and networking solutions, improving application response times and achieving a **30%** increase in system reliability.\nIntegrated robust logging and monitoring solutions in Golang applications, enabling real-time visibility into system health and facilitating faster debugging.\nCollaborated with frontend developers to create seamless user experiences, enhancing applications' usability and accessibility across devices, focusing on mobile-first designs.\nOptimized existing workflows and services, refactoring code in **Golang** to improve performance and maintenance, cutting down technical debt substantially.\nImplemented Helm charts for managing Kubernetes applications, simplifying deployment and scaling processes of services within the cluster.\nExecuted performance testing using tools like Apache JMeter and **k6**, simulating high-traffic conditions and ensuring the applications can handle peak loads.\nParticipated in code reviews and architecture discussions to maintain code quality and streamline development processes, fostering a culture of continuous improvement."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython (FastAPI, Django, Flask), Golang\n\n**Backend Frameworks:**\n\tSpring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD pipelines, Helm, OpenShift, Prometheus, Grafana\n\n**Cloud & Infrastructure:**\n\tOpenStack, Gophercloud, Terraform, container orchestration, networking, load balancing, monitoring\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile methodologies"
}