{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Marketing Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior Marketing Engineer with 8 years of experience in leveraging **JavaScript**, **Python**, and **Node.js** to create high-performance marketing solutions. Proficient in using tools such as **Customer.io**, **HubSpot**, **Zapier**, **Segment**, **PostHog**, **Google Tag Manager**, **Mixpanel**, **GA4**, and **Looker Studio** to analyze and optimize user engagement and conversion rates. Skilled in **HTML** and **CSS** for crafting responsive web pages with technologies like **Webflow** and **Unbounce**. \n\nStrong background in integrating AI technologies such as **OpenAI**, **LangChain**, **CrewAI**, **AutoGen**, and **Claude** to enhance automation and personalization in marketing strategies. Experienced in handling data with advanced tools including **Weaviate**, **Pinecone**, and **Chroma**, coupled with a robust understanding of REST APIs for seamless data integration. \n\nEffectively leads projects with proven capabilities in CI/CD practices, microservices architecture, and event-driven systems. I have developed comprehensive machine learning workflows, including pipelines, model serving, and MLOps using tools like **MLflow**, **Airflow**, and **Kubeflow**. Focused on delivering solutions that elevate customer experience while ensuring compliance with industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Marketing Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Node.js** to develop and implement solutions that leverage customer engagement tools such as **Customer.io**, **HubSpot**, and **Segment** for effective marketing strategies.\nCollaborated with marketing teams to integrate analytics platforms including **Google Tag Manager**, **Mixpanel**, and **GA4** into web applications, enhancing data-driven decision-making processes.\nImplemented automation workflows using **Make.com** and **Zapier**, optimizing marketing processes for improved efficiency across digital platforms.\nDesigned and developed responsive marketing landing pages using **Webflow**, **Unbounce**, **HTML**, **CSS**, and **JavaScript**, improving customer conversion rates by **25%**.\nLed the integration of advanced analytics into marketing campaigns, employing tools like **PostHog** for user insights and A/B testing.\nCollaborated closely with data teams to create insightful dashboards and reports using **Looker Studio**, allowing real-time tracking of campaign performance and customer engagement metrics.\nEmployed machine learning approaches to enhance marketing strategies, integrating AI models powered by **OpenAI**, **Claude**, and **Google Gemini** into user engagement initiatives, resulting in a **30%** increase in user interaction.\nDeveloped a seamless REST API framework to connect backend services with various marketing tools, ensuring reliable data flow across systems.\nCreated, tested, and maintained versioned Git repositories to manage marketing engineering assets and ensure deployment reliability.\nAdopted a user-centric approach to feature development, utilizing tools such as **LangChain**, **CrewAI**, and **Semantic Kernel** for optimizing customer engagements and interactions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Customer.io**, **HubSpot**, and **Segment** to create and manage targeted marketing campaigns, enhancing customer engagement and driving a **25%** increase in conversion rates.\nImplemented **Zapier** and **Make.com** to automate workflows, reducing manual tasks by **30%** and improving data accuracy across systems.\nDeveloped comprehensive analytics dashboards using **Google Tag Manager**, **PostHog**, and **Mixpanel**, enabling data-driven decisions that increased website performance metrics by **40%**.\nDesigned and executed landing pages and marketing funnels using **Webflow** and **Unbounce**, resulting in a **20%** uplift in lead generation through optimized user experiences.\nCollaborated closely with cross-functional teams to integrate **REST API** services and enhance CRM systems, improving the flow of customer data and insights.\nWrote and optimized **HTML**, **CSS**, and **JavaScript** for dynamic digital marketing content, ensuring mobile-responsive designs that improved user engagement.\nLeveraged advanced analytics tools, including **GA4** and **Looker Studio**, to assess and report on marketing campaign performance, driving continuous improvement strategies.\nEmployed AI technologies such as **OpenAI** and **Claude** to automate content creation and optimize marketing materials based on customer preferences and behavior.\nUtilized Python and Node.js for backend data processing and integration into marketing systems, facilitating real-time data updates and responsiveness to market changes.\nVersioned and controlled project code using **Git**, maintaining high standards in project manageability and team collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **Node.js** to design and optimize backend services for marketing automation, integrating tools like **Zapier**, **HubSpot**, and **Customer.io** for streamlined workflows and enhanced customer engagement.\nDeveloped and maintained real-time analytics dashboards using **Google Tag Manager**, **Mixpanel**, and **GA4**, tracking user interactions and campaign performance for data-driven decision-making on a **weekly** basis.\nEngineered responsive landing pages and marketing websites utilizing **Webflow** and **Unbounce**, adhering to best practices in **HTML** and **CSS**, increasing user acquisition by up to **30%**.\nIntegrated various third-party systems like **Segment** and **PostHog** to centralize user data and enable targeted marketing campaigns based on real-time behavioral insights.\nApplied advanced AI technologies such as **LangChain**, **OpenAI**, and **Claude** to automate content generation and optimize advertising strategies, improving conversion rates by over **25%**.\nImplemented RESTful APIs to connect disparate systems and ensure efficient data exchange between marketing tools and analytics platforms, driving operational efficiency.\nCollaborated with cross-functional teams to establish data governance protocols, utilizing **Git** for version control and documentation, ensuring compliance with evolving data protection regulations.\nUtilized advanced visualization tools like **Looker Studio** to create insightful reports for stakeholders, enabling performance reviews and strategy adjustments every **quarter**.\nEnhanced user engagement metrics by developing interactive web applications with **JavaScript** frameworks, ensuring seamless integration with existing marketing technologies.\nConducted A/B testing and feature flag implementations to refine user experiences and maximize ROI on advertising spend, utilizing tools like **Google Gemini** and **Pinecone**."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS, Webflow, Unbounce\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tREST API, Customer.io, HubSpot, Make.com, Zapier, Segment, PostHog, Google Tag Manager, Mixpanel, GA4, Looker Studio\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Weaviate, Pinecone, Chroma\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, LangChain, CrewAI, AutoGen, Semantic Kernel, OpenAI, Claude, Google Gemini",
  "apply_company": "OhChat"
}