{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Experienced Full Stack Developer with over 10 years in crafting high-performance software solutions, now targeting a Senior Software Engineer role. Proficient in **Ruby on Rails**, **PostgreSQL**, **MySQL**, **TypeScript**, and adept in utilizing **Git** and **GitHub** for version control. Strong capabilities in **automated testing** and **unit testing** to ensure code quality and reliability. Familiar with **Stimulus**, **Turbo**, and **Tailwind CSS** for modern web development, with solid knowledge of **GraphQL** and **JSON:API** for building efficient APIs. \n\nAdditionally, experienced in **AWS**, **Docker**, and **Kubernetes** for cloud-native application deployment, enhancing site performance, and implementing technical SEO best practices. Proven ability to lead teams and mentor junior developers, fostering an environment of collaboration and continuous improvement. Leveraging a robust background in microservices architecture and event-driven systems, I am dedicated to delivering secure, scalable, and maintainable solutions that effectively meet compliance standards. Passionate about developing impactful systems while driving innovation and automating workflows.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented full-stack solutions utilizing **Ruby on Rails**, **TypeScript**, and **PostgreSQL**, ensuring scalability and compliance with industry standards.\n• Developed and integrated APIs using **GraphQL** and **JSON:API** for seamless data interaction, supporting over 1,000 concurrent users and enhancing user experience by **25%**.\n• Collaborated in a team-oriented environment, mentoring junior developers and fostering effective communication across projects to drive development excellence.\n• Leveraged **Docker** and **Kubernetes** for container orchestration and deployment, managing resources for services supporting **99.9% availability**.\n• Implemented automated testing frameworks, including **unit testing** and **automated testing**, achieving a test coverage of over **85%** to ensure code quality and reliability.\n• Focused on site performance optimization, achieving load times under **2 seconds** through advanced techniques and tools such as **Tailwind CSS** and **Stimulus**.\n• Integrated **Git** and **GitHub** for version control and collaboration, managing over **10 active repositories** and streamlining continuous integration and deployment processes.\n• Designed data architecture with **MySQL** and **PostgreSQL** for stringent data storage and retrieval during a peak load of over **500,000 queries per day**.\n• Enhanced backend services with messaging queues like **RabbitMQ** and **Kafka** to improve data processing times by **30%** across various applications.\n• Created and enforced best practices in technical SEO to increase web visibility, resulting in a **40% uplift** in organic traffic.\n• Developed insights tool integrations using modern front-end technologies, enhancing visual analytics capabilities with real-time data representation and dashboards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Led full-stack engineering initiatives by developing and modernizing financial platforms using **Ruby on Rails** and **PostgreSQL**, improving system efficiency by **30%**.\nImplemented automated and unit testing practices to ensure robust and maintainable code quality across the software development lifecycle.\nBuilt dynamic, user-focused front-end applications using **TypeScript** and **Tailwind CSS**, crafting responsive user interfaces for financial dashboards, with a focus on performance optimization that reduced load times by **20%**.\nDesigned and integrated RESTful APIs using **GraphQL** and **JSON:API**, ensuring seamless data communication between front-end and back-end systems.\nLeveraged **Docker** and **Kubernetes** for containerization and orchestration, enabling deployment of applications in diverse environments with greater consistency.\nIntegrated message brokers like **RabbitMQ** and **Kafka** into the architecture, establishing asynchronous communication channels that supported real-time event processing for transaction alerts and monitoring workflows.\nUtilized **Git** and **GitHub** for version control and collaborative development, managing code effectively with a focus on team communication and mentorship.\nEngaged in site performance optimization techniques, achieving a **15%** improvement in site responsiveness through technical SEO strategies.\nCollaborated with cross-functional teams to provide mentorship and guidance, fostering a culture of continuous learning and professional development within the engineering team.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and maintained full-stack applications utilizing **Ruby on Rails**, ensuring robust, scalable, and efficient code across the stack while integrating with **PostgreSQL** and **MySQL** for data persistence.\n• Conducted automated testing and unit testing to maintain code quality, leading to a **30% reduction** in bugs during the deployment phases.\n• Utilized **Git** and **GitHub** for version control, enabling seamless collaboration among team members and efficient code management.\n• Engineered responsive designs using **Tailwind CSS** and **TypeScript** to enhance user experience, resulting in a **25% increase** in user engagement metrics.\n• Implemented modern web standards such as **JSON:API** and **GraphQL** for API integration, enhancing the performance and flexibility of data interactions.\n• Optimized site performance through technical SEO strategies and caching mechanisms, improving page load times by **40%** and boosting search rankings.\n• Collaborated closely with cross-functional teams, mentoring junior developers and sharing knowledge on **AWS**, **Docker**, and **Kubernetes** to improve team capabilities and project delivery.\n• Managed message queue systems and event streaming using **RabbitMQ** and **Kafka**, ensuring system reliability and efficient data processing for high-traffic scenarios.\n• Engaged in continuous improvement practices and encouraged best practices for software development across the engineering team through effective communication."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Ruby\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Ruby on Rails\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Stimulus, Turbo, Tailwind CSS\n\n**API Technologies:**\n\tJSON:API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Git, RabbitMQ, Kafka, automated testing, unit testing, technical SEO, site performance optimization, full-stack engineering, mentorship, communication"
}