{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Software Engineer with 13+ years of experience in developing high-performance applications, particularly within the healthcare and financial sectors. Proficient in **AWS**, with hands-on expertise in **LAMP** stack technologies including **Linux**, **Apache**, **MySQL**, **PHP**, and **Python**. Extensive knowledge in employing **JavaScript** for dynamic frontend solutions and implementing backend frameworks such as **Flask** and **Gunicorn**.\n\nSkilled in optimizing system performance and reliability using **Nginx** and CRON for task automation. Experienced in compliance-driven development, ensuring adherence to regulatory standards such as HIPAA and PCI DSS. Additionally, possess a solid foundation in application architecture, including microservices and cloud-native systems, with a focus on delivering robust AI/ML solutions. Known for using strong analytical skills to drive efficiency and enhance user experiences.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed full-stack applications utilizing **Linux** environments and the **LAMP** stack (Linux, Apache, MySQL, PHP) for efficient back-end solutions.\nImplemented tailored modules using **PHP** and **JavaScript** for seamless user interactions and enhanced application functionality.\nManaged and optimized **MySQL** and **MariaDB** databases, ensuring performance and security across applications.\nLed the migration of legacy software applications to **Flask** and **Gunicorn** architecture, enhancing application responsiveness and scalability.\nConfigured and maintained **Nginx** web servers for load balancing and high availability, achieving a **99.9% uptime**.\nUtilized **AWS** services for cloud deployment, driving operational efficiencies and cost reductions of up to **30%**.\nAutomated routine tasks using **CRON** jobs, streamlining operations and improving workflow efficiency.\nDesigned and developed plugins for **WordPress** to expand website functionalities while ensuring compliance with industry standards.\nExecuted robust testing strategies using modern frameworks and tools to ensure software quality and reliability across all deployment stages.\nCollaborated with cross-functional teams to promote synergy and align technology solutions with business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Engineered robust applications utilizing **Linux** environments, ensuring high availability and optimization of resource consumption for critical financial systems.\nDeveloped back-end services using **PHP** and **Python** (Flask, Gunicorn) to manage data interactions with **MySQL** and **MariaDB** databases, facilitating dynamic transactional processes with **20%** improvement in query response time.\nImplemented scheduling using **CRON** jobs for automated data processing and integrations, enhancing operational efficiency by **30%**.\nCollaborated in a **LAMP** stack to deliver full-stack solutions, driving the seamless interaction between the user interface and database layer.\nCreated web applications utilizing **JavaScript** frameworks, ensuring responsive design and interactivity for user-focused interfaces while adhering to coding standards and best practices.\nDesigned infrastructure on **AWS**, integrating services like **Lambda** and **S3** to optimize serverless execution for data handling and processing.\nUtilized clustering and load balancing with **Nginx** to improve application stability and performance under high traffic scenarios, achieving uptime of **99.9%**.\nEngaged in continuous improvement practices through code reviews and documentation to enhance team productivity and maintain knowledge sharing across technical areas."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Linux** and **AWS** to deploy and manage scalable applications, ensuring 99.9% uptime across all services.\nDeveloped and maintained back-end services using **PHP** with the **LAMP** stack, enhancing performance and reliability for high-traffic environments.\nEngineered efficient data storage solutions by optimizing **MySQL** and **MariaDB** schemas, improving query performance by **30%** through best practices and indexing strategies.\nImplemented automated task scheduling with **CRON** for routine maintenance and data backups, ensuring data integrity and operational efficiency.\nLeveraged **Apache** and **Nginx** for serving applications, optimizing configurations for higher throughput and reduced latency.\nContributed to code quality and maintainability by applying **Python** with **Flask** and **Gunicorn**, resulting in a **25%** reduction in response time for API endpoints.\nDesigned and developed plugins for **WordPress**, enhancing functionality and user engagement while adhering to web standards.\nCollaborated with cross-functional teams to analyze and resolve system issues, driving improvements in system design and functionality.\nLed initiatives to implement best security practices within existing projects, reinforcing application safety and compliance with industry standards."
    }
  ],
  "skills": "Programming Languages:\n\tC, PHP, Python, JavaScript\n\n**Backend Frameworks:**\n\tFlask, FastAPI\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tNginx, Gunicorn\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MariaDB, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tLinux, LAMP, CRON, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, MLflow, Airflow, Kubeflow",
  "apply_company": "Scaled"
}