{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Mobile Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Mobile Engineer with 10+ years of experience in delivering high-performance software solutions, particularly in mobile app development. Expert in **Kotlin Multiplatform**, **CI/CD** using **GitHub Actions**, **Bitrise**, and **Fastlane**, and experienced with **Gradle** for dependency management. Proficient in mobile performance profiling using **Android Studio Profiler**, **Instruments**, and **LeakCanary**, specializing in API design, caching strategies, and data synchronization. Adept in implementing automated testing frameworks to enhance observability and ensure rollout safety while effectively managing performance regressions.\nEquipped with a strong background in leading teams, mentoring junior developers, and fostering collaboration and communication to drive team productivity. Skilled in utilizing modern technologies including **JavaScript/TypeScript**, **Python**, and frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Committed to building secure, maintainable, and compliant solutions using principles of microservices architecture and event-driven systems.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Mobile Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tExecuted CI/CD pipelines utilizing **GitHub Actions**, **Bitrise**, and **Fastlane** for streamlined mobile app development, enhancing team productivity and ensuring rollout safety across various environments.\n•\tImplemented Kotlin Multiplatform solutions for cross-platform mobile development, ensuring efficient data synchronization and seamless user experiences on iOS and Android.\n•\tManaged dependency management and caching strategies to optimize app performance, employing **Gradle** for robust build configurations and using **LeakCanary** for memory leak detection.\n•\tConducted mobile performance profiling through **Android Studio Profiler** and **Instruments** to identify performance regressions and enhance app responsiveness.\n•\tFacilitated collaboration with cross-functional teams, providing mentoring and fostering effective communication to enhance team dynamics and output.\n•\tDeveloped automated testing strategies using industry-standard frameworks, ensuring robust testing coverage for unit, integration, and end-to-end scenarios to maintain application quality.\n•\tDesigned architecturally sound APIs following best practices and caching strategies to ensure efficient data retrieval and synchronization between mobile applications and backend services.\n•\tCreated observability metrics within mobile apps to monitor performance and usage, enabling timely interventions to mitigate potential issues.\n•\tEngaged in code reviews and maintained documentation that enhances teamwork and codebase understandability, contributing to continuous improvement in the development process.\n•\tCoordinated with external stakeholders to gather requirements and align project objectives, ensuring the delivery of high-quality mobile applications that meet business needs."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented **CI/CD** pipelines using **GitHub Actions** and **Bitrise**, enhancing development efficiency and enabling rapid deployment cycles for mobile applications.\nLed the design and development of mobile apps with a focus on **Kotlin Multiplatform**, ensuring seamless functionality across iOS and Android platforms, successfully reducing development time by **30%**.\nConducted extensive **mobile performance profiling** using **Android Studio Profiler** and **Instruments**, identifying performance bottlenecks and implementing solutions that improved app loading times by **50%**.\nUtilized **LeakCanary** for detecting memory leaks, enhancing application stability and user experience, reducing crash reports by **40%**.\nDeveloped robust **API designs** and implemented **caching strategies**, improving data synchronization and application responsiveness during peak usage times.\nPromoted best practices in **automated testing** and **observability**, ensuring higher code quality and facilitating easier identification of **performance regressions** in mobile applications.\nMentored and guided junior developers to enhance team productivity, fostering an environment of collaboration and effective communication within the team.\nExecuted rollout safety strategies ensuring zero downtime during updates and fostering user trust during application enhancements."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Implemented CI/CD pipelines using **GitHub Actions** and **Bitrise** to automate builds, testing, and deployments, ensuring consistent and reliable releases in mobile application development.\nDesigned and optimized mobile applications with a focus on **Kotlin Multiplatform** for cross-platform functionality, enhancing user experience for Android and iOS users and delivering applications that support **API design**.\nConducted mobile performance profiling utilizing tools such as **Android Studio Profiler** and **Instruments** to identify and address performance regressions, improving app responsiveness by **30%**.\nDeveloped and maintained robust caching strategies, leveraging **LeakCanary** for memory leak detection and ensuring smooth application performance under high load.\nExecuted automated testing protocols to ensure code quality and reliability, integrating tools for comprehensive coverage and fostering a culture of **team productivity** and collaboration among developers.\nFacilitated data synchronization across platforms through effective **dependency management** practices, ensuring **99.9%** uptime and data integrity for users.\nMentored junior developers in mobile best practices and modern development methodologies, enhancing the **collaboration and communication** within the team.\nAdopted rollout safety measures, including A/B testing to mitigate risk during deployments, enabling controlled feature releases and timely feedback from users.\nUtilized **Gradle** and **Fastlane** for project automation, driving development efficiency and streamlining project setups.\nActively monitored application metrics, fostering observability to identify bottlenecks and further optimize application performance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Kotlin Multiplatform\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI design, caching strategies, data synchronization\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tGitHub Actions, Bitrise, collaboration, communication\n\n **Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, automated testing, mobile performance profiling, Android Studio Profiler, Instruments, LeakCanary, performance regressions, rollout safety, team productivity, mentoring, observability, dependency management, Gradle, Fastlane",
  "apply_company": "sunday"
}