{
  "name": "Tomasz Lee",
  "role_name": "Senior Analytics Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Analytics Engineer with 9+ years of experience in data transformation, data modeling, and data analysis. Proficient in **SQL**, **dbt**, **SQLMesh**, and developing data pipelines that support advanced analytics and decision-making processes. Experienced in utilizing **AI tools** to enhance data-driven insights. Strong technical background in **microservices architecture**, and distributed systems with exposure to technologies like **Apache Kafka**, **RabbitMQ**, **Redis**, and frontend technologies such as **ReactJS** and **NextJS**. Proven ability to lead cross-functional teams and deliver high-quality solutions that optimize performance and streamline development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Analytics Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and optimized complex **SQL** queries for enhanced data retrieval, significantly improving data processing efficiency by **25%**.\nUtilized **dbt** for data transformation, enhancing data model performance and clarity across analytics pipelines.\nDesigned and implemented effective **data pipelines** for transforming and moving data efficiently, ensuring data integrity and availability.\nConducted comprehensive **data analysis** to uncover insights for strategic decision-making, leading to a **30%** increase in actionable insights.\nCollaborated with cross-functional teams to create robust **data models** that support business intelligence and reporting needs.\nEmployed **AI tools** to automate data quality checks, reducing manual oversight and improving data accuracy by **40%**.\nSpearheaded initiatives to integrate **blockchain** solutions for secure data transactions and **smart contracts** for complex agreements.\nEnhanced data storage solutions by implementing best practices in data management, optimizing access and retrieval speeds by **15%**.\n\nCollaborated with teams to document processes and maintain the clarity of analytical workflows for onboarding new team members."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **SQL** to analyze and transform data for actionable insights, improving decision-making processes across the organization.\nDesigned robust data models and pipelines using **dbt** and **SQLMesh**, enhancing data integrity and accessibility for analytics.\nDeveloped smart contracts on a **blockchain** platform, ensuring secure and transparent data transactions, resulting in a **30%** increase in trust among stakeholders.\nImplemented effective data transformation strategies, leading to more efficient data flow with a **20%** reduction in processing time.\nConducted data analysis with advanced **AI tools**, yielding predictive insights that contributed to a **15%** uptick in revenue generation.\nCollaborated with cross-functional teams to define analytics requirements, ensuring alignment with business objectives and timely delivery of projects.\nCreated custom SQL queries for data extraction and manipulation, optimizing performance and responsiveness of analytics reports.\nLed initiatives to improve data accuracy and quality across the organization, resulting in a **25%** decrease in data-related errors.\nMentored junior analysts in best practices for data modeling and analysis, enhancing team effectiveness and skill development.\nPresented analytical findings and visualizations to stakeholders, facilitating informed decision-making and strategic planning."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **SQL** for efficient data analysis and management, ensuring accuracy and insights for decision-making across projects.\nDeveloped and maintained data transformation processes using **dbt**, enhancing data quality through automated workflows.\nImplemented **SQLMesh** to manage complex data pipelines, ensuring seamless data integration and lineage tracking.\nCollaborated on blockchain projects, contributing to the development of **smart contracts** that automate business processes and improve transaction security.\nDesigned and executed robust data models to support analytical initiatives, driving clarity and consistency across datasets.\nLeveraged AI tools to enhance data analysis capabilities, enabling predictive insights that informed strategic business decisions.\nCreated and optimized data pipelines, which increased data retrieval efficiency by **30%**, leading to faster insights delivery.\nExecuted thorough data analysis techniques to interpret large datasets, resulting in improved operational efficiencies and informed decision-making processes.\nRegularly communicated quantitative insights through detailed reports and visualizations, facilitating understanding across non-technical stakeholders.\nMaintained comprehensive documentation of data processes, fostering knowledge transfer and ensuring alignment with best practices."
    }
  ],
  "skills": " **Programming Languages**\n\t Python, JavaScript, TypeScript, SQL\n\n**Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Frontend Frameworks**\n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\t RESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\t AWS, Azure\n\n**Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\t CI/CD pipelines\n\n**Cloud & Infrastructure**\n\t dbt, SQLMesh\n\n**Other**\n\t UX/UI Design, Git, GitHub, testing tools (NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest), blockchain (Solidity, Ether.js, Web3.js, Ethereum), smart contracts, data transformation, data modeling, data pipelines, data analysis, AI tools",
  "apply_company": "Dune"
}