{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Full Stack Developer with 13+ years of experience, now transitioning into a Senior Sales Engineer role. Proficient in **AWS**, **Google Cloud Services**, **Docker**, and **Kubernetes**, with strong problem-solving and presentation skills that enhance technical demonstrations and client engagements. Skilled in deploying applications on **Microsoft Windows Server** and **Linux** environments, ensuring optimal performance and reliability.\n\nExpert in backend technologies including **JavaScript**, **Python**, and RESTful APIs, with a comprehensive understanding of database systems such as **MS SQL Server**, **Oracle**, and **PostgreSQL**. Proven ability to build high-performance applications for the healthcare and financial sectors, utilizing technologies such as **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**. Adept at aligning development solutions with compliance standards including HIPAA and PCI DSS, leveraging AI/ML technologies for predictive analytics and automation.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Presented technical solutions and product demonstrations that showcase the capabilities of **Python** and **JavaScript** technologies in addressing client challenges effectively.\nUtilized strong **problem-solving** skills to tailor solutions for clients in healthcare and fintech sectors, employing frameworks such as **Docker** and **Kubernetes** for robust application deployment.\nLeveraged knowledge of **AWS** and **Google Cloud Services** to deliver cloud-based solutions that are scalable and secure, ensuring clients' needs are met with **PostgreSQL** for data storage.\nCollaborated with cross-functional teams to articulate technical requirements and propose solutions that foster seamless integrations with **RESTful APIs** and third-party tools, enhancing user experience across platforms.\nImplemented training programs for clients on product usage and best practices, ensuring detailed understanding of integrated systems built on technologies like **Linux**, **Windows Server**, and **MS SQL Server**.\nManaged deployment processes utilizing CI/CD practices with **Docker** and cloud platforms, reducing platform downtime by **30%** and streamlining operations.\nConducted workshops and webinars to educate prospective clients on complex technical subjects, leading to a **25%** increase in customer satisfaction ratings.\nMaintained strong partnerships with clients through continuous technical support, cultivating a **15%** growth in account renewals and upsells each quarter.\nMonitored emerging technology trends providing insights tailored to customer business needs, leveraging frameworks such as **PostgreSQL** and tools integrated into their tech stack.\nAnalyzed client environments, addressing unique business problems with tailored **technical presentations** and actionable insights, ensuring alignment with industry compliance standards."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Utilized **AWS** and **Google Cloud Services** to build scalable infrastructure for sales engineering tools, ensuring optimal performance and availability for clients across diverse sectors.\n• Leveraged **Microsoft Windows Server** and **Linux** environments to enhance system reliability, focusing on problem-solving and troubleshooting to deliver seamless solutions to clientele.\n• Developed and conducted technical presentations, showcasing product capabilities and integrations with **Docker** and **Kubernetes** for container orchestration, impacting sales by over **30%**.\n• Engaged in requirements gathering with clients to tailor solutions using **Python** and **JavaScript**, focusing on crafting robust **RESTful APIs** that improved data interaction and client satisfaction scores by **25%**.\n• Collaborated with data engineering teams to design SQL databases, using **MS SQL Server**, **Oracle**, and **PostgreSQL**, achieving data retrieval efficiencies that reduced query times by **40%**.\n• Implemented solutions for real-time data processing and analytics on sales frameworks, utilizing **PowerShell** scripts for automation and monitoring, which led to a **20%** increase in operational efficiency.\n• Continuously refined presentation skills by conducting **8** client workshops per quarter, improving client engagement and understanding of our technical offerings."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Presentation Skills** to deliver product demonstrations and technical presentations that effectively communicated complex solutions to clients, enhancing understanding and engagement.\nEmployed **Problem Solving** techniques to troubleshoot technical issues and provide timely solutions during sales processes, contributing to improved customer satisfaction and retention.\nImplemented **Sales Engineering** methodologies to work closely with clients, identifying their needs and translating them into tailored technical recommendations, fostering strong relationships.\nLeveraged **Microsoft Windows Server**, **Linux**, and **Docker** to optimize deployment environments, ensuring smooth application performance and maintenance.\nManaged container orchestration with **Kubernetes**, supporting robust and scalable environments that could handle varying loads efficiently.\nDeployed solutions on **AWS** and **Google Cloud Services**, demonstrating knowledge of cloud architectures and services that underpin effective sales processes.\nHandled databases with proficiency in **PostgreSQL**, and demonstrated familiarity with **MS SQL Server** and **Oracle**, ensuring reliable data storage and retrieval for customer solutions.\nUtilized **PowerShell** for automation tasks, enhancing operational efficiency in testing environments.\nDeveloped client-facing solutions with **JavaScript** and **Python** to demonstrate technical capabilities, aligning product features with client requirements in real-world scenarios.\nDesigned and documented **RESTful APIs** critical for service integration, standardizing communication between various platform components for seamless functionality."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful API\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, MS SQL Server, Oracle\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Google Cloud Services\n\n **Other:**\n\tSales Engineering, Presentation Skills, Problem Solving, Linux, Microsoft Windows Server, PowerShell, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Redis, Terraform, Ansible, Helm, Docker Compose",
  "apply_company": "Rocket Software"
}