{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Solutions Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Solutions Engineer with 8 years of experience, I excel in **blockchain**, **DApps**, and **Solidity** development, providing architectural recommendations and technical discovery for high-performance solutions. My robust background in **Rust**, **MOVE**, and pre-sales initiatives equips me to lead product demos and proofs of concept, ensuring customer success through effective commercial negotiations.\nIn addition to my technical prowess, I bring expertise in full-stack development, leveraging technologies such as **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, to create enterprise-grade platforms. My experience with **Azure** and **AWS** strengthens my ability to build scalable solutions that incorporate AI/ML capabilities for predictive analytics and automated processes.\nWith a solid foundation in microservices architecture, CI/CD automation, and compliance standards including HIPAA, FHIR, PCI DSS, and SOC 2, I am committed to delivering secure applications that meet business needs while enabling seamless integration of advanced technologies.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted **technical discovery** sessions to assess customer needs and provided **architectural recommendations** for blockchain solutions utilizing **Solidity**, **Rust**, and **MOVE**, aligning with client objectives.\n- Developed **Proofs of Concept** and product demos for potential clients, showcasing innovative DApps designed to solve specific business challenges in the blockchain space.\n- Implemented **technical configuration** for blockchain integrations, enhancing operational efficiencies and ensuring compliance with industry standards.\n- Collaborated with cross-functional teams to ensure customer success, delivering tailored solutions that meet both technical requirements and business goals.\n- Engaged in **commercial negotiations** with stakeholders, leveraging **business acumen** to present solutions that drive ROI.\n- Delivered comprehensive documentation and support for clients post-deployment, ensuring smooth transitions and continuity of service.\n- Provided technical training sessions for clients to empower them with tools and knowledge to effectively utilize blockchain applications.\n- Analyzed market trends to identify opportunities for new DApp developments, utilizing competitor insights to inform product strategy."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted technical discovery sessions to identify client requirements and provided architectural recommendations for blockchain-based solutions, enhancing customer satisfaction and driving product validation.\nDeveloped and showcased Proofs of Concept for DApps using **Solidity**, **Rust**, and **MOVE**, effectively demonstrating product capabilities and securing client buy-in during Pre-Sales initiatives.\nCollaborated with cross-functional teams to ensure the technical configuration of blockchain solutions aligned with client expectations and industry standards, facilitating smooth product demos and integration processes.\nUtilized strong business acumen to negotiate commercial agreements and foster long-term customer success, leading to a **25%** increase in revenue from solution offerings.\nEngaged in continuous improvement of customer success metrics by providing hands-on support and technical guidance post-deployment, addressing issues promptly and enhancing user experience.\nDesigned and implemented performance tracking mechanisms for DApps, resulting in a **30%** reduction in response time during peak transactions while maintaining system reliability.\nLed the development of documentation and training materials for blockchain technologies, ensuring clients are equipped to leverage new solutions effectively, improving knowledge transfer by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted technical discovery sessions to understand client needs and provide architectural recommendations using **blockchain** technologies like **Solidity** and **Rust**, ensuring tailored solutions for enterprise-level DApps.\nExecuted proofs of concept (POCs) to demonstrate the capabilities of various **blockchain** frameworks, engaging stakeholders through effective product demos and showcasing real-world applications.\nFacilitated commercial negotiations with clients, utilizing strong business acumen to align **blockchain** solutions with organizations’ strategic goals, resulting in a **25%** increase in successful project acquisitions.\nDesigned and configured technical solutions, leveraging knowledge in **MOVE** for smart contracts, improving system efficiency and performance by **15%** in pilot implementations.\nCollaborated with customers to ensure ongoing success and satisfaction after deployment, addressing performance improvements and feature enhancements in a timely manner.\nSupported pre-sales activities by delivering compelling presentations that highlighted the advantages of **blockchain** integration, leading to a **30%** increase in client engagement rates.\nProvided expertise in implementing secure, scalable **blockchain** solutions that comply with industry standards and regulations, enhancing client trust and platform reliability.\nUtilized experience with product lifecycle management to guide clients through technical configurations that optimize **blockchain** performance and adaptability.\nEncouraged innovation within teams by initiating knowledge-sharing sessions on emerging **blockchain** technologies and trends, fostering a culture of continuous improvement."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Solidity, Rust, MOVE\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tblockchain, DApps, technical discovery, architectural recommendations, technical configuration, Pre-Sales, Proofs of Concept, product demos, customer success, commercial negotiations, business acumen, MLflow, Airflow, Kubeflow, Keycloak, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Chainlink Labs"
}