{
  "name": "Tomasz Lee",
  "role_name": "Senior Full Stack Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Full Stack Engineer with 9+ years of experience in developing scalable web applications and APIs leveraging **TypeScript**, **React**, **Next.js**, and **Python**. Proficient in building robust distributed systems with a strong foundation in **Django** and **Ruby on Rails**. Expertise in observability, monitoring, logging, and alerting to ensure application performance and reliability. Demonstrated success in utilizing Agile methodologies for effective project management and team collaboration. Recognized for strong problem-solving skills, critical thinking, and meticulous attention to detail, ensuring the delivery of high-quality solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Stack Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed scalable web applications utilizing **ReactJS** and **Next.js**, enhancing user interaction and satisfaction by **25%**.\n• Implemented **Web APIs** to facilitate seamless integration between front-end and back-end services, leveraging **.NET 7** for robust functionality.\n• Designed and maintained a microservices architecture with **.NET Core** to enhance system performance and ensure maintainability across distributed systems.\n• Integrated **Python** for backend scripting, allowing for efficient data processing and facilitating easier implementation of complex algorithms.\n• Employed **Django** for developing RESTful services, improving the delivery of customer-facing applications.\n• Utilized **RabbitMQ** for queue management and **Apache Kafka** for data streaming, improving system resilience and throughput.\n• Leveraged **Redis** for caching to optimize data retrieval times, achieving a **35%** reduction in database load.\n• Established CI/CD pipelines through **Azure DevOps**, slashing deployment times by **40%** and enhancing release frequency.\n• Optimized **MSSQL** database performance, resulting in a **20%** reduction in average query execution duration.\n• Worked collaboratively with UX/UI designers to refine application interfaces and elevate the overall user experience.\n• Generated dynamic data visualizations using **D3.js** and **Three.js**, contributing to an engaging reporting engine.\n• Implemented JWT-based authentication strategies to ensure secure access control throughout the application lifecycle.\n• Engaged in Agile methodologies to foster a productive team environment focused on continuous improvement and delivery.\n• Applied critical thinking and problem-solving skills to address complex technical challenges and enhance overall product quality."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Developed scalable web applications using **React** and **Next.js**, leading to a 25% improvement in user engagement.\nDesigned and implemented **Web APIs** with **Python** and **Django** for seamless integration and data access.\nCreated distributed systems leveraging **RabbitMQ** and **Apache Kafka** for robust task orchestration and event-driven processing, enhancing system scalability and reliability.\nUtilized **TypeScript** for type safety throughout the development process, contributing to fewer runtime errors by 20%.\nImplemented observability practices through monitoring and logging frameworks, improving system alerting capabilities significantly.\nDeveloped and maintained **RESTful APIs** with **Ruby on Rails**, optimizing performance by reducing response times by 30%.\nLed CI/CD pipeline initiatives using **GitHub Actions**, which decreased production deployment errors by **30%** and streamlined development cycles.\nConducted code reviews and provided mentorship to junior developers, enhancing the team’s technical skills and collaborative efforts.\nCollaborated with stakeholders in an Agile environment to define system requirements and development timelines, ensuring on-time delivery of features.\nEngaged in critical problem-solving and attention to detail throughout projects, driving successful outcomes and high-quality deliverables."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed scalable web applications using **React** and **Next.js**, enhancing user engagement by **30%**.\nUtilized **TypeScript** to improve code quality and reduce bugs by **25%**, facilitating smoother development cycles.\nArchitected and implemented distributed systems focusing on performance and scalability, reducing latency by **15%**.\nLeveraged **Python** and **Django** for backend services, resulting in a robust and efficient data handling process.\nDesigned and integrated Web APIs for seamless communication between services, improving system interoperability.\nEmployed observability tools for monitoring and logging, ensuring system reliability and proactively addressing issues.\nConducted thorough alerting setups that reduced incident response times by **40%** and improved system uptime.\nCollaborated effectively within Agile methodologies, maintaining strong team cohesion and fostering an environment of critical thinking and problem-solving.\nProvided exceptional attention to detail during code reviews, ensuring adherence to best practices and project requirements.\nDelivered technical documentation that increased project maintainability and knowledge transfer across teams."
    }
  ],
  "skills": "**Programming Languages**\n\tTypeScript, Python, Ruby\n\n**Backend Frameworks**\n\tDjango, Rails, NodeJS, ExpressJS, NestJS, .NET\n\n**Frontend Frameworks**\n\tReact, Next.js, Angular, VueJS, NuxtJS, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, Web APIs, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines, Observability, Monitoring, Logging, Alerting\n\n**Cloud & Infrastructure**\n\tMicroservices\n\n**Other**\n\tUX/UI Design, Git, GitHub, Agile methodologies, Problem-solving, Critical-thinking, Attention to detail",
  "apply_company": "Numan"
}