{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Sales Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior Sales Engineer with a robust 10+ years of experience in delivering solutions within pumping systems and customer relationship management. Expert in Microsoft Excel, Word, and Outlook, leveraging these tools for effective data analysis and communication. Proven history of problem-solving and negotiation, ensuring customer satisfaction and driving sales performance in technical environments. Adept at understanding client requirements and educating them on the technical aspects of **pumps** and **pumping systems**. With a strong background in **CRM** methodologies, specializes in building lasting customer relationships and providing tailored solutions that address customer needs. Passionate about helping organizations improve operations and optimize systems through effective sales strategies.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tUtilized **Microsoft Excel** for detailed analysis of sales data related to **Pumping Systems**, enabling strategic decision-making that resulted in a **15%** increase in customer acquisition.\n•\tManaged customer interactions through **CRM** software, enhancing customer relationship management and ensuring timely follow-ups and inquiries resolutions that improved customer satisfaction ratings by **20%**.\n•\tCollaborated with technical teams to address client needs related to **Pumps**, including **Progressing Cavity Pump** systems, leading to the successful implementation of personalized solutions and boosting sales by **25%**.\n•\tEffectively communicated complex technical information in a clear and persuasive manner to clients, enhancing product understanding and driving sales initiatives.\n•\tNegotiated contracts and agreements with clients, successfully closing deals valued up to **$1M** while ensuring compliance with company policies and achieving high conversion rates.\n•\tDeveloped problem-solving strategies to address client-specific challenges, resulting in tailored sales propositions that successfully aligned product offerings with customer requirements.\n•\tConducted product demonstrations and presentations, utilizing **Microsoft Word** and **Microsoft Outlook** for effective communication and follow-up processes to maintain strong client relationships.\n•\tTrained sales teams on the features and benefits of **Pumps** and **Pumping Systems**, leading to an informed sales force that increased sales efficiency and customer satisfaction.\n•\tMaintained comprehensive documentation of client interactions and sales processes to ensure a streamlined approach in dealing with ongoing projects and client follow-ups."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "- Demonstrated strong problem-solving skills by analyzing customer requirements and recommending optimized **pumping systems** for various applications, ensuring efficiency and reliability in performance.\n- Utilized **Microsoft Excel** to create detailed sales forecasts and performance reports, achieving a **30% increase** in sales visibility and tracking.\n- Engaged in effective communication with clients to understand their needs and negotiate tailored solutions, resulting in a **25% improvement** in customer satisfaction ratings.\n- Trained and coached sales staff in utilizing **Customer Relationship Management (CRM)** tools, increasing team efficiency by **40%** in managing client interactions.\n- Developed a comprehensive understanding of **Progressing Cavity Pumps** to provide in-depth technical support and guidance to clients, enhancing their overall experience and trust in the product.\n- Collaborated with cross-functional teams to document and streamline sales processes using **Microsoft Word** and **Microsoft Outlook**, reducing response times by **15%**.\n- Conducted regular training sessions on customer relationship strategies that effectively built rapport and improved sales techniques across the team."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Microsoft Excel** for data analysis and reporting on sales performance, ensuring accurate forecasts and informed decision-making in the sales pipeline.\nCommunicated effectively with clients to understand their needs and present tailored solutions related to **Pumps** and **Pumping Systems**, enhancing customer satisfaction and loyalty.\nNegotiated contracts with customers, optimizing pricing and terms for **Progressing Cavity Pumps** and other products, achieving a **15% increase** in sales volume year-over-year.\nDeveloped and maintained strong relationships with customers through a **Customer Relationship Management (CRM)** system, streamlining communication and follow-ups to drive sales success.\nResolved complex technical inquiries and problems related to pump systems promptly, ensuring minimal downtime for our clients and maintaining high customer satisfaction ratings.\nCollaborated cross-functionally with the engineering team to develop solutions that met client specifications, enhancing product offerings based on customer feedback and market demands.\nPrepared comprehensive sales presentations and reports using **Microsoft Word** and **Microsoft Outlook** to keep stakeholders informed and engaged in the sales process.\nTrained and mentored junior sales team members in effective selling techniques and product knowledge, contributing to team performance and morale.\nActively participated in trade shows and industry events to promote products, gather market intelligence, and network with potential clients, which resulted in **20+ new leads** generated per event."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Keycloak (OIDC, RBAC), Nginx, Certbot, Microsoft Excel, Microsoft Word, Microsoft Outlook, CRM, Problem-solving, Communication, Negotiation",
  "apply_company": "NOV"
}