{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Email Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Email Engineer with strong expertise in Email Marketing, A/B Testing, Automation, and CRM tools. Proven ability to apply analytical thinking and solution-oriented strategies to enhance customer engagement through effective email campaigns. Experienced in utilizing **Figma** for designing user-centric email templates, implementing segmentation techniques to tailor communications, and optimizing workflows to improve marketing performance. Demonstrates structured work habits and a proactive approach to problem-solving. Additionally, I bring over 10 years of software development experience, proficient in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, with a full stack background encompassing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My experience with cloud-native application development on **Azure** and **AWS**, as well as a solid foundation in microservices architecture and CI/CD automation, complements my skills in building impactful solutions that meet compliance standards.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Email Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tUtilized **Figma** to design intuitive and user-friendly email templates that enhance user engagement and drive conversion rates within email marketing campaigns.\n•\tImplemented **Klaviyo** for managing customer relationships and automating email workflows, optimizing messaging through segmentation and **A/B testing** to achieve a **30%** increase in open rates.\n•\tAnalyzed email performance metrics using analytical tools to drive solution-oriented thinking, refining strategies based on data-backed insights to enhance customer relationship management (CRM).\n•\tDeveloped and executed segmented email marketing strategies focused on customer behavior, resulting in improved personalization and customer engagement, contributing to a **25%** increase in click-through rates.\n•\tEstablished automated email campaigns that efficiently deliver tailored content to target audiences, leveraging marketing technologies to streamline workflows and boost productivity by **15%**.\n•\tConducted thorough A/B testing to validate email subject lines, content layout, and call-to-action placements, resulting in improved overall campaign effectiveness and customer satisfaction.\n•\tCollaborated with UX designers to ensure seamless user experiences in email interactions, leading to higher retention rates and more successful user journeys.\n•\tRegularly engaged in structured work methodologies to manage multiple email campaigns concurrently, ensuring timely delivery and alignment with overall marketing objectives.\n•\tApplied analytical thinking to monitor and report on email marketing performance, adjusting strategies to continuously optimize reach and engagement across diverse customer segments."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Figma** to design and prototype engaging, user-focused email templates that enhance user experience (UX) and align with campaign goals, resulting in a **30%** increase in email engagement rates.\nImplemented **A/B Testing** strategies to optimize email marketing effectiveness, leading to a **15%** improvement in open rates across **100+** email campaigns.\nLeveraged **Klaviyo** for effective segmentation of customer data, enabling targeted email communications that improved customer retention by **20%**.\nDeveloped automated workflows within **Klaviyo** to streamline email marketing processes, reducing manual efforts by **40%** and maximizing campaign efficiency.\nConducted thorough analytics and reporting on email campaign performance, employing strong analytical thinking to derive actionable insights and refine email strategies.\nCollaborated cross-functionally with CRM teams to ensure that email content and campaigns are aligned with broader marketing objectives, enhancing overall marketing performance.\nDemonstrated solution-oriented thinking to troubleshoot and resolve campaign delivery issues, ensuring campaigns reached the intended audience without delays.\nMaintained a structured work approach to manage multiple email campaigns concurrently, ensuring timely execution and adherence to deadlines."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Figma** to design visually appealing and user-centric email templates, aligning with best practices in UX to enhance customer engagement and interaction rates.\nExecuted A/B testing strategies for email campaigns, employing analytical thinking to optimize subject lines, content, and segmentation, driving a **25%** increase in open rates.\nDeveloped and maintained automated email marketing flows using **Klaviyo**, ensuring timely and relevant communication tailored to customer behaviors and preferences.\nImplemented effective segmentation strategies based on user data, enhancing targeting accuracy and ultimately leading to a **30%** boost in conversion rates.\nCollaborated with cross-functional teams to create and refine automation tools, streamlining workflows and reducing manual efforts by **40%**, to maximize campaign effectiveness and efficiency.\nAnalyzed campaign performance metrics and user engagement data, applying solution-oriented thinking to iterate and improve ongoing email strategies and initiatives.\nConducted workshops to train team members on CRM best practices, fostering a culture of structured work and data-driven decision-making in email marketing efforts.\nEnsured compliance with email marketing regulations and best practices to safely manage user data while optimizing deliverability and engagement rates.\nLeveraged CRM insights and analytics to inform content strategy, tailoring messaging to align with customer journeys and lifecycle triggers."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tFigma, Klaviyo, CRM, Email Marketing, A/B Testing, Segmentation, Automation, UX, Analytical Thinking, Solution-oriented Thinking, Structured Work, MLflow, Airflow, Kubeflow, Keycloak, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "BendtConsulting"
}