{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior AI Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior AI Engineer with 10+ years of experience in delivering high-performance software solutions, specializing in **AI** and **ML**. Proficient in **Python** and frameworks associated with **MLOps**, including ML pipelines and deploying models, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**. Adept at building and optimizing **data pipelines** and implementing **NLP** techniques for enhancing machine learning models, including **model fine-tuning** and **embeddings**. Experienced in deploying cloud-native applications on **AWS**, **Azure**, and **GCP**, ensuring cost-efficiency and collaboration in cross-functional teams. Strong technical acumen in modern web technologies such as **React**, **Next.js**, **Vue**, and **Node.js**, as well as back-end frameworks like **FastAPI** and **Django**. Knowledgeable in compliance standards including HIPAA and PCI DSS, ensuring security in enterprise solutions. Committed to driving innovation within a **startup mindset**, translating technical capabilities into real-world impact, while maintaining commercial awareness.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and integrated AI features into applications using **Python**, facilitating solutions for **NLP**, **ML**, and **data engineering** across healthcare and finance domains, enhancing commercial awareness and user engagement.\n• Engineered machine learning pipelines leveraging **MLOps** practices with tools such as **MLflow**, promoting continuous training, validation, and deployment, thereby ensuring cost-efficiency in resource usage across multiple environments.\n• Crafted and fine-tuned models for patient risk prediction and financial anomaly detection, utilizing frameworks like **PyTorch** and **TensorFlow**, demonstrating expertise in **model fine-tuning** and **embeddings** for optimal performance.\n• Designed robust, scalable data pipelines with **AWS** services and **Azure**, ensuring seamless ingestion and querying of large datasets, which improved the efficiency of data processing by **30%**.\n• Collaborated with cross-functional teams to ensure the successful implementation of field-leading AI and ML strategies, showcasing a strong **startup mindset** and commitment to collaborative problem solving.\n• Integrated advanced **LangChain** and **Retrieval-Augmented Generation** methodologies to enhance document processing and retrieval capabilities, adding value to financial compliance and healthcare document parsing.\n• Utilized cloud-native solutions on **GCP** and **AWS** to implement serverless architectures and optimize cross-platform mobile applications with **Flutter** and **React Native**.\n• Established comprehensive evaluation frameworks for robust model assessment, which increased accuracy benchmarks by **15%** by implementing best practices in model validation and embedding techniques.\n• Spearheaded integration of Azure Cognitive Search and **ElasticSearch**, enabling enhanced search functionalities across millions of healthcare and financial records, streamlining access to critical insights.\n• Contributed to the development of collaborative AI frameworks, utilizing prompt engineering techniques that resulted in improved user interactions and feedback mechanisms in client-facing applications.\n• Championed the design of a cost-efficient architecture that reduces operational overheads by **20%**, whilst delivering high-quality data solutions that meet rigorous compliance standards."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Built and orchestrated ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory** to support cost-efficient batch and real-time ingestion of financial data from internal and third-party sources, improving data processing by **40%**.\nImplemented AI/ML-powered fraud detection systems utilizing **scikit-learn**, **XGBoost**, and **Azure Machine Learning** to analyze transaction patterns, resulting in a **25%** reduction in fraudulent transactions through proactive anomaly detection.\nDeveloped machine learning pipelines for credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, enabling model inference directly in **backend services** for real-time decision-making.\nLed the modernization of financial platforms with a microservices-based architecture leveraging **Node.js** (**NestJS/Express**) and **Python** (**FastAPI, Django**), enhancing system scalability and throughput for high-volume transactions by **30%**.\nCreated real-time transaction monitoring and analytics dashboards employing **React** (**18**), **D3.js**, and **Power BI Embedded** for operations teams, significantly aiding in action-oriented insights generation.\nIntegrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** for a robust event-driven architecture that facilitated asynchronous communication and event processing for transactions and compliance, improving operational response times by **50%**.\nBuilt dynamic, user-focused front-end applications using **React** (**18**), **Vue 3**, **Next.js**, and **TypeScript**, enhancing user experience in financial dashboards through responsive design using **Redux Toolkit** and **Tailwind CSS**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Designed and optimized machine learning models and data pipelines using **Python** with frameworks including **LangChain** and **LlamaIndex**, enhancing model performance through fine-tuning and prompt engineering.\nEngineered scalable data engineering solutions on cloud platforms like **AWS**, **GCP**, and **Azure**, ensuring high efficiency and cost-effectiveness for AI/ML applications in a fast-paced environment.\nDeveloped and integrated **MLOps** practices to streamline the deployment of machine learning models, employing strategies for continuous integration and delivery, significantly reducing model rollout time from **4 weeks** to **1 week**.\nApplied natural language processing (NLP) techniques for evaluation frameworks and embeddings, improving data retrieval accuracy by **30%** and engagement metrics for end-users.\nImplemented robust data pipelines for seamless data acquisition and transformation, supporting AI initiatives and enhancing the accessibility of data across teams and projects.\nCollaborated with cross-functional teams to ensure alignment on AI-driven projects, promoting a startup mindset and fostering commercial awareness in solution development for business needs.\nUtilized advanced AI techniques to support retrieval-augmented generation tasks, leading to improved recommendation relevance and user interaction on the platform.\nConducted rigorous testing and evaluation of AI models to assess performance, driving enhancements that led to a **25%** increase in model efficiency.\nEnsured adherence to industry standards and best practices for data governance, including GDPR compliance and secure data handling protocols throughout all projects."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n**Other:**\n\tAI, ML, MLOps, LangChain, LlamaIndex, prompt engineering, Retrieval-Augmented Generation, data engineering, data pipelines, NLP, model fine-tuning, embeddings, evaluation frameworks, cost-efficiency, collaboration, startup mindset, commercial awareness",
  "apply_company": "Nory"
}