{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Odoo Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Highly skilled Senior Odoo Engineer with 8 years of experience in **Python** development, database management, and system integration, specializing in Odoo implementation and customization. Proficient in data migration and business process analysis, I leverage my strong technical support skills and problem-solving abilities to deliver effective solutions tailored to client needs. My background in full-stack development encompasses modern frameworks and technologies, including **JavaScript**, **TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.\n\nPossessing a solid foundation in CI/CD automation and microservices architecture, I am committed to building robust applications that ensure seamless integration across platforms while adhering to compliance standards such as HIPAA and PCI DSS. A self-motivated professional, I excel in communication and documentation, providing clients with thorough insights into system functionalities and implementations.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Odoo Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted comprehensive **business process analysis** to optimize Odoo deployments, ensuring seamless **system integration** with existing platforms.\n- Delivered first-rate **technical support** to clients, focusing on issue resolution and ongoing app maintenance, resulting in a **95%** satisfaction rate.\n- Executed flawless **data migration** strategies, successfully transitioning **over 50,000** records from legacy systems to Odoo.\n- Managed and maintained databases, utilizing robust **database management** practices to ensure data integrity and availability.\n- Authored clear and concise **documentation** pertaining to custom Odoo modifications, user manuals, and APIs, enhancing knowledge transfer and team collaboration.\n- Fostered **communication** with cross-functional teams to align project goals and deliver solutions that meet client expectations in a timely manner.\n- Demonstrated strong **problem-solving** skills by identifying and rectifying system inefficiencies, resulting in a **30%** increase in operational efficiency.\n- Engaged in continuous learning to stay abreast of the latest Odoo features and updates, actively contributing to team best practices and methodologies.\n- Successfully completed **over 10** Odoo implementation projects, ensuring adherence to timelines and budget constraints while meeting technical specifications."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **Odoo** solutions tailored to business needs, driving data migration efforts and ensuring seamless integration with existing financial systems, increasing operational efficiency by **30%**.\nConducted comprehensive business process analysis to optimize workflows, resulting in a **20%** reduction in processing time for core financial operations.\nManaged database operations and performance tuning in **PostgreSQL**, ensuring data integrity and optimal query performance which improved reporting speed by **40%**.\nProvided technical support for end-users, troubleshooting issues in real-time and enhancing user satisfaction scores by **15%** through effective communication and documentation practices.\nLed system integration projects with proprietary and third-party systems, ensuring data consistency and compliance across platforms and reducing manual data entry errors by **25%**.\nDeveloped and maintained clear and concise documentation of system integrations and processes to support ongoing training and onboarding efforts.\nApplied problem-solving skills to identify and rectify complex system issues swiftly, fostering a culture of continuous improvement and technical excellence within the team.\nDemonstrated self-motivation and proactive engagement in all phases of project management, contributing to on-time and on-budget delivery of Odoo-related implementations."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Conducted **data migration** strategies to enhance system integration using **Odoo**, ensuring smooth transitions with minimal downtime.\n- Performed in-depth **business process analysis** to align solutions with client needs, leveraging strong **communication** skills for effective stakeholder engagement.\n- Provided comprehensive **technical support** for users, resolving issues and enhancing user satisfaction through proactive **problem-solving** techniques.\n- Managed and optimized **database management**, ensuring data integrity and availability across various platforms, utilizing **Python** for automation.\n- Developed and maintained clear **documentation** for system processes and integration methods, promoting transparency and ease of use for future enhancements.\n- Utilized a self-motivated approach to lead initiatives that improved operational efficiency and reduced process redundancies.\n- Collaborated with cross-functional teams to define system requirements and delivered tailored **Odoo** solutions, enhancing workflow and productivity."
    }
  ],
  "skills": " **Programming Languages:** \n\t Python, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\t FastAPI, Flask, Django, Odoo\n\n **Frontend Frameworks:** \n\t React, Vue, Angular\n\n **API Technologies:** \n\t Keycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:** \n\t AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:** \n\t PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:** \n\t Docker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\t AWS, Azure\n\n **Other:** \n\t AI/ML (MLflow, Airflow, Kubeflow), data migration, business process analysis, system integration, database management, technical support, documentation, communication, problem-solving, self-motivated",
  "apply_company": "Twine"
}