{
  "name": "Rei Taro",
  "role_name": "Senior Mechanical Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Mechanical Engineer with over 10 years of experience in **mechanical engineering**, specializing in **3D CAD** design and development using **CATIA V5**, **Siemens NX**, and **SolidWorks**. Proficient in **PLM** solutions such as **3DExperience**, **Enovia**, **Teamcenter**, and **Windchill**, combined with expertise in **Finite Element Analysis (FEA)**, **Computational Fluid Dynamics (CFD)**, and tolerance stack-up analysis. Strong background in **Design for Manufacturing (DFM)** and **Design for Assembly (DFA)**, ensuring high-quality outputs and effective problem-solving strategies. Effective communicator with demonstrated ability to organize and manage time efficiently, fostering collaborative work environments that drive project success. Highly detail-oriented and proactive in adopting innovative practices including **additive manufacturing** and **rapid prototyping** to enhance engineering processes.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Mechanical Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **3D CAD** tools such as **CATIA V5**, **Siemens NX**, and **SolidWorks** to design complex mechanical systems and components, enhancing product efficiency by **25%**.\nConducted **tolerance stack-up analysis** and applied **GD&T** principles to ensure design specifications meet stringent requirements, reducing manufacturing errors by **15%**.\nImplemented **PLM** systems including **Teamcenter** and **Windchill** to streamline product development cycles, improving team collaboration by **30%**.\nDeveloped and tested prototypes using **additive manufacturing** techniques and **rapid prototyping** methods, cutting development time by **40%**.\nCollaborated cross-functionally with design, manufacturing, and quality assurance teams to address system challenges and enhance project delivery efficiency.\nLed documentation efforts and created clear engineering specifications to standardize processes, resulting in improved communication and organization within project teams.\nApplied **DFM** and **DFA** analyses to optimize designs for manufacturability and assembly, contributing to a **20%** reduction in production costs."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **3D CAD** software including **CATIA V5**, **Siemens NX**, and **SolidWorks** to design and develop new product designs, which improved development efficiency by **30%**.\nConducted **FEA** (Finite Element Analysis) and **CFD** (Computational Fluid Dynamics) simulations to validate design performance under various conditions, resulting in a reduction of prototype iterations by **40%**.\nImplemented **DFM** (Design for Manufacturing) and **DFA** (Design for Assembly) principles to enhance product manufacturability and assembly efficiency, decreasing production costs by **15%**.\nManaged product lifecycle utilizing **PLM** tools such as **3DExperience**, **Enovia**, **Teamcenter**, and **Windchill** to streamline documentation and change management processes, ensuring compliance with regulatory standards.\nPerformed tolerance stack-up analysis to ensure design integrity and functionality, mitigating assembly issues before production.\nEngaged in rapid prototyping and additive manufacturing techniques to innovate design solutions and accelerate project timelines, achieving prototype readiness in **2 weeks**.\nCultivated strong communication and collaboration skills while working within cross-functional teams, ensuring timely project delivery and successful completion of design reviews."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Developed intricate 3D CAD models for mechanical systems using **CATIA V5**, **Siemens NX**, and **SolidWorks** to ensure precise engineering designs that meet project specifications.\nEngineered detailed **DFM (Design for Manufacturing)** and **DFA (Design for Assembly)** analyses to optimize design efficiency, resulting in a 30% reduction in production costs.\nConducted **FEA (Finite Element Analysis)** and **CFD (Computational Fluid Dynamics)** simulations to validate design integrity, enhancing product performance by 25% and reducing time to market.\nCollaborated with cross-functional teams utilizing **3DExperience** and **Enovia** for effective project management and documentation, ensuring all projects met deadlines with over 95% on-time delivery.\nImplemented effective **tolerance stack-up analysis** techniques to minimize manufacturing errors, leading to a 15% improvement in product quality metrics.\nManaged project documentation meticulously, maintaining detailed records to meet **PLM (Product Lifecycle Management)** requirements and facilitate easy information retrieval.\nProactively communicated with team members to foster collaboration and problem-solving strategies, ensuring all engineering challenges were promptly addressed and resolved.\nUtilized **Windchill** and **Teamcenter** for version control and project tracking, streamlining the design process and enhancing organizational efficiency by 20%."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tmechanical engineering, 3D CAD, CATIA V5, Siemens NX, SolidWorks, Creo, PLM, 3DExperience, Enovia, Teamcenter, Windchill, FEA, CFD, tolerance stack-up analysis, DFM, DFA, GD&T, additive manufacturing, rapid prototyping, documentation, problem-solving, communication, organization, time management, collaboration, detail-oriented, proactive",
  "apply_company": "LUMINA"
}