{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Android Security Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Skilled Android Security Engineer with over 13 years of full stack development experience in high-performance applications within healthcare and financial sectors. Proficient in mobile security, reverse engineering, and troubleshooting, with a strong emphasis on understanding vulnerabilities, exploits, and firmware. Adept at coding in **Java** and leveraging **C**/**C++** for security solutions. Experienced in using tools like **Frida**, **Ida**, and **Ghindra** for in-depth analysis and reverse engineering of mobile applications.\n\nIn addition to security expertise, I possess hands-on skills in **JavaScript/TypeScript**, **Python**, and **Flutter** for versatile application development. Proven track record in AI/ML-powered platform development for predictive analytics and real-time processing, alongside deploying cloud-native systems on **AWS** and **Azure**. Familiar with aligning solutions with compliance standards including HIPAA, FHIR, PCI DSS, and SOC 2, while also having a solid background in MLOps using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Android Security Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted in-depth **analysis** and **troubleshooting** of **Android** applications to identify and mitigate **vulnerabilities**, ensuring compliance with mobile security standards.\nUtilized **C** and **C++** for developing tools that enhance mobile app **security** and reverse engineering processes, optimizing performance across various platforms.\nPerformed **reverse engineering** on firmware using tools like **Frida**, **Ida**, and **Ghindra** to uncover potential **exploits** and security issues in **Android** applications.\nLed a team in implementing robust permissions strategies to prevent unauthorized access and ensure secure operation in mobile environments.\nExecuted rigorous **testing strategies** focusing on **mobile security**, assessing application resilience against identified **vulnerabilities** through automated and manual testing.\nDeveloped and maintained security protocols to monitor **Android** application behavior and user permissions, enhancing **mobile security** standards by **30%**.\nCollaborated with cross-functional teams to integrate security features into the mobile app development lifecycle, training team members on best practices for **Android** security.\nConducted regular audits and analysis of applications, leveraging data from tools to improve security resilience against evolving threats, achieving a **25%** reduction in reported vulnerabilities over **6 months**.\nDocumented security findings and created detailed reporting to guide future development and technical strategies, maintaining a secure coding standard across teams.\nEnhanced troubleshooting techniques to swiftly address emerging security challenges within mobile applications, reducing response time by **40%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Conduct thorough **analysis** and **troubleshooting** of Android applications to identify vulnerabilities, ensuring robust **mobile security**.\n- Utilize **C++** and **Java** for building and enhancing security tools aimed at detecting **exploits** in mobile firmware.\n- Perform **reverse engineering** of applications using tools like **Frida**, **Ida**, and **Ghindra** to assess security posture and detect weaknesses in **permissions** handling.\n- Develop and implement protocols for testing and mitigating security risks associated with **Android** app development and updates, focusing on **Android 12** and above.\n- Create documentation reporting vulnerabilities and analysis findings based on **C** and **C++** code structures and behavior.\n- Collaborate with cross-functional teams to address **firmware vulnerabilities**, providing actionable insights based on risk assessment.\n- Lead training sessions to increase awareness about **mobile security**, best practices in app development, and common **security exploits** among developers.\n- Review and audit third-party libraries used in Android applications, ensuring compliance and security standards are met, specifically utilizing versions beyond **3.0**.\n- Participate in the development of automated tools for scanning and testing applications for vulnerabilities, adapting to rapid technology changes and updates in the industry."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Performed in-depth analysis and troubleshooting of mobile security vulnerabilities in Android applications, leveraging **C** and **C++** for developing robust security solutions.\nApplied reverse engineering techniques using tools such as **IDA**, **Ghidra**, and **Frida** to identify and exploit vulnerabilities in firmware and applications, increasing the security posture of mobile platforms by **30%**.\nEngineered secure mobile applications by implementing permission models and access controls, ensuring compliance with industry standards and secure handling of sensitive user data.\nUtilized **Java** for developing security features to detect and mitigate exploits in Android systems, successfully reducing potential threats by **25%**.\nConducted comprehensive security assessments and penetration testing on Android firmware, reporting vulnerabilities, and providing remediation strategies while utilizing advanced analysis techniques.\nDeveloped tools and scripts in **Python** and **Java** for automated security audits, streamlining the analysis process and enhancing efficiency by **40%**.\nCollaborated with cross-functional teams to establish security protocols and best practices for Android applications, continuously improving overall security measures in line with emerging threats and vulnerabilities.\nDocumented findings, methodologies, and strategic recommendations for ongoing security improvements and compliance with GDPR and other regulatory requirements."
    }
  ],
  "skills": "**Programming Languages:**\n\tC, C++, Java, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tAndroid, Frida, Ida, Ghindra, mobile security, reverse engineering, vulnerabilities, exploits, analysis, troubleshooting, Keycloak, Nginx, Let’s Encrypt, Certbot, MLflow, Airflow, Kubeflow"
}