{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Cyber Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a Senior Cyber Engineer with 8+ years of expertise, I excel in utilizing **Python** for robust security solutions while demonstrating a strong command of network security protocols including **firewalls**, **TCP/IP**, and both **network IDS** and **host-based IDS**. My proficiency extends to **endpoint protection**, **SIEM**, and **DLP**, ensuring comprehensive protection for systems. I possess advanced skills in scripting with **Bash** and **Powershell**, enabling efficient automation and incident response. With a proven track record in **threat hunting** and incident management, I leverage tools such as **Power BI** for data visualization and reporting, supplementing my technical acumen with exceptional **documentation**, **organizational**, and **collaboration** abilities. Additionally, my background includes building high-performance applications for diverse sectors, always aligned with industry best practices in cybersecurity.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Cyber Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Collaborated with cross-functional teams to enhance cybersecurity strategies using **Python**, ensuring streamlined incident response and threat hunting processes.\n• Developed and managed incident response workflows and playbooks, improving organizational documentation and time management for security incidents.\n• Implemented advanced threat detection techniques utilizing **SIEM** solutions to monitor network traffic, including firewalls and **TCP/IP** architecture, enhancing network security posture.\n• Configured and maintained **endpoint protection** software and **web proxies** to safeguard sensitive data and ensure compliance with security policies.\n• Automated incident response and threat hunting tasks using **Bash** and **Powershell**, boosting efficiency by **30%**.\n• Conducted regular reviews and audits on existing security measures, leveraging **Power BI** for visual reporting and compliance status updates.\n• Collaborated on the design and implementation of security controls, focusing on integration with existing **network IDS** and **host-based IDS** to create a comprehensive security environment.\n• Mentored junior engineers on cybersecurity best practices, incident response protocols, and secure coding in **Python**, fostering an environment of continuous learning.\n• Utilized DLP (Data Loss Prevention) strategies to protect sensitive data across various endpoints and platforms, achieving a **40%** decrease in data breaches.\n• Ensured that all security documentation was up-to-date, comprehensive, and accessible across teams, enhancing overall organizational skills and collaboration efforts.\n• Participated in threat hunting exercises and vulnerability assessments, contributing to a proactive cybersecurity strategy.\n• Integrated **email protection** measures to mitigate phishing attempts and other cyber threats, maintaining a secure communication infrastructure.\n• Engaged in continuous professional development in cybersecurity trends and technologies, applying that knowledge to enhance current practices and incident response strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and integrated **Python** solutions with a focus on security protocols, ensuring robust defenses against threats in line with best practices in **Incident Response** and **Threat Hunting**.\n• Collaborated on the implementation of **firewalls** and **network IDS** tools within **TCP/IP** frameworks to detect and mitigate potential security breaches.\n• Designed and documented security processes, enhancing **DLP** and **SIEM** practices to safeguard sensitive data from breaches and comply with regulatory standards.\n• Utilized **Bash** and **Powershell** for automation of routine tasks, streamlining security operations and enhancing overall efficiency in incident management.\n• Implemented and maintained endpoint protection measures, ensuring timely updates and compliance with organizational policies for enhanced cyber defense.\n• Conducted thorough security assessments and threat analyses, leveraging **web proxies** and **email protection** technologies to identify and resolve vulnerabilities.\n• Engaged in **collaboration** across teams to enhance organizational **documentation** and incident reporting, improving response times by **20%**.\n• Managed time effectively to prioritize and address multiple incidents concurrently, using strong **organizational skills** to maintain focus on critical security operations.\n• Developed interactive visualizations and reports using **Power BI** to monitor security metrics and provide insights into system vulnerabilities and incident response effectiveness.\n• Participated in ongoing training and simulations to enhance team skills in **Incident Response**, resulting in a **30%** improvement in response effectiveness during breach simulations.\n• Conducted regular audits of security protocols and infrastructure, identifying **25+** areas for improvement and ensuring adherence to industry standards.\n• Leveraged collaboration and communication skills to work closely with cross-departmental teams, fostering a culture of security awareness and proactive threat management."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Conducted thorough **incident response** and **threat hunting** utilizing **Python** to automate analysis and reporting processes, enhancing detection and remediation efforts for security incidents.\nDeveloped and maintained clear **documentation** for security protocols, incident reports, and operational procedures, ensuring effective **organizational skills** within the team.\nManaged and configured **firewalls** and **web proxies** to safeguard network perimeter, proactively mitigating potential risks and vulnerabilities.\nImplemented and monitored **SIEM** tools to analyze logs from various sources, optimizing **network IDS** and **host-based IDS** systems for improved security posture and incident detection.\nCollaborated across teams to integrate **endpoint protection** solutions, ensuring comprehensive **email protection** and data loss prevention (**DLP**) measures were in place.\nExecuted **TCP/IP** troubleshooting techniques using **Bash** and **PowerShell** to identify and resolve network security issues, enhancing system reliability.\nUtilized **Power BI** for visualizing security metrics, enabling data-driven decision making and improving overall communication within teams, leveraging strong **collaboration skills**.\nEffectively managed time to prioritize critical security tasks and respond swiftly to alerts, demonstrating exceptional **time management** in high-pressure environments.\nDesigned and implemented security policies and procedures, aligning with best practices while ensuring compliance with industry standards and regulations.\nProvided mentorship to junior engineers, fostering an environment of continuous improvement and knowledge sharing within the cybersecurity team."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Bash, Powershell\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQLAlchemy\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Cloud & Infrastructure:**\n\tNginx, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Certbot\n\n **Other:**\n\tIncident Response, Threat hunting, firewalls, TCP/IP, network IDS, host-based IDS, endpoint protection, SIEM, DLP, web proxies, email protection, Power BI, documentation, time management, organizational skills, collaboration",
  "apply_company": "Robert Walters"
}