{
  "name": "Mariusz Jan Skobel",
  "role_name": "Back End Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Back End Engineer with 10+ years of experience in software engineering, specializing in delivering high-performance software solutions in healthcare and finance. Expert in **Java**, **Spring Boot**, **Micronaut**, and proficient in **AWS** for cloud deployment. Skilled in building robust microservices architectures and implementing event sourcing strategies using **Kafka**. Hands-on experience in **Kubernetes** and **Docker** for containerization and orchestration, ensuring application security and compliance standards. Proven ability in software design and database design, focused on delivering data-driven insights. Additionally, I possess a strong foundation in modern technologies like **JavaScript/TypeScript**, **Python**, and **Flutter**, with experience in full-stack development using frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, and backend frameworks like **FastAPI** and **Django**. Committed to building secure, maintainable solutions that drive real-world impact and contribute to intelligent decision-making.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Back End Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped robust back-end services using **Java**, **Spring Boot**, and **Micronaut**, ensuring enterprise-level application security and best practices in software engineering.\n•\tDesigned and implemented event sourcing architectures leveraging **Kafka** for real-time data streaming and processing, enhancing application responsiveness with low latency.\n•\tContainerized applications using **Docker** and orchestrated them with **Kubernetes**, ensuring seamless deployment across **3** different cloud environments.\n•\tCreated and maintained scalable database designs optimizing for performance and data integrity, utilizing **PostgreSQL** and **MongoDB** for efficient data storage solutions.\n•\tImplemented advanced data-driven insights, integrating analytics services that increased operational efficiency by **25%**.\n•\tLed the development of automated CI/CD pipelines using **AWS** services, reducing deployment time by **40%** and improving code quality through rigorous testing.\n•\tCollaborated with cross-functional teams to design software solutions that align with business goals, focusing on high availability and fault-tolerant systems.\n•\tEnsured adherence to software design principles, enhancing the maintainability and scalability of back-end services.\n•\tIntegrated application monitoring solutions to track performance metrics, driving continuous improvement initiatives based on data analysis.\n•\tParticipated in code reviews and pair programming sessions, fostering a culture of knowledge sharing and improving team outcomes."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented back-end solutions using **Java**, **Spring Boot**, and **Micronaut**, enhancing system performance and scalability in financial applications.\nDesigned and maintained databases, ensuring optimal **database design** and security for sensitive financial information.\nLed the containerization of applications using **Docker** and orchestrated deployments with **Kubernetes**, resulting in a 50% improvement in deployment times and a 30% reduction in infrastructure costs.\nUtilized **Kafka** for developing a reliable event-driven architecture, supporting scalable and resilient transaction processing systems.\nDeveloped and integrated **event sourcing** patterns, enabling accurate state recovery and efficient data handling in large-scale financial systems.\nEngineered data-driven insights through advanced analytics, employing **AWS** tools for improved decision-making strategies within financial operations.\nConducted software engineering best practices and software design patterns to boost application efficiency and security, resulting in a 40% reduction in vulnerabilities.\nCollaborated on agile teams to deliver high-quality software solutions, achieving an average sprint velocity of 30 story points over **9** sprints."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Engineered scalable backend services for high-performance applications using **Java** and **Spring Boot** to ensure low latency and support for up to **100,000** concurrent users.\n• Implemented microservices architecture using **Micronaut** alongside **Docker** containers for isolated deployment environments, increasing maintainability and deployability of business services by **30%**.\n• Designed and optimized data-driven insights utilizing **AWS** services for data storage and processing, resulting in improved data retrieval times by **50%**.\n• Integrated event sourcing patterns with **Kafka** to ensure reliable message broker solutions, facilitating fault-tolerant event-driven architecture for better system resilience.\n• Applied robust software engineering principles and software design patterns to enhance application security, minimizing vulnerabilities and exceeding **OWASP** guidelines.\n• Developed and maintained database design strategies ensuring data integrity and high availability using **PostgreSQL** and **Redis**.\n• Leveraged event-driven architecture to create responsive and efficient user experiences, incorporating techniques to facilitate real-time data processing and updates across applications.\n• Led team in implementing **Kubernetes** for orchestration, achieving seamless rollouts of applications and maintaining compliance with best development practices.\n• Championed application security measures, including **role-based access control (RBAC)** and secure user authentication protocols to ensure user data protection and align with **GDPR** standards.\n• Closely collaborated with front-end developers to create cohesive APIs aligned with frontend technologies while ensuring a smooth integration path."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tSpring Boot, Micronaut, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKafka, OIDC, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose, AWS RDS, S3, Azure Blob, SQL\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, software engineering, software design, database design, application security, event sourcing, data driven insight"
}