{
  "name": "Tomasz Lee",
  "role_name": "Senior Power Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Dynamic Senior Power Engineer with 9+ years of experience in software development, specializing in **PowerPlatform**, **PowerPages**, and **C#**. Proficient in **JavaScript** and skilled in **Solution Architecture** with a strong focus on delivering high-quality software solutions. Knowledgeable in Software Testing, Error Analysis, and Documentation, ensuring robust application performance and reliability. Demonstrated leadership in **Team Collaboration** to drive projects to successful completion while also skilled in **Budget Estimation**. Bilingual in German and English, facilitating effective communication in diverse teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Power Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and maintained solutions using **PowerPlatform** and **PowerPages**, enhancing application performance and user experience.\nDesigned software architecture with a focus on **C#** and **JavaScript**, leveraging **.NET** technologies to deliver robust solutions.\nImplemented comprehensive software testing practices, ensuring code quality and reliability throughout the development lifecycle.\nCollaborated with cross-functional teams to analyze requirements and devise solutions, demonstrating strong **Team Collaboration** skills.\nConducted budget estimation for projects, ensuring resource allocation aligns with business objectives.\nUtilized error analysis techniques to identify and resolve issues quickly, maintaining high standards of application performance.\nPrepared detailed documentation for system designs and functionalities, facilitating knowledge sharing and onboarding processes.\nLed engaging sessions in both **German** and **English** to support diverse team members, enhancing communication and collaboration.\nEnhanced existing applications through iterative improvements, reducing errors by **30%** and improving user engagement by **20%**.\nSpearheaded the integration of **JavaScript**, **PowerPlatform**, and various cloud services to provide comprehensive solutions, achieving a **40%** increase in deployment efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **PowerPlatform** and **PowerPages** to create user-friendly applications, optimizing workflows and enhancing team collaboration.\nEmployed **JavaScript** and **C#** in developing cutting-edge features for cloud-based project management, improving operational efficiency by **15%**.\nImplemented robust software testing protocols to ensure high-quality deliverables, leading to a **30%** reduction in production deployment errors.\nArchitected solutions leveraging **SolutionArchitecture** principles, resulting in scalable and maintainable software systems.\nManaged budget estimation and resource allocation effectively, aligning project costs with organizational goals.\nConducted thorough error analysis to identify and mitigate risks during the software development lifecycle, improving reliability.\nDeveloped comprehensive documentation for technical processes and user guides, enhancing team knowledge and retention.\nFacilitated team collaboration through agile methodologies, ensuring timely project delivery and adherence to deadlines.\nLed mentoring initiatives for junior developers, fostering an environment of learning and productivity improvements.\nDemonstrated proficiency in both German and English to collaborate with diverse teams and stakeholders effectively."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **PowerPlatform** and **PowerPages** to design and implement dynamic solutions for enhancing internal processes, leading to a **15%** increase in operational efficiency.\nEmployed **JavaScript** and **C#** to create robust functions for application features, improving user experience across platforms.\nConducted rigorous **Software Testing** to ensure the reliability and performance of applications, achieving a **99%** issue resolution rate prior to deployment.\nDeveloped comprehensive **Documentation** to facilitate knowledge transfer and onboarding, reducing training time by **25%** for new team members.\nCollaborated in project **Solution Architecture** sessions to align team efforts with clients’ long-term visions and regulatory requirements.\nLed budget estimation processes, ensuring project costs were met while delivering high-quality solutions within the allocated budget.\nPerformed **Error Analysis** on production systems to identify and rectify issues swiftly, enhancing overall system stability.\nFostered **Team Collaboration** through regular coding sessions and feedback loops, creating a culture of continuous improvement.\nCommunicated effectively in both **German** and **English** with diverse teams and stakeholders, facilitating seamless project execution across regions."
    }
  ],
  "skills": " **Programming Languages**\n\tJavaScript, C#, Python\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\tHTML, CSS, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\tPowerPlatform, PowerPages\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n **Cloud & Infrastructure**\n\tDocumentation, SolutionArchitecture\n\n **Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, SoftwareTesting, BudgetEstimation, ErrorAnalysis, TeamCollaboration, German, English, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Yaveon"
}