{
  "name": "Patryk Zaslawski",
  "role_name": "Senior DevOps Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a seasoned Senior DevOps Engineer with 8+ years in software engineering, I possess advanced skills in **AWS**, **CI/CD**, **Python**, **Git**, **Jenkins**, **Docker**, **Kubernetes**, and **Terraform**. I excel at developing automated deployment pipelines and managing infrastructure-as-code to enhance operational efficiency. My proficiency in **Ansible**, **CloudFormation**, and configuration management tools like **Chef** and **Puppet** enables me to optimize system performance across diverse environments. I have a solid background in databases including **Oracle**, **MySQL**, and **PostgreSQL**, ensuring data integrity and reliability. I am skilled in **microservices** architecture and am adept at troubleshooting and supporting open-source technologies. My unique strengths—innovation, flexibility, adaptability, and strong communication—allow me to effectively collaborate within cross-functional teams to drive successful project outcomes in e-commerce, financial, and healthcare domains.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **AWS** cloud services to optimize systems architecture and support high availability in deployments of **Python** applications.\nDeveloped and maintained **CI/CD** pipelines using **GitHub Actions** and **Jenkins**, ensuring automated testing and deployment practices are in place for robust software delivery.\nLed the design and implementation of infrastructure as code (IaC) using **Terraform** and **CloudFormation**, enabling reliable and repeatable provisioning across environments.\nManaged containerized applications using **Docker** and orchestrated services with **Kubernetes**, improving scalability and operational efficiency of distributed systems.\nImplemented monitoring and observability solutions with **Prometheus** and **Grafana**, enabling proactive system health checks and performance tracking for production environments.\nDefined and enforced DevOps best practices, adopting Agile methodologies and fostering collaboration across cross-functional teams to drive project success.\nExecuted efficient troubleshooting strategies and resolved system issues using **Bash** and **PowerShell** scripting, significantly reducing downtime.\nGuided junior engineers in developing **Microservices** architecture in **Python**, promoting innovation and open-source technologies in project execution.\nIntegrated version control practices using **Git** and **SVN**, ensuring code quality and collaborative contributions throughout the software development life cycle.\nOptimized database interactions with **PostgreSQL** and **MySQL**, applying advanced querying techniques and performance tuning measures for data-intensive applications.\nFacilitated code reviews and mentoring sessions, strengthening technical skills and communication within the team of over **10** engineers, resulting in enhanced productivity.\nUtilized configuration management tools such as **Chef** and **Ansible** for seamless deployment and maintenance of development, testing, and production environments.\nMaintained Linux-based systems (**Ubuntu**, **CentOS**, and **RedHat**) for hosting application infrastructure, ensuring optimal security and performance measures are consistently applied.\nDeveloped customized scripts and automation solutions to alleviate operational tasks, enhancing flexibility and adaptability within the team while streamlining workflows."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Led the development and migration to a **Python** (FastAPI, Django, Flask) microservices-based backend architecture, improving scalability, maintainability, and performance while integrating services with **SQL Server**, **PostgreSQL**, and **MongoDB** for seamless data management.\n• Developed and maintained CI/CD pipelines with **GitHub Actions**, ensuring efficient deployment and integration that reduced overall deployment time by **30%**.\n• Managed **Kubernetes** clusters for deploying **Python** microservices, enabling rolling updates, auto-scaling, and high availability to support **50+** microservices in production.\n• Designed and implemented RESTful and gRPC APIs in **Python**, ensuring secure communication between internal applications with real-time transaction updates.\n• Applied best practices in **Python** development, including automated unit testing with PyTest, ensuring backend service reliability across **99.9%** uptime.\n• Developed real-time transaction monitoring dashboards powered by **Python** APIs with **Angular** UI, integrated with **Power BI** for reporting and analytics.\n• Implemented system integrations with **MuleSoft** and **Python** services to streamline ACH transfers, improving transaction efficiency.\n• Enhanced security in **Python** services by applying encryption, RBAC, OAuth 2.0, and JWT, ensuring compliance with financial regulations.\n• Built secure payment gateway integrations in **Python** for ACH transfers and credit card payments, ensuring PCI-compliance.\n• Configured and managed **Azure Service Bus** with **Python** services for reliable message brokering between microservices.\n• Developed serverless components in **Python** using **AWS Lambda** and **Azure Functions** for ETL pipelines, reducing infrastructure overhead by **20%**.\n• Implemented the ELK stack (**Elasticsearch**, **Logstash**, **Kibana**) with **Python** services for centralized logging and performance tracking.\n• Integrated unit tests, static analysis, and CI/CD pipelines with **Azure DevOps**, ensuring agile methodologies and continuous delivery.\n• Contributed to event-driven architectures using **Kafka** and **RabbitMQ** to improve performance and resourcing efficiency for transactional data handling."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "- Designed and optimized CI/CD pipelines using **GitHub Actions**, **Jenkins**, and **Azure DevOps**, ensuring consistent and reliable delivery of features and improving deployment frequency by **30%**.\n- Containerized applications with **Docker**, streamlining deployments and enabling scalable operations across multiple environments.\n- Developed automation scripts in **PowerShell** and **Bash** to manage infrastructure as code with tools like **Terraform** and **CloudFormation**, reducing manual effort in deployment by **40%**.\n- Utilized **Kubernetes** for orchestration of containerized applications, enhancing system reliability and achieving auto-scaling in response to workload changes, improving uptime by **25%**.\n- Collaborated with cross-functional teams to troubleshoot issues in production environments, leveraging **Linux** expertise and networking skills to enhance system performance and reliability.\n- Managed and optimized databases such as **MySQL**, **PostgreSQL**, and **Oracle**, ensuring high availability and backup strategies to maintain data integrity during deployment cycles.\n- Implemented configuration management tools like **Ansible** and **Chef** to automate setup processes, increasing configuration consistency across environments by **50%**.\n- Monitored system performance and health using open-source technologies, ensuring critical services maintained optimal performance levels and aligning with SLAs.\n- Engaged in continuous innovation and flexible adaptation of processes to align with evolving operational needs, contributing to a culture of collaboration and agility within the team.\n- Conducted performance testing with tools like **Apache JMeter** to identify bottlenecks and optimize microservice architectures, ensuring applications handle peak traffic loads effortlessly.\n- Fostered robust communication skills to articulate technical concepts clearly to non-technical stakeholders, enhancing team collaboration and project alignment."
    }
  ],
  "skills": "Programming Languages:\n\tPython\n\nBackend Frameworks:\n\tFastAPI, Django, Flask, Spring Boot\n\nFrontend Frameworks:\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\nAPI Technologies:\n\tREST & gRPC APIs\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda), Azure (App Services)\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Oracle\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Ansible, Terraform, CloudFormation, Helm, Pulumi, Code Deploy\n\nCloud & Infrastructure:\n\tAWS (S3, RDS), Azure (Blob, SQL), Linux, Amazon Linux, CentOS, RedHat, Ubuntu\n\nOther:\n\tPowerShell, Bash, Git, SVN, Microservices, Troubleshooting, Open-source technologies, Networking, Innovation, Flexibility, Adaptability, Communication, Collaboration",
  "apply_company": "MAK-SYSTEM"
}