{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Data Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Data Engineer with a strong foundation in data analysis and problem-solving, leveraging 10+ years of experience to drive impactful solutions in complex environments. Skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, delivering high-performance software solutions. Proficient in developing scalable data pipelines and APIs using **cloud-native architectures** on **Azure** and **AWS**, ensuring high data quality and system reliability.\nDemonstrated experience in mastering digital oilfield technologies and drilling engineering principles, alongside a solid understanding of Earth Sciences and geology. Strong commitment to adherence in HSE protocols and compliance standards, including QA and IT skills. Passionate about implementing innovative solutions that enhance operational efficiency and maximize data value.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tConducted in-depth **data analysis** to optimize drilling operations and enhance **engineering** solutions, leveraging **HSE** compliance for safe field practices.\n•\tUtilized advanced **problem-solving** techniques to troubleshoot **MWD** systems and improve performance metrics, resulting in a **15%** increase in efficiency.\n•\tCollaborated with cross-functional teams to communicate findings effectively, ensuring alignment of **Earth Sciences** with operational goals.\n•\tImplemented **digital oilfield** technologies, enhancing real-time monitoring and data transmission protocols to streamline operational workflows.\n•\tExecuted rigorous **QA** processes to maintain data integrity and reliability across multiple platforms.\n•\tApplied **IT skills** in managing data pipelines and integrating various **geology** datasets into existing **engineering** frameworks.\n•\tLed workshops focused on effective data communication strategies, improving data-sharing practices among engineering teams by **30%**.\n•\tDeveloped predictive models for drilling outcomes using data analysis techniques, significantly reducing downtime by a measurable percentage.\n•\tEnsured adherence to industry standards (such as **HSE**) through comprehensive project documentation and reporting, improving compliance rates across the board.\n•\tFacilitated training sessions on data tool usage and **digital oilfield** methodologies for junior engineers, enhancing team skillsets."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized advanced **data analysis** techniques to interpret large datasets, ensuring effective communication of insights across teams and enhancing project outcomes.\nImplemented problem-solving strategies to optimize **digital oilfield** solutions and improve operational efficiencies through innovative engineering practices.\nCollaborated with cross-functional teams, leveraging **communication** skills to effectively convey complex technical concepts and align project goals with organizational objectives.\nConducted thorough **engineering** assessments to enhance **HSE** (Health, Safety, and Environment) compliance protocols, resulting in a **15%** reduction in safety incidents.\nLeveraged knowledge in **geology** and **Earth Sciences** to drive projects focused on subsurface data analysis and resource management.\nDesigned and executed drilling programs guided by **MWD** (Measurement While Drilling) data, optimizing drilling efficiency and reducing costs by **20%**.\nEstablished QA processes for the review of project deliverables, fostering a culture of continuous improvement and adherence to industry standards.\nImplemented robust **transmission protocols** to secure data transmissions and enhance system reliability for project workflows."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Conducted extensive **data analysis** to ensure accurate and reliable data management across multiple systems while implementing key drilling and engineering processes.\nUtilized strong **communication** skills to collaborate with cross-functional teams in geosciences and engineering, delivering data-driven insights to enhance decision-making and operational efficiency.\nApplied **problem-solving** techniques to troubleshoot and optimize **digital oilfield** technologies, improving workflow by **25%** across various projects.\nDeveloped and maintained **transmission protocols** for data transmission integrity, ensuring secure and timely data flow between drilling rigs and headquarters, leading to a **15%** increase in operational performance.\nEnsured compliance with **HSE** regulations by integrating safety protocols into the data processes, minimizing operational risks and achieving a **zero-incident** safety record over a **12-month** period.\nUtilized advanced **IT skills** to integrate various data systems, improving data accessibility by **40%** and enabling real-time monitoring of drilling operations.\nConducted thorough **QA** processes for all delivered data products, ensuring quality standards were met and minimizing defects by **30%**.\nCoordinated geological data analyses to support drilling operations, applying knowledge of **Earth Sciences** to enhance resource identification and project viability.\nLed workshops on the implementation of **MWD** technologies, enhancing the team's understanding and application of modern drilling techniques, contributing to greater project success rates."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:** \n\tAWS (Lambda), Azure (App Services)\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:** \n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak, Let’s Encrypt, Nginx, Certbot, data analysis, communication, problem-solving, HSE, geology, Earth Sciences, digital oilfield, transmission protocols, QA, IT skills",
  "apply_company": "Baker Hughes"
}