{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Sales Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a seasoned Senior Sales Engineer with 8 years of dynamic experience, I excel in leveraging **AWS**, **Docker**, **Kubernetes**, **JavaScript**, and **Python** to deliver high-performance solutions tailored for diverse clientele. My technical proficiency encompasses creating robust **RESTful APIs** and deploying applications in both Microsoft Windows Server and Linux environments, underpinned by a strong command of database management systems including **Oracle**, **MS SQL Server**, and **PostgreSQL**.\n\nI bring a unique blend of problem-solving skills and technical expertise, exemplified through my hands-on experience in enterprise-grade platform development, microservices architecture, and integration of cloud services. Additionally, my background is enriched with effective communication skills and team collaboration, fostering adaptability to meet client needs and enhance engagement.\n\nI am committed to delivering innovative solutions while providing effective presentations that resonate with stakeholders, ensuring a comprehensive understanding of our products and services.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Utilized **Windows Server**, **Linux**, and **AWS** for deploying scalable enterprise solutions while ensuring reliability and compliance with industry standards.\n- Developed and maintained **RESTful APIs** in **Python** and **JavaScript**, enhancing integration across multiple business systems.\n- Employed **Docker** and **Kubernetes** to implement containerization and orchestration for microservices, improving deployment efficiency by **30%**.\n- Spearheaded the migration of legacy systems using **Oracle** and **MS SQL Server** to modern databases like **PostgreSQL**, resulting in enhanced data integrity and access speed by **40%**.\n- Collaborated with cross-functional teams to troubleshoot storage management issues, employing effective **problem-solving** techniques to minimize downtime by **25%**.\n- Delivered presentations to stakeholders on new solutions leveraging **PowerShell** for automation, showcasing the impact on operational efficiency and cost reduction.\n- Enhanced client interaction and satisfaction through excellent **communication skills** and **team collaboration**, leading to a **15%** increase in customer retention rates.\n- Demonstrated **adaptability** by quickly learning new technologies and frameworks to meet evolving business needs, including modern **cloud services** and databases.\n- Implemented training sessions for junior engineers on best practices in **DevOps**, improving team productivity and cohesion in alignment with company goals."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Utilized **AWS** and **Docker** to lead the deployment and modernization of financial platforms, enhancing scalability and maintainability of high-volume transaction systems.\nImplemented **Linux** and **Windows Server** environments, ensuring optimal performance and reliability in diverse production settings.\nDeveloped and executed RESTful APIs using **Python** and **JavaScript** frameworks, facilitating seamless integration with front-end applications and external systems.\nCollaborated with cross-functional teams to deliver presentations and demonstrations, showcasing innovative solutions that leveraged **Power BI** for analytics and real-time data visualization.\nEmployed problem-solving skills to troubleshoot complex issues within cloud environments and database systems, resulting in a 30% reduction in downtime.\nManaged databases across multiple platforms including **MS SQL Server**, **Oracle**, and **PostgreSQL**, ensuring data integrity and accessibility for high-transaction workflows.\nOrchestrated containerized applications using **Kubernetes**, achieving a deployment success rate of 95% across various projects.\nFacilitated team collaboration through effective communication and adaptability, contributing to an 80% increase in project delivery efficiency.\nExecuted storage management strategies in environments utilizing **z/OS** and **AS/400**, enhancing data retrieval speeds by 40%."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "- Leveraged **AWS** to deploy and manage high-availability backend services for enterprise-level clients, achieving **99.9% uptime**.\n- Developed and optimized **RESTful APIs** using **Python** (FastAPI) and **JavaScript** (Node.js), ensuring scalability across diverse platform integrations.\n- Utilized **Docker** and **Kubernetes** to streamline the deployment process, reducing deployment times by **40%** and improving overall system reliability.\n- Collaborated with cross-functional teams to provide **problem-solving** strategies and ensure smooth integration of **Microsoft Windows Server** and **Linux** environments.\n- Conducted presentations to stakeholders, demonstrating the benefits of proposed solutions and showcasing technical capabilities, leading to **20% increase** in client engagement.\n- Managed database solutions including **PostgreSQL** and **MS SQL Server** to support high-volume transactional workloads while ensuring data integrity and performance.\n- Provided technical support and consultation for software applications, contributing to team collaboration and enhancing the overall client experience.\n- Applied **PowerShell** scripts for systems automation and routine maintenance tasks, increasing operational efficiency.\n- Trained junior team members on effective use of **storage management** techniques and cloud migrations, fostering an adaptable team environment.\n- Employed strong **communication skills** to explain complex technical concepts clearly to clients, facilitating smoother client relationships."
    }
  ],
  "skills": " \n\n**Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful API\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Oracle, MS SQL Server, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tMicrosoft Windows Server, Linux, PowerShell\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, z/OS, AS/400, IMS, storage management, problem-solving, presentation skills, communication skills, team collaboration, adaptability",
  "apply_company": "Rocket Software"
}