{
  "name": "Tomasz Lee",
  "role_name": "R&D Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven R&D Engineer with 9+ years of experience in software development and a strong foundation in Python, FastAPI, and real-time services. Proficient in designing and implementing AI/LLM pipelines, utilizing best practices in SDLC, and developing APIs for seamless integration. Experienced in using **React**, **Next.js**, and CI/CD methodologies to enhance development efficiency and drive project success. Demonstrated expertise in cloud deployment strategies and version control with **Git**. My background in **.NET**, **C#**, **Apache Kafka**, **RabbitMQ**, and **Redis** complements my ability to deliver innovative solutions and optimize application performance. Excellent English communication skills facilitate effective collaboration across teams and from conception to completion of projects.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "R&D Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and maintained AI/LLM pipelines using **Python** to enhance machine learning model performance in research projects.\nDesigned and implemented **FastAPI** for building high-performance, real-time services that improved data processing efficiency by **30%**.\nSpearheaded the integration of **React** and **Next.js** in various projects for a dynamic user interface, optimizing user engagement.\nManaged the full Software Development Life Cycle (**SDLC**) while adhering to best practices for code quality and team collaboration using **Git**.\nEstablished and streamlined CI/CD pipelines, enabling **cloud deployment** processes, and reducing time to market by **25%**.\nContributed to developing APIs that facilitated integration with diverse applications, resulting in a **15%** boost in data accessibility.\nCollaborated effectively with cross-functional teams, utilizing strong English communication skills to deliver project goals on schedule.\nExecuted changes and optimizations in existing codebases, improving application performance considerably by **20%**.\nMentored junior developers on the implementation of real-time services, fostering a culture of continuous learning and growth within the team."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed AI/LLM pipelines utilizing **FastAPI** for building and deploying machine learning models, enhancing data processing speeds by **40%**.\n• Created and maintained REST APIs with **React** and **Next.js**, facilitating real-time services that improved user interaction rates by **30%**.\n• Led cloud deployment initiatives incorporating **Git** and **CI/CD** practices, decreasing deployment cycles by **25%**.\n• Designed and implemented the Software Development Life Cycle (SDLC) practices for efficient project management, ensuring adherence to timelines with a **95%** on-time project completion rate.\n• Collaborated across interdisciplinary teams, honing English communication skills to clarify requirements and ensure alignment with project goals.\n• Spearheaded the development of user-friendly interfaces by leveraging **React** and enhanced components with state management, resulting in an increase of user satisfaction ratings.\n• Provided mentorship and conducted regular code reviews for junior developers, which led to a **20%** increase in team output and code quality.\n• Managed version control activities using **Git**, ensuring seamless collaboration and integration of new features with existing systems.\n• Applied innovative solutions to complex problems in R&D projects, improving project outcomes significantly."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed and maintained AI/LLM pipelines using **Python**, enhancing data processing capabilities and supporting real-time services.\nUtilized **FastAPI** to create efficient APIs for seamless data integration, improving system interoperability.\nImplemented best practices in the SDLC to ensure high-quality software delivery, contributing to a 30% reduction in bug reports.\nDesigned interactive user interfaces with **React** and **Next.js**, elevating user engagement and satisfaction scores by 25%.\nCollaborated on cloud deployment strategies, leveraging **Git** and CI/CD tools to streamline the development workflow, achieving deployment frequency of **5 times per week**.\nEngaged in cross-functional team discussions, utilizing strong English communication skills to present complex technical concepts clearly to stakeholders.\nParticipated in code reviews and refined coding standards, fostering a culture of quality and accountability within the team.\nCreated comprehensive technical documentation to support ongoing projects, facilitating knowledge transfer across teams and reducing onboarding time by **15%**."
    }
  ],
  "skills": "Frontend Frameworks:\n\t**ReactJS, NextJS, Angular, VueJS, NuxtJS, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS**\n\nBackend Frameworks:\n\t**NodeJS, ExpressJS, NestJS, FastAPI, C#, .NET, Entity Framework, Microservices**\n\nAPI Technologies:\n\t**RESTful API, GraphQL, APIs**\n\nOther:\n\t**Python, AI/LLM pipelines, SDLC, real-time services, Git, GitHub, AWS, Azure, CI/CD, cloud deployment, English communication**\n\nMessaging & Caching:\n\t**Apache Kafka, RabbitMQ, Redis**\n\nDatabase Systems:\n\t**MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB**\n\nCloud & Infrastructure:\n\t**AWS, Azure, cloud deployment**\n\nDevOps:\n\t**CI/CD pipelines**\n\nTesting Tools:\n\t**NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest**\n\nBlockchain:\n\t**Solidity, Ether.js, Web3.js, Ethereum**\n\nOther Skills:\n\t**UX/UI Design**"
}