{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Quality Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-oriented Senior Quality Engineer with 13+ years of experience in software testing and quality assurance methodologies. Proficient in **JavaScript**, **TypeScript**, and **Python**, with hands-on experience in **CI/CD pipelines** and automated testing frameworks like **Playwright**. Extensive knowledge of cloud environments including **AWS** and **Azure**, enhancing deployment strategies and performance testing.\nSkilled in troubleshooting, root cause analysis, and implementing process improvements to drive quality and efficiency. Background includes building high-performance applications and aligning solutions with compliance standards in the healthcare and financial industries.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Quality Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained scalable **CI/CD pipelines** using GitHub Actions, CircleCI, and Azure DevOps, ensuring automated testing and quality assurance across all deployments in **cloud environments** like **AWS** and **Azure**.\n• Implemented robust **software testing** methodologies, including performance testing and automated testing frameworks such as Playwright, Jest, and Cypress to enhance system stability and performance in web applications built with **JavaScript** and **TypeScript**.\n• Conducted thorough troubleshooting and root cause analysis to identify and resolve defects in complex systems, driving process improvement initiatives that increased quality and reduced time to market by up to **30%**.\n• Collaborated with cross-functional teams to enforce **QA methodologies** and ensure compliance with industry standards throughout the software development lifecycle.\n• Created, executed, and maintained automated test scripts to validate the functionality and performance of web applications, achieving a **95%** test coverage across critical features.\n• Assisted in the design and implementation of testing strategies for mobile applications developed with modern frameworks like Flutter and React Native, ensuring compatibility across **iOS** and **Android** platforms.\n• Actively participated in sprint planning sessions and retrospectives to continuously improve the workflow process, resulting in a notable reduction in bug rates by **20%**.\n• Engaged in continuous learning and professional development, staying updated with the latest trends and technologies in **JavaScript**, **Python**, and testing frameworks to maintain competitive edge."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **CI/CD pipelines** for automated deployment processes, using tools such as Jenkins and GitHub Actions, reducing deployment times by **30%**.\nConducted software testing across applications built with **JavaScript**, **TypeScript**, and **Python**, ensuring compliance with **QA methodologies** and improving overall product quality.\nDeveloped and executed automated testing scripts leveraging **Playwright** for cross-browser compatibility testing, enhancing end-user experience by identifying and resolving issues prior to product launch.\nUtilized **AWS** and **Azure** cloud environments to conduct performance testing and troubleshooting, leading to a **25%** increase in application efficiency.\nLed root cause analysis sessions, identifying critical issues in workflows and implementing process improvements that boosted task efficiency by **20%**.\nEvaluated and optimized existing test suites, integrating automated testing practices that resulted in a **40%** reduction in manual testing efforts.\nCollaborated closely with development teams to ensure software quality, employing proactive measures for performance testing and continuous improvement of existing processes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Ensured quality assurance across backend services using **Python** and **JavaScript** frameworks while implementing **CI/CD pipelines** for streamlined deployment, enhancing operational efficiency by **30%**.\nDeveloped and maintained **automated testing** frameworks utilizing **Playwright** and other testing libraries, achieving **95%** test coverage and reducing manual testing efforts by **40%**.\nExecuted thorough **performance testing** strategies to identify bottlenecks in systems, leading to a **25%** improvement in application response times across all platforms.\nApplied robust **troubleshooting** techniques and conducted **root cause analysis** for production incidents, reducing issue resolution time by **50%** and improving platform reliability.\nImplemented best practices in **QA methodologies** to enhance test processes, contributing to a significant reduction in defects identified post-release by **15%**.\nCollaborated with cross-functional teams in **cloud environments** like **AWS** and **Azure** to define and deploy testing strategies at every stage of the software development lifecycle, ensuring alignment with business goals.\nFacilitated process improvement initiatives that led to enhanced operational workflows, improving team productivity metrics by **20%**.\nParticipated in knowledge-sharing sessions, mentoring junior testers on software testing techniques and fostering a culture of quality within the organization."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob Storage, SQL Database)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD pipelines, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, cloud environments\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Software Testing, QA methodologies, automated testing, performance testing, troubleshooting, root cause analysis, process improvement, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}