{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior IT Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior IT Engineer with 8 years of experience in managing and securing enterprise environments, specializing in **Microsoft 365**, **Entra ID**, **Azure**, **PowerShell**, **Microsoft Graph**, and **Intune** for enhanced enterprise solutions. Proven track record in implementing **Conditional Access**, **DLP**, and **RBAC** to ensure compliance with industry standards, alongside expertise in **Teams**, **Exchange Online**, **SharePoint**, and **OneDrive** for streamlined collaboration. Skilled in **Identity Management** principles, incident response protocols, and security compliance frameworks, including **OAuth**, **OIDC**, and **SAML**.\n\nI leverage advanced automation techniques to enhance efficiency and incident management, while my foundational knowledge in network protocols such as **DNS**, **HTTP/S**, and **TCP/IP** provides a robust backdrop for problem-solving in complex environments. Additionally, I possess hands-on experience with cloud services, having developed solutions that incorporate **Microsoft Sentinel** and **Purview** to enhance data security and compliance measures. My original strengths lie in full-stack development utilizing **React**, **Node.js**, and **Django**, complemented by cloud architecture insights gained from previous roles in high-performance sectors such as healthcare and finance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior IT Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Managed and maintained Azure cloud services including **Azure**, **Exchange Online**, **SharePoint**, and **OneDrive** to ensure seamless collaboration and data security across platforms.\n- Developed automation scripts using **PowerShell** for incident response, security compliance, and management of resources in a **Microsoft 365** environment.\n- Integrated **Microsoft Graph** for enhanced data access and manipulation within **Microsoft 365** applications, supporting real-time updates and reporting based on user activity.\n- Implemented **Conditional Access** policies to strengthen security and compliance within the corporate environment, ensuring adherence to regulations and enhancing user access controls with **RBAC**.\n- Developed and managed data loss prevention (DLP) strategies across **Teams** and other collaborative platforms to safeguard sensitive information from unauthorized access.\n- Led the deployment of comprehensive security strategies using **Microsoft Defender** to protect corporate assets and ensure incident response protocols are effectively executed.\n- Conducted network configuration and troubleshooting on **TCP/IP** and **HTTP/S** protocols, optimizing performance and security of communication within the organization.\n- Established and maintained secure identity management protocols using **OAuth**, **OIDC**, and **SAML**, ensuring robust authentication methods for all users.\n- Collaborated with cross-functional teams to integrate **Microsoft Sentinel** for proactive threat detection and response, enhancing overall security posture.\n- Utilized **Azure Purview** for data governance and compliance, ensuring that sensitive data was classified and protected under industry regulations.\n- Provided support and training on using **Intune** for device management and security, ensuring a compliant and efficient work environment for **Microsoft 365** users.\n- Conducted incident response exercises to test and improve the organization’s ability to handle emerging security threats effectively."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Implemented **Microsoft 365** integration and managed incident response strategies, ensuring seamless communication and collaboration across teams using **Teams**, **Exchange Online**, and **SharePoint**.\n- Automated identity management processes utilizing **Azure Entra ID**, enhancing security compliance through robust **Conditional Access** policies and integration with **OAuth**, **OIDC**, and **SAML** protocols.\n- Designed and deployed security solutions within the **Azure** environment, implementing measures for **Microsoft Sentinel**, **Intune**, and **Defender**, achieving a **35%** reduction in security incidents.\n- Developed comprehensive data loss prevention (DLP) strategies, leveraging **PowerShell** to enhance data governance across **OneDrive** and **SharePoint**.\n- Configured and managed role-based access control (RBAC) across cloud resources, improving resource security and user management efficiency by **20%**.\n- Established monitoring and compliance frameworks using **Microsoft Graph** and **Purview**, facilitating real-time reporting and insights into security posture.\n- Managed DNS and network protocols (**TCP/IP**, **HTTP/S**) to ensure reliable system connectivity and security across cloud services.\n- Implemented automation for incident response workflows, reducing response time by **50%** while ensuring adherence to security compliance standards."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Microsoft 365**, **Azure**, and **Intune** to implement and manage identity and access solutions, driving enhanced security compliance and centralized management for user access across **Exchange Online**, **SharePoint**, and **OneDrive**.\nUtilized **PowerShell** to automate administrative tasks and streamline workflows, improving operational efficiency by **30%** through the automation of incident response protocols and security compliance checks.\nImplemented **Conditional Access** policies using **Microsoft Graph** to safeguard user authentication, enhancing security measures and ensuring a secure environment for over **10,000** users.\nDesigned and managed **RBAC** and **OAuth** implementations for secure access control across platforms, ensuring robust identity management compliant with GDPR standards, effectively protecting user data.\nConfigured and monitored **Microsoft Defender** and **Microsoft Sentinel** for proactive threat detection and incident response, reducing security incident response time by **40%** through real-time anomaly detection.\nEstablished **DNS**, **HTTP/S**, and **TCP/IP** best practices for seamless connectivity and enhanced security across organizational networks, optimizing data flow and reducing latency for critical applications.\nCollaborated with cross-functional teams to design and implement **DLP** strategies, safeguarding sensitive information and ensuring compliance with organizational policies.\nConducted security audits and assessments, utilizing **Purview** and other tools to ensure ongoing compliance with security frameworks, reducing vulnerabilities by **25%** over a **6-month** period.\nFacilitated technical training sessions leveraging **Teams** for staff on best practices in cloud security and operational protocols, fostering a culture of security awareness across the organization.\n"
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n  **API Technologies:**\n\tOAuth, OIDC, SAML, Microsoft Graph\n\n  **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n  **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\tAWS (ECS, S3, RDS), Azure (App Services, Blob, SQL)\n\n  **Other:**\n\tMicrosoft 365, Azure (Entra ID, Defender, Intune), PowerShell, Teams, SharePoint, OneDrive, Exchange Online, Conditional Access, DLP, RBAC, HTTP/S, TCP/IP, Microsoft Sentinel, Purview, Identity Management, Automation, Incident Response, Security Compliance",
  "apply_company": "Ideamine Technologies (Acquired by Netrix Global)"
}