{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Frontend Tech Lead",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Frontend Tech Lead with 8 years of experience, I excel in creating dynamic, high-performance web applications using **React**, **TypeScript**, **Next.js**, and UI/UX best practices. I have a strong focus on **i18n** implementations, **Crowdin** for localization, and leveraging **Turborepo** and **NX** for efficient multi-repo management. My expertise extends into SEO optimizations and PageSpeed enhancements, ensuring optimal analytics and A/B testing strategies for improved user engagement. \nAlongside my technical skills, I have a proven track record in stakeholder communication and process optimization, ensuring that project deliveries are aligned with business objectives and timelines. My experience spans the healthcare and financial sectors, where I've led teams to develop enterprise-grade platforms and integrations, ensuring compliance with industry standards. I bring a strong foundation in using collaborative tools such as **Figma** for design and emphasis on delivery-oriented methodologies.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Frontend Tech Lead",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Led the architecture and development of responsive, user-centric web applications using **React**, **TypeScript**, and **Next.js**, ensuring SEO optimizations and enhanced **PageSpeed** metrics.\n• Collaborated effectively with stakeholders to gather requirements and implement process optimization strategies, while maintaining strong English communication to articulate technical details and project status.\n• Utilized **i18n** and **Crowdin** for internationalization efforts, ensuring a seamless experience for users across different languages and regions, enhancing overall UI/UX design.\n• Developed and integrated third-party APIs and tools to enhance application functionality, continuously improving user engagement through analytics and AB testing methodologies.\n• Styled applications with design prototypes created in **Figma**, ensuring alignment with brand standards and stakeholder expectations.\n• Managed performance and optimization metrics for the applications, leading to a reduction in load times by **30%** and increased user satisfaction ratings.\n• Oversaw code quality and compliance through effective review processes, employing **NX** and **Turborepo** for managing monorepos, streamlining development workflows.\n• Advocated for a delivery-oriented approach, leading teams towards successful project completions within strict timelines, including a major release of a feature-rich application in **Q3 2023**.\n• Established best practices for testing and quality assurance, utilizing tools such as Jest and Cypress to ensure reliable and maintainable code across all development cycles."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **React** (18), **Next.js**, and **TypeScript** to create user-centric front-end applications, enhancing UI/UX for financial dashboards and admin portals.\nUtilized **i18n** and **Crowdin** for internationalization efforts, ensuring application usability across diverse user demographics and languages.\nOptimized site performance through **SEO optimizations** and **PageSpeed** enhancements, leading to improved search engine ranking and user engagement metrics by **30%**.\nCoordinated with stakeholders effectively, translating business requirements into technical specifications to streamline both project delivery and process optimization.\nDeveloped analytics solutions and integrated third-party tools, allowing for robust data insights that influenced strategic decision-making in product development.\nLed AB tests to evaluate user interactions and interface effectiveness, translating findings into actionable changes increasing the conversion rate by **15%**.\nChampioned the use of tools like **NX** and **Turborepo** for efficient code management, resulting in a **40%** reduction in build times and improving developer productivity.\nFostered a delivery-oriented team culture, focusing on agile methodologies and timely project completions aligned with business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed frontend applications leveraging **React (18)**, **TypeScript**, and **Next.js**, ensuring high-quality UI/UX that supports internationalization (i18n) with **Crowdin**.\n• Spearheaded the implementation of **SEO optimizations** and **PageSpeed** enhancements to improve search engine visibility and performance metrics, achieving a **20%** increase in organic traffic.\n• Collaborated with cross-functional teams, facilitating effective **stakeholder communication** to gather requirements and present design solutions, ensuring alignment with project goals.\n• Oversaw the integration of **third-party tools** and analytics frameworks for comprehensive tracking and reporting, driving data-informed decisions and optimizing user engagement through **AB tests**.\n• Utilized modern workflows with **Turborepo** and **NX** to enhance project delivery efficiency by **15%**, streamlining build processes and reducing development time.\n• Designed responsive and accessible UIs using best practices in **UI/UX** design, focusing on mobile-first strategies to reach a diverse user base and achieve compliance with **WCAG 2.1**.\n• Fostered a culture of continuous improvement through **process optimization** initiatives, emphasizing a **delivery-oriented** approach to meet tight deadlines and enhance team productivity.\n• Engaged in regular mentoring of team members, enhancing their technical skills in **Figma** for design mockups and prototyping, improving the overall design process.\n• Actively participated in all sprint planning sessions, ensuring the team remained aligned with project milestones and facilitating delivery within the expected timelines."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tthird-party integrations\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), SEO optimizations, analytics, AB tests, UI/UX, Figma, stakeholder communication, process optimization, delivery-oriented, English communication, i18n, Crowdin, NX, Turborepo, PageSpeed, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Keycloak (OIDC, RBAC)"
}