{
  "name": "Mariusz Jan Skobel",
  "role_name": "Amazon Connect Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Results-driven Amazon Connect Engineer with 10+ years of experience in designing and deploying cloud-native applications leveraging **AWS Services** including **Amazon Connect**, **DynamoDB**, **Lambda**, **S3**, **Kinesis**, **EventBridge**, **CloudWatch**, **CloudTrail**, **API Gateway**, and **CloudFront**. Expert in **Infrastructure as Code** using **CloudFormation** and **Terraform** to ensure efficient and repeatable deployment processes. Adept at implementing **CI/CD** practices and developing robust solutions focused on security and compliance.\n\nProficient in programming languages including **Python** and **JavaScript**, with a solid foundation in leading teams through technical problem-solving initiatives, fostering effective communication, and maintaining a strong customer focus. Experienced in integrating AI/ML capabilities for enhancing operational efficiency and delivering impactful solutions across various sectors, including healthcare and finance. Demonstrates flexibility and influencing skills to navigate complex project requirements and deliver high-performance software solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Amazon Connect Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Leveraged **AWS Services** including **Lambda**, **DynamoDB**, **S3**, and **CloudFormation** to design and implement scalable, resilient solutions tailored to customer specifications, improving response time by **25%**.\n• Developed robust CI/CD pipelines utilizing **AWS Lambda**, **CloudWatch**, and **EventBridge** for automating deployment processes, achieving a **90%** reduction in manual deployment errors.\n• Engaged in **Infrastructure as Code** practices with **Terraform**, enabling consistent and repeatable provisioning of AWS infrastructure across development and production environments.\n• Utilized **Python** and **JavaScript** to create effective backend services and integration points for **Amazon Connect**, enhancing customer interaction flows and satisfaction.\n• Implemented advanced functionality using **Amazon Lex** for developing conversational interfaces in applications, significantly improving user engagement metrics by **30%**.\n• Focused on **Amazon Connect** configurations to streamline customer communication channels, achieving a **20%** increase in call handling efficiency.\n• Developed and maintained comprehensive monitoring solutions with **CloudTrail** and **CloudWatch**, ensuring optimal performance and rapid issue resolution for deployed applications.\n• Proactively contributed to technical problem-solving efforts, effectively addressing issues and obstacles with innovative solutions within cross-functional teams.\n• Fostered clear communication and collaboration with stakeholders, ensuring customer requirements were met efficiently and enhancing overall customer focus in project deliveries.\n• Demonstrated flexibility and adaptability in overcoming project challenges by adjusting to new technologies and methodologies, fostering a culture of continuous improvement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **AWS Services** including **Lambda**, **DynamoDB**, **S3**, and **CloudFormation** to develop and manage cloud-based solutions for financial platforms, enhancing infrastructure scalability and reliability.\nLed the implementation of **Infrastructure as Code** practices through **Terraform** and **CloudFormation** to streamline deployment processes, achieve consistency, and improve infrastructure management across multiple environments.\nDeveloped and integrated real-time data pipelines using **Kinesis** and **EventBridge**, allowing for seamless event processing and proactive monitoring of financial transactions and alerts.\nExecuted CI/CD practices to automate deployments, resulting in a reduction of deployment time by **50%** and increased release frequency to **multiple times per week**.\nCommunicated technical solutions and project updates effectively to stakeholders, enhancing cross-functional collaboration and ensuring alignment with business goals.\nApplied advanced **Python** and **JavaScript** programming skills to create robust backend services and user interfaces, contributing to a seamless user experience and efficient systems for financial banking applications.\nDemonstrated flexibility in adapting to shifting project requirements while maintaining a strong focus on customer needs and delivering high-quality results, even under tight deadlines.\nEngaged in technical problem-solving to troubleshoot issues, leading to a reduction in incident response times by **30%** and improving system availability for financial operations.\nLeveraged **Amazon Connect** and **Amazon Lex** to develop conversational interfaces, enhancing customer interactions and providing innovative solutions for client support.\nChampioned best practices in code quality and documentation, ensuring a maintainable code base and facilitating collaboration among team members."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and maintained robust **AWS Services** to ensure seamless integration with **Amazon Connect**, enhancing customer experience through reliable communication channels.\nImplemented Infrastructure as Code (IaC) using **CloudFormation** and **Terraform** to streamline resource provision and management, achieving a **30%** reduction in deployment time across projects.\nUtilized **Python** and **JavaScript** to create automated scripts for task scheduling and monitoring of **AWS** resources, improving operational efficiency by **25%**.\nDesigned and deployed serverless applications using **AWS Lambda**, managing execution flow with **Step Functions** to handle complex workflows, reducing server management overhead.\nOptimized data storage solutions with **DynamoDB** for low-latency access, enhancing application performance during peak usage periods, evidenced by a **40%** improvement in response times.\nImplemented **Kinesis** for real-time data streaming, enabling dynamic dashboards and analytics integration, significantly improving business decision-making speed.\nConfigured **API Gateway** to create, manage, and secure APIs, facilitating a streamlined interaction between front-end interfaces and backend services.\nMonitored infrastructure health and performance using **CloudWatch** and **CloudTrail**, ensuring compliance with performance benchmarks and rapid incident resolution.\nLeveraged **Amazon Lex** for building conversational interfaces, enhancing customer interaction capabilities and automating customer service workflows, leading to improved customer satisfaction ratings.\nCommunicated technical information effectively with cross-functional teams, ensuring alignment on objectives and enhancing collaborative problem-solving to address technical challenges promptly.\nPromoted a customer-focused approach in project execution, adapting solutions to meet evolving client needs while fostering relationships through active engagement and support."
    }
  ],
  "skills": "Programming Languages:\n\t**Python**, **JavaScript**\n\n**Backend Frameworks:**\n\t**FastAPI**, **Flask**, **Django**\n\n**Frontend Frameworks:**\n\t**React**, **Vue**, **Angular**\n\n**API Technologies:**\n\t**API Gateway**, **Amazon Connect**, **Amazon Lex**, **EventBridge**, **CloudFront**\n\n**Serverless and Cloud Functions:**\n\t**AWS (Lambda)**, **StepFunction**, **Kinesis**, **CloudWatch**, **CloudTrail**, **S3**\n\n**Databases:**\n\t**PostgreSQL**, **MySQL**, **MongoDB**, **Redis**, **DynamoDB**\n\n**DevOps:**\n\t**Docker**, **Kubernetes**, **GitHub Actions**, **GitLab CI/CD**, **CI/CD**\n\n**Cloud & Infrastructure:**\n\t**AWS Services**, **Azure Services**, **CloudFormation**, **Infrastructure as code**, **Terraform**, **Ansible**, **Helm**, **Docker Compose**\n\n**Other:**\n\t**MLflow**, **Airflow**, **Kubeflow**, **Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)**, **Technical problem-solving**, **Communication skills**, **Customer focus**, **Flexibility**, **Influencing skills**"
}