{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior QA Engineer with 8 years of comprehensive experience in software testing, I specialize in both manual and automated testing methodologies. My proficiency encompasses **API testing**, **automated testing**, and applying ISTQB standards to ensure the highest quality of software solutions. I leverage collaborative tools and office software to enhance team communication and streamline quality reporting methods.\nIn my journey, I have also contributed to full-stack development, utilizing technologies such as **JavaScript**, **TypeScript**, **Python**, and **Flutter**. My expertise includes building high-performance applications with frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, while also integrating cloud services on **Azure** and **AWS**. This experience allows me to understand the development lifecycle, enabling me to effectively communicate with development teams and enhance testing processes.\nI possess a strong background in building applications aligned with compliance standards like HIPAA and PCI DSS, and I have experience in developing machine learning pipelines, extending my analytical skill set to benefit quality assurance strategies.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented comprehensive **automated testing** strategies using tools such as Jest, Cypress, PyTest, and Postman, covering unit, integration, end-to-end (E2E), and contract testing for both front-end and back-end services.\nConducted **API testing** to ensure robust and reliable interactions between microservices, achieving a 99% success rate in service calls during production.\nCollaborated effectively with cross-functional teams, leveraging **collaborative tools** to enhance communication and streamline workflows, resulting in a 40% reduction in project turnaround time.\nExecuted **quality reporting** practices to document testing outcomes and recommendations, providing stakeholders with clear insights on application stability and performance.\nAdvised on **methodologies** for continuous improvement of software testing processes, incorporating principles of Agile and DevOps to enhance development cycles.\nTrained and mentored junior QA engineers in both **manual testing** and automated processes, improving team capabilities and knowledge retention through hands-on sessions.\nConducted assessments and **quality reporting** of third-party integrations, ensuring adherence to industry standards and specifications, thereby reducing compliance-related issues by 30%.\nDeveloped testing documentation and **methodologies** in alignment with ISTQB best practices to fortify the testing framework of applications across healthcare and fintech.\nCollaborated with data scientists and engineers to integrate testing for **NLP models**, ensuring functionalities met quality standards while enhancing healthcare document parsing and financial anomaly detection.\nLeveraged **office software** for reporting and tracking project metrics, maintaining visibility into test coverage and defect resolutions, which contributed to a 25% enhancement in overall quality assurance metrics."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Conducted thorough **API testing** and **automated testing** of financial platforms to ensure high-quality software and adherence to **ISTQB** standards, improving defect detection rates by **25%**.\n- Collaborated with cross-functional teams using **collaborative tools** to facilitate continuous integration and delivery, enhancing communication and project efficiency by **15%**.\n- Developed and maintained quality reporting frameworks to track and report software quality metrics, leading to a **20%** improvement in project visibility and decision-making.\n- Employed various **testing methodologies** and strategies to support end-to-end testing processes, aligning with best practices for manual testing and automated testing with a focus on financial systems.\n- Provided mentorship and training on **software testing** concepts and practices to junior engineers, fostering a culture of quality within the team.\n- Actively participated in project meetings to communicate quality-related concerns and provide insights into testing progress and risks, ensuring stakeholder alignment and project success.\n- Streamlined documentation processes for quality assurance using **office software**, resulting in more efficient workflows and reduced response times in quality reporting."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted **API testing** and **automated testing** for backend services deployed in a global e-commerce platform using tools like Postman and Selenium, ensuring high-quality software delivery aligned with project objectives.\nDeveloped and maintained comprehensive **quality reporting** protocols, leading to a **30% reduction** in defect rates by identifying critical issues early in the development lifecycle.\nImplemented **manual testing** methodologies to assess application functionality across all modules (checkout, cart, and order fulfillment), ensuring a seamless user experience and compliance with specifications.\nUtilized collaborative tools such as Jira and Confluence for documentation and task tracking, promoting effective communication within cross-functional teams while streamlining project workflows.\nEngaged in rigorous **software testing** practices including regression and integration testing of new features, achieving consistent delivery of quality releases with a **95% customer satisfaction rate**.\nAuthored and executed **quality assurance** strategies in line with **ISTQB** standards to enhance test coverage and validate software performance under load.\nEnhanced team collaboration by mentoring junior QA engineers and providing training on **methodologies** and emerging testing tools, contributing to a culture of continuous improvement.\nFostered strong communication channels with development teams to clarify requirements and resolve discrepancies early, maintaining project timelines and quality standards.\nEvaluated and recommended new **office software** and testing frameworks that improved overall efficiency and productivity, leading to a **20% increase** in test execution speed."
    }
  ],
  "skills": " **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI testing\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Artificial Intelligence & Machine Learning:**\n\tMLflow, Airflow, Kubeflow\n\n **Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Other:**\n\tsoftware testing, manual testing, automated testing, ISTQB, collaborative tools, office software, quality reporting, methodologies, communication",
  "apply_company": "Federation for Sustainable Entrepreneurship"
}