{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Backend Engineer with 8 years of experience in leveraging **C#**, **Azure**, **Infrastructure as Code** tools including **Bicep** and **Terraform**, and container orchestration with **Kubernetes** and **Docker**. I excel in applying **Agile** and **SCRUM** methodologies to ensure efficient project delivery and collaboration. My technical expertise encompasses modern programming languages such as **JavaScript** and **TypeScript**, enabling me to contribute to full-stack development when necessary.\nThroughout my career, I have designed and implemented robust backend solutions tailored for high-performance applications in the healthcare and financial sectors. I possess a deep understanding of cloud infrastructures and have led the development of enterprise-grade platforms with a strong emphasis on compliance standards like HIPAA and PCI DSS.\nMy proficiency in DevOps practices allows me to streamline CI/CD pipelines, ensuring seamless integration and delivery. I am also experienced in building and deploying machine learning pipelines and utilizing tools like MLflow and Airflow to enhance operational efficiency.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged **C#**, **TypeScript**, and **JavaScript** to architect and develop scalable, full-stack platforms utilizing **Docker** and **Kubernetes** for container orchestration and deployment.\n- Implemented **Infrastructure as Code** practices using **Terraform** and **Bicep**, ensuring streamlined deployment and management of cloud infrastructure on **Azure**.\n- Played a pivotal role in an **Agile**/SCRUM environment, collaborating cross-functionally to deliver high-quality software versions adhering to industry standards.\n- Developed and deployed CI/CD pipelines to automate testing and deployment processes, enhancing application reliability and efficiency.\n- Optimized backend services through microservices architecture, leveraging **Kubernetes** for container management, and enhancing scalability and fault tolerance.\n- Designed RESTful APIs and improved system performance by integrating enterprise-level **DevOps** practices utilizing tools such as GitHub Actions and Azure DevOps.\n- Collaborated on data-centric projects to devise solutions using **Azure** infrastructure for robust data handling and processing.\n- Produced performance metrics and improved application efficiency, achieving a reduction in load times by **30%** on key backend processes.\n- Designed and maintained applications to support high availability and responsiveness, with uptime exceeding **99.9%** across deployed services.\n- Built and enhanced automated testing strategies with established frameworks and libraries to ensure code quality and compliance with specifications.\n- Contributed to the growth of applications through continuous integration and deployment practices, implementing version control and release management strategies for seamless upgrades.\n- Integrated third-party API services, ensuring secure and efficient data retrieval across **Azure** and other platforms to meet business objectives."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **C#** to develop and enhance backend systems, ensuring robust functionality and performance in high-volume financial applications.\nEmployed **Infrastructure as Code** tools such as **Bicep** and **Terraform** to automate deployment processes, improving infrastructure reliability and reducing deployment times by **30%**.\nImplemented containerization strategies using **Docker** and orchestrated services through **Kubernetes**, facilitating scalable and maintainable deployment architectures.\nCollaborated within an **Agile** and **SCRUM** framework to manage sprint cycles, ensuring timely delivery of features and enhancements while maintaining high quality standards.\nOptimized existing backend APIs utilizing **TypeScript** to enhance type safety and support the frontend development of financial platforms, improving response times by **25%**.\nIntegrated CI/CD pipelines as part of the **DevOps** culture to streamline application updates, resulting in a **40%** reduction in time taken for production releases.\nLed the modernization of backend services, enhancing system throughput and scalability by implementing microservices architecture with Node.js and Python, contributing to a **50%** increase in transaction processing capability.\nConducted code reviews and mentored junior developers on best practices in software development and architecture, improving team coding standards and efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **C#** to design and optimize backend services for a global e-commerce platform, ensuring high availability and scalability across key modules while adhering to **Agile** and **SCRUM** methodologies.\nImplemented **Infrastructure as Code** using **Bicep** and **Terraform**, automating deployments and infrastructure management to enhance efficiency and reduce error rates by up to **30%**.\nUtilized **Docker** and **Kubernetes** to orchestrate containerized applications, improving deployment times by **25%** and enabling seamless scalability for high-traffic scenarios.\nDeveloped robust APIs with **JavaScript** and **TypeScript**, focusing on performance optimization to achieve a latency reduction of **20%** in transaction processing.\nCollaborated with cross-functional teams to implement a microservices architecture, significantly improving the team's ability to deliver multi-faceted solutions in a timely manner.\nEnhanced system monitoring and logging through integration with **Azure** services, achieving improved issue resolution times and increased system reliability.\nFocus on performance tuning and debugging, utilizing industry best practices to enhance code quality and application performance across all development stages."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Azure DevOps\n\n **Cloud & Infrastructure:**\n\tTerraform, Bicep, Ansible, Helm, Docker Compose\n\n **Other:**\n\tAgile, SCRUM, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "DocuWare"
}