{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic Senior Sales Engineer with a proven track record in **business development** and **technical sales** within water treatment industries. Adept at using **CRM** systems and proposal tools to drive sales processes and enhance customer engagement. Recognized for **problem-solving** abilities and effective **communication** skills that connect technical solutions to client needs. Bringing over 13 years of comprehensive experience in technology, including building high-performance applications in **JavaScript/TypeScript**, **Python**, and **Flutter**, and expertise in both frontend (React, Next.js, Vue) and backend (Node.js, FastAPI, Django) development.\nAdditionally proficient in deploying cloud-based solutions on **AWS** and **Azure**, and implementing **microservices** and **CI/CD pipelines**. Committed to delivering value by aligning technology solutions with compliance standards and enhancing operational efficiency across diverse sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained CRM systems to support effective communication and business development efforts in the **water treatment** industry, enhancing client engagement and sales strategies.\nUtilized **Microsoft Office** tools for creating persuasive proposal documents and presentations, contributing to a **30%** increase in successful bids.\nApplied strong problem-solving skills to address client needs and technical challenges, ensuring all customer inquiries are resolved with a satisfaction rate exceeding **95%**.\nEngaged in technical sales discussions, articulating product benefits and advantages to stakeholders effectively, leading to successful partnerships and **25%** year-over-year sales growth.\nConducted product demonstrations and training sessions tailored to client requirements, integrating **proposal tools** to streamline the sales process and improve customer understanding.\nCollaborated with cross-functional teams to enhance product offerings based on customer feedback, ensuring alignment with market demands and driving continuous improvement.\nLed technical workshops and webinars to educate clients on water treatment solutions, reinforcing brand expertise and thought leadership in the industry.\nDesigned impactful sales strategies utilizing analytical data to identify growth opportunities within existing accounts, contributing to business expansion.\nMaintained up-to-date knowledge of industry trends and competitors' activities to deliver high-impact solutions that meet customer specifications and drive market share.\nStrengthened communication with clients and team members to foster strong relationships that support successful project implementations and long-term customer loyalty."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed and delivered comprehensive business proposals and technical presentations using **Microsoft Office** and specialized **proposal tools**, aligning with client needs and enhancing the sales process.\nLeveraged **CRM** systems to analyze customer data and improve sales strategies, leading to a **25%** increase in client engagement and satisfaction.\nUtilized strong communication skills to effectively articulate complex technical solutions to non-technical stakeholders, resulting in a **40%** growth in sales opportunities.\nCollaborated cross-functionally to develop innovative water treatment solutions, enhancing product offerings and driving **business development** initiatives, contributing to a **30%** increase in market share.\nEmployed **problem solving** techniques to address client challenges and provide tailored solutions, resulting in a **15%** increase in customer retention rates.\nConducted market research to identify new trends in the water treatment industry, generating insights that informed strategic sales approaches and product enhancements.\nFostered relationships with key accounts, utilizing strategic sales methodologies to expand client base and opportunities for upselling and cross-selling.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and implemented strategic **technical sales** initiatives focused on **water treatment**, ensuring compliance with industry standards and client satisfaction by leveraging in-depth product knowledge.\nCultivated strong relationships with clients to support **business development** efforts, identifying client needs and proposing tailored solutions that drive revenue growth.\nUtilized **CRM** systems to track sales activities, manage customer interactions, and optimize the funnel process, leading to a **20%** increase in customer retention rates.\nPrepared comprehensive proposals and presentations using **Microsoft Office** and **proposal tools**, showcasing product benefits and ROI, resulting in successful bids on **over 15** major contracts within a fiscal year.\nLeveraged advanced **problem-solving** skills to address client issues swiftly, ensuring continuous support and enhancing the overall customer experience through effective communication strategies.\nConducted technical product demonstrations and training, facilitating understanding and adoption of solutions among key stakeholders, which reduced onboarding time by **30%**.\nCollaborated cross-functionally with engineering and product development teams to refine offerings, aligning technical capabilities with market demands and ensuring a competitive edge in proposal submissions.\nMonitored industry trends and competitor actions, providing insights that informed strategic business decisions and tailored sales approaches for over **10** target sectors."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\twater treatment\n\ttechnical sales\n\tbusiness development\n\tCRM\n\tproposal tools\n\tMicrosoft Office\n\tproblem solving\n\tcommunication\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "Nijhuis Saur Industries"
}