{
  "name": "Rei Taro",
  "role_name": "Senior Platform Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Platform Engineer with over 10 years of experience in **DevOps** environments, specializing in **cloud-native architectures** and high-performing backend systems. Proficient in leveraging **AWS**, **Azure**, and **GCP** for scalable solutions and automation using tools like **Terraform**, **Kubernetes**, and **Ansible**. Expert in **Python** frameworks, including **FastAPI**, **Django**, and **Flask** for API development. Recognized for effective team management, collaboration, and a strong sense of ownership in project delivery. Successfully executed impactful projects for leading organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Platform Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Azure** and **Terraform** to deploy and manage infrastructure as code for scalable cloud operations, improving deployment efficiency by **30%**.\nEngineered backend services in **Python** using **FastAPI** to optimize document automation, user onboarding, and reporting workflows, achieving a **40%** reduction in processing time.\nDeveloped event-driven solutions with **Celery** and **Redis** that effectively managed asynchronous processing for financial transaction requests, reducing latency by **25%**.\nCreated and maintained data pipelines for regulatory data exchange with **Apache Airflow** and **Azure Functions**, ensuring 100% compliance in data flow accuracy and timeliness.\nImplemented security assessments and integrated **OAuth2** and **Azure AD B2C** for secure and scalable authentication systems, elevating security standards across platforms.\nCollaborated with cross-functional teams to address system integration challenges, ensure compliance, and oversee release strategies, demonstrating strong **Team Management** and **Collaboration** skills.\nEmphasized **DevOps** practices to enhance automation and deployment processes, fostering a culture of **Autonomy** and **Ownership** within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Azure** and **Terraform** for managing deployment and infrastructure automation, achieving a scalable environment for 99% uptime.\nDeveloped backend systems in **Python** and **FastAPI** to automate document workflows and streamline user onboarding processes, reducing onboarding time by 30%.\nDesigned and implemented event-driven microservices with **Celery** and **Redis** for asynchronous processing of financial data, improving transaction throughput by **10,000** requests per hour.\nEngineered secure data pipelines for regulatory compliance using **Apache Airflow** and **Azure Functions**, ensuring timely and accurate data flow management with an error rate under **1%**.\nExecuted security audits to ensure compliance with industry standards, successfully integrating **OAuth2** and **Azure AD B2C** for user authentication and secure access control.\nFostered collaboration with cross-functional teams for seamless system integration and effective release management, ensuring project deadlines were met with a success rate of **95%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **AWS**, **Azure**, or **GCP** to deploy scalable backend services, enhancing trade execution and account tracking with a focus on high availability and reliability.\nEngineered robust cloud-native applications using **Python** for efficient deployment and lower infrastructure costs, improving trading operations by over **30%**.\nDeveloped automated CI/CD pipelines with **Terraform** and **Kubernetes** to streamline deployments and increase deployment frequency by **50%**.\nImplemented monitoring solutions and infrastructure management using **Ansible** to ensure optimal performance and compliance with regulatory requirements, including MiFID II and GDPR.\nCollaborated effectively with cross-functional teams, utilizing **DevOps** practices to promote a culture of ownership and autonomy in project delivery.\nIntroduced a comprehensive job scheduling system utilizing **Celery** and **RabbitMQ** to enhance task management and reduce process execution time by **40%**.\nDesigned and maintained efficient real-time data processing systems using **asyncio**, **WebSockets**, and **Redis**, capable of handling **2000+ transactions per second** for high-frequency trading scenarios.\nDeveloped extensive test suites with **PyTest**, enhancing code quality and reducing bug rates through continuous integration efforts."
    }
  ],
  "skills": " **Programming Languages**\n\t Python\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t JavaScript\n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure, GCP\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Terraform, Ansible\n\n **Cloud & Infrastructure**\n\t Cloud\n\n **Other**\n\t Team Management, Collaboration, Autonomy, Ownership, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, PyTest, Git",
  "apply_company": "Filigran"
}