{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Website Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Website Engineer with 13+ years of experience specializing in **JavaScript**, adept at creating high-performance applications. Skilled in AI integration to enhance website functionality and user engagement, leveraging deep knowledge of **algorithms** to optimize site performance. Proficient in comprehensive CMS solutions, with hands-on experience in tools like **Marketo**, **Wistia**, and **Chili Piper** to drive SEO efforts and improve metrics. A strong communicator and collaborator, I excel in leadership roles, guiding teams toward success through effective project management and design principles. Well-versed in the healthcare and financial industries, aligning solutions with compliance standards when necessary.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Website Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and enhanced web applications utilizing **JavaScript** for dynamic and engaging user interfaces, ensuring optimal performance and SEO compatibility.\n- Collaborated with cross-functional teams to implement complex algorithms that effectively manage data and improve user experience.\n- Designed and integrated CMS solutions to streamline content updating processes, enhancing website usability and user engagement.\n- Demonstrated leadership by guiding team members in best practices for web development, fostering a collaborative environment focused on innovation and quality.\n- Conducted thorough testing strategies for robustness and MTTR reduction, utilizing tools such as Jest for unit testing and collaboration in design review sessions.\n- Managed projects involving third-party tools like **Marketo** and **Wistia** for integrated marketing solutions, ensuring seamless communication between platforms.\n- Created and maintained detailed documentation for all projects, reinforcing strong communication standards across teams.\n- Engaged with stakeholders to gather feedback and improve design processes, enhancing the overall website architecture.\n- Researched and implemented AI solutions to personalize user experiences, leveraging algorithms to drive intelligent recommendations.\n- Monitored website analytics for continuous improvement, using insights to inform design iterations and SEO strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **JavaScript** frameworks and libraries to modernize core financial platforms, enhancing scalability and performance in high-volume transactional systems.\nExecuted leadership and collaboration skills to build interactive front-end applications using **React (18)**, **Vue 3**, and **Next.js**, creating sleek interfaces for financial tools and admin panels.\nApplied **design** principles to deliver real-time analytics dashboards integrated with **D3.js** and **Power BI Embedded**, enabling operations teams to gain insights into transactions with **instant updates**.\nUtilized algorithms and asynchronous communication by designing a robust event-driven architecture with **Kafka**, **RabbitMQ**, and **Azure Service Bus** to streamline critical workflows like payments and alerts.\nExecuted effective communication skills to develop ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, ensuring efficient batch and real-time processing.\nEmployed **AI** techniques to build and deploy machine learning models for fraud detection using **scikit-learn** and **XGBoost**, enabling proactive identification of suspicious activities based on user behavior and transaction patterns.\nDesigned integrated **ML pipelines** for real-time credit scoring, churn prediction, and transaction classification, utilizing **MLflow** and **Airflow** to incorporate model inference into back-end services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Designed and optimized dynamic backend services leveraging **JavaScript** frameworks such as **Node.js** (NestJS, Express) and **Python** (FastAPI, Django), ensuring high availability and scalability across key modules like checkout and order fulfillment.\n• Integrated AI-driven features utilizing algorithms for personalized product recommendations, enhancing user engagement and improving conversion rates through real-time analytics.\n• Developed responsive, SEO-optimized web interfaces using **React** (v18), **Vue 3**, and **Angular**, ensuring compliance with accessibility standards (WCAG 2.1) and delivering an engaging user experience on mobile platforms.\n• Collaborated with cross-functional teams to implement effective communication strategies, ensuring alignment on project goals and enhancing the overall design and user experience of the platform.\n• Engineered real-time customer interaction features through **WebSockets** and **Kafka**, facilitating responsive order updates, dynamic inventory tracking, and effective customer support.\n• Built secure payment processing workflows using third-party services such as **Stripe**, **PayPal**, and **Razorpay**, adhering to PCI-DSS standards for data security.\n• Applied robust content management strategies within **CMS** frameworks while optimizing the architecture with caching solutions like **Redis** to improve data access speed and reduce server load.\n• Demonstrated leadership in project management, guiding teams through complex integrations and technology upgrades while ensuring that project milestones were met on time and within scope.\n• Created strategic marketing solutions through integration with platforms like **Marketo** and enriched visual content using **Wistia** for enhanced digital experiences.\n• Fostered collaboration across departments, facilitating workshops aimed at driving innovation and enhancing product development through effective teamwork strategies."
    }
  ],
  "skills": "{",
  "apply_company": "360Learning"
}