{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Field Engineer with 13+ years of experience in providing technical support and diagnostics for complex systems, including imaging and electro-engineering technologies. Adept at troubleshooting and preventative maintenance, ensuring optimal performance and reliability of imaging systems. Proven track record in delivering exceptional customer service, facilitating effective communication between technical teams and clients. Experienced in network connectivity and remote service operations. Strong background in software development, including skills in **JavaScript/TypeScript**, **Python**, and **Flutter**, with expertise in frontend and backend frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Knowledge in deploying scalable, cloud-native solutions using **AWS** and **Azure**, with insights into regulatory compliance with standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Provided **technical support** to clients, diagnosing and resolving issues with **imaging systems** and **network connectivity**, ensuring optimal performance of equipment and systems during field operations.\n- Executed **preventative maintenance** procedures to enhance system reliability, reducing downtime by **30%** and increasing overall client satisfaction.\n- Delivered exceptional **customer service** by effectively communicating with clients, understanding their needs, and providing tailored solutions for complex technical challenges.\n- Conducted thorough assessments and **IT diagnosis** to identify system malfunctions and implement corrective actions, yielding a **25%** reduction in escalated service calls.\n- Collaborated with cross-functional teams to design and develop robust **electro-engineering** solutions that streamlined operations and improved **remote service** capabilities by **40%**.\n- Trained staff and clients on new imaging technologies, ensuring comprehensive understanding and effective utilization, leading to a **Significant 50%** reduction in inquiry follow-ups.\n- Monitored system performance and initiated corrective measures for **network connectivity** issues, establishing best practices that improved system uptime by **20%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Provided **technical support** for imaging systems and electro-engineering projects, ensuring optimal performance and reliability in customer environments.\nDiagnosed and resolved complex **network connectivity** issues, enhancing user experience and maintaining high service levels for clients.\nConducted **preventative maintenance** on various systems, reducing downtime by **30%** and prolonging equipment lifespan through scheduled check-ups and timely interventions.\nDelivered exceptional **customer service**, addressing client inquiries and issues with efficiency and professionalism, achieving a **95%** customer satisfaction rating.\nExecuted thorough **IT diagnosis** on diverse systems, leveraging analytical skills to identify and mitigate potential problems before they escalated.\nManaged remote service engagements, utilizing tools to ensure seamless **remote support** and maintain consistency in service delivery.\nTrained team members on best practices for **diagnosing systems** and **technical support**, improving overall team competency and knowledge sharing."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Provided **technical support** by diagnosing and resolving networking connectivity issues to ensure optimal performance and reliability of imaging systems used in electro-engineering projects.\n- Executed **preventative maintenance** on electro-engineering and imaging systems, achieving a **99%** customer satisfaction rate through proactive system health checks.\n- Delivered exceptional **customer service** by understanding client needs and providing tailored solutions, resulting in a **30%** increase in repeat business within the first year.\n- Utilized expertise in **remote service** to troubleshoot and support field installations, reducing system downtime by **25%** through timely interventions.\n- Conducted regular system diagnostics to prevent failures and ensure high operational efficiency, contributing to a **15%** reduction in emergency service calls.\n- Collaborated with cross-functional teams to integrate new electro-engineering solutions and imaging systems, enhancing overall technical support capabilities and service offerings.\n- Managed escalated technical issues with a structured approach to **IT diagnosis**, ensuring resolutions were documented and communicated effectively to clients.\n- Developed and maintained detailed documentation and guides for imaging systems to empower clients and junior engineers in troubleshooting and diagnosis processes.\n- Trained new technicians on system operations, preventative maintenance procedures, and customer interaction best practices, improving overall service team performance."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n  **Backend Frameworks**\n\n  **Frontend Frameworks**\n\n  **API Technologies**\n\n  **Serverless and Cloud Functions**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n  **Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n  **DevOps**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure**\n\n  **Other**\n\tElectro-engineering, Imaging Systems, Technical Support, Diagnosing Systems, Preventative Maintenance, Customer Service, IT Diagnosis, Network Connectivity, Remote Service",
  "apply_company": "Philips"
}