{
  "name": "Mariusz Jan Skobel",
  "role_name": "Mid Backend Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Mid Backend Developer with over 10 years of experience in crafting robust software solutions, particularly in finance and healthcare sectors. Proficient in **Node.js**, **TypeScript**, and **AWS**, with strong skills in **SQL**, **PostgreSQL**, and **Prisma ORM** for database management and ORM. Experienced in building **GraphQL APIs** and implementing serverless architectures using **AWS Lambda** and **Serverless** technologies. Demonstrated ability in utilizing the **Redux** state management library, and knowledge of modern tools such as **Vite.js**, **Sass**, **Playwright**, and **Storybook** to enhance development workflow and user experience.\n\nWith a proven track record of delivering high-performance applications, I bring strong problem-solving skills, remote work proficiency, and a C1 level of English communication. My expertise includes automating workflows with a focus on creating maintainable and compliant solutions that meet rigorous standards such as HIPAA and PCI DSS. Passionate about utilizing technology to achieve measurable impact and drive innovations in the software landscape.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Mid Backend Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped efficient server-side applications using **Node.js** and **TypeScript**, ensuring robust API integration with **GraphQL APIs** for seamless data handling.\n•\tUtilized **AWS Lambda** and **serverless** architecture for the deployment of applications, enhancing scalability and reducing operation costs, successfully managing deployments that served up to **5000** concurrent users.\n•\tDesigned and optimized database structures with **PostgreSQL** and **SQL**, employing **Prisma ORM** for effective data interactions and ensuring performance tuning for applications handling **over 1 million** records.\n•\tImplemented state management in front-end applications using **Redux**, ensuring a smooth user experience, while adhering to best practices in application architecture.\n•\tParticipated in remote work environments, collaborating with cross-functional teams to solve complex technical challenges and improve system reliability through a focus on **problem-solving**.\n•\tWrote unit and integration tests using **Playwright** and **Storybook**, achieving **95%** coverage and streamlining the development workflow.\n•\tCreated automation scripts for deployment processes that improved production release cycles by **30%** and enhanced overall software reliability.\n•\tEngaged in continuous learning and application of **Sass** and **Vite.js** in project styling, leading to enhanced application performance and maintainability.\n•\tDemonstrated strong English communication skills (C1), facilitating clear and effective remote collaboration with global teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Node.js** (NestJS/Express) and **TypeScript** to develop and modernize scalable financial platforms, enhancing throughput for high-volume transaction systems.\nImplemented **SQL** and **PostgreSQL** database solutions, using **Prisma ORM** for efficient data management and retrieval, achieving a **20%** improvement in performance metrics.\nDesigned and deployed **GraphQL APIs** for seamless data retrieval, enabling front-end developers to interact efficiently with backend resources.\nIntegrated **AWS Lambda** and **Serverless** architecture, resulting in a **30%** reduction in server costs and operational overhead while improving deployment speed.\nWorked on the front end with **Vite.js** and **Sass**, developing user-focused applications that emphasize responsive design and excellent user experience.\nEmploying **Redux** and **Playwright** for state management and automated testing, respectively, improved code reliability, contributing to a **15%** decrease in bug reports.\nCollaborated in a remote work environment, demonstrating strong communication skills (English C1) and enhancing team dynamics.\nDeveloped problem-solving strategies to enhance system performance and mitigate risks in application development, ensuring reliable financial transactions and data integrity."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed scalable backend solutions utilizing **Node.js** and **TypeScript**, ensuring seamless integration with **AWS** services like **AWS Lambda**, enabling rapid deployment and execution of serverless functions across **9** microservices.\n• Created and optimized **GraphQL APIs** for efficient data querying, significantly improving app performance and reducing round-trip times by **30%** compared to traditional RESTful services.\n• Managed relational databases with a focus on **PostgreSQL** and utilized **Prisma ORM** for seamless data access and manipulation, ensuring rapid development and maintenance for high-traffic applications.\n• Collaborated with cross-functional teams in an agile environment, employing problem-solving skills to troubleshoot issues and optimize workflows, enhancing team productivity by **25%**.\n• Engaged in remote work environments, demonstrating excellent communication skills in English (C1), effectively coordinating with team members across different time zones.\n• Utilized **Sass** for styling and implemented **Vite.js** for rapid frontend development, contributing to an improved developer experience and faster build times by **15%**.\n• Conducted end-to-end testing with tools like **Playwright** and documented UI components using **Storybook**, ensuring quality assurance and consistent user interfaces across platforms.\n• Participated in code reviews and adhered to best practices for clean code and efficient architecture, contributing to a **20%** reduction in technical debt within the team’s codebase.\n• Employed a solution-driven mindset to overcome challenges, leveraging remote collaboration tools and methodologies to streamline project management and delivery."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Redux, Vite.js, Sass, Playwright, Storybook\n\n**API Technologies:**\n\tGraphQL APIs\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Serverless\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, Prisma ORM\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, English C1, Remote work experience, Problem-solving"
}