{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Value Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Results-driven Senior Value Engineer with 10+ years of experience in consulting and business transformation. Adept in stakeholder engagement and financial modeling, delivering compelling presentations that effectively articulate value propositions and strategic roadmaps. Proven expertise in process mapping, business process improvement, and design thinking methodologies to enhance operational efficiencies. Skilled communicator with strong storytelling abilities, capable of aligning business strategies with technical capabilities to drive success.\nAdditionally, a seasoned Full Stack Developer with hands-on experience in **JavaScript/TypeScript**, **Python**, and **Flutter**. Proficient in leveraging modern frameworks and libraries such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** to deliver high-performance software solutions. Extensive experience in building and deploying cloud-native applications on **Azure** and **AWS**, with a focus on microservices architecture and CI/CD automation. Passionate about integrating AI/ML capabilities to enable real-time analytics, automation, and intelligent decision-making, ensuring compliance with standards like HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Value Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tEngaged stakeholders to understand business transformation needs, providing consulting services that streamline processes and enhance value propositions for clients in the healthcare and finance sectors.\n•\tUtilized financial modeling techniques to create strategic roadmaps and present compelling storytelling to executive leadership, ensuring alignment with organizational goals and vision.\n•\tCollaborated with cross-functional teams to identify opportunities for process mapping and business process improvement, leading to optimized operational efficiency and revenue growth.\n•\tDesigned scalable, full-stack solutions using **TypeScript**, **Python (FastAPI)**, and **Node.js**, and developed modern frontends in **React (17–18)**, **Next.js**, and **Vue 3** while adhering to regulatory standards like HIPAA, FHIR, GDPR, PCI DSS, and SOX.\n•\tBuilt and deployed cross-platform mobile apps with **Flutter** and **React Native**, ensuring seamless user experiences on both iOS and Android for healthcare and fintech products.\n•\tLed the re-architecture of monolithic applications into microservices-based ecosystems, employing **Docker**, **Kubernetes (AKS/EKS)**, and serverless architectures (**AWS Lambda**, **Azure Functions**) to achieve high availability and fault tolerance.\n•\tDesigned and maintained cloud-native data architecture utilizing **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL** to manage large-scale data ingestion, storage, and querying in healthcare and financial applications.\n•\tImplemented machine learning models for patient risk prediction and financial fraud detection using **Python (scikit-learn, PyTorch, TensorFlow)**, integrating real-time inference services into backend systems.\n•\tConstructed MLOps pipelines using **MLflow**, **DVC**, and **Apache Airflow** for ongoing training, validation, versioning, and deployment of machine learning models.\n•\tIntegrated AI-driven features into applications, such as personalized health recommendations and predictive alerts, harnessing models hosted on **Azure ML** and **AWS Sagemaker**.\n•\tExecuted enterprise-level DevOps pipelines with **GitHub Actions**, **Azure DevOps**, and **CircleCI**, introducing security scans and multi-environment deployments for web and API services.\n•\tDelivered sophisticated financial data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded**, facilitating insightful examination of transaction trends and operational KPIs.\n•\tContributed to NLP model integration (using **spaCy**, **Hugging Face Transformers**) for document parsing and anomaly detection, bolstering core service capabilities through RESTful APIs.\n•\tFormulated test strategies with **Jest**, **Cypress**, **PyTest**, and **Postman**, ensuring comprehensive test coverage for both frontend and backend services.\n•\tEnabled advanced search functionalities using **Azure Cognitive Search** and **ElasticSearch** for enhanced data retrieval across millions of health records and financial documents."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed strategic roadmaps for business transformation initiatives, leveraging insights from stakeholder engagement to improve financial modeling and drive process mapping efficiencies.\nPresented value propositions effectively to diverse audiences, utilizing strong communication and storytelling skills to engage stakeholders while facilitating buy-in for innovative solutions.\nImplemented business process improvement strategies, harnessing design thinking principles to enhance operational workflows and drive impactful changes in organizational structures.\nConducted detailed consulting sessions to align technology solutions with business objectives, ensuring that proposed strategies are both actionable and scalable within financial sectors.\nUtilized data-driven insights to support consulting sessions, effectively mapping out financial processes and recommending improvements based on best practices in the industry.\nFormulated and conveyed comprehensive presentations to executive teams, highlighting the importance of financial modeling and process mapping in achieving strategic business goals.\nEngaged with cross-functional teams to foster collaboration and enhance communication channels, ensuring alignment on ongoing projects and initiatives aimed at enhancing overall value delivery."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Facilitated stakeholder engagement through effective **presentation** techniques, illustrating complex ideas and strategies to a diverse audience of 20+ stakeholders.\nDeveloped comprehensive **business transformation** strategies that increased operational efficiency by **25%**, aligning with organizational goals and enhancing overall performance through **process mapping**.\nExecuted financial modeling to assess the **value proposition** of new initiatives, which contributed to a **30%** increase in projected revenues.\nUsed **design thinking** principles to innovate **business process improvement**, driving creativity and user-centric solutions that improved service delivery and client satisfaction scores by **15%**.\nCrafted a strategic roadmap that effectively communicated the vision for future initiatives, leveraging **storytelling** to create a compelling narrative for potential partnerships.\nUtilized strong **communication** skills to collaborate with cross-functional teams, ensuring streamlined operations and stakeholder buy-in for key projects.\nDrove sales strategy initiatives that resulted in a **20%** uptick in client acquisitions and enhanced retention rates through tailored consulting approaches."
    }
  ],
  "skills": " **Other**\n\tconsulting, business transformation, stakeholder engagement, financial modeling, presentation, process mapping, value proposition, strategic roadmap, communication, storytelling, business process improvement, design thinking, sales strategy\n\n **Programming Languages**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks**\n\tReact, Vue, Angular\n\n **API Technologies**\n\t\n\n **Serverless and Cloud Functions**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure**\n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n **Authentication & Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Artificial Intelligence & Machine Learning**\n\tMLflow, Airflow, Kubeflow",
  "apply_company": "Camunda"
}