{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Backend Engineer with 8 years of extensive experience, I excel in building scalable and efficient backend systems using **Ruby**, **Ruby on Rails**, and **PostgreSQL**. My comprehensive skill set includes developing robust **RESTful APIs** and managing databases with **MySQL**. Proficient in version control using **Git**, I ensure seamless collaboration and code management.\nMy technical expertise extends to cloud services like **AWS** and **GCP**, alongside containerization technologies such as **Docker**. I bring hands-on experience with message brokers and background job frameworks such as **SideKiq**, **RabbitMQ**, and **Kafka** to enhance system performance and reliability.\nWith a strong foundation in microservices architecture and CI/CD automation, I have led the development of high-performance backend solutions that integrate seamlessly with modern technologies. My passion for continuous learning and improvement drives my ability to build secure applications compliant with industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained scalable backend services using **Ruby** and **Ruby on Rails**, ensuring robust performance and reliability in a high-demand financial environment.\nDesigned and implemented **RESTful APIs** for seamless communication between the frontend and backend systems, optimizing for efficiency and security.\nManaged and optimized **PostgreSQL** and **MySQL** databases, ensuring high availability and effective data management practices.\nUtilized **Docker** for containerization of applications, leading to improved deployment processes and isolation of environments.\nCollaborated in a microservices architecture, integrating message brokers such as **RabbitMQ** and **Kafka** to streamline asynchronous communication and data processing.\nLeveraged cloud platforms like **AWS** and **GCP** to enhance application performance, scalability, and reliability, managing resources to reduce costs by up to **30%**.\nImplemented CI/CD pipelines using Git for version control, automating testing, and deploying updates across environments, focusing on reducing deployment time by **50%**.\nEngaged in architectural discussions to migrate legacy systems into modern frameworks, using code versioning and feature branching strategies to facilitate smooth transitions.\nEstablished monitoring solutions to track application performance and user engagement, implementing analytics that reflected user journey improvements and reduced system downtime by **25%**.\nContributed to technical documentation and best practices for development processes, ensuring partner teams aligned on code quality and system architecture standards.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Developed and maintained **RESTful APIs** using **Ruby on Rails** to provide seamless integration with front-end applications and third-party services.\n- Implemented robust database solutions using **PostgreSQL** and **MySQL**, improving data retrieval times by up to **30%** for high-traffic financial applications.\n- Designed and deployed containerized applications with **Docker**, ensuring consistent development and production environments, facilitating a **50%** increase in deployment frequency.\n- Collaborated with cross-functional teams to enhance application performance, leading to a **25%** reduction in server response times.\n- Integrated messaging systems using **RabbitMQ** and **Kafka** to support asynchronous processing, enhancing system reliability and responsiveness during peak transaction volumes.\n- Leveraged **Git** for version control, streamlining collaboration among team members and reducing merge conflicts by **40%** through effective branching strategies.\n- Utilized cloud services like **AWS** and **GCP** for hosting applications and databases, optimizing infrastructure costs by **20%** while maintaining high availability.\n- Participated in code reviews and implemented best practices for software development, contributing to a **30%** improvement in code quality and maintainability.\n- Assisted in the development of job processing workflows with **Sidekiq**, increasing job throughput by **60%** for background tasks."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained RESTful APIs using **Ruby** and **Ruby on Rails**, ensuring seamless integration with frontend applications and third-party services for high-demand e-commerce functions.\nOptimized PostgreSQL and MySQL databases for performance and scalability, successfully handling over **100,000** concurrent users with reduced response times by **30%**.\nImplemented robust background job processing with **Sidekiq** and integrated with **RabbitMQ** and **Kafka** for efficient task handling and event-driven architecture, enabling real-time order processing and notifications.\nLeveraged **AWS** and **GCP** cloud services for deployment and hosting, utilizing **Docker** for containerization, ensuring high availability and easier scalability of applications.\nUtilized **Git** for version control, maintaining a clean code repository and streamlining collaboration among a team of **15** engineers.\nDesigned and deployed secure and efficient payment processing systems, adhering to PCI compliance, integrating with major payment gateways like Stripe and PayPal.\nImplemented automated testing and deployment strategies, enhancing the CI/CD pipeline to reduce deployment time by **40%** and increase code reliability.\nDesigned and maintained robust logging and monitoring for applications using tools integrated with **RabbitMQ** and **Kafka**, ensuring system health and quick diagnosis of issues across **20+** microservices.\n\nAdditional strengths include mentoring junior developers, conducting code reviews, and collaborating closely with cross-functional teams to align technical solutions with business needs."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, Ruby\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Ruby on Rails\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tRESTful APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), GCP\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, SideKiq, RabbitMQ, Kafka",
  "apply_company": "Qoyod - قيود"
}