{
  "name": "Patryk Zaslawski",
  "role_name": "Senior System Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a seasoned Senior System Engineer with 8+ years of experience, I excel in IT Automation and System Administration, leveraging skills in **Python**, **PowerShell**, and **Bash** for efficient scripting and API Automation. My expertise includes managing enterprise applications, SaaS administration, and implementing robust security practices like **IAM**, **Okta**, **Entra ID**, **SSO**, and **MFA**. I am proficient in **Terraform** for infrastructure as code and adept at networking solutions that enhance system reliability. With a strong background in problem solving and collaboration, I have successfully designed and deployed high-performance architectures tailored for e-commerce, financial, and healthcare sectors, utilizing a tech stack that includes **FastAPI**, **Django**, **Flask**, **SQLAlchemy**, and front-end frameworks such as **Angular**, **Vue**, **React**, and **Next.js**. My comprehensive knowledge of cloud platforms like **AWS** and **Azure**, along with database optimization using **PostgreSQL**, **MySQL**, and **MongoDB**, ensures delivery of enterprise-grade solutions aligned with industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior System Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed and implemented **IT Automation** strategies using **Python** and **Terraform**, streamlining system administration tasks and enhancing operational efficiency across 9 enterprise applications.\n• Automated API workflows and integrated **IAM** solutions with **Okta** and **Entra ID**, achieving single sign-on (SSO) and multi-factor authentication (MFA) for over 2,000 users.\n• Enhanced system security practices by embedding proactive monitoring and response capabilities, ensuring compliance with standards such as SOC 2, ISO 27001, HIPAA, and PCI DSS.\n• Spearheaded scripting initiatives using **PowerShell** and **Bash**, significantly reducing manual intervention and errors in configuration management by 75%.\n• Collaborated with cross-functional teams to design and deploy secure APIs that facilitate integration with enterprise applications, optimizing user access management via **SCIM**.\n• Led troubleshooting and problem-solving efforts for complex system issues, improving overall system uptime and performance by 15%.\n• Managed configuration and automation of enterprise applications through comprehensive CI/CD pipelines, leveraging **GitHub Actions** and **Azure DevOps** for streamlined deployments.\n• Actively mentored junior engineers in **scripting** and systems automation techniques, fostering a culture of collaboration and continuous improvement.\n• Integrated network security solutions and best practices into automation processes, optimizing infrastructure and ensuring secure communications.\n• Developed modular infrastructure as code using **Terraform**, significantly reducing deployment times and simplifying cloud resource management across multiple environments."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Implemented IT Automation strategies to enhance system efficiency and reliability, ensuring seamless operations of enterprise applications.\n• Developed and maintained scripts in **Python**, **PowerShell**, and **Bash** for efficient automation, resulting in a **30%** reduction in manual tasks.\n• Managed and administered cloud-based SaaS solutions, improving user access management through effective **SSO** and **MFA** configurations.\n• Designed and implemented API Automation processes, facilitating secure and efficient data exchange across multiple applications, contributing to **increased transaction processing speed by 25%**.\n• Integrated IAM solutions using **Okta** and **Entra ID**, enhancing security protocols and ensuring compliance with industry standards.\n• Utilized **Terraform** for infrastructure as code, automating deployment and management processes, reducing deployment times by **40%**.\n• Collaborated with development teams to optimize system performance and ensure robust security practices, conducting regular auditing and monitoring of enterprise applications.\n• Resolved system administrative issues proactively by applying strong problem-solving skills and collaborating closely with cross-functional teams to implement lasting solutions.\n• Led scripting initiatives to streamline operational processes, improving system availability and reliability across platforms.\n• Implemented network security practices ensuring compliance with organizational standards, contributing to reduced incidence of security breaches by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Terraform** for automating infrastructure provisioning and management, enhancing deployment efficiency in cloud environments.\nAutomated routine system administration tasks through **Python** scripting, significantly reducing manual workload and minimizing human error.\nDesigned and implemented secure **IAM** strategies using **Okta** and **Entra ID** for authenticating and managing user access across enterprise applications.\nDeveloped and automated APIs integrated with **Python**, enhancing system responsiveness and efficiency for enterprise-level SaaS applications.\nConducted system administration and monitoring of cloud environments, ensuring high availability and performance for critical applications.\nImplemented **SSO** and **MFA** across different systems, enhancing security measures and improving user access experiences.\nCreated and maintained detailed documentation for automated processes, ensuring clear collaboration and knowledge sharing among the engineering team.\nApplied **PowerShell** and **Bash** scripts to streamline system management and automate repetitive administrative tasks, resulting in a **30%** increase in efficiency.\nExecuted troubleshooting and problem-solving techniques to address performance issues within enterprise applications, ensuring seamless user experience.\nCollaborated with cross-functional teams to plan, design, and manage IT initiatives, ensuring alignment with organizational goals and system requirements.\nMaintained a focus on security best practices throughout system development and administration, ensuring compliance with regulatory standards.\nFostered effective communication within the IT department, enhancing teamwork and project outcomes.\nDeveloped, tested, and deployed security practices tailored to organizational needs, minimizing vulnerabilities across the infrastructure.\nParticipated in system updates and patches, systematically enhancing overall system performance and security posture.\nConducted regular performance testing for system optimizations, ensuring operational efficiency."
    }
  ],
  "skills": " **Programming Languages:**\n\t Python, PowerShell, Bash\n\n **Backend Frameworks:**\n\t FastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\t Angular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\t REST & gRPC APIs, API Automation\n\n **Serverless and Cloud Functions:**\n\t AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\t SQLAlchemy, Pydantic, Celery, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\t Docker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform\n\n **Cloud & Infrastructure:**\n\t IAM, Okta, Entra ID\n\n **Other:**\n\t IT Automation, System Administration, Enterprise Applications, SaaS Administration, Networking, Security Practices, Problem Solving, Collaboration, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, MFA, SCIM",
  "apply_company": "Printful"
}