{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Security Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Security Engineer with 13+ years of experience leveraging expertise in **AWS**, **JavaScript**, **TypeScript**, **Python**, and security best practices to deliver high-performance applications across healthcare and financial industries. Proficient in implementing compliance-driven solutions that align with **SOC Compliance**, **PCI Compliance**, **ISO 27001**, and **ISO 27002** standards. Skilled in application security techniques such as **SAST** and **SCA** and performing thorough **3rd Party Assessments** to ensure robust security posture.\nStrong track record in technical collaboration and document drafting, enabling seamless communication with cross-functional teams. Additionally experienced in building AI/ML-powered platforms with hands-on skills in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Adept at deploying cloud-native systems and integrating security measures throughout the software development lifecycle.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Security Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented security measures for full-stack platforms across healthcare and fintech sectors leveraging **AWS** cloud services and ensuring compliance with **ISO 27001**, **ISO 27002**, and **SOC Compliance**.\nDeveloped and maintained secure applications using **JavaScript**, **TypeScript**, and **Python** (FastAPI), ensuring adherence to **PCI Compliance** and security best practices by integrating static and dynamic analysis tools (SAST, SCA) in CI/CD workflows.\nCollaborated with cross-functional teams to draft technical documentation for security frameworks and assessments, ensuring clarity on compliance requirements and risk management strategies.\nConducted thorough 3rd party assessments to evaluate security risks and vulnerabilities across various technologies and platforms, enhancing the overall security posture of the organization.\nDesigned and executed testing strategies using tools such as Jest, Cypress, and Postman for rigorous validation of security measures, including unit, integration, and contract-level tests.\nAssured data integrity and security while managing data infrastructures built with PostgreSQL and MongoDB, ensuring secure access controls and data protection.\nIntegrated security features into CI/CD pipelines utilizing **AWS** and **Azure DevOps**, automating security checks and compliance audits in line with industry standards.\nEnhanced threat detection capabilities by deploying intelligent monitoring solutions and incident response workflows optimized for rapid detection and mitigation of security issues.\nLed security awareness initiatives across teams, fostering a culture of collaboration and technical cooperation to strengthen security practices throughout the development lifecycle."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Ensured compliance with security standards by implementing best practices in **AWS** configurations, maintaining adherence to **ISO 27001** and **ISO 27002** protocols.\nConducted **3rd Party Assessments** and security audits to identify vulnerabilities in financial platforms, utilizing tools for **SAST** (Static Application Security Testing) and **SCA** (Software Composition Analysis) across applications built with **JavaScript**, **TypeScript**, and **Python**.\nCollaborated with cross-functional teams to draft and review security documentation, ensuring clarity in technical policies and procedural compliance related to **SOC Compliance** and **PCI Compliance**.\nDeveloped and maintained scripts in **Bash** for automating security monitoring and alerting, capable of analyzing **1000+** security logs per day to detect anomalies.\nLed initiatives to integrate security measures in the deployment pipelines for cloud-based services on **AWS**, reducing vulnerability reports by **40%** over a **6-month** period.\nConducted training and technical collaboration sessions for development teams on secure coding practices, enhancing overall application security knowledge across the organization.\nPromoted a culture of security awareness by organizing workshops and providing resources that led to a **50%** increase in employee awareness of potential security threats and how to address them."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Ensured **PCI Compliance** for secure payment workflows integrated with Stripe, PayPal, and Razorpay, applying tokenized transactions to protect sensitive customer data during transactions.\n- Collaborated on security assessments and implemented **ISO 27001** and **ISO 27002** standards across platforms to uphold data protection and security integrity, improving compliance posture by **25%**.\n- Developed and maintained documentation for security protocols and procedures, enhancing clarity and effectiveness in **Document Drafting** for internal security policies.\n- Conducted Security Static Application Testing (**SAST**) and Software Composition Analysis (**SCA**) on codebases to identify vulnerabilities, achieving a **30%** reduction in identified security flaws in production environments.\n- Engaged in **Technical Collaboration** with development teams to integrate security features, ensuring seamless adoption of security enhancements and compliance measures across the platform.\n- Utilized **JavaScript** and **TypeScript** for building secure backend services, optimizing for performance and security while managing sensitive user data.\n- Adopted **Bash** scripting for automation of security monitoring tools, enhancing the efficiency of security operations within a 24/7 environment.\n- Evaluated third-party tools for security assessments, contributing to **3rd Party Assessment** processes to ensure compliance with established security criteria.\n- Participated in the SOC Compliance initiatives to guarantee security monitoring meets industry standards and user trust, improving overall security readiness.\n- Drove security awareness within the team, contributing to a culture of vigilance and proactive engagement in security practices and protocols."
    }
  ],
  "skills": " \n\n**Programming Languages:**\n\tPython, JavaScript, TypeScript, Bash\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, SAST, SCA, ISO 27001, ISO 27002, 3rd Party Assessment, SOC Compliance, PCI Compliance, Document Drafting, Technical Collaboration"
}