{
  "name": "Andrzej Ito",
  "role_name": "Senior Workday Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Workday Engineer with over 9 years of experience, I specialize in **Workday**, **HCM**, and **Talent Management** configurations and customizations, ensuring seamless integration and data management to optimize HR functions. My expertise extends to **performance** and **recruiting workflows**, providing solutions that enhance user experience and drive organizational success. I excel in **troubleshooting** and **analytical** tasks while maintaining a client-focused approach. Additionally, I have a proven track record of leading cross-functional teams, mentoring junior engineers, and delivering projects that prioritize innovation and technical excellence.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Workday Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Configured and customized **Workday** for HCM modules including Talent and Performance management, ensuring optimal workflow alignment with business objectives.\n• Managed data integration processes within **Workday**, maintaining high standards of data management and integrity.\n• Led troubleshooting efforts for **Workday** modules, utilizing strong analytical skills to resolve issues and improve system functionality.\n• Collaborated with clients to gather requirements and provide tailored solutions in **Workday**, enhancing client satisfaction through effective communication.\n• Streamlined recruiting processes by implementing robust **Workday** functionalities, resulting in a 30% reduction in hiring time.\n• Designed and executed workflows in **Workday**, ensuring compliance with HRM standards and improving operational efficiency by 25%.\n• Conducted detailed data analysis to support performance tracking within **Workday**, contributing to informed decision-making for HR strategies.\n• Contributed to the continuous improvement of **Workday** implementation, leading efforts that increased system adoption rates by 20%."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Configured **Workday HCM** modules including **Talent** and **Performance** to streamline data management processes and support HR functions.\n• Customized **Workday** workflows to enhance recruiting processes and improve overall efficiency, impacting 9 departments across the organization.\n• Managed data integration tasks, ensuring seamless data flow between **Workday** and other platforms, achieving a 99% accuracy rate in data transfers.\n• Analyzed and resolved troubleshooting issues related to **Workday** functionalities, reducing response time by 30% and ensuring client satisfaction.\n• Collaborated with cross-functional teams to communicate findings and develop strategic solutions, leading to a 25% improvement in client-focused services.\n• Provided analytical support to enhance **HRM** workflows and configurations, demonstrating strong problem-solving skills in a high-pressure environment.\n• Spearheaded the configuration of **Workday** customization features tailored to specific client needs, achieving completion within an average of 7 weeks per project."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Configured and customized **Workday** solutions to enhance **HCM** processes, ensuring optimal performance and usability for **Talent** management and **Recruiting** activities.\n• Developed and managed **Performance** workflows to streamline HRM processes, leveraging analytical skills to improve data management.\n• Integrated various third-party tools and services, utilizing advanced troubleshooting techniques to resolve integration issues within **Workday**.\n• Led projects with a client-focused approach, ensuring effective communication throughout the configuration and customization phases, resulting in a 30% increase in user satisfaction.\n• Spearheaded data management initiatives that resulted in a 25% improvement in reporting accuracy by optimizing workflows within **Workday**.\n• Conducted training sessions for a team of 9 to increase proficiency in **Workday** functionality, enhancing team productivity.\n• Collaborated on system integrations using **AWS** and **Azure**, ensuring seamless data flow with a keen focus on security and compliance, successfully reducing data inconsistencies by 15%."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, C++, C#, Python, SQL, PLSQL, Kotlin\n\n**Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA, Node.js\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tSOAP, REST APIs, Microservices\n\n**Serverless and Cloud Functions**\n\t\n\n**Databases**\n\tMS SQL Server, Oracle, MongoDB, PostgreSQL, Redis\n\n**DevOps**\n\tRabbit MQ\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tWorkday, HCM, Talent, Performance, Recruiting, Configuration, Customization, Data Management, Workflow, HRM, Integration, Troubleshooting, Communication, Analytical, Client-focused",
  "apply_company": "thyssenkrupp Group Services Gdansk Sp z oo"
}