{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior PHP Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior PHP Engineer with over 13 years of experience in delivering high-performance applications, with proficiency in **PHP**, **HTTP**, and **RESTful APIs**. Experienced in web infrastructure and implementing OOP principles, SOLID design principles, and Clean Code practices to create robust software solutions. Skilled in employing design patterns and secure coding practices to enhance application security and maintainability.\n\nDemonstrated ability to mentor junior developers, fostering a collaborative environment with strong problem-solving skills. Adept at deploying applications using **Docker**, ensuring smooth development workflows. Background in the healthcare and financial sectors, focusing on compliance-driven development aligned with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Proven expertise in cloud-native systems on **AWS** and **Azure** and developing AI/ML-powered platforms utilizing technologies like **MLflow**, **Airflow**, and **Kubeflow**. Strong communication skills to collaborate with cross-functional teams.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained robust **PHP** applications, ensuring adherence to **RESTful APIs** architecture and **HTTP** standards to enhance web infrastructure.\nImplemented best practices in **OOP**, **SOLID principles**, and **Clean Code** methodology, ensuring high-quality, scalable software design.\nUtilized **Docker** for containerization, facilitating smoother deployments and environment consistency in various development and production stages.\nEngaged in mentoring junior developers, promoting effective **problem-solving** techniques and fostering a collaborative team environment through strong **communication** skills.\nLed initiatives to integrate **web security** measures, ensuring compliance with secure coding practices and protection against security vulnerabilities.\nEmployed **design patterns** to optimize codebase, enhancing maintainability and reducing technical debt across multiple projects.\nDesigned and executed comprehensive testing strategies to cover unit, integration, and E2E tests, improving overall software reliability across **3 major releases** per year.\nCollaborated with cross-functional teams to resolve complex technical challenges, achieving a **20% reduction** in system downtime through enhanced **web infrastructure**.\nMaintained and improved documentation standards, allowing for better onboarding processes and knowledge transfers as reflected in a **30% increase** in team efficiency.\nEvaluated and integrated third-party tools like **Knime** to streamline workflows and enhance data processing capabilities, resulting in improved project timelines."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Ensured secure coding practices and **web security** compliance by implementing **RESTful APIs** and **HTTP** protocols in financial applications, adhering to **SOLID** principles and **Clean Code** standards.\nDeveloped and maintained robust **web infrastructure** by leveraging **PHP** with **C#** and **.NET** frameworks, enhancing system reliability and performance across financial platforms.\nMentored junior developers on best practices in **OOP** and **design patterns**, fostering a culture of continuous learning within the team.\nUtilized **Docker** for containerization of applications, improving deployment efficiency and scalability across development environments.\nCollaborated with cross-functional teams to troubleshoot and resolve complex problems, applying strong **problem-solving** skills to enhance overall project outcomes.\nEngaged in thorough code reviews and provided constructive feedback to peers, promoting adherence to coding standards and best practices.\nDesigned system architecture that facilitates seamless integration with internal and third-party services, improving feature delivery speed by **30%**.\nImplemented ongoing performance optimization efforts, resulting in a **25%** reduction in response times for client-facing applications."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and maintained high-performance **PHP** applications by implementing **RESTful APIs** that adhere to **SOLID** principles and **Clean Code** practices to ensure maintainability and scalability.\n- Designed and managed web infrastructure using **Docker** for containerization, facilitating consistent development environments and efficient deployment.\n- Engineered solutions with **OOP** and design patterns to enhance code reusability and efficiency, improving development speed by **30%**.\n- Established secure coding practices and web security measures to protect against vulnerabilities, achieving **100% compliance** with industry standards.\n- Collaborated effectively with cross-functional teams to mentor junior developers, enhancing team coding skills and promoting effective communication.\n- Conducted code reviews and provided constructive feedback to maintain code quality and adherence to best practices across projects.\n- Mentored team members in problem-solving techniques, facilitating a **40%** increase in project delivery efficiency.\n- Implemented a streamlined development workflow improving overall productivity metrics by **25%**, enabling timely completion of critical project milestones.\n- Engaged in continuous learning and adapting to new technologies and frameworks to enhance project outcomes, including exploring **Knime** for data integration processes."
    }
  ],
  "skills": " **Programming Languages:**\n\tPHP, Python, JavaScript/TypeScript, C#, .NET\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tHTTP, RESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tOOP, SOLID, Clean Code, design patterns, secure coding, web infrastructure, web security, problem-solving, mentoring, communication, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "LastPass"
}