{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Security Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Security Engineer with 13+ years of experience in Incident Response, Security Operations, and Network Security. Skilled in Threat Intelligence, Detection and Response, and Malware Analysis, with a strong focus on Threat Hunting leveraging data-driven strategies. Proficient in Coding and Scripting across multiple languages including **JavaScript/TypeScript** and **Python**. Experienced in deploying secure applications and systems, ensuring compliance with industry standards.\nDemonstrated success in cross-functional collaboration to enhance security posture and performance management. Dedicated to problem-solving with a leadership approach, effectively guiding teams through complex security challenges while maintaining high-security protocols.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Security Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conducted **incident response** activities, addressing security incidents and breaches with a focus on **network security** and **detection and response** strategies to mitigate risks.\nImplemented security protocols and procedures to enhance **security operations**, ensuring compliance with industry standards while overseeing **malware analysis** and **digital forensics** investigations.\nLeveraged **threat intelligence** to proactively identify vulnerabilities and threats, utilizing **TCP/IP** protocols for secure network communication and incident handling.\nLed cross-functional collaboration with engineering and IT teams to integrate security measures into the software development lifecycle, ensuring robust **performance management** and adherence to best practices.\nDeveloped and executed **scripting** and coding solutions for automated threat detection and response, streamlining processes and enhancing overall security posture.\nDrove **threat hunting** initiatives to identify and neutralize potential cyber threats, contributing to a more proactive security environment.\nUtilized advanced problem-solving skills to analyze complex security incidents, providing timely resolutions and data-driven recommendations to prevent future occurrences.\nManaged and mentored team members, fostering a culture of continuous learning and improvement in **incident response** and security practices across the organization."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Executed incident response and threat hunting strategies to identify and mitigate security incidents using **TCP/IP** protocols and advanced malware analysis techniques.\n• Collaborated cross-functionally with network security teams to enhance overall security operations and optimize incident management processes.\n• Developed and implemented security detection and response mechanisms through coding and scripting solutions, ensuring prompt identification of vulnerabilities and threats.\n• Led performance management initiatives within the security team, fostering problem-solving and decision-making capabilities to enhance security posture.\n• Conducted comprehensive digital forensics analyses to investigate security breaches, employing cutting-edge tools and techniques to trace the origin of malware incidents.\n• Generated threat intelligence reports that informed security strategy and policy adjustments, protecting against emerging cyber threats.\n• Orchestrated team leadership activities, mentoring junior security engineers to advance their skills in incident response and network security fundamentals.\n• Integrated scripting solutions to automate deliverables related to security operations, increasing efficiency by **30%** in incident tracking and reporting.\n• Implemented a proactive threat detection framework, reducing response time to security incidents by **45%** and minimizing potential data breaches."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Led incident response activities and operationalized security monitoring for a global e-commerce platform, providing expertise in **Network Security** and **Detection and Response**, resulting in a **50%** reduction in incident response time.\nManaged and optimized security operations using **TCP/IP** protocols and advanced threat intelligence tools to identify, analyze, and remediate vulnerabilities effectively.\nConducted malware analysis and digital forensics on compromised systems, utilizing coding and scripting to automate repetitive tasks, which improved efficiency by **30%**.\nDeveloped response strategies for identified threats and risks, implementing a structured threat hunting process that enhanced the organization’s proactive security posture.\nFacilitated cross-functional collaboration among development, operations, and security teams to ensure comprehensive security measures were integrated into the software development lifecycle, improving team efficiency by **25%**.\nProvided team leadership and mentoring, enhancing overall team skills in security protocols and best practices, fostering a culture of continuous learning and improvement.\nOversaw performance management initiatives, establishing key performance indicators for security operations teams that align with organizational objectives.\nUtilized advanced problem-solving techniques to troubleshoot complex security incidents and develop effective remediation strategies, ensuring minimal impact on business operations.\nEngaged in regular security posture assessments and incident drills, ensuring readiness for real-world scenarios, leading to improved incident management preparedness.\nCollaborated on the development of custom security tools and scripts tailored to enhance the digital forensics and malware detection capabilities of the organization."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFlask, Django, FastAPI\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n **Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tIncident Response, Security Operations, Network Security, Detection and Response, Malware Analysis, Digital Forensics, Threat Intelligence, TCP/IP, Cross-functional Collaboration, Coding, Scripting, Threat Hunting, Performance Management, Problem Solving, Team Leadership",
  "apply_company": "Meta"
}