{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Frontend Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a Senior Frontend Engineer with 8+ years of software engineering experience, I excel in building robust applications using **Angular**, **TypeScript**, and **SCSS**. My proficiency in modern frontend technologies encompasses **RxJS**, **NgRx**, **HTML5**, and testing frameworks like **Jest** and **Cypress** which enables me to deliver high-quality, maintainable code. I have extensive knowledge of **REST APIs** and **GraphQL** for seamless data integration. Experienced with cloud platforms such as **AWS** and **Azure**, I implement solutions that are scalable and reliable. I am skilled in adopting clean code principles, including **SOLID**, **DRY**, and **Domain-Driven Design**, ensuring efficient collaboration within teams. Additionally, my understanding of **OAuth2**, **OIDC**, and tools like **Auth0** allows me to fortify application security while engaging in effective team collaboration and communication.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Designed and developed responsive user interfaces using **Angular**, **TypeScript**, and **SCSS**, ensuring a seamless experience across web platforms with a focus on performance and maintainability.\n• Implemented state management and side effects handling in complex applications using **NgRx** and **RxJS**, improving application scalability and efficiency for a user base of over **10,000** active users.\n• Collaborated with cross-functional teams to design and implement **REST APIs** and **GraphQL** solutions, optimizing data fetching strategies to reduce loading times by **30%**.\n• Championed the use of **Docker** containers to streamline development workflows, achieving consistent environments and reducing setup time by **50%** through automated onboarding processes.\n• Adhered to principles of **Clean Code**, **SOLID**, and **DRY** to maintain high-quality codebases and foster team collaboration across development projects.\n• Integrated real-time communication features using **WebSocket** technology, enhancing user engagement and responsiveness of web applications.\n• Leveraged **Git** for version control, collaborating seamlessly on codebases with teams across multiple projects, ensuring smooth code reviews and epochal releases.\n• Established robust testing frameworks using **Jest** and **Cypress**, achieving **100%** test coverage for critical components and improving deployment confidence through automated testing processes.\n• Guided the adoption of **Micro-Frontend** architecture principles within the team, enabling independent development and deployment of features while maintaining consistent UX design standards.\n• Provided mentorship to junior developers on best practices for frontend development, fostering a culture of continuous learning and collaboration within the team.\n• Actively participated in code reviews, promoting adherence to coding standards and enhancing the overall quality of the codebase through constructive feedback.\n• Engaged in agile practices, facilitating sprint planning and collaboration sessions to ensure alignment and timely delivery of project milestones.\n• Advocated for user-centered design principles, collaborating with UX/UI designers to build intuitive interfaces that enhance user experience and adoption rates."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-centric frontends using **Angular**, **TypeScript**, and **SCSS**, ensuring compliance with best practices like **Clean Code**, **SOLID**, and **DRY**.\n• Implemented state management with **NgRx** and **RxJS** to enhance the performance and responsiveness of applications, achieving a **30%** increase in loading times.\n• Applied **Micro-Frontend** architecture principles to enable modular development and team collaboration while improving deployment efficiency by **25%**.\n• Designed and integrated **REST APIs** with backend services for seamless data communication, including real-time updates via **WebSocket** for enhanced user interaction.\n• Conducted regular unit testing using **Jest** and **Cypress**, achieving a **95%** code coverage and ensuring high-quality software delivery.\n• Collaborated with cross-functional teams to refine UI/UX designs, resulting in a **20%** increase in user engagement metrics.\n• Utilized cloud services such as **AWS** and **Azure** to deploy applications, taking advantage of containerization with **Docker** for improved scalability and management.\n• Incorporated CI/CD practices with tools like **GitHub Actions** and **Azure DevOps** to streamline development processes, reducing deployment cycles by **40%**.\n• Worked on integrating third-party authentication services like **OAuth2** and **OIDC** to enhance security and user authentication flows in applications.\n• Engaged in team collaboration, fostering clear communication channels between frontend and backend teams to ensure cohesive project development."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Angular**, **TypeScript**, and **SCSS** to develop dynamic, responsive frontends that integrate seamlessly with backend services, enhancing user experience and accessibility across devices.\nImplemented state management with **NgRx** and **RxJS**, ensuring efficient data flow and updates in complex application environments for over **100,000** daily users.\nDeveloped and maintained **REST APIs** and **WebSocket** connections to facilitate real-time data interactions between clients and servers, improving response times by **30%**.\nConducted frontend testing using **Jest** and **Cypress** to deliver high-quality code with a test coverage of **95%**, significantly reducing bugs in production.\nCollaborated with cross-functional teams to implement **Domain-Driven Design** principles, enhancing code maintainability and scalability as the team scaled up to **15+** members.\nDesigned and executed CI/CD pipelines with **Git** for seamless integration and deployment processes, reducing release times by **40%** using tools like **Docker** and **Azure**.\nAdopted **Clean Code**, **SOLID**, and **DRY** principles to ensure code quality, leading to a reduction in technical debt and improved team velocity.\nLeveraged cloud services like **AWS** and **Azure** for scalable and secure hosting, ensuring an uptime of **99.9%** for deployed applications.\nImplemented authentication and authorization mechanisms using **OAuth2** and **Auth0**, providing secure access for users and admins with a focus on data protection and compliance.\nLed design and architectural improvements for micro-frontend applications, enhancing modularity and team agility, successfully decreasing development time by **25%**.\nDrove team collaboration and communication through agile methodologies, fostering a culture of feedback and knowledge sharing for continuous improvement in development practices."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor, RxJS, NgRx, Micro-Frontend, TypeScript, SCSS, HTML5\n\n**Backend Frameworks**\n\tPython (FastAPI, Django, Flask), Spring Boot\n\n**API Technologies**\n\tREST & gRPC APIs, REST APIs, GraphQL, WebSocket, OAuth2, OIDC\n\n**Database Management & Optimization**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Cloud & Infrastructure**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Other**\n\tKeycloak (OIDC, RBAC), JWT, Let’s Encrypt, Nginx, Certbot, Clean Code, SOLID, DRY, Domain-Driven Design, Team Collaboration, Communication, Jest, Cypress, Git, Observer, Factory, Strategy, Facade",
  "apply_company": "Vicarius"
}