{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Solutions Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Solutions Engineer with 8 years of experience leveraging **AI**, **automation**, and **NLP** technologies to deliver innovative solutions across healthcare and financial sectors. Proficient in various **cloud** platforms, including **AWS** and **Azure**, and adept in building seamless **APIs** using **REST** and **GraphQL** frameworks. Skilled in integrating enterprise-level solutions such as **CRM** and **ERP** systems like Salesforce and HubSpot to optimize processes and enhance user engagement.\n\nI possess robust capabilities in **Conversational AI** and **RPA** for automating workflows, underpinned by a solid background in full-stack development using **JavaScript/TypeScript**, **Python**, **React**, **Next.js**, **Node.js**, **FastAPI**, and **Django**. My experience extends to designing systems that ensure compliance with critical standards such as HIPAA, FHIR, PCI DSS, and SOC 2, all while fostering strong relationships through effective communication and presentation skills. Additionally, I have implemented advanced **MLOps** workflows using technologies like **MLflow**, **Airflow**, and **Kubeflow**, enhancing operational efficiency and predictive analytics.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Solutions Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Integrated **AI**-based features into client-facing applications to enhance user experience, including smart financial dashboards and personalized health recommendations, powered by trained models and APIs hosted on **Azure ML** and **AWS Sagemaker**.\n- Leveraged **APIs** and **cloud** services (such as **AWS** and **Azure**) to develop scalable, full-stack applications tailored for healthcare and financial services.\n- Collaborated with teams to implement **REST** and **GraphQL** for seamless data interaction, optimizing for performance and scalability across platforms.\n- Designed and executed automated workflows and **RPA** solutions to streamline processes, increasing efficiency in operational workloads.\n- Developed machine learning models for critical applications such as patient risk prediction and financial fraud detection, utilizing technologies like **scikit-learn**, **TensorFlow**, and **PyTorch**.\n- Established and maintained enterprise-level DevOps pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI**, integrating automated testing and multi-environment deployments.\n- Delivered data visualization solutions using **D3.js**, **Chart.js**, and **Power BI Embedded**, providing real-time insights into key operational metrics and transaction trends.\n- Implemented natural language processing (NLP) capabilities for healthcare and financial applications using tools like **spaCy** and **Hugging Face Transformers** to enhance document parsing and anomaly detection.\n- Spearheaded the transformation of monolithic applications to microservices architectures with **Docker**, **Kubernetes (AKS/EKS)**, and serverless solutions using **AWS Lambda** and **Azure Functions**.\n- Developed cross-platform mobile applications using **Flutter** and **React Native**, optimizing user experiences across both iOS and Android devices with state management frameworks such as **Provider** and **Redux**.\n- Managed cloud-native data architectures using **PostgreSQL**, **MongoDB**, and **Redis**, ensuring robust data ingestion and querying capabilities suitable for large-scale applications.\n- Established rigorous testing strategies employing tools such as **Jest**, **Cypress**, **PyTest**, and **Postman**, ensuring comprehensive coverage across front-end and back-end services.\n- Automated CI/CD processes for mobile applications with tools like **Fastlane** and **App Center**, enhancing release management and monitoring of application performance through analytics like **Firebase Crashlytics**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Spearheaded the modernization of financial platforms by leveraging **cloud** technologies such as **Azure** and adopting **microservices** architecture with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), achieving a **40%** increase in scalability and maintainability for high-volume transaction systems.\n• Enhanced user engagement by developing dynamic front-end applications using **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, implementing **Redux Toolkit** and **Tailwind CSS** to achieve a **25%** faster loading time and improved responsiveness in financial dashboards and admin portals.\n• Designed and implemented real-time analytics solutions for transaction monitoring using **React**, **D3.js**, and **Power BI Embedded**, resulting in a **30%** reduction in anomaly detection time and providing actionable insights for operational teams.\n• Integrated asynchronous messaging systems using **Kafka**, **RabbitMQ**, and **Azure Service Bus** to establish a reliable event-driven architecture that handles **100k** messages per second, supporting real-time processing for transactions, alerts, and compliance workflows.\n• Developed and orchestrated ETL pipelines employing **Python**, **Apache Airflow**, and **Azure Data Factory**, enabling seamless batch and real-time data ingestion from both internal and third-party sources, processing over **1TB** of financial data weekly.\n• Implemented machine learning models for fraud detection utilizing **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, with a **95%** accuracy rate in analyzing transaction patterns and user behavior to flag suspicious activities.\n• Created comprehensive ML pipelines for various applications including credit scoring and churn prediction with **MLflow** and **Airflow**, ensuring real-time model inference directly integrated into backend services for instantaneous decision-making.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **AI** and **NLP** technologies to develop conversational interfaces and integrate intelligent automation into client solutions, driving engagement and efficiency.\nEngineered cloud-based solutions leveraging **AWS**, **Azure**, and **Google Cloud**, ensuring scalable infrastructure while meeting client requirements for performance and reliability.\nDesigned and optimized **APIs** with **REST** and **GraphQL** standards to enhance interoperability between systems and facilitate effective data exchange in **CRM** and **ERP** platforms.\nDeveloped automation workflows using **RPA** tools to streamline business processes, reducing manual efforts by up to **30%** and minimizing error rates in operations.\nEnhanced data management strategies by integrating solutions with leading **Salesforce** and **HubSpot** platforms, ensuring seamless data flow and operational continuity.\nDesigned user-friendly presentations to communicate complex system integrations and functionality clearly to clients and stakeholders, enhancing relationship building and securing stakeholder buy-in.\nImplemented strategic automation initiatives that resulted in a **20%** increase in operational efficiency, enabling faster transaction processing for clients' end-users.\nFostered strong client relationships rooted in effective communication, understanding their business needs and aligning technical solutions accordingly.\nCollaborated with multidisciplinary teams to deploy solutions that leverage advanced technologies, positioning our offerings ahead of market trends and client expectations.\nPresented automation and AI capabilities at industry conferences, enhancing the company’s visibility and reputation within the field."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST, GraphQL, APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GoogleCloud\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GoogleCloud\n\n**Other:**\n\tAI, automation, ConversationalAI, NLP, CRM, ERP, RPA, Salesforce, HubSpot, presentation, communication, relationshipBuilding",
  "apply_company": "Enterprise Bot"
}