{
  "name": "Rei Taro",
  "role_name": "Senior ML Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior ML Engineer with over 10 years of experience in **Machine Learning**, **AI**, **Data Science**, and **MLOps**. Skilled in developing production-ready machine learning models and processing pipelines for real-time and batch processing. Proficient in **Python** (FastAPI, Django, Flask) and leveraging **cloud** technologies such as **AWS** and **Azure** to optimize ML workflows. Expertise in creating comprehensive documentation, rigorous testing methodologies, and effective monitoring and governance strategies. Successfully contributed to transformative projects with leading organizations including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Developed and engineered **Machine Learning** models using **Python** for predictive analysis and data processing, significantly enhancing business insights with a **90% accuracy rate**.\n• Implemented **AI** solutions to automate data handling processes, reducing operational costs by **30%**.\n• Leveraged **MLOps** to facilitate the deployment and management of machine learning models in a production environment, ensuring reliability and scalability.\n• Built and maintained **real-time** and **batch processing** pipelines, improving data flow efficiency by processing **over 100,000** records daily.\n• Utilized **cloud services** like **Azure** for hosting and managing **ML** models, employing tools such as **Azure Functions** for serverless computing.\n• Created comprehensive documentation and reports on processes, methodologies, and results, enhancing team knowledge sharing and governance.\n• Executed rigorous testing and monitoring strategies to ensure ongoing performance and compliance within machine learning frameworks."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Python** for developing robust backend systems, enhancing document workflows and streamlining user onboarding processes while integrating **Machine Learning** techniques for predictive analytics.\nImplemented **AI** algorithms to produce real-time insights from data, ensuring efficient **Batch Processing** and timely reporting for operational workflows.\nDesigned and managed the deployment of microservices on **Azure App Services** using **Terraform** for infrastructure automation, ensuring a scalable environment across **9+** production services.\nCreated event-driven architectures with **Celery** and **Redis**, enabling asynchronous processing of extensive financial data, handling up to **5,000 transactions per minute**.\nEngineered and optimized data pipelines utilizing **Apache Airflow** and **Azure Functions** for secure regulatory data exchange, automating processes that comply with necessary governance standards.\nConducted thorough security audits and implemented **OAuth2** and **Azure AD B2C** to reinforce authentication protocols, ensuring adherence to compliance with industry standards and regulations.\nCollaborated with cross-functional teams, enhancing communication for smoother **MLOps** practices and successful release management, engaging with **10+** stakeholders across various departments."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed production-ready machine learning models utilizing **Python** for trade execution and portfolio optimization, incorporating both real-time and batch processing workflows.\n• Enhanced trading operations by implementing AI-driven analytics, ensuring robust data science practices throughout the systems.\n• Engineered real-time price feed processors with **asyncio**, **WebSockets**, and **Redis** to deliver timely trading updates, optimizing data flow for high-frequency transactions.\n• Collaborated with cross-functional teams to create comprehensive documentation and facilitate governance strategies ensuring compliance with regulatory standards, including MiFID II and GDPR.\n• Implemented advanced testing strategies using **PyTest** and mock servers, streamlining QA and continuous integration processes with **version 3.10** of Python, resulting in a 30% reduction in deployment errors.\n• Integrated job queuing and scheduling solutions with **Celery** and **RabbitMQ** to optimize backend task execution, improving processing times by 25%.\n• Conducted thorough monitoring and performance tuning of machine learning pipelines, ensuring they are robust and scalable within cloud environments."
    }
  ],
  "skills": " \n**Programming Languages**\n\tPython, SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Testing, Monitoring\n\n**Cloud & Infrastructure**\n\tCloud\n\n**Other**\n\tAI, Machine Learning, Data Science, MLOps, LLMOps, Productionise, Documentation, Batch Processing, Real-time, Governance",
  "apply_company": "Ageas UK"
}