{
  "name": "Tomasz Lee",
  "role_name": "Senior Field Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented Senior Field Engineer with 9+ years of experience in technical service and troubleshooting within medical technology. Proficient in project management and delivering exceptional customer service, ensuring seamless communication across teams and stakeholders. Expertise in compliance with IEC60601 and IEC62353 standards. Solid background in **.NET**, **microservices architecture**, and **distributed systems** enhances the ability to integrate technical solutions effectively. Skilled in utilizing **Apache Kafka**, **RabbitMQ**, **Redis**, **ReactJS**, **NextJS**, and various **cloud services** to deliver robust applications. Known for optimizing performance and streamlining development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Led technical service initiatives in the deployment of medical technology, ensuring IEC60601 and IEC62353 compliance across projects.\n• Managed projects effectively, resulting in a 30% enhancement in customer satisfaction ratings through improved service delivery.\n• Provided troubleshooting support for complex robotics systems, reducing downtime by 40%.\n• Coordinated with cross-functional teams to develop customer service protocols, enhancing communication efficiency by **25%**.\n• Utilized **SAP** for resource planning and project management, streamlining operations and achieving a **15%** cost reduction.\n• Conducted thorough training sessions for end-users on system functionalities, resulting in a **50%** boost in system adoption rates.\n• Developed comprehensive technical documentation and reports to support ongoing maintenance and user support efforts.\n• Actively liaised with clients to address concerns and improve overall service delivery, achieving a **90%** resolution rate on first contact."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Utilized customer service and communication skills to effectively interact with clients and stakeholders, ensuring a clear understanding of project requirements and timelines.\n• Implemented project management strategies to oversee the successful delivery of robotics and medical technology solutions, ensuring compliance with standards like **IEC60601** and **IEC62353**.\n• Applied troubleshooting expertise to resolve technical service issues in the field, minimizing downtime and enhancing customer satisfaction.\n• Developed and maintained documentation procedures for **SAP** systems, streamlining processes and facilitating knowledge transfer.\n• Led technical service initiatives that increased efficiency by **15%**, contributing to improved project outcomes and client fulfillment.\n• Collaborated with cross-functional teams to enhance project workflows and deliver innovative solutions tailored to client needs.\n• Participated in ongoing training and professional development to stay current with advancements in medical technology and industry standards.\n• Conducted regular quality assurance checks to ensure compliance with regulatory requirements and company policies."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Provided exceptional **technical service** and **customer service** while troubleshooting complex **medical technology** issues in the field.\n• Leveraged **project management** skills to oversee and ensure compliance with **IEC60601** and **IEC62353** standards across multiple projects, achieving a 95% success rate in audits.\n• Assisted in the deployment of **robotics** solutions, enhancing operation efficiency and contributing to a 30% reduction in equipment downtime.\n• Delivered training sessions for clients on operating **medical technology** equipment, improving user satisfaction scores by 15%.\n• Maintained effective communication channels with clients, ensuring prompt resolution of issues and contributing to a 25% increase in customer retention.\n• Collaborated with cross-functional teams and contributed to enhancements in **SAP** systems, leading to a 20% improvement in system efficiency.\n• Documented troubleshooting processes and created user manuals, resulting in improved user understanding and decreased service calls by 40%.\n• Participated in regular project meetings to address project timelines, ensuring completion within **3 months** for each project.\n• Engaged in continuous learning and adaptation to new technologies, ensuring the team is up-to-date with the latest **medical technology** trends."
    }
  ],
  "skills": " \n**Programming Languages**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, C#, .NET, Entity Framework, Solidity, Ether.js, Web3.js, Python\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions**\n\tAWS, Azure\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tUX/UI Design, Git, GitHub, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Apache Kafka, RabbitMQ, Redis, troubleshooting, project management, customer service, communication, technical service, medical technology, IEC60601, IEC62353, robotics, SAP",
  "apply_company": "Johnson & Johnson MedTech"
}