{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Product-aware Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Product-aware Software Engineer with 8 years of experience, I possess strong expertise in **Java**, **Kotlin**, **Groovy**, and **Spring Boot**, complementing my robust skills in **NodeJS** and **React** to build high-performance applications. I am proficient in implementing **microservices architecture** and **RESTful Web Services**, ensuring scalable and maintainable solutions tailored to organizational needs. With hands-on experience in cloud services like **AWS** and containerization tools such as **Docker**, I have streamlined deployments and enhanced operational efficiency.\n\nMy technical acumen extends to **PostgreSQL** for effective data modeling, alongside experience in **Jenkins** and **Terraform** for CI/CD automation. I actively engage in Agile methodologies, collaborating with cross-functional teams to solve complex software challenges efficiently. Additionally, my background includes proficiency in **Python** for versatile programming tasks, alongside **Quarkus** for optimized Java applications. I thrive in dynamic environments, leveraging problem-solving skills and product awareness to deliver innovative solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Product-aware Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust applications using **Java**, **Kotlin**, and **Groovy** to meet product requirements in a **microservices architecture**.\n- Ensured high-quality code development through thorough unit testing with **JUnit 5** and integration testing using **Spock**, achieving a coverage of over **90%**.\n- Designed and implemented **RESTful Web Services** swiftly to enhance system interoperability for **NodeJS** and **React** applications.\n- Collaborated with cross-functional teams applying **Agile methodologies** to efficiently deliver features aligned with product goals, resulting in **30%** increased productivity.\n- Utilized **Docker** for seamless application containerization, ensuring environment consistency across development and production deployments.\n- Automated build processes and deployment pipelines leveraging **Jenkins** and **Terraform**, reducing deployment time by **50%**.\n- Managed and maintained PostgreSQL databases, optimizing data modeling practices to improve query performance by **40%**.\n- Actively used **OpenSearch** for implementing advanced search functionalities within applications capable of handling thousands of queries per second.\n- Facilitated team problem-solving sessions, fostering a collaborative environment and improving team velocity through effective communication and support.\n- Led initiatives to refactor outdated systems utilizing **Quarkus** to modernize application interfaces and streamline development workflows."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Kotlin** to design and develop scalable microservices within the **Quarkus** framework, enhancing application performance and modularity for financial applications.\nImplemented **AWS** cloud services to ensure robust and secure deployment of services, achieving an uptime of **99.9%** and reducing operational costs by **20%**.\nDeveloped RESTful web services in **Node.js** and **Python** that streamlined data access, significantly improving response times for high-frequency transaction queries by **40%**.\nLeveraged **PostgreSQL** for data modeling and management, optimizing database structure and queries to handle over **1 million** transactions per day efficiently.\nDesigned and orchestrated CI/CD pipelines using **Docker** and **Jenkins**, resulting in deployment frequency increases of **50%** with minimal downtime.\nImplemented infrastructure as code with **Terraform**, ensuring consistent and rapid provisioning of resources aligned with Agile methodologies.\nCreated dynamic front-end experiences leveraging **React** and applying agile principles in collaboration with UX/UI designers to enhance user experience for financial dashboards.\nConducted regular code reviews and pair programming sessions using **JUnit 5** and **Spock** to ensure code quality and enhance team productivity through collaborative problem-solving.\nIntegrated **OpenSearch** for advanced data search capabilities, driving real-time insights into business performance metrics.\nFostered a culture of continuous improvement through Agile methodologies, enhancing team collaboration and project transparency, ultimately leading to faster time-to-market for new features."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Java**, **Kotlin**, and **Groovy** to develop and optimize microservices on the e-commerce platform, ensuring scalability and performance improvements by applying **Agile methodologies** and best practices in **Microservices architecture**.\nImplemented backend services integration with **PostgreSQL** for efficient data storage and retrieval, leveraging database **Liquibase** for version control and rollback capabilities across **1.0** releases.\nDesigned and integrated RESTful web services using **Spring Boot** and **NodeJS**, streamlining communication between microservices while maintaining high availability during peak traffic scenarios exceeding **10,000** concurrent users.\nAutomated deployment pipelines using **Docker** and **Jenkins**, achieving deployment consistency and reducing deployment times by **30%** through CI/CD practices.\nApplied infrastructure as code using **Terraform** on **AWS**, ensuring smooth provisioning and management of cloud resources, leading to a **40%** reduction in provisioning errors.\nDeveloped and maintained front-end components with **React** and **JUnit 5**, enhancing UI responsiveness and performance through robust testing methodologies while supporting a seamless user experience across various devices.\nExecuted **OpenSearch** for efficient data retrieval and enhanced search functionality, accommodating real-time tracking of user interactions and boosting user engagement metrics by **25%**.\nCollaborated effectively with cross-functional teams to identify and resolve platform issues through strong **problem-solving** capabilities, contributing to a more resilient and user-friendly application.\nImplemented data modeling techniques to support the design and enhancement of database schemas for improved data integrity and accessibility.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Kotlin, Groovy, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Quarkus, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful Web Services\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, OpenSearch, Liquibase\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure (App Services, Blob, SQL)\n\n**Other:**\n\tCollaboration, Problem-solving, Agile methodologies, Microservices architecture, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Data modeling, JUnit 5, Spock"
}