{
  "name": "Mariusz Jan Skobel",
  "role_name": "Frontend Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Frontend Developer with 10+ years of experience specializing in high-performance software solutions for ecommerce platforms. Proficient in **Next.js**, **TypeScript**, **JavaScript**, HTML, and (S)CSS, with a strong foundation in **Web APIs** and modern build pipelines. Experienced in deploying applications on **AWS** and **Azure**, with a commitment to performance best practices, security best practices, and accessibility standards. Adept in utilizing **Git** for version control and collaborating with teams to ensure clear communication. Proven track record in developing efficient, maintainable solutions, and implementing **CI/CD workflows** for seamless deployments. Additionally, brings expertise in frameworks like React and Vue, with a background in microservices architecture and event-driven systems, all while maintaining a focus on delivering real-world impact through code.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Frontend Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented user-centric, full-stack solutions utilizing **Next.js**, **TypeScript**, and **JavaScript**, ensuring modern web standards such as accessibility and performance best practices.\n• Developed and maintained responsive UI components using **HTML**, **(S)CSS**, and component libraries, enhancing user experience across various devices.\n• Collaborated effectively with cross-functional teams to establish robust CI/CD workflows using **Git** and **Vercel**, streamlining deployment processes for web applications.\n• Integrated web APIs and third-party services with **Git** version control, promoting efficient code management and collaboration in large-scale projects.\n• Optimized eCommerce platforms, including **Salesforce Commerce** and **Shopify**, to improve load times by **30%** and enhance customer engagement.\n• Implemented modern build pipelines and debugging strategies, ensuring adherence to security best practices while reducing build times by **20%**.\n• Established frameworks for component libraries and design systems, promoting consistency and reusability across **10+** web applications.\n• Engaged in performance monitoring using tools like **Datadog**, leading to a **15%** reduction in frontend performance bottlenecks through targeted enhancements.\n• Provided clear communication and collaboration with team members to ensure alignment on project goals and deliverables, enhancing team productivity by **25%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Next.js (13)** and **TypeScript (4.4)** to develop dynamic front-end applications, enhancing the user experience for ecommerce platforms such as **Salesforce Commerce** and **Shopify**.\nImplemented a CI/CD workflow using **Git** and **Vercel**, achieving a deployment frequency of **4 times per day** while ensuring high quality through performance and accessibility best practices.\nCollaborated with cross-functional teams to design and maintain component libraries and design systems, increasing development efficiency by **30%** and fostering a unified UI/UX across multiple platforms.\nEmployed **JavaScript**, **HTML**, and **(S)CSS** to create responsive layouts, optimizing load times to achieve a **25% reduction** in bounce rates and improving search engine rankings.\nIntegrated Web APIs to facilitate seamless interactions with backend services, employing asynchronous programming techniques to maintain a smooth user experience, even under high traffic loads.\nImplemented performance monitoring and debugging strategies using **Datadog**, resulting in a **40% decrease** in reported frontend issues over a period of **6 months**.\nConducted code reviews and mentored junior developers, promoting knowledge sharing and collaborative problem solving, evidenced by an increase in team productivity and morale."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed responsive, SEO-friendly e-commerce UIs using **Next.js (13)**, **TypeScript**, **JavaScript**, and **HTML5/CSS3**, ensuring accessibility compliance (WCAG 2.1) and delivering a mobile-first experience for users.\nEngineered modern build pipelines utilizing **Vercel** for seamless deployment, enhancing workflow efficiency, and streamlining CI/CD processes in line with industry standards.\nCollaborated effectively with cross-functional teams to implement design systems and component libraries, fostering clear communication and collaboration throughout project lifecycles.\nEnhanced user interfaces by implementing performance best practices, resulting in a **30%** improvement in load times across high-traffic sections of the e-commerce platform.\nUtilized Web APIs to integrate third-party services, ensuring seamless data flow and improved user experience while maintaining security best practices for user data protection.\nConducted debugging and optimization of front-end code, achieving **25%** reduction in core web vitals for better SEO rankings and user experience.\nApplied asynchronous programming techniques to enhance application responsiveness, supporting real-time data updates in the user interface.\nEnsured structured version control and collaboration through **Git**, promoting a streamlined development process across teams while managing ongoing updates.\nImplemented accessibility best practices to ensure an inclusive experience for all users, contributing to compliance with regulatory standards.\n\n"
    }
  ],
  "skills": " **Frontend Frameworks:**\n\tNext.js, JavaScript, TypeScript, HTML, (S)CSS, React, Vue, Angular\n\n **Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n **API Technologies:**\n\tWeb APIs\n\n **Serverless and Cloud Functions:**\n\tAWS, GCP, Azure\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Git, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Vercel, Datadog, asynchronous programming, debugging, performance best practices, accessibility best practices, security best practices, CI/CD workflows, design systems, component libraries, collaboration skills, clear communication skills, ecommerce platforms, Salesforce Commerce, Shopify, Let’s Encrypt, Nginx, Certbot, Keycloak (OIDC, RBAC), JWT, OAuth2, modern build pipelines"
}