{
  "name": "Marcin Karol Kotlinski",
  "role_name": "R&D Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-oriented R&D Engineer with 8 years of experience in full stack development, with a proven ability to build high-performance solutions in line with software development lifecycle and agile methodology. Expertise includes **Python**, **React**, **Next.js**, **FastAPI**, and **CI/CD**, with a solid background in cloud deployment across platforms such as **Azure** and **AWS**. Adept at creating and optimizing AI/LLM pipelines that enhance functionality and innovation, I have successfully led projects that integrate advanced data processing and predictive analytics, utilizing my deep understanding of modern technologies.\n\nWith strong problem-solving and communication skills, complemented by hands-on experience in software development, I am dedicated to delivering robust and secure applications. Proficient in version control with **Git** and familiar with best practices, my contributions have consistently aligned with compliance standards such as HIPAA and PCI DSS. My ability to bridge the gap between complex technical concepts and actionable strategies drives successful project outcomes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "R&D Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and implemented AI/LLM pipelines utilizing **Python** to enhance throughput on R&D projects, applying machine learning techniques for innovative solutions.\n- Engineered scalable web applications with **React** and **Next.js**, focusing on user-centric design and performance optimization, while maintaining active communication with cross-functional teams.\n- Established continuous integration and continuous deployment (CI/CD) pipelines in line with **agile methodology**, ensuring rapid and reliable software delivery using **Git** and associated tools.\n- Spearheaded the design and deployment of cloud solutions, ensuring high availability and fault tolerance through cloud deployment strategies within **FastAPI** architecture.\n- Fostered a culture of problem-solving and innovation, addressing complex technical challenges through collaborative brainstorming and strategic planning sessions.\n- Led software development lifecycle initiatives, enhancing the team's efficiency and output by streamlining project workflows and optimizing resource allocation.\n- Participated in regular sprint reviews and retrospectives to hone team performance and refine development processes, ensuring alignment with project goals.\n- Communicated complex concepts and findings to stakeholders, enhancing understanding and support for R&D initiatives and outcomes.\n- Drove the integration of modern frameworks and tools, maintaining a focus on best practices in coding and software development.\n- Mentored junior developers on the team, sharing knowledge of **React**, **FastAPI**, and **CI/CD** processes to cultivate a strong development culture."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained financial platforms using **Python** (with frameworks such as **FastAPI** and **Django**), enhancing the software development lifecycle and enabling efficient CI/CD processes.\n• Designed and built interactive and user-friendly front-end applications with **React** (version **18**), **Next.js**, and **TypeScript**, employing best practices to improve user experience in financial dashboards.\n• Engineered AI/LLM pipelines for predictive analytics, leveraging **scikit-learn** and **XGBoost** to enhance the accuracy of fraud detection systems, contributing to innovation in banking solutions.\n• Spearheaded the integration of real-time data processing frameworks like **Kafka** and **RabbitMQ**, improving operational communication and efficiency in transaction processing workflows.\n• Implemented robust cloud deployment strategies using services from **Azure**, optimizing performance and scalability for high-volume transactions.\n• Championed the agile methodology to foster collaboration and communication within the development team, ensuring timely delivery of features and solutions.\n• Crafted and orchestrated ETL pipelines with **Apache Airflow** and **Azure Data Factory**, facilitating near real-time data ingestion from various sources for better financial reporting.\n• Developed communication skills by routinely presenting analytical findings and project updates to stakeholders, aiding in informed decision-making.\n• Solved complex problems through innovative technology implementations, directly impacting system throughput, maintainability, and overall platform resilience."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied strong Python programming skills to develop and optimize backend services, improving system efficiency for R&D projects utilizing **FastAPI** and **Django**.\nImplemented AI/LLM pipelines to drive innovation in product features and enhance performance, ensuring alignment with research objectives and user needs.\nDesigned and developed responsive user interfaces using **React** and **Next.js** (version 13), facilitating seamless user experiences based on the latest advancements in software development.\nLeverage CI/CD practices for streamlined integration and delivery, ensuring high-quality code and rapid deployment cycles that support agile methodology.\nManaged cloud deployment solutions to ensure scalable and reliable infrastructure for R&D projects, optimizing resource utilization and performance.\nUtilized version control with **Git** to maintain code integrity and collaborative development efforts, ensuring efficient tracking of changes and feature enhancements.\nEngaged in the software development lifecycle, focusing on thorough testing and feedback loops to continuously improve project outcomes and adherence to best practices.\nDemonstrated effective communication skills to collaborate with cross-functional teams, facilitating knowledge transfer and rapid problem-solving during the product development process.\nAdvanced innovative solutions for complex challenges, tackling issues with a problem-solving mindset to drive project success and achieve research milestones."
    }
  ],
  "skills": "Programming Languages:\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI\n\n**Frontend Frameworks:**\n\tReact, Next.js\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Git, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tcloud deployment\n\n**Other:**\n\tAI/LLM pipelines, software development lifecycle, agile methodology, communication skills, problem-solving, innovation, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}