{
  "name": "Rei Taro",
  "role_name": "Backend Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Backend Developer with over 10 years of experience in creating high-performing **APIs** and managing **Databases** for scalable backend systems. Proficient in **PHP**, with a strong emphasis on **Clean Code** principles and comprehensive **Testing** and **Deployment** strategies. Expertise in leveraging **Docker** for containerization, along with **Messaging Brokers** for efficient service communication. Proven ability to monitor and optimize backend performance while keeping abreast of **E-commerce Trends**. Recognized for exceptional communication skills and a collaborative approach, contributing to successful projects in various high-impact environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed robust **PHP** APIs facilitating seamless interactions with various databases, enhancing data access and manipulation performance by **30%**.\nImplemented messaging brokers to ensure efficient data communication between services, contributing to an overall system response time improvement of **20%**.\nManaged deployment processes using **Docker**, ensuring streamlined application delivery and environment consistency across **3** different staging and production environments.\nPracticed clean coding standards to develop maintainable and scalable backend architecture, which reduced technical debt by **15%**.\nConducted rigorous testing phases to guarantee high performance and reliability ahead of product launches, meeting the deadlines for **5** major releases.\nCollaborated effectively with cross-functional teams to understand and implement e-commerce trends, utilizing strong communication skills to enhance project delivery.\nRegularly monitored application health and performance metrics to proactively address issues, contributing to a **25%** reduction in downtime incidents."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "- Developed robust **APIs** in **PHP** to enhance backend functionality, ensuring seamless communication between various systems and improving overall user experience by 30%.\n- Leveraged **Databases** to optimize data retrieval and storage processes, achieving a 20% reduction in response time for user queries.\n- Implemented message queuing systems with **Messaging Brokers**, facilitating efficient task processing and data synchronization across services.\n- Adopted **Docker** for containerization of applications, enabling consistent deployment and scaling of services in diverse environments.\n- Emphasized **Clean Code** principles in code reviews and development practices to enhance maintainability and reduce technical debt by 40%.\n- Established comprehensive **Testing** strategies, utilizing unit and integration tests to ensure quality and reliability in software releases, achieving a bug rate reduction of 25%.\n- Spearheaded **Deployment** automation protocols, integrating CI/CD pipelines into development workflows to expedite release cycles and minimize downtime.\n- Monitored application performance metrics to identify and address potential issues proactively, ensuring 99.9% uptime for critical services.\n- Maintained strong **Communication Skills** by collaborating with cross-functional teams and stakeholders, aligning development efforts with business objectives and user needs.\n- Stayed updated on **E-commerce Trends**, integrating the latest technologies and methodologies to foster innovation and enhance system capabilities."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **PHP** to develop and maintain robust backend services for efficient trade execution, portfolio management, and account tracking.\nDesigned and implemented REST **APIs** to facilitate seamless data interaction between frontend applications and backend services, supporting high volumes of requests.\nManaged database operations using advanced **Databases** techniques to ensure optimal data storage and retrieval, enhancing trading operations and user experiences.\nIncorporated **Messaging Brokers** strategies, specifically with tools like **RabbitMQ**, to ensure efficient communication and processing of tasks in a timely manner.\nDeveloped containerized applications with **Docker** to streamline deployment processes and improve scalability of backend systems.\nMaintained a clean code architecture, ensuring the application is robust, scalable, and easy to maintain through adherence to **Clean Code** principles.\nExecuted thorough **Testing** across all stages of development using automated tools to ensure functionality, reliability, and performance of applications.\nImplemented monitoring solutions to track system performance and user interactions, ensuring high availability and reliability.\nFostered effective **Communication Skills** with cross-functional teams, including frontend developers and project managers, to align on project goals and deliverables.\nActively researched and adapted to current **E-commerce Trends**, enhancing the platform's competitive edge by integrating innovative features and functionalities."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, PHP\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **Frontend Frameworks**\n\t\n\n  **API Technologies**\n\tREST/gRPC APIs, APIs\n\n  **Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n  **Cloud & Infrastructure**\n\t\n\n  **Other**\n\tClean Code, Testing, Deployment, Monitoring, Communication Skills, E-commerce Trends, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, PyTest, Git"
}