{
  "name": "Rei Taro",
  "role_name": "Senior Build Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Build Engineer with over 10 years of experience in project delivery and resource planning. Proficient in ensuring compliance with health and safety standards while managing budgets and mitigating risks in high-stakes environments. Skilled in monitoring and auditing processes to enhance operational efficiency. Recognized for strong communication skills and a proactive, solutions-focused mindset that drives project success. Previously contributed to complex infrastructure projects, demonstrating expertise in **networking**, **civils**, and **cabling** methodologies.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Build Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Ensured compliance with health and safety regulations while overseeing project delivery and implementation of networks.\nManaged resources effectively by utilizing advanced project delivery strategies and budgeting techniques to ensure projects are completed within a **$500,000** budget.\nConducted rigorous risk management assessments to identify potential challenges and develop proactive solutions, minimizing disruptions by **30%**.\nEnhanced cabling systems and infrastructure in accordance with NRSWA regulations, improving the deployment process by **15%**.\nLed monitoring and auditing efforts on civil engineering projects, ensuring adherence to compliance standards and reducing incidents by **20%**.\nFostered clear communication between cross-functional teams to address network integration challenges and streamline resource planning.\nUtilized **fibre** technology to improve network performance and reliability in various infrastructure projects."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Ensured compliance with industry standards and health and safety regulations throughout project delivery, focusing on resource planning and budget management.\nLed risk management initiatives to proactively identify and mitigate potential project challenges, ensuring timely deliverables and stakeholder satisfaction.\nConducted thorough monitoring and auditing of builds, aligning with NRSWA regulations and maintaining rigorous compliance in civil engineering projects.\nDeveloped and implemented effective communication strategies among cross-functional teams to facilitate seamless project execution and collaboration.\nOversaw cabling operations and managed fibre network installations, optimizing resource allocation and minimizing delays for successful project outcomes.\nDesigned and executed solutions-focused strategies to enhance build processes and reduce costs while ensuring high-quality results.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Oversaw project delivery and compliance for civil and cabling works, ensuring adherence to **NRSWA** regulations and health and safety standards across various sites.\nManaged resource planning and budget management for multiple projects, effectively balancing a budget of **$1M** to ensure timely completion and cost efficiency.\nMonitored and audited project progress, delivering proactive communication to stakeholders, resulting in a **15%** reduction in project delays.\nImplemented solutions-focused strategies to optimize workflows, ensuring that all project specifications meet the necessary quality standards and compliance requirements.\nDeveloped comprehensive reports on project risks and mitigation strategies, maintaining a risk management framework that decreased unforeseen issues by **20%**.\nFacilitated training sessions on safety protocols and compliance, enhancing team performance and adherence to regulatory guidelines.\nUtilized modern project management tools to streamline communication and improve the overall project delivery process across all teams."
    }
  ],
  "skills": " **Programming Languages**\n\t Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks**\n\t FastAPI, Flask, Django, Celery\n\n **Frontend Frameworks**\n\t  \n\n **API Technologies**\n\t REST/gRPC APIs, Microservices\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps**\n\t Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n **Cloud & Infrastructure**\n\t  \n\n **Other**\n\t fibre, network, health and safety, compliance, project delivery, NRSWA, civils, cabling, resource planning, budget management, risk management, monitoring, auditing, communication, proactive, solutions-focused",
  "apply_company": "GoFibre"
}