{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Security Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Security Engineer with 13+ years of experience in delivering high-performance applications, now pivoting into cybersecurity engineering. Proficient in **security architecture**, **cloud security**, and **information security frameworks**, with a strong command of **scripting languages** and **Linux** for automating security processes. Skilled in **vulnerability scanning tools** and **penetration testing**, ensuring robust system defenses and compliance with industry standards.\nExperienced in **risk management** and **incident response**, with proven problem-solving abilities that enhance team collaboration and communication skills. Additionally, leveraging a solid foundation in full-stack development, including expertise in **JavaScript/TypeScript**, **Python**, and frameworks such as **React**, **Next.js**, and **Django** to integrate security best practices into the software development lifecycle. Well-versed in cloud deployments on **AWS** and **Azure**, and familiar with **DevSecOps** methodologies to foster secure, scalable solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Security Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **security compliance** measures adhering to **HIPAA, GDPR, PCI DSS**, and **SOX**, ensuring robust data protection for healthcare and fintech applications.\nConducted vulnerability scans and penetration testing using advanced **vulnerability scanning tools** to identify and mitigate potential security threats, achieving a **30%** reduction in vulnerabilities within **6 months**.\nEngineered **cloud security** strategies within **AWS** and **Azure** environments, improving overall system security posture and ensuring safe deployment of applications.\nDeveloped **security architecture** frameworks that encompass integrated security features into full-stack platforms, leveraging industry-best **information security frameworks**.\nUtilized **Linux** and scripting languages to automate security processes, enhancing operational efficiency and incident response times by **40%**.\nCollaborated with cross-functional teams to enforce strong **DevSecOps** practices, integrating security throughout the development lifecycle, thereby streamlining compliance workflows.\nImplemented **cryptography concepts** across data storage solutions, ensuring high-level confidentiality and integrity of sensitive information within **PostgreSQL** and **MongoDB** databases.\nDirected incident response plans, reducing response times to security incidents by **50%** through proactive monitoring and timely remediation.\nFacilitated **team collaboration**, fostering an environment of open communication and knowledge sharing to drive continuous improvement in security practices.\nDemonstrated effective **communication skills** in presenting security strategies and governance to stakeholders, enhancing awareness and adherence to **risk management** protocols.\nUtilized problem-solving techniques to navigate complex security challenges and continuously improve security postures across platforms."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **security architecture** best practices in modernized financial platforms by integrating **cloud security** measures using Azure, reinforcing the integrity of user transactions.\nConducted **vulnerability scanning** and **penetration testing** to identify and mitigate security risks in the platforms built with **Node.js** and **Python**, resulting in a **40% reduction** in potential security threats.\nDeveloped **incident response** protocols that aligned with industry standards, improving the response time to security breaches by **30%**.\nUtilized scripting languages like **Python** for automating security checks and system audits across **Linux** servers, increasing operational efficiency while minimizing manual intervention.\nEngaged in effective **team collaboration** and **communication** with cross-functional teams to foster a culture of **security compliance** within the organization, facilitating training sessions that enhanced team awareness by **50%**.\nLed **risk management** initiatives, integrating **information security frameworks** that established a robust security posture for high-volume transactional systems.\nManaged and secured **SQL** databases to prevent unauthorized access and ensure data integrity, implementing **cryptography concepts** to protect sensitive information.\nUtilized **DevSecOps** practices, embedding security in the software development lifecycle to streamline processes while ensuring compliance and safety in API deployments."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented security architecture and cybersecurity engineering principles to enhance platform security and protect sensitive customer data across e-commerce operations.\nConducted vulnerability scanning using industry-standard tools (e.g., Nessus, Qualys) to identify and remediate security weaknesses, ensuring compliance with security standards and best practices.\nPerformed penetration testing on web applications and APIs, leading to a **30%** reduction in potential vulnerabilities and improving overall security posture.\nDeveloped and maintained security compliance protocols in alignment with GDPR and PCI-DSS regulations, ensuring robust data protection and privacy for user interactions.\nAutomated security tasks using scripting languages (such as Python and Bash), streamlining incident response and risk management processes for **quick recovery** and mitigation.\nCollaborated with cross-functional teams to integrate security into the DevSecOps pipeline, enhancing security measures throughout the software development lifecycle and reducing deployment risks by **25%**.\nManaged security monitoring using tools like Splunk and ELK Stack to ensure continuous monitoring of infrastructure and quicker incident response times for potential threats.\nConducted regular security training and awareness programs for teams, resulting in an improved security culture and **15%** decrease in security incidents due to human error.\nEvaluated and implemented new security technologies and practices to enhance overall security frameworks, with a focus on cloud security and secure coding practices.\nEngaged in continuous communication and collaboration with internal stakeholders to proactively address security risks and promote best practices in problem-solving and incident management."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\tJavaScript/TypeScript\n\tScripting languages\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tOAuth2\n\tJWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\tSQL\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS\n\tAWS: RDS\n\tAWS: S3\n\tAzure: Blob Storage\n\tAzure: SQL Database\n\n**Other:**\n\tMLflow\n\tAirflow\n\tKubeflow\n\tNginx\n\tLet’s Encrypt\n\tCertbot\n\tKeycloak (OIDC, RBAC)\n\tCybersecurity engineering\n\tSecurity architecture\n\tCloud security\n\tVulnerability scanning tools\n\tPenetration testing\n\tCryptography concepts\n\tInformation security frameworks\n\tDevSecOps\n\tIncident response\n\tSecurity compliance\n\tRisk management\n\tTeam collaboration\n\tCommunication skills\n\tProblem solving"
}