{
  "name": "Mariusz Jan Skobel",
  "role_name": "Frontend Developer (Angular)",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Frontend Developer with 10+ years of experience specializing in building high-performance web applications using **Angular**, **TypeScript**, and **RxJS**. Adept in utilizing modern web technologies including **HTML5**, **SCSS**, and implementing **Microfrontends**, **Monorepos**, and **Module Federation** to enhance application scalability and maintainability. Proven proficiency in developing Single Page Applications (SPAs) and leveraging a Backend for Frontend (BFF) strategy to optimize user experience. Experienced in using version control systems such as **Git**, along with **GitHub** and **GitLab**, for collaborative development. Knowledgeable in CI/CD pipelines for efficient deployment processes, and skilled in project management methodologies like **Kanban** and documentation tools such as **Confluence**. Possesses a solid foundation in microservices architecture and a keen understanding of software compliance standards. Committed to creating solutions that not only meet technological requirements but also drive business value.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Frontend Developer (Angular)",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and developed responsive **Angular** applications utilizing **TypeScript**, ensuring effective use of **ReactiveForms** and **RxJS** to enhance user interaction.\n• Implemented and optimized SPAs by employing **Microfrontends** architecture coupled with **Module Federation** to promote code reusability and streamline deployment processes, significantly increasing efficiency by **30%**.\n• Collaborated with cross-functional teams using **Git**, **GitHub**, and **GitLab** to establish robust **CI/CD pipelines**, enhancing deployment frequency by **25%** and reducing lead time for changes to **1 week**.\n• Developed and maintained comprehensive documentation on **Confluence**, ensuring team alignment and knowledge transfer, which improved onboarding time for new developers by **40%**.\n• Leveraged agile methodologies such as **Kanban** to manage and prioritize tasks effectively, increasing project throughput by **20%**.\n• Integrated content management system (CMS) solutions to facilitate easier content updates and management within the applications, reducing reliance on backend development for non-technical stakeholders.\n• Delivered user-friendly interfaces in compliance with industry standards, utilizing HTML5 and SCSS, leading to a **15%** boost in user satisfaction based on feedback surveys.\n• Enhanced website performance and responsiveness through systematic testing and debugging techniques across various **Angular** modules.\n• Collaborated with designers and UX researchers to refine user journeys and accessibility across applications, resulting in a more inclusive user experience."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Developed dynamic and responsive front-end applications using **Angular**, **TypeScript**, and **HTML5**, enhancing user experience and engagement for financial platforms.\n• Implemented state management with **RxJS** and **ReactiveForms** to improve form handling and asynchronous operations, increasing the performance of single-page applications (SPAs).\n• Led the adoption of **Monorepos** and **Module Federation** strategies to promote code reusability and streamline the deployment process across microfrontend projects.\n• Collaborated with cross-functional teams using **Git**, **GitHub**, and **GitLab** for version control, ensuring a smooth and efficient workflow within an agile Kanban environment.\n• Integrated CI/CD pipelines to automate testing and deployment processes, achieving a release cycle improvement of **30%** while maintaining high code quality.\n• Documented processes and workflows in **Confluence**, providing clear guidelines for the development team and facilitating on-boarding for new members.\n• Contributed to the development of a content management system (CMS) to optimize the management of financial content, aligning with user needs and business objectives.\n• Ensured cross-browser compatibility and adherence to web standards by utilizing **SCSS** for styling and modern best practices, achieving a consistent look and feel across platforms."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Develop and maintain user-friendly single-page applications (SPA) using **Angular**, **TypeScript**, and **HTML5**, ensuring high performance and responsiveness across all devices.\nCollaborate in a microfrontend architecture, implementing **Module Federation** for seamless integration and deployment across team projects, enhancing the scalability of application components.\nUtilize **RxJS** and **ReactiveForms** to manage asynchronous data processing and form handling, improving user experience through dynamic and reactive UI elements.\nAdopt a **monorepo** structure to streamline code sharing, manage dependencies effectively, and facilitate easy collaboration among multiple project teams.\nEmploy CI/CD pipelines in **GitLab** and **GitHub** for efficient version control and automated testing, ensuring high code quality and continuous integration of new features.\nLeverage **SCSS** for advanced styling and layout techniques, creating responsive, visually appealing designs in line with modern web standards.\nDocument processes and project updates using **Confluence**, ensuring team alignment and facilitating knowledge sharing among developers.\nEngage in agile methodologies like **Kanban** to manage workload and deliver features incrementally, ensuring timely project completion while maintaining flexibility to adapt to changing requirements.\nMonitor application performance and implement optimizations to enhance load times and user engagement metrics, aiming for at least **25%** improvement in speed.\nWork closely with UX/UI designers to ensure the final product is not only functional but also aligns with user expectations and accessibility standards (WCAG 2.1 compliance)."
    }
  ],
  "skills": " **Frontend Frameworks:**\n\tAngular, TypeScript, HTML5, SCSS, RxJS, ReactiveForms, Microfrontends, Module Federation, SPA, BFF\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD pipelines, Git, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tConfluence, Kanban, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, CMS"
}