{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Integration Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Integration Engineer with over 10 years of extensive experience in delivering high-performance solutions across healthcare and finance sectors. Expert in **Kubernetes**, **OpenShift**, **OpenStack**, and proficient with **TCP/IP**, **http2**, **TLS**, **IPSEC**, **DNS**, and **DIAMETER**. Skilled in troubleshooting and debugging with tools like **Wireshark**, **iPerf**, **putty**, **FileZilla**, and **MobaXterm**. Proven ability to develop and integrate complex applications, utilizing **JavaScript/TypeScript**, **Python**, and **Flutter**, and demonstrating proficiency in frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**.\n\nExperienced in implementing cloud-native applications on **Azure** and **AWS**, with a strong background in microservices architecture, event-driven systems, and CI/CD automation. Adept at ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, brings practical experience in MLOps—from developing ML pipelines and deploying models to managing workflows. Passionate about creating systems that are secure, maintainable, and drive impactful results.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Integration Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and deployed **Kubernetes**-based microservices for seamless integration and high availability in telecommunications networks, ensuring compliance with **3GPP** standards.\n• Implemented and maintained **OpenShift** and **OpenStack** environments for optimized management and orchestration of containerized applications, achieving a **30%** reduction in deployment times.\n• Managed network protocols including **TCP/IP**, **HTTP/2**, and **TLS** to enhance data security and transmission efficiency across systems.\n• Conducted debugging and performance testing using **Wireshark** and **iPerf**, ensuring high-quality network performance measurements and optimizations.\n• Established secure communication channels employing **IPSEC** and conducted rigorous **DIAMETER** protocol implementations for seamless integration with existing infrastructures.\n• Developed comprehensive test strategies for network architectures, leveraging tools such as **MobaXterm** and **putty** to ensure robust network configurations and performance.\n• Collaborated cross-functionally to identify and resolve networking issues, enhancing system integrations for better operational efficiency.\n• Managed file transfers and remote access functionalities using **FileZilla** to streamline operations and improve integration workflows across teams.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized knowledge of **EPC**, **5GC**, and **Kubernetes** to design, implement, and manage scalable network architectures that support high availability and performance in integration projects.\nLed integration efforts leveraging **OpenShift** and **OpenStack** to optimize application deployment and orchestration processes, improving efficiency by **30%** in resource utilization.\nDeveloped and maintained robust networking solutions utilizing **TCP/IP**, **http2**, **TLS**, and **IPSEC** protocols to ensure secure and efficient data transmission across various platforms and services.\nConducted extensive debugging and analysis using **Wireshark**, **iPerf**, and **MobaXterm**, successfully identifying and resolving **90%** of network-related issues within **24 hours** to enhance system reliability.\nImplemented data transfer and file management protocols utilizing **FileZilla** and **Putty**, streamlining integration processes and reducing transfer times by **50%**.\nCollaborated with cross-functional teams to integrate and optimize **DIAMETER** framework for authentication, authorization, and accounting (AAA) in telecom applications, ensuring compliance with **3GPP** standards.\nCreated network performance monitoring tools, leveraging advanced metrics and real-time analytics to support decision-making in network capacity planning, improving overall service quality and customer satisfaction.\nProvided technical guidance and training on networking concepts and tools across teams, fostering a culture of collaboration and continuous improvement in integration practices."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Kubernetes**, **OpenShift**, and **OpenStack** for orchestrating containerized applications, enabling seamless deployment and scalability of microservices in cloud environments.\nEngineered and maintained **EPC** (Evolved Packet Core) architectures, ensuring compliance with **3GPP** standards for efficient integration across network layers and interoperability.\nConfigured and troubleshot **TCP/IP**, **http2**, and **TLS** protocols to ensure secure and efficient data transmission within integrated platforms, enhancing network performance and reliability.\nPerformed real-time monitoring and analysis of network traffic using **Wireshark** and **iPerf**, identifying bottlenecks and optimizing throughput to maintain high system availability and low latency in service delivery.\nImplemented robust debugging techniques across various platforms with tools like **putty**, **FileZilla**, and **MobaXterm**, enhancing system stability and performance during integration tests.\nSuccessfully worked on integrations adhering to strict security protocols, including **IPSEC** and **DIAMETER**, ensuring secure communication within the system architecture.\nCollaborated on multi-team projects to streamline integration processes and deliver solutions for over **1000+** end-users, resulting in a **30%** reduction in integration time.\nMaintained compliance with industry standards by documenting and reviewing protocols, resulting in a **20%** increase in adherence to **GDPR** and data protection policies."
    }
  ],
  "skills": "Frameworks & Technologies:\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\thttp2, TCP/IP, IPSEC, DNS, DIAMETER\n\n**Backend Frameworks:**\n\tEPC, 5GC, Kubernetes, OpenShift, OpenStack, 3GPP, TLS\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, debugging, networking, Wireshark, iPerf, putty, FileZilla, MobaXterm",
  "apply_company": "R Systems"
}