{
  "name": "Tomasz Lee",
  "role_name": "Senior Engineering Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Engineering Engineer with 9+ years of experience in designing and implementing scalable applications. Proficient in **Angular**, **PHP**, **MySQL**, and **Symfony**, combining technical expertise with data-driven strategies to deliver high-quality solutions. Adept at working in **Agile** environments, fostering **teamwork**, and employing strong **communication** and **leadership** skills to guide development initiatives. A proven track record in driving projects to completion while ensuring optimal performance and collaboration across teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineering Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Led the development of a web-based customer management platform using **PHP** and **Angular**, boosting user satisfaction by **25%**.\n• Designed and implemented a microservices architecture to enhance scalability and maintainability, utilizing **Symfony** for effective modularization.\n• Integrated real-time data streaming solutions to improve system resilience and throughput.\n• Utilized **MySQL** for data management, optimizing queries and indexing to achieve a **20%** reduction in average query execution time.\n• Developed RESTful APIs to provide seamless data access, ensuring high performance and reliability across services.\n• Implemented CI/CD pipelines, significantly reducing deployment time by **40%**.\n• Collaborated with UX/UI designers to elevate the user interface, contributing to an enhanced user experience through effective teamwork and communication.\n• Employed data-driven strategies to guide development processes, ensuring alignment with business objectives.\n• Demonstrated leadership in Agile environments, fostering collaboration among cross-functional teams."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Angular** and **PHP** to design and develop a cloud-based project management tool, resulting in a **15%** increase in team collaboration efficiency.\nImplemented a microservices architecture for task orchestration with **RabbitMQ** and event-driven data handling using **Apache Kafka**, improving system scalability.\nLeveraged **MySQL** for data storage and retrieval, optimizing query performance for enhanced data access efficiency.\nLed efforts to maintain Agile methodologies in project development, ensuring timely project delivery through effective communication and teamwork.\nDeveloped and integrated RESTful APIs using **Symfony**, ensuring real-time data retrieval from remote databases.\nBuilt interactive components using **ReactJS** and **Tailwind CSS**, achieving a **25%** improvement in user engagement on the platform.\nReduced deployment errors by **30%** through the implementation of CI/CD pipelines utilizing **GitHub Actions**.\nCollaborated with stakeholders to define comprehensive system requirements, fostering effective communication throughout the project lifecycle.\nMentored junior developers through code reviews and training sessions, significantly enhancing team productivity.\nCreated custom data visualizations using **D3.js**, facilitating interactive project status tracking and reporting."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Angular** for the development of dynamic applications, effectively enhancing user experience and engagement.\nImplemented **MySQL** for robust data management and retrieval, optimizing query performance by **30%** in client projects.\nLed the migration of legacy systems to **Symfony**, streamlining workflows and increasing overall system efficiency by **25%**.\nDeveloped data-driven solutions that supported business strategies, resulting in a **20%** growth in project deliverables.\nFostered Agile methodologies within the team, improving project delivery timelines and ensuring adaptability to changing requirements.\nDemonstrated strong communication and leadership skills by mentoring junior engineers and facilitating team collaboration.\nParticipated actively in daily standups and sprint planning sessions, promoting teamwork and accountability among cross-functional teams.\nDelivered comprehensive technical documentation and user manuals, elevating knowledge transfer and operational efficiency.\n"
    }
  ],
  "skills": "**Frontend Frameworks**\n\tAngular, ReactJS, NextJS, VueJS, NuxtJS, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices, PHP, Symfony\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**API Technologies**\n\tRESTful API, GraphQL\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**DevOps**\n\tCI/CD pipelines\n\n**Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n**Other**\n\tUX/UI Design, Git, GitHub, Python, Redux, Data-Driven, Agile, Communication, Leadership, Teamwork, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Click&Boat"
}