{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Software Engineer with 9+ years of experience in designing and implementing solutions using **Python**, **SQL**, and **Airflow** expertise. Proficient in **ETL** processes, data modeling, and building robust **APIs** to ensure seamless integration within data warehousing systems. Strong background in Agile and Lean methodologies, enabling efficient project management and delivery. Proven track record of collaborating effectively across teams, utilizing critical thinking and active listening skills to foster communication and empathy. Original strengths include experience with **ReactJS**, **NextJS**, and **.NET**, contributing to a well-rounded skill set in both frontend and backend development.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed and optimized data pipelines using **Python** for efficient ETL processes, ensuring high data quality and integrity.\nDesigned and maintained data models and warehouses employing **SQL**, enhancing the ability to analyze data and generate meaningful insights.\nCollaborated with cross-functional teams following **Agile** methodologies to deliver high-quality software solutions on time and foster effective communication.\nExecuted data transformations using **DBT**, streamlining data integration tasks and improving reporting capabilities.\nImplemented scheduling and workflow management with **Airflow** to automate data processing tasks, increasing operational efficiency by 30%.\nBuilt and documented **APIs** to facilitate seamless data access, ensuring robust connectivity between various services and applications.\nUtilized critical thinking skills to identify and resolve complex technical challenges, improving system performance by 20%.\nAdvocated for Lean principles in the development process to enhance production efficiency and minimize waste.\nPromoted a culture of **teamwork** and **empathy**, leading to improved collaboration and project outcomes.\nEngaged in **active listening** to understand stakeholder requirements, translating them into actionable development tasks."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and developed ETL processes using **Python**, optimizing data workflows and improving data integration efficiency by **20%**.\nCreated and managed data models and warehouses, leveraging **SQL** and **DBT** for enhanced data organization and reporting capabilities.\nImplemented API integrations for data access and handling, ensuring real-time data availability and responsiveness.\nApplied Agile and Lean methodologies to accelerate project timelines, leading to a **15%** reduction in overall delivery time.\nCollaborated effectively with cross-functional teams to define and refine project requirements, ensuring alignment with business objectives and stakeholder needs.\nUtilized **Airflow** for orchestrating complex workflows, enabling automated data processing and reducing manual intervention.\nConducted comprehensive data quality checks, employing critical thinking and problem-solving skills to identify and resolve issues proactively.\nFacilitated team discussions and sprint planning sessions, promoting open communication and teamwork to achieve common goals.\nEngaged in active listening with team members, fostering a supportive environment to enhance collaboration and empathy.\nAuthored documentation and conducted user training sessions, improving end-user adoption of the developed systems."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** for data modeling and ETL processes, ensuring efficient data handling across systems.\nDeveloped robust APIs to support seamless data integration, enhancing data flows by **30%**.\nImplemented **SQL** for data retrieval and manipulation, optimizing query performance by **25%**.\nLeveraged **Airflow** for orchestrating complex workflows, improving task management efficiency.\nDesigned data warehousing solutions that facilitated better data analysis and reporting, leading to actionable insights for stakeholders.\nCollaborated in Agile environments to iterate on project requirements and deliver scalable software solutions on time.\nParticipated in daily standups, promoting effective communication and team collaboration.\nApplied Lean principles to streamline processes, resulting in a **15%** reduction in development time.\nProvided critical thinking in troubleshooting issues, leading to prompt resolutions and improved system reliability.\nCreated comprehensive documentation that enhanced team understanding and reduced onboarding time for new developers by **40%**.\nEngaged in empathy-driven conversations, actively listening to team feedback to foster a positive work environment."
    }
  ],
  "skills": " **Programming Languages** \n\t Python, JavaScript, TypeScript \n\n **Backend Frameworks** \n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices \n\n **Frontend Frameworks** \n\t HTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS \n\n **API Technologies** \n\t RESTful API, GraphQL, APIs \n\n **Serverless and Cloud Functions** \n\t AWS, Azure \n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL \n\n **DevOps** \n\t CI/CD pipelines \n\n **Cloud & Infrastructure** \n\t Airflow, DBT, Data Modeling, Data Warehousing \n\n **Other** \n\t UX/UI Design, Git, GitHub, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Lean, Agile, Communication, Teamwork, Critical Thinking, Empathy, Active Listening "
}