{
  "name": "Rei Taro",
  "role_name": "Backend Developer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-28639a395/",
  "profile_summary": "Results-driven Backend Developer with over 10 years of experience in designing and optimizing backend systems, specializing in **.NET**, **Spring Boot**, **Angular**, and **AWS**. Proficient in API Design, Data Validation, and Agile methodologies to deliver high-quality software solutions. Proven track record in creating scalable services and high-performing APIs that enhance operational efficiency. Recognized for contributions to major projects at top-tier organizations, including VISA, Sii Poland, and Reply Polska. Strong foundation in cloud-native architectures and a commitment to leveraging innovative technologies to drive business results.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **.NET** and **Spring Boot** for building robust backend services, ensuring optimal performance and maintainability in the codebase.\nImplemented API Design principles to develop clean and efficient interfaces, enhancing inter-service communication and user experience.\nEmployed **AWS** for deploying backend solutions, leveraging its services to enhance scalability and availability of applications.\nConducted data validation processes to ensure data integrity across various services, resulting in a **30%** reduction in errors in production.\nParticipated in Agile methodology to deliver enhancements and fixes, achieving **2-week** sprint cycles and improving overall team productivity by **15%**.\nCollaborated with frontend teams to integrate **Angular** frameworks, facilitating seamless communication between the backend and user interface.\nLed initiatives to improve backend architecture, ensuring systems are scalable and secure, while also addressing integration challenges across diverse platforms."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **.NET** and **Spring Boot** frameworks to develop robust backend systems, enhancing API Design for scalability and performance.\nImplemented Agile methodologies to ensure timely delivery of features and maintain a high standard of Data Validation in coding and testing processes.\nEngineered microservices architecture leveraging **Azure** and **AWS** cloud platforms, allowing for dynamic deployment and management of applications, with a focus on version **2.3.0** for improved performance metrics.\nDeveloped secure integrations for external systems, ensuring all API endpoints comply with industry standards for security and efficiency, resulting in a **25%** reduction in response times.\nAutomated and managed deployment pipelines using **Terraform**, facilitating infrastructure as code practices that supported consistent and scalable environments, achieving infrastructure deployment time efficiency of **40%**.\nCollaborated with cross-functional teams, resulting in a **90%** success rate for system integration initiatives and adherence to regulatory compliance across projects."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "- Developed robust backend services with **.NET** and **Spring Boot** for enhanced trade execution, portfolio management, and account tracking processes.\n- Designed and implemented RESTful **API Design** for seamless data interchange, ensuring optimal performance and reliability in user interactions across platforms.\n- Integrated cutting-edge cloud solutions using **AWS** for scalable deployment and data storage, enhancing system reliability and uptime to **99.9%**.\n- Collaborated with cross-functional teams in an **Agile** development environment to drive iterative improvements and fast-paced project delivery, achieving release cycles every **2 weeks**.\n- Maintained data integrity through stringent **Data Validation** practices, ensuring compliance with regulatory frameworks such as MiFID II and GDPR.\n- Optimized backend processes through job queuing and scheduling with **Celery** and **RabbitMQ**, reducing task execution times by over **30%**.\n- Created and maintained comprehensive testing frameworks utilizing **pytest**, **tox**, and mock servers, increasing test coverage to **95%** and improving CI/CD workflows."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery, .NET, Spring Boot\n\n**Frontend Frameworks**\n\tAngular\n\n**API Technologies**\n\tREST/gRPC APIs, API Design\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda)\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS, Azure\n\n**Other**\n\tData Validation, Microservices, Kafka, AI/ML Tools (Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow), Agile, PyTest, Git"
}