{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Full Stack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Full Stack Engineer with 13+ years of robust experience in building responsive applications, leveraging technologies such as **React**, **JavaScript**, **TypeScript**, **Node.js**, and **Next.js**. Adept in API design and proficient in relational databases management, ensuring high performance and security in application development. Strong background in cloud infrastructure with hands-on experience in deploying systems across platforms such as **AWS** and **Azure**.\n\nCreative and detail-oriented, with a solid understanding of design principles using tools like **Figma**, **Sketch**, and **Photoshop**. Versatile in utilizing animation libraries like **Three.js** and **GSAP** to enhance user experience. Proven track record in delivering compliance-driven solutions that align with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** and **TypeScript** to design and build responsive full-stack platforms, integrating **Node.js** for robust API design, ensuring compliance with industry standards.\nLed the development and maintenance of mobile applications leveraging **JavaScript** frameworks, facilitating secure communication and efficient user interactions.\nImplemented advanced cloud infrastructure solutions, utilizing services like AWS and Azure to enhance application scalability and security while adhering to best practices.\nManaged relational databases effectively, ensuring data integrity and performance optimization for high-traffic applications using **PostgreSQL** and **MongoDB**.\nCrafted interactive visualizations with **D3.js** and **Chart.js**, translating complex data into understandable insights, enhancing user experience across financial platforms.\nCollaborated with cross-functional teams to ensure design consistency through tools like **Figma** and **Photoshop**, enhancing project branding and user interface.\nEnsured the integration of security measures throughout the application lifecycle, safeguarding sensitive data and maintaining compliance with relevant regulations.\nDeveloped reusable components and libraries for future use, contributing to a more efficient and scalable codebase.\nConducted rigorous testing practices for all applications using **Jest** and **Cypress**, achieving a high quality of deliverables with less than **2%** bug rate post-deployment.\nDelivered features on time through Agile methodologies, participating in sprint planning and daily stand-ups to maintain alignment with team goals."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React** (18), **JavaScript**, and **TypeScript** to build engaging front-end applications, ensuring a seamless user experience for financial tools and administrative panels.\nEnhanced back-end functionalities by designing and implementing secure APIs in **Node.js** with **Express** and **NestJS**, focusing on efficiency and reliability for high-volume transactions.\nLeveraged **Next.js** for server-side rendering and improved performance of web applications, optimizing load times and user interactions.\nCollaborated with design teams using tools like **Figma** and **Photoshop** to create visually appealing interfaces that align with brand standards, achieving a **30%** increase in user engagement.\nImplemented robust cloud infrastructure to support application deployment, focusing on security standards and practices to protect sensitive financial data.\nManaged relational databases (specifically **PostgreSQL**) for transactional data integrity and performance, utilizing optimal indexing strategies to enhance query response times by **40%**.\nEnsured cross-device compatibility and performance tuning by applying best practices in responsive design and front-end optimization techniques, achieving a **95%** mobile responsiveness score.\nConducted thorough security assessments throughout the development lifecycle, resulting in the identification and mitigation of **99%** of identified vulnerabilities pre-launch."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed responsive and dynamic frontend applications using **React** (18), **TypeScript**, and **Next.js**, ensuring high-performance user experiences across both web and mobile platforms, with a focus on SEO compliance and accessibility (WCAG 2.1).\n• Engineered robust API design and backend services utilizing **Node.js** (NestJS, Express), ensuring seamless integration with frontend components and high availability across the platform's features.\n• Leveraged industry-leading tools for cloud infrastructure and deployment processes, ensuring that applications operate efficiently within scalable environments.\n• Implemented secure coding practices and robust security measures, including role-based access control (RBAC) and adherence to OAuth 2.0 standards, ensuring data protection and compliance with GDPR regulations.\n• Integrated relational databases like MongoDB and PostgreSQL, optimizing data retrieval and performance for high-traffic e-commerce applications, with an emphasis on fault tolerance.\n• Collaborated with design teams using **Figma**, **Sketch**, and **Photoshop** to create visually appealing and user-centric interfaces, enhancing overall user engagement.\n• Utilized modern animation libraries such as **GSAP** and **Three.js** to enrich the user experience with interactive and visually compelling elements.\n• Designed and implemented functionality for efficient API interactions and enhancements, significantly contributing to the overall stability and performance of the platform.\n• Applied best practices for software development, including version control and continuous integration, to maintain code quality and facilitate collaboration across teams."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, Three.js, GSAP\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n **API Technologies:**\n\tAPI design\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Relational databases\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tCloud infrastructure\n\n **Other:**\n\tFigma, Sketch, Photoshop, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, MLflow, Airflow, Kubeflow"
}