{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in developing high-performance applications, specifically skilled in **JavaScript**, **TypeScript**, **React**, and **Node.js**. Proficient in building responsive front-end solutions using **HTML5** and **CSS**, and experienced in implementing cloud-native architectures on **AWS** and **AzureDevOps**. Demonstrated ability to design and integrate APIs, fostering efficient data communication.\n\nExpert in Problem Solving and Team Collaboration, combining technical skills with a strong commitment to delivering innovative solutions. Background in developing AI/ML-powered platforms with a focus on predictive analytics and automation. Adept in compliance-driven development, ensuring alignment with standards such as HIPAA and PCI DSS. Knowledgeable in deploying serverless architectures and managing databases with **DynamoDB**. My creativity in tackling complex challenges has consistently driven successful project outcomes.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust web applications utilizing **JavaScript**, **Node.js**, **TypeScript**, and **React** (17–18), ensuring high performance and scalability.\n• Engaged in proactive problem solving by implementing backend APIs and utilizing cloud services like **AWS** and **AzureDevOps** for seamless deployments and integrations.\n• Collaborated with cross-functional teams, fostering team collaboration to accelerate project delivery and enhance efficiency in software development processes.\n• Designed intuitive user interfaces with **HTML5** and **CSS**, leveraging creativity to enhance user experience and engagement across applications.\n• Led efforts in migrating legacy systems to **serverless** architectures, resulting in 30% increased efficiency and reduction of operational costs.\n• Crafted state-of-the-art APIs for third-party integrations, adhering to best practices for **API** development, security, and documentation.\n• Employed modern development strategies and tools, achieving 95% test coverage through automated testing frameworks, ensuring reliability and performance of the applications.\n• Enhanced application responsiveness by implementing advanced front-end functionalities, contributing to a 40% boost in user engagement metrics.\n• Actively participated in code reviews and knowledge-sharing sessions to elevate team standards of coding practices and performance.\n• Championed innovative solutions that improved application performance, solving critical issues and maintaining high availability of systems to support business operations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript**, **Node.js** (NestJS/Express), and **TypeScript** to modernize core financial platforms by migrating to microservices architecture, enhancing scalability and performance for high-volume transactional systems.\nDeveloped interactive front-end applications using **React** (v18), **Vue 3**, **Next.js**, and **HTML5/CSS**, applying **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels.\nDelivered real-time analytics dashboards employing **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies.\nDesigned and deployed a robust event-driven architecture utilizing **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance.\nBuilt and developed ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing for **over 10TB** of data.\nImplemented machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns with **95%** accuracy.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, increasing efficiency by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed dynamic and responsive applications using **JavaScript**, **TypeScript**, **React** (18), **HTML5**, and **CSS**, ensuring fast user interactions and compliance with accessibility standards (WCAG 2.1).\nEngineered robust backend services with **Node.js** (NestJS, Express) for a scalable e-commerce platform, achieving **99.9%** availability and optimized performance in high-traffic situations.\nCollaborated with cross-functional teams to deliver innovative solutions, utilizing **AWS** and **DynamoDB** to enhance application reliability and decrease infrastructural overhead by **30%**.\nImplemented RESTful **API** services and integrated third-party payment platforms like **Stripe**, **PayPal**, and **Razorpay** for secure transactions, ensuring **PCI** compliance and safeguarding user data.\nOptimized application performance through problem-solving strategies, leveraging **Serverless** architecture to reduce operational costs by **25%** while maintaining efficiency.\nApplied modern CI/CD practices with **Azure DevOps**, enhancing team collaboration and accelerating deployment cycles by **50%** through automated testing and feature integrations.\nDesigned and developed customizable UI components, driving user engagement and creativity while supporting mobile-first approaches in line with business objectives.\nUtilized strong analytical skills to troubleshoot and resolve issues, fostering continuous improvement in software development processes and team dynamics.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML5, CSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js\n\n**API Technologies:**\n\tAPI\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Serverless, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, DynamoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AzureDevOps, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n**Other:**\n\tProblem Solving, Team Collaboration, Creativity, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot",
  "apply_company": "SquaredUp"
}