{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Go Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Go Engineer with 10+ years of experience delivering high-performance software solutions in healthcare and finance. Proficient in **Go**, **Node.js**, and **React**, with expertise in building robust APIs and implementing **CI/CD** practices to ensure quality software delivery. Strong skills in containerization using **Docker** and managing authentication protocols such as **OAuth2**, **SAML**, and **SSO**. Experienced in leveraging module bundling techniques and infrastructure-as-code strategies to streamline development processes. \n\nAdditionally, I possess hands-on expertise across the full stack utilizing **JavaScript/TypeScript**, **Python**, and **Flutter**, with a strong background in microservices architecture and event-driven systems. Proven track record in building and deploying cloud-native applications on Azure and AWS, while ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2.  Passionate about developing systems that are not only technically sound but also drive real-world impact, with practical experience in MLOps, including tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Go Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented robust APIs leveraging **Go** and **Node.js** to ensure seamless integration with existing systems and third-party services, enhancing functionality and scalability.\n• Developed and maintained CI/CD pipelines utilizing **Docker** and infrastructure-as-code practices, automating deployments and ensuring consistency across environments.\n• Crafted user-centric interfaces and features in **React** to deliver exceptional user experiences while adhering to best practices in performance and security.\n• Led debugging efforts to troubleshoot, diagnose, and resolve production issues, ensuring high system reliability and performance with a 99.9% uptime.\n• Produced clear and comprehensive documentation for APIs and system architecture, facilitating better communication and understanding among cross-functional teams.\n• Implemented SSO solutions using OAuth2 and SAML, improving user authentication processes and enhancing security for multiple applications.\n• Engaged in effective communication with stakeholders, translating complex technical concepts into understandable terms, driving consensus on system design choices.\n• Utilized module bundling techniques to optimize application load times, achieving up to a 40% reduction in bundle sizes for enhanced performance.\n• Integrated debugging tools to monitor application health, significantly decreasing the mean time to resolution (MTTR) for identified issues.\n• Mentored junior engineers in Go best practices, fostering a collaborative learning environment and enhancing team skill sets."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Go** to develop high-performance API services, enhancing overall efficiency and response times for financial applications.\nImplemented **Node.js** microservices to create a scalable architecture capable of handling over **10,000** transactions per second.\nLeveraged **Docker** to containerize applications, ensuring consistent deployment across multiple environments and facilitating a streamlined CI/CD process that reduced deployment time by **30%**.\nEnsured secure user authentication and authorization by integrating **OAuth2**, **SAML**, and **SSO** protocols, improving security compliance and user experience for over **5,000** users.\nConducted rigorous debugging and documentation practices, reducing incident resolution time by **25%** and enhancing team communication for smooth project collaboration.\nEmployed modern module bundling techniques to optimize the front-end experience, leading to an **improvement of 40%** in load times for user-facing applications built with **React**.\nEstablished infrastructure-as-code practices using tools that facilitated reproducible environments and configuration management for deployments across **3** cloud providers."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and maintained high-performance **Go** APIs for a large-scale e-commerce system, ensuring superior integration and interoperability with **Node.js** microservices.\n• Designed container orchestration workflows using **Docker** for seamless deployment and scaling of applications, enhancing CI/CD processes by **30%**.\n• Integrated **OAuth2** and **SAML** for robust Single Sign-On (SSO) capabilities, ensuring secure user authentication and data protection in compliance with GDPR regulations.\n• Implemented modular architecture for API development, focusing on efficient **module bundling** to streamline application deployment and maintainability across the codebase.\n• Utilized CI/CD tools to automate testing, deployment, and monitoring, achieving a **25%** reduction in deployment failures and improving overall release cycles.\n• Ensured robust logging and debugging mechanisms, effectively identifying and resolving issues to maintain application uptime exceeding **99.9%**.\n• Collaborated with cross-functional teams, clearly documenting processes and communicating improvements, leading to a **40%** increased efficiency in the development lifecycle.\n• Leveraged frontend frameworks such as React for building user-friendly interfaces, ensuring a cohesive and engaging user experience aligned with backend functionalities."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Go, Node.js\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tAPI, JWT, OAuth2, SAML, SSO\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tinfrastructure-as-code, debugging\n\n**Other:**\n\tdocumentation, communication, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, module bundling",
  "apply_company": "leading global management consulting firm"
}