{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Back-End Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Back-End Software Engineer with 13+ years of experience in delivering high-performance applications across healthcare and financial sectors. Proficient in **JavaScript**, **TypeScript**, **Node.js**, and deploying cloud-native systems on **AWS** utilizing **Lambda**, **Serverless**, **SNS**, and **SQS**. Skilled in implementing **Event-Driven Architecture** and leveraging databases like **MongoDB**. Solid experience with frameworks such as **Next.js** and **React**, as well as CI/CD practices within **Agile** and **Scrum** methodologies.\nStrong background in building AI/ML-powered platforms focused on predictive analytics, automation, and real-time processing. Expertise in compliance-driven development aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Well-versed in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**, complemented by excellent communication skills.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Back-End Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Focused on back-end development by leveraging **Node.js** and **TypeScript** to create scalable applications and integrate with **AWS** services such as **Lambda**, **SQS**, and **SNS** for event-driven architectures.\nImplemented continuous integration strategies using **GitHub Actions** and **Azure DevOps**, ensuring automated testing and deployment processes to enhance product delivery efficiency by **30%**.\nCollaborated in an **Agile**/Scrum environment to refine project requirements and deliver features on time, enhancing team communication and ensuring alignment on objectives.\nEnhanced database management by using **MongoDB** for flexible data storage solutions, optimized for performance and reliability, handling up to **500,000** records daily.\nIntegrated seamless API endpoints using **Node.js** and other back-end technologies, ensuring proper communication between front-end and back-end services in **React** and **Next.js** environments.\nParticipated in rigorous code reviews and contributed to establishing best practices for clean code and documentation, reducing bugs by **20%** during deployment phases.\nEngaged in knowledge sharing sessions to improve team's understanding of **JavaScript** frameworks and back-end architectures, fostering a culture of constant learning and growth.\nAchieved effective stakeholder communication by providing project updates and technical insights, promoting transparency and trust in development cycles."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to develop and maintain robust back-end services with **Node.js** (NestJS/Express), optimizing application performance and scalability in a **Serverless** architecture.\nEmployed **AWS** services including **Lambda**, **SNS**, and **SQS** to implement an **Event-Driven Architecture**, enabling efficient and reliable communication between microservices.\nDesigned and integrated databases with **MongoDB** for data ingestion and storage, ensuring data integrity and optimizing query performance.\nCollaborated in an **Agile** environment, participating in **Scrum** ceremonies to deliver high-quality software solutions in a timely manner.\nApplied **Continuous Integration** practices to streamline deployment pipelines, reducing code merge times by **30%**.\nBuilt interactive front-end applications with **React** and **Next.js**, enhancing the user experience for financial tools and admin panels.\nDevised automated testing scripts and performed code reviews, leading to a **25%** reduction in bugs reported post-deployment.\nCommunicated effectively with cross-functional teams to align on project specifications and address any roadblocks promptly."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **JavaScript**, **TypeScript**, and **Node.js** (NestJS, Express) to design and optimize high-performance backend services for a global e-commerce platform, achieving over **99.9%** availability and reduced latency in critical modules like checkout and order fulfillment.\nBuilt reliable and scalable serverless applications on **AWS** using **Lambda**, **SNS**, and **SQS**, effectively handling millions of transactions per day and enhancing system scalability.\nImplemented an event-driven architecture with **Kafka** and **RabbitMQ**, resulting in improved order processing times by **35%** and enabling real-time updates for customer interactions and inventory tracking.\nDeveloped robust APIs and microservices following **Agile** and **Scrum** methodologies, ensuring timely delivery of features and maintaining high code quality through **Continuous Integration** practices.\nUtilized **MongoDB** for distributed data storage solutions, achieving fast, fault-tolerant access to data with performance optimizations that handled up to **5000** concurrent users during peak traffic.\nCollaborated cross-functionally with frontend teams to integrate responsive user interfaces created with **Next.js** and **React** (version **18**), improving overall user experience and engagement metrics.\nEmployed **Event-Driven Architecture** practices to enhance system interaction, leading to a resilient and maintainable backend structure.\nMaintained strong communication with stakeholders to understand requirements, articulate technical challenges, and provide solutions, fostering a transparent development process.\nAdapted to changing project requirements with agility, delivering quality features in a dynamic environment, while mentoring junior team members to improve team productivity.\nDeveloped and implemented effective testing strategies, reducing bugs in production by over **40%**, enhancing overall system reliability and performance."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript, Python\n\n**Backend Frameworks:**\n\tNode.js, FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, Next.js\n\n**API Technologies:**\n\tAWS, Lambda, Serverless, SNS, SQS\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, S3; Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Continuous Integration, Agile, Scrum, Communication Skills, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}