{
  "name": "Tomasz Lee",
  "role_name": "Senior Angular Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Angular Engineer with over 9 years of experience in developing responsive and mobile-compatible applications. Proficient in **Angular**, **TypeScript**, and **Tailwind**, with deep expertise in UI/UX design principles and performance optimization. Demonstrates strong skills in Agile and Scrum methodologies, ensuring efficient project delivery. Proven track record in problem-solving and effective debugging, supported by comprehensive technical documentation practices. Additionally, experienced in full stack development with a robust background in **ReactJS**, **NextJS**, **.NET**, and **C#**, alongside cloud services, contributing to the creation of complex applications and enhancing team productivity.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Angular Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Designed high-performance web applications using **Angular** and **TypeScript**, ensuring responsive design and mobile compatibility for enhanced user experiences.\nImplemented and adhered to **Agile** and **Scrum** methodologies to optimize project delivery and team collaboration.\nSpearheaded the optimization of application performance, achieving a reduction in load times by **30%** through efficient coding practices and resource management.\nConducted detailed debugging processes, which improved overall application stability and reduced error rates by **15%**.\nCreated comprehensive technical documentation to assist team members and future reference, ensuring knowledge transfer and consistency across projects.\nCollaborated with UI/UX designers to develop visually appealing interfaces with **Tailwind**, leading to a **20%** increase in user satisfaction based on customer feedback.\nUtilized problem-solving skills to troubleshoot complex issues during development and maintenance phases, with a focus on quick resolution.\nEnhanced cross-browser compatibility and responsiveness of applications, ensuring consistent performance across various devices.\nEngaged in regular code reviews and performance assessments to foster a culture of continuous improvement within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed high-quality, responsive web applications using **Angular** and **TypeScript** to enhance user experience and mobile compatibility.\n• Designed and implemented UI/UX features using **Tailwind CSS**, achieving a **25%** improvement in overall user engagement.\n• Applied Agile and Scrum methodologies to streamline development processes, leading to a more efficient workflow and timely project delivery.\n• Collaborated with cross-functional teams to gather requirements and deliver performance optimizations, resulting in a **15%** increase in team collaboration efficiency.\n• Improved application performance through effective debugging strategies, reducing latency by **25%** with integrated caching solutions like Redis.\n• Produced comprehensive technical documentation to support ongoing development and maintainability of the application.\n• Actively participated in problem-solving sessions and provided mentorship to junior developers, enhancing team productivity and knowledge sharing.\n• Conducted code reviews to ensure adherence to best practices and coding standards, fostering a culture of quality within the team.\n• Engaged in UI/UX design discussions to deliver consistent and user-friendly interfaces across the application, prioritizing mobile compatibility.\n• Ensured project goals were met within scope and timeline through effective project management and stakeholder collaboration."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed high-quality user interfaces using **Angular**, **TypeScript**, and **Tailwind**, enhancing UI/UX design and mobile compatibility for better user engagement.\n• Improved application performance by **20%** through performance optimization strategies during the development phase.\n• Designed and implemented responsive designs, ensuring seamless accessibility across various devices.\n• Collaborated effectively within an **Agile** framework, participating in **Scrum** ceremonies to drive project progress.\n• Utilized debugging techniques to troubleshoot and resolve issues, ensuring robust application performance.\n• Created comprehensive technical documentation and user guides, facilitating knowledge transfer and training for internal teams.\n• Engaged in problem-solving sessions, contributing innovative solutions to complex challenges in project workflows.\n• Delivered a set of reusable components in **Angular** and **TypeScript** to accelerate future project development timelines.\n• Provided ongoing enhancements and maintained high coding standards through regular code reviews with the development team.\n• Assisted in the integration of responsive design methodologies, increasing mobile compatibility by fostering accessible user experiences."
    }
  ],
  "skills": "**Frontend Technologies**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS, Responsive Design, Mobile Compatibility\n\n**Backend Technologies**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n**Database Systems**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Testing Tools**\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\n**Blockchain**\n\tSolidity, Ether.js, Web3.js, Ethereum\n\n**Other Skills**\n\tUX/UI Design, Git, GitHub, RESTful API, GraphQL, Python, Redux, Agile, Scrum, Performance Optimization, Debugging, Technical Documentation, Problem Solving",
  "apply_company": "Gizli"
}