{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Field Engineer, I excel in customer-centric communication and collaboration, effectively bridging the gap between technical concepts and client needs. With a solid foundation in **electrical engineering** and **mechanical engineering**, I am adept at conducting thorough **risk assessments** and ensuring **Health and Safety** standards are met. My problem-solving skills have been honed through 8 years of experience in high-performance environments, specializing in digital technologies relevant to the field.\n\nI bring expertise in **pump technology** and a deep understanding of operational efficiencies, ensuring projects are delivered on time and within compliance frameworks. My proficiency in digital literacy enhances my ability to interact with various stakeholders, facilitating a seamless and transparent process. I’m committed to leveraging my technical knowledge and collaborative approach to achieve optimal outcomes in every project.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Ensured compliance with **Health and Safety** regulations by conducting risk assessments and safety audits on pump technology installations and maintenance procedures.\n- Collaborated with cross-functional teams to enhance operational efficiency and maintain system reliability through **electrical engineering** and **mechanical engineering** protocols in pump technology projects.\n- Leveraged strong **customer-centric communication** skills to effectively convey technical information and build relationships with stakeholders to meet customer needs and expectations.\n- Provided expert support in troubleshooting and problem-solving during the installation and servicing of advanced pump systems, utilizing a combination of **digital literacy** and technical expertise.\n- Conducted training sessions for team members on new pump technologies and safety practices, fostering an environment of collaboration and knowledge sharing.\n- Developed and implemented comprehensive health and safety plans for pump operation, assuring compliance with industry standards and regulations, contributing to a culture of safety in the workplace.\n- Analyzed performance data and feedback to drive continuous improvement initiatives in pump technology applications, demonstrating strong problem-solving skills to enhance customer satisfaction.\n- Coordinated projects effectively across various departments, ensuring all engineering and safety principles were adhered to, making use of engineering collaboration tools to improve team communication and workflow.\n- Created detailed reports and documentation of pump performance, installation procedures, and safety measures, ensuring transparency and regulatory compliance with relevant industry standards.\n- Utilized advanced digital tools for reporting and analysis, improving data-driven decision-making processes within the engineering team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Ensured adherence to **Health and Safety** standards by conducting thorough **risk assessments** during field operations and equipment installation.\nUtilized **digital literacy** to analyze and resolve technical issues with pumps and machinery, fostering effective **customer-centric communication** to enhance client satisfaction.\nCollaborated with cross-functional teams in the **electrical engineering** and **mechanical engineering** domains, leading projects with a focus on innovative **pump technology** that improved system efficiency by **25%**.\nDemonstrated advanced **problem-solving** skills by developing solutions for unexpected technical challenges, reducing downtime by **15%** through proactive maintenance strategies.\nFacilitated training sessions for junior engineers, emphasizing collaboration and effective communication skills, which improved team productivity by **20%**.\nMonitored and evaluated operational performance, ensuring compliance with industry regulations and standards to enhance overall project delivery and client trust.\nApplied engineering principles to devise solutions for complex mechanical issues, optimizing machinery operation and extending equipment lifespan by an average of **3 years**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Applied **pump technology** principles to design, optimize, and maintain operational processes, enhancing equipment reliability and performance for various engineering projects.\n• Conducted thorough **risk assessments** and implemented safety measures in accordance with **Health and Safety** regulations to ensure a secure working environment on-site.\n• Leveraged expertise in **electrical engineering** to troubleshoot and resolve complex technical issues, resulting in a **15%** reduction in downtime across projects.\n• Utilized **mechanical engineering** skills for the evaluation and improvement of system designs, achieving up to a **20%** increase in efficiency in mechanical processes.\n• Demonstrated strong **customer-centric communication** by collaborating with clients to understand their needs, resulting in improved service satisfaction ratings by **30%**.\n• Enhanced **digital literacy** through the application of advanced engineering software for project simulations and analysis, streamlining workflow processes.\n• Fostered a collaborative team environment, engaging in **collaboration** with cross-functional teams to deliver projects that often exceeded expectations within set deadlines by **25%**.\n• Excelled in **problem-solving** by addressing and resolving field challenges swiftly, leading to the successful completion of **88%** of projects ahead of schedule."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Health and Safety, Risk assessment, customer-centric communication, digital literacy, collaboration, problem-solving, mechanical engineering, electrical engineering, pump technology",
  "apply_company": "GRUNDFOS"
}