{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Mobile Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Mobile Engineer with 10+ years of experience in delivering high-performance and maintainable software solutions. Expert in **ReactNative** for developing cross-platform mobile applications, ensuring adherence to **SOLID** principles and code standards to create testable and maintainable code. Proven track record in **collaboration** and **product discovery** to drive successful project outcomes. Strong background in software craftsmanship, with a commitment to building secure applications that are scalable and user-centric. Skilled in modern technologies, including **JavaScript/TypeScript**, **Python**, and deployment on **cloud platforms** such as **Azure** and **AWS**. Experienced in **microservices architecture**, **CI/CD automation**, and incorporating AI/ML components into software solutions, utilizing tools like **MLflow**, **Airflow**, and **Kubeflow**. Passionate about building systems that have a meaningful impact on users and the industries served.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Mobile Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped high-quality, **cross-platform** mobile applications using **React Native** and **Flutter**, ensuring adherence to **SOLID** principles and **code standards** to deliver maintainable and testable code.\n•\tCollaborated closely with cross-functional teams to execute **product discovery** processes, resulting in user-centric designs and features that enhance user experience on both iOS and Android platforms.\n•\tImplemented rigorous testing frameworks using Jest and Cypress, ensuring robust **testable code** across all mobile developments, achieving a **95% code coverage** rate in critical modules.\n•\tAdopted best software craftsmanship practices, leading to improved code maintainability and reduction of technical debt by **30%** over a 12-month period.\n•\tDesigned and developed scalable mobile solutions that seamlessly integrate with backend APIs while ensuring a smooth and responsive user interface using **React Native 0.64** and **Flutter 2.0**.\n•\tParticipated in regular code reviews and provided constructive feedback to enhance individual and team quality standards and adherence to best practices.\n•\tUtilized Agile methodologies to manage project cycles, leading to successful on-time delivery of **3 major mobile projects** and achieving a customer satisfaction rate of **90%**.\n•\tMaintained comprehensive documentation and contributed to knowledge-sharing sessions to elevate team performance and software craftsmanship skills across the organization."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Fostered collaboration in cross-functional teams to ensure adherence to **Code Standards** and **SOLID principles**, enhancing product quality and team productivity on mobile development projects.\nEngineered dynamic, cross-platform mobile applications utilizing **React Native**, implementing **Testable Code** practices to ensure high reliability and performance for end-users.\nChampioned the application of **Maintainable Code** strategies, significantly reducing technical debt by **30%**, thus improving the overall maintainability and adaptability of mobile software solutions.\nLed product discovery sessions, engaging stakeholders to clarify requirements and translate user feedback into actionable features that align with business objectives, achieving a **25%** increase in user satisfaction.\nUtilized advanced software craftsmanship techniques to refine codebases, resulting in a **15%** improvement in code readability and maintainability across mobile applications.\nRegularly performed code reviews and provided mentorship, fostering a culture of **collaboration** and continuous improvement within the development team.\nAdapted mobile applications to integrate with existing services and APIs, ensuring seamless functionality and user experience across platforms."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Applied SOLID principles to develop maintainable and testable code for mobile applications, ensuring high-quality software craftsmanship in project deliverables.\nCollaborated with cross-functional teams to drive product discovery, gathering requirements to align technical solutions with business needs for effective product development.\nEngineered high-performance mobile applications using **ReactNative** that adhere to code standards, enabling seamless cross-platform experiences.\nDeveloped and maintained coding guidelines to ensure consistency and quality across various teams, promoting collaboration and sharing best practices in software development.\nConducted regular code reviews and implemented feedback loops to enhance code quality, ensuring all implementations meet maintainability and performance expectations.\nCreated user-centered mobile interfaces that prioritize usability and accessibility, contributing to improved user engagement and satisfaction metrics.\nIntegrated automated testing frameworks to enhance the testability of mobile applications, ensuring reliability and reducing the number of production bugs by **30%** over **12 months**.\nManaged the deployment process, utilizing CI/CD practices for efficient release cycles, achieving a reduction in deployment time by **40%**.\nFacilitated workshops on software craftsmanship principles within the team, advocating for best development practices and continuous improvement in coding standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, ReactNative\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let's Encrypt, Nginx, Certbot, SOLID, CrossPlatform, CodeStandards, TestableCode, MaintainableCode, ProductDiscovery, Collaboration, SoftwareCraftsmanship",
  "apply_company": "Huspy"
}