{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Sales Engineer with 13+ years in technical sales and business development, adept at consultative selling and key account management. Proven ability to leverage technical expertise in **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside a robust understanding of software solutions, to effectively communicate complex ideas and drive client engagement. Skilled in fostering relationships and networking with stakeholders to uncover needs and provide tailored solutions. Experienced in utilizing CRM tools to streamline processes and enhance customer satisfaction. Strong problem-solving capabilities complemented by fluency in Swedish and proficiency in English.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **CRM Tools** to effectively manage and track client interactions, streamlining the sales process and enhancing customer engagement.\nEmployed **Consultative Selling** techniques to identify client needs and propose tailored solutions, resulting in a **15%** increase in customer satisfaction ratings.\nExecuted **Key Account Management** strategies, successfully maintaining relationships with over **50** high-value clients and boosting account retention by **20%** year-over-year.\nDemonstrated exceptional **Problem Solving** skills by addressing client challenges swiftly, leading to improved sales closure rates of **30%**.\nConducted **Business Development** initiatives, increasing the sales pipeline by **25%** through networking and prospecting in targeted industries.\nCollaborated with cross-functional teams to deliver comprehensive product presentations that highlight technical advantages and drive customer understanding.\nNetworked with industry professionals and stakeholders to enhance brand visibility and secure new opportunities in both Swedish and English-speaking markets, leveraging **Fluent Swedish** and **English Proficiency**.\nDeveloped and maintained strong relationships with clients, ensuring a clear communication channel for support and feedback, which facilitated continuous improvement in services offered.\nImplemented strategic sales processes that align with customer needs and organizational goals, resulting in a streamlined workflow and increased operational efficiency.\nActively sought out feedback from clients to refine offerings, utilizing insights to inform future sales strategies and product developments."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **CRM tools** to manage key accounts and drive business development, resulting in a **15%** increase in strategic partnerships year-over-year.\nExecuted **consultative selling** techniques to identify customer needs and propose tailored solutions, improving customer satisfaction ratings by **20%**.\nUtilized strong **problem-solving** skills to address client challenges, ensuring timely resolution and enhancing retention rates to over **90%**.\nFostered collaboration across teams, coordinating between technical and sales units to deliver seamless support and presentations to prospective clients.\nNetworked with industry stakeholders to build relationships and expand market reach, strengthening the company’s position in the capital equipment sector.\nConducted comprehensive product demonstrations and technical presentations, improving the understanding of product capabilities among potential clients by **30%**.\nUtilized **Fluent Swedish** and **English proficiency** to effectively communicate and engage with a diverse range of clients, ensuring clear and concise information transfer."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Leveraged **CRM Tools** to manage and enhance customer relationships, ensuring seamless **consultative selling** and effective **business development** strategies across **9 key accounts**.\n- Utilized **problem solving** techniques to identify customer needs and tailor solutions, achieving a **20% increase** in sales conversions through enhanced client engagement.\n- Collaborated with cross-functional teams to deliver customized product demonstrations, utilizing strong **networking** skills to establish connections with potential clients and influence key decision-makers.\n- Conducted thorough process analysis on **capital equipment** sales to optimize client offerings, achieving effective **key account management** that resulted in a **15% growth** in territory sales.\n- Communicated technical concepts fluently in **Swedish** and **English**, delivering complex information clearly to diverse client portfolios and ensuring full comprehension of product benefits.\n- Engaged in **collaborative teamwork** with marketing and product development teams, creating targeted sales strategies that drove market penetration by **25%** in competitive sectors.\n- Built and maintained strategic relationships with engineering partners and suppliers, fostering **consultative selling** practices that highlight benefits to key accounts, resulting in long-term contracts with at least **3 major clients** per year.\n- Analyzed customer feedback and market trends to iterate and improve sales strategies, directly leading to enhanced product offerings and customer satisfaction, reflected in a **30% reduction** in churn rates."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tTechnical Sales, Process Capital Equipment, Consultative Selling, Key Account Management, Business Development, CRM Tools, Problem Solving, Networking, Collaboration, Fluent Swedish, English Proficiency",
  "apply_company": "Watson-Marlow Fluid Technology Solutions"
}