{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with over 13 years of experience in developing scalable services and distributed systems for the healthcare and financial sectors. Proficient in **PHP**, **Laravel**, and **Symfony**, with extensive knowledge in implementing **RESTful APIs** and utilizing **SQL** and **NoSQL** databases. Expertise in **event-driven architecture** and messaging systems, alongside strong principles of **OOP**, **SOLID**, and design patterns. Experienced in deploying applications on **AWS**, utilizing monitoring tools such as **Datadog** and **Prometheus**, and orchestrating containerized applications with **Docker**. Proven ability to create high-performance, compliant-driven solutions while aligning with standards such as HIPAA and PCI DSS. Demonstrated history of working with **microservices**, **SaaS**, and **PaaS** architectures, with a focus on real-time processing and predictive analytics.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed robust and scalable backend services leveraging **PHP** frameworks including **Laravel** and **Symfony**, ensuring adherence to **RESTful APIs** design principles for seamless integration with front-end applications and third-party services.\nEngineered distributed systems with a focus on fault tolerance and high availability, utilizing **Docker** for containerization and orchestration methodologies consistent with **microservices** architecture for easier scalability.\nDesigned and implemented event-driven architectures using messaging systems to optimize data flow and processing in real-time across platforms, ensuring efficient handling of high traffic volumes.\nEmployed **SQL** and **NoSQL** databases to construct data storage solutions that are both efficient and performant, optimizing caching strategies for improved application response times and load handling.\nApplied OOP and **SOLID principles** in the development of maintainable and extensible codebases, leveraging design patterns to solve common software design issues effectively.\nBuilt comprehensive monitoring systems using **Datadog** and **Prometheus** for tracking application performance and health, ensuring operational reliability and quick issue resolution.\nManaged cloud resources on **AWS**, implementing best practices for scalability and reliability, particularly in developing **SaaS** and **PaaS** applications tailored for telecommunications and **Traveltech** sectors.\nCollaborated on the design and implementation of **eSIM** solutions adhering to **GSMA** standards, ensuring compatibility and seamless integration with telecom systems.\nLed continuous integration and deployment efforts fortifying the pipeline processes, enhancing productivity, and deploying new features or updates consistently and with less downtime.\nEngaged in cross-functional teamwork to enhance communication and foster projects aimed at innovative telecommunications and travel solutions, delivering stakeholder value and operational excellence."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Designed and implemented **PHP** applications using **Laravel** and **Symfony**, ensuring adherence to **RESTful APIs** standards for streamlined communication across distributed systems.\n• Developed scalable services within a **microservices architecture**, utilizing **event-driven architecture** with tools like **Kafka** and **RabbitMQ** to facilitate robust messaging systems.\n• Optimized data storage and retrieval through **SQL** and **NoSQL** solutions, applying effective caching strategies to enhance performance for high-demand applications.\n• Applied **OOP** concepts and adhered to **SOLID principles** and various design patterns to maintain high code quality and improve maintainability.\n• Engaged in cloud services including **AWS**, overseeing deployment and management of applications, utilizing **Docker** for containerization of microservices.\n• Embedded monitoring and performance tracking solutions like **Datadog** and **Prometheus** to ensure system reliability and availability, achieving an uptime of **99.9%**.\n• Leveraged expertise in **SaaS** and **PaaS** for application development, ensuring the delivery of customer-centric telecommunications solutions with **eSIM** compatibility as per **GSMA** standards.\n• Contributed to cross-functional communication and collaboration within the **Traveltech** sector, ensuring effective project delivery and responsiveness to client needs."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and maintained robust **PHP** applications utilizing **Laravel** and **Symfony**, ensuring seamless integration with **RESTful APIs** designed for distributed systems and scalable services.\nEngineered and optimized messaging systems leveraging **event-driven architecture** to enhance application performance and reliability for high-traffic scenarios.\nImplemented advanced **caching strategies** using Redis to optimize data retrieval and application responsiveness, reducing latency by up to **50%**.\nDesigned and developed highly available backend services, adhering to **SOLID principles** and utilizing design patterns, ensuring maintainability and scalability across various modules.\nCollaborated with cross-functional teams to integrate **AWS** cloud services, improving system performance and reducing operational costs by **30%**.\nMonitored application performance metrics using **Datadog** and **Prometheus**, implementing necessary optimizations that resulted in a **40%** reduction in downtime.\nContributed to the development of microservices architecture that facilitated the delivery of SaaS and PaaS solutions, streamlining client onboarding processes and enhancing user experience.\nImplemented secure data handling practices by applying **role-based access control (RBAC)** and **OAuth 2.0** for user authentication and data protection.\nUtilized containerization with **Docker** to ensure consistent development and deployment environments, enhancing team productivity and speeding up release cycles by **25%**.\nEngaged in proactive communication with stakeholders in the **telecom** and **Traveltech** sectors, ensuring the effective delivery of solutions that align with business objectives."
    }
  ],
  "skills": " **Programming Languages:** \n\tPHP, Python, JavaScript/TypeScript\n\n **Backend Frameworks:** \n\tLaravel, Symfony, FastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tRESTful APIs, OAuth2, JWT\n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, Azure: App Services\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, NoSQL, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Datadog, Prometheus\n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:** \n\tdistributed systems, scalable services, event-driven architecture, messaging systems, caching strategies, OOP, SOLID principles, design patterns, microservices, SaaS, PaaS, SOA, telecom, eSIM, GSMA, Traveltech, communication",
  "apply_company": "Airalo"
}