{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior MLOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior MLOps Engineer with 13+ years of full stack development experience, specializing in **MLOps**, **Docker**, **Kubernetes**, and **CI/CD** processes. Proficient in orchestrating machine learning workflows and deploying scalable applications using **Python** and frameworks like **TensorFlow** and **PyTorch**. Deep expertise in creating cloud-native solutions on platforms such as **AWS**, **Azure**, and **Google Cloud**, with a focus on automation tools and data security practices.\n\nSkilled in leveraging advanced monitoring tools including **Prometheus** and **Grafana** to ensure system reliability and performance. Demonstrated ability to build and manage AI/ML platforms that drive predictive analytics and real-time processing. Strong problem-solving and communication skills contribute to effectively aligning solutions with compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior MLOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **MLOps** strategies to streamline model training, validation, and deployment pipelines using **MLflow**, **DVC**, and **Airflow**, ensuring robust integration across development and production environments.\nDeveloped scalable containerized applications leveraging **Docker** and **Kubernetes** (version **1.18**), fostering high availability and easy manageability of microservices for efficient deployment.\nUtilized **Python** and libraries such as **TensorFlow** and **PyTorch** for building and deploying machine learning models, including risk scoring and fraud detection algorithms integrated into production systems.\nDesigned CI/CD pipelines with **Jenkins** and **GitHub Actions**, ensuring automated testing and deployments that reduced release time by **30%** while maintaining data security standards in accordance with compliance requirements.\nLeveraged cloud services from **AWS** and **Azure** to deploy models and applications, ensuring scalable, fault-tolerant architecture that supports real-time analytics and decision-making.\nIntegrated monitoring tools such as **Prometheus** and **Grafana** to provide insights into model performance and operational health, aiming for a **99.9% uptime**.\nCollaborated with cross-functional teams to enhance communication and problem-solving efforts in tackling complex machine learning challenges, resulting in a **20%** increase in project efficiency.\nDeveloped custom automation tools to enhance the deployment and monitoring of ML models, increasing deployment frequency and reducing errors.\nMaintained data security across pipelines, with strong adherence to **data security** protocols and practices, ensuring the integrity of sensitive information.\nFostered effective communication with stakeholders for identifying and prioritizing MLOps requirements, enhancing project alignment with business goals."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented advanced **MLOps** strategies to streamline deployment and monitoring of machine learning models, ensuring robust performance and scalability in production environments.\nLeveraged **Docker** and **Kubernetes** for containerization and orchestration of applications, enhancing software deployment efficiency by up to **50%** across teams.\nUtilized CI/CD methodologies with **Jenkins** to automate testing and deployment pipelines, reducing release cycle times by **30%** and enhancing product reliability.\nAdvanced proficiency in **Python** for developing machine learning models and data pipelines, with implementations in **scikit-learn** and **XGBoost** for predictive analytics.\nEmployed **AWS**, **Azure**, and **Google Cloud** services for cloud-based solutions, optimizing resource allocation and cost-effectiveness for data processing workloads.\nDesigned monitoring and logging systems using **Prometheus** and **Grafana**, ensuring continuous inspection of model performance and system health with real-time insights.\nAutomated routine tasks and workflows using innovative **automation tools**, leading to improved productivity and reduced manual intervention by **40%**.\nExhibited strong problem-solving skills through the development of secure data handling practices, ensuring compliance with data security regulations throughout the MLOps lifecycle.\nFostered team collaboration and effective communication, leading to enhanced project outcomes and smoother operational workflows across cross-functional teams."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Docker** and **Kubernetes** to build and manage scalable microservices architectures for MLOps workflows, ensuring efficient deployment and resource management in the cloud environments of **AWS**, **Azure**, and **Google Cloud**.\nEngineered CI/CD pipelines incorporating **Jenkins** for automated testing and deployment of machine learning models, streamlining the Model Life Cycle Management from development to production.\nImplemented **monitoring tools** such as **Prometheus** and **Grafana**, providing real-time insights into application performance and model metrics, proactively identifying and resolving issues to maintain high availability and reliability.\nApplied advanced problem-solving skills to optimize data processing workflows, leveraging **Python** and **R** for data manipulation, analysis, and feature engineering, contributing to improved model accuracy and performance.\nDeveloped and maintained secure machine learning infrastructures with a strong emphasis on **data security**, ensuring compliance with GDPR and best practices for handling sensitive user data throughout the MLOps lifecycle.\nFacilitated cross-functional communication by documenting and sharing insights on model performance, deployment strategies, and operational best practices among engineering and data science teams, enhancing collaborative efforts in model development.\nAutomated training and deployment workflows using **TensorFlow** and **PyTorch**, enabling seamless integration of model training into the CI/CD pipelines, with an emphasis on MLOps best practices.\nDemonstrated strong communication skills by presenting complex technical concepts and MLOps strategies to stakeholders, creating actionable insights that drive strategic decision-making within the team.\nParticipated in troubleshooting and performance tuning of data pipelines, leveraging cloud services and tools to ensure optimal execution speed and model retraining cycles, achieving a **25%** reduction in processing time for batch predictions."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, R\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n  **API Technologies:**\n\tOAuth2, JWT\n\n  **Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\tGoogle Cloud\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, Jenkins, GitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\tMonitoring tools: Prometheus, Grafana\n\n  **Other:**\n\tMLOps, TensorFlow, PyTorch, automation tools, data security, problem-solving, communication skills"
}