{
  "name": "Tomasz Lee",
  "role_name": "Senior Support Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Proficient in technical support and implementation with a solid foundation in software development, including **Java**, **Kotlin**, and **Swift**. Bringing 9+ years of experience in application design and development, focusing on customer-centric solutions and troubleshooting effectively. Experienced in using collaboration tools such as **GitHub**, **Slack**, and **Jira** to enhance team communication and project management. Strong skills in **Zendesk** for issue tracking and resolution, alongside a commitment to improving user experience through effective technical writing and documentation. Proven ability to adapt to various technologies quickly and deliver results that align with organizational goals.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Leveraged **GitHub** and **Slack** for effective collaboration and communication within the team, ensuring accurate documentation and project progress.\nProvided exceptional technical support for both **Android** and **iOS** platforms, resolving over **90%** of issues on the first contact.\nUtilized **Zendesk** for ticket management, leading to an improved resolution time by **30%**.\nConducted technical writing to create user-friendly guides and documentation, enhancing user experience and access to technical resources.\nWorked with various programming languages including **Java**, **Kotlin**, **Swift**, **C++**, and **Objective-C**, facilitating seamless application updates and debugging processes.\nCollaborated with cross-functional teams using **Jira** to track bugs and feature requests, improving backlog management efficiency by **25%**.\nUtilized geospatial technologies to enhance support for location-based services, providing solutions that improved customer satisfaction scores by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Provided expert support for mobile applications on **Android**, **iOS**, and **Java**, enhancing the user experience through effective troubleshooting and maintenance.\n• Collaborated with cross-functional teams using **GitHub** and **Jira** to track issues, resulting in 20% faster resolution times.\n• Successfully integrated **Zendesk** to streamline customer support queries, leading to a 30% increase in customer satisfaction.\n• Conducted training sessions on technical writing for team members, improving documentation clarity and consistency by **50%**.\n• Leveraged **Slack** for real-time communication and collaboration with remote teams, optimizing response times to technical issues.\n• Developed mobile features using **Kotlin** and **Swift** for enhanced application functionality, contributing to a **25%** user growth in targeted demographics.\n• Enhanced the performance of legacy systems by refactoring code in **C++** and **Objective-C**, achieving a **15%** performance improvement.\n• Implemented best practices in geospatial data handling, improving the accuracy of location-based services by **35%**.\n• Engaged with customers to gather feedback and evaluate support processes, ensuring continuous improvement in service delivery."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Provided technical support for **Android**, **iOS**, **Java**, **Kotlin**, and **Swift** applications, resolving issues to maintain an uptime of **99.9%**.\n• Utilized **GitHub** for version control and collaboration, managing pull requests and conducting code reviews to ensure high-quality code contributions.\n• Assisted in integrating support ticketing systems like **Zendesk**, enhancing customer engagement and satisfaction by **30%** through efficient issue tracking.\n• Created and maintained comprehensive technical documentation and user guides, improving the onboarding process for new team members by **40%**.\n• Collaborated with project managers using **Jira** to ensure timely resolution of support escalations, successfully meeting project deadlines by an average of **2 weeks**.\n• Participated in daily standups and utilized **Slack** for continuous team communication, promoting a culture of transparency and quick issue resolution.\n• Leveraged **C++** and **Objective-C** programming skills to troubleshoot and enhance mobile application performance, resulting in a **15%** increase in speed and responsiveness.\n• Engaged with operation teams to address geospatial data inquiries, providing precise information to improve customer services.\n• Implemented customer feedback mechanisms to enhance the support process, achieving a customer satisfaction score of **85%** or higher."
    }
  ],
  "skills": "  **Programming Languages**\n\tJava, Kotlin, Swift, C++, Objective-C, JavaScript, TypeScript, Python, C#\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework, Microservices\n\n  **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\t\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n  **Cloud & Infrastructure**\n\t\n\n  **Other**\n\tUX/UI Design, Git, GitHub, Zendesk, Slack, Jira, Technical Writing, Geospatial, Solidity, Ether.js, Web3.js, Ethereum, Apache Kafka, RabbitMQ, Redis, NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "Mapbox"
}