{
  "name": "Tomasz Lee",
  "role_name": "Principle Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Accomplished Principal Backend Engineer with over 9 years of experience in designing and implementing robust backend systems. Proficient in **Go**, **TypeScript**, **PostgreSQL**, and **Redis**, demonstrating deep expertise in data structures and algorithms, including graph algorithms. Adept at driving development processes and optimizing performance across microservices architectures. Proven ability to lead complex projects and collaborate effectively with cross-functional teams while leveraging advanced programming languages such as **C++** and **Rust**. Committed to delivering high-quality solutions that meet business objectives.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Principle Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Go** for developing scalable backend services, enhancing system performance by **30%**.\nEmployed **TypeScript** to improve code maintainability and reduce errors, achieving a **20%** decrease in bug reports over **3** months.\nDesigned optimized database structures in **PostgreSQL**, leading to a **25%** increase in query performance.\nImplemented caching strategies using **Redis**, reducing load times by **35%** for frequently accessed data.\nDeveloped efficient algorithms and data structures in **C++** to enhance overall application performance.\nLeveraged **Rust** for system-level programming to improve execution speed and reduce memory usage.\nExecuted complex graph algorithms for data processing, resulting in better data insights and analysis.\nSpearheaded the design and development of a web-based customer management platform using **.NET 7** and **ReactJS**, improving user satisfaction by **25%**.\nIntegrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, resulting in improved system resilience and throughput.\nOptimized queries in **MSSQL**, reducing average execution time by **20%** while ensuring database integrity.\nCollaborated with UX/UI designers to enhance the platform’s user interface, leading to an even more improved user experience."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Implemented algorithms and data structures in **Go** and **C++** to optimize backend processes, improving data handling efficiency by **20%**.\nDeveloped microservices using **TypeScript** and **Redis** for caching, resulting in a **25%** reduction in response times for API calls.\nEngineered scalable data models with **PostgreSQL**, enhancing data retrieval speeds by **30%** through optimized queries and indexing strategies.\nDesigned and implemented advanced graph algorithms to support data analysis features in backend services, increasing performance in data processing tasks.\nCollaborated with cross-functional teams to define technical requirements and align on project deliverables, ensuring high-quality outcomes.\nMentored junior engineers on best practices in backend development and algorithm implementation, improving team capabilities.\nCreated technical documentation for system architecture, algorithms, and performance benchmarks to streamline onboarding of new team members.\nConducted thorough code reviews and performance assessments, enforcing high standards and achieving a **15%** reduction in bugs introduced during development.\nEvaluated and integrated new technologies and frameworks to enhance the development workflow and toolchain, maintaining up-to-date practices in backend engineering."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Go** and **TypeScript** to develop scalable backend systems, enhancing efficiency by **25%** in processing requests.\nImplemented Redis for caching strategies to optimize data retrieval times, achieving up to **70%** faster response rates.\nEngineered complex algorithms and data structures to solve critical problems, improving system reliability and performance metrics.\nDesigned graph algorithms for analyzing relationships between data points, streamlining processing for large datasets by **30%**.\nMigrated existing codebases to modern frameworks like **PostgreSQL** for robust data management, leading to improved data integrity and accessibility.\nCollaborated with cross-functional teams on architectural decisions and coding standards to ensure code quality and maintainability.\nLed performance profiling and tuning sessions, resulting in server load reductions and quicker execution times.\nProvided ongoing mentorship and guidance to junior engineers, fostering a culture of continuous learning and improvement.\nParticipated in code reviews and contributed to the development of best practices for software engineering across the teams.\nDocumented system architecture and technical designs to promote clarity and knowledge sharing within the engineering team."
    }
  ],
  "skills": " **Programming Languages**\n\t Go, TypeScript, C++, Rust, Python\n\n **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\t HTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\t RESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\t AWS, Azure\n\n **Databases**\n\t PostgreSQL, MSSQL Server, MySQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\t CI/CD pipelines\n\n **Cloud & Infrastructure**\n\t Git, GitHub\n\n **Other**\n\t Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Algorithms, Data Structures, Graph Algorithms\n"
}