{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Backend Engineer with 8 years of experience specializing in **Python**, **Django**, and cloud platforms such as **AWS** and **GCP**. Proficient in infrastructure as code tools like **Terraform**, containerization technologies including **Docker** and **Kubernetes**, and version control systems such as **Git** and **GitHub**. Adept at designing RESTful APIs and leveraging databases like **PostgreSQL** to create high-performance backend solutions. \n\nSkilled in Agile methodologies, particularly **Kanban**, I have a strong track record in building scalable microservices and event-driven systems. My expertise includes implementing CI/CD pipelines and ensuring adherence to compliance standards. I also bring valuable experience working collaboratively within cross-functional teams to deliver robust applications in fast-paced environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Django** to design and develop robust backend systems, ensuring high performance and scalability for various applications in a cloud environment.\nImplemented cloud services using **AWS** and **GCP** for effective deployment and maintenance, enhancing operational efficiency with measurable cost savings of **30%** across cloud infrastructure.\nLeveraged **PostgreSQL** as the primary database system, achieving a reduction in data retrieval times by **40%** through optimized queries and efficient indexing strategies.\nCreated and managed RESTful APIs for seamless integration with frontend applications, enhancing data accessibility and user experience across platforms.\nAdopted **Docker** and **Kubernetes** for containerization and orchestration of backend services, leading to improved deployment frequency and recovery time by **50%**.\nCollaborated closely with cross-functional teams utilizing **Agile** and **Kanban** methodologies to ensure timely delivery of high-quality software products while maintaining a focus on customer needs.\nImplemented version control practices using **Git** and **GitHub**, ensuring code quality through systematic reviews and collaboration.\nDesigned and executed infrastructure as code using **Terraform**, streamlining resource deployment and management, resulting in a more agile response to infrastructure changes.\nEmphasized best practices in software development by establishing CI/CD pipelines that integrate unit and integration tests, contributing to a **20%** increase in code stability post-deployment.\nMaintained comprehensive documentation of backend architecture and APIs, providing clarity and improving onboarding processes for new team members."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": " - Developed and maintained robust backend systems using **Python** and **Django**, enhancing system functionalities and reducing deployment times by **30%**.\n - Managed version control and collaboration through **Git** and **GitHub**, ensuring successful code management and deployment in an Agile environment.\n - Designed and implemented REST APIs to facilitate seamless data communication and integration, improving transaction processing speed by **25%**.\n - Executed infrastructure as code using **Terraform** for consistent and rapid deployment of cloud resources on platforms like **AWS** and **GCP**.\n - Implemented containerization and orchestration strategies using **Docker** and **Kubernetes** to scale applications effectively and streamline development workflows.\n - Optimized database performance and query speed with **PostgreSQL**, resulting in a **40%** improvement in data retrieval times for financial applications.\n - Collaborated in an Agile and Kanban setup to deliver software solutions rapidly and efficiently, contributing to an overall project delivery improvement of **20%**.\n - Developed user-friendly interfaces with **HTML**, **CSS**, and **JavaScript**, ensuring compliance with modern web standards and enhancing user experience."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** with **Django** to design and optimize backend services for a global e-commerce platform, achieving high availability and low latency across key modules like checkout, cart, and order fulfillment.\nEmployed **GCP** and **AWS** for cloud deployment, ensuring scalability and cost-efficiency while managing resources across **Docker** and **Kubernetes**.\nImplemented version control and collaborative workflows in **Git** and **GitHub**, effectively managing code iterations and ensuring code quality through Agile methodologies and **Kanban** practices.\nLeveraged **PostgreSQL** for robust data management, achieving a throughput enhancement of **30%** for transaction processing through optimized queries and indexing strategies.\nDeveloped RESTful APIs facilitating seamless communication between the frontend and backend components, enabling responsive applications with reduced latency.\nArchitected deployment pipelines using **Terraform** to automate infrastructure management, resulting in a **50%** reduction in deployment times and enhanced provisioning accuracy.\nLed code reviews and mentoring sessions for junior developers, fostering a culture of knowledge sharing and continuous improvement within the engineering team.\nIntegrated security best practices into all development phases, applying role-based access control (RBAC) and OAuth 2.0 to safeguard user interactions and ensuring GDPR compliance.\nDesigned frontend interaction points using **HTML**, **CSS**, and **JavaScript**, ensuring aesthetic appeal and optimal performance across devices in collaboration with UI/UX teams.\nMaintained a focus on delivering quality software through testing methodologies, enhancing overall product reliability and user satisfaction."
    }
  ],
  "skills": "****Programming Languages:****\n\tPython, JavaScript, TypeScript\n\n****Backend Frameworks:****\n\tDjango, FastAPI, Flask\n\n****Frontend Frameworks:****\n\tReact, Vue, Angular, HTML, CSS\n\n****API Technologies:****\n\tREST\n\n****Serverless and Cloud Functions:****\n\tAWS, GCP, Lambda, ECS\n\n****Databases:****\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps:****\n\tDocker, Kubernetes, Git, GitHub, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n****Cloud & Infrastructure:****\n\tAWS (RDS, S3), Azure (App Services, Blob, SQL)\n\n****Other:****\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile, Kanban",
  "apply_company": "Mozilla"
}