{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Backend Engineer with 13+ years of experience in delivering high-performance backend systems, specializing in **JavaScript**, **TypeScript**, **Postgres**, and **API** integration. Skilled in creating automation solutions and leveraging **Machine Learning** to enhance system functionalities. Proven track record of effectively collaborating with cross-functional teams to troubleshoot and resolve issues, ensuring seamless integration and efficient operations.\nDeep expertise in **RDBMS** and logical thinking to design robust database solutions, coupled with hands-on experience in developing and deploying **cloud-native applications**. Adept in documentation practices and compliance-driven development with a strong focus on quality and performance.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained backend systems using **JavaScript** and **TypeScript** for secure API integration, ensuring robust communication between services and data sources.\n- Designed efficient database schemas with **Postgres** as the primary RDBMS, optimizing queries for performance and scalability to handle **10,000+** transactions daily.\n- Collaborated cross-functionally with frontend teams to ensure seamless API integration and deliver high-quality software, utilizing strong troubleshooting and logical thinking skills.\n- Automated build and deployment processes using CI/CD tools, significantly reducing release cycles by **30%** and minimizing integration issues through effective version control practices.\n- Implemented machine learning models for predictive analysis, directly influencing business decisions and enhancing user experience by automating complex processes.\n- Maintained comprehensive documentation for APIs and integrations, contributing to improved team collaboration and onboarding success rates of **95%**.\n- Developed effective testing strategies, leading to a reduction in production bugs by **40%**, by implementing automated and manual testing processes to cover all aspects of the stack.\n- Actively engaged in troubleshooting backend issues, demonstrating strong logical thinking skills to analyze and resolve problems efficiently.\n- Fostered collaboration among development teams to optimize workflows and enhance the quality of integration processes, leading to a more cohesive project environment."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Designed and built scalable **API** integrations, ensuring seamless communication between services using **JavaScript** and **TypeScript** for efficient data handling with **Postgres** as the primary RDBMS.\n• Automated deployment processes and scripted solutions for various workflows, enhancing productivity and reducing manual effort through meticulous **automation** techniques.\n• Implemented machine learning algorithms for advanced fraud detection, showcasing expertise in **Machine Learning** and improving transaction security by analyzing patterns from **Postgres** data.\n• Collaborated with cross-functional teams to enhance documentation processes, ensuring clarity and precision in project specifications and workflows, reflecting strong **collaboration** and **troubleshooting** skills.\n• Developed and maintained robust ETL pipelines utilizing **Python** and **Apache Airflow**, successfully integrating over **50** internal and third-party data sources for efficient, large-scale data processing.\n• Spearheaded the migration of core financial systems to a microservices architecture, leveraging frameworks such as **NestJS** and **FastAPI**, which resulted in a **30%** increase in performance under high-load scenarios.\n• Created real-time analytics dashboards using **D3.js** and **Power BI Embedded**, providing critical insights from over **100,000** transactions per day to aid decision-making processes.\n• Established an event-driven architecture with **Kafka** and **Azure Service Bus**, facilitating communication across **multiple** applications and improving processing times by an estimated **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to develop and optimize robust APIs and backend services, enhancing integration and automation across diverse e-commerce functionalities.\nEngineered and maintained **Postgres**-based RDBMS solutions to handle high-volume transactions with a focus on efficiency and reliability, reducing query response times by **30%**.\nCollaborated cross-functionally to troubleshoot system issues and document API specifications, ensuring seamless integration with external services and internal applications.\nLeveraged machine learning algorithms for data analysis and automation, enhancing user experiences and operational efficiency, achieving a **25%** improvement in recommendation accuracy.\nDesigned scalable and secure backend architectures, achieving **99.9%** uptime, ensuring consistent service availability during peak transaction periods.\nApplied logical thinking to optimize data retrieval processes and system performance, implementing advanced caching techniques with Redis for frequently accessed data, leading to a **40%** reduction in database load.\nDeveloped thorough documentation to assist team collaboration and improve onboarding processes, ensuring knowledge transfer and promoting best practices.\nEngaged in continuous learning and application of new technologies and methodologies to enhance system capabilities and developer workflows."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Logical Thinking, Troubleshooting, Collaboration, Documentation, Automation, Integration, Machine Learning",
  "apply_company": "Smartness"
}