{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Experienced in **Azure DevOps** with hands-on skills in **Pipelines**, **Artifacts**, **Boards**, **Test Plans**, and **Repos**, I am a skilled Full Stack Developer with 8 years of experience shifting towards a Senior DevOps Engineer role. My technical repertoire includes security analysis tools like **Fortify**, **Snyk**, and **Venafi**, ensuring robust permission management and integration of secure software deployment practices. I am proficient in leveraging **data lake** architectures to enhance data-driven decision-making processes.\nIn my full-stack development journey, I have utilized technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter** across various high-performance solutions in the healthcare and financial sectors. My expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** complements my background in cloud environments like **Azure** and **AWS**.\nI am adept at leading enterprise-grade platforms with integrated AI/ML capabilities for predictive analytics, intelligent automation, and real-time data processing. My foundational knowledge in microservices architecture, event-driven systems, and CI/CD automation underpins my commitment to developing strong, compliant applications that meet standards including HIPAA, FHIR, PCI DSS, and SOC 2. I also possess hands-on experience in MLOps workflows using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Implemented enterprise-level CI/CD pipelines using **Azure DevOps**, ensuring seamless **software deployment** and integration of pipelines across multiple environments, with a focus on security analysis including tools such as **Fortify** and **Snyk**.\n- Managed **Azure DevOps** **Artifacts** and **Repos** to maintain versioning control and manage dependencies, ensuring high integrity and traceability of the codebase across development teams.\n- Coordinated **cross-functional collaboration** between development, QA, and operations teams to enhance deployment strategies and streamline processes, resulting in a **30% reduction** in deployment time.\n- Utilized **Azure DevOps Boards** and **Test Plans** to create task tracking, monitoring progress, and ensuring adherence to testing protocols, fostering accountability within the team.\n- Conducted comprehensive **security analysis** and **permission management** by applying automated scans and validations, which improved the security posture by **25%**.\n- Developed data lake solutions leveraging **Azure technologies**, enabling scalable storage and real-time access to structured and unstructured data across projects.\n- Implemented system monitoring and logging frameworks, creating visibility into operational performance with actionable insights, reducing incident response times by **40%**.\n- Established best practices for infrastructure as code (IaC) using **Terraform** and Bluesteel, enhancing the repeatability and reliability of deployments across development, staging, and production environments.\n- Successfully integrated tools like **Venafi** for certificate management, ensuring robust security measures are in place for web applications and services.\n- Mentored junior engineers on **Azure DevOps** best practices, improving team efficiency and fostering skill development in the use of **Pipelines** and **Boards**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Ensured seamless software deployment through the effective use of **Azure DevOps**, including **Pipelines**, **Repos**, and **Artifacts**, streamlining processes and achieving a **30%** reduction in deployment times.\nCollaborated cross-functionally with development and operations teams to optimize workflows and performance, enhancing communication and project tracking via **Azure Boards** and **Test Plans**.\nIntegrated **Fortify** and **Snyk** for security analysis and vulnerability assessments, resulting in a **25%** decrease in security incidents.\nEstablished a secure and efficient **data lake** architecture for data storage and access, improving data retrieval speeds by **40%** for analytics and application performance.\nImplemented robust permission management protocols to ensure compliance and safeguard sensitive information across the financial platforms.\nAutomated integration processes to enable continuous delivery and deployment, utilizing best practices that increased deployment frequency by **50%**.\nConducted thorough security audits and optimizations using **Venafi** to enhance certificate management and encryption practices in the deployment pipelines."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented **Azure DevOps** for streamlined software deployment and integration across development pipelines.\nManaged **Pipelines** and **Artifacts** in **Azure DevOps** to ensure efficient continuous integration and delivery processes, achieving a deployment frequency increase by **30%**.\nFacilitated **Boards** for effective cross-functional collaboration among development, QA, and operations teams, enhancing project visibility and tracking by **25%**.\nExecuted comprehensive **Test Plans** that improved software quality and security analysis through tools like **Fortify** and **Snyk**, leading to a **40%** reduction in vulnerabilities detected during production.\nOversaw **Repos** for version control, ensuring code integrity and collaborative software development practices.\nImplemented robust **permission management** strategies, including role-based access control (RBAC) to secure sensitive operations and compliance with GDPR standards.\nEstablished a **data lake** architecture to support advanced analytics and reporting, improving data retrieval times by **50%**.\nCollaborated with security teams to integrate **Venafi** for certificate management, enhancing overall security posture and simplifying automation of certificate renewals.\nPerformed security analysis and threat modeling to detect potential vulnerabilities in deployment pipelines, ensuring robust enterprise-level security across all platforms."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript  \n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django  \n\n **Frontend Frameworks:**\n\tReact, Vue, Angular  \n\n **API Technologies:**\n\tJWT, OAuth2  \n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)  \n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis  \n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Azure DevOps, Pipelines, Artifacts, Boards, Test Plans, Repos, security analysis  \n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)  \n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Fortify, Snyk, Venafi, data lake, cross-functional collaboration, software deployment, integration, permission management",
  "apply_company": "Globant"
}