{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Front-End Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Front-End Engineer with 13+ years of experience in delivering high-performance applications in the healthcare and financial sectors. Excels in **React**, **TypeScript**, **JavaScript**, **HTML**, **CSS**, and frameworks like **Nx monorepo** and **React Query**, with a strong emphasis on **Tailwind** and **SCSS** for modern user interface design. Demonstrated ability in performance optimization and user experience design, ensuring applications are both efficient and engaging. \nProficient in testing frameworks such as **Cypress**, **Jest**, and component libraries like **Storybook**, facilitating high-quality code and robust user interactions. Experienced in Agile methodologies, fostering collaboration and effective communication within cross-functional teams. Additionally, holds hands-on expertise in backend development with **Node.js** and in building AI/ML-powered platforms, augmenting capabilities in automated processes and real-time data handling.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Front-End Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React** (17–18), **TypeScript**, **JavaScript**, **HTML**, and **CSS** to develop responsive front-end solutions that enhance user experience and performance optimization.\nImplemented state management and data fetching strategies with **React Query** to ensure efficient data retrieval and management in web applications.\nDesigned and built user interfaces using **Nx monorepo**, **Tailwind**, and **SCSS**, ensuring a streamlined development workflow and consistent styling across projects.\nCollaborated in an Agile environment with cross-functional teams, fostering effective communication to deliver features and optimize user interface functionality.\nExecuted comprehensive testing strategies utilizing **Cypress**, **Jest**, and **Storybook**, ensuring robustness through unit, integration, and end-to-end tests that met quality assurance standards.\nLed performance optimization initiatives resulting in improved load times by **30%**, enhancing overall user satisfaction across web applications.\nWorked closely with UX/UI designers to iterate on user experience design, improving accessibility and mobile responsiveness across all platforms.\nConducted code reviews and mentored junior developers, cultivating a collaborative team culture while ensuring adherence to best practices in front-end development.\nMaintained high standards of code quality and organization by implementing component libraries and style guides using **React** components.\nEnhanced user interfaces with intelligent features, ensuring seamless integration of back-end functionalities into responsive designs."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)** with **TypeScript** to build and optimize interactive front-end applications, enhancing user experience and responsiveness in financial tools and admin panels.\nImplemented **Nx monorepo** structure for efficient project management, promoting high collaboration and streamlined development processes across teams and components.\nConducted performance optimization techniques to improve application load times by over **30%**, delivering an enhanced user experience.\nDeveloped and maintained UI components using **SCSS** and **Tailwind CSS**, ensuring consistent design and adherence to best practices in user experience design.\nTested applications using **Cypress** and **Jest**, achieving a code coverage rate of **95%** to ensure reliability and quality of the user interface.\nCollaborated closely with back-end teams to integrate APIs using **React Query**, improving data-fetching strategies and reducing loading times.\nParticipated in Agile methodologies, contributing to sprint planning and retrospectives, ensuring efficient communication and collaboration within the team.\nCreated design documentation and style guides using **Storybook**, facilitating better design communication and component reuse across projects."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Designed and optimized engaging user interfaces for e-commerce platforms using **React (18)**, **TypeScript**, and **JavaScript**, ensuring high performance and an exceptional user experience.\nLeveraged **Tailwind CSS** and **SCSS** to create responsive and accessible web layouts compliant with WCAG 2.1 guidelines, enhancing usability across diverse devices.\nImplemented **React Query** for efficient server state management, improving data fetching strategies and reducing overall load times by up to **30%**.\nConducted thorough performance optimization through profiling and implementing best practices, leading to a **20%** reduction in rendering times and improved user satisfaction.\nEmployed modern testing frameworks such as **Cypress**, **Jest**, and **Storybook** for robust unit and integration testing, achieving a **90%** code coverage milestone and enhancing overall code quality.\nUtilized **Nx monorepo** for improved project structure and collaboration efficiency, allowing for faster development cycles across multiple teams.\nWorked in an Agile environment, participating in sprint planning and retrospectives to ensure continuous delivery and effective communication among cross-functional teams.\nCollaborated closely with UX/UI designers to align on project goals, ensuring a seamless transition from design to production and facilitating feedback loops.\nEngaged in mentoring junior developers, enhancing team collaboration and fostering a culture of learning and innovation.\n"
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, TypeScript, JavaScript, HTML, CSS, Tailwind, SCSS, React Query, Nx monorepo, Cypress, Jest, Storybook\n\n**Backend Frameworks:**\n\tPython: FastAPI, Flask, Django\n\n**API Technologies:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3; Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Agile, Performance optimization, User experience design, Collaboration, Communication"
}