{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Power Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Power Engineer with extensive expertise in No-Code and Low-Code development platforms, I leverage **PowerApps** to deliver streamlined solutions that enhance user experience and optimize database integration. My strong skills in SQL and JSON enable me to effectively manage and analyze complex data sets, ensuring seamless integration with existing systems. Additionally, I excel in technical communication, allowing me to translate technical concepts into clear strategies for stakeholders.\n\nI bring 8 years of full-stack development experience, specializing in high-performance solutions for the healthcare and financial sectors. Proficient in modern technologies, I develop robust applications using **JavaScript**, **TypeScript**, **Python**, and **Flutter** within frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My deep cloud experience with **Azure** and **AWS** further strengthens my ability to create secure applications while adhering to compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2.\n\nI have also led the development of enterprise-grade platforms incorporating AI/ML capabilities for predictive analytics and intelligent automation, using tools like **MLflow**, **Airflow**, and **Kubeflow**. My background in microservices architecture and event-driven systems ensures the delivery of high-quality software solutions tailored to meet industry demands.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Power Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and implemented **PowerApps** solutions leveraging **No-Code** and **Low-Code** development frameworks to enhance user experience and streamline processes within healthcare and financial sectors.\n- Integrated various **SQL** databases, ensuring efficient **Database Integration** for data management and reporting, contributing to optimized system performance for user applications.\n- Collaborated with cross-functional teams to enhance **User Experience** by incorporating feedback in application design, ensuring intuitive interfaces for end-users in both automotive and financial environments.\n- Provided **Technical Communication** to partners and stakeholders, discussing project progress and technical specifications to align goals and expectations on deliverables.\n- Successfully managed and orchestrated the delivery of scalable applications, ensuring compliance with necessary industry standards and operational efficiency.\n- Conducted rigorous testing and quality assurance processes to ensure application stability and user satisfaction, utilizing industry-best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-focused applications using **PowerApps**, enhancing user experience through **No-Code** and **Low-Code** solutions for improved efficiency in financial operations and reporting.\n• Leveraged **SQL** and **Database Integration** techniques to optimize data management and retrieval processes, directly supporting analytics and user interactions with transaction data.\n• Designed innovative user interfaces, enhancing user experience and engagement across various platforms, ensuring systems are intuitive and accessible.\n• Facilitated technical communication across cross-functional teams to align project goals, ensuring seamless integration of **JSON** data in financial applications.\n• Led the modernization of financial platforms by adopting a microservices-based architecture using Node.js (NestJS/Express) and Python (FastAPI, Django), boosting scalability, maintainability, and throughput for high-volume transaction systems.\n• Developed real-time transaction monitoring and analytics dashboards using React, D3.js, and Power BI Embedded, enabling operations teams to track financial activity, detect anomalies, and generate actionable insights.\n• Integrated Kafka, RabbitMQ, and Azure Service Bus to establish a robust event-driven architecture, supporting asynchronous communication and real-time event processing for transactions, alerts, and compliance workflows.\n• Built and orchestrated ETL pipelines using Python, Apache Airflow, and Azure Data Factory, enabling batch and real-time ingestion of financial data from internal and third-party sources.\n• Implemented AI/ML-powered fraud detection systems using scikit-learn, XGBoost, and Azure Machine Learning, analyzing transaction patterns and user behavior to proactively flag suspicious activities in banking systems."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized no-code and low-code solutions within **PowerApps**, leveraging user experience principles to enhance application interfaces and workflows for a seamless automotive platform.\nDeveloped database integration strategies using **SQL** to effectively manage data storage and retrieval processes, ensuring high performance in user interactions and compliance with data regulations.\nCommunicated technical concepts effectively to stakeholders, simplifying complex functionalities into easily understandable language, promoting collaboration and informed decision-making.\nUtilized **JSON** for data exchange and manipulation across services, ensuring quick data retrieval and modification in real-time scenarios.\nEngineered responsive user interfaces built around user experience best practices, enhancing overall functionality and satisfaction for automotive applications.\nConducted performance tuning of existing applications to improve responsiveness and reliability, achieving up to **30%** enhancements in load times and user engagement.\nImplemented features that allow for integration across various automotive systems, supporting seamless interoperability and scalability for future enhancements, directly enhancing user experience.\nCollaborated with cross-functional teams to refine technical communications and documentation, ensuring consistent understanding of project goals and objectives across diverse groups, contributing to an efficient development lifecycle."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript, SQL\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJSON\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tPowerApps, No-Code, Low-Code, Database Integration, Automotive, User Experience, Technical Communication, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Jobs via eFinancialCareers"
}