{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Backend Engineer with over 10 years of expertise in delivering robust backend solutions, specializing in **Python**, **Django**, and **SQL**. Proficient in leveraging cloud services such as **AWS** for scalable application architecture, with experience in monitoring and performance tools including **CloudWatch**, **Datadog**, and **Grafana**. Demonstrates strong capabilities in implementing **ORM** for efficient database interactions, alongside a solid understanding of **Celery** for task management and asynchronous workflows. Committed to enhancing code quality through adherence to best practices, utilizing testing frameworks, and engaging in pair programming for effective collaboration and technical mentorship.\n\nPossesses comprehensive experience in building enterprise-level applications that prioritize performance monitoring and testing, ensuring systems maintain high compliance and reliability standards. A passionate advocate for developing technically sound solutions that deliver measurable value, underpinned by a strong foundation in cloud-native architecture and best development practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained robust backend solutions using **Python** and **Django**, ensuring high performance and code quality, while following best practices in coding and architecture.\n• Integrated **AWS** services such as **CloudWatch** for monitoring application performance and implementing efficient logging strategies with **Datadog** and **Grafana** to enhance system observability across environments.\n• Utilized **SQL** databases and **ORM** frameworks to optimize data storage and retrieval, improving query performance by up to **30%** for large-scale applications.\n• Spearheaded implementation of efficient **Celery** task queues for asynchronous processing, reducing computation times for background tasks by **50%**.\n• Executed thorough testing strategies using various **testing frameworks**, ensuring a code coverage of at least **90%** across backend services to maintain high stability and reliability.\n• Mentored junior developers through pair programming and code reviews, facilitating knowledge sharing and enhancing team skills in line with company standards and practices.\n• Actively participated in the architectural design discussions, advocating for scalability and maintainability in backend systems, leveraging design patterns and cloud principles effectively.\n• Drove initiatives to continuously improve the performance monitoring and alerting systems, aiding in rapid identification and resolution of issues, significantly reducing mean time to recovery (MTTR)."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Django** to enhance backend development processes, implementing best practices in code quality, performance monitoring, and testing frameworks, resulting in a **30%** reduction in bugs and improved deployment speeds.\nLeveraged **SQL** and **ORM** for efficient database interactions, optimizing query performance, which increased data retrieval speeds by **40%** for high-volume transactional systems.\nEmployed **AWS** services, including **CloudWatch** and **Datadog**, for comprehensive monitoring and logging of system performance, leading to a **25%** improvement in incident response times.\nFacilitated **pair programming** sessions, promoting collaboration and technical mentorship within the team to elevate overall skill level and code quality.\nEnsured adherence to best practices across all software development phases, driving a culture of continuous improvement and knowledge sharing among team members.\nChampioned performance monitoring initiatives using **Grafana**, enabling proactive identification of bottlenecks in production environments, which enhanced system efficiency.\nContributed to the implementation of unit and integration tests to improve code reliability, achieving a **95%** test coverage across the project lifecycle."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed and optimized backend services utilizing **Python** (specifically **Django**), ensuring adherence to best practices and high performance across all codebases by implementing rigorous **testing frameworks** and maintaining code quality.\nUtilized **AWS** for scalable backend infrastructure, employing **CloudWatch** for performance monitoring and ensuring system reliability and availability through proactive resource management and alerts.\nCollaborated through **pair programming** and provided **technical mentorship** to junior developers, fostering a strong understanding of **SQL**, **ORM**, and backend development best practices, resulting in a **20%** increase in team productivity.\nImplemented **Celery** for task scheduling and background processing, enabling asynchronous workflows that improved the overall system response time by **30%**.\nLeveraged **Grafana** and **Datadog** for monitoring and visualizing system performance, ensuring optimal application health and identifying bottlenecks during high traffic periods.\nDesigned robust database schemas using **SQL**, focusing on efficient data access methods which resulted in a **25%** improvement in query performance.\nParticipated in code reviews to enforce development standards and best practices, improving overall code maintainability and reducing technical debt by **15%**.\nEngaged in regular performance optimization efforts, identifying and resolving performance issues effectively, using data-driven approaches to enhance application responsiveness.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tDjango\n\n**API Technologies:**\n\tSQL\n\n**Serverless and Cloud Functions:**\n\tAWS\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAzure (App Services, Blob)\n\n**Other:**\n\tFrameworks & Technologies:\n\t\tJavaScript/TypeScript (React, Vue, Angular)\n\tArtificial Intelligence & Machine Learning:\n\t\tMLflow, Airflow, Kubeflow\n\tAuthentication & Security:\n\t\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\tCI/CD & Infrastructure as Code:\n\t\tTerraform, Ansible, Helm, Docker Compose\n\tCloudWatch, Datadog, Grafana, Celery, testing frameworks, performance monitoring, code quality, pair programming, technical mentorship, best practices",
  "apply_company": "TeleClinic"
}