{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Lead Android Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Lead Android Engineer with over 8 years of experience in high-performance mobile application development, specializing in **Android**, **Kotlin**, and **Java**. Proficient in Agile methodologies and adept at designing and implementing **RESTful APIs**, alongside extensive experience with **third-party integrations**. I have a solid understanding of architectural patterns including **MVC**, **MVVM**, and **MVP**, ensuring adherence to coding standards and best practices. \n\nIn addition to my technical expertise, I possess strong technical leadership skills, having successfully led teams to deliver robust applications under tight deadlines. My background includes building solutions for healthcare and financial sectors, integrating industry-standard compliance protocols. Leveraging my experience in various frameworks and tools, I aim to drive innovation and enhance performance within teams and projects.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Lead Android Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Led the development of scalable Android applications using **Java** and **Kotlin**, adhering to coding standards and best practices within an **Agile** environment.\nDesigned and implemented **RESTful APIs** for seamless integration with third-party services, ensuring robust communication and data exchange between mobile applications and backend systems.\nExecuted the transformation and architecture of mobile applications using the **MVVM** pattern, improving code maintainability and testability by **30%**.\nFostered technical leadership by mentoring team members in **Android** development methodologies and best practices, enhancing team productivity by **25%**.\nConducted regular code reviews and established a standard for **Android** code quality, driving adherence to **Coding standards** and improving overall application performance by **15%**.\nManaged cross-platform project requirements, ensuring effective communication between mobile development teams and stakeholders for timely delivery of project milestones.\nFacilitated collaborative discussions to enhance agile practices within the team, leading to improved sprint planning and iteration cycles, resulting in a **20%** reduction in delivery timelines for new app features.\nImplemented best practices for third-party integrations, optimizing application performance and reliability through thorough testing and validation methods.\nUtilized architectural patterns such as **MVC**, **MVP**, and **MVVM** to guide project development to align with business needs and user experiences, resulting in user satisfaction scores rising to **90%**.\nEngaged in continuous learning and application of the latest trends in **Android** development, adapting quickly to emerging technologies and methodologies to keep projects at the forefront of the market."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Spearheaded the development of **Android** applications utilizing **Java** and **Kotlin**, maintaining high coding standards and ensuring adherence to Agile methodologies across ***8+*** projects.\n• Delivered robust **RESTful APIs** for seamless third-party integrations, enhancing application capabilities and improving user satisfaction by ***25%***.\n• Led a team of developers, providing technical leadership and guidance in implementing **MVC**, **MVVM**, and **MVP** design patterns, improving code maintainability and team efficiency by ***30%***.\n• Conducted code reviews and established coding standards, fostering a high-performance engineering culture and reducing bugs in production by ***15%***.\n• Collaborated with cross-functional teams to define project requirements and deliver solutions that align with business goals, ensuring timely project delivery and successful product launches.\n• Mentored junior developers, facilitating knowledge sharing and professional growth within the team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Led the design and development of **RESTful APIs** for Android applications, ensuring adherence to coding standards and robust integration with third-party services, utilizing **Kotlin** and **Java** to build reliable mobile solutions.\nImplemented **Agile** methodologies to streamline the development process, fostering collaboration and enhancing team productivity, leading to a 25% reduction in time to market for new features.\nPioneered the use of **MVC**, **MVVM**, and **MVP** architectures in Android projects, promoting code reusability and maintainability, resulting in a 30% decrease in code complexity across applications.\nProvided technical leadership in the team, mentoring 5 junior developers, ensuring that they adhered to best practices and improved code quality through regular code reviews.\nDeveloped and maintained high-performance Android applications, achieving a 99.9% uptime and facilitating a seamless user experience across **Android 10** and higher.\nCollaborated on integrating various third-party tools and libraries to enhance application functionality, which led to an increase in user engagement by 40% within the first quarter of implementation.\nEnsured modular design principles were applied, allowing easy addition of future enhancements while optimizing performance metrics, which saw an average load time reduction of 50%.\nExecuted feature delivery with high efficiency through **Agile** sprints, achieving an average sprint velocity of 30 story points.\nMaintained up-to-date knowledge of industry trends and emerging technologies in command-line tools and libraries, ensuring the team stayed innovative and competitive."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Java, Kotlin, \n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, \n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, \n\n**API Technologies:**\n\tRESTful APIs, \n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, \n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, \n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, \n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Terraform, Ansible, Helm, Docker Compose, \n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile, Third-party integrations, MVC, MVVM, MVP, Coding standards, Technical leadership"
}