{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Backend Engineer with 8 years of extensive experience, I excel in developing high-performance backend solutions using **Java**, **Kotlin**, and **Springboot**. My proficiency encompasses building and maintaining robust applications with **Postgres** and implementing CI/CD pipelines using tools like **CircleCI** and **Spinnaker**.  My background includes full-stack development with frameworks such as **React**, ensuring a seamless integration between front-end and back-end systems.\nIn addition to my technical skills, I bring a keen understanding of cloud services, having worked with platforms like Azure and AWS, and I have a proven track record in architecting microservices and event-driven systems. My focus on compliance and best practices is demonstrated by my experience aligning with standards such as HIPAA and SOC 2. Furthermore, I possess experience in machine learning pipelines, enhancing applications with AI capabilities, ensuring they are scalable and adaptable.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust backend services using **Java** and **Kotlin** in conjunction with **Springboot**, ensuring efficient data processing and compliance with industry standards.\n- Leveraged **Postgres** for database management, optimizing data storage, retrieval, and transactions in high-load environments.\n- Implemented CI/CD pipelines with **CircleCI** and **Spinnaker**, facilitating automated testing, deployment, and rollbacks for seamless integration of new features.\n- Collaborated on the integration of **React** front-end applications with backend services, enhancing user experience and application performance through API services.\n- Led initiatives for microservices architecture, improving system resilience and scalability, enabling the development of loosely coupled services.\n- Designed and executed comprehensive test strategies encompassing unit testing and integration testing with frameworks like Jest and Cypress.\n- Developed solutions that demonstrate measurable improvements in service uptime and response time, achieving up to **99.9%** availability in production environments.\n- Managed and optimized legacy Ruby on Rails applications, ensuring a smooth transition to more modern technology stacks without sacrificing operational continuity.\n- Mentored junior engineers, fostering a culture of knowledge sharing and continuous improvement through code reviews and collaborative problem-solving.\n- Performed performance tuning and monitoring of backend systems, reducing latency by approximately **30%** through efficient database queries and optimized code execution."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Kotlin** to design and implement scalable backend services within a **Spring Boot** framework, enhancing system reliability and boosting throughput.\nContributed to the development and maintenance of RESTful APIs, ensuring seamless communication between the frontend built with **React** and the backend systems.\nOptimized data storage solutions by implementing **Postgres** databases, achieving a 30% reduction in query response times through efficient indexing and data modeling strategies.\nImplemented CI/CD pipelines using **CircleCI** for automated testing and deployment, increasing release frequency by 40% and minimizing downtime.\nDeveloped microservices integrated with **Ruby on Rails**, ensuring high availability and scalability to support growing user demands.\nCollaborated with cross-functional teams to define technical requirements and improve system architecture, using tools like **Spinnaker** for continuous delivery and deployment.\nEnsured code quality and standards through rigorous code reviews and mentoring junior developers, resulting in a 25% increase in codebase maintainability.\nEngaged in performance tuning and optimization of Java applications, leading to a 20% improvement in response times for high-traffic services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Java**, **Kotlin**, and **Spring Boot** to design and optimize backend services, ensuring high availability and scalability for a robust e-commerce platform.\nDeveloped and managed data storage solutions using **Postgres** for efficient, fault-tolerant database interactions, ensuring fast access and handling for critical workflows.\nImplemented CI/CD pipelines with **CircleCI** and **Spinnaker** to streamline deployment processes and enhance code quality, achieving smoother updates and reduced downtime.\nBuilt interactive user interfaces leveraging **React** to enhance user experience, focusing on responsive design and performance across various devices.\nStreamlined feature development and deployment using A/B testing strategies, significantly reducing errors and improving overall feature rollout efficiency.\nArchitected secure payment gateways incorporating third-party services for safe transaction processing, ensuring compliance with industry standards.\nConducted rigorous performance testing and optimizations, achieving a notable improvement in response time by **30%**, thereby boosting user engagement.\nCollaborated in cross-functional teams to align product objectives, ensuring swift delivery of complex backend features within **2-week** sprints.\nMaintained comprehensive documentation and conducted code reviews, promoting best practices and knowledge sharing within the team."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, Kotlin, JavaScript, TypeScript, Ruby\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Springboot, Ruby on Rails\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak, JWT, OAuth2, Let’s Encrypt\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CircleCI, Spinnaker\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL), Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Certbot",
  "apply_company": "AlphaSights"
}