{
  "name": "Damian Franciszek Pospiech",
  "role_name": "System Level Go Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "System Level Developer with 13+ years of expertise in **Go**, proficient in **system-level programming**, **containers**, and **network configuration**. Skilled in deploying and managing projects on **Ubuntu** and **Kubernetes**, with a solid understanding of **DevOps** practices and **version control systems**. I have hands-on experience with **VMware** for virtualization and extensive knowledge of managing **storage devices**. My background includes optimizing application performance and scalability using system thinking principles.\n\nAdditionally, I bring a strong skill set in **JavaScript/TypeScript**, **Python**, and **Flutter** for complete application development. I have a proven track record in creating high-performance applications tailored for the healthcare and financial industries, with a focus on quality and compliance. My expertise extends to building AI/ML-powered platforms and cloud-native systems on **AWS** and **Azure**, along with implementing microservices and CI/CD pipelines.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "System Level Go Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Go** for system-level programming, creating optimized applications that interact with various **containers** and **network configurations** to enhance performance and reliability.\nImplemented **Kubernetes** for container orchestration, ensuring effective scaling and deployment of services in a **DevOps** environment across multiple cloud providers.\nEngaged in **Ubuntu** system administration, configuring and managing **storage devices** and network services to support development and deployment workflows.\nLed the integration of **version control systems** to streamline code management, enhancing collaboration across teams and improving overall project delivery timelines by **25%**.\nDeveloped and maintained secure, efficient applications in **C**, focusing on low-level system functionalities to meet specific performance and memory usage benchmarks.\nDesigned and deployed network configuration solutions, optimizing data flow and resource allocation, leading to a **40%** reduction in latency.\nEstablished processes for monitoring and maintaining system health by leveraging **containers** for operational consistency and efficiency.\nCollaborated with cross-functional teams to apply **system thinking**, ensuring comprehensive solutions that address performance, security, and scalability requirements.\nImplemented robust CI/CD pipelines to automate testing and deployment, reducing manual intervention in the software delivery lifecycle by **50%**.\nConducted system performance analysis and tuning, successfully achieving a **30%** improvement in application response times through effective resource management."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented system-level programming in **Go** to optimize performance for financial applications, emphasizing efficient memory management and concurrency.\nUtilized **containers** with **Docker** to streamline deployment processes, enabling consistency across development and production environments by reducing environment-related issues by **75%**.\nConfigured and managed **Kubernetes** clusters to orchestrate containerized applications, enhancing scalability and availability for system-level services.\nDeveloped and maintained scripts for network configuration and management on **Ubuntu**, ensuring seamless connectivity across distributed systems and achieving a **99.9%** uptime.\nApplied **version control systems** such as **Git** to track code changes and collaborate with cross-functional teams, maintaining a linear history and enabling efficient feature branching.\nDesigned storage solutions leveraging storage devices and virtualization techniques using **VMware** to optimize data access and resilience, creating a backup solution with **30%** faster retrieval times.\nConducted regular performance tuning and system analysis by leveraging system thinking principles, facilitating a significant reduction in latency and improving transaction processing speed by **40%**.\nEngaged in DevOps practices to automate deployment and monitoring activities, reducing deployment time from hours to minutes and minimizing errors associated with manual processes."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed system-level software using **Go** for high-performance applications, ensuring efficient memory management and low-latency processing.\n• Executed network configuration and containerization strategies using **Kubernetes** and **Docker**, enabling seamless deployment and maintenance of microservices.\n• Implemented storage device integrations for optimal data handling, utilizing **Ubuntu** as a robust operating system for system-level programming tasks.\n• Managed **version control systems** like Git to streamline collaboration and code versioning, maintaining an organized codebase and facilitating continuous integration.\n• Leveraged **VMware** for virtualized environments to test and deploy system-level applications, enhancing scaling capabilities and system resilience.\n• Championed a DevOps culture, incorporating practices that enabled efficient systems thinking and iterative improvements throughout the development lifecycle.\n• Conducted in-depth network configuration to optimize communication between services, resulting in a **25%** improvement in data transfer rates across systems.\n• Collaborated on cross-functional teams to integrate backend Go services with cloud solutions, contributing to a **40%** reduction in deployment times.\n• Ensured compliance with industry standards by implementing best practices for security, leading to a significant decrease in vulnerabilities identified during audits."
    }
  ],
  "skills": "**Programming Languages:**\n\tC, Go, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tUbuntu, VMware, network configuration, storage devices, version control systems, containers\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, system-level programming, system thinking"
}