{
  "name": "Rei Taro",
  "role_name": "Senior Java Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Dynamic Senior Java Engineer with 10+ years in backend development, skilled in **Java** and focused on incident response, troubleshooting, and monitoring. Known for strong documentation practices and problem-solving abilities, complemented by analytical thinking and effective communication skills. Demonstrated flexibility in adapting to evolving project needs while delivering high-quality, scalable solutions. Proven expertise in designing backend systems for financial platforms and AI/ML pipelines, utilizing **cloud-native architectures** and automation tools. Contributed to successful projects at industry leaders including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized strong **Java** expertise to design and implement robust backend solutions while ensuring high-quality documentation for smooth knowledge transfer.\nDemonstrated excellent incident response and troubleshooting skills by swiftly identifying and resolving system issues, minimizing downtime by **20%**.\nImplemented comprehensive monitoring strategies that improved system performance metrics by **30%**, ensuring proactive incident management.\nApplied analytical thinking to conduct detailed evaluations of project requirements and deliver effective solutions, enhancing team collaboration and communication.\nExercised flexibility in adapting to shifting project priorities and working collaboratively with cross-functional teams to align technical solutions with business goals.\nEngaged in rigorous problem-solving sessions to address complex integration challenges, successfully leading initiatives to improve system resilience and functionality."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Java** in the development of scalable backend solutions, focusing on modular architecture and efficient data management practices.\nProactively engaged in **incident response** by diagnosing and troubleshooting system issues, achieving a **90% incident resolution rate** within **2 hours** of occurrence.\nImplemented effective **monitoring** strategies for robust system health checks, leading to a **20% improvement** in uptime across platform services.\nProduced comprehensive **documentation** for system processes, ensuring knowledge sharing and continuity within the team.\nEmployed strong **problem-solving** skills to identify root causes of application failures, resulting in reduced downtime by **30%**.\nExercised **analytical thinking** for performance tuning and optimization of existing codebases, enhancing application responsiveness by **15%**.\nMaintained open lines of **communication** with team members and stakeholders, ensuring project transparency and collaborative problem-solving.\nDemonstrated **flexibility** by adapting to changing project requirements and incorporating user feedback into development cycles."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "- Demonstrated **incident response** and **troubleshooting** skills by developing resilient backend services for trade execution using **Python**, **Flask**, and **PostgreSQL**, enhancing trading operations across **9** platforms.\n- Applied **monitoring** techniques while engineering real-time price feed processors with **asyncio**, **WebSockets**, and **Redis**, ensuring delivery of up-to-the-minute trading data for high-frequency transactions, processing over **5 million** data points per day.\n- Collaborated with frontend teams utilizing effective **communication** to deliver data through REST APIs and WebSocket channels, ensuring seamless user interaction with the platform, resulting in a **20%** increase in user satisfaction scores.\n- Demonstrated strong **problem-solving** and **analytical thinking** abilities by ensuring the platform's compliance with regulatory requirements, including **MiFID II** and **GDPR**, while adhering to internal data security protocols, achieving a **100%** compliance rate during audits.\n- Developed and implemented comprehensive test suites using **PyTest**, **tox**, and mock servers, streamlining QA and CI processes, decreasing bug count by **30%** before release.\n- Utilized **Celery** and **RabbitMQ** to introduce job queuing and scheduling solutions, optimizing backend task execution and process management, leading to a performance improvement of **15%** in task completion time."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tincident response, troubleshooting, monitoring, documentation, problem-solving, analytical thinking, communication, flexibility, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka",
  "apply_company": "BairesDev"
}