{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Fullstack Engineer with over 13 years of experience in delivering high-performance applications, specializing in **Java**, **JavaScript**, **TypeScript**, and **Angular**. Expert in both frontend and backend development, with a robust skillset in **Docker**, **Kubernetes**, and cloud solutions. Proven track record of implementing microservices architecture and leading architecture reviews to ensure scalable and maintainable designs. \nSkilled in database management with **Oracle**, **SQL**, and **PL/SQL**, and proficient in performance testing using **JMeter**. Demonstrated ability to produce high-quality software through meticulous software design processes and a solid understanding of networking concepts. Additionally, experienced in developing AI/ML-driven applications, with hands-on expertise in deploying solutions on AWS and Azure.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed robust full-stack applications using **Java**, **JavaScript**, **TypeScript**, and **Angular**, ensuring optimal performance and scalability for diverse projects.\n- Leveraged **Kubernetes** and **Docker** for orchestration and containerization, facilitating smooth deployment and scaling of applications with **10+** microservices.\n- Enhanced architectures through comprehensive **software design** practices and conducted thorough **architecture reviews** to ensure code quality and maintainability.\n- Implemented CI/CD pipelines with tools like Jenkins and **npm**, increasing deployment frequency by **30%** through automation and efficient workflows.\n- Engaged in **networking** solutions to boost application performance metrics, reducing latency by **25%** through optimal server configurations.\n- Conducted load testing using **JMeter** to ensure systems can handle spikes in user activity, achieving a **99.9%** uptime during peak traffic periods.\n- Utilized **Oracle**, **SQL**, and **PL/SQL** for effective data management in relational databases, with a focus on optimizing database queries for improved application performance.\n- Collaborated with cross-functional teams to implement business features and deliver high-quality applications, driving user engagement metrics up by **20%**.\n- Developed effective debugging and logging mechanisms to troubleshoot and enhance application performance, reducing average issue resolution time by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented full-stack development solutions utilizing **JavaScript** and **TypeScript** to enhance front-end and back-end features in high-performing applications.\nDesigned and developed microservices with **Java** and managed containerization using **Docker** and **Kubernetes**, leading to a **30%** improvement in deployment speed and operational efficiency.\nConducted architecture reviews and software design assessments to align applications with industry best practices, ensuring maintainability and scalability across platforms.\nOptimized database interactions through expert use of **Oracle**, **SQL**, and **PL/SQL**, resulting in **25%** faster data retrieval and reporting capabilities.\nCollaboratively worked on creating responsive single-page applications using **Angular** alongside **JavaScript** frameworks, improving user experience by enhancing loading times by **40%**.\nUtilized **npm** for package management, ensuring that all dependencies were efficiently handled and up-to-date, facilitating smoother build processes.\nConducted performance testing using **JMeter**, analyzing system behavior under various loads and successfully identifying bottlenecks resulting in **20%** improved system reliability.\nEngaged in networking strategies to enhance communication between systems, leading to improved data flow and reduced latency across services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Kubernetes** to design and optimize highly available backend services for a global e-commerce platform, ensuring low latency and scalability for critical modules like checkout and order fulfillment.\nApplied containerization techniques with **Docker** to streamline development and deployment processes, enhancing CI/CD workflows and minimizing environment discrepancies.\nDeveloped robust frontend applications using **Angular** (version 12), **TypeScript**, and **JavaScript**, ensuring fast, responsive user interfaces that adhere to best practices and provide an engaging user experience.\nConducted thorough architecture reviews to ensure alignment with software design principles, optimizing performance and maintainability of both frontend and backend systems.\nImplemented **JMeter** for load testing and performance benchmarking, validating application efficiency under high-traffic conditions with up to 90% efficiency improvements on resource allocation.\nLeveraged **Oracle** and SQL for seamless database integration, ensuring fault-tolerant data access for high-volume e-commerce transactions and optimizing complex queries for speed and reliability.\nManaged data storage solutions employing **PL/SQL** for complex operations, improving data processing times by **30%** on average.\nCollaborated on networking strategies to secure application connectivity and foster seamless integration with external services.\nUtilized **npm** for package management in front-end projects, maintaining dependency health and ensuring up-to-date libraries for a robust software environment.\nDeveloped and enforced role-based access control (RBAC) and OAuth 2.0 to enhance security across the platform, ensuring compliance with GDPR and safeguarding sensitive user data."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, JavaScript, TypeScript, Python\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Jakarta, JBoss, Wildfly\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Oracle, SQL, PL/SQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, JMeter\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Networking, Software Design, Architecture Review, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, npm",
  "apply_company": "Dedalus"
}