{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Geotechnical Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Geotechnical Engineer with over 13 years of experience in civil engineering and ground investigation, proficient in site supervision and project management. Proven ability to design and implement innovative solutions tailored for complex geotechnical challenges. Adept at team collaboration and effective communication, driving results through strong problem-solving capabilities. \n\nEnhanced by a robust technical background as a Full Stack Developer, skilled in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, with expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experience in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices and event-driven architectures. Demonstrated experience in compliance-driven development with a focus on industry standards. Strong analytical skills and a track record of delivering high-performance applications, ensuring alignment with regulatory requirements.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Geotechnical Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Conduct comprehensive ground investigations to assess soil and rock properties, ensuring adherence to geotechnical engineering standards and regulations.\nUtilize advanced design techniques and civil engineering principles in the development of foundation and earth retaining structures to support construction projects.\nSupervise construction sites, ensuring project specifications and safety protocols are met while maintaining effective communication with team members and stakeholders.\nEmploy problem-solving strategies to address geotechnical challenges, collaborating with multidisciplinary teams to develop innovative solutions for complex site conditions.\nManage project timelines and budgets, ensuring timely delivery and compliance with quality standards, while preparing comprehensive reports for stakeholders.\nDrive successful project outcomes by integrating best practices in site investigation and geotechnical analysis, demonstrating strong leadership and team collaboration skills.\nCoordinate with contractors, engineers, and regulatory bodies to ensure all facets of project management are executed efficiently, leveraging excellent communication skills.\nMaintain a valid driving license for site visits and inspections, facilitating direct engagement with project locations and teams."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Led ground investigation projects, applying advanced knowledge in **Geotechnical** principles to assess soil stability and site conditions, improving project outcomes by **30%**.\n• Collaborated with civil engineering teams to design innovative geotechnical solutions, contributing to the successful completion of **5 major infrastructure projects**.\n• Managed project timelines and resources efficiently, adhering to strict deadlines while reducing costs by **15%** through strategic planning and resource allocation.\n• Supervised site activities, ensuring compliance with engineering standards and safety regulations, resulting in a **zero-incident** safety record over **2 years**.\n• Exercised problem-solving skills to identify and mitigate potential site issues, increasing overall project efficiency by implementing proactive measures.\n• Fostered strong team collaboration through regular communication and feedback, enhancing team performance and project quality by **25%**.\n• Presented complex geotechnical data and findings to stakeholders, utilizing clear communication techniques to ensure understanding and gain project buy-in.\n• Obtained and maintained a valid **driving license** to facilitate site visits and project management activities across various locations."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Led site investigations and assessments for geotechnical projects, leveraging expertise in **Geotechnical** engineering to develop solutions based on site conditions and requirements.\nConducted thorough ground investigations, ensuring accurate interpretation and analysis of soil and rock properties to inform design decisions in line with best practices in **Civil Engineering**.\nCollaborated with multidisciplinary teams to execute project plans, actively participating in **site supervision** to ensure adherence to safety standards and regulatory compliance.\nDemonstrated effective **problem-solving** skills by identifying potential engineering challenges and developing innovative, practical solutions to meet project goals.\nManaged project timelines and deliverables, employing strong **project management** skills to coordinate resources and communicate updates with stakeholders, ensuring project milestones were achieved within a **6-month** time frame.\nUtilized excellent **communication** skills to prepare and present detailed reports, findings, and recommendations to clients and project teams, enhancing stakeholder understanding of project status.\nWorked closely with team members to foster a culture of **team collaboration**, sharing knowledge and expertise to improve overall project outcomes and efficiency.\nMaintained a valid **driving license** to facilitate travel to various project sites, enabling effective oversight of operations and responsiveness to on-site needs."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tGeotechnical\n\tCivil Engineering\n\tGround Investigation\n\tDesign\n\tSite Supervision\n\tProblem Solving\n\tTeam Collaboration\n\tCommunication\n\tProject Management\n\tDriving License",
  "apply_company": "Binnies"
}