{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Analytics Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As an Analytics Engineer with 8 years of experience, I possess extensive knowledge in **SQL** for data analysis, transformation, and modeling, and am proficient in **dbt** and **SQLMesh** for effective data engineering. I have a solid understanding of blockchain technologies, including smart contracts and on-chain data analysis. My robust skill set includes optimizing queries and community data management, empowering data-driven strategies with AI-driven tools. \nAdditionally, I have a strong background in full-stack development using modern **JavaScript/TypeScript**, **Python**, and **Flutter**, alongside frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My deep cloud experience spans **Azure** and **AWS**, where I've been instrumental in leading the development of enterprise-grade platforms incorporating AI/ML capabilities for predictive analytics and intelligent automation. With expertise in microservices architecture and CI/CD automation, I ensure the creation of secure and compliant applications, strictly adhering to standards like HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Analytics Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained robust **SQL** data models, ensuring optimized query performance and efficient data transformation for analytics demands, leading to a **25%** increase in query speed.\nEmployed **dbt** and **SQLMesh** for effective data pipeline management and transformation tasks, streamlining the workflow across analytics and engineering teams.\nConducted on-chain data analysis to enhance the reliability and accuracy of blockchain data utilized in analytics, improving overall data quality by **30%**.\nUtilized **AI-driven tools** to automate data cleaning and transformation processes, maximizing data integrity and relevance in analytics outcomes.\nCollaborated with stakeholders to design community data management strategies that facilitated data governance and compliance, resulting in improved stakeholder engagement.\nExecuted effective smart contract audits, ensuring transparency and functionality in all deployments, and reducing error rates by **15%**.\nLeading initiatives to integrate advanced data modeling techniques, optimizing data structures to support evolving analytics requirements in a fast-paced environment.\nWorked closely with cross-functional teams to implement blockchain knowledge in analytics projects, contributing to innovative solutions that leverage smart contract functionalities.\nProvided strategic insights through the use of **Python** for data analysis, enhancing reporting capabilities and decision-making processes for stakeholders.\nConducted comprehensive data engineering tasks, including ETL processes to prepare high-quality datasets for analytics, resulting in the delivery of actionable insights in **real-time**.\nImplemented advanced data visualization techniques, presenting complex data findings through interactive dashboards that improved data accessibility and understanding for end-users.\nMonitored and optimized the performance of data systems, leading to enhanced operational efficiency and reliability in data processing workflows."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted on-chain data analysis and data modeling to enhance financial platform performance, leveraging **SQL** and **dbt** to streamline data transformation processes and enable robust query optimization.\nUtilized **SQLMesh** for efficient data governance and management, ensuring high-quality data for analytics workloads.\nDeveloped and maintained smart contracts to automate and verify transactions on the blockchain, contributing to improved transparency and trust in financial operations.\nAnalyzed and transformed community data through AI-driven tools, enhancing decision-making capabilities within the analytics framework.\nImplemented best practices in data engineering to facilitate effective community data management, ensuring seamless integration with analytics systems.\nPresented insights from data analyses to stakeholders, driving data-driven decisions and enhancing overall strategic direction in the organization.\nCollaborated with cross-functional teams to integrate advanced analytics capabilities into existing financial platforms, improving responsiveness and user engagement by **25%**.\nLed initiatives to optimize analytics queries, reducing execution time by **30%**, enhancing the performance of reporting tools used by the operations teams.\nCreated documentation and training materials for future use of analytics tools and frameworks, improving team capabilities and reducing onboarding time for new engineers by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Performed on-chain data analysis using **SQL** and **dbt** to extract actionable insights and support data-driven decision-making for e-commerce business strategy.\nDesigned and optimized data models for effective data transformation and visualization, enhancing community data management to fulfill project requirements and customer expectations.\nDeveloped optimized SQL queries for efficient data retrieval, ensuring timely access to critical analytics for stakeholders, leveraging performance tuning techniques to enhance query execution.\nCreated and maintained ETL pipelines for seamless data engineering processes, integrating on-chain data with traditional databases to support a unified view of business metrics.\nEngineered smart contracts on blockchain technology, ensuring secure transactions and processes, while showcasing a strong understanding of blockchain deployment and workflow management.\nApplied AI-driven tools to enhance data transformation techniques, enabling predictive analytics and machine learning integration to drive operational efficiencies.\nUtilized **SQLMesh** to facilitate efficient database management and version control, ensuring data integrity and reliability across multiple iterations and analytics perspectives.\nCollaborated with cross-functional teams to align technical solutions with business goals, promoting continuous improvement through data-driven insights and community engagement strategies.\nImplemented measures for query optimization, significantly reducing response times and improving user experience across analytics platforms.\nServed as a key contributor to the development and execution of data modeling strategies, resulting in streamlined processes and improved data visibility."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, on-chain data analysis, dbt, SQLMesh, blockchain knowledge, smart contracts, data modeling, query optimization, data transformation, data engineering, community data management, AI-driven tools"
}