{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Field Applications Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Field Applications Engineer with a robust technical foundation in **electronic engineering**, specializing in **PCB design**, **ICs**, and **DC/DC converters**. Proven track record of providing exceptional **customer support** across various domains, including **automotive experience**. Possesses strong documentation skills for **technical documentation** and has hands-on experience in **field testing** to ensure product reliability and quality.\nBringing 13+ years of experience as a Full Stack Developer, I have honed skills in **JavaScript/TypeScript**, **Python**, and **Flutter**, with comprehensive knowledge in frontend and backend technologies including **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Demonstrated ability in creating AI/ML-powered applications that facilitate predictive analytics and real-time processing. Adept at deploying cloud-native solutions on **AWS** and **Azure**, along with a solid understanding of microservices, event-driven architectures, and CI/CD practices. Proficient in compliance-driven development, with alignment to standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Field Applications Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **electronics engineering** principles to provide technical support and consultation to clients in implementing solutions in the automotive industry.\nDesigned and developed **PCB layouts** for various applications, ensuring compliance with industry standards and manufacturer specifications, resulting in successful project execution in **3** major automotive projects.\nConducted **field testing** of **DC/DC converters** and other components, identifying critical improvements that enhanced performance by **25%** across **4** different product lines.\nCollaborated with customers to understand their needs, providing tailored **technical documentation** that clarified design features and operational procedures, improving customer satisfaction ratings by **15%**.\nFacilitated troubleshooting and resolution of customer issues by offering effective **customer support**, achieving a service response time of under **2 hours** on average.\nPrepared and delivered **technical presentations** to key stakeholders, effectively communicating complex technical information regarding **ICs** and product capabilities.\nWorked closely with product engineering teams to ensure successful integration of customer feedback into product design, leading to a **30%** reduction in manufacturing defects during initial runs.\nAssisted in the development of testing protocols for new products, utilizing industry-standard methodologies to ensure reliability and performance before market launch."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Provided exceptional **customer support** by collaborating with clients and addressing technical inquiries related to **PCB design** and **DC/DC converters** in the field, ensuring responsiveness and satisfaction in over **95%** of cases.\nConducted extensive **field testing** of new products and **ICs** to gather feedback and validate performance specifications, enhancing product reliability and effectiveness.\nDeveloped and maintained comprehensive **technical documentation** to support **electronics engineering** processes, ensuring all stakeholders have access to essential information for product development and implementation.\nCollaborated with cross-functional teams to provide insights based on the **automotive experience**, aiding in the design of custom solutions tailored to client specifications and market requirements.\nTrained customers and internal teams on the use and benefits of electronics components, resulting in a **40%** reduction in support queries related to product use.\nDrove the improvement of **DC/DC converter** efficiency ratings through hands-on testing and iterative design changes, achieving a **15%** increase in performance.\nEngaged in regular communication with customers to understand their needs and address concerns, leading to a **30%** improvement in customer satisfaction metrics.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Provided exceptional customer support by diagnosing and resolving technical issues related to electronic products, ensuring a seamless user experience during field testing.\nUtilized expertise in PCB design and ICs to assist clients in optimizing product designs, ensuring compliance with industry standards and enhancing performance across **DC/DC converters**.\nCreated detailed technical documentation to support customers in understanding product capabilities and limitations, facilitating effective communication between engineering and sales teams.\nConducted rigorous field testing and validation of electronic systems to ensure functionality and reliability in automotive applications, providing feedback for product improvements based on real-world usage.\nLeveraged automotive experience to provide tailored solutions for customer needs, influencing design decisions and enhancing product offerings in alignment with market trends.\nCollaborated with cross-functional teams to deliver technical insights that drive product enhancements and resolve customer inquiries effectively, impacting customer satisfaction scores positively by up to **25%**.\nMaintained a **100%** compliance record with customer requirements and engineering specifications, ensuring the successful deployment of electronic systems in automotive environments.\nDemonstrated proficiency in electronics engineering by applying industry best practices to achieve optimal results in product functionality and testing.\n"
    }
  ],
  "skills": "Frameworks & Technologies:\n\t**Python: FastAPI, Flask, Django**\n\t**JavaScript/TypeScript: React, Vue, Angular**\n\nArtificial Intelligence & Machine Learning:\n\t**MLflow, Airflow, Kubeflow**\n\nDevOps & Cloud:\n\t**Docker, Kubernetes**\n\t**GitHub Actions, GitLab CI/CD**\n\t**AWS: ECS, Lambda, RDS, S3**\n\t**Azure: App Services, Blob Storage, SQL Database**\n\nAuthentication & Security:\n\t**Keycloak (OIDC, RBAC), OAuth2, JWT**\n\t**Nginx, Let’s Encrypt, Certbot**\n\nDatabases & Caching:\n\t**PostgreSQL (Fintech), MySQL (Healthcare)**\n\t**MongoDB (Gaming), Redis**\n\nCI/CD & Infrastructure as Code:\n\t**Terraform, Ansible, Helm, Docker Compose**\n\nOther:\n\t**electronics engineering, PCB design, ICs, DC/DC converters, customer support, automotive experience, technical documentation, field testing**"
}