{
  "name": "Rei Taro",
  "role_name": "Senior Software Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Software Engineer with over 10 years of experience in backend development, specializing in **PHP**, **MySQL**, **Postgres**, and **event-based applications** using **Kafka** and **RabbitMQ**. Proficient in **API design** and **object-oriented programming**, ensuring clean code and efficient source code management through **Git**. Demonstrated ability to develop high-quality backend systems in collaborative environments, fostering an open feedback culture. Proven history of contributing to significant projects for well-known organizations, including VISA, Sii Poland, and Reply Polska, with a strong command of English and German.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **PHP** and **MySQL** to enhance backend development, improving system performance by **25%**.\nEngineered robust **API design** to facilitate seamless data interactions, ensuring clean code practices and effective source code management with **Git**.\nDeveloped event-based applications leveraging **RabbitMQ** for effective message brokering and **Kafka** for real-time data processing, achieving a data handling capacity of **50,000 messages** per minute.\nImplemented and maintained relational databases with **Postgres**, optimizing query performance by **30%** through thorough understanding of object-oriented programming principles.\nCollaborated in an agile team environment, promoting an open feedback culture and effective team collaboration to drive project success and delivery.\nLed cross-functional initiatives for integrating **event-driven solutions**, ensuring compliance and system reliability in line with industry standards.\nParticipated in code reviews and mentorship programs, fostering knowledge sharing in **Linux** and backend technologies while supporting junior developers' growth in **React** projects."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed backend systems in **PHP** and **MySQL** to automate document workflows and streamline user onboarding, enhancing efficiency by **30%**.\n• Engineered event-based applications utilizing **RabbitMQ** for asynchronous processing, improving transaction request handling speed by **25%**.\n• Designed and implemented RESTful APIs for seamless data integration, ensuring adherence to clean code principles and optimal performance metrics.\n• Collaborated with cross-functional teams to integrate **Kafka** for real-time data processing, ensuring timely updates and regulatory compliance.\n• Managed source code using **Git** and implemented **Linux** based deployment strategies, ensuring consistent and scalable environments in production.\n• Fostered an open feedback culture within the team, enhancing collaboration and contributing to a successful release management process, resulting in faster feature rollouts by **40%**.\n• Conducted code reviews and team workshops in **English** and **German**, promoting best practices in object-oriented programming and agile methodologies."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed backend services for trade execution, portfolio management, and account tracking using **Python**, **Flask**, and **PostgreSQL** to enhance trading operations.\n• Engineered real-time price feed processors utilizing **asyncio**, **WebSockets**, and **Redis** to deliver up-to-the-minute trading data for high-frequency transactions.\n• Designed robust APIs for seamless integration, emphasizing **API design** to ensure data is delivered effectively through REST APIs and WebSocket channels.\n• Developed event-based applications to enhance responsiveness and scalability of the system, incorporating best practices in **backend development** and **clean code**.\n• Implemented comprehensive test suites with **PyTest**, **tox**, and mock servers, ensuring code quality and streamlining QA and CI processes to maintain a consistent development workflow.\n• Introduced job queuing and scheduling solutions with **Celery** and **RabbitMQ**, optimizing backend task execution and process management to improve overall system performance.\n• Collaborated with cross-functional teams, promoting an **open feedback culture** to enhance team collaboration and drive efficiency throughout the project lifecycle.\n• Ensured the platform met regulatory requirements, including **MiFID II** and **GDPR**, while adhering to internal data security protocols for compliance and risk management."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, PHP\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tReact\n\n**API Technologies**\n\tREST/gRPC APIs, API design\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, source code management, Git\n\n**Cloud & Infrastructure**\n\tLinux\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, RabbitMQ, backend development, object-oriented programming, event-based applications, clean code, team collaboration, open feedback culture, English, German",
  "apply_company": "ChargePoint"
}