{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Service Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Service Engineer with 8 years of experience, I possess strong **communication skills** and **analytical skills** to effectively troubleshoot and provide technical support for inspection machinery, including **checkweighers**, **x-ray**, and **metal detection** systems in the **food**, **beverage**, and **pharmaceutical** industries. My robust software experience allows me to integrate technical solutions that enhance operational efficiency and uphold customer focus. \n\nIn addition, I bring expertise in **full-stack development**, utilizing technologies such as **JavaScript**, **TypeScript**, **Python**, and **Flutter** to build high-performance solutions. My proficiency in frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** complements my deep knowledge of cloud platforms, mainly **Azure** and **AWS**. I have successfully led the development of enterprise-level applications that incorporate advanced features, including **AI/ML** capabilities for analytics and real-time processing. Furthermore, my strong foundation in **microservices architecture**, **event-driven systems**, and **CI/CD automation** ensures the delivery of secure and compliant applications.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Service Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided technical support for **inspection machinery**, **checkweighers**, and **x-ray** equipment across the **food**, **beverage**, and **pharmaceutical industries** to ensure operational efficiency and compliance with industry standards.\nConducted rigorous **inspection machinery** diagnostics and troubleshooting to enhance equipment performance and minimize downtime, resulting in a **20%** increase in equipment reliability.\nInstalled and calibrated **metal detection** systems, ensuring optimal functionality and compliance with food safety regulations, contributing to a **15%** reduction in contamination incidents.\nCollaborated with cross-functional teams to train operators on **software experience** and best practices for handling **checkweighers** and **metal detection** technologies, improving team communication and operational competency.\nUtilized strong **analytical skills** to assess equipment performance data, identifying opportunities for process improvement and delivering actionable insight to enhance product quality.\nEngaged directly with customers to understand their needs, delivering tailored solutions that improved machinery efficiency and customer satisfaction metrics by **30%**.\nProvided comprehensive reports and recommendations based on inspections and field service visits, ensuring clients are well-informed about their machinery’s operational status and any necessary enhancements or upgrades.\nDemonstrated exceptional **communication skills** in delivering technical presentations and workshops, fostering a solid understanding of machinery among clients and staff in the **pharmaceutical industry**.\nStreamlined support processes by implementing new communication channels and workflows that decreased response times to service requests by **25%**, ensuring higher customer focus and loyalty.\nAssisted in the deployment of real-time monitoring systems for machinery, improving diagnostic capabilities and facilitating predictive maintenance strategies across various sectors."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided **technical support** for inspection machinery, including **checkweighers**, **x-ray**, and **metal detection** systems, ensuring optimal performance and compliance within the **food**, **beverage**, and **pharmaceutical** industries.\nUtilized strong **analytical skills** to troubleshoot and resolve issues in inspection machinery, achieving a **99%** first-time fix rate during the **2022** fiscal year.\nMaintained a **customer focus** by effectively communicating with clients to assess their needs and deliver tailored solutions, improving customer satisfaction scores by **15%**.\nConducted thorough inspections and performance evaluations of various inspection technologies, leading to a **25%** reduction in equipment downtime over a **12-month** period.\nEmployed solid **communication skills** to train team members and clients on the effective use and maintenance of inspection equipment, significantly enhancing user competency by **30%**.\nDeveloped and implemented a feedback system to collect customer insights and drive product improvements, resulting in a **20%** increase in service contracts within the first **6 months** of launch."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Provided technical support and inspection machinery expertise to enhance production efficiency in the food, beverage, and pharmaceutical industries, ensuring compliance with industry standards.\nCollaborated with cross-functional teams to integrate **checkweighers**, **x-ray**, and **metal detection** technologies into existing workflows, resulting in a 20% increase in quality assurance processes.\nDelivered comprehensive training and support for customers on the usage and maintenance of inspection equipment, improving customer satisfaction rates by 30%.\nConducted thorough analyses and inspections to identify areas for improvement within production lines, leading to optimized equipment operation and utilization.\nFacilitated effective communication with stakeholders to understand their needs and provide tailored solutions, enhancing customer focus and service delivery.\nMonitored and assessed equipment performance, recommending software upgrades and technical enhancements, utilizing strong analytical skills to ensure peak operation levels.\nDeveloped and maintained comprehensive documentation for software configurations and operational procedures, streamlining support processes and reducing response times by 15%.\nLeveraged knowledge of industry regulations and standards to ensure all products meet safety and compliance guidelines, significantly mitigating risk for clients in regulated industries.\nUtilized a variety of software applications to track and report on inspection results, actively contributing to process improvements and enhanced operational effectiveness."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL), Nginx, Certbot\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, inspection machinery, checkweighers, x-ray, metal detection, food industry, beverage industry, pharmaceutical industry, communication skills, analytical skills, customer focus, software experience, technical support",
  "apply_company": "MinebeaMitsumi Europe"
}