{
  "name": "Marcin Karol Kotlinski",
  "role_name": "QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As a dedicated QA Engineer with extensive experience in Quality Assurance, I possess strong skills in API testing, automation testing, functional testing, and regression testing. My technical proficiency includes **Python**, **JavaScript**, **TypeScript**, and **Golang**, with a thorough understanding of the Software Development Life Cycle (SDLC) and Agile methodologies, including Scrum. \nI am adept at defect tracking and ensuring software quality through meticulous testing practices. My experience includes leveraging **CLI tools** and **logging tools** to enhance application performance and reliability, ensuring compliance with industry standards.\nIn my previous roles, I have effectively collaborated with cross-functional teams to deliver high-quality software solutions across industries including healthcare and finance. My capabilities also extend to building automated test frameworks, contributing to CI/CD pipelines, and fostering a culture of quality within development teams.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted comprehensive **Quality Assurance** across scalable, full-stack healthcare and financial platforms to ensure software integrity and compliance with industry standards.\n- Performed **API testing** for backend services built with **Python (FastAPI)**, **Node.js**, and **TypeScript**, verifying data accuracy and functionality.\n- Implemented rigorous **Automation testing** frameworks alongside **Golang**, **JavaScript**, and **Typescript** within CI/CD pipelines, improving regression testing efficiency by **30%**.\n- Executed **Functional testing** across web and mobile applications to validate user experiences on platforms using **React (17-18)** and **Flutter**, ensuring seamless fintech operations across **iOS** and **Android**.\n- Managed **Defect tracking** and reporting through tools such as **Jira**, facilitating resolution timelines and enhancing product quality by reducing defect leakage rates by **25%**.\n- Engaged in the **SDLC** process to identify and document testing requirements, leading to improved collaboration and transparency during **Scrum** and **Agile** ceremonies.\n- Spearheaded **Regression testing** initiatives, ensuring legacy functionalities remained intact across multiple deployments and versions, achieving a **95%** pass rate in test suites.\n- Developed and maintained **CLI tools** for automating recurring test scenarios, facilitating rapid feedback loops and reducing manual testing efforts by **40%**.\n- Leveraged **Blockchain technology** concepts to enhance data security during testing phases, contributing to overall compliance with HIPAA and GDPR regulations.\n- Collaborated closely with cross-functional teams, focusing on potential **logging tools** and error analytics to streamline issue identification and resolution processes.\n- Established testing strategies using **Jest, Cypress**, and **Postman**, ensuring reliable unit and integration tests across both frontend and backend services with **95%** code coverage.\n- Integrated with **Cloud environments** for deploying containerized services to enhance testing environments dynamically, ensuring consistency with real-world applications.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted comprehensive **Quality Assurance** on financial platforms to ensure adherence to specifications and compliance requirements, significantly reducing defects by **30%** through meticulous **Functional testing** and **Regression testing**.\nDeveloped and executed automated test scripts utilizing **Python** and **JavaScript**, enhancing test coverage and increasing testing efficiency by **40%** compared to manual methods.\nPerformed thorough **API testing** to validate the functionality and performance of various financial services, leveraging tools like Postman and Swagger for testing and validation processes.\nManaged **Defect tracking** and reporting using JIRA, facilitating the debugging process and accelerating resolution times for identified issues by **20%**.\nCollaborated in an **Agile/Scrum** environment to streamline the **Software Development Life Cycle (SDLC)** by implementing **Automation testing** strategies that integrated with the overall development process.\nUtilized **Golang** for developing CLI tools that supported testing and monitoring applications, improving the feedback loop between development and testing teams.\nLed training sessions on testing best practices and tools to upskill team members, fostering an environment of continuous improvement and knowledge sharing in **Blockchain technology**.\nEnsured proper **Logging tools** were in place to capture significant events and exceptions, facilitating better analysis and debugging capabilities during the QA phase.\nCreated and maintained test documentation that defined the scope and specifics of **Quality Assurance** processes, contributing to knowledge management within the team."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted **Quality Assurance** processes by executing API testing and **Automation testing** scripts, ensuring robust performance across backend services developed in **Python** and **JavaScript** frameworks.\nPerformed extensive **Functional testing** and **Regression testing** on global e-commerce platform modules, leading to a **30% reduction** in defect leakage in production environments.\nUtilized Defect tracking tools to report and manage issues effectively, driving resolution rates of **95%** within the sprint cycle.\nParticipated in the **SDLC** actively, collaborating closely with development teams using **Agile** methodologies, resulting in improved sprint efficiency and delivery timelines.\nEnhanced testing processes through the implementation of **Golang** and **Python** based CLI tools for automated test case execution, achieving **40%** faster testing cycles.\nLeveraged **JavaScript** and **TypeScript** to design and implement test scenarios for frontend applications, ensuring seamless user experiences with reasonable coverage metrics exceeding **90%**.\nProvided valuable feedback during Sprint planning, contributing to product quality goals and aligning with **Scrum** principles for fast and iterative development.\nEvaluated and integrated **Blockchain technology** related features for transaction validation processes, ensuring security and integrity in QA tests.\nEmployed **Logging tools** to monitor application behavior, enhancing the visibility of issue trends and facilitating proactive quality improvements."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, Golang, JavaScript, TypeScript\n\n**Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:** \n\tReact, Vue, Angular\n\n**API Technologies:** \n\tAPI testing, Automation testing, Functional testing, Regression testing, Defect tracking\n\n**Serverless and Cloud Functions:** \n\tAWS (Lambda), Azure (App Services)\n\n**Databases:** \n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:** \n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:** \n\tQuality Assurance, SDLC, Blockchain technology, CLI tools, Logging tools, Scrum, Agile, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot"
}