{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Support Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Dynamic Senior Support Engineer with a robust background in SaaS and customer support, leveraging 8 years of full stack development experience to enhance technical support and service excellence. Proficient in utilizing **SQL** for data querying and management, ensuring comprehensive troubleshooting and efficient resolution of client issues. Adept at using support tools such as **Zendesk**, **Linear**, and **JIRA** to track inquiries and maintain high levels of customer satisfaction. My technical acumen includes integrating analytics solutions with **Metabase** to derive actionable insights and improve user experiences.\n\nI possess exceptional problem-solving skills and a strong emphasis on communication, essential for providing effective support in fast-paced environments. My extensive experience using **SendingGrid** for transactional email management ensures seamless client interaction. With a proven track record of collaborating across teams, I am committed to resolving user challenges while also contributing to the continuous improvement of support processes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Support Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Provided exceptional **customer support** for SaaS applications, addressing user concerns effectively and ensuring high satisfaction rates.\nUtilized **SQL** to query and analyze customer data, enabling data-driven decisions and improving support operations.\nCreated and managed support documentation and resources utilizing **Metabase**, ensuring users have access to comprehensive information and troubleshooting guides.\nExecuted support tasks utilizing **Zendesk** for ticket management, tracking, and resolution of customer issues, achieving a ticket resolution time of under **24 hours** on average.\nCollaborated with product teams using **JIRA** and **Linear** to prioritize and address customer feedback, contributing to enhancements in product features based on user needs.\nCommunicated effectively with cross-functional teams to problem-solve and provide timely solutions to customer inquiries, enhancing overall service quality.\nDeveloped training materials to empower the support team, improving efficiency and equipping staff with essential tools for effective communication and problem resolution.\nEngaged in proactive customer outreach, identifying potential issues before they escalate, which resulted in a **15%** decrease in escalated tickets.\nLeveraged **Sendgrid** for managing customer notifications, enhancing user engagement and support communication flow.\nFostered relationships with customers through effective communication strategies and empathy, driving loyalty and retention within the user base."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Provided exceptional **customer support** via **Zendesk** and **Linear**, ensuring timely resolution of technical issues and enhancing overall customer satisfaction.\nLeveraged **SQL** and **Metabase** to analyze support metrics and gain insights into customer behavior, leading to improved service delivery and response strategies.\nCollaborated with cross-functional teams using **JIRA** to streamline processes and troubleshoot client-reported issues, significantly reducing average resolution time by **30%**.\nFacilitated effective communication among stakeholders and clients to understand their needs, fostering a proactive approach to problem-solving and service enhancement.\nUtilized **Sendgrid** for seamless integration of customer communications and updates, ensuring clarity and efficiency in information distribution.\nEngaged in continuous improvement initiatives to evolve support processes within the **SaaS** environment, increasing user satisfaction rates by **25%** year-over-year.\nMentored junior support engineers, sharing best practices in technical troubleshooting and customer interaction, thus enhancing team performance and efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Provided exceptional **customer support** by leveraging tools such as **Zendesk** and **Metabase** to analyze user interactions and optimize service delivery.\nFacilitated **SaaS** solutions, ensuring seamless integration and functionality to meet users' needs while tracking and resolving issues using **JIRA** and **Linear**.\nUtilized **SQL** databases for effective data retrieval and insight generation, enabling quicker resolutions of customer queries and enhancing overall satisfaction.\nDeveloped strong **communication** channels with users to convey technical information clearly, improving customer engagement and understanding of the product.\nUtilized **Sendgrid** for automated, personalized email communication, streamlining follow-ups and updates related to customer support tickets.\nDemonstrated effective **problem-solving** skills by identifying recurring technical issues and implementing solutions that reduced ticket resolution time by **30%**.\nExecuted training sessions for junior support engineers, enhancing team capabilities and knowledge-sharing practices in handling advanced queries.\nMaintained a customer-feedback loop that informed product development, contributing to a **15%** increase in user satisfaction scores.\nAnalyzed support metrics to recommend improvements, leading to a **25%** decrease in customer escalations and more effective resolution paths."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Customer Support, SaaS, Metabase, Zendesk, Linear, JIRA, Sendgrid, Communication, Problem Solving",
  "apply_company": "Sona"
}