{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior Google Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a highly skilled Senior Google Engineer, I bring 8 years of experience in managing cloud infrastructure and executing seamless **Google Cloud** transformations. Proficient in **Google Workspace**, **Windows**, and **Active Directory**, I excel in driving digital transformation initiatives and implementing effective networking solutions. My expertise in cloud migration ensures streamlined processes and enhanced customer service while adhering to best practices. \nAdditionally, I possess foundational knowledge in project management and technical training, enabling me to lead teams effectively and consult on strategic IT solutions. While my background primarily focuses on full-stack development utilizing **JavaScript**, **TypeScript**, **Python**, and **Flutter**, I also have a comprehensive understanding of enterprise systems and compliance standards. I have successfully developed platforms utilizing **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, alongside implementing robust microservices architecture and event-driven systems.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Google Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Executed strategic **cloud migration** projects to **Google Cloud** to enhance organizational capabilities, ensuring seamless transitions for diverse team environments.\nManaged complex **digital transformation** initiatives that improved customer service and elevated operational efficiency through enhanced use of **Google Workspace** tools.\nLed **project management** efforts to coordinate cross-functional teams, ensuring timely delivery of technical training sessions, resulting in increased team productivity by **25%**.\nProvided expert **technical training** and consulting services, empowering clients to maximize their use of **Windows** and **Active Directory** to improve system performance and security.\nOptimized **networking** infrastructure, achieving a **30%** increase in system reliability, and developed backup solutions for business continuity.\nFacilitated hands-on customer service engagements, addressing issues with **Exchange** environments to boost client satisfaction ratings to **95%**.\nStreamlined operational processes through effective troubleshooting, utilizing best practices in **cloud migration** and **digital transformation**, contributing to an overall reduction in support tickets by **40%**.\nEvaluated client environments and provided innovative consulting solutions, enhancing users' expertise in utilizing **Google Workspace** for digital projects and business initiatives."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Led digital transformation initiatives by migrating legacy systems to **Google Cloud** platforms, enhancing operational efficiency and reducing costs by up to **30%**.\nManaged projects focused on **Google Workspace** implementation, improving team collaboration and productivity, evidenced by a **25%** increase in project deliverables.\nProvided technical training to cross-functional teams on **Google Workspace** tools and best practices, resulting in a **40%** improvement in user adoption rates.\nConducted consultations for clients on leveraging **Google Cloud** services for infrastructure optimization, ensuring seamless integration with existing services and adherence to **best practices**.\nOversaw Active Directory integration for user and resource management, ensuring secure and efficient access controls across platforms.\nEngaged in networking practices to enhance connectivity solutions within cloud environments, which successfully reduced downtime incidents by **15%**.\nDelivered exceptional customer service by troubleshooting and resolving issues related to **Windows** environments and **Exchange** systems, achieving a customer satisfaction rating of **95%**.\nImplemented strategic project management methodologies to oversee cloud migration projects, ensuring they were completed on time and within budget.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Led the digital transformation initiatives utilizing **Google Workspace** and **Google Cloud**, driving cloud migration projects for improved operational efficiency and collaboration across teams.\nManaged Active Directory and Exchange services to enhance networking capabilities, ensuring streamlined user management and secure communication for over **500** employees.\nFacilitated technical training sessions for teams, focusing on effective use of **Windows** environments and cloud solutions, boosting productivity by **30%**.\nDeveloped project management frameworks to oversee cloud integration and infrastructure optimization projects, successfully reducing project delivery timelines by **20%**.\nProvided consulting services to improve customer service experience, leveraging cloud-based tools and strategies to enhance client communication and satisfaction metrics.\nImplemented reliable networking architecture that supports seamless connectivity and data integrity across various platforms, positively impacting system uptime to **99.9%**.\nStreamlined cloud operations to enable efficient data access and resource allocation, achieving a **15%** reduction in overhead costs while enhancing service delivery performance.\nEngaged in proactive troubleshooting and support for networking issues, demonstrating high-level customer service skills and technical expertise in resolving complex technical challenges."
    }
  ],
  "skills": "Programming Languages:\n\tPython (FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tGoogle Cloud, Cloud Migration, Networking\n\n**Other:**\n\tGoogle Workspace, Windows, Active Directory, Exchange, Digital Transformation, Project Management, Customer Service, Consulting, Technical Training, Keycloak (OIDC, RBAC), MLflow, Airflow, Kubeflow",
  "apply_company": "PCG DACH"
}