{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior FullStack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Full Stack Engineer with 10+ years of experience skilled in **Python**, **TypeScript**, and developing scalable **APIs**. Expertise in building secure and high-performance **SaaS** solutions on **AWS** while ensuring optimal scalability and user experience. Proficient in modern frameworks including **React**, **Node.js**, and **Next.js**, with a strong focus on performance and security best practices. Adept in leverage of **OAuth** for secure authentication, making solutions compliant and robust.\n\nSeasoned in collaborative environments, excelling in problem-solving and driving integration of technologies such as **Temporal** for effective task scheduling within B2B applications. Brings a wealth of knowledge in microservices architecture and real-time user interaction, ensuring that all solutions meet stringent compliance standards. Passionate about creating impactful systems that truly enhance business functionality.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped APIs using **Python** and **TypeScript**, focusing on security and performance to ensure seamless data collaboration across **AWS** and Azure platforms in **SaaS** solutions.\n•\tImplemented OAuth for secure authentication and authorization processes in B2B applications, emphasizing scalable user experience and real-time data access.\n•\tDesigned and created high-performance, full-stack application architectures utilizing **FastAPI**, **Node.js**, and **React (17–18)**, achieving a 30% improvement in response times.\n•\tDelivered secure and scalable mobile applications using **Flutter** and **React Native**, resulting in a 40% increase in user engagement on both iOS and Android platforms.\n•\tRevamped existing monolithic systems into microservices, utilizing **Docker** and **Kubernetes (EKS/AKS)**, which contributed to a 99.9% uptime and enhanced fault tolerance.\n•\tEngineered cloud-native data architectures with **PostgreSQL**, **MongoDB**, and **GraphQL** to support the ingestion and querying of large datasets, optimizing processes for better scalability and performance.\n•\tDeveloped and integrated machine learning models using **Python (scikit-learn, PyTorch, TensorFlow)** for real-time applications, successfully increasing predictive accuracy by 25% in patient risk assessments and fraud detection.\n•\tCreated MLOps pipelines with **MLflow** and **Apache Airflow**, streamlining model training and deployment processes across both development and production environments.\n•\tImplemented enterprise-level DevOps pipelines utilizing **GitHub Actions** and **Azure DevOps**, ensuring rigorous testing and security scans that led to a reduction in deployment errors by 50%.\n•\tValidated user insights by developing complex financial data visualization tools using **D3.js** and **Power BI Embedded**, which provided actionable real-time insights for operational KPIs.\n•\tCollaborated effectively with data scientists on the integration of NLP models via **spaCy** and **Hugging Face Transformers** for advanced document processing, embedding functionalities into core services leveling up performance.\n•\tEstablished comprehensive testing strategies using **Jest**, **Cypress**, and **Postman** to ensure system integrity across both front-end and backend services, with test coverage exceeding 80%.\n•\tIntegrated **Azure Cognitive Search** and **ElasticSearch** to enhance search capabilities across millions of structured and unstructured documents, improving retrieval speeds by over 200%."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and optimized **APIs** using **Python** and **TypeScript**, enhancing system **scalability** and **performance** for high-demand financial applications.\nDesigned and implemented **OAuth** for secure user authentication and authorization in dynamic web applications, ensuring led to a 25% increase in security compliance.\nEngaged in collaborative projects fostering teamwork that improved deployment efficiencies by **30%**, using modern methodologies like Agile and Scrum.\nArchitected and modernized the architecture of financial platforms applying **scalability** principles, leading to a 40% improvement in system throughput.\nUtilized **AWS** and other cloud services to build resilient and cost-effective solutions, achieving a 20% reduction in operational costs.\nEnhanced user experience by integrating B2B and SaaS solutions into front-end applications using **React (18)**, **Next.js**, and **TypeScript**, resulting in improved user engagement metrics.\nResolved complex technical challenges through innovative **problem solving** strategies, decreasing downtime by **15%** through proactive issue resolution.\nCreated and maintained high-quality documentation for tech stacks and project workflows, bolstering team collaboration and onboarding effectiveness."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** (FastAPI, Django) and **TypeScript** to design and optimize scalable backend services for a global e-commerce platform, ensuring high availability and low latency across key modules like checkout, cart, and order fulfillment.\nEngineered responsive APIs and robust services with a focus on **performance** and **security**, utilizing **OAuth 2.0** for secure access and GDPR compliance.\nImplemented **AWS** for cloud services, enabling efficient deployment and management of applications, ensuring seamless scalability for high-traffic demands.\nDeveloped real-time features using WebSockets and event-driven architecture powered by **Kafka** and **RabbitMQ**, enhancing user experience with dynamic inventory tracking and real-time order updates.\nCollaborated on building frontend applications using **React** (18), **Vue 3**, and **Angular**, enhanced with **Redux Toolkit** and **Tailwind CSS**, delivering high-quality user experiences across web and mobile platforms.\nLeveraged databases such as **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for distributed data storage, ensuring fault-tolerant data access for e-commerce workflows and achieving performance gains through optimized caching.\nIntegrated AI/ML-based recommendation engines utilizing **scikit-learn**, **LightGBM**, and **TensorFlow**, leading to improved conversion rates through personalized product recommendations and optimized search relevance.\nImplemented feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes**, facilitating controlled rollouts and A/B testing while minimizing risks during platform updates.\nBuilt secure payment workflows with **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI-compliant handling of sensitive user data and tokenized transactions.\nApplied role-based access control (RBAC) principles, ensuring a secure application environment through effective **collaboration** in maintaining user data protection and compliance with industry regulations."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs, OAuth\n\n **Serverless and Cloud Functions:**\n\tAWS\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, Let’s Encrypt, Nginx, Certbot, Temporal, B2B, SaaS, scalability, performance, security, collaboration, user experience, problem solving",
  "apply_company": "Ben"
}