{
  "name": "Tomasz Lee",
  "role_name": "Staff Frontend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Skilled in **React**, **Next.js**, **JavaScript**, and **TypeScript** with 9+ years as a .NET Full Stack Developer, specializing in creating responsive UIs and building APIs. Proficient in applying accessibility and usability principles to enhance user experience. Experienced in debugging with tools like **Postman**, demonstrating strong problem-solving abilities and attention to design details. Proven capability in product thinking and working autonomously to deliver high-quality solutions, while adept at collaborating with cross-functional teams to lead projects to success.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Staff Frontend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed responsive user interfaces using **React**, **Next.js**, and **JavaScript**, enhancing accessibility and usability principles for optimal user experience.\n• Designed and implemented robust API endpoints while building and testing with **Postman**, ensuring reliability and performance of front-end applications.\n• Utilized **TypeScript** to enhance code quality, maintainability, and enable seamless debugging across the codebase.\n• Spearheaded the integration of user feedback into product thinking, resulting in innovative design details that improved platform usability by **25%**.\n• Applied problem-solving skills to tackle complex challenges in UI development autonomously, ensuring timely project delivery.\n• Collaborated with cross-functional teams to align on project goals, focusing on creating a seamless and efficient user experience across the platform.\n• Leveraged strong attention to design details to ensure that all user interactions were intuitive and aligned with responsive UI guidelines.\n• Employed effective debugging techniques to identify and resolve issues swiftly, optimizing overall performance.\n• Contributed to the development of high-quality code and adherence to best practices in software development."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and developed responsive UIs with **React** and **Next.js**, adhering to usability and accessibility principles to enhance user interaction.\nImplemented API building and testing methodologies, utilizing **Postman** for effective debugging, resulting in streamlined API integrations.\nDeveloped high-quality components with **TypeScript** and **JavaScript**, ensuring attention to design details and exceptional user experience across the platform.\nFostered product thinking through collaboration with cross-functional teams, translating user needs into actionable development tasks.\nConducted code reviews and mentoring sessions for junior developers, leading to a **25%** increase in team productivity and skill enhancement.\nEmployed problem-solving skills to identify and debug front-end issues, achieving an **increase of 15%** in application performance and stability.\nManaged version control with efficient workflows, ensuring seamless integration and deployment cycles, enhancing team productivity by **30%**."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed responsive UI components using **React** and **Next.js**, leading to a **30%** increase in user engagement.\n• Utilized **JavaScript** and **TypeScript** to implement accessibility principles and usability principles, ensuring compliance with WCAG standards for **100%** of the new features.\n• Created and tested APIs using **Postman**, improving integration capabilities with third-party services by **25%**.\n• Engaged in debugging sessions to identify and resolve issues promptly, maintaining a bug resolution rate of **90%** in the sprint cycle.\n• Fostered product thinking during project discussions, resulting in a more user-centered design approach.\n• Applied strong attention to design details throughout the development process, enhancing overall user satisfaction.\n• Collaborated with cross-functional teams to gather requirements and provide solutions autonomously, impacting project timelines positively.\n• Participated in code reviews to uphold coding standards and quality assurance, ensuring optimal performance across all implemented features."
    }
  ],
  "skills": " **Programming Languages**\n\t JavaScript, TypeScript, Python\n\n **Frontend Frameworks**\n\t React, Next.js, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **Backend Frameworks**\n\t NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **API Technologies**\n\t RESTful API, GraphQL, API building and testing, HTTP, Postman\n\n **Databases**\n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **Cloud & Infrastructure**\n\t AWS, Azure, CI/CD pipelines\n\n **DevOps**\n\t Debugging, Autonomy\n\n **Other**\n\t UX/UI Design, Git, GitHub, responsive UI, accessibility principles, usability principles, product thinking, attention to design details, problem-solving, Testing Tools: NUnit, xUnit, Selenium, Moq, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis"
}