{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior HubSpot Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a results-driven Senior HubSpot Engineer, I possess a strong background in leveraging **HubSpot** to create and optimize CRM systems, including the management of **custom objects** and **deal pipelines**. With 8 years of full-stack development experience, I am adept at implementing **API** integrations and automation workflows using tools like **Zapier** and **Workato**. My technical proficiency in **JavaScript**, **HTML**, **CSS**, and **SQL** allows me to develop innovative solutions that enhance user experience and data management.\n\nI have a proven track record of building high-performance applications in the healthcare and financial sectors using modern frameworks such as **React**, **Next.js**, and **Vue**, along with backend technologies like **Node.js**, **FastAPI**, and **Django**. My extensive cloud experience with **Azure** and **AWS** complements my skills in automation and system integration. I am committed to data security and compliance, ensuring that all solutions meet industry standards. Additionally, my familiarity with structured data and third-party tools enhances my ability to deliver comprehensive **workflow** automation solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior HubSpot Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented integrations with **REST APIs** to seamlessly connect **HubSpot** with third-party tools and **QuickBooks**, enhancing CRM functionality and automation workflows for client engagement.\nConfigured and customized **CRM** solutions within **HubSpot** focusing on **custom objects** and **deal pipelines** to optimize sales processes, resulting in a **25%** increase in lead conversion rates.\nDeveloped and maintained automated workflows using **Zapier** and **Workato** to streamline data processes, significantly reducing manual entry time by **40%** and improving data accuracy.\nUtilized **SQL** to query and manage structured data, ensuring efficient data retrieval and reporting that aligned with business needs, supporting decision-making processes.\nCreated and managed frontend interfaces using **HTML**, **CSS**, and **JavaScript** to enhance user experience and engagement with HubSpot assets, ensuring compliance with modern web standards and responsive design principles.\nEstablished and documented best practices for API integration and automation strategies within **HubSpot**, promoting knowledge sharing and adherence to development standards across the team.\nCollaborated with cross-functional teams to identify and implement solutions that leverage data insights, resulting in a measurable impact on marketing and sales effectiveness.\nImplemented analytics and tracking mechanisms to monitor the performance of executed workflows and **API** integrations, providing actionable insights for continuous improvement.\nDeveloped comprehensive tests for all new integrations using best-practice methods to ensure robustness and reliability of automated processes, increasing overall system stability by **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Led the integration of **HubSpot** with various **third-party tools** and streamlined workflows by leveraging **APIs**, enhancing CRM systems for improved customer relationship management.\nDeveloped and maintained custom objects and deal pipelines within **HubSpot**, utilizing **SQL** for effective data retrieval and structured data management, enabling a **30%** increase in operational efficiency.\nImplemented automated workflows using **Zapier** and **Workato**, boosting team productivity and reducing manual tasks by **40%** across multiple departments.\nCreated dynamic web applications with **HTML**, **CSS**, and **JavaScript**, ensuring user-friendly interfaces are built to support **CRM** functionalities and enhance user experience.\nDesigned and executed API integrations, employing **REST APIs** to effectively connect **HubSpot** with **QuickBooks**, ensuring seamless transactional data flow and accuracy across financial systems.\nEducated the team on the best practices for data structure within **HubSpot**, leading to a significant reduction in data discrepancies and enhanced reporting capabilities.\nSupported ongoing training and development for team members on **HubSpot** functionalities and enhancing CRM tool utilization, leading to a **25%** improvement in overall user adoption rates."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and maintained **HubSpot** integrations with **REST APIs** to enhance CRM functionalities, streamlining automation of workflows and customizing objects to meet specific business requirements.\nEngineered dynamic deal pipelines utilizing **JavaScript** and **SQL** to create structured data representations, improving data accuracy and facilitating better reporting for the sales team.\nImplemented automation solutions via **Zapier** and **Workato**, significantly reducing manual tasks by 40% and enhancing the efficiency of marketing campaigns.\nDesigned user-friendly interfaces using **HTML**, **CSS**, and **JavaScript**, ensuring seamless integration with **HubSpot** to optimize user experiences and drive engagement across various customer touchpoints.\nManaged and configured third-party tools, including **QuickBooks**, to align with the CRM ecosystem, resulting in a 30% reduction in manual accounting errors.\nCreated and maintained comprehensive documentation for workflow automations and custom objects, ensuring clarity and adherence to best practices across the development team.\nCollaborated with cross-functional teams to execute comprehensive testing and quality assurance (QA) processes for CRM updates, leading to a **15%** increase in feature reliability post-deployment.\nOptimized API performance, achieving up to **20%** faster response times during high-traffic periods by implementing best practices in caching and data management strategies.\nConducted training sessions for team members on the implementation of **HubL** for advanced template development, enhancing the team's capability in designing custom functionalities within **HubSpot**.\nActively monitored and analyzed CRM metrics to drive informed decision-making and continuous improvements in workflow design and automation processes."
    }
  ],
  "skills": "**API Technologies:**\n\tAPI, REST APIs\n\n**Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular), SQL, HubL\n\n**Frontend Frameworks:**\n\tHTML, CSS, JavaScript\n\n**Backend Frameworks:**\n\tPython (FastAPI, Flask, Django)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQL\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tHubSpot, CRM, workflow, automation, custom objects, deal pipelines, structured data, third-party tools, QuickBooks, Zapier, Workato",
  "apply_company": "Somewhere"
}