{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Platform Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Platform Engineer with 8 years of experience, I possess a robust understanding of advanced algorithms, data structures, and cryptographic primitives, essential for developing high-performance blockchain systems. My expertise includes programming in **Go**, **Rust**, **C++**, and **Scala**, which I leverage to create efficient and scalable solutions that align with the latest in blockchain technology such as **EVM**, **Solidity**, and **Foundry**. \nI have successfully implemented CI/CD processes and release pipelines, enhancing the observability and environment orchestration of software deployments. My strong technical foundation is complemented by hands-on experience in microservices architecture and event-driven systems, ensuring robust application development. \nAdditionally, I excel in building high-performance applications in the healthcare and finance sectors with a tech stack that includes **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Node.js**, and **FastAPI**. My commitment to security and compliance is evident in my experience with industry standards like HIPAA, PCI DSS, and SOC 2. I am proficient in integrating real-time data processing and predictive analytics into enterprise-grade platforms, further showcasing my dedication to delivering cutting-edge technology solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Platform Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained **CI/CD** pipelines for blockchain applications using **GitHub Actions** and automated release management to ensure seamless deployments.\n- Led observability initiatives to enhance performance metrics in **Go** and **Rust** applications, optimizing system performance and reliability.\n- Implemented advanced algorithms and data structures for **Merkle trees** and cryptographic primitives, ensuring secure transactions within blockchain ecosystems.\n- Collaborated on architectural decisions to utilize **Solidity** and **Foundry** in building decentralized applications (dApps) on **EVM** platforms, delivering high-performance solutions.\n- Designed and executed environment orchestration strategies to streamline deployments across multiple environments, improving operational efficiency by **30%**.\n- Developed transaction processing modules using **C++** and **Scala**, enhancing system throughput and reducing latency by **25%**.\n- Integrated advanced cryptographic solutions into the platform, ensuring data integrity and security while adopting best practices and standards.\n- Conducted thorough performance analysis and optimization of existing blockchain systems, achieving sustained improvements in response times and user experience.\n- Engaged in continuous learning and adoption of new technologies to stay ahead in the rapidly evolving field of blockchain development."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Designed and implemented blockchain solutions utilizing **Solidity**, **Go**, and **Rust** to enhance financial platform security and efficiency.\n• Leveraged **EVM** to ensure smart contract interoperability, improving transaction processing speed by **30%**.\n• Developed algorithms and data structures to optimize system performance, reducing latency in transaction processing by **20%** and ensuring reliability.\n• Established CI/CD practices for smart contract deployment using **Foundry** and **release pipelines**, facilitating smoother and faster development cycles.\n• Integrated observability tools to monitor and enhance system performance, achieving **99.9% uptime** for critical financial systems.\n• Automated environment orchestration for development and production stages using **Terraform** and **Docker**, reducing provisioning time by **40%**.\n• Collaborated with cross-functional teams to maintain high standards in cryptographic primitives and Merkle trees to ensure data integrity and security across all transactions.\n• Explored and implemented Ethereum protocols to stay updated with the latest advancements in blockchain technology, ensuring the team remained at the forefront of innovation."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Engineered scalable solutions using **Go**, **Rust**, and **C++** for high-performance platforms, focusing on system performance, algorithms, and data structures to optimize global e-commerce operations.\nDeveloped blockchain-based features utilizing **Solidity** and **Yul**, implementing secure smart contracts and cryptographic primitives to enhance transactional reliability across the platform.\nEmployed **CI/CD** strategies to automate release pipelines and improve deployment efficiency, successfully reducing deployment times by **30%**.\nImplemented observability tools for platform monitoring, enabling proactive detection and resolution of performance bottlenecks, achieving a **50%** reduction in downtime.\nOrchestrated environments with **Foundry** and **EVM**, facilitating smooth integration of new features while ensuring stability and security across all deployment stages.\nCreated robust algorithms and optimized data structures to enhance data processing speed, yielding a **20%** improvement in data retrieval times for high-traffic workflows.\nApplied advanced techniques with **Merkle trees** to ensure data integrity and efficient verification processes within the platform's architecture, enhancing security measures.\nDesigned and optimized backend services for a global e-commerce platform using **Python** (**FastAPI**, **Django**) and **Node.js** (**NestJS**, **Express**), ensuring high availability, low latency, and scalability across key modules.\nLeveraged **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for distributed data storage, ensuring fast, fault-tolerant data access for high-traffic e-commerce workflows.\nImplemented feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes**, enabling controlled rollouts and risk mitigation during major platform updates."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Go, Rust, C++, Scala, Solidity, Yul\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tNginx, JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tblockchain, EVM, Foundry, observability, release pipelines, environment orchestration, algorithms, data structures, system performance, cryptographic primitives, Merkle trees",
  "apply_company": "Matter Labs"
}