{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior CVML Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior CVML Engineer with 13+ years of experience in developing high-performance applications, specializing in **Machine Learning**, **Computer Vision**, and AI-powered solutions. Proficient in **Python** and well-versed in key frameworks such as **TensorFlow**, **PyTorch**, and **Keras** for deep learning applications. Experienced in utilizing **C**/**C++** for algorithm optimization and enhancing model performance.\nDemonstrates strong capability in object detection, image recognition, segmentation, and scene understanding, with significant contributions to data evaluation methodologies. Skilled in technical documentation and mentoring, fostering knowledge transfer and professional growth within teams. Proven track record of delivering compliant solutions aligned with industry standards across healthcare and financial sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior CVML Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented advanced **MLLMs** and **GenAI** algorithms in the design of computer vision applications, focusing on **Machine Learning** techniques for enhanced image recognition and segmentation tasks.\nUtilized **Python** and framework libraries such as **TensorFlow (2.10)** and **PyTorch (1.12)** to build and optimize algorithms for object detection, scene understanding, and data evaluation.\nConducted rigorous algorithm optimization processes to improve model efficiency and accuracy, achieving a **20%** reduction in inference time compared to previous iterations.\nCreated comprehensive technical documentation outlining model architectures and workflows, facilitating knowledge transfer and mentoring opportunities within the team.\nCollaborated with cross-functional teams to develop real-time systems for image processing, leveraging **Computer Vision** insights to drive innovative solutions and model deployments in production.\nDesigned and executed rigorous training and validation pipelines, utilizing libraries like **Keras (2.6)** in conjunction with **TensorFlow** for effective model training strategies.\nLed the mentorship of junior engineers in machine learning principles and **Computer Vision** topics, fostering a collaborative learning environment and enhancing team capabilities.\nIntegrated image recognition capabilities with other backend systems using efficient REST APIs, ensuring seamless data flow and application responsiveness.\nUtilized best practices in **Algorithm Optimization** to enhance model performance indicators, contributing to increased accuracy and precision in real-world applications.\nExpanded the technical stack by incorporating ROS for robotic applications, thus diversifying the engineering team's expertise in **Computer Vision** and machine learning domains."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **TensorFlow** to develop and optimize machine learning algorithms for advanced applications in **Computer Vision**, leading to improvements in accuracy by over **20%**.\nApplied **C/C++** for algorithm optimization in high-performance environments, resulting in a **15%** reduction in processing time for real-time image recognition tasks.\nExecuted projects involving **MLLMs** and **GenAI** frameworks to enhance object detection and scene understanding capabilities in various applications.\nLeveraged **PyTorch** and **Keras** to implement deep learning models for tasks such as segmentation and image recognition, achieving **90%** accuracy on benchmark datasets.\nCreated technical documentation for algorithms and ML workflows, ensuring clarity and reproducibility for team members and stakeholders.\nMentored junior engineers on best practices in **Machine Learning** and **Computer Vision**, improving team skill levels and project outcomes significantly.\nConducted data evaluation processes to assess model performance and iteratively improve system effectiveness, identifying areas that required fine-tuning using advanced techniques.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **TensorFlow** to develop and optimize machine learning algorithms for **computer vision** applications, ensuring efficient performance and accuracy in tasks such as **object detection** and **image recognition**.\nLeveraged **MLLMs** and **GenAI** techniques to enhance model predictions, leading to a **20% improvement** in accuracy over previous implementations.\nDesigned and executed **algorithm optimization** strategies to refine computation efficiency, resulting in a **30% reduction** in processing times.\nDeveloped and maintained technical documentation for machine learning workflows, ensuring clarity and understanding for cross-functional teams and stakeholders leveraging these models.\nMentored junior team members in best practices surrounding **machine learning** and **computer vision**, fostering an environment of continuous learning and improvement.\nApplied techniques in **segmentation** and **scene understanding** to improve model capabilities in real-time applications, contributing to increased project success rates by **15%**.\nConducted thorough **data evaluation** and preprocessing steps to ensure high-quality input for models, leading to reliable output and improved decision-making processes.\nDeveloped **ROS** interfaces for integrating machine learning models into robotic systems, enhancing automation and robustness in operations.\nImplemented training and validation pipelines using **PyTorch** and **Keras**, streamlining the project lifecycle and ensuring high-quality model development.\nCollaborated on cross-functional projects to incorporate **computer vision** solutions into existing frameworks, utilizing **C/C++** for performance-critical components."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, C/C++\n\n **Backend Frameworks**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks**\n\tReact, Vue, Angular\n\n **API Technologies**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n **Serverless and Cloud Functions**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n **DevOps**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure**\n\tNginx, Let’s Encrypt, Certbot\n\n **Other**\n\tMLLMs, GenAI, Computer Vision, Machine Learning, MLflow, Airflow, Kubeflow, TensorFlow, PyTorch, Keras, ROS, Algorithm Optimization, Object Detection, Image Recognition, Segmentation, Scene Understanding, Data Evaluation, Technical Documentation, Mentoring",
  "apply_company": "Axon"
}