{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Software Engineer with 13+ years of experience delivering high-performance applications across the healthcare and financial industries. Proficient in **.NET**, **C#**, **Angular**, and **MS SQL Server**, with strong competency in **T-SQL**, **CSS**, and building **Web Services** and **REST APIs**. Experienced in adopting **Azure** for cloud-native application deployment and implementing **CI/CD** and **DevOps** practices to enhance development workflows. Knowledgeable in **Visual Studio** for efficient software development and skilled in creating robust **service-oriented architectures** and applying **design patterns** for scalable solutions.\n\nIn addition to primary expertise, I have hands-on experience in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, and am adept at both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I excel in building AI/ML-powered platforms that leverage predictive analytics, automation, and real-time processing, while ensuring compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. My background in MLOps includes model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed enterprise-level applications using **.NET** and **C#**, ensuring adherence to service-oriented architecture principles and design patterns.\n- Implemented robust **REST APIs** to facilitate seamless communication between client and server-side components, enhancing system interoperability.\n- Optimized data storage and retrieval utilizing **MS SQL Server** and **T-SQL**, improving query performance by **30%**.\n- Designed and crafted user interfaces with **Angular** and **CSS**, leading to increased user engagement by **25%**.\n- Established CI/CD pipelines with tools like **Azure DevOps**, resulting in a **40%** faster deployment cycle and improved code quality through automated testing and integration.\n- Conducted thorough application security assessments and enforced security protocols for data protection, complying with industry standards and regulations.\n- Collaborated with cross-functional teams to drive business logic implementation that meets stakeholder requirements and provides robust features.\n- Utilized **DevOps** practices to streamline development processes, enhancing team productivity and collaboration.\n- Created and maintained technical documentation to facilitate knowledge transfer and ensure ongoing support for the software ecosystem.\n- Leveraged **Visual Studio** for efficient debugging and application development workflows, maintaining code quality and reducing issues in production environments.\n- Integrated real-time data reporting functionalities, utilizing modern JavaScript frameworks to deliver instantaneous insights to end-users."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **.NET** and **C#** to implement and maintain service-oriented architectures, ensuring optimized business logic implementation within financial applications.\nDesigned and developed robust **REST APIs** and **Web Services** to support seamless communication between front-end applications and back-end systems, enhancing integration with **MS SQL Server** and **T-SQL** for data management.\nCollaborated effectively with cross-functional teams to deploy CI/CD pipelines using **Azure DevOps**, ensuring high-quality code integration and delivery across multiple environments.\nUtilized **Angular** for building dynamic single-page applications, resulting in a **30%** increase in user engagement due to improved performance and responsiveness.\nEmployed **CSS** and JavaScript strategies to enhance front-end user experiences, achieving a **25%** reduction in page load times across applications.\nAdopted **Visual Studio** for advanced debugging and development, increasing overall efficiency by **15%** in code delivery timelines.\nApplied design patterns and best practices for security and data protection, ensuring the integrity and confidentiality of sensitive financial data within all software solutions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed robust Web Services and REST APIs integrating **.NET** and **C#**, ensuring secure, efficient, and scalable microservices architecture for the e-commerce platform.\n• Collaborated with database teams to optimize MS SQL Server and T-SQL queries, achieving a **30%** increase in query performance and ensuring data integrity.\n• Implemented CI/CD pipelines using **Azure DevOps**, streamlining code deployment processes and reducing release cycle time by **25%**.\n• Engineered responsive UI components using **Angular** (latest version), CSS, and HTML5 to enhance user experience and ensure compliance with accessibility standards.\n• Applied Design Patterns in application architecture to improve maintainability and code reusability across various modules, resulting in a **15%** reduction in technical debt.\n• Collaborated across teams to ensure Security and Data Protection protocols were maintained throughout the application lifecycle, adhering to GDPR compliance standards.\n• Integrated service-oriented architecture principles to enhance interoperability among different services and improve system reliability.\n• Leveraged **Visual Studio** for extensive debugging and testing, ensuring high code quality and timely feature releases.\n• Engaged in DevOps practices to foster a culture of continuous improvement and operational excellence within the development team."
    }
  ],
  "skills": "  **Programming Languages:**\n\t.NET, C#, JavaScript, Python\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n  **Frontend Frameworks:**\n\tAngular, React, Vue, CSS\n\n  **API Technologies:**\n\tREST APIs, Web Services\n\n  **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MS SQL Server, MongoDB (Gaming), Redis\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\tAzure, AWS\n\n  **Other:**\n\tService-oriented architecture, Design patterns, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Security and data protection, Business logic implementation"
}