{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Internship",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Proficient in **Python**, **gRPC**, and **REST APIs** with over 13 years of experience in full stack development, delivering high-performance applications in healthcare and financial sectors. Adept at leveraging **Kubernetes** and **Docker** for container orchestration and deployment within CI/CD pipelines, ensuring seamless microservices integration. Demonstrated ability in problem-solving and team collaboration, effectively utilizing modern development practices to simplify complex processes.\nExperienced in both frontend and backend development using **React**, **Next.js**, **Vue**, and **Node.js**, as well as backend frameworks like **FastAPI** and **Django**. Strong background in building AI/ML-powered platforms and deploying cloud-native systems on **AWS** and **Azure**. Committed to compliance-driven development, aligning with HIPAA, FHIR, and PCI DSS standards while maintaining high operational excellence.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Internship",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Collaborated with teams to design and implement **REST APIs** and **gRPC** services, enhancing connectivity and usability across systems.\n- Developed full-stack applications using **Python** and **Rust** for various projects, ensuring high performance and reliability.\n- Designed and executed **CI/CD** pipelines to automate deployments, integrating tools such as GitHub Actions and CircleCI to streamline processes.\n- Worked on transforming monolithic architectures into **microservices**, employing **Docker** and **Kubernetes** for efficient deployment and scalability.\n- Brought problem-solving skills to address complex technical challenges, leading to improved system efficiencies and integration.\n- Engaged in team collaboration sessions, contributing to a united workflow and open communication for project success.\n- Enhanced English proficiency to effectively communicate technical concepts and collaborate with diverse teams.\n- Simplified complex processes to improve user experience and system functionality, demonstrating a keen eye for efficient design."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **gRPC** for developing scalable microservices as part of an internship project to enhance application performance and simplify architecture.\nCollaborated with team members to design and implement **REST APIs** in a **Microservices** architecture, improving service efficiency by **25%**.\nAssisted in the transition of legacy systems to **Docker** and **Kubernetes**, increasing deployment frequency by **30%**.\nContributed to CI/CD pipelines that automated build and deployment processes, achieving a **40%** reduction in release cycles.\nParticipated in problem-solving sessions to optimize application features and resolve service disruptions effectively, enhancing user experience.\nSupported team collaboration by documenting processes and providing presentations in **English**, aiding in project understanding and transparency.\nEngaged in research of **Rust** features for potential future use in application performance enhancements, demonstrating adaptability and eagerness to learn new technologies."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** for backend service development, fostering collaboration and problem-solving skills to optimize system architecture in a microservices environment.\nImplemented **REST APIs** and **gRPC** for seamless integration and communication between services, ensuring robust and scalable APIs for various features.\nParticipated in container orchestration using **Kubernetes** and **Docker** for efficient deployment processes, enhancing CI/CD workflows and ensuring application scalability.\nCollaborated effectively with cross-functional teams to improve existing services and address technical challenges, showcasing strong team collaboration abilities.\nContributed to simplification efforts of application processes using best practices in software design, equipped to handle complex workflows in both monolithic and microservices architectures.\nEngaged in ongoing learning to enhance proficiency in modern software development, particularly focusing on **CI/CD** to streamline the development lifecycle and improve application delivery.\nDemonstrated fluency in English for effective communication of technical ideas and project concepts during team meetings.\nPlayed an active role in debugging and troubleshooting using analytical skills, contributing to improved operational efficiencies and system performance."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Rust\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tgRPC, REST APIs\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Problem-Solving, Team Collaboration, English Proficiency, Simplification, Microservices, Monolithic Architecture"
}