{
  "name": "Tomasz Lee",
  "role_name": "Senior Hardware Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Senior Hardware Engineer with 9+ years of experience in high-performance computing (HPC) and cloud solutions. Proficient in ESD compliance, inventory management, and RMA processes. Technical expertise includes CPU, GPU, NIC, and PCIe integration. Strong background in scripting and automation with **Python** and **Bash**. Proven ability to optimize system performance and enhance the overall infrastructure quality. Skilled in collaborating with cross-functional teams to achieve project goals and deliver innovative hardware solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Hardware Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Focused on hardware performance improvement by analyzing **GPU** and **CPU** configurations, leading to a **25%** increase in processing efficiency.\nDeveloped custom **Python** scripts to automate testing procedures for **NIC** and **PCIe** interfaces, reducing validation time by **30%**.\nConducted thorough evaluations of **HPC** systems to optimize resource allocation and performance metrics based on various configurations.\nLed initiatives for implementing **Cloud** solutions to enhance remote accessibility and resource management, contributing to a **40%** reduction in operational costs.\nEnhanced data integrity during **RMA** processes through efficient inventory management techniques.\nUtilized **Bash** for system-level automation scripts, ensuring consistent performance across **Ethernet** connections.\nImplemented robust testing protocols for **ESD** protection systems to increase reliability under varied operational conditions.\nCollaborated with cross-functional teams to integrate **InfiniBand** protocols, improving data transfer rates significantly.\nGenerated detailed reports on system performance using advanced analytical tools, increasing operational insights and strategic planning."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Leveraged **Python** scripting for automating hardware testing processes, resulting in a **20%** reduction in validation time.\nImplemented inventory management techniques within **cloud** environments, enhancing hardware resource allocation and tracking efficiency.\nConducted performance evaluations of **GPU** and **CPU** systems, yielding a **15%** increase in processing speeds through efficient resource optimization.\nUtilized **PCIe** technology to enhance data throughput on high-performance computing systems, improving overall system reliability.\nDeveloped Bash scripts to streamline hardware configuration processes, significantly reducing setup times by **25%**.\nEngineered networking solutions using **Ethernet** and **InfiniBand** to facilitate robust communication among devices, ensuring data integrity and speed.\nPerformed risk assessments and managed **RMA** (Return Merchandise Authorization) processes to maintain quality control over hardware components.\nCollaborated with cross-functional teams to define system requirements for new hardware, ensuring alignment with project goals and timelines.\nConducted hands-on testing of **HPC** (High-Performance Computing) setups to validate functionality and efficiency, documenting results for future improvements.\nProvided mentorship and training to junior engineers on best practices for hardware design and testing protocols, enhancing team capability.\n"
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and optimized high-performance computing (HPC) solutions to enhance processing capabilities by **30%** using **Python** and **Bash** scripts.\n• Collaborated with cross-functional teams to design and implement **Ethernet** and **InfiniBand** networking solutions, increasing data transfer rates by **40%**.\n• Managed hardware inventory, ensuring timely procurement and compliance for **NICs**, **PCIe** cards, and other components, resulting in a **15%** reduction in costs.\n• Implemented robust testing protocols for hardware components to mitigate **ESD** risks, leading to a **25%** reduction in failure rates.\n• Designed and executed RMA processes for defective components, reducing turnaround time by **50%**.\n• Contributed to continuous improvement initiatives for CPU and GPU architectures, enhancing overall system performance.\n• Assisted in the transition of cloud-based infrastructure, leveraging virtualization technologies to optimize resource usage and performance.\n• Participated in technical reviews and documentation sessions, ensuring all design specifications and standards are met effectively."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n **Frontend Frameworks**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\tAWS, Azure\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tCI/CD pipelines\n\n **Cloud & Infrastructure**\n\tCloud\n\n **Other**\n\tUX/UI Design, Git, GitHub, Redux, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, GPU, CPU, NIC, PCIe, ESD, Ethernet, InfiniBand, HPC, inventory, RMA\n",
  "apply_company": "Mistral AI"
}