{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Inside Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Inside Sales Engineer with 13+ years of technical expertise, adept in leveraging **application technology** to drive customer engagement and enhance product development. Proven ability to communicate complex technical concepts effectively, ensuring seamless collaboration within teams and with clients. Strong problem-solving skills developed through a robust background in full stack development, utilizing **JavaScript/TypeScript**, **Python**, and **Flutter** alongside frameworks and libraries such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms, deploying on **AWS** and **Azure**, and implementing microservices. Committed to aligning solutions with compliance standards. Possesses valuable insights from the healthcare and financial sectors, enhancing customer relationship management and project management capabilities.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Inside Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **technical knowledge** to articulate complex product concepts and solutions in the **food & beverage industry**, enhancing customer engagement through effective **communication skills** and **team collaboration**.\nUtilized **customer relationship management (CRM)** tools to manage sales pipelines and nurture client relationships, resulting in a **25%** increase in customer retention.\nDeveloped product demonstrations and technical presentations that conveyed intricate application technologies, significantly streamlining the sales process.\nConducted market research and competitive analysis to support **marketing** initiatives and align product development with customer needs, boosting productivity by **30%**.\nCollaborated with cross-functional teams in **project management** to ensure timely delivery of solutions, emphasizing problem-solving capabilities to address client challenges.\nCreated and delivered training materials for sales teams on product features and technological advancements, increasing sales force effectiveness by **15%**.\nParticipated in strategic planning sessions, influencing decision-making in **product development** to align with market demands and client feedback.\nPlayed a key role in **offering preparation**, providing insights on product specifications, pricing, and market potential to enhance proposal accuracy and client satisfaction.\nMaintained an understanding of the latest trends in application technology, ensuring that sales strategies incorporate innovative features relevant to the industry."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **technical knowledge** to effectively communicate complex product details and facilitate customer relationship management for financial software solutions.\nDemonstrated **team collaboration** by working closely with cross-functional teams to deliver impactful application technology that meets customer requirements and enhances user experience.\nApplied **project management** skills to oversee the development and deployment of core financial platforms, ensuring timely delivery and adherence to specifications, while managing risks and resources effectively.\nLeveraged **problem-solving** abilities to troubleshoot and enhance financial applications, contributing to modernization efforts that improved scalability for **high-volume** transactional systems.\nEnabled **sales** efforts by providing technical presentations and demonstrations of interactive financial applications built with **React (18)**, **Vue 3**, and **Next.js**, showcasing key strengths to potential clients.\nExecuted **product development** strategies by creating real-time analytics dashboards using **D3.js** and **Power BI Embedded**, leading to a **30%** improvement in operational insights and anomaly detection capabilities.\nDeveloped and deployed a robust event-driven architecture utilizing **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows with **99.9%** reliability for payments and alerts.\nDesigned and implemented ETL pipelines employing **Python**, **Apache Airflow**, and **Azure Data Factory** for efficient data processing, improving data ingestion efficiency by **40%**.\nBuilt advanced machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, resulting in a **25%** increase in the proactive identification of suspicious transactions through innovative algorithms."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized strong **technical knowledge** to collaborate with sales teams, ensuring alignment on product capabilities and customer needs while optimizing workflows for e-commerce applications.\nDemonstrated effective **communication skills** by serving as a liaison between technical teams and sales, translating complex technical concepts into clear solutions suited for customer queries and project planning.\nEngaged in **team collaboration** to refine product offerings, enhancing the customer experience and driving **sales** through tailored solutions based on market insights.\nImplemented innovative **problem-solving** techniques to address customer requirements and streamline processes that cater to the food & beverage industry, leading to a **20%** increase in conversion rates.\nDeveloped technical sales presentations that highlighted the application of **application technology** in customer solutions, resulting in increased engagement and interest from prospective clients.\nManaged and enhanced the Customer Relationship Management (CRM) system, contributing to improved customer data accessibility and project tracking with a **30%** efficiency gain.\nParticipated in **project management** to ensure timely updates and responsiveness to customer feedback, leading to a **15%** reduction in project delivery timelines.\nContributed to **product development** discussions by providing insights on customer requirements and market trends, ultimately influencing product roadmap and marketing strategies.\nOptimized food & beverage industry offerings, leveraging insights to prepare tailored solutions that align with customer expectations and enhance service delivery.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django, JavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\t\n\n **Frontend Frameworks:**\n\t\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\t\n\n **Other:**\n\tSales, Technical knowledge, Communication skills, Team collaboration, Marketing, Product development, Application technology, Customer relationship management, Project management, Food & beverage industry experience, Problem-solving, Offering preparation"
}