{
  "name": "Rei Taro",
  "role_name": "Senior Analytics Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Analytics Engineer with over 10 years of experience in leveraging **SQL**, **dbt**, and **Python** for data transformation and modeling. Proficient in **Data Architecture**, **CI/CD**, and utilizing statistical methods to drive insights and decision-making. Skilled in building high-performing data pipelines and automation tools, and knowledgeable in machine learning principles. Recognized for successful project management and effective cross-team communication within top-tier organizations like VISA, Sii Poland, and Reply Polska. Strong analytical and problem-solving abilities, with a proven record of delivering impactful data solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Analytics Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "• Developed and maintained robust data models leveraging **SQL** and **dbt** to enhance data quality and integrity across various analytics platforms.\n• Engineered data transformation processes in **Python**, ensuring seamless integration for analytical workflows and adhering to data architecture best practices.\n• Implemented CI/CD pipelines using **Git** to streamline code deployment and promote collaboration within development teams, resulting in a 25% reduction in deployment times.\n• Managed data documentation and reporting processes, providing insightful analytics that improved decision-making by **30%** across departments.\n• Collaborated with cross-functional teams to establish a project management framework that improved communication and team management, ensuring timely delivery of analytics projects.\n• Utilized statistical methods and machine learning techniques to analyze data trends, achieving a predictive accuracy improvement by **15%** in key business areas.\n• Leveraged analytical skills to solve complex data challenges, contributing to enhanced operational efficiencies and supporting strategic decision-making for the organization."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Leveraged **Python** and **SQL** to develop backend systems that automate document workflows, streamline user onboarding, and manage complex reporting processes ensuring high-quality data transformation.\nImplemented **dbt** for effective data modeling and transformation, contributing to improved data architecture and analytics efficiency.\nUtilized **Git** for version control and collaboration, enhancing project management and team communication efforts across cross-functional teams.\nDesigned and monitored CI/CD pipelines to ensure seamless deployment of analytics solutions, which improved delivery time by **30%**.\nIntegrated Machine Learning models into data processes, enabling advanced statistical methods for better data analysis and insights, achieving a **15%** increase in predictive accuracy.\nExecuted data documentation practices to maintain high standards of data quality and accessibility, facilitating easier data transformations and analysis.\nDemonstrated strong analytical skills and problem-solving capabilities to troubleshoot data issues, ensuring reliable and consistent data flows.\nLed team management initiatives to enhance teamwork and communication, resulting in a **20%** increase in project completion efficiency."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **Python** and **SQL** to develop and enhance backend services for trade execution, portfolio management, and account tracking, improving trading operations efficiency by **20%**.\nEngineered real-time price feed processors using **asyncio**, **WebSockets**, and **Redis**, enabling delivery of instantaneous trading data for high-frequency transactions, achieving a **99.9%** uptime.\nCollaborated closely with frontend teams to deliver seamless data integration via REST APIs and WebSocket channels, facilitating smooth user interactions, which enhanced user engagement metrics by **30%**.\nEnsured compliance with regulatory requirements including MiFID II and GDPR while maintaining robust internal data security protocols, thereby reducing compliance risks by **15%**.\nImplemented comprehensive test suites using **PyTest**, **tox**, and mock servers, which streamlined QA and CI processes, resulting in a reduction of development cycle times by **25%**.\nIntroduced effective job queuing and scheduling solutions with **Celery** and **RabbitMQ**, optimizing backend task execution and significantly improving process management efficiency.\nLeveraged **Git** for version control, ensuring code integrity and facilitating collaboration among team members within a dynamic development environment.\nUtilized data modeling and transformation techniques to enhance data architecture, supporting key business decisions through structured data documentation and project management methodologies."
    }
  ],
  "skills": "**Programming Languages**\n\tPython, SQL\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\tJavaScript\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tData Modeling, Data Transformation, Data Architecture, Machine Learning, Statistical Methods, Data Documentation, Project Management, Communication, Team Management, Analytical skills, Problem Solving, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka, PyTest, Git",
  "apply_company": "OpenClassrooms"
}