{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior FullStack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior FullStack Engineer with 8 years of experience, I deliver high-performance solutions utilizing **JavaScript**, **TypeScript**, **React**, **Next.js**, **Vercel**, **Tailwind CSS**, and **PostgreSQL**. I leverage advanced techniques in **AI**, particularly in **LLM**, **OpenAI**, and **Anthropic**, to optimize applications for automation and data pipelines. My expertise includes developing responsive and user-friendly interfaces while ensuring robust UI/UX design principles. Additionally, I implement **async operations** and **job queues** to enhance application performance.\n\nMy experience encompasses the full stack with a strong focus on building capabilities for **image generation**, **context engineering**, **agentic AI**, and both **video** and **audio generation**. I have successfully led enterprise-grade projects with **AI optimization** and explored innovative solutions involving **vector databases** and **embeddings**. I possess a solid foundation in CI/CD practices and thorough knowledge of compliance standards, ensuring secure application development aligned with industry regulations.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and implemented responsive and user-friendly UIs using **React** and **Next.js** (17-18), focusing on optimal UI/UX tailored for healthcare and financial applications.\nDeveloped automated data pipelines and job queues using **PostgreSQL**, ensuring efficient management and retrieval of large datasets and enhancing async operations for seamless user experiences.\nArchitected and deployed scalable **RESTful APIs** for various applications, emphasizing performance improvements and security best practices in compliance with AI optimization and regulatory standards.\nIntegrated advanced capabilities into applications with **AI** tools and models, utilizing **OpenAI** and other LLM frameworks for generating intelligent responses and context engineering to enhance user interaction.\nUtilized **Figma** for designing high-fidelity mockups and prototypes that facilitate the translation of user requirements into functional designs, ensuring responsive design across devices.\nCollaborated on incorporating image and audio generation features, leveraging innovative technologies to create enriched, multi-media experiences in financial and healthcare platforms.\nDeveloped and maintained cloud-native architectures using **Supabase** and **Vercel**, enabling rapid deployment and scaling of applications while ensuring data security and integrity.\nLead initiatives for effective automation strategies within the software development lifecycle using **Git**, enhancing version control and collaboration among team members.\nImplemented advanced search solutions with **vector databases** and **embeddings** to facilitate quick access and retrieval of critical information across healthcare records and financial documents.\nContributed to client-facing applications with tailored integration of **Tailwind CSS** for advanced styling and responsiveness, ensuring high-quality visual presentation and performance.\nEstablished communication protocols and onboarding practices for team members, focusing on improving maintenance of codebases and adherence to coding standards for future scalability.\nEngaged in continuous testing and quality assurance practices using industry-standard tools to assure compliance with project deadlines and performance expectations."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Developed dynamic, user-friendly applications using **React (18)**, **Next.js**, and **TypeScript**, ensuring responsive design and UI/UX optimization for financial dashboards and admin portals.\n• Led the modernization of financial platforms by implementing a robust microservices architecture utilizing **Node.js (Express/NestJS)** and **Python (Django/FastAPI)**, resulting in a **30%** improvement in scalability and maintainability for high-volume transactions.\n• Created and integrated automation tools and **data pipelines** for real-time and batch data processing, employing **Apache Airflow** and **Azure Data Factory** for enhanced efficiency in financial operations.\n• Built and orchestrated ETL pipelines for the seamless ingestion of financial data from internal and third-party sources, improving data accessibility by **25%**.\n• Integrated **PostgreSQL** and **Supabase** for reliable data storage solutions, enabling efficient handling of **10,000+** transactions per second in a high-demand environment.\n• Developed real-time analytics dashboards leveraging **D3.js** and **Power BI Embedded**, enabling operational teams to track financial activity, detect anomalies, and derive actionable insights in under **5 seconds**.\n• Implemented AI/ML-powered solutions, utilizing tools like **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, for proactive fraud detection and risk management, enhancing fraud detection accuracy by **40%**.\n• Spearheaded the integration of **job queues** and **async operations** using **Kafka** and **RabbitMQ** to support real-time event processing for transactions, alerts, and compliance workflows, enhancing system responsiveness and reliability.\n• Designed and orchestrated ML pipelines for various predictive modeling tasks including credit scoring and churn prediction, optimizing model inference directly into backend services to enable real-time decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **React** in developing robust full-stack applications, creating user-interfaces with **Next.js** and **Tailwind CSS** to ensure fast, responsive experiences for e-commerce users.\nDeveloped and optimized data pipelines with **PostgreSQL** and **Supabase**, implementing efficient **async operations** and **job queues** to support high-volume transactions and enhance backend performance.\nImplemented responsive design and UI/UX best practices through rigorous testing and user feedback, using tools like **Figma** to prototype and refine interfaces for mobile and web platforms, ensuring compliance with WCAG 2.1 standards.\nEngineered and integrated **APIs** to facilitate smooth interactions between frontend and backend, optimizing data retrieval and enhancing user engagement in the shopping experience.\nLeveraged cutting-edge AI technologies and frameworks for **AI optimization** and personalization, exploring solutions from **OpenAI** and **Anthropic** to deliver tailored product recommendations and enhance customer satisfaction.\nCollaborated in a cross-functional team environment, employing **Git** for version control and project management practices to streamline deployment processes, achieving a deployment frequency of more than **2 times/week**.\nOrchestrated real-time data tracking and automation of workflows using efficient asynchronous patterns, effectively reducing processing time by up to **30%** and improving overall system responsiveness.\nMonitored application performance and user engagement metrics, making necessary adjustments based on data analysis to ensure sustained platform enhancement and user retention rates exceeding **85%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, Tailwind CSS, Figma, responsive design, UI/UX\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, vector databases, Supabase\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose, Git\n\n**Cloud & Infrastructure:**\n\tNginx, Certbot, CI/CD & Infrastructure as Code\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, AI, LLM, OpenAI, Anthropic, Google, image generation, context engineering, agentic AI, data pipelines, automation, async operations, job queues, AI optimization, video generation, audio generation, embeddings",
  "apply_company": "Crypto Banter"
}