{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Fullstack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Fullstack Engineer with 10+ years of experience in delivering high-performance software solutions, specializing in **.NET Core**, **C#**, and **SQL Server**. Demonstrated expertise in building scalable applications using **React**, **Angular**, **Node.js**, and cloud services including **AWS**. Experienced in creating efficient architectures leveraging MVC2 and MVC5 frameworks and committed to continuous improvement and teamwork, while excelling in remote work environments. Proven track record in developing applications that are secure, maintainable, and compliant with industry standards.\nAlso proficient in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on experience across the full stack using **Next.js**, **Vue**, **FastAPI**, and **Django**. Adept in cloud-native application deployment, and skilled in microservices architecture, event-driven systems, CI/CD automation, and embedding AI/ML capabilities for enhanced analytics and automation. Passionate about driving impactful solutions through technically sound engineering practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and maintained robust web applications using **.NET Core** and **C#**, seamlessly integrating with SQL Server for efficient data management and retrieval, delivering projects with 99% uptime.\n•\tArchitected user-friendly interfaces with **React** and **Angular**, ensuring a responsive design and a smooth user experience, leading to a 30% increase in user engagement.\n•\tImplemented RESTful APIs and server-side logic with **Node.js**, enhancing system performance and reducing response time by 15% through code optimization and efficient resource management.\n•\tLed efforts to improve teamwork and foster collaboration among team members, resulting in a 25% enhancement in project delivery time through effective communication and agile methodologies.\n•\tPioneered continuous improvement initiatives by integrating best practices and feedback loops, contributing to increased code quality and development speed by 20%.\n•\tAssisted in remote work autonomy by establishing clear documentation and effective version control processes, resulting in a 40% reduction in onboarding time for new team members.\n•\tUtilized **AWS** for deploying applications and managing resources, ensuring scalability to handle traffic spikes during peak times, achieving a 50% reduction in infrastructure costs.\n•\tCollaborated with cross-functional teams to design and execute multi-environment deployments, utilizing CI/CD pipelines for consistent and rapid rollouts as part of enterprise-level DevOps practices.\n•\tParticipated in code reviews and pair programming sessions to uphold coding standards and facilitate knowledge sharing among team members, leading to a collaborative work culture."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **.NET Core** and **C#** to enhance backend services, focusing on scalability and resilience in large-scale financial applications.\nCollaborated effectively within cross-functional teams to deliver integrated solutions while exercising **teamwork** and promoting **continuous improvement** in development processes.\nDeveloped front-end applications using **React** and **Angular**, focusing on creating dynamic user interfaces for financial services, achieving an overall performance increase of **30%** in user engagement metrics.\nImplemented robust database solutions leveraging **SQL Server** for optimized data storage and retrieval, improving query performance by **50%** in high-traffic applications.\nAdeptly handled asynchronous programming and event-driven architecture utilizing **Node.js** to ensure smooth transactions across multiple services, resulting in an increase in transaction throughput by **20%**.\nMaintained autonomy in remote work environments, delivering projects consistently within budget and timeline constraints, contributing to a **15%** reduction in project delivery times.\nParticipated in the evolution of the development lifecycle with **MVC2** and **MVC5** frameworks, ensuring code maintainability and adherence to modern development practices."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed robust, full-stack applications using **.NET Core** and **C#** to enhance user experience and operational efficiency in a high-traffic environment.\nImplemented backend solutions with **SQL Server** ensuring efficient data management and retrieval processes for over **10 million** transactions monthly.\nCollaborated effectively in **teamwork** settings to design user interfaces with **React** and **Angular**, achieving a responsive design that improved user engagement by **25%**.\nUtilized **Node.js** for server-side scripting, creating APIs that supported over **1000** simultaneous connections, ensuring low latency.\nLeveraged **AWS** cloud services for deploying applications, ensuring high availability and disaster recovery planning, leading to a reduced downtime of less than **0.5%**.\nApplied the MVC2 and MVC5 frameworks to structure applications effectively, facilitating easier maintenance and pushing updates multiple times a week.\nActively participated in continuous improvement processes, identifying performance bottlenecks and implementing enhancements that improved application response times by **30%**.\nDemonstrated effectiveness in **remote work autonomy** while managing project timelines and deliverables, successfully delivering **5** major projects under strict deadlines."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Python, JavaScript/TypeScript\n\n **Frontend Frameworks:**\n\tReact, Angular, Vue\n\n **Backend Frameworks:**\n\t.NET Core, FastAPI, Flask, Django, Node.js\n\n **API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tSQL Server, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure\n\n **Other:**\n\tMVC2, MVC5, MLflow, Airflow, Kubeflow, teamwork, continuous improvement, remote work autonomy, Nginx, Certbot",
  "apply_company": "Not specified"
}