{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Fullstack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Fullstack Engineer with 13+ years of experience in delivering high-performance applications, specializing in **React**, **TypeScript**, and **Node.js**. Proficient in building and maintaining robust systems using **HTML**, **CSS**, **Redux**, and server-side technologies such as **Express**. Demonstrated expertise in database management with **PostgreSQL** and **MongoDB**, and implementing REST and GraphQL APIs.\nSkilled in deploying cloud-native solutions on **AWS** and enhancing application performance while ensuring security compliance across multiple standards. Strong focus on CI/CD practices for streamlined development and deployment processes.\nIn addition, experienced in leveraging **Python** for backend development, and utilizing front-end frameworks for responsive design. Successful track record in aligning solutions with compliance standards, and building AI/ML-powered platforms with strong MLOps knowledge.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **React (17-18)** and **TypeScript** to develop responsive front-end applications, ensuring seamless user experience and performance optimization.\nImplemented state management using **Redux** for efficient data flow and performance tracking across applications.\nDesigned and built back-end services with **Node.js** and **Express**, exposing secure **REST** and **GraphQL** APIs to enhance data accessibility and interactivity.\nConstructed CI/CD pipelines for streamlined deployment processes, utilizing tools like **Firebase** for crash analytics and performance monitoring.\nImplemented data storage and management solutions using **PostgreSQL** and **MongoDB**, ensuring robust data integrity and high performance under load.\nEnhanced application security by integrating best practices and tools, achieving a **95%** pass rate on security checks and compliance validations.\nDeveloped and maintained application performance benchmarks, achieving a **20%** increase in load speed as measured by **Lighthouse** metrics.\nEnsured high-quality code and documentation through rigorous testing strategies using **Jest** for unit tests and **Cypress** for end-to-end testing.\nCollaborated with cross-functional teams to align on project goals and requirements, facilitating efficient communication and timely delivery of project milestones.\nContributed to the development of user interface components in **HTML** and **CSS**, adhering to design specifications and ensuring accessibility standards were met with tools like **Axe**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)**, **TypeScript**, **Redux**, **HTML**, and **CSS** to build interactive, high-performance front-end applications for financial tools and admin panels, ensuring responsive design and user engagement.\nImplemented server-side functionalities using **Node.js (NestJS/Express)**, integrating **REST** and **GraphQL** APIs to enhance application interactivity and data retrieval.\nOptimized database interactions by managing **PostgreSQL** and **MongoDB** systems, improving query performance by up to **30%** and ensuring data security and integrity.\nLed the deployment of CI/CD pipelines utilizing tools for continuous integration and delivery, significantly reducing deployment times by **40%**.\nModernized core financial platforms by migrating to **microservices architecture**, enhancing scalability and performance for high-volume transactional systems processing over **1 million** transactions monthly.\nDeveloped secure and scalable back-end services in **Python** (FastAPI, Django), focusing on performance and security compliance best practices.\nDesigned and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring seamless asynchronous communication across critical workflows.\nEstablished industry-standard performance and security tests utilizing **Lighthouse** and **Axe**, achieving an average performance score improvement of **20%**.\nDelivered real-time analytics dashboards with **D3.js** and **Power BI Embedded**, providing insights into transaction patterns and anomalies for operational efficiency.\nCreated efficient ETL pipelines for ingesting financial data using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time data processing workflows.\nBuilt and deployed machine learning models for fraud detection with **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive identification of suspicious activities based on user behavior and transactions.\nIntegrated ML pipelines for real-time credit scoring and churn prediction, leveraging **MLflow** and **Airflow** to support model inference in backend services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed scalable and high-performance applications using **React** (18) and **TypeScript**, enhancing user experiences across web and mobile platforms.\n• Engineered backend services with **Node.js** (Express) and **Python** (Django, FastAPI), focusing on responsive data retrieval via **PostgreSQL** and **MongoDB**.\n• Integrated RESTful and GraphQL APIs to facilitate smooth data transactions between frontend and backend, ensuring modular architecture and clear data flow.\n• Employed CI/CD strategies to streamline deployments, boosting system reliability and reducing release times by up to **50%**.\n• Implemented security best practices using OAuth 2.0 and secure coding standards, ensuring data protection and compliance with GDPR for over **100,000** user accounts.\n• Conducted performance monitoring through tools like **Lighthouse** and **Axe**, optimizing applications to achieve at least **90%** scores in performance metrics.\n• Harnessed caching techniques to improve application speed, achieving a **30%** reduction in database load via **Redis** for session management.\n• Engaged in rigorous testing protocols to maintain code quality, with **100%** unit test coverage in critical modules employing **Redux** for state management.\n• Collaborated with cross-functional teams to define project requirements and deliver results with a focus on both front-end and back-end integration, contributing to platform stability and user satisfaction.\n• Drove the adoption of modern UI frameworks and best practices for responsive design, improving accessibility compliance with WCAG 2.1 standards."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n**Frontend Frameworks:**\n\tReact, Redux, HTML, CSS\n\n**Backend Frameworks:**\n\tNode.js, Express\n\n**API Technologies:**\n\tREST, GraphQL\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, Terraform, Ansible, Helm\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, RDS, S3, Azure: App Services, Blob Storage\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Performance, Security, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Firebase, Lighthouse, Axe, Redis",
  "apply_company": "AccessiWay"
}