{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Python Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Results-driven Python Engineer with 13+ years of expertise in developing scalable applications and implementing robust software development best practices. Proficient in **Python**, **Django**, **SQL**, and adept in **CI/CD** practices with a strong focus on **Git** for version control. Experienced in building and consuming **REST APIs** and **GraphQL** services to optimize application performance.\nSkilled in deployment and orchestration on cloud platforms including **AWS** and **Kubernetes**, ensuring high availability and reliability of software solutions. Committed to maintaining coding standards through thorough **code reviews**, unit testing, and integration testing, fostering a culture of quality and risk mitigation within teams.\nDemonstrated success in technical debt management and mentorship, guiding junior developers in software design patterns and best practices. Background in creating AI/ML-powered applications enhances capabilities in delivering innovative solutions.\n",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Python Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** with **Django** to design and develop scalable back-end solutions, ensuring adherence to software development best practices and design patterns.\nManaged database design and backend integration with SQL and **GraphQL**, optimizing data retrieval and storage processes.\nImplemented robust CI/CD pipelines utilizing **AWS** services, ensuring seamless code deployments and integration with version control systems like **Git**.\nConducted unit testing and integration testing using established frameworks, ensuring high-quality output across all software deployments.\nMentored junior developers to foster best practices in code reviews, technical debt management, and risk mitigation in high-stakes financial and healthcare domains.\nCollaborated on architectural decisions to improve system performance and reliability, utilizing **Kubernetes** for container orchestration and management.\nDeveloped REST API interfaces to facilitate secure data access and manipulation for front-end consumption, optimizing interactions in health and finance applications.\nPromoted test automation strategies to streamline development processes and reduce manual testing efforts across diverse projects.\nEnsured compliance with industry standards while delivering features that enhance system functionality and user experience.\nAnalyzed technical requirements for projects and contributed to documentation and knowledge sharing across development teams."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Django** to enhance core financial platforms, implementing software development best practices, including unit testing and integration testing, to ensure robust and reliable code.\nEngaged in **CI/CD** processes to streamline deployment workflows, leveraging **Git** for version control and collaboration.\nImplemented **AWS** solutions for scalable cloud infrastructure, optimizing database design and ensuring high availability.\nMaintained and improved existing codebases by managing technical debt, conducting thorough code reviews, and adhering to design patterns to enhance overall system architecture.\nMentored junior developers on software development best practices and integration testing strategies, fostering a collaborative team environment.\nDeveloped and consumed **REST APIs** and **GraphQL** services for efficient data retrieval and manipulation, ensuring optimal performance and responsiveness.\nManaged containerized applications using **Kubernetes**, facilitating seamless application orchestration and scaling.\nDesigned and implemented data models, supported by SQL databases, optimizing query performance for transaction-level analysis.\nDemonstrated risk mitigation strategies by implementing automated testing frameworks, reducing bugs and improving software quality by over **30%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** (Django) to develop robust backend services for a high-traffic e-commerce platform, incorporating databases like **PostgreSQL** for efficient data management.\nApplied continuous integration and deployment (CI/CD) practices with **Kubernetes** for scalable application deployment, ensuring zero downtime during updates and optimized performance monitoring.\nDesigned and implemented **REST API** and **GraphQL** services to facilitate seamless communication between front-end applications and backend systems while adhering to best practices for performance and security.\nConducted unit and integration testing using industry-standard frameworks to validate service functionality, maintain application quality, and manage technical debt effectively, leading to a **30% reduction** in production issues.\nMentored junior developers on software development best practices, including effective **code review** and adherence to **design patterns**, to promote team growth and enhance code quality.\nDeveloped database design strategies for **SQL** databases to optimize data retrieval and storage in line with e-commerce workflows, improving query response times by up to **40%**.\nImplemented test automation strategies to automate regression testing, increasing release velocity by **25%**.\nCollaborated on risk mitigation strategies during deployment phases, utilizing feature flags for controlled updates and minimizing user impact.\nLeveraged **AWS** cloud services for application hosting, ensuring scalability and resilience to meet growing demands in customer traffic.\nEngaged in active code reviews to identify potential risks early in the development lifecycle, contributing to overall software quality and maintainability."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tDjango\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tGraphQL\n\tREST API\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3)\n\tAzure (App Services, Blob Storage, SQL Database)\n\n**Databases:**\n\tSQL\n\tPostgreSQL (Fintech)\n\tMySQL (Healthcare)\n\tMongoDB (Gaming)\n\n**DevOps:**\n\tKubernetes\n\tDocker\n\tCI/CD (GitHub Actions, GitLab CI/CD)\n\tGit\n\n**Cloud & Infrastructure:**\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow)\n\tunit testing\n\tintegration testing\n\tsoftware development best practices\n\tcode review\n\tdesign patterns\n\tdatabase design\n\ttechnical debt management\n\trisk mitigation\n\ttest automation strategies\n\tmentorship\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\tRedis"
}