{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Frontend Developer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a proficient Frontend Developer with 8 years of experience, I excel in crafting high-performance, user-centric applications utilizing **TypeScript**, **Vue.js**, **Nuxt.js**, and **React Native**. My technical repertoire includes a strong focus on Mobile-First design, performance optimization, and adherence to modern web standards, ensuring exceptional usability and platform optimization.\nI have a demonstrated ability to integrate best practices in frontend development, enhancing browser optimization while fostering a collaborative team environment. My curiosity drives me to constantly explore innovative solutions that improve user experiences. Additionally, my background in full-stack development, with skills in **Python**, **Flutter**, and utilizing frameworks like **React**, along with cloud experience on **Azure** and **AWS**, empowers me to deliver robust applications aligned with industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Frontend Developer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and optimized user interfaces for healthcare and fintech platforms using **Typescript**, **React Native**, **Vue.js**, and **Nuxt.js**, ensuring compliance with modern web standards and performance optimization practices.\nExecuted mobile-first development strategies, enhancing usability across diverse platforms while maintaining high performance and responsiveness.\nCollaborated closely with cross-functional teams to translate business requirements into technical specifications, fostering effective communication and teamwork.\nImplemented browser and platform optimization techniques to enhance application performance, achieving load times reduced by up to **30%**.\nUtilized testing frameworks such as Jest and Cypress to establish robust test strategies, ensuring high-quality deliverables through thorough unit and integration testing.\nLed initiatives to align development practices with industry trends and user experience principles, demonstrating a commitment to continuous improvement and curiosity for new technologies.\nEngaged with stakeholders to gather feedback and iteratively refine UI designs, adopting agile methodologies to enhance team dynamics and project outcomes.\nIntegrated advanced features into applications to improve user engagement, such as dynamic dashboards and personalized recommendations, leveraging the latest in **Typescript** and UI frameworks for optimal results."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript** and **React (18)** to develop responsive front-end applications that enhance **usability** and meet modern **web standards** tailored for financial platforms.\nLeveraged **Vue.js** and **Nuxt.js** to build dynamic interfaces, ensuring **performance optimization** and delivering a **mobile-first** experience that supports high user interaction for financial dashboards and admin portals.\nCollaborated with cross-functional teams to enhance **team spirit** and effectively communicate project requirements and advancements, ensuring a streamlined development process.\nConducted thorough **browser optimization** and **platform optimization** to achieve loading times under **2 seconds** and improve overall user satisfaction as measured by user feedback.\nEnsured adherence to **best practices** in coding and design, leading to a **15%** reduction in bug reports post-deployment through regular team code reviews and collaboration sessions.\nEngaged in continuous learning and exploration of emerging technologies, demonstrating a strong sense of **curiosity** to stay ahead in front-end development trends and practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed dynamic frontend applications utilizing **React Native**, **Vue.js (v3)**, and **Nuxt.js** to achieve mobile-first engagement, enhancing usability and performance optimization across various devices.\nImplemented **TypeScript** to ensure robust, scalable, and maintainable code, facilitating a smoother development process and improving team collaboration.\nEmployed web standards and best practices, including accessibility compliance (WCAG 2.1), to create responsive and engaging e-commerce UIs that cater to a diverse audience.\nEnhanced application performance through strategic browser optimization tactics, significantly reducing load times by an average of **30%** to ensure high user satisfaction.\nParticipated in agile development processes to foster team spirit, ensuring effective communication and collaboration among cross-functional teams, resulting in faster project delivery.\nContinuously explored new technologies and frameworks to boost productivity and improve application features, reflecting a strong curiosity and passion for innovation.\nOptimized platform responsiveness by implementing comprehensive performance strategies, leading to a **25%** increase in user engagement metrics.\nIntegrated comprehensive testing practices to ensure browser compatibility and performance optimization, achieving a seamless cross-browser experience.\nContributed to user experience designs by advocating for mobile-first principles, leading to a **15%** increase in mobile user retention rates."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Vue.js, Angular, nuxt.js, React Native\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tAI & ML (MLflow, Airflow, Kubeflow), Mobile-First, Browser-Optimierung, Plattform-Optimierung, Performance-Optimierung, Usability, Webstandards, Teamgeist, Kommunikationsfähigkeit, Neugierde"
}