{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Delivery Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Delivery Engineer with 13+ years of experience in delivering high-performance applications in compliance-driven sectors. Proficient in **SQL**, **PostgreSQL**, and **ETL** processes for effective data modeling and integration, ensuring seamless data flow and alignment with business requirements. Skilled in **Azure DevOps** for continuous integration and version control management, coupled with robust problem-solving and communication skills to enhance team collaboration and project outcomes. \n\nExpertise in **Python** for backend development, combined with a solid foundation in both frontend and backend technologies such as **React**, **Next.js**, **Node.js**, and **Django**. Proven experience in deploying cloud-native systems on **Azure** and implementing microservices architectures. Additionally, adept in AI/ML-driven platforms supporting predictive analytics, automation, and real-time processing. Proficient in utilizing tools like **JIRA**, **MS Office Suite**, **MS Teams**, and **Miro** to streamline project management and enhance team interaction.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Delivery Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **SQL** to query and manage data efficiently across multiple databases, supporting robust data modeling and ETL processes in healthcare and fintech domains.\nEngineered comprehensive deployments using **Azure DevOps** to facilitate seamless version control and integration with CI/CD practices, ensuring effective project management and delivery.\nDeveloped backend services in **Python** for microservices architecture, enhancing scalability and reliability, while adeptly solving complex technical challenges to support innovative solutions.\nMaintained and optimized **PostgreSQL** databases, ensuring high availability and performance for large-scale applications, contributing to efficient data processing and analytics.\nCollaborated on cross-functional teams by leveraging **JIRA** for project tracking and **MS Teams** for streamlined communication, enhancing collaboration and project visibility.\nDesigned and executed data modeling strategies for diverse data sources, supporting analytical insights and operational efficiency through meticulous planning and execution.\nConducted regular team meetings using **Miro** for collaborative brainstorming and idea mapping, improving project workflows and encouraging collective problem-solving.\nImplemented version control methodologies across software development projects, ensuring consistency and traceability in code revisions and deployments, driving project success.\nEngaged with stakeholders to ensure communication of project progress and alignment with business goals, utilizing **MS Office Suite** for reports and presentations to effectively convey key information.\nHarnessed **Powershell** scripts to automate infrastructure management tasks, enhancing operational efficiency and reducing manual intervention in routine processes."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** and **PostgreSQL** to design and implement efficient data models for core financial platforms, ensuring optimal performance and scalability.\nEmployed **Azure DevOps** for streamlined project management and version control, enhancing collaboration within cross-functional teams.\nAutomated ETL processes for data integration from internal and third-party sources using **Python** and **Azure Data Factory**, supporting batch and real-time processing of financial data.\nLeveraged **JIRA** for issue tracking and project management, enabling precise communication and problem-solving across teams.\nConducted data analysis and visualization using **MS Office Suite** and **Snowflake**, delivering insights that informed critical business decisions.\nFacilitated team communication and collaboration through **MS Teams** and **Miro**, enhancing project delivery timelines by **25%**.\nDesigned scalable machine learning solutions, utilizing **scikit-learn** and **XGBoost**, which led to a **30%** increase in fraud detection accuracy.\nManaged deployment pipelines and CI/CD processes for financial applications, resulting in a **50%** reduction in deployment time through automation with **Azure DevOps**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **SQL** and **PostgreSQL** to create robust data models that support efficient data access and reporting, enhancing overall project delivery effectiveness.\nManaged project tasks using **JIRA** and **MS Teams**, ensuring seamless communication and coordination among team members to meet project deadlines and objectives.\nImplemented **Azure DevOps** for continuous integration and delivery (CI/CD) pipelines, optimizing workflows and reducing deployment times by **30%** through automated testing and deployment processes.\nEngaged in extensive problem-solving to troubleshoot backend services performance issues, achieving a **15%** increase in application responsiveness and system uptime.\nDeveloped ETL processes to enable efficient data movement and transformation between various data sources, leveraging tools like **Snowflake** for data warehousing solutions and analytical use cases.\nCollaborated with team members using **Miro** for visual brainstorming and planning sessions, improving project clarity and fostering a collaborative environment.\nRegularly applied **PowerShell** scripts for automating routine tasks, enhancing efficiency across development operations.\nProduced thorough documentation and reports, utilizing **MS Office Suite** for high-quality presentations to stakeholders and preserving project insights and learnings for future initiatives.\nDemonstrated strong communication skills in cross-functional teams during project updates and strategy sessions, ensuring all stakeholders remain informed of project status and timelines."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython,\n\tJavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango\n\n **Frontend Frameworks:**\n\tReact,\n\tVue,\n\tAngular\n\n **API Technologies:**\n\tOAuth2,\n\tJWT,\n\tKeycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS,\n\tLambda,\n\tRDS,\n\tS3,\n\tAzure: App Services,\n\tBlob Storage,\n\tSQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\tSnowflake\n\n **DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose\n\n **Cloud & Infrastructure:**\n\tAzure DevOps\n\n **Other:**\n\tSQL,\n\tJIRA,\n\tMS Office Suite,\n\tMS Teams,\n\tMiro,\n\tPowershell,\n\tETL,\n\tdata modeling,\n\tversion control,\n\tproblem-solving,\n\tcommunication",
  "apply_company": "MasterBorn"
}