{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior QA Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Accomplished Senior QA Engineer with 8 years of experience in automated testing and quality assurance within the healthcare and financial sectors. Proficient in **Python**, **Django**, **C#**, **GitLab**, **PowerShell**, and automated testing frameworks like **Pytest**. I possess strong analytical skills and excel in performing tests on diverse operating systems, including **Windows**, **Linux**, and **Unix**. My expertise in **DNS**, **DHCP**, and virtualization technologies contributes to the robustness of the systems I test.\n\nI have a proven track record of leveraging teamwork to enhance product quality and compliance with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. My strong communication skills in English facilitate effective collaboration within cross-functional teams. I am passionate about delivering high-performance solutions, having led projects that integrate automation and continuous improvement strategies.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted automated testing processes and implemented test strategies using **Pytest** and **TestRail** to ensure high-quality software delivery across projects impacting healthcare and finance.\n- Collaborated with cross-functional teams utilizing strong **analytical skills** to identify and address quality issues in various applications built on **Python** and **Django** frameworks.\n- Designed and executed test plans for applications operating on **Windows**, **Linux**, and **Unix** environments, ensuring comprehensive coverage of all critical functionalities.\n- Developed scripts in **PowerShell** to automate deployment processes, enhancing efficiency and reducing the risk of manual errors in production environments.\n- Oversaw thorough testing of applications within virtualization platforms, implementing CI/CD methodologies to streamline the software development lifecycle.\n- Facilitated teamwork by promoting best practices in QA testing and mentoring junior engineers on effective usage of testing tools and methodologies.\n- Monitored and improved application performance through analytics and feedback from automated tests, prioritizing user experience and operational efficiency.\n- Participated in regular code reviews using **GitLab**, fostering an environment of continuous improvement and quality assurance.\n- Trained team members in the latest technologies and frameworks related to QA processes, including the adoption of advanced testing tools and methodologies that leverage cloud services and efficient testing practices."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted automated testing focused on critical business processes using **Python**, **Django**, and **Pytest**, ensuring high-quality deliverables and adherence to requirements across diverse operating systems including **Windows**, **Linux**, and **Unix**.\nCollaborated with cross-functional teams to implement effective testing strategies and frameworks, leveraging strong teamwork and analytical skills to enhance product quality and release cycles.\nDeveloped and maintained test automation scripts and continuous integration pipelines using **GitLab**, facilitating efficient regression testing and workflow improvements.\nLed initiatives to optimize and streamline testing processes, achieving a reduction in testing time by **30%** while increasing coverage across various applications.\nParticipated in the review of system architecture and design with a focus on testing components, ensuring robust integrations of **DNS** and **DHCP** configurations to maintain system reliability.\nUtilized **PowerShell** for scripting and automation tasks to improve operational efficiency, contributing to faster deployment and better resource management.\nEngaged in hands-on troubleshooting across platforms, employing strong analytical skills to identify and resolve issues in collaboration with software engineering teams.\nPromoted best practices in quality assurance and testing methodologies, facilitating training sessions and documentation efforts to enhance team capabilities."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented automated testing frameworks using **Python** with **Django** and **Pytest** to enhance the quality assurance processes for software deployments, ensuring consistent delivery across **Linux** and **Windows** environments.\nConducted rigorous testing strategies for applications developed in **C#** and **C/C++**, applying analytical skills to identify defects and optimize quality control.\nUtilized **GitLab** for version control and collaboration, enabling effective teamwork and streamlined project management.\nDeveloped and executed comprehensive test cases and scripts, ensuring functionality across DNS, DHCP, and other network services, meeting industry standards and compliance.\nOptimized test environments with virtualization techniques, enabling robust testing suites to run efficiently on various operating systems including **Unix**.\nCollaborated effectively with cross-functional teams to ensure project specifications were meticulously tested and compatible for end-user requirements.\nMaintained detailed documentation and test results in **TestRail**, facilitating continuous feedback and improvements in the testing lifecycle.\nUtilized English proficiency to communicate testing outcomes clearly to stakeholders, enhancing project visibility and understanding.\nTrained junior team members in automated testing techniques and best practices using **Python** and **Django**, fostering an environment of learning and professional growth.\nEmployed **PowerShell** scripting to automate repetitive tasks in the testing environment, improving efficiency and reducing human error by **30%**."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, C#, C/C++, PowerShell, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tWindows, Linux, Unix, DNS, DHCP, virtualization\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, TestRail, automated testing, analytical skills, teamwork, English, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Pytest",
  "apply_company": "Veeam"
}