{
  "name": "Rei Taro",
  "role_name": "Senior Frontend Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Frontend Engineer with over 10 years of experience in developing user-centric solutions using **TypeScript**, **React**, and **React Native**. Proficient in delivering robust authentication systems and security solutions, bolstered by a strong understanding of **WebAuthn** and **SDKs**. Skilled in creating cross-platform applications and ensuring clean architecture practices, leading to enhanced user experience (UX) and streamlined collaboration across teams. Demonstrated success in impactful fintech projects at leading organizations, including VISA and Sii Poland, with a strong commitment to code review, documentation, and quality assurance.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented robust authentication mechanisms using **WebAuthn** and **OAuth2**, ensuring secure user experiences and compliance with fintech regulations.\nDeveloped user-friendly frontend applications with **React** and **TypeScript**, enhancing UX across multiple platforms, including a **React Native** mobile application targeting **iOS 14** and **Android 11**.\nConducted thorough code review processes that improved code quality by **30%** and fostered a culture of collaboration in a rapidly-evolving development environment.\nDesigned clean architecture strategies that streamlined code management and improved application scalability, resulting in a **25%** increase in deployment efficiency.\nDocumented technical processes and solutions, ensuring that SDKs and system integrations were well-articulated for future development and maintenance.\nCoordinated with cross-functional teams to enhance system interoperability and successfully launched **5** key projects while addressing integration challenges in a timely manner."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **TypeScript** and **React** to develop intuitive user interfaces for fintech applications, enhancing user experience and adopting clean architecture principles.\nContributed to cross-platform mobile app development with **React Native**, ensuring robust functionality and seamless performance across devices.\nIntegrated **WebAuthn** for secure authentication processes, improving user security standards and application trustworthiness.\nConducted thorough code reviews and fostered documentation practices to maintain high coding standards while enhancing team collaboration.\nEmployed various **SDKs** to interact with third-party services, effectively increasing application capabilities and overall functionality.\nCollaborated with UX designers and stakeholders, achieving a **30%** increase in user satisfaction as measured by user feedback during the deployment of new features.\nLed initiatives to ensure the implementation of security best practices, maintaining compliance with industry standards in a **fintech** environment while safeguarding user data."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "- Developed frontend applications utilizing **TypeScript**, **React**, and **React Native** to enhance user experience in the fintech sector.\n- Collaborated with backend teams to integrate **WebAuthn** for secure authentication, ensuring compliance with industry security standards.\n- Designed and implemented cross-platform solutions, optimizing UX through efficient design patterns and clean architecture principles.\n- Conducted thorough code reviews and maintained documentation to uphold high-quality standards and facilitate team collaboration.\n- Leveraged various third-party **SDKs** to streamline development processes and enhance application functionalities, resulting in a **30%** increase in deployment efficiency.\n- Engaged in regular collaboration sessions with stakeholders, providing insights and recommendations that contributed to achieving project milestones, including a **40%** reduction in feature development time.\n- Implemented best practices for security and documentation, ensuring adherence to regulatory requirements while enhancing user trust in the platform."
    }
  ],
  "skills": " **Programming Languages** \n\tTypeScript, Python (3.8+), SQL, Bash, JavaScript\n\n **Backend Frameworks** \n\tFastAPI, Flask, Django, Celery\n\n **Frontend Frameworks** \n\tReact, React Native\n\n **API Technologies** \n\tREST/gRPC APIs, WebAuthn, SDKs\n\n **Serverless and Cloud Functions** \n\tAWS (EC2, S3, Lambda), Azure\n\n **Databases** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps** \n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Code review\n\n **Cloud & Infrastructure** \n\tCollaboration, Documentation\n\n **Other** \n\tMicroservices, Kafka, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Fintech, UX, Clean architecture, Security, Authentication",
  "apply_company": "Career Renew"
}