{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Backend Engineer with over 13 years of experience specializing in **TypeScript**, **Node.js**, and **React** to deliver high-performance applications, particularly in the healthcare and financial sectors. Proficient in applying clean architectures and testing strategies while implementing domain-driven design and event-driven systems for scalable and maintainable applications. Adept in managing databases, particularly with **PostgreSQL**, while ensuring adherence to security and compliance best practices.\nSkilled in developing robust cloud-native systems on **AWS** and **Azure**, leveraging microservices and CI/CD pipelines to enhance deployment efficiency. Experienced in building AI/ML platforms utilizing **Python** and frameworks such as **FastAPI** and **Django** to enable predictive analytics and real-time processing. Committed to fostering a culture of mentorship and clear communication within teams, supporting pragmatic decision-making and promoting autonomous work environments.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript**, **Node.js**, and **React** to design and build robust backend solutions in compliance with security and compliance best practices, contributing to system reliability and data integrity for healthcare and fintech projects.\nImplemented clean architectures and domain-driven design principles to enhance code organization and maintainability across multiple services, ensuring efficient development workflows.\nDeveloped comprehensive testing strategies using Jest, Cypress, and PyTest to guarantee high code quality, achieving a **95%** coverage rate on critical services.\nPlayed a pivotal role in mentoring junior developers, facilitating a knowledge-sharing environment that improved team capabilities and accelerated onboarding processes.\nApplied event-driven systems design to enhance scalability and responsiveness of applications, enabling a **20%** reduction in latency for user interactions.\nExecuted features in the backend supporting PostgreSQL, targeting performance improvements for complex queries, managing **50+** million records efficiently.\nCommunicated technical concepts clearly with cross-functional teams to facilitate the integration of frontend systems, fostering collaborative development and aligning project goals.\nMaintained autonomous work ethic while managing project deliverables and adhering to timelines, contributing to the timely launch of applications.\nConducted thorough reviews of existing systems, leading to identification and mitigation of security vulnerabilities, thus enhancing overall system security posture.\nContributed to the development of domain-specific business logic, ensuring all services aligned with both healthcare and financial regulatory standards, including rigorous compliance with HIPAA and GDPR."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **TypeScript**, **Node.js** (NestJS/Express) to modernize core financial platforms, migrating to microservices architecture that enhanced scalability and performance for high-volume transactional systems.\nDeveloped resilient and maintainable backend services with **PostgreSQL**, ensuring adherence to **security and compliance best practices** across all applications in alignment with industry standards.\nImplemented effective **testing strategies** to validate functionality and performance of the systems developed, leading to a **30% reduction** in production errors.\nMentored junior developers by sharing knowledge on **clean architectures** and **domain-driven design** principles, fostering a culture of continuous learning and growth within the team.\nDesigned and deployed an event-driven architecture employing **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring seamless asynchronous communication for critical workflows such as payments, alerts, and compliance notifications.\nPromoted clear communication within cross-functional teams, resulting in a **25% improvement** in project delivery timelines and overall efficiency.\nEmployed **pragmatic decision-making** while orchestrating the integration of new technologies and frameworks, resulting in a 40% enhancement in system capabilities.\nSupported autonomous work culture by driving initiatives that empowered teams to take ownership of their projects, resulting in improved engagement and productivity."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed robust backend services utilizing **Node.js** and **Java**, adhering to **clean architectures** and **testing strategies**, ensuring optimal performance and reliability in high-traffic scenarios.\n• Harnessed **TypeScript** to enhance code quality and maintainability, promoting effective collaboration and **clear communication** across development teams.\n• Instituted **event-driven systems** leveraging **Kafka** and **RabbitMQ** to enhance responsiveness of features like order updates and customer notifications, achieving a **50% reduction** in latency.\n• Implemented **PostgreSQL** as the primary database solution, optimizing queries and schema design, which resulted in a **30% improvement** in data retrieval times for customer transactions.\n• Championed **security and compliance best practices** implementing **OAuth 2.0** for user authentication and access control, ensuring adherence to GDPR standards.\n• Mentored junior developers on **domain-driven design** principles and pragmatic decision-making, fostering a collaborative learning environment and improving team productivity.\n• Executed autonomous work on high-impact projects, ensuring features met **90%** of stakeholder requirements in initial review stages.\n• Conducted code reviews and quality checks, implementing best practices in testing strategies to enhance code reliability and reduce bug occurrences by **25%**.\n• Guided the team in integrating **React** for frontend applications, maintaining seamless interaction with the backend services through well-defined APIs, enhancing user engagement on both web and mobile platforms.  \n• Engaged in mentoring sessions to enhance coding standards and foster professional growth within the team, impacting over **15 team members** directly.\n"
    }
  ],
  "skills": " **Programming Languages:** \n\tTypeScript, Python, Java\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django, Node.js\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:** \n\tAWS: Lambda, Azure: App Services\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:** \n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:** \n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, security and compliance best practices, clear communication, mentoring, pragmatic decision-making, autonomous work, testing strategies, clean architectures, domain-driven design, event-driven systems"
}