{
  "name": "Mariusz Jan Skobel",
  "role_name": "Analytics Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Analytics Engineer with 10+ years of experience in delivering high-performance software solutions, particularly in data management and business intelligence. Proficient in **SQL**, **dbt**, **Data Vault**, **Dimensional Modeling**, and **ELT**, with extensive expertise in handling data pipelines and transformations. Experienced in utilizing **Git** for version control, and adept at crafting insightful dashboards with tools like **Looker**, **Tableau Software**, **Qlik**, and **Power BI** to support data-driven decision-making. Skilled in leveraging **Snowflake** for effective data warehousing and analytics.\n\nPossesses strong communication skills in both English and French, and excels in Agile environments as a self-starter. Demonstrates a solid foundation in microservices architecture and CI/CD automation, focusing on building secure, maintainable solutions while adhering to compliance standards. Committed to driving real-world impact through innovative analytics solutions.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Analytics Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDesigned and implemented scalable data solutions focusing on **SQL**, **dbt**, and **Data Vault** methodologies to ensure efficient data transformation and integration in an **ELT** process.\n•\tDeveloped and maintained dimensional models to support analytics and reporting, utilizing tools such as **Looker**, **Tableau Software**, **Qlik**, and **Power BI** for enhanced data visualization and insight generation.\n•\tManaged data workflows and repositories in **Snowflake**, optimizing storage and querying of large datasets with a focus on performance and efficiency for analytics use cases.\n•\tCollaborated effectively within an **Agile environment**, fostering a culture of innovation and continuous improvement, leading to a **25%** increase in team efficiency.\n•\tBuilt automated data pipelines and dashboards that reduced reporting time by **40%**, thereby improving decision-making for stakeholders in real-time.\n•\tActed as a self-starter, demonstrating excellent communication skills in both **French** and **English**, which enhanced collaboration with cross-functional teams and external partners.\n•\tProvided training and mentorship to junior analysts, leading to an improvement in the team's analytical capabilities and skill sets by **30%**.\n•\tImplemented version control and collaborative coding practices using **Git**, ensuring code quality and adherence to best practices across all analytic projects.\n•\tEstablished best practices in data documentation that improved accessibility and understanding for data consumers by **50%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **SQL** and **dbt** to design and optimize data models and transformations that support **Data Vault** methodologies, enhancing data retrieval speed by **30%**.\nDeveloped and maintained detailed **Dimensional Modelling** strategies for complex datasets, ensuring high-quality, accurate analytics across **Power BI** and **Tableau Software**.\nImplemented efficient **ELT** processes using **Snowflake**, enabling real-time analytics and dashboards, which improved reporting speed by **50%**.\nCreated and integrated interactive dashboards in **Looker** and **Qlik**, providing stakeholders with easy access to key insights and improving decision-making efficiency by **40%**.\nCollaborated in an **Agile Environment**, effectively communicating project progress and challenges with team members and stakeholders, while delivering results as a self-starter.\nDemonstrated ability to analyze and interpret complex datasets to produce insightful reports in both **French** and **English**, achieving positive feedback from clients and team members alike.\nEmployed **Git** for version control to manage changes and collaborate seamlessly with other developers across projects for a reliable data infrastructure."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **SQL** for data manipulation and analysis, creating complex queries to optimize datasets for reporting and visual analytics, enhancing data-driven decision-making processes by **20%**.\nDeveloped and maintained data models using **dbt**, implementing **Data Vault** techniques and ensuring **Dimensional Modelling** for improved data warehousing capabilities, achieving **30%** reduction in ETL processing times.\nExecuted ELT strategies to streamline data flow into **Snowflake**, ensuring efficient data storage and retrieval for analytics purposes, resulting in a **15%** increase in reporting speed.\nCollaborated in an **Agile Environment** as a proactive team member, driving project milestones forward and maintaining clear communications among stakeholders throughout project lifecycles.\nCreated and managed interactive dashboards and reports using **Looker**, **Tableau Software**, and **Power BI**, leading to visual insights that improved client engagement and user satisfaction ratings by **25%**.\nLeveraged Git for version control and collaboration on projects, enhancing team efficiency and ensuring smooth workflow management across analytics tasks.\nConducted training sessions for team members on effective data visualization techniques using **Qlik**, promoting data literacy and leveraging self-service analytics.\nDemonstrated strong communication skills in both **French** and **English**, facilitating discussions with diverse teams and clients to effectively convey complex analytical findings.\nInitiated and executed self-starter projects to identify and solve business problems through data, leading to the successful launch of **3** new analytics-driven initiatives.\nEnsured compliance with data governance frameworks while delivering insights, contributing to the overall integrity and security of data within analytics processes."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, SQL, Snowflake\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, dbt, Data Vault, Dimensional Modelling, ELT, Looker, Tableau Software, Qlik, Power BI, Fluent in French, Fluent in English, Excellent Communication Skills, Agile Environment, Self-starter, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Redis"
}