{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Java Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "Results-driven Senior Java Engineer with 8 years of experience in designing and implementing high-performance solutions. Proficient in **Java**, **Spring**, **Docker**, **Microservices**, **Kubernetes**, and **OpenShift**, I leverage my expertise to build scalable applications in Agile environments. My technical prowess includes database management with **SQL** and **NoSQL**, ensuring seamless data operations. \nIn addition to my core skill set, I have rich experience in leveraging **AWS** for cloud solutions and engaging in CI/CD practices that enhance deployment efficiency. I foster strong communication and collaboration within teams to deliver on complex projects. My background also includes developing sophisticated client-side applications using **React** and integrating them with backend services effectively. With a commitment to quality, I prioritize unit testing and code reviews to maintain robustness and reliability in the software development lifecycle.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Java Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Java** and **Spring** frameworks to develop scalable microservices architectures that enhance system resilience and performance in healthcare and financial platforms.\nOrchestrated containerized applications using **Docker**, integrated with **Kubernetes** for seamless orchestration, ensuring smooth continuous integration and deployment (CI/CD) within both development and production environments.\nLed the transition of legacy systems to modern **microservices** architecture, optimizing for high availability and fault tolerance, leveraging tools like **OpenShift** for efficient deployment.\nCollaborated with cross-functional teams employing **Agile** methodologies to prioritize and deliver essential features, facilitating effective communication and transparency throughout project lifecycles.\nImplemented robust unit testing strategies to ensure software quality and reliability, utilizing frameworks like **JUnit** and **Mockito**, effectively reducing bug rates by 30% in production releases.\nDelivered on **AWS** cloud services for scalable infrastructure, employing **RDS** for SQL databases and optimizing NoSQL options like **DynamoDB** for data-intensive operations.\nDesigned and maintained responsive front-end interfaces using **React**, ensuring a seamless user experience across platforms, achieving load times under 2 seconds for high-traffic applications.\nEstablished CI/CD processes that reduced deployment time by 40%, utilizing tools like Jenkins and GitHub Actions for automated build, test, and release cycles.\nFostered communication among teams and stakeholders to debug complex issues, providing solutions efficiently and improving inter-departmental satisfaction by 25%.\nOptimized database performance through advanced querying techniques with **SQL** and **NoSQL**, improving data retrieval speeds by 50%.\nIntegrated with RESTful APIs, ensuring secure and efficient data exchange between client applications and backend services, resulting in a 20% increase in system throughput.\nParticipated in code reviews, providing mentorship on best practices and adherence to clean coding standards, facilitating professional growth and a culture of learning within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring** to lead the design and development of microservices architectures, enhancing system scalability and maintainability for high-volume transaction applications.\nImplemented **Docker** for containerization and **Kubernetes** for orchestration to streamline deployment processes, achieving a 50% reduction in release cycle time.\nCollaborated within an **Agile** framework to optimize development workflows, ensuring timely delivery of features and enhancements, resulting in a 30% increase in team productivity.\nDesigned and maintained robust **SQL** and **NoSQL** databases, yielding improved data retrieval speeds by 40% for real-time analytics applications.\nDeveloped dynamic, user-centric front-end applications using **React** and **Angular**, ensuring a seamless user experience across platforms, and incorporated **CI/CD** practices to enhance code quality and deployment efficiency.\nExecuted unit testing strategies and frameworks to ensure that features are robust and bug-free, achieving at least 90% unit test coverage on critical components.\nEngaged in effective communication with cross-functional teams to gather requirements and deliver solutions, fostering collaboration that contributed to project successes and stakeholder satisfaction."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized microservices architecture for enterprise applications utilizing **Java** and **Spring**, ensuring efficient integration and seamless service interactions across distributed systems.\nImplemented containerization strategies with **Docker** to streamline deployment processes and facilitate development-to-production workflows, enhancing CI/CD capabilities.\nManaged cloud resources on **AWS**, optimizing performance and scalability of applications while adhering to security best practices and cost management.\nLeveraged **SQL** and **NoSQL** databases for comprehensive data management, ensuring robust data access patterns and performance optimization in high-traffic scenarios.\nCollaborated in Agile frameworks to deliver high-quality software through iterative development and continuous integration, effectively enhancing team communication and productivity.\nEngineered modern frontend applications using **Angular** and **React**, providing exceptional user experiences and maintaining responsiveness across web and mobile platforms.\nConducted thorough unit testing and code reviews to uphold software reliability and quality, implementing best practices to ensure code maintainability and scalability.\nOrchestrated application deployment and management using **Kubernetes** and **OpenShift**, ensuring high availability, fault tolerance, and streamlined application lifecycle management.\nEmployed CI/CD pipelines to automate testing and deployment processes, significantly reducing release times and improving code quality through automated checks.\nMaintained effective communication across cross-functional teams to ensure alignment on project deliverables and timelines, encouraging collaboration and knowledge sharing."
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, NoSQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Microservices, OpenShift, Unit Testing, Agile, Communication, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot",
  "apply_company": "R Systems"
}