{
  "name": "Tomasz Lee",
  "role_name": "Desarrollador de Prompts para Modelos de Lenguaje",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-477994390/",
  "profile_summary": "Results-driven Developer specializing in Large Language Models and Intelligent Document Processing, with 9+ years of experience in building advanced applications. Proficient in **.NET**, **Python**, **Git**, and **Azure DevOps**, combining strong skills in microservices architecture with experience in **Microsoft** and **OpenAI** technologies. Adept at utilizing cloud services such as **Azure OpenAI** to deliver innovative solutions. Proven track record in optimizing development workflows and leading cross-functional teams to achieve project objectives successfully.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Desarrollador de Prompts para Modelos de Lenguaje",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Apr 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Microsoft** technologies, including **.NET** 7 and **Azure DevOps**, to develop high-performing web applications, increasing efficiency by 25%.\nLeveraged **Python** for backend processing, ensuring seamless integration with **OpenAI** and **Azure OpenAI** services to foster intelligent automation through Large Language Models.\nIntegrated **UiPath** to automate repetitive tasks, improving workflow efficiency by 30%.\nImplemented **Intelligent Document Processing** solutions to streamline data extraction and improve processing speed, enhancing accuracy by 40%.\nDeveloped and maintained RESTful APIs, utilizing **Git** for version control, which facilitated team collaboration and version management.\nDesigned a robust microservices architecture to ensure scalability and maintainability across various applications.\nCollaborated using **Azure DevOps**, improving deployment efficiency by 40% with CI/CD practices.\nManaged system authentication and authorization, implementing JWT to secure sensitive data integrations effectively.\nExecuted comprehensive performance testing strategies, reducing average query execution times by 20% in **MSSQL** databases.\nCreated engaging data visualizations using frameworks like **D3.js** and **Three.js**, enhancing user interface appeal for end users."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **Azure OpenAI** and **OpenAI** technologies to develop high-performing prompt strategies for **Large Language Models** (LLMs), enhancing text generation accuracy by **20%**.\nImplemented **Intelligent Document Processing** solutions, leveraging **UiPath** for automation and efficiency in document handling, leading to a **35%** reduction in processing time.\nCollaborated with cross-functional teams to define project requirements and timelines, ensuring seamless integration of AI capabilities in applications.\nDesigned and developed robust backend solutions using **.NET** and **Python**, delivering scalable APIs that improved response times by **30%**.\nUtilized **Git** for version control and collaborated through **Azure DevOps** to streamline development processes, resulting in a **25%** increase in development team productivity.\nCreated intuitive user interfaces with modern frameworks, fostering user engagement and enhancing overall user experience.\nConducted training sessions and workshops on **Microsoft** technologies and LLM integration strategies, fostering skill growth within the team.\nEngaged in code reviews and collaborative development, ensuring high-quality code standards and mentoring junior developers effectively."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **OpenAI** and **Azure OpenAI** to develop prompts for **Large Language Models**, enhancing the AI's performance in understanding and generating human-like text.\nDesigned and implemented automated workflows using **UiPath** for **Intelligent Document Processing**, streamlining document handling and improving operational efficiency by **15%**.\nLeveraged **Python** for data manipulation and analysis to support the model's training datasets, leading to a **25%** faster processing time.\nCollaborated with cross-functional teams using **Azure DevOps** to manage source code, ensuring version control with **Git** and maintaining high coding standards.\nDeveloped and maintained internal applications using **.NET** technologies, providing scalable and robust solutions for prompt generation tasks.\nContributed to the integration of machine learning models with existing Microsoft-based systems, enhancing user accessibility to AI-driven features.\nParticipated in daily standups and code reviews, ensuring alignment with project goals and keeping abreast of the latest development practices.\nDelivered comprehensive technical documentation to facilitate knowledge transfer and improve team onboarding processes."
    }
  ],
  "skills": " **Programming Languages**\n\tPython, C#, .NET\n\n **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS\n\n **Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL\n\n **Serverless and Cloud Functions**\n\tAzure OpenAI, AWS, Azure\n\n **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tAzure DevOps, CI/CD pipelines, Git, GitHub\n\n **Cloud & Infrastructure**\n\tMicrosoft, Azure\n\n **Other**\n\tLarge Language Models, UiPath, Intelligent Document Processing, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Messaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, UX/UI Design"
}