{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Experienced Senior Sales Engineer with a robust background in account management and B2B sales. Adept at developing strategic account plans and managing client relationships effectively, leveraging strong communication skills to enhance customer satisfaction and retention. Proven ability to analyze and monitor conditions in plant asset management, employing CRM systems to streamline operations and improve efficiency.\nAdditionally, I bring over 13 years of experience as a Full Stack Developer, with expertise in technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**. Proficient in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for both frontend and backend development. Demonstrated track record in building AI/ML-powered platforms and implementing cloud-native systems on **AWS** and **Azure**. Committed to delivering compliance-driven solutions aligned with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Facilitated strategic account management to enhance client relationships, employing **CRM** tools for streamlined sales processes.\n- Developed and implemented strategic account plans, optimizing approaches for key B2B partnerships, leading to a **30% increase** in client retention rates.\n- Monitored conditions and performance of technical solutions, utilizing **Condition Monitoring** techniques to ensure optimal client satisfaction and system health.\n- Delivered comprehensive presentations and demonstrations to stakeholders, leveraging strong **communication** skills to convey complex technical concepts effectively.\n- Conducted detailed analysis and insights from **Plant Asset Management** systems to inform clients on best practices, resulting in a **20% reduction** in operational costs.\n- Achieved **50% growth** in sales pipeline through targeted outreach and proactive engagement with prospective clients, utilizing **MS Office** for effective reporting and analysis.\n- Collaborated across departments to align technical capabilities with client requirements, enhancing overall value proposition and service delivery.\n- Provided ongoing technical support and troubleshooting for existing clients, ensuring a seamless adoption of services and solutions."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed strategic account plans to enhance B2B sales performance, ensuring alignment with client objectives and driving revenue growth by **25%** year-over-year.\nUtilized CRM systems to manage client relationships and track sales activities, ensuring timely follow-ups and maintaining an organized sales pipeline, achieving an 80% closure rate on leads.\nCollaborated with cross-functional teams to deliver customized solutions that addressed client needs, resulting in a **95%** customer satisfaction rate.\nConducted presentations and demonstrations to key stakeholders, effectively communicating complex technical concepts in an accessible manner, enhancing engagement during the **6** major product launches.\nMonitored plant asset performance and implemented condition monitoring strategies, leading to a **15%** reduction in equipment downtime in key accounts.\nCreated detailed reports and executive summaries utilizing MS Office tools to support strategic decision-making within client organizations, facilitating informed discussions on asset management strategies.\nLeveraged strong communication skills to foster relationships with stakeholders, ensuring a smooth onboarding process for new clients and stakeholders, contributing to a **30%** increase in retention rates."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Developed and executed strategic account plans to drive sales and account management initiatives, effectively contributing to B2B relationships and revenue growth.\n- Leveraged **MS Office** tools for creating compelling presentations and reports to communicate sales progress and strategic insights to stakeholders.\n- Utilized CRM systems to monitor sales pipelines, manage customer relationships, and ensure effective follow-up on leads, enhancing overall sales efficiency.\n- Conducted condition monitoring and plant asset management solutions, aligning customer needs with innovative sales strategies.\n- Fostered strong communication skills to establish trust with clients, enhance customer satisfaction, and address their needs proactively.\n- Collaborated with cross-functional teams to gather insights and optimize sales processes in line with market demands and customer feedback.\n- Achieved a **30%** increase in customer retention through effective account management and personalized sales approaches, ensuring long-term partnerships.\n- Successfully engaged with over **50** B2B clients, driving substantial growth in product adoption and sales volume.\n- Led presentations to key decision-makers, utilizing persuasive communication to highlight product value and secure buy-in.\n- Implemented feedback mechanisms to track customer satisfaction rates and adjust sales strategies accordingly, resulting in an improved NPS score of **20%**."
    }
  ],
  "skills": "**Sales, Account Management, B2B, CRM, Condition Monitoring, Plant Asset Management, MS Office, Strategic Account Plans, Communication**\n\n\tPython: FastAPI, Flask, Django\n\n\tJavaScript/TypeScript: React, Vue, Angular\n\n\t**Artificial Intelligence & Machine Learning**\n\n\tMLflow, Airflow, Kubeflow\n\n\t**DevOps & Cloud**\n\n\tDocker, Kubernetes\n\n\tGitHub Actions, GitLab CI/CD\n\n\t**Cloud & Infrastructure**\n\n\tAWS: ECS, Lambda, RDS, S3\n\n\tAzure: App Services, Blob Storage, SQL Database\n\n\t**Authentication & Security**\n\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n\tNginx, Let’s Encrypt, Certbot\n\n\t**Databases**\n\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\n\tMongoDB (Gaming), Redis\n\n\t**CI/CD & Infrastructure as Code**\n\n\tTerraform, Ansible, Helm, Docker Compose",
  "apply_company": "Emerson"
}