{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior VoIP Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Results-driven Senior VoIP Engineer with 8 years of comprehensive experience in VoIP technologies, specializing in **Amazon Connect**, **SIP**, **WebRTC**, and **VoLTE**. Proficient in managing and optimizing **PBX** systems, **SS7** signaling, and **SBCs** for enhanced communication solutions. Adept in cloud technologies, particularly **AWS Lambda** to integrate and deploy scalable VoIP applications efficiently.\n\nPossessing strong programming skills in **Python**, I delve into automation and system optimization while leveraging tools like **Jira Software**, **Confluence**, and **Visio** for project management and documentation. I am well-versed in Agile methodologies to ensure adaptive and iterative project delivery, while also utilizing collaboration tools like **Miro** for innovative brainstorming.\n\nIn addition to VoIP specialization, my background in full-stack development allows me to implement comprehensive solutions, ensuring seamless integration and superior performance across diverse sectors. My commitment to continuous improvement and collaboration drives successful outcomes in every project.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior VoIP Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Leveraged **Python** and **AWS Lambda** to develop and deploy VoIP solutions, enhancing call routing and scalability.\n- Designed and implemented VoIP systems using **Amazon Connect** and **PBX** technologies to optimize telecommunications efficiency and cost-effectiveness.\n- Integrated **WebRTC** for real-time communication solutions, improving user experience and reducing latency, resulting in a **20%** increase in call clarity.\n- Collaborated with cross-functional teams using **Jira Software** and **Confluence** for managing project documentation and agile backlog, ensuring timely delivery.\n- Conducted performance analysis and troubleshooting using **WireShark**, achieving a **15%** reduction in call drops by identifying and mitigating network issues.\n- Created detailed network diagrams using **Visio** and **Miro**, facilitating better understanding and communication of VoIP architecture across teams.\n- Developed SIP protocols for efficient session management, resulting in improved call setup times by **30%**.\n- Utilized **Excel** for data analysis, reporting on VoIP performance metrics, and identifying trends for proactive system enhancements.\n- Engaged in Agile methodologies to iteratively design and refine VoIP systems, aligning with business objectives and enhancing user satisfaction.\n- Employed **SS7** and **SBCs** for secure connectivity and interactions in telecommunication networks, ensuring compliance with industry standards.\n- Provided ongoing support and optimization of VoIP deployments through continuous monitoring and adjustment of system parameters to maintain peak performance."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** along with **AWS Lambda** to develop and integrate telecommunication solutions in the financial sector that enhance VoIP capabilities and streamline operations.\nImplemented and maintained **PBX** systems, ensuring reliable voice communication and optimizing performance by leveraging existing technologies such as **Amazon Connect** and **WebRTC**.\nDesigned and deployed **SIP** architectures to facilitate seamless communication between different systems and enhance call routing efficiency for financial services.\nCollaborated with cross-functional teams using **Jira Software** and **Confluence** to support Agile methodologies, ensuring timely project delivery and high-quality standards in VoIP system implementations.\nConducted network analysis and troubleshooting utilizing **WireShark** to identify and resolve voice quality issues, maintaining a high standard of service for users.\nDeveloped comprehensive documentation and diagrams using **Visio** and **Miro** to assist in the design and deployment of VoIP systems, enhancing team understanding and project clarity.\nWorked on project management and reporting using **Excel**, enabling efficient tracking of project milestones and resource allocation for VoIP engineering initiatives.\nEmployed **Agile** principles to iterate on VoIP solutions, enhancing functionality based on user feedback and industry best practices."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Python** along with **AWS Lambda** for backend development and optimization of VoIP services, ensuring high availability and low latency in communication systems.\nEngineered VoIP solutions leveraging **WebRTC** and **SIP** protocols to facilitate seamless call connections, significantly enhancing user experience through reduced call drop rates of up to **95%**.\nDeveloped and maintained system architecture using **Amazon Connect** and **PBX** systems, ensuring scalability and reliability with a focus on maintaining system uptime above **99%**.\nImplemented monitoring and analysis tools like **WireShark** to troubleshoot call quality and performance issues, leading to improvements in overall customer satisfaction scores by **30%**.\nCollaborated in an **Agile** development environment, utilizing tools like **Jira Software** and **Confluence** for project management, ensuring timely delivery of VoIP projects with an on-time rate of over **90%**.\nDesigned detailed process flows and system diagrams with **Visio** and **Miro**, streamlining team communications and project documentation.\nCreated and optimized scripts for call routing and voicemail systems, reducing the average call handling time by **20%** and improving responsiveness.\nWorked on the integration of security protocols, including **RBAC** and **OAuth 2.0**, to safeguard user data and ensure compliance with data protection regulations.\nConducted training sessions for team members on **SS7** and **VoLTE** standards, increasing team knowledge base and capability to handle complex VoIP solutions."
    }
  ],
  "skills": "**API Technologies**\n\tVoIP, SIP, Amazon Connect, PBX, WebRTC, VoLTE, SS7, SBCs\n\n**Programming Languages**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**Serverless and Cloud Functions**\n\tAWS Lambda\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other**\n\tMLflow, Airflow, Kubeflow, Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, WireShark, Jira Software, Confluence, Visio, Miro, Excel, Agile",
  "apply_company": "Northius"
}