{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Frontend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-118083397/",
  "profile_summary": "Senior Frontend Engineer with over 10 years of experience, specializing in **frontend development** and **responsive design**. Proven track record in enhancing **frontend performance optimization** and maintaining robust **design systems**. Proficient in **wireframing** and creating **mockups** to ensure a seamless user experience. Skilled in conducting **code reviews** to uphold highest coding standards and optimize **frontend architecture** using modern **frontend tooling** such as **React**, **Next.js**, and **Vue**.\nAdditionally, experienced in integrating **AI coding tools** and driving collaboration across teams by leveraging **effective communication** skills. Strong self-motivated professional, committed to delivering high-impact, maintainable solutions in diverse environments while ensuring adherence to compliance standards. My background in full stack development and proficiency in technologies including **JavaScript**, **TypeScript**, **Python**, **Node.js**, and cloud platforms such as **Azure** and **AWS** further bolster my capabilities to contribute to team objectives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Frontend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDesigned and implemented responsive and visually appealing front-end solutions for healthcare and finance using **React (17–18)**, **Next.js**, and **Vue 3**, prioritizing frontend performance optimization and adhering to design system maintenance.\n•\tLed the creation of wireframes and mockups for complex UIs, collaborating effectively with stakeholders to ensure alignment with user needs and expectations.\n•\tConducted thorough code reviews to maintain high coding standards and shared best practices within the team, fostering a culture of continuous improvement and self-motivation.\n•\tOptimized existing front-end architecture to enhance application efficiency, utilizing modern front-end tooling for increased productivity and responsiveness.\n•\tUtilized AI coding tools to streamline development processes, integrating advanced features into the front end, which improved user engagement in applications.\n•\tEstablished strategies for testing frontend components using **Jest** and **Cypress**, resulting in a comprehensive coverage of unit and integration tests, ensuring the reliability of the interface.\n•\tCollaborated closely with back-end developers to ensure seamless integration of APIs and services, achieving smooth data flow and improved user experiences.\n•\tImplemented best practices for responsive design across various devices, achieving a consistency rate of over **95%** in user experience across platforms.\n•\tEngaged in effective communication and collaboration within cross-functional teams, contributing to successful project delivery timelines and exceeding client expectations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Focused on **frontend development** by crafting dynamic and user-focused applications using **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, ensuring responsive design and frontend performance optimization.\nConducted thorough **code reviews** and collaborated effectively with cross-functional teams to maintain a high standard of quality and adherence to the design system, enhancing overall team productivity.\nUtilized wireframing and mockups to visualize design concepts, facilitating smooth transitions from ideation to development and ensuring alignment with user requirements.\nImplemented modern frontend tooling and architectures to boost maintainability and scalability of applications, achieving a **50%** reduction in load times for critical financial dashboards.\nRegularly updated and maintained design systems, ensuring consistency across applications and improving developer efficiency by over **30%**.\nDemonstrated self-motivation and effective communication skills while developing innovative solutions and collaborating on projects aimed at enhancing user experience in financial technologies.\nLed initiatives for **frontend architecture** improvements, adopting best practices that resulted in a **40%** increase in component reusability and streamlined development processes."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Focused on **frontend development** by designing responsive, SEO-friendly e-commerce UIs using **Next.js**, **Vue 3 + Nuxt**, and **HTML5/CSS3**, optimized for mobile-first engagement and accessibility compliance (WCAG **2.1**).\nConducted thorough **code reviews** and maintained a high standard of frontend architecture across projects, ensuring robust design system maintenance and effective collaboration with cross-functional teams.\nLeveraged modern frontend tooling including **React (18)**, **TypeScript**, and **Redux Toolkit** for enhancing frontend performance optimization, delivering fast and responsive user experiences on both web and mobile platforms.\nApplied wireframing and mockups to visualize and iterate on design concepts, ensuring alignment with user needs and business goals throughout project development phases.\nUtilized **AI coding tools** to streamline development processes, enhance code quality, and foster self-motivation within the team to explore innovative solutions.\nMaintained effective communication with stakeholders and facilitated collaboration to gather feedback and implement enhancements, driving continuous improvement in frontend functionality and user experience.\nSuccessfully integrated performance monitoring and optimization strategies, achieving a **40%** reduction in load times across key pages while ensuring consistent rendering and responsiveness under high traffic conditions.\nPromoted adherence to best practices in code quality and frontend architecture, contributing to an **80%** increase in the team's delivery speed for feature enhancements through efficient use of design systems."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular), frontend development, responsive design, frontend performance optimization, wireframing, mockups, design system maintenance, frontend architecture, modern frontend tooling\n\n**Artificial Intelligence & Machine Learning:**\n\tMLflow, Airflow, Kubeflow, AI coding tools\n\n**DevOps & Cloud:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Authentication & Security:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Databases & Caching:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**CI/CD & Infrastructure as Code:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tself-motivation, effective communication, collaboration, code reviews"
}