{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior PowerBI Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a seasoned Senior PowerBI Engineer with 8 years of experience, I specialize in Data Management and Data Transformation to deliver high-performance business intelligence solutions. Proficient in leveraging **PowerBI** for creating robust data models, I ensure adherence to Microsoft Best Practices while developing measures and optimizing data quality. My background includes working with technical documentation to facilitate long-term data strategy aligned with Web Accessibility Guidelines.\nIn addition, I have experience in full-stack development using modern technologies such as **JavaScript/TypeScript**, **Python**, and **Flutter**, along with **React**, **Node.js**, and **Django**. My expertise in cloud computing solutions spans **Azure** and **AWS**, and I have successfully integrated AI/ML capabilities for predictive analytics. I am committed to building secure, compliant applications and have a strong foundation in CI/CD automation and microservices architecture. My hands-on experience with machine learning pipelines and MLOps workflows enhances my ability to drive impactful data-driven decisions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior PowerBI Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Designed and implemented comprehensive **Data Management** strategies within **Power BI**, ensuring adherence to Microsoft Best Practices to enhance **Data Quality Diagnosis** and optimize **Data Transformation** processes.\n- Developed advanced **Data Models** tailored for healthcare and financial datasets, focusing on **Measures Creation** to facilitate real-time data insights and reporting accuracy.\n- Created interactive visualizations and dashboards in **Power BI** that adhere to **Web Accessibility Guidelines**, enabling seamless access for diverse user groups.\n- Delivered technical documentation for all **Power BI** solutions, ensuring clarity and ease of use for stakeholders and future developers.\n- Collaborated effectively using **MS Teams** to communicate project updates, gather feedback, and ensure alignment on objectives across cross-functional teams.\n- Conducted detailed analysis and diagnosis of **Data Quality** issues, implementing solutions to maintain integrity and reliability in data reporting.\n- Spearheaded the creation of detailed technical documentation, enabling streamlined onboarding for new team members and ensuring knowledge transfer for ongoing projects.\n- Implemented dashboards that deliver key performance indicators (KPIs) for operational performance, presenting complex data in an easily digestible format.\n- Evaluated the efficiency of existing data transformation processes, leading to a **30%** improvement in processing speed through optimized data flows within **Power BI**.\n- Trained team members on best practices in data visualization within **Power BI**, improving overall team proficiency and project delivery timelines by **20%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Leveraged **Power BI** for developing comprehensive data models and dashboards, enhancing data visualization and reporting for stakeholders, utilizing **Microsoft Best Practices** in the design phase.\nConducted data management and transformation tasks, ensuring high data quality through rigorous data quality diagnosis and measures creation, resulting in a **30%** improvement in reporting accuracy.\nCollaborated with cross-functional teams using **MS Teams** to ensure effective communication and alignment on project goals, contributing to the timely delivery of analytics solutions within a **3-month** timeline.\nPrepared and maintained detailed technical documentation, guiding team members and stakeholders in applying web accessibility guidelines to develop user-friendly interfaces.\nImplemented dynamic data models to support real-time analytics projects, leading to improved decision-making processes across various business departments.\nUtilized **Data Management** techniques to streamline processes that reduced data retrieval times by **25%**, significantly enhancing operational efficiency.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **PowerBI** for data visualization and reporting, transforming complex datasets into actionable insights for stakeholders, enhancing decision-making processes and data-driven strategies.\nManaged comprehensive **Data Management** practices to ensure high-quality data collection, storage, and retrieval, adhering to **Microsoft Best Practices** and **Web Accessibility Guidelines** (WCAG 2.1) for inclusivity.\nPerformed **Data Transformation** to restructure raw data into meaningful formats suitable for detailed analysis, increasing data quality and reducing inconsistencies by over **30%**.\nDeveloped and documented robust **Data Models** that accurately reflected business needs and metrics, contributing to improved data accuracy and efficiency in reporting.\nCreated **Measures Creation** in PowerBI to facilitate real-time tracking and reporting of key performance metrics, allowing for enhanced monitoring of business performance indicators.\nConducted **Data Quality Diagnosis** sessions, identifying and rectifying data integrity issues, resulting in improved reliability for business intelligence outputs by **40%**.\nCollaborated using **MS Teams** to share insights and updates with cross-functional teams, increasing communication efficiency and driving project success through improved stakeholder engagement.\nDrafted thorough **Technical Documentation** for PowerBI dashboards and data processes, ensuring maintainability and knowledge transfer for future team members.\nEnsured compliance with accessibility standards while developing reports, enhancing user access for individuals with disabilities and promoting an inclusive data reporting environment."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Nginx, Let’s Encrypt, Certbot\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, PowerBI, Data Management, Data Transformation, Microsoft Best Practices, Web Accessibility Guidelines, Data Model, Data Quality Diagnosis, Measures Creation, MS Teams, Technical Documentation",
  "apply_company": "eir evo talent"
}