{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior DevOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior DevOps Engineer with 13+ years of experience specializing in **SRE**, **DevOps**, and **CD/CI** practices. Proficient in managing **Linux** environments, implementing automation with **Ansible** and **Chef**, and skilled in building robust networking solutions. Experienced with cloud technologies, leveraging **AWS** and **Azure** for cloud-native system deployments, and adept in container orchestration using **Kubernetes** and **OpenShift**. \n\nStrong programming skills in **Python**, along with experience in **Golang**, **Ruby**, and **Scala** for infrastructure-related tasks. Additionally, I have a solid background in version control with **Git**, artifact management using **Artifactory**, and CI/CD pipelines with **Jenkins**. \n\nI have successfully delivered high-performance applications in healthcare and finance, with hands-on expertise in **FastAPI** and **Django** for backend development. Additionally, my strong communication skills complement my technical expertise, ensuring effective team collaboration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **DevOps** practices for continuous integration and continuous deployment (CI/CD) pipelines, utilizing tools such as **Jenkins**, **GitHub Actions**, and **CircleCI** to automate testing and deployment processes across multiple environments.\nManaged and optimized infrastructure using **Linux**, **AWS**, **Azure**, and **Kubernetes** to ensure high availability and scalability for production systems.\nConfigured and maintained configuration management tools like **Ansible** and **Chef** to streamline deployment processes and enhance consistency in server configuration across environments.\nDeveloped monitoring and alerting strategies for system performance and reliability, ensuring rapid identification and resolution of issues related to **Networking** and system health metrics.\nLed efforts to enhance system security and compliance by implementing best practices in source control management with **Git** and dependency management through **Artifactory**.\nCollaborated with cross-functional teams to ensure effective communication and integration of **SRE** principles into system design and incident management processes.\nConducted regular system audits and implemented improvements to streamline workflows and reduce downtime, measuring performance improvements of **over 30%** in system responsiveness.\nFostered a culture of continuous improvement through effective communication and documentation of processes, resulting in **15%** faster onboarding for new team members.\nUtilized data storage solutions and orchestration tools within the tech stack for efficient data management, supporting enhanced operational KPIs, particularly in areas related to the financial sector."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented **DevOps** practices to enhance deployment frequency by **30%**, ensuring continuous integration and delivery pipelines using **Jenkins** and **Git**.\nStreamlined infrastructure provisioning and management through automation tools like **Ansible** and **Chef**, significantly reducing system setup time by **50%**.\nManaged and maintained high-availability systems on **AWS** and **Azure**, ensuring uptime and performance for critical applications with **Linux** server management.\nCollaborated with cross-functional teams to improve **networking** and system performance, leading to a **20%** increase in application responsiveness.\nDeployed containerized applications using **Kubernetes** and **OpenShift**, facilitating the transition to microservices architecture for better scalability.\nMonitored system performance and availability through effective logging and monitoring strategies, resulting in a **40%** reduction in incident response time.\nConducted regular system security audits and implemented necessary protocols, enhancing system security posture and compliance with industry standards.\nFostered clear communication across teams to ensure seamless operations, supporting better collaboration and project execution in a **DevOps** culture."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Employed **DevOps** practices and principles to effectively manage and streamline operational processes across multiple environments, enhancing system stability and delivery speed.\nUtilized **AWS**, **Kubernetes**, and **Ansible** to automate deployment pipelines, achieving a **40%** reduction in deployment times and significantly improving code reliability through robust **CD/CI** mechanisms.\nImplemented monitoring and alerting solutions using **Prometheus** and **Grafana**, ensuring the uptime of services at **99.9%**, and quickly diagnosing network issues within minutes.\nManaged Linux servers with precision, optimizing networking configurations to support high-performance workloads and facilitate seamless communication across teams and services.\nApplied **Git** for version control and collaboration, maintaining a clean commit history for improved team efficiency on projects with up to **10** team members.\nEngaged in secure coding practices, ensuring adherence to security policies and standards while collaborating with developers on best practices in **Python** and **Golang**.\nRefined infrastructure management using **Chef** and **Artifactory**, providing an agile dev environment that enabled consistent application delivery to production environments.\nFostered effective communication among teams, translating complex technical concepts to stakeholders and ensuring alignment across business objectives and operational capabilities.\nDrove efforts to establish a culture of continuous improvement in the deployment and operational processes, leading to smoother and more predictable release cycles."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Golang, Ruby, Scala\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, Ansible, Jenkins, Git, GitHub Actions, GitLab CI/CD, Terraform, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, OpenStack, Openshift\n\n**Other:**\n\tSRE, Linux, Networking, Communication, Artifactory, CD/CI, Chef",
  "apply_company": "Blip.pt"
}