{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Backend Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Backend Software Engineer with 13+ years of experience in delivering high-performance applications, particularly within the healthcare and financial sectors. Proficient in **TypeScript**, deploying cloud solutions on **AWS**, and leveraging tools such as **Terraform** for infrastructure management. Demonstrated expertise in **CI/CD** practices using **CircleCI**, along with robust knowledge in database management including **SQL**, **NoSQL**, **Postgres**, **DynamoDB**, and **Redis**. Experienced in building and maintaining scalable backend systems with a strong understanding of **Agile**, **Kanban**, and **Scrum** methodologies. \nSkilled in developing microservices and implementing event-driven architectures, while ensuring compliance with industry standards. Additionally, I possess strong communication and interpersonal skills, enabling effective collaboration across cross-functional teams. Adept in using **Jest** and **Vitest** for testing, ensuring high-quality code delivery.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Backend Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained backend systems using **TypeScript**, integrating with various databases such as **Postgres**, **DynamoDB**, and **Redis**, ensuring efficient data retrieval and storage for applications.\n- Implemented **CI/CD** pipelines with **CircleCI** and **Git**, automating testing processes through **Jest** and **Vitest** to ensure high-quality code delivery in an agile environment.\n- Collaborated in an **Agile** team using **Scrum** and **Kanban** methodologies, enhancing team productivity and communication skills during project execution.\n- Leveraged **AWS** services for deployment and infrastructure management, utilizing **Terraform** for infrastructure as code, promoting a scalable and fault-tolerant environment.\n- Designed and optimized database schemas for both **SQL** and **NoSQL** systems, achieving **99%** uptime and improved query performance by **30%**.\n- Enhanced application performance through effective use of caching mechanisms, resulting in a **40%** reduction in load times.\n- Spearheaded the integration of real-time data processing features using **AWS** tools, ensuring efficient data handling and analysis in line with industry standards.\n- Conducted comprehensive code reviews and implemented robust testing strategies to maintain code integrity, leading to a **25%** decrease in bugs.\n- Fostered effective communication with cross-functional teams, ensuring alignment in project goals and timelines utilizing strong interpersonal skills.\n- Authored technical documentation and conducted knowledge-sharing sessions to enhance team knowledge on backend technologies and best practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Typescript** to build scalable and maintainable backend services while adhering to best coding practices, ensuring high quality and performance within the development lifecycle.\nImplemented CI/CD workflows using **CircleCI** for seamless integration and deployment, achieving deployment frequency of over **25** releases per month.\nDesigned and managed databases with **Postgres** and **DynamoDB** to optimize data storage solutions, resulting in improved query performance by **30%**.\nLed agile development teams in **Scrum** and **Kanban** methodologies, fostering effective team collaboration and continuous delivery of value through sprint planning and reviews.\nIntroduced **Terraform** for infrastructure as code, providing reproducible and secure cloud infrastructure deployments on **AWS** with an emphasis on automation.\nDeveloped unit tests using **Jest** and **Vitest**, achieving a code coverage percentage of **85%**, which significantly enhanced stability and reliability of the software.\nCreated APIs using **Node.js** (NestJS/Express) to enable smooth interaction between front-end services and backend systems, ensuring high throughput for over **10,000 transactions per minute**.\nExecuted version upgrades and patch management within the tech stack, enhancing system security and compliance without downtime.\nFacilitated effective team communication and collaboration through interpersonal skills, leading to a **15%** increase in project delivery efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **TypeScript** to enhance the robustness of backend services and improve code maintainability, ensuring excellent performance and scalability across the entire tech stack.\nUtilized **AWS** cloud services for deploying and managing applications, ensuring high availability and reliability, while utilizing **Terraform** for infrastructure as code to automate scalable deployment processes.\nImplemented CI/CD pipelines using **CircleCI** to streamline development workflows, improving deployment frequency to **multiple times per week** and reducing change failure rates through automated testing with **Jest** and **Vitest**.\nDesigned and managed SQL and NoSQL databases including **PostgreSQL** and **DynamoDB**, achieving optimized data storage solutions that enhanced query performance and reduced latency by up to **30%** during peak traffic.\nEngaged in Agile methodologies, including **Scrum** and **Kanban**, facilitating effective team collaboration and ensuring timely delivery of features in a fast-paced environment.\nDeveloped and integrated features for backend services using **Redis** for caching, achieving a reduction in response times by **50%** for frequently accessed data and improving overall user experience.\nProvided insightful communication skills and strong interpersonal skills to collaborate effectively with cross-functional teams to gather requirements and deliver solutions aligned with business objectives.\nUtilized **Wireshark** for monitoring and debugging network traffic, identifying performance bottlenecks, and optimizing data flow within the system architecture.\nCreated detailed documentation and conducted training sessions on new features for team members, enhancing knowledge sharing and operational efficiency within the team."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\tJavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tJest\n\tVitest\n\n**Serverless and Cloud Functions:**\n\tAWS\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\tDynamoDB\n\tSQL\n\tNoSQL\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tCircleCI\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tAgile\n\tKanban\n\tScrum\n\tWireshark\n\tCommunication Skills\n\tInterpersonal Skills"
}