{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior DevSecOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior DevSecOps Engineer with 13+ years of experience in delivering robust, secure applications across healthcare and financial industries. Proficient in **AWS**, **Kubernetes**, **CI/CD**, **Python**, and **TypeScript**, with a solid foundation in applying **Infrastructure-as-Code** practices to enhance deployment efficiency. Skilled in security automation and ensuring compliance with standards such as **PCI DSS**, **PSD2**, and **GDPR**. Proven ability to implement microservices and event-driven architectures, fostering agile and responsive systems. Well-versed in building AI/ML-powered platforms that support predictive analytics, automation, and real-time processing. Strong collaboration and problem-solving skills, coupled with a growth mindset, enable adaptation to dynamic technical environments. Hands-on expertise in technologies like **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, as well as experience with MLOps using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior DevSecOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and implemented **Infrastructure-as-Code** strategies using **AWS** and **Kubernetes**, ensuring scalable, secure, and efficient deployment processes across various environments.\n• Designed CI/CD pipelines utilizing **GitHub Actions**, **CircleCI**, and **Azure DevOps**, integrating automated testing, security checks, and robust deployment workflows to facilitate continuous integration.\n• Collaborated with cross-functional teams to streamline DevSecOps practices, focusing on problem-solving and enhancing security automation aligned with **PCI DSS**, **GDPR**, and other regulatory standards.\n• Engineered full-stack applications leveraging **Python**, **TypeScript**, and **Kotlin** for healthcare and fintech, maintaining compliance with required security frameworks and data privacy regulations.\n• Executed DevSecOps initiatives through a growth-oriented approach, fostering a culture of collaboration and continuous improvement among team members.\n• Implemented security automation protocols to proactively identify and mitigate vulnerabilities within the codebase and deployment workflows, strengthening overall system security.\n• Maintained and upgraded infrastructure, ensuring seamless operation of applications and adherence to best practices in security automation and compliance.\n• Leveraged advanced skills in problem-solving to address intricate security challenges, driving the integration of security at every phase of the software development lifecycle.\n• Utilized analytics and monitoring tools to oversee system performance, providing actionable insights for security enhancements and infrastructure efficiency.\n• Engaged in collaborative efforts with product teams to align development practices with organizational security mandates and regulatory requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Demonstrated expertise in **AWS** and **Kubernetes** to implement a secure and scalable infrastructure, ensuring compliance with **PCI DSS**, **PSD2**, and **GDPR** requirements.\nImplemented **CI/CD** pipelines using **Terraform** and **Ansible** for Infrastructure-as-Code, streamlining deployment processes and improving system reliability by up to **30%**.\nUtilized **Python** for developing automation scripts to enhance **Security Automation** within the development workflow, minimizing vulnerabilities and enhancing overall system security.\nLeveraged **TypeScript** and **Golang** to enhance application performance and security, resulting in a **15%** increase in deployment efficiency.\nCollaborated across teams to troubleshoot and resolve issues, exhibiting strong **Problem Solving** and **Collaboration** skills to enhance team productivity.\nFostered a **Growth Mindset** culture within the team, maintaining up-to-date knowledge of industry best practices and emerging technologies relevant to **JVM Security**.\nEngaged in regular security assessments and vulnerability scans, ensuring adherence to best practices and guiding teams to implement corrective measures swiftly."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented **Infrastructure-as-Code** using **AWS** and **Kubernetes** to streamline deployment processes and ensure scalability of applications in a cloud environment.\nEngineered CI/CD pipelines with a focus on **Security Automation**, enhancing deployment speed while ensuring compliance with **PCI DSS** and **GDPR** standards.\nUtilized advanced problem-solving skills to troubleshoot and optimize secure application workflows, fostering collaboration across multiple teams for improved efficiency.\nDesigned and maintained secure coding practices in **Python** and **Kotlin**, integrating best practices for **JVM Security** to safeguard applications against vulnerabilities.\nDeveloped and enforced role-based access control (RBAC) mechanisms to secure sensitive customer and admin access in compliance with **PSD2** regulations.\nCollaborated closely with cross-functional teams to integrate security measures into the software development lifecycle, supporting a growth mindset within the organization.\nLed initiatives to implement real-time monitoring solutions, ensuring quick detection of security threats while maintaining a low false-positive rate of under **5%**.\nChampioned code reviews and security assessments, significantly reducing potential vulnerabilities in production by **30%** through collaborative efforts.\nMentored junior engineers on best practices for secure coding and compliance standards, fostering a culture of security awareness and continuous learning within the team."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Kotlin, TypeScript, Golang\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Security Automation, Problem Solving, Collaboration, Growth Mindset, JVM Security, PCI DSS, PSD2, GDPR",
  "apply_company": "Pleo"
}