{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior IP Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a highly skilled Senior IP Engineer with 8 years of experience, I specialize in **Network Engineering**, **Routing**, **Switching**, and **Firewalls**. I possess a strong proficiency in **Automation** using **Ansible**, and **Python**, complemented by a solid understanding of **CISCO** technologies and **Stateful Firewalls**. My background includes hands-on experience with **F5**, **ACI**, and **5G** networking, as well as expertise in **IPv6** for robust network configurations.\n\nI am adept at technical problem-solving and employ analytical skills to optimize network performance and ensure security compliance. My experience in **Bash** scripting enhances my ability to automate processes and streamline operations. Additionally, I am fluent in English, facilitating clear communication across teams. With a strong foundation in deploying enterprise-grade solutions, I am committed to delivering high-quality results within complex network environments.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior IP Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and implemented network solutions with a focus on enhancing **network engineering** capabilities, including **routing**, **switching**, and **firewalls**, to meet organizational objectives.\nUtilized **Python** and **Bash** scripting for automation of deployment processes, ensuring optimal configuration and monitoring of network systems.\nConfigured and managed **stateful firewalls** and security policies, ensuring robust network security alignments with industry standards.\nEmployed **Ansible** for orchestration and automation, reducing manual efforts by **40%** and improving deployment time across various network environments.\nConducted in-depth **technical problem-solving** sessions to address and resolve complex network issues, enhancing overall system performance.\nCollaborated with cross-functional teams to design network architectures using **CISCO ACI** and **F5** technologies, ensuring seamless data flow and connectivity.\nParticipated in routing and switching protocol implementations, resulting in improved **5G** network performance and scalability for emerging technologies.\nLed the migration of IPv4 networks to **IPv6**, facilitating future-proofing and compliance with modern internet standards.\nMentored junior engineers on **networking principles** and **automation practices**, fostering a culture of continuous learning and improvement.\nDeveloped network performance monitoring tools to analyze traffic patterns and improve infrastructure resilience, achieving **99.9%** uptime.\nConducted thorough documentation and training sessions in **English** for team members on new technologies and processes, enhancing knowledge transfer and operational efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Applied strong **Network Engineering** principles in the design and implementation of complex network infrastructures, ensuring optimal routing and switching capabilities for diverse financial platforms.\n- Leveraged **Python** and **Bash** for effective automation of network configuration tasks, improving operational efficiency and reducing manual errors by **30%**.\n- Configured and maintained **Stateful Firewalls** and implemented secure network architectures using **CISCO** equipment, ensuring compliance with security protocols and protecting sensitive financial data.\n- Developed and executed automation scripts using **Ansible** to streamline network deployments and updates across multiple environments, reducing deployment time by **25%**.\n- Utilized **ACI** (Application Centric Infrastructure) to enhance data center network operations, improving application performance and availability by **40%**.\n- Gained expertise in **F5** load balancing solutions to optimize traffic distribution and enhance application uptime, leading to a **20%** reduction in downtime incidents.\n- Resolved complex network issues through **Technical Problem-Solving** and **Analytical Skills**, successfully decreasing average response times for critical incidents by **50%**.\n- Contributed to **5G** network transformation projects, ensuring compatibility with emerging technologies and enhancing overall network performance.\n- Engaged in IPv6 migration strategies, successfully transitioning legacy systems to modern standards while ensuring uninterrupted service and compatibility with existing protocols."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Utilized **Python** and **Bash** for automating network configurations and monitoring, ensuring efficient and uninterrupted services across **CISCO** networking devices and **F5** load balancers.\n• Managed extensive **networking** infrastructures through effective **routing** and **switching** protocols, enhancing data flow and reducing latency across the organization.\n• Configured and maintained **stateful firewalls** to secure network boundaries, ensuring comprehensive protection against internal and external threats.\n• Developed scripts with **Ansible** to automate repetitive tasks, improving operational efficiency and reducing error rates by up to **30%**.\n• Implemented **automation** strategies using **ACI** for better resource management, enhancing scalability, and streamlining network operations.\n• Conducted thorough **technical problem-solving** to troubleshoot connectivity and configuration issues, achieving a resolution rate of **95%** on first contact.\n• Collaborated on migrating legacy systems to **IPv6**, facilitating improved access and compatibility within modern networking environments.\n• Applied **network security best practices** to maintain compliance with industry standards, improving overall cybersecurity posture.\n• Documented configurations and protocols to support team understanding and knowledge sharing, boosting team performance during **5G** transitions.\n• Provided training to junior engineers on routing, switching, and firewall management, enhancing team analytical skills and technical knowledge across network components."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Bash\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tJavaScript, TypeScript, React, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tCISCO, 5G, IPv6\n\n **Other:**\n\tNetwork Engineering, Routing, Switching, Firewalls, Automation, Stateful Firewalls, ACI, JNCIA, F5, Technical Problem-Solving, Analytical Skills, English, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot",
  "apply_company": "COCUS"
}