{
  "name": "Rei Taro",
  "role_name": "Senior Cloud Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Cloud Engineer with over 10 years of experience in delivering high-quality cloud solutions leveraging **AWS**, **Azure**, and **OpenStack**. Expert in designing and implementing infrastructure as a service (**IaaS**), platform as a service (**PaaS**), and utilizing networking capabilities to create scalable architectures. Proficient in managing AI/ML pipelines and deploying applications in cloud-native environments, while also integrating with tools like **Salesforce** and **HubSpot**. Demonstrated ability to communicate complex ideas clearly and collaborate effectively with cross-functional teams, ensuring a customer-centric approach to technology solutions. Successful track record with major clients including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Azure App Services** and **Terraform** for robust cloud-based deployment and infrastructure management, enhancing **PaaS** capabilities by up to **30%**.\nEngineered backend services using **Python** and **FastAPI** to optimize document automation workflows, reducing processing time by **25%**.\nDeveloped event-driven architectures employing **Celery** and **Redis** to facilitate asynchronous financial transaction processing, improving system reliability significantly.\nCreated and maintained intricate data pipelines with **Apache Airflow** and **Azure Functions** to ensure compliance with regulatory data standards, yielding a **100%** accuracy rate in data exchange.\nLed security initiatives by integrating **OAuth2** and **Azure AD B2C** for scalable authentication systems, thereby elevating security profiles and reducing vulnerabilities.\nCollaborated effectively with cross-functional teams, enhancing communication and presentation aspects to troubleshoot system integration challenges and implement agile release strategies."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Leveraged **IaaS** and **PaaS** cloud services for deploying and managing scalable solutions on **Azure App Services**.\nConducted regular performance evaluations and security audits to ensure compliance with industry standards and best practices.\nEngineered collaborative solutions integrating **Salesforce** and **HubSpot** for enhanced customer-centric project outcomes.\nOrchestrated seamless communication among cross-functional teams to support system integrations and project delivery, ensuring project timelines were met within **90%** efficiency.\nImplemented NVIDIA **GPU** processing for enhancing AIaaS capabilities in handling complex tasks efficiently.\nDesigned redundant networking solutions utilizing **OpenStack** and **VMware** technologies to maintain optimal system operations and resource utilization by **30%**.\nAutomated processes using **Terraform** for infrastructure as code to ensure consistent environment deployments, reducing manual effort by **40%**.\nEmployed effective presentation skills to convey technical concepts to non-technical stakeholders, achieving a **95%** success rate in project buy-ins."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **IaaS** and **PaaS** solutions to optimize backend architecture and enhance service delivery efficiency by **30%**.\nEngineered and maintained cloud infrastructure using **OpenStack** to ensure robust deployment and scalability for various applications with a focus on high availability.\nCollaborated with cross-functional teams to implement networking solutions that improved system connectivity and user experience, resulting in a **20%** increase in customer satisfaction ratings.\nDeveloped comprehensive communication strategies that improved team collaboration, ensuring alignment and transparency across projects.\nSupported customer-centric initiatives by leveraging **Salesforce** and **HubSpot** analytics to tailor services to client needs, leading to a **15%** reduction in response time.\nPresented complex technical concepts to stakeholders, enhancing understanding and facilitating informed decision-making processes.\nImplemented security measures and compliance protocols in line with regulatory standards to protect customer data, ensuring adherence to best practices within the industry."
    }
  ],
  "skills": "  **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n  **Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n  **API Technologies**\n\tREST/gRPC APIs\n\n  **DevOps**\n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes, GitHub Actions, Azure DevOps\n\n  **Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n  **Cloud & Infrastructure**\n\tCloud, AIaaS, GPU, IaaS, Bare Metal, PaaS, VMware, OpenStack\n\n  **Other**\n\tMicroservices, Kafka, CI/CD, PyTest, Git, Presentation, Communication, Collaboration, Customer-centric, Salesforce, HubSpot",
  "apply_company": "Gcore"
}