{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Field Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Field Engineer with 8 years of experience, I excel in troubleshooting and preventative maintenance across biomedical, electrical, and mechanical systems. I possess strong customer service and communication skills that enhance client engagement and satisfaction. My technical proficiency includes extensive knowledge of **Windows**, **Networking**, and **Database** systems, allowing me to effectively analyze and resolve complex issues.\n\nIn addition to my core skills, I bring a proven track record in building high-performance solutions with frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My development experience encompasses cloud services with **Azure** and **AWS**, and I have successfully led projects that integrate AI/ML capabilities for innovative solutions. My background in microservices architecture and CI/CD automation supports the delivery of secure applications compliant with industry standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Provided exceptional **customer service** by effectively communicating complex technical concepts to clients and team members, ensuring clarity and understanding in support and project discussions.\n- Conducted **troubleshooting** of biomedical, electrical, and mechanical systems within field environments, diagnosing and resolving issues to maintain optimal equipment performance and availability.\n- Executed **preventative maintenance** strategies on medical devices and related technologies to enhance reliability and extend operational life, achieving a **25% reduction** in equipment downtime.\n- Performed **calibration** of complex biomedical instruments, adhering to strict compliance protocols and standards to ensure precision in measurements within health settings.\n- Collaborated closely with clients to provide on-site **sales** support for advanced biomedical solutions, contributing to a **15% increase** in regional sales revenue over a **12-month** period.\n- Engaged in intensive **networking** efforts to expand professional relationships within healthcare and engineering sectors, enhancing visibility and reputation of services offered.\n- Assisted in the development and management of database systems for tracking maintenance activities and service records, improving data retrieval efficiency by **30%**.\n- Leveraged **Windows** and various technical tools to streamline workflows and enhance operational effectiveness across various projects.\n- Documented and reported on service activity and technical insights, contributing valuable data for continuous improvement cycles and future technological implementations.\n- Provided technical support and guidance on troubleshooting strategies to junior engineers and interns, fostering growth and enhancing team competency."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Performed troubleshooting and preventative maintenance on biomedical equipment, ensuring compliance with safety and service standards, leading to a **98%** customer satisfaction rate.\nConducted calibration and quality checks on electrical and mechanical systems, enhancing operational reliability and reducing downtime by **20%**.\nMaintained and repaired Windows-based systems and databases, ensuring seamless networking capabilities to support ongoing customer operations in the healthcare sector.\nDelivered exceptional customer service by actively communicating with clients and team members, fostering collaboration and leading to a **30%** increase in resolution speed.\nExecuted sales strategies for biomedical products, driving revenue growth and expanding customer base in competitive markets.\nUtilized proper documentation of service activities and technical insights to refine preventive maintenance processes, contributing to a **15%** decrease in repeat service calls."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized strong **troubleshooting** skills to diagnose and resolve complex biomedical, electrical, and mechanical equipment issues in the field, enhancing operational efficiency for critical healthcare systems.\nPerformed **preventative maintenance** and **calibration** services on high-value medical devices, ensuring operational compliance and reducing downtime by up to **25%**.\nProvided expert **customer service** and technical support during equipment installations and routine checks, achieving a **95%** customer satisfaction rating based on follow-up surveys.\nFacilitated **sales** interactions by effectively communicating technical specifications and benefits of advanced engineering solutions to potential clients, contributing to a **30%** increase in revenue.\nManaged and maintained **networking** systems for medical equipment, ensuring secure connections and data integrity across devices in compliance with health regulations.\nDesigned and implemented solutions for efficient **database** management to support medical equipment tracking and maintenance logs, optimizing retrieval speed by **40%**.\nEstablished robust **communication** channels with healthcare professionals, delivering training sessions on equipment usage, maintenance protocols, and safety standards to enhance user proficiency and confidence.\nProvided expertise in utilizing **Windows** operating systems for troubleshooting and configuring medical devices, improving workflow and productivity among field teams.\nDemonstrated proficiency in performing hands-on **calibration** and system checks for diverse medical technologies, adhering to precise engineering standards and manufacturer specifications."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Troubleshooting, Preventative Maintenance, Calibration, Sales, Windows, Networking, Customer Service, Communication, Biomedical, Electrical, Mechanical",
  "apply_company": "myGwork - LGBTQ+ Business Community"
}