{
  "name": "Damian Franciszek Pospiech",
  "role_name": "DevOps Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "DevOps Engineer with 13+ years of experience in delivering high-performance applications and robust infrastructural solutions. Proficient in **Kubernetes**, **AWS**, **GCP**, **Azure**, and implementing **infrastructure as code** using **Terraform** and **Ansible**. Demonstrated expertise in monitoring and logging through tools like **Prometheus**, **Grafana**, and the **ELK stack**. Skilled in **Redis** and **PostgreSQL** for database management, ensuring high availability and performance.\nHands-on experience with automation techniques that streamline processes and reduce operational overhead. Proven ability to thrive in high-pressure situations, exhibiting strong problem-solving skills and ownership in project execution. Additionally, well-versed in compliance-driven development with a solid background in building applications in the healthcare and financial sectors, utilizing **JavaScript/TypeScript**, **Python**, **Flutter**, and modern frameworks such as **React**, **Next.js**, and **Vue**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "DevOps Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented **infrastructure as code** solutions using **Terraform**, **Ansible**, and **Helm** to manage and provision cloud resources on **AWS**, **GCP**, and **Azure**, ensuring efficient and scalable infrastructure management.\nOrchestrated containerized applications using **Kubernetes**, optimizing resource allocation and enhancing deployment strategies with tools like **Prometheus** and **Grafana** for monitoring.\nDesigned and maintained high-availability data stores with **PostgreSQL** and **Redis**, ensuring data integrity and performance under varying loads and operational pressures.\nConducted automation of deployment workflows using **CI/CD** pipelines, significantly reducing deployment time by **70%** and minimizing manual errors.\nManaged application logging and monitoring with the **ELK stack**, providing real-time insights into system performance and operational health.\nLed efforts to establish streamlined communication between development and operations teams, championing a culture of ownership and collaboration to solve high-pressure problems.\nTrained team members on best practices for using **Kubernetes** and cloud services to ensure smooth, efficient operations across the development lifecycle.\nDeveloped and maintained documentation for deployment processes and cloud infrastructure to ensure clarity and knowledge sharing across teams.\nActively participated in incident response and troubleshooting, applying analytical skills to quickly diagnose and resolve issues, minimizing downtime by **40%**."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented and managed cloud infrastructure with **AWS**, **GCP**, and **Azure**, ensuring high availability and scalability for mission-critical applications.\nUtilized **Terraform** and **Ansible** for infrastructure as code, automating deployment and configuration of environments for seamless integration and consistent management.\nMonitored system performance and application health using **Prometheus** and **Grafana**, resulting in a **30%** reduction in downtime due to proactive alerting and metrics visualization.\nOrchestrated containerized applications with **Kubernetes**, optimizing deployment processes and improving operational efficiency by **25%**.\nManaged data storage solutions using **PostgreSQL** and **Redis**, enhancing data retrieval times by **40%** for critical financial applications.\nDeveloped Helm charts for application deployment on **Kubernetes**, streamlining the release process for microservices across development and production environments.\nDesigned and executed automation scripts for regular maintenance and scaling strategies to accommodate a **50%** increase in user transactions.\nExercised ownership of the CI/CD pipeline, leading to improved release quality and reduced deployment times by **15%** through systematic integrations and testing workflows.\nEngaged in high-pressure problem-solving, addressing performance issues swiftly to ensure uninterrupted service delivery in a fast-paced financial environment."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented and managed container orchestration using **Kubernetes**, ensuring efficient deployment and scaling of microservices within a high-traffic e-commerce platform.\nLeveraged **Terraform** for **infrastructure as code**, automating the provisioning of **AWS**, **GCP**, and **Azure** cloud resources to support development and production environments.\nManaged database operations using **PostgreSQL** and **Redis**, ensuring optimized performance and high availability for critical backend services.\nMonitored system performance and reliability using **Prometheus** and **Grafana**, facilitating data-driven decisions and proactive issue resolution.\nExecuted continuous integration and delivery (CI/CD) pipelines, enhancing workflow automation and reducing deployment errors by over **40%**.\nImplemented logging and monitoring solutions using the **ELK stack**, ensuring comprehensive system observability and troubleshooting capabilities.\nConducted high-pressure problem-solving and ownership of incident response processes, maintaining system uptime above **99.9%**.\nUtilized **Ansible** and **Helm** for automated configuration management, streamlining software deployments and system updates.\nDeveloped disaster recovery strategies to ensure business continuity, significantly reducing potential downtime to under **2 hours** during unexpected outages.\nFostered collaboration across development and operations teams to enhance automation practices and improve overall system resilience."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob Storage, SQL Database), GCP\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm\n\n**Cloud & Infrastructure:**\n\tInfrastructure as Code, Automation, Prometheus, Grafana, ELK stack\n\n**Other:**\n\tKeycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, High-pressure problem-solving, Ownership"
}