{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Developer Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Developer Engineer with 13+ years of experience in delivering high-performance applications tailored for ERP solutions and relational database systems. Expertise in **C#**, **Java**, and **object-oriented development** drives robust application architecture and seamless integration. Proven ability in team collaboration and customer-oriented approaches to meet project objectives.\nSkilled in meticulous analysis and documentation practices to ensure clarity and transparency in project workflows. Adept at applying excellent communication skills to promote effective remote support and collaboration across teams. Additionally, strong proficiency in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on experience in both frontend and backend development leveraging **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Possesses a solid foundation in building AI/ML-powered platforms for predictive analytics, while proficiently deploying cloud-native systems on **AWS** and **Azure** and implementing microservices architectures and CI/CD pipelines.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Developer Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **C#**, **Java**, and **ABL** to develop and enhance ERP systems, ensuring efficient object-oriented development practices and robust software solutions.\nConducted thorough documentation and analysis of systems to foster understanding and maintain regulatory compliance across various projects.\nCollaborated effectively within cross-functional teams, utilizing strong **communication** skills to deliver timely and high-quality software solutions that align with customer orientation.\nProvided remote support to team members and clients, optimizing troubleshooting processes through analytical approaches and effective problem resolution.\nEngaged in team collaboration to refine development processes, employing a systematic approach to coding standards and best practices.\nImplemented and maintained relational databases, ensuring optimal data integrity and performance across applications.\nDeveloped and executed test plans to ensure quality assurance and performance reliability in software applications, enhancing overall user experience.\nLeveraged analytical skills to analyze user feedback and system performance, driving iterative improvements and feature enhancements.\nFacilitated workshops and training sessions to improve team knowledge and skills in service-oriented architecture and documentation best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **C#** and **Java** to enhance and maintain core components of financial ERP systems, ensuring seamless functionality and user satisfaction.\nEmployed strong **analytical skills** to conduct comprehensive analysis of system performance and identify areas for improvement.\nCollaborated effectively with cross-functional teams, demonstrating excellent **team collaboration** and **communication** skills to address project milestones and client needs.\nProvided **remote support** for financial applications, quickly resolving issues and enhancing user experience through clear **documentation** and problem-solving techniques.\nLeveraged **relational databases** to design efficient data storage solutions, improving data retrieval times by **30%** in high-volume transactional scenarios.\nEngaged in **object-oriented development** practices, contributing to the modularity and reusability of code across multiple projects, reducing code redundancy by **25%**.\nFacilitated integration with **ServiceNow** for incident management, streamlining customer orientation processes and improving response times by **15%**.\nLed presentations and workshops to share knowledge and foster team collaboration, enhancing overall technical competence within the team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C#** and **Java** for object-oriented development to create optimized modules for an ERP system, ensuring seamless integration and high performance.\nConducted thorough analysis and documentation of system requirements to enhance ERP functionalities, delivering tailored solutions to meet customer needs.\nCollaborated with cross-functional teams in a remote support environment, fostering strong team collaboration and communication to drive project success.\nApplied analytical skills to troubleshoot issues and provide effective solutions, improving system reliability and customer satisfaction.\nEnsured adherence to best practices in relational database management, resulting in a **30%** increase in data retrieval efficiency for Oracle and SQL Server.\nDeveloped comprehensive documentation and manuals for ERP solutions, facilitating ease of use and training for customers, which contributed to a **20%** decrease in support requests.\nImplemented customer-oriented features based on user feedback, elevating user experience and achieving a **15%** improvement in customer engagement metrics.\nParticipated in regular team meetings, contributing ideas and insights that led to a more collaborative work environment and improved project timelines.\nEngaged in continuous improvement initiatives, enhancing overall software quality and embracing agile methodologies to deliver solutions within strict deadlines."
    }
  ],
  "skills": "**Programming Languages:**\n\tC#, Java, ABL, Python, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS; Azure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, relational databases\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database\n\n**Other:**\n\tERP, object-oriented development, ServiceNow, documentation, analysis, remote support, team collaboration, customer orientation, analytical skills, communication",
  "apply_company": "Proalpha"
}