{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Sales Engineer, I bring a strong background in **cloud security**, **Cybersecurity**, and **SASE**, supported by my expertise in compliance frameworks such as CISSP and CCNP. With 8 years of experience as a Full Stack Developer, I have built high-performance solutions across the healthcare and financial sectors using **JavaScript/TypeScript**, **Python**, and **Flutter**. My technical proficiency includes working with **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, in addition to my deep cloud experience with **Azure** and **AWS**. \n\nI am adept at delivering impactful presentations and employing value selling techniques to effectively communicate technical solutions to clients. My remarkable ability to lead the development of enterprise-grade platforms integrates AI/ML capabilities for predictive analytics, along with a strong foundation in microservices architecture and CI/CD automation. I ensure the delivery of robust and secure applications that are aligned with compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Demonstrated expertise in **cloud security** solutions, delivering compelling presentations on topics such as **SASE**, **DLP**, and **CASB** to prospective clients in the healthcare and financial industries.\n- Leveraged extensive knowledge of **Cybersecurity** principles, acting as a technical advisor on integrated security systems including **IPS** and **Proxy** technologies, enhancing client trust and satisfaction.\n- Delivered technical demonstrations and conducted value selling sessions, utilizing strong presentation skills to articulate the benefits of integrated **CNAPP** solutions to various stakeholders.\n- Collaborated with cross-functional teams to tailor cybersecurity solutions that meet client requirements, ensuring seamless adoption and compliance with industry standards such as CISSP and CCNP.\n- Developed and executed strategic sales plans targeting key sectors, achieving a **25%** increase in quarterly sales through effective engagement and solution positioning.\n- Conducted market research and competitive analysis to refine messaging around **cloud security** offerings, resulting in a **15%** year-over-year growth in customer acquisition.\n- Established deep relationships with existing customers, providing ongoing support and training to enhance their understanding of cybersecurity threats and mitigations, leading to a **20%** improvement in customer retention.\n- Contributed to knowledge-base articles and sales enablement materials, enhancing organizational capabilities in communicating product value and technical details to prospective clients."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Demonstrated expertise in **cloud security** and **Cybersecurity** to effectively communicate high-value solutions tailored to client needs, resulting in a **20%** increase in sales conversion rates.\nCreated impactful presentations showcasing the advantages of **SASE** solutions, which contributed to a **15%** improvement in client engagement metrics during demonstrations.\nUtilized knowledge of **IPS** and **DLP** to address client concerns regarding data security and network protection, driving confidence in our solutions and fostering client relationships.\nImplemented **CASB** and **CNAPP** in discussions with prospects, articulating their benefits in mitigating risks associated with cloud environments, leading to a **30%** rise in interest during technical evaluations.\nEngaged in **Value Selling** techniques by aligning the technical capabilities of our products (including **Proxy** services) with the business goals of clients, resulting in higher customer satisfaction ratings.\nCollaborated effectively within cross-functional teams to devise strategies that improved client onboarding processes and enhanced the overall customer journey, paving the way for long-term partnerships.\nMaintained an up-to-date understanding of industry standards and best practices, including **CISSP** and **CCNP**, ensuring each solution was compliant and robust against emerging threats."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **cloud security** and **Cybersecurity** expertise to present tailored solutions that align with customer needs, enhancing engagement and closing deals effectively.\nConducted compelling **presentations** and demonstrations focusing on **DLP**, **CASB**, and **CNAPP** solutions to address client concerns, resulting in a **25%** increase in customer satisfaction ratings.\nUtilized **SASE** and **IPS** strategies to provide secure network solutions, contributing to a **30%** reduction in reported security incidents for clients.\nAdvised clients on the integration of **Proxy** solutions into their infrastructure, improving their cybersecurity framework and generating a **15%** uplift in overall security performance.\nEngaged in **Value Selling** by correlating **CCNP** and **CISSP** certifications to reinforce trust and authority during client consultations, leading to successful conversions in **70%** of targeted accounts.\nCollaborated with the technical team to ensure seamless configuration and deployment of solutions, facilitating subject matter expertise in technical discussions, and enhancing customer relations.\nMaintained up-to-date knowledge of industry trends and product advancements to effectively articulate the benefits of company offerings in comparison to competitors.\nProvided after-sales support by troubleshooting and resolving client issues, fostering long-term relationships, and ensuring continued engagement with the platform."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tJWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Authentication, Security, Keycloak, Let’s Encrypt, Nginx, Certbot, cloud security, SASE, Cybersecurity, Proxy, IPS, DLP, CASB, CNAPP, CISSP, CCNP, Value Selling, presentations",
  "apply_company": "Zscaler"
}