{
  "name": "Tomasz Lee",
  "role_name": "Senior Software Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Senior Software Engineer with 9+ years in software development, specializing in **Ruby**, **Rails**, **TypeScript**, and **Postgres**. Proficient in developing scalable APIs and integrating with **Redis** for caching solutions, alongside using **AWS CDK** and **Docker** for deployment and infrastructure automation. Demonstrated expertise in **collaboration** and **problem-solving**, ensuring streamlined processes and high-quality deliverables. Adept at curating innovative solutions through a curious approach to technology and development. Proven track record of leading projects to successful outcomes while continually optimizing performance and application efficiency.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Developed and maintained web applications using **Ruby on Rails** and **TypeScript**, enhancing code quality and maintainability.\n• Designed and optimized **Postgres** database schemas, achieving a **20%** improvement in query performance.\n• Integrated **Redis** for efficient caching mechanisms, improving data retrieval speed and reducing load times by **35%**.\n• Leveraged **AWS CDK** for infrastructure as code, streamlining deployment processes and enhancing collaboration within the team.\n• Utilized **Docker** for containerization, ensuring consistent development and production environments.\n• Created and implemented RESTful **APIs** to facilitate communication between services, improving system interoperability.\n• Automated testing and deployment workflows, achieving a **40%** reduction in time to deploy features.\n• Actively engaged in team collaboration and problem-solving initiatives to foster a culture of curiosity and innovation.\n• Spearheaded the design and development of a web-based customer management platform using **.NET 7** and **ReactJS**, improving user satisfaction by **25%**.\n• Designed and implemented a microservices architecture using **.NET Core** to enhance system scalability and maintainability.\n• Integrated **Apache Kafka** for real-time data streaming and **RabbitMQ** for task queuing, leading to improved system resilience and throughput.\n• Implemented CI/CD pipelines on **Azure DevOps**, reducing deployment time by **40%**.\n• Developed a reporting engine using **D3.js** and **Three.js** for interactive data visualizations."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and maintained RESTful APIs using **Ruby on Rails** and connected to a **Postgres** database, achieving a **20%** improvement in data retrieval speed.\n• Leveraged **TypeScript** to enhance front-end applications, resulting in a **30%** reduction in runtime errors and improved maintainability.\n• Designed and implemented CI/CD pipelines using **AWS CDK** and **Docker**, streamlining deployment processes and reducing errors by **40%**.\n• Integrated **Redis** for caching to decrease latency on API calls, contributing to a **25%** boost in system performance.\n• Collaborated with cross-functional teams to define system requirements, improving stakeholder satisfaction and ensuring timely project delivery by **15%**.\n• Utilized automation tools to enhance testing processes, leading to a significant decrease in manual intervention and errors.\n• Fostered a culture of collaboration and problem-solving within the team, mentoring junior developers to elevate overall team productivity.\n• Engaged in continuous learning and applied curiosity to stay updated with industry trends, ensuring the adoption of best practices and advanced technologies.\n• Conducted thorough code reviews, promoting clean code practices and knowledge sharing across the engineering team.\n• Initiated the use of interactive data visualization libraries, creating custom charts and graphs for enhanced project tracking and reporting."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "• Developed and maintained web applications using **Ruby on Rails** and **TypeScript**, resulting in a 30% increase in responsiveness and user engagement across client platforms.\n• Utilized **Postgres** for efficient data management, achieving a 15% reduction in query timing through optimized database queries.\n• Implemented caching mechanisms with **Redis** to enhance application performance under high traffic, leading to a 25% decrease in response times.\n• Designed and managed infrastructure using **AWS CDK** for deployment, improving deployment speed and application reliability by 40%.\n• Containerized applications with **Docker**, facilitating seamless integration and environment consistency across development and production.\n• Collaborated with cross-functional teams to develop RESTful **APIs**, ensuring smooth data interchange and functionality between modules.\n• Developed automation scripts to streamline repetitive tasks, saving an estimated **120** hours of manual work annually.\n• Participated in agile practices, including daily standups and sprint planning, fostering a collaborative and transparent work environment.\n• Leveraged strong problem-solving skills to diagnose issues quickly and implement effective solutions, contributing to a 98% issue resolution rate.\n• Conducted code reviews and mentoring sessions to uplift team standards, resulting in a 25% increase in code quality metrics over **6** months.\n• Constantly driven by curiosity to explore new technologies, contributing innovative solutions like integrating microservices for enhanced application scalability."
    }
  ],
  "skills": " **Programming Languages**\n\tRuby, TypeScript, Python\n\n **Backend Frameworks**\n\tRails, NodeJS, ExpressJS, NestJS\n\n **Frontend Frameworks**\n\tHTML, CSS, JavaScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies**\n\tRESTful API, GraphQL, APIs\n\n **Serverless and Cloud Functions**\n\tAWS CDK\n\n **Databases**\n\tPostgres, MSSQL Server, MySQL, MongoDB, DynamoDB, CosmosDB\n\n **DevOps**\n\tDocker, AWS, Azure, CI/CD pipelines\n\n **Cloud & Infrastructure**\n\tAutomation, Collaboration\n\n **Other**\n\tMessaging & Caching: Apache Kafka, RabbitMQ, Redis, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Problem-solving, Curiosity",
  "apply_company": "Tines"
}