{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Field Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic Software Engineer with over 13 years of extensive experience in software engineering and full-stack development, possessing strong problem-solving abilities and excellent communication skills, essential for customer support and technical training. Adept at collaborating with multidisciplinary teams to deliver high-performance applications. Proficient in delivering solutions using **JavaScript/TypeScript**, **Python**, **Flutter**, and frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in cloud deployment on **AWS** and **Azure**, and implementing microservices and CI/CD pipelines to enhance operational efficiency.\nSpecializing in creating AI/ML-powered platforms that offer predictive analytics and real-time processing, with skills in MLOps tools like **MLflow**, **Airflow**, and **Kubeflow**. Background in compliance-driven development, ensuring alignment with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, brings a strong foundation in math and science, enhancing technical training and presentation skills.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Field Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Delivered exceptional customer support by effectively communicating complex technical solutions related to **digital printing** equipment, ensuring alignment with customer needs and enhancing user experience.\nFacilitated technical training sessions for clients and internal teams, focusing on **software engineering** principles and best practices tailored to **digital printing** technologies.\nDemonstrated strong problem-solving capabilities by troubleshooting and resolving technical issues in **digital printing** systems, reducing downtime by **30%** through swift intervention and user education.\nCollaborated with cross-functional teams, leveraging team collaboration skills to streamline processes and enhance the integration of **digital printing** solutions into client workflows.\nPresented technical demonstrations and solutions to clients, utilizing advanced presentation skills to convey the benefits of various **digital printing** solutions.\nApplied in-depth understanding of chemistry and fluid physics principles to optimize printing processes and address customer inquiries regarding material compatibility and performance.\nEngaged in technical discussions with engineers and clients, demonstrating strong communication skills while addressing engineering concepts relevant to **digital printing** technologies.\nUtilized math skills to analyze print quality metrics and implement enhancements, contributing to an overall customer satisfaction improvement of **25%**.\nSupported the transition of traditional printing techniques to innovative digital solutions, highlighting the technical training provided to clients and the team's adaptability in a fast-paced environment."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **software engineering** principles to deliver high-quality technical training to clients, ensuring they are well-supported in navigating complex systems.\nExecuted **customer support** initiatives by addressing and solving client issues, fostering a reputation for excellent problem-solving capabilities.\nCollaborated with cross-functional teams, enhancing **team collaboration** efforts to ensure seamless deployment of engineering projects.\nConducted presentations highlighting **communication** skills, effectively conveying technical information to non-technical stakeholders.\nApplied **math skills** to support troubleshooting and analytic processes, streamlining project workflows.\nLeveraged knowledge in **electrical engineering** and **fluid physics** to optimize system designs and improve digital printing solutions.\nDemonstrated **technical training** abilities by creating detailed documentation and guides that empowered users and reduced support request volumes.\nEngaged in ongoing **problem solving** and innovating strategies to overcome technical challenges in real-time field operations, directly impacting project success rates by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "- Leveraged **software engineering** principles to optimize systems, ensuring high availability and low latency for field operations while supporting **digital printing** solutions.\n- Collaborated with cross-functional teams to enhance **customer support**, driving improvements in service delivery through effective **problem solving** techniques.\n- Provided **technical training** to team members, leveraging **presentation skills** to convey complex concepts in an understandable manner, resulting in a **30%** increase in team proficiency.\n- Utilized strong **communication** skills to liaise with clients, ensuring their needs were met and providing tailored **customer support** solutions leading to a **15%** boost in customer satisfaction ratings.\n- Applied **math skills** to analyze and troubleshoot field equipment malfunctions, ensuring swift resolution of issues and minimizing downtime by up to **20%**.\n- Engaged in **team collaboration** to roll out innovative solutions in **electrical engineering** and **fluid physics**, resulting in increased project efficiencies and improved operational outcomes.\n- Demonstrated **problem solving** capabilities by addressing technical challenges in field operations, achieving solution implementation within **3 days** of incident report.\n- Advocated for best practices in **digital printing**, including adherence to safety and quality standards, contributing to a **10%** reduction in material waste.\n- Supported product launches and upgrades through **technical training** programs, resulting in a significant elevation of team and stakeholder understanding of new features and services."
    }
  ],
  "skills": "****Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n****Backend Frameworks:\n\n****Frontend Frameworks:\n\n****API Technologies:\n\n****Serverless and Cloud Functions:\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n****Databases:\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n****DevOps:\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n****Cloud & Infrastructure:\n\tTerraform, Ansible, Helm, Docker Compose\n\n****Other:\n\tdigital printing, customer support, technical training, problem solving, team collaboration, presentation skills, chemistry, fluid physics, electrical engineering, software engineering, math skills, communication",
  "apply_company": "FUJIFILM Dimatix, Inc."
}