{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior FullStack Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "Dedicated Senior Full Stack Engineer with 8 years of comprehensive experience in **Python**, **TypeScript**, and robust API integration, specializing in **AWS** cloud services, security protocols, and compliance frameworks for B2B and SaaS applications. Proven track record in the financial and HR tech domains, delivering high-performance solutions through the development of secure, scalable software aligned with OWASP standards.\nExpert in leveraging microservices architecture and CI/CD practices, I adeptly build applications that enhance collaboration and drive problem-solving efficiencies. My technical arsenal includes **React**, **Node.js**, **Django**, and **Flutter** for front-end and back-end development, complemented by experience in AI/ML integration for advanced analytics and real-time data processing. Committed to delivering exceptional results in complex environments while ensuring the integrity of integrations.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained robust **APIs** for healthcare and financial platforms utilizing **Python** and **TypeScript**, ensuring enhanced integration and security measures compliant with OWASP standards.\n- Collaborated effectively in a **B2B** environment, employing **AWS** services to build scalable, cloud-based solutions tailored for **FinancialPlatforms** and **HRTech** sectors.\n- Led the deployment of secure applications by implementing comprehensive security strategies and vulnerability assessments, aiming to maintain user data protection and application integrity.\n- Achieved **99.9%** uptime by optimizing system architecture for high availability and load balancing across multiple applications using **AWS** services.\n- Spearheaded a migration to **SaaS** models for financial services, leading to a **25%** increase in user engagement and improving service accessibility through modern web technologies and frameworks.\n- Orchestrated the integration of advanced machine learning features into applications, enhancing user experience and predictive capabilities, utilizing industry-standard tools such as **Python**, **TensorFlow**, and **scikit-learn**.\n- Instrumented deployment pipelines using **AWS** with a focus on security and performance, implementing CI/CD practices to facilitate timely releases and minimize downtime.\n- Contributed to team problem-solving efforts by troubleshooting complex technical issues and proposing effective solutions, ensuring the continuous improvement of development processes.\n- Ensured seamless collaboration across teams, mentoring junior developers and promoting best practices in code quality and application security throughout the software development lifecycle."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **TypeScript** to design and implement secure APIs, ensuring compliance with **OWASP** standards and enhancing the overall security posture of financial applications.\nLed integration efforts between various platforms, utilizing **AWS** services to streamline B2B transactions and improve user experience across financial systems.\nCollaborated with cross-functional teams to resolve complex problems, applying innovative solutions that increased the efficiency of **SaaS** offerings by **30%**.\nDrove the modernization of legacy financial platforms through a microservices architecture utilizing **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), amplifying throughput for high-volume transaction systems.\nEngineered dynamic front-end applications using **React** (18), **Vue 3**, and **Next.js**, implementing **TypeScript** with **Redux Toolkit** and **Tailwind CSS** to craft responsive interfaces for user dashboards.\nDeveloped real-time monitoring and analytics dashboards leveraging **React**, **D3.js**, and **Power BI Embedded**, assisting operations teams in tracking financial activity to detect anomalies and extract actionable insights.\nIntegrated messaging systems such as **Kafka**, **RabbitMQ**, and **Azure Service Bus** to build a resilient event-driven architecture for seamless transaction processing, alerting, and compliance workflows.\nDesigned and orchestrated ETL pipelines with **Python**, **Apache Airflow**, and **Azure Data Factory**, facilitating both batch and real-time data ingestion from various financial sources, improving data availability by **40%**.\nImplemented AI/ML-based fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, enhancing detection capabilities by **50%** through analysis of transaction patterns and user behavior.\nCreated ML pipelines for critical functionalities like credit scoring and churn prediction, utilizing **MLflow** and **Airflow** for real-time decision-making by integrating model inference directly into backend services."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Leveraged **Python** for backend development, ensuring robust API integrations and seamless communication between services, focusing on high performance and scalability for **AWS** cloud environments.\nUtilized **TypeScript** to enhance the frontend applications, effectively collaborating on driving edge features while maintaining code quality and comprehensibility.\nImplemented secure coding best practices and ensured compliance with **OWASP** guidelines, optimizing application security and protecting sensitive user data throughout the platform.\nCollaborated in designing and deploying full-stack applications adhering to **B2B** and **SaaS** models, focusing on cutting-edge technologies and client-specific needs within **Financial Platforms** and **HRTech**.\nEngineered solutions addressing complex problems by adopting **Temporal** for workflow orchestration, successfully implementing asynchronous processing and resilient service communications across varying workloads and user demands.\nConducted performance optimization initiatives that resulted in a **30%** increase in application responsiveness through effective implementations of caching strategies and optimized API response times.\nParticipated in code reviews and knowledge-sharing sessions to improve team collaboration and promote a culture of continuous improvement, effectively solving technical challenges and enhancing team capabilities.\nDeveloped features ensuring high reliability and security, achieving low latency response times (under **100ms**) during peak traffic periods.\nDrove initiatives to enhance user experiences, applying problem-solving techniques to refine UX/UI of our web applications to meet user needs and accessibility standards.\nEngaged in team collaboration tools and strategies that facilitated effective communication and project management, keeping project timelines on track and stakeholders informed."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs\n\n **Serverless and Cloud Functions:**\n\tAWS\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tMachine Learning, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Integration, Security, OWASP, Temporal, B2B, SaaS, Financial Platforms, HR Tech, Collaboration, Problem Solving",
  "apply_company": "Ben"
}