{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior AI Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a Senior AI Engineer with 8 years of experience, I possess a robust skill set in **React**, **Next.js**, **TypeScript**, **Python**, and **APIs**, ensuring the development of high-performance solutions tailored for AI and machine learning applications. My expertise in integrating advanced technologies, including **AI**, **ML**, **OpenAI**, **Hugging Face**, and **LLMs**, empowers me to innovate within predictive analytics and intelligent automation frameworks.\nI have a proven track record in building applications using **CI/CD** methodologies, leveraging **GitHub Actions**, and executing comprehensive testing with **Jest**, **Cypress**, and **VRT**. My strong foundation in microservices architecture, paired with hands-on experience in developing machine learning pipelines and robust MLOps workflows, demonstrates my commitment to delivering secure and compliant solutions. In addition, my collaborative mindset and efficient communication skills enhance my ability to work effectively in diverse teams and drive impactful results.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and deployed robust AI and ML applications utilizing **Python** and **TypeScript**, ensuring seamless integration with **React (17-18)** and **Next.js** for dynamic, interactive user interfaces.\nDesigned and implemented **APIs** for real-time data interchange between client applications and the backend, facilitating efficient communication and data processing.\nArchitected scalable CI/CD pipelines using **GitHub Actions** and advanced testing frameworks such as **Jest** and **Cypress**, ensuring reliable deployment and continuous integration across environments.\nLeveraged machine learning libraries such as **scikit-learn**, **TensorFlow**, and **PyTorch** for developing AI-driven solutions, focusing on predictive modeling and natural language processing capabilities.\nCollaborated with cross-functional teams to integrate AI features, enhancing user interaction with smart dashboards and personalized recommendations powered by models trained on **Hugging Face** and **OpenAI**.\nMaintained high degrees of operational excellence by implementing version control practices and monitoring through robust test strategies, including unit and integration testing to guarantee high-quality deliverables.\nUtilized advanced search technologies like **Azure Cognitive Search** and **ElasticSearch** to enhance data retrieval processes across extensive datasets, ensuring optimal performance in handling structured and unstructured data.\nStrengthened teamwork and communication within the engineering team, leading initiatives that encouraged knowledge sharing and collaborative problem-solving, ultimately delivering projects ahead of schedule and within budget."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Developed and maintained web applications and APIs using **React (18)**, **Next.js**, and **TypeScript**, ensuring high performance and responsiveness suitable for user-centric financial applications.\nLeveraged **Python** for backend development, utilizing frameworks such as **Django** and **FastAPI** for building secure and scalable microservices that efficiently handle high volume transactions.\nImplemented CI/CD pipelines with **GitHub Actions** to streamline deployment processes, achieving deployment frequency of **weekly releases** and reducing deployment time by **30%**.\nApplied AI/ML techniques for fraud detection, creating and deploying models using **scikit-learn** and **XGBoost** within the financial platform to enhance security and mitigate risks.\nDesigned and integrated APIs for seamless communication between microservices, improving system interoperability and data exchange, facilitating real-time processing.\nExecuted test-driven development practices using **Jest** and **Cypress**, achieving test coverage of **over 85%** and ensuring code quality and reliability.\nCollaborated within cross-functional teams, effectively communicating and sharing ideas, leading to project completion time reduction by **20%**.\nUtilized **MLflow** and Airflow for managing ML pipelines, enhancing the efficiency of deployment and monitoring of AI models directly integrated into backend systems."
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **Go** to design and optimize backend services for AI-driven applications, ensuring efficient API integration and scalability across various features.\nDeveloped and integrated **AI** and **ML** models using tools like **OpenAI**, **Hugging Face**, and **scikit-learn** to enhance user interactions, personalize experiences, and drive conversion rates.\nUtilized **React** and **Next.js** (version **13**) for building responsive user interfaces, ensuring seamless experiences across both web and mobile platforms.\nImplemented **TypeScript** to improve code quality and maintainability, enabling better team collaboration and reducing bugs during development.\nEmployed CI/CD pipelines utilizing **GitHub Actions** for efficient deployment processes, ensuring rapid delivery of updates and new features while maintaining quality assurance through automated testing frameworks like **Jest** and **Cypress**.\nApplied cutting-edge techniques in **VRT** for validating UI changes, ensuring a consistent and engaging user experience across the application.\nFacilitated teamwork and communication throughout the project lifecycle, contributing to an agile workflow and high-performance development processes.\nIntegrated various third-party tools and cloud services, maintaining compliance with GDPR and ensuring secure data handling and role-based access control (RBAC).\nAssisted in the mentoring of junior developers, enhancing team skill sets in the implementation of **ML** models and deployment strategies."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, Next.js, JavaScript/TypeScript (React, Vue, Angular)\n\n**Programming Languages:**\n\tPython, TypeScript, Go\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tAPIs\n\n**Artificial Intelligence & Machine Learning:**\n\tAI, ML, MLflow, Airflow, Kubeflow, OpenAI, Anthropic, Hugging Face, LLMs, Pinecone, Weaviate\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Other:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Jest, Cypress, VRT, teamwork, communication",
  "apply_company": "Typeform"
}