{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Backend Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Backend Engineer with 10+ years of experience in designing and implementing high-performance backend solutions, specializing in **Microservices**, **Distributed Systems**, and **Infrastructure as Code**. Proficient in **Go**, and experienced in containerization with **Docker** and orchestration through **Kubernetes**. Skilled in monitoring and observability tools like **Prometheus**, **Grafana**, **Mimir**, **Loki**, **Tempo**, and **Pyroscope**. A strong advocate for SRE principles, ensuring dependable service delivery by leveraging best practices in **Cloud** operations across platforms such as Azure and AWS.\nBrings hands-on experience in leading the development of secure, maintainable solutions while adhering to compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Proven ability to communicate effectively and collaborate with cross-functional teams, fostering a culture of innovation and continuous improvement. Passionate about driving real-world impact through technology, utilizing a wealth of knowledge in modern frameworks and techniques.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained high-performance **microservices** architecture utilizing **Go** and **Kubernetes**, ensuring seamless scalability and resilience in **cloud** environments.\n• Implemented **Docker** containerization for consistent application deployment across multiple environments, enhancing workflow efficiency by **70%**.\n• Managed and monitored backend services using **Prometheus**, **Grafana**, and **Loki**, leading to a **50%** reduction in incident response times.\n• Collaborated with cross-functional teams to deliver robust **Infrastructure as Code** solutions, integrating **Mimir** and **Tempo** for log management and traceability.\n• Facilitated team communication and collaboration to ensure alignment on project goals and timelines, contributing to a **30%** improvement in project delivery speed.\n• Employed effective problem-solving techniques as a self-starter in addressing system performance issues, enhancing uptime by achieving **99.9%** availability.\n• Led the optimization of distributed systems, focusing on scalability, reliability, and performance metrics across various applications.\n• Conducted thorough documentation and knowledge sharing sessions, fostering a collaborative environment for continuous learning and improvement."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented microservices architecture utilizing **Go**, ensuring high scalability and maintainability across various backend services for seamless financial transactions.\nEmployed **Kubernetes** for orchestration of containerized applications alongside **Docker** for environment consistency, improving deployment efficiency by **30%**.\nManaged and monitored distributed systems leveraging **Prometheus** and **Grafana** for real-time metrics and logging, enhancing system reliability and performance tracking.\nDesigned and deployed infrastructure as code solutions, promoting automation and reducing manual intervention, resulting in a **25%** decrease in deployment time.\nCollaborated closely with cross-functional teams, enhancing communication and fostering a collaborative environment to drive project success and innovation.\nDeveloped a robust event-driven architecture with **Apache Kafka**, ensuring efficient handling of financial transactions and compliance workflows with **99.9%** uptime.\nOrchestrated ETL processes using **Azure Data Factory**, facilitating the seamless integration of financial data from various sources into cloud-based analytics platforms, improving data accessibility and reporting capabilities.\nContributed to the design and implementation of AI-driven fraud detection systems, leveraging **scikit-learn** for advanced analytics to improve fraud prevention measures and reduce false positive rates by **15%**.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Engineered microservices using **Go** and **Kubernetes**, optimized for scalability and resilience in a high-traffic e-commerce environment, boosting system uptime to **99.9%**.\nImplemented **Docker** for containerization of applications, streamlining deployment processes and reducing setup time by **50%**.\nDeveloped robust infrastructure monitoring solutions using **Prometheus**, **Grafana**, **Mimir**, **Loki**, and **Tempo**, enabling real-time performance tracking and alerting for proactive issue resolution, reducing incident response time by **30%**.\nApplied **Infrastructure as Code (IaC)** principles to automate environment provisioning, ensuring consistency across development, staging, and production environments while speeding up the deployment pipeline.\nFostered effective communication and collaboration within cross-functional teams, promoting knowledge sharing and agile principles to improve project delivery timelines.\nDesigned and maintained configurations for distributed systems, enhancing reliability and fault tolerance across services, resulting in improved end-user experiences.\nIntroduced performance tuning strategies using **Pyroscope**, resulting in a **20%** increase in application performance during peak traffic periods.\nDemonstrated a self-starter attitude by proactively identifying areas for improvement and spearheading initiatives that led to increased team efficiency.\nConducted regular code reviews and mentorship sessions to promote coding best practices and enhance team skills, contributing to a significant reduction in code-related issues post-deployment."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Go\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tPrometheus, Grafana, Mimir, Loki, Tempo, Pyroscope, Microservices, Distributed Systems, SRE, Infrastructure as Code\n\n **Other:**\n\tAuthentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Communication, Collaboration, Self-Starter",
  "apply_company": "Grafana Labs"
}