{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Automation Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-152840397/",
  "profile_summary": "As a Senior Automation Engineer with 8 years of full-stack development experience, I excel in **QA** and **Automation** strategies to deliver high-quality software solutions. My expertise includes the use of **Playwright**, **TypeScript**, and various automation frameworks to ensure robust automation processes. I am proficient in creating and executing **E2E** tests, leveraging tools like **Cypress** and **WebDriverIO** to enhance the testing efficiency of web applications.\n\nI have hands-on experience with CI/CD pipelines using tools such as **GitHub Actions**, **GitLab CI**, and **Jenkins**, driving the integration of automated testing into Agile and Scrum methodologies. My development background includes building applications with **Angular**, as well as working with RESTful APIs, making me well-equipped for automation in diverse tech stacks.\n\nAdditionally, I possess a strong foundation in SQL and NoSQL databases and a deep understanding of healthcare and financial compliance standards like HIPAA and PCI DSS. My ability to leverage AI technologies in automation workflows enables me to implement intelligent testing solutions, contributing to enhanced product reliability and performance.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Automation Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and implemented QA automation frameworks using **Playwright** to enhance testing efficiency across applications, ensuring comprehensive coverage for both front-end and back-end systems.\n• Designed and executed end-to-end (E2E) testing strategies using **Cypress** and integrated with CI/CD pipelines via **GitHub Actions** and **Jenkins**, achieving a **25%** increase in deployment speed.\n• Created RESTful APIs using **TypeScript** and employed tools such as **Postman** for testing, resulting in an improved API response time of **30%**.\n• Collaborated in Agile and Scrum teams, participating in sprint planning and reviews to align on product requirements and testing strategies, contributing to a **40%** reduction in defect rates.\n• Conducted extensive automation test case reviews, promoting best practices that led to a **50%** reduction in regression testing time.\n• Integrated with SQL and NoSQL databases for data-driven testing, ensuring functionality aligned with real-world data as part of the testing process.\n• Optimized testing processes by establishing automation standards and leveraging tools like **WebDriverIO**, improving overall team productivity by **20%**.\n• Assisted in troubleshooting complex testing issues and provided detailed reports to stakeholders, leading to faster resolution times.\n• Mentored junior engineers on QA best practices and automation techniques, fostering a culture of quality throughout the development lifecycle.\n• Actively participated in technology evaluations and tool selections, ensuring alignment with the latest industry trends and technologies to improve testing capabilities."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented QA best practices and automated testing frameworks to enhance software quality of financial platforms, ensuring comprehensive coverage for microservices-based architecture.\nConducted end-to-end (E2E) testing on user-focused front-end applications built with **React (18)**, **Vue 3**, and **Next.js** to verify functionality and performance standards, employing **Cypress** for reliable testing processes.\nDeveloped and executed automated REST API tests using **Postman** and **Playwright**, guaranteeing accurate data interactions and service reliability in production environments.\nEstablished CI/CD pipelines leveraging **GitHub Actions** and **Jenkins**, streamlining development workflows and reducing deployment times by **30%**.\nCollaborated within Agile and Scrum environments to improve testing strategies, enhancing team productivity and ensuring timely delivery of financial services with high quality.\nUtilized **TypeScript** to enhance test scripts and improve maintainability across automation frameworks, ensuring seamless integration with existing codebases.\nIntegrated **SQL** and **NoSQL** databases in test scenarios to validate data integrity between transactions and reporting systems, performing data audits on **3M+** records efficiently.\nDesigned and implemented test cases for **AI**-driven components, validating outputs from fraud detection algorithms to ensure system effectiveness and security in financial applications.\n"
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and executed automated testing frameworks to enhance QA processes using **Cypress** and **Playwright**, ensuring high software quality across multiple platforms.\nCollaborated in Agile/Scrum teams to drive test automation efforts and integrate continuous testing into the CI/CD pipeline with tools like **GitHub Actions**, **Jenkins**, and **GitLab CI**, leading to an increase in deployment frequency by **50%**.\nDesigned and executed end-to-end (E2E) tests leveraging **TypeScript** for improved code quality and readability, resulting in a **30%** reduction in production defects post-deployment.\nCreated comprehensive REST API tests using **Postman** to validate endpoints, ensuring functional accuracy and reliability in the integration of backend services.\nImplemented behavioral-driven development (BDD) by utilizing **WebDriverIO** to define clear acceptance criteria, improving communication among stakeholders and enhancing the overall testing strategy.\nConducted performance testing and load testing using **HTTP** protocols to identify bottlenecks and optimize application performance, achieving consistent response times under high traffic scenarios.\nAutomated regression tests for frontend applications built with **Angular** and ensured compatibility across various browsers, maintaining a **95%** test pass rate.\nEngaged in the development of testing strategies and tooling around AI, evolving testing methodologies to accommodate advanced algorithms and ensuring robust data handling during testing phases.\nAnalyzed SQL and NoSQL databases to validate data integrity during automated testing, establishing clear benchmarks for data accuracy and compliance with specifications.\nParticipated in code review processes to uphold best practices in test automation and maintainability, fostering a culture of continuous improvement and collaborative feedback.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tREST, HTTP\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, NoSQL\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob), Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile, Scrum, E2E, Automation, Playwright, Postman, Cypress, WebDriverIO",
  "apply_company": "DocuSketch"
}