{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Consulting Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Consulting Engineer with 13+ years of experience delivering high-performance applications across healthcare and financial industries. Expertise in **Java**, **Python**, and **JavaScript**, enabling effective database management, data modeling, and big data analytics solutions. Proficient in creating robust APIs and middleware for seamless communication and data analysis. Skilled in agile project management and DevOps practices, ensuring effective collaboration and continuous delivery. \nHands-on experience in **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for frontend and backend development. Adept at building AI/ML-powered platforms that enhance predictive analytics and real-time processing. \nIn addition, I have a strong background in deploying cloud-native systems on **AWS** and **Azure**, and implementing microservices, event-driven architectures, and CI/CD pipelines. Committed to compliance-driven development aligning with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Proficient in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**, further demonstrating my capabilities in mentoring and consultative roles.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Consulting Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Employed **Java**, **Python** and **JavaScript** to design and build full-stack platforms for healthcare and fintech projects, ensuring adherence to industry standards and regulations such as HIPAA and GDPR.\n- Utilized **database** technologies such as **PostgreSQL** and **MongoDB** for effective **data modeling** and management in high-performance applications, achieving data ingestion rates of over **1 million records/hour**.\n- Conducted data analysis and analytics tasks to derive insights from big data environments, contributing to financial forecasting and risk management initiatives.\n- Developed and integrated **API** solutions for secure data exchange, fostering seamless communication between systems and improving service orchestration.\n- Leveraged **DevOps** practices by building CI/CD pipelines with **GitHub Actions** and **CircleCI**, enhancing deployment efficiency by **30%**.\n- Mentored junior developers in **Agile** methodologies and best practices, improving team productivity through effective collaboration and continuous improvement.\n- Spearheaded the use of **messaging** patterns for asynchronous data processing, implementing **middleware** to facilitate robust communication in distributed systems.\n- Collaborated with stakeholders to gather requirements and provide consultative support, ensuring project alignment with strategic goals.\n- Implemented quality assurance practices by defining testing strategies, deploying unit and integration tests using **Postman** and **PyTest**, which reduced bug rates by **25%**.\n- Designed and utilized advanced data visualization tools with **D3.js** and **Chart.js** for impactful analytics presentations, aiding in decision-making processes.\n- Played a pivotal role in transforming legacy systems, applying **big data** techniques to enhance system scalability and performance."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leverage **Python** and **JavaScript** for developing robust back-end services and comprehensive data models, aligning with best practices in **data modeling** and **database** management to support high-volume transactions.\nUtilize strong **API** development skills to create seamless integrations between platforms, enhancing data exchange and operational efficiency in an **Agile** environment.\nImplementing best practices in **big data** management to analyze and interpret complex datasets, delivering actionable insights that drive business decisions and enhance analytics capabilities.\nEnhance messaging and middleware solutions through the deployment of **Kafka** and **RabbitMQ**, improving asynchronous communication across workflows with **99%** uptime.\nPromote team productivity through consultative and mentoring strategies, fostering a culture of continuous learning and improvement aligned with **DevOps** practices.\nDevelop ongoing analytics initiatives, employing a variety of **data analysis** techniques, ensuring accurate reporting and performance monitoring with tools such as **Power BI**.\nParticipate in code review sessions and knowledge sharing, leveraging **C#** and current frameworks to foster collaborative development efforts within cross-functional teams.\nMaintain a consultative approach in meetings with stakeholders, guiding them through technical requirements and project deliverables while ensuring adherence to timelines exceeding **90%** completion rate.\nContribute actively to project planning and delivery, ensuring alignment with business goals and adherence to **Agile** methodologies, successfully managing multiple concurrent projects with a client satisfaction score above **95%**.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **Java** for data modeling and analytics in backend services, ensuring high-quality data management and compliance with **Agile** methodologies.\nDesigned and implemented APIs and middleware solutions to facilitate seamless messaging across different systems, enhancing the overall functionality and responsiveness of applications within a fast-paced environment.\nConducted extensive data analysis to inform engineering decisions, utilizing big data tools to create robust and scalable solutions that meet the needs of a global customer base.\nMentored team members in best practices for **DevOps**, promoting a culture of continuous improvement and technical excellence across the engineering team.\nEngineered solutions leveraging **Node.js** for efficient backend processing, ensuring low-latency access to **database** technologies like **MongoDB** and **PostgreSQL**, serving up to **100,000** transactions per hour.\nUtilized **JavaScript** frameworks including **React** and **Vue 3** to enhance user interfaces, delivering engaging and responsive experiences across web applications.\nImplemented real-time data processing with **Kafka** and **RabbitMQ**, facilitating dynamic inventory updates and improving customer interaction through effective messaging systems.\nIntegrated analytics tools within the architecture to derive insights from application performance, influencing strategic decisions and future enhancements based on real-world usage statistics.\nDrove project success through effective project management and consultative engagement, aligning technical initiatives with business objectives to deliver innovative solutions to clients."
    }
  ],
  "skills": "****Programming Languages:\n\tPython, Java, JavaScript, C#, TypeScript\n\n****Backend Frameworks:\n\tFastAPI, Flask, Django\n\n****Frontend Frameworks:\n\tReact, Vue, Angular\n\n****API Technologies:\n\tAPI\n\n****Serverless and Cloud Functions:\n\tAWS: Lambda, ECS; Azure: App Services\n\n****Databases:\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n****DevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n****Cloud & Infrastructure:\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database\n\tTerraform, Ansible, Helm, Docker Compose\n\n****Other:\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, data modeling, big data, analytics, messaging, middleware, data analysis, Agile, consultative, mentoring",
  "apply_company": "Neo4j"
}