{
  "name": "Patryk Zaslawski",
  "role_name": "PL SQL Developer HR Products",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a seasoned PL/SQL Developer with 8+ years of software engineering experience, I possess advanced skills in **PL/SQL**, **Oracle database**, and **Oracle SQL Developer**. My expertise in developing calculation engines, stored procedures, and packages enables me to create high-quality solutions tailored to HR products. I am proficient in ensuring coding standards and best practices to maintain system integrity. Additionally, I have strong analytical and problem-solving skills to overcome challenges effectively. My ability to communicate fluently in both **Italian** and **English** enhances collaboration within diverse teams. I am dedicated to optimizing workflow orchestration to drive efficiency and performance.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "PL SQL Developer HR Products",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized analytical skills to develop and maintain complex **PL/SQL** stored procedures and packages in **Oracle Database** to ensure robust data processing and calculation engines for HR Products.\nImplemented coding standards and best practices in SQL Development using **Oracle SQL Developer** and **TOAD** for optimized data manipulation and reporting.\nConducted thorough problem-solving sessions to troubleshoot and enhance existing workflows, leveraging **workflow orchestration** techniques in conjunction with **Oracle Database** capabilities.\nEngaged in continuous improvement initiatives to streamline data operations and enhance system performance by **15%** within **6 months**.\nCollaborated with cross-functional teams to design and implement secure and efficient data access methodologies across varied applications.\nMentored junior developers on best practices in **PL/SQL** coding standards and effective use of tools like **TOAD** and **Oracle SQL Developer**.\nFacilitated comprehensive testing and validation of stored procedures and packages, ensuring reliable outputs and adherence to HR compliance standards.\nProvided bilingual support in **Italian** and **English** for international teams to enhance communication and expedite project development cycles.\nParticipated in code reviews to uphold quality standards and ensure optimal performance of all **PL/SQL** scripts across projects.\nAssisted in the creation and execution of documentation processes related to emerging standards in **workflow orchestration** and database management."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "Utilized **PL/SQL** for the development and management of complex **Oracle databases**, enhancing performance and reliability through optimized stored procedures and packages.\nLeveraged **Oracle SQL Developer** and **TOAD** to efficiently design and maintain coding standards, ensuring adherence to best practices across database development projects.\nDeveloped and implemented calculation engines in **PL/SQL**, effectively streamlining calculations and improving processing time by **30%**.\nCreated and maintained workflow orchestration processes to automate data handling, achieving a **25%** reduction in operational downtime.\nApplied analytical skills to troubleshoot and resolve database issues, improving application performance and user experience in HR products by **20%**.\nDemonstrated strong problem-solving abilities when optimizing existing database processes, resulting in improved data retrieval times and system responsiveness.\nCollaborated with cross-functional teams to gather requirements for HR product improvements, effectively communicating in both **Italian** and **English** to facilitate discussions.\nConducted reviews of coding standards and best practices, providing mentorship and guidance to junior developers on **PL/SQL** development techniques.\nImplemented robust testing protocols for **Stored Procedures** and packages to ensure reliability and performance, reducing error rates by **15%**.\nIntegrated workflow automation solutions into existing systems, enhancing the efficiency of HR operations and reducing manual intervention by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **PL/SQL** to develop and optimize stored procedures and packages, improving query performance for high-load HR product applications.\nDesigned and implemented calculation engines leveraging **Oracle database** capabilities to enhance data processing and reporting accuracy.\nCollaborated with team members to maintain coding standards and best practices, ensuring high-quality, maintainable code in line with project requirements.\nPerformed workflow orchestration, enabling automated data flows and processes across HR products, achieving a reduction in manual intervention by **30%**.\nConducted thorough analytical assessments to diagnose and resolve data management issues, employing strong problem-solving skills to enhance system performance.\nProduced high-quality documentation and technical specifications using **Oracle SQL Developer** and **TOAD**, enabling streamlined development and training processes.\nAssured the integrity and security of data resources, adhering to established coding standards and best practices to maintain software reliability.\nMaintained fluency in **Italian** and **English** to facilitate effective communication with diverse teams and stakeholders in multilanguage environments.\nLeveraged strong analytical skills to conduct data validation and performance testing, ensuring alignment with business objectives and enhancing user experience.\nActively participated in code reviews, promoting adherence to coding standards and sharing insights on optimizing PL/SQL runtime efficiency."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, PL/SQL\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Oracle database\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, calculation engines, stored procedures, packages, workflow orchestration, coding standards, best practices, analytical skills, problem-solving skills, fluent in Italian, fluent in English"
}