{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Front End Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Front End Software Engineer with 13+ years of experience in delivering high-performance applications, specializing in **JavaScript**, **React**, **Vue.js**, **Angular**, **CSS**, and **Tailwind CSS**. Expertise in implementing **CI/CD** pipelines and developing **REST APIs** to enhance system reliability and efficiency. Proven ability to integrate **AI tools** for automation and improving user experience. Skilled in using design tools like **Figma**, **Sketch**, **Storybook**, and testing frameworks such as **Playwright**, **Cypress**, and **Jest** to ensure robust front-end development. \nDemonstrated success in problem-solving and collaboration, fostering clear communication among cross-functional teams. Strong background in designing and deploying applications within compliance-driven environments, making significant contributions to the healthcare and financial industries by aligning with standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Front End Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and maintained responsive web applications using **React** and **Vue.js**, ensuring a seamless user experience through robust integration with **REST APIs** and adherence to modern front-end technologies.\n- Implemented responsive designs with modern CSS frameworks, including **Tailwind CSS**, **Bootstrap**, **Flexbox**, and **CSS Grid**, to create visually appealing and user-friendly interfaces.\n- Collaborated with cross-functional teams to define project requirements and deliver high-quality software solutions, leveraging strong **communication** and **collaboration** skills.\n- Utilized **C#** and **.NET** for building server-side components, integrating effectively with front-end technologies for dynamic user experiences.\n- Created automated testing frameworks using **Cypress**, **Jest**, and **Playwright** to ensure the reliability of front-end applications, focusing on unit tests and end-to-end testing strategies.\n- Participated in CI/CD processes to streamline application deployment and ensure consistent product delivery, leveraging tools such as **Azure DevOps** for build and deployment automation.\n- Employed design tools like **Figma** and **Sketch** to translate design specifications into functional components, collaborating closely with designers throughout the development process.\n- Leveraged problem-solving abilities to troubleshoot and resolve issues promptly, enhancing code quality and application performance.\n- Analyzed user feedback and behavior to iterate on features quickly, ensuring alignment with business objectives and user needs by integrating **AI tools** where applicable.\n- Actively documented development processes and communicated progress to stakeholders, fostering transparency and continued improvement within the team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React** and **Vue.js** frameworks to deliver interactive front-end applications, enhancing user experience for financial tools and admin panels across **3 high-volume transactional systems**.\nEmployed state management strategies using **Redux Toolkit** and designed responsive interfaces leveraging **Tailwind CSS** and **Bootstrap**, optimizing performance with a focus on **CSS Grid** and **Flexbox** techniques in **9 major releases**.\nCollaborated closely with cross-functional teams to communicate project goals and progress, ensuring alignment and timely delivery of **automated CI/CD** pipelines for efficient deployment.\nImplemented robust **REST APIs** for seamless back-end communication, enhancing the application architecture reliability and scalability, achieving a 30% increase in data processing speed.\nApplied problem-solving skills to troubleshoot and optimize existing financial applications using **JavaScript** and **C#**, ensuring consistent improvement based on user feedback and analytics.\nEngaged in user interface designs with tools like **Figma** and **Sketch**, contributing to a 25% improvement in user satisfaction metrics through meticulous design iterations and user testing.\nMaintained high-quality code standards through unit testing frameworks such as **Jest**, bolstering application stability and reducing bugs by **15%** in production environments.\nFacilitated automation strategies in the development process by leveraging **Playwright** and **Cypress**, streamlining testing workflows and enhancing collaboration across development teams."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed dynamic and responsive web applications using **React 18**, **Vue.js**, and **Angular**, implementing best practices in **CSS**, **Tailwind CSS**, and **Bootstrap** to enhance UI/UX.\nCollaborated effectively using tools such as **Figma** and **Sketch** for high-fidelity mockups and UI prototypes, promoting strong team communication and project alignment.\nOptimized web performance through **CI/CD** practices, utilizing **REST APIs** for seamless integration and facilitating continuous delivery.\nImplemented automated testing strategies using **Playwright**, **Cypress**, and **Jest** to ensure code quality, resulting in a **30% reduction** in bug reports post-deployment.\nWorked with **Azure** services to deploy and scale applications, achieving overall system scalability for **200%** increase in user traffic during peak seasons.\nCollaborated on cross-functional teams to integrate **AI tools** for interactive features, streamlining the development process and enhancing the project's technical capability.\nApplied problem-solving skills to address complex challenges, leading to the successful rollout of projects on time and with high quality.\nManaged project collaboration through effective communication, adapting to changes, and providing expert input to optimize the software development lifecycle."
    }
  ],
  "skills": " **Programming Languages**\n\tC#, .NET, JavaScript/TypeScript, Python\n\n**Frontend Frameworks**\n\tReact, Vue.js, Angular, CSS, Tailwind CSS, Bootstrap, Flexbox, CSS Grid, Figma, Sketch, Storybook, Playwright, Cypress, Jest\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**API Technologies**\n\tREST APIs\n\n**Serverless and Cloud Functions**\n\tAWS: Lambda, ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Databases**\n\tMSSQL, PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAzure\n\n**Other**\n\tAI tools, MLflow, Airflow, Kubeflow, automation, communication, collaboration, problem-solving, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}