{
  "name": "Tomasz Lee",
  "role_name": "Senior Functional Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Functional Engineer with 9+ years of experience in analyzing and enhancing safety in automotive systems, focusing on techniques such as ISO 26262, DFMEA, DFA, FMEDA, and FTA. Skilled in safety analysis and documentation, ensuring compliance and systemic safety. Additionally, I bring expertise in microservices architecture and distributed systems, utilizing technologies such as **Apache Kafka**, **RabbitMQ**, and **Redis**. Adept in both frontend and backend development with **ReactJS**, **NextJS**, **.NET**, and **C#**. Proven ability to deliver high-quality solutions and streamline processes while effectively communicating and collaborating across interdisciplinary teams.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Functional Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Conducted safety analysis including Design Failure Mode and Effects Analysis (DFMEA) and Fault Tree Analysis (FTA) to ensure product compliance with **ISO 26262** standards.\nCollaborated in the preparation of safety documentation for automotive semiconductor applications, enhancing communication across multidisciplinary teams.\nImproved product safety and reliability through Failure Mode Effects and Diagnostic Analysis (FMEDA) methodologies.\nUtilized Design for Assembly (DFA) principles to streamline manufacturing processes, resulting in a **15%** reduction in assembly time.\nEngaged with cross-functional teams to facilitate effective communication, reducing project delays by **20%**.\nContributed to the development of safety analysis reports and presentations, ensuring stakeholders are informed about project risks and mitigation strategies.\nImplemented rigorous testing protocols to validate safety analysis results and ensure adherence to industry standards.\nTrained and mentored junior engineers in safety analysis processes and best practices."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Conducted safety analysis to ensure compliance with **ISO 26262** standards, enhancing product safety in automotive applications.\nPerformed **DFMEA** (Design Failure Mode and Effects Analysis) on semiconductor components to identify potential failure modes and improve reliability.\nApplied **DFA** (Design for Assembly) principles to streamline the manufacturing process, which reduced assembly time by **20%**.\nExecuted **FMEDA** (Failure Mode, Effects, and Diagnostic Analysis) to assess the reliability and safety features of automotive electronics, contributing to risk management strategies.\nDeveloped and maintained comprehensive **FTA** (Fault Tree Analysis) documentation, providing clear safety validation for critical system components.\nCollaborated with cross-functional teams to gather and document safety requirements, fostering effective communication throughout the project lifecycle.\nPresented findings in safety documentation to stakeholders, facilitating informed decision-making and ensuring project alignment.\nMentored junior engineers on best practices in safety analysis, improving team engagement and productivity by **15%**.\nUtilized various tools and methodologies to ensure adherence to safety protocols while managing project timelines efficiently.\nEngaged in continuous communication with stakeholders to support project goals, ensuring that all safety aspects are thoroughly addressed."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Conducted safety analysis in compliance with **ISO 26262**, enhancing automotive product reliability.\nPerformed **DFMEA** (Design Failure Mode and Effects Analysis) to identify potential failure points, contributing to an overall risk reduction of **30%**.\nDeveloped comprehensive **safety documentation** that supported safety compliance and operational standards.\nExecuted **DFA** (Design for Assembly) assessments to streamline manufacturing processes, reducing assembly time by **15%**.\nImplemented **FMEDA** (Failure Modes, Effects, and Diagnostic Analysis) reports to improve defect detection capabilities.\nCollaborated on **FTA** (Fault Tree Analysis) to pinpoint critical failure paths and mitigate risks in system designs.\nUtilized semiconductor technologies to enhance product features, driving innovation within the team.\nEstablished effective communication channels with cross-functional teams, leading to on-time project deliveries.\nEngaged in weekly design reviews to ensure adherence to project timelines and quality standards.\nDelivered presentations on safety analysis findings to stakeholders, fostering transparency and informed decision-making."
    }
  ],
  "skills": " **Frontend Technologies**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Technologies**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**Messaging & Caching**\n\tApache Kafka, RabbitMQ, Redis\n\n**Database Systems**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & DevOps**\n\tAWS, Azure, CI/CD pipelines\n\n**Testing Tools**\n\tNUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest\n\n**Blockchain**\n\tSolidity, Ether.js, Web3.js, Ethereum\n\n**Other Skills**\n\tUX/UI Design, Git, GitHub, RESTful API, GraphQL, Python, Redux\n\n**Technical Skills**\n\tISO 26262, DFMEA, DFA, FMEDA, FTA, semiconductor, automotive, safety analysis, safety documentation, communication",
  "apply_company": "IC Resources"
}