{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with extensive experience in software development, specializing in **Go**, **Java**, **C#**, and **C++**. Proficient in Linux environments and adept at working with databases such as **Postgres**. Skilled in implementing protocols and automating workflows. Strong analytical skills with a background in malware analysis and RFC implementation. \nWith over 13 years of experience in full stack development, I deliver high-performance applications, particularly in the healthcare and financial industries. My tech stack includes **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in both frontend and backend frameworks such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have built AI/ML-powered platforms supporting predictive analytics and real-time processing, and I deploy cloud-native systems on **AWS** and **Azure**. Experienced in implementing microservices, event-driven architectures, and CI/CD pipelines, I am well-versed in compliance-driven development, aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards. Additionally, I possess a strong background in MLOps, including model training, serving, and orchestration using MLflow, Airflow, and Kubeflow.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "\n- Developed and maintained robust applications using **Go** and **Java** to ensure high performance and reliability across diverse operating environments, including **Linux**.\n- Designed and optimized database schemas and queries using **Postgres** for efficient data retrieval, handling up to **10,000** concurrent connections.\n- Implemented automation solutions to streamline processes and enhance system performance, minimizing downtime by **30%** through effective deployment strategies.\n- Engaged in malware analysis as part of the security enhancement efforts, ensuring all applications met industry standards and best practices.\n- Analyzed and implemented necessary **RFCs** to enhance system capabilities and ensure compliance with established protocols.\n- Collaborated with cross-functional teams to enhance application performance using **C#** and **C++**, improving operational efficiency by **25%**.\n- Developed and implemented protocols for communication between microservices, enabling seamless integration and interoperability across platforms.\n- Conducted extensive testing and debugging processes, resulting in a **15%** increase in application reliability and user satisfaction.\n- Leveraged **QEMU** for virtualization needs, ensuring effective resource allocation and isolation within development and testing environments."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented new **Go** applications and services to streamline financial operations, improving processing efficiency by **30%**.\nLeveraged **Linux** environments to optimize system performance and management, facilitating seamless deployment and operation of applications.\nDesigned and maintained a high-performance **Postgres** database architecture that supported financial analytics, leading to a **25%** increase in query speeds.\nConducted comprehensive **Malware Analysis** to enhance the security of financial applications, reducing vulnerability incidents by **40%**.\nUtilized **Java**, **C#**, and **C++** to develop software components that integrate with legacy systems, providing backward compatibility while modernizing architecture.\nAutomated deployment pipelines using industry standards, allowing for **95%** reduction in manual intervention and error rates in deployment processes.\nEstablished and documented **RFCs** to facilitate better communication and implementation of various software protocols, improving team collaboration and project outcomes.\nDeveloped thorough testing and validation protocols for software delivery, ensuring high-quality releases and significantly reducing bug rates in production.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Go** for developing robust and scalable applications, optimizing system performance across the platform and enhancing overall operational efficiency by **25%**.\nDesigned and implemented automation scripts within **Linux** environments to facilitate deployment processes, resulting in a **40%** reduction in manual intervention times.\nEngaged in implementing **Postgres** database solutions to support data integrity and performance needs, ensuring efficient data handling and storage for high-traffic applications.\nDeveloped and managed virtualization services using **QEMU** for efficient application deployment and resource management, improving system reliability by **30%**.\nApplied advanced techniques in **Malware Analysis** to enhance software security protocols and mitigate potential threats, resulting in a **20%** decrease in vulnerability incidents.\nUtilized **Java**, **C#**, and **C++** to create high-performance microservices that meet stringent latency requirements for real-time processing.\nImplemented new protocols as per **RFCs**, ensuring compliance and facilitating seamless communication between systems.\nResearched and developed automation processes to enhance system monitoring, increasing performance visibility and reducing downtime by **15%**."
    }
  ],
  "skills": " **Programming Languages:** \n\t•\tPython\n\t•\tJava\n\t•\tC#\n\t•\tC++\n\t•\tGo\n\t•\tJavaScript/TypeScript\n\n **Backend Frameworks:** \n\t•\tFastAPI\n\t•\tFlask\n\t•\tDjango\n\n **Frontend Frameworks:** \n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\n **API Technologies:** \n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\n **Serverless and Cloud Functions:** \n\t•\tAWS: Lambda\n\t•\tAzure: App Services\n\n **Databases:** \n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\n **DevOps:** \n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\n **Cloud & Infrastructure:** \n\t•\tAWS: ECS\n\t•\tAWS: RDS\n\t•\tAWS: S3\n\t•\tAzure: Blob Storage\n\t•\tAzure: SQL Database\n\n **Other:** \n\t•\tLinux\n\t•\tQEMU\n\t•\tMalware Analysis\n\t•\tImplementing RFCs\n\t•\tProtocols\n\t•\tAutomation",
  "apply_company": "Recorded Future"
}