{
  "name": "Rei Taro",
  "role_name": "Senior Web Test Automation Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Web Test Automation Engineer with over 10 years of experience in backend development and a strong proficiency in automation testing frameworks such as **Playwright** and **Selenium**. Skilled in leveraging **TypeScript**, **Python**, and **Django** for enhanced test automation processes. Proficient in implementing CI/CD pipelines using **GitHub Actions** and experienced with cloud services including **Azure** and **GCP**. Expertise in functional and performance testing while utilizing **PostgreSQL**, **Redis**, and **RabbitMQ** to support robust backend systems. With a background in creating high-quality APIs with **OpenAPI**, I excel in Agile environments and bring strong problem-solving and communication skills to deliver impactful projects at leading organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Web Test Automation Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **Selenium** and **Playwright** for developing robust test automation frameworks in **TypeScript** and **Python**, enhancing web application reliability.\nDesigned and implemented testing strategies using **GitHub Actions** for automated deployment and continuous integration processes, achieving a CI/CD deployment time reduction by **30%**.\nDeveloped and maintained documentation using **OpenAPI** standards to ensure clarity and collaboration across cross-functional teams, improving communication efficiency by **25%**.\nCollaborated with developers using **Django** and **PostgreSQL** to troubleshoot and optimize backend functionalities, leading to a **40%** decrease in bug rates post-release.\nLeveraged **Celery** and **RabbitMQ** for handling asynchronous operations, enabling efficient processing and scalability of new features.\nManaged infrastructure using **Terraform** and **Helm**, contributing to the streamlined deployment of applications in **Azure**, increasing service reliability and deployment speed by **20%**.\nImplemented **k8s** for orchestrating containerized applications, providing greater flexibility and scalability in deployment.\nEngaged in Agile practices to improve problem-solving approaches within the team, facilitating continuous growth and iterative improvements."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Playwright** and **Selenium** for automated testing of web applications, ensuring high-quality releases with a focus on front-end performance and user experience.\nDeveloped backend systems in **Python** and **FastAPI** to automate document workflows, streamline user onboarding, and handle complex reporting processes, achieving a **30%** reduction in onboarding time.\nCreated event-driven microservices using **Celery** and **Redis**, enabling asynchronous processing of financial data and transaction requests, resulting in a throughput increase of **25%**.\nManaged the deployment of microservices on **Azure App Services**, leveraging **Terraform** for infrastructure automation to maintain consistent and scalable environments, contributing to an **80% uptime**.\nEngineered data pipelines for the secure exchange of regulatory data, using **Apache Airflow** and **Azure Functions** to automate and streamline the data flow, ensuring compliance with data handling standards.\nImplemented **GitHub Actions** for continuous integration and deployment, which reduced release cycle time by **15%** and ensured rapid bug fixes.\nPerformed security audits, ensuring compliance with industry standards, and integrated **OAuth2** and **Azure AD B2C** to manage authentication and secure access controls.\nCollaborated with cross-functional teams to ensure smooth system integration, regulatory compliance, and successful release management, enhancing communication and problem-solving processes."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed automated test scripts using **Playwright** and **Selenium** in **TypeScript** to ensure the reliability of web applications, achieving a 98% test coverage.\n• Collaborated with development teams to create and maintain APIs using **OpenAPI**, ensuring consistency and thorough documentation for seamless integration.\n• Implemented continuous integration pipelines with **GitHub Actions**, optimizing the build and deployment processes, reducing deployment time by 30%.\n• Engineered robust backend services with **Python**, **Django**, and **PostgreSQL** for effective data management and retrieval, improving data access speed by 25%.\n• Designed and executed comprehensive test strategies for front-end applications built on **React**, delivering real-time feedback to enhance user experience and performance.\n• Introduced job queuing and scheduling solutions using **Celery** and **RabbitMQ**, streamlining backend task execution and increasing processing efficiency by 40%.\n• Ensured compliance with regulatory standards such as MiFID II and GDPR, maintaining high data security protocols across all testing and development phases.\n• Actively contributed to Agile methodologies, participating in sprint planning and retrospectives to continuously improve team workflows and communication.\n• Implemented automated testing frameworks with tools like **PyTest**, **tox**, and mock servers, which improved QA and CI processes during development cycles."
    }
  ],
  "skills": " **Programming Languages**\n\t Python, SQL, TypeScript\n\n **Backend Frameworks**\n\t Django, FastAPI, Flask, Celery, RabbitMQ\n\n **Frontend Frameworks**\n\t React\n\n **API Technologies**\n\t REST/gRPC APIs, OpenAPI\n\n **Serverless and Cloud Functions**\n\t AWS (EC2, S3, Lambda), Azure, Heroku, GCP\n\n **Databases**\n\t PostgreSQL, MySQL, MongoDB, Redis, SQL Alchemy\n\n **DevOps**\n\t Docker, Kubernetes (k8s), GitHub Actions, Azure DevOps, Terraform, Helm, CI/CD\n\n **Cloud & Infrastructure**\n\t AWS, Azure, GCP\n\n **Other**\n\t Microservices, Kafka, Agile, Problem-solving, Communication, PyTest, Git",
  "apply_company": "Sphera"
}