{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Engineer with a robust background in Civil and Mechanical engineering, proficient in **AutoCAD** for 3D modeling and Finite Element Analysis (FEA). Extensive experience in performing complex load calculations and developing comprehensive lifting plans. Demonstrated ability to utilize **MS Office** for project documentation and communication. Known for problem-solving skills, teamwork, and delivering solutions that enhance operational efficiency. With 13+ years in tech, I possess a blend of hands-on experience in software tools and processes, including **JavaScript/TypeScript**, **Python**, and **Flutter**, and have successfully contributed to high-performance applications in the healthcare and financial sectors. I am well-versed in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django** for end-to-end development and have a strong foundation in deploying cloud-native systems using **AWS** and **Azure**, complying with rigorous standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Executed complex **AutoCAD** designs for various engineering projects ensuring compliance with **FEA** standards and incorporating precise **3D modeling** techniques.\n- Conducted detailed **load calculations** and developed comprehensive **lifting plans** to optimize crane operations, facilitating safe and efficient project execution across **9** major sites.\n- Developed and implemented rigorous project workflows using **MS Office** tools, streamlining documentation and communication for enhanced team collaboration.\n- Leveraged advanced **3D modeling** software to create visual presentations, resulting in a **30%** increase in client approvals during design phases.\n- Collaborated with multidisciplinary teams to integrate **rigging** and crane operations effectively into project planning, enhancing overall safety and efficiency.\n- Led training sessions on **AutoCAD** and **3D modeling** practices, improving team competency by **20%** in understanding complex designs and calculations.\n- Analyzed and optimized project schedules to ensure timely delivery of engineering solutions, achieving milestones for **95%** of projects on time.\n- Employed innovative problem-solving techniques in civil and mechanical domains, effectively addressing project challenges resulting in reduced costs by **15%** across multiple projects."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **AutoCAD** and **3D modeling** techniques to design and create detailed engineering plans, ensuring compliance with industry standards and enhancing project deliverables.\nConducted thorough load calculations and prepared lifting plans for complex rigging and crane operations, guaranteeing safety and efficiency in all lifting activities.\nCollaborated with cross-functional teams to integrate mechanical engineering solutions that improved project timelines by **15%**, focusing on innovative design approaches and enhancements.\nApplied **Finite Element Analysis (FEA)** tools to analyze structural integrity and performance, resulting in an **8%** decrease in material costs while maintaining project safety and reliability.\nExecuted project management strategies using **MS Office** tools, achieving adherence to project schedules and budgets with a **20%** enhancement in team productivity.\nLed multiple engineering projects, optimizing workflows and ensuring milestones were met efficiently, which contributed to a **10%** increase in overall project success rates.\nMentored junior engineers in best practices for mechanical design and analysis, fostering a collaborative and innovative team culture."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Applied advanced engineering principles in **AutoCAD** and **3D modeling** to create detailed designs and schematics for civil and mechanical projects, ensuring precision and adherence to project requirements.\nConducted thorough **load calculations** and developed comprehensive **lifting plans** utilizing expertise in rigging and crane operations to guarantee safe execution of heavy lifting operations.\nUtilized **MS Office** to prepare detailed project documentation, reports, and presentations, effectively communicating complex engineering ideas to stakeholders.\nExecuted Finite Element Analysis (**FEA**) to assess structural integrity and performance under various load conditions, driving decisions in design adjustments and material selection.\nCollaborated with cross-functional teams to enhance workflow efficiency, previously reducing project turnaround time by **25%** through optimized process planning and resource allocation.\nLed project assessments and reviews, delivering quality assurance on an average of **10** projects concurrently, ensuring timely completion while maintaining engineering standards and safety protocols.\nFacilitated technical training sessions for **3** junior engineers, improving team capability in utilizing tech tools and engineering strategies like **AutoCAD** and **FEA**."
    }
  ],
  "skills": "Programming Languages:\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tCivil, Mechanical, AutoCAD, 3D modeling, FEA, MS Office, rigging, crane, load calculations, lifting plans",
  "apply_company": "Omega Morgan, Inc."
}