{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience in full stack development, specializing in delivering high-performance applications in compliance-driven environments. Proficient in **Java**, **AWS**, **Spring**, **Spring Boot**, and **Hibernate**, leveraging robust technologies to build scalable solutions. Experienced in implementing **CI/CD** pipelines, utilizing **Docker** and **GitHub** for efficient code management and deployment.\n\nDemonstrated leadership in developing client-server architectures and distributed systems, employing multithreading techniques to enhance performance. Recognized for strong problem-solving abilities and innovative approaches to software challenges, with hands-on expertise in building AI/ML-powered platforms using **Python**, **JavaScript**, and **Flutter**. Well-versed in both frontend (React, Next.js, Vue) and backend (Node.js, FastAPI, Django) development, ensuring a holistic approach to application architecture.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Led the development of scalable software solutions leveraging **Java**, **Spring Boot**, and **Hibernate**, ensuring high performance and reliability in client-server architectures.\nImplemented **CI/CD** pipelines utilizing **GitHub Actions**, fostering continuous integration and deployment processes to enhance productivity and minimize deployment times by **30%**.\nDesigned and maintained containerized applications using **Docker**, contributing to the deployment of microservices within distributed systems for enhanced development and operational efficiency.\nFacilitated multithreading implementations to optimize software performance, significantly reducing processing times by up to **25%** in critical applications.\nMentored junior engineers, promoting leadership and problem-solving skills through code reviews, knowledge sharing, and collaborative project management.\nIntegrated cloud services on **AWS**, implementing scalable architectures that support both processing and storage requirements of data-intensive applications.\nEngineered software solutions that adhere to best practices in DevOps, ensuring high standards of code quality and security throughout the development lifecycle.\nOversaw cross-functional project teams, driving initiatives that improve software quality and user satisfaction metrics by **40%** through effective communication and technical guidance.\nCollaborated on integrating emerging technologies, including **GenAI**, to enhance application capabilities and reduce development time for new features by **15%**.\nResolved complex technical challenges in distributed systems, leveraging advanced debugging tools and techniques to maintain system reliability and performance."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Java** and **Spring Boot** to enhance application performance and scalability in distributed systems, contributing to a **30%** reduction in response time for high-volume transactions.\nImplemented **Docker** for containerization and **AWS** for cloud deployment, improving CI/CD pipeline efficiency by **40%** and enabling rapid scalability.\nLed a team of developers in adopting **GitHub** for version control and collaboration, streamlining code review processes and increasing team productivity by **25%**.\nApplied **Java**'s multithreading capabilities to develop performance-optimized components, enhancing system responsiveness during peak loads by **50%**.\nCollaborated with cross-functional teams to design and implement reliable client-server architectures, facilitating seamless integration of financial tools and systems.\nIntegrated **GenAI** features to enhance user experience and provide personalized insights, fulfilling project milestones ahead of deadlines by **2 weeks**.\nFostered a culture of **DevOps** practices among team members, leading to a significant reduction in deployment time and improved overall software quality through automated testing and continuous integration.\nExhibited strong **leadership** and **problem-solving** skills by mentoring junior engineers and addressing technical challenges promptly, ensuring project delivery within budget and timeline."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Led the design and optimization of robust backend services for high-traffic applications using **Java** and **Spring Boot**, ensuring high availability and scalability across various modules.\nImplemented CI/CD pipelines using **Docker** and **GitHub** to streamline the deployment process, significantly reducing release times by **30%**.\nApplied **multithreading** techniques to enhance the performance of applications under heavy loads, achieving response times under **100ms** for critical transactions.\nUtilized **AWS** cloud services to architect and manage infrastructure, leading to improved system performance and reduced operational costs by **20%**.\nDesigned and developed distributed systems using **Hibernate** for ORM, ensuring efficient data handling and processing capabilities.\nConducted regular code reviews and provided mentorship, fostering a culture of leadership and problem-solving within the team, which improved overall team productivity by **25%**.\nCollaborated closely with frontend teams to integrate responsive UIs, ensuring seamless client-server communication and enhancing user experience across platforms.\nImplemented best practices for security and data privacy, utilizing role-based access control (RBAC) to protect sensitive information and maintain GDPR compliance.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tJava, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring, Hibernate, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, GenAl, multithreading, client-server architecture, distributed systems, leadership, problem-solving",
  "apply_company": "Grupo TECDATA Engineering"
}