{
  "name": "Rei Taro",
  "role_name": "Senior AI Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior AI Engineer with over 10 years of experience in the AI development lifecycle, specializing in Large Language Models (LLMs) and frameworks such as **LangChain**, **AutoGen**, **Crew**, and **Swarm**. Proficient in machine learning, deep learning, and reinforcement learning, with hands-on experience in model development and fine-tuning. Proven ability to tackle complex challenges through critical thinking and problem-solving. Adept at collaborating effectively and communicating technical concepts to diverse stakeholders. Additionally, I have a solid background in designing and delivering backend systems, focusing on scalable service architectures and high-performing APIs using **Python** (**FastAPI**, **Django**, **Flask**) and cloud technologies like **AWS** and **Azure**. My career includes impactful contributions to organizations such as VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior AI Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **machine learning**, **deep learning**, and **reinforcement learning** techniques to enhance AI model performance, demonstrating effective problem-solving and critical thinking skills.\nDrove model development and fine-tuning processes, producing scalable AI solutions that increased efficiency by **30%**.\nCollaborated with R&D teams to implement **LLMs**, **LangChain**, and **AutoGen** frameworks, enabling advanced capabilities in AI functionality.\nEngineered backend services using **Python** and **FastAPI** to support the deployment of AI-driven applications, thus ensuring seamless integration with existing technologies.\nDeployed microservices on **Azure App Services** and utilized **Terraform** to manage infrastructure as code, optimizing deployment speed by **25%**.\nManaged asynchronous processing for AI workflows using **Celery** and **Redis**, improving data handling and processing times for requests by **20%**.\nConducted documentation and communication with stakeholders to effectively articulate complex AI concepts and progress, fostering collaborative project environments.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **LLMs** and **LangChain** to enhance machine learning models for improved decision-making processes and streamline AI development lifecycle tasks.\nDeveloped and fine-tuned AI models using **AutoGen** strategies to refine outputs and improve performance, maintaining version control through **Git** to track changes effectively.\nEngineered solutions with **Crew** and **Swarm** frameworks for distributed reinforcement learning tasks, facilitating efficient collaboration and problem-solving within teams.\nConducted R&D initiatives focusing on integrating deep learning techniques to advance model development, achieving a **30%** increase in prediction accuracy in key projects.\nImplemented security measures and communicated effectively with cross-functional teams, ensuring compliance with industry standards and regulations for AI projects.\nLed project management tasks while enhancing communication flow within teams, contributing to successful release management and timely project deliveries on over **10** major initiatives.\n"
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **machine learning**, **deep learning**, and **reinforcement learning** techniques to develop innovative AI models, enhancing the efficacy of trading algorithms.\nConducted comprehensive **model development** and **fine-tuning** for large language models (LLMs) to ensure optimal performance in trading applications.\nCollaborated within cross-functional teams to leverage **LangChain**, **AutoGen**, and **Swarm** technologies for advanced AI solution integration.\nDrove research and development (R&D) initiatives, leading to the implementation of cutting-edge AI solutions that increase trading efficiency by **25%**.\nEstablished clear communication channels among stakeholders, resulting in streamlined project timelines and improved problem-solving capabilities across teams.\nIntroduced best practices for the **AI development lifecycle**, ensuring regulatory compliance and adherence to organizational guidelines for AI deployment.\nImplemented rigorous testing protocols and documentation standards to validate AI models, achieving a **40%** reduction in system errors and processing time.\nCultivated a culture of **critical thinking** and innovation among team members, fostering an environment that encourages experimentation and new ideas."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Git\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tPandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, LLMs, LangChain, AutoGen, Crew, Swarm, machine learning, deep learning, reinforcement learning, fine-tuning, model development, R&D, AI development lifecycle, problem-solving, critical thinking, communication",
  "apply_company": "Elixirr Digital"
}