{
  "name": "Rei Taro",
  "role_name": "Senior Fullstack Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Fullstack Engineer with over 10 years of robust experience in developing high-quality, scalable web applications. Proficient in **Node.js**, **JavaScript**, **HTML**, **CSS**, and modern frameworks such as **VueJS** for creating dynamic user interfaces. Skilled in version control with **Git** and package management using **npm** along with build tools like **Webpack**. Experienced in backend development with a strong focus on **API** design and cloud integration. Track record of leveraging AI and automation to enhance application performance, demonstrated through successful projects in collaboration with prestigious organizations such as VISA. Committed to writing clean, maintainable code and employing testing frameworks like **Mocha** and **Jest** to ensure software quality.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Fullstack Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented user interfaces using **VueJS**, **JavaScript**, **CSS**, and **HTML** to enhance user experience and optimize performance.\nIntegrated diverse third-party tools and APIs, utilizing **Git** for version control and project collaboration, achieving 99% deployment success rate.\nDeveloped and maintained both frontend and backend services using **Node.js** to support business logic and application functionality.\nUtilized **Webpack** and **npm** for efficient module bundling and dependency management, resulting in a decrease of build times by **30%**.\nConducted unit testing with **Mocha** and **Jest**, improving code reliability and quality before production releases with a test coverage of **85%**.\nEngaged in continuous integration and continuous deployment (CI/CD) to streamline the software delivery process, reducing release cycles by **50%**.\nLed the migration of legacy systems to modern frameworks, facilitating better scalability and maintainability of web applications."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **Node.js** and **JavaScript** to develop responsive frontend applications, ensuring seamless user experience across various devices.\nImplemented **CSS**, **HTML**, and **SASS** for effective UI design, enhancing aesthetics and functionality of web interfaces.\nEmployed **Git** for version control, managing code collaboration amongst teams and maintaining a clean project history.\nExecuted unit and integration tests using **Mocha** and **Jest**, achieving over **95%** code coverage and improving software reliability.\nIntegrated **Webpack** for module bundling, optimizing asset delivery and improving application loading times by up to **40%**.\nParticipated in Agile development practices, contributing to sprint planning and enhancing development cycles by utilizing tools like **npm** for package management.\nImproved performance metrics and reduced page load times by **30%** through strategic frontend optimizations and best practices in web development.\nCollaborated with UX/UI designers to translate designs into functional components in **VueJS**, ensuring the delivery of a highly interactive user experience."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed robust front-end components using **VueJS**, **JavaScript**, **HTML**, **CSS**, and **SASS** to enhance user experience in trading applications.\n• Implemented version **4.0** of **Webpack** for optimized asset bundling and improved load times, significantly enhancing platform performance.\n• Utilized **Git** for version control, ensuring streamlined collaboration across **5** team members and maintaining code integrity throughout development cycles.\n• Designed and constructed RESTful APIs to facilitate seamless integration with back-end services and managed extensive backend operations with **Node.js**.\n• Integrated testing frameworks like **Mocha** and **Jest** to achieve **95%** code coverage, enhancing code reliability and facilitating continuous integration.\n• Collaborated with cross-functional teams to implement scalable solutions, providing efficient support for up to **10,000** concurrent users.\n• Actively participated in code reviews and conducted knowledge sharing sessions, fostering a culture of continuous improvement and innovation in tech stack adoption."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript, PHP\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery, Node.js\n\n**Frontend Frameworks**\n\tVueJS, CSS, HTML, Webpack, npm, PostCSS, SASS, Mocha, Jest\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git\n\n**Other**\n\tAI, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka",
  "apply_company": "Skipso"
}