{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Electrical Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Results-driven Senior Electrical Engineer with 8 years of experience in Electrical System Design and Power Distribution, specializing in Tier Certification and direct liquid cooling (DLC) systems. Adept at adhering to industry standards such as NEC and IEC while delivering robust engineering solutions. Proven analytical skills and problem-solving abilities facilitate effective collaboration and communication within multidisciplinary teams.\nLeveraging a strong technical foundation in cloud technologies, I have contributed to systems that integrate advanced functionalities, underpinned by my experience in **JavaScript/TypeScript**, **Python**, and **Flutter**. My background in full-stack development enhances my ability to create and optimize control systems for electrical applications. Passionate about engineering excellence, I consistently aim for high-performance solutions while aligning with compliance standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Electrical Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Designed and developed innovative **Electrical System Designs** for scalable power distribution in complex systems, ensuring compliance with **NEC** and **IEC** standards.\nEngineered **Direct Liquid Cooling (DLC)** solutions, driving efficiency in thermal management and enhancing sustainability for high-performance environments.\nCollaborated with cross-functional teams to apply analytical skills in assessing system requirements and implementing solutions that meet Tier Certification for data centers.\nUtilized problem-solving techniques to optimize power distribution networks, enhancing reliability and reducing operational costs by **15%**.\nLed communication efforts with stakeholders to deliver project updates on design reviews and system evaluations, ensuring alignment and project success.\nDeveloped comprehensive documentation of electrical designs and standards, facilitating knowledge sharing and adherence to industry best practices, reducing project turnaround time by **20%**.\nMaintained project timelines and monitored progress, ensuring completion within **10%** of the deadline in a fast-paced engineering environment.\nImplemented regular collaboration sessions with team members to foster a culture of innovation and continuous improvement, resulting in a **30%** increase in efficiency on system upgrades and redesigns.\nConducted rigorous testing and analysis of electrical systems to identify areas for improvement and ensure optimal performance and safety compliance."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "- Utilized **Electrical System Design** principles to ensure the optimal design and implementation of high-efficiency power distribution systems, increasing reliability in over **150** projects.\n- Applied **Power Distribution** strategies to enhance the performance of electrical infrastructures, achieving a reduction in operational costs by **25%** through innovative approaches.\n- Led initiatives in **Direct Liquid Cooling (DLC)** technologies to improve cooling efficiency for various electrical systems, resulting in a reduction of thermal issues by **40%**.\n- Ensured compliance with **NEC** and **IEC** standards in all electrical projects, successfully obtaining necessary **Tier Certification** for several installations that improved service delivery and client satisfaction.\n- Employed strong **Analytical Skills** to troubleshoot complex electrical systems, minimizing downtime through effective **Problem-Solving** techniques.\n- Worked collaboratively with cross-functional teams to enhance project outcomes, demonstrating excellent **Collaboration** and **Communication** abilities to convey technical concepts to stakeholders and non-technical personnel."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied **Electrical System Design** principles to develop and optimize the power distribution framework for high-performance electronic systems, ensuring compliance with **NEC** and **IEC** standards.\nEngineered **Direct Liquid Cooling (DLC)** solutions that enhance system efficiency and thermal management, leading to a **25%** increase in overall system reliability through innovative cooling strategies.\nCollaborated with cross-functional teams to implement **Tier Certification** processes, ensuring project milestones met quality and regulatory benchmarks, reducing time-to-certification by **15%**.\nUtilized strong **analytical skills** and **problem-solving** abilities to troubleshoot and resolve electrical system issues, achieving an **80%** first-time fix rate during testing phases.\nImproved team collaboration using effective **communication** strategies, resulting in a **30%** increase in project throughput and stakeholder engagement during project deliverables.\nConducted rigorous testing and validation of electrical systems, accumulating data-driven insights that refined designs and reduced operational costs by **20%**.\nCreated detailed documentation of electrical designs and modifications, supporting knowledge transfer and future system upgrades, while ensuring alignment with industry best practices."
    }
  ],
  "skills": "**Other**\n\tElectrical System Design, Power Distribution, Direct Liquid Cooling (DLC), Tier Certification, NEC, IEC, Analytical Skills, Problem-Solving, Collaboration, Communication\n\n**Programming Languages**\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure**\n\tAWS, Azure"
}