{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior QA Engineer with 13+ years of experience in delivering high-performance applications, with a strong focus on compliance-driven development and robust testing strategies. Skilled in **Python**, **Django**, and **GitLab** with proven expertise in utilizing **Pytest** for thorough testing practices. Experienced in multi-platform environments, proficient in **Windows**, **Linux**, and **Unix** systems.\nStrong background in database management and networking concepts, including **DNS**, **DHCP**, and virtualization technologies. Demonstrated ability to support cloud-native systems through continuous integration and delivery processes. Committed to building high-quality solutions that align with industry standards in the healthcare and finance sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed comprehensive testing strategies leveraging **Python** and **Django** to ensure high software quality across healthcare and fintech applications.\nExecuted rigorous test automation processes using **Pytest** and integrated continuous testing within CI/CD pipelines through **GitLab** and **Microsoft TFS**.\nConducted functional, integration, and regression testing on a technology stack that includes **Windows**, **Linux**, and **Unix** operating systems, resulting in a 95% defect detection rate pre-production.\nUtilized **TestRail** for meticulous tracking of test cases and test results, enhancing overall project visibility and collaboration.\nDesigned and documented test plans catering to various environments, ensuring compliance with industry standards including HIPAA and PCI DSS.\nManaged database interactions using various **Databases** systems with a focus on test data management, leading to a 30% reduction in testing cycle times.\nImplemented network testing strategies focusing on **Networking**, **DNS**, and **DHCP** functionalities, improving application reliability metrics by 20%.\nWorked alongside development teams to troubleshoot and resolve issues resolutely within an agile framework, improving the throughput of sprint deliverables by 25%.\nImproved testing efficiencies through virtualization technologies, which reduced infrastructure costs by 15% and maximized resource utilization.\nCollaborated in cross-functional teams during the software lifecycle to offer insights into best practices for quality assurance, aligning with business objectives and customer satisfaction goals."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Applied **Python** programming skills to develop and maintain robust testing frameworks, improving overall test coverage and efficiency for high-volume application environments.\nUtilized **Django** for test-driven development, ensuring code quality and stability through automated unit and integration testing, while optimizing performance metrics by **30%**.\nEmployed **GitLab** for version control and continuous integration, enhancing collaboration among development teams and reducing deployment times by **25%**.\nLeveraged **Pytest** for crafting and executing comprehensive test cases, achieving a bug resolution rate of **90%** within initial testing phases.\nContributed expertise in **Windows**, **Linux**, and **Unix** systems to create cross-platform testing strategies, enhancing compatibility across diverse environments.\nEngaged with various **databases** to validate data integrity and accuracy in applications through structured testing scenarios.\nImplemented networking principles, including **DNS** and **DHCP**, in testing environments to simulate real-world networking conditions and ensure application reliability.\nUtilized **TestRail** to manage test cases, track test results, and report on testing progress, facilitating a streamlined QA process and improving communication with stakeholders.\nIntegrated virtualization techniques to mimic production environments, leading to pre-deployment testing that mitigated operational risks by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted rigorous testing of software applications and systems developed in **Python** (Django) to ensure quality, reliability, and performance in a fast-paced e-commerce environment.\nCollaborated with cross-functional teams to implement **GitLab** and Microsoft TFS version control for comprehensive project management and code quality monitoring, maintaining a high standard for source code integrity.\nDeveloped and executed detailed test plans and cases using **TestRail**, focusing on test case design, execution, and defect tracking, leading to a **30%** reduction in post-release defects.\nUtilized **Pytest** for automated testing of back-end functionalities, enhancing test accuracy and coverage, resulting in quicker test cycles and efficient iterations.\nEnsured compatibility and performance across **Windows, Linux, and Unix** environments, validating that delivered solutions met diverse user needs and warranty specifications.\nManaged database testing strategies across various databases, ensuring reliability and performance of storage solutions for high-traffic applications and maintaining stringent **DNS** and **DHCP** configurations.\nApplied networking principles to validate application dependencies, ensuring effective communication protocols and connectivity across distributed systems.\nImplemented virtualization strategies for testing environments, allowing for rapid provisioning and scaling up of test resources, which improved efficiency by **50%**.\nMaintained thorough documentation and reporting of all QA activities, providing stakeholders with real-time insights into testing status and defect trends to facilitate informed decision-making."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, C#, C/C++, PowerShell\n\n**Backend Frameworks:**\n\tDjango, FastAPI, Flask\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS; Azure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3; Azure: Blob Storage, SQL Database \n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, Windows, Linux, Unix, Networking, DNS, DHCP, Virtualization, TestRail",
  "apply_company": "Veeam"
}