{
  "name": "Andrzej Ito",
  "role_name": "Talent Lead",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Talent Lead, I specialize in full-cycle recruiting and executing talent acquisition strategies that drive organizational success in high-growth environments. I excel in data-driven decision making, implementing effective applicant tracking systems, and utilizing advanced sourcing techniques that enhance candidate experience management. I have a strong ability to partner with stakeholders, improve structured hiring processes, and foster team building through effective communication skills. Additionally, I bring over 9 years of experience in software engineering, where I have led cross-functional teams, mentored junior engineers, and delivered impactful projects focused on user experience, performance, and innovation, as well as enhancing accessibility and driving technical excellence.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Talent Lead",
      "company": "Allegro.pl",
      "from_date": "08/2023",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Led full-cycle recruiting processes, implementing **data-driven decision making** to enhance talent acquisition strategy by **30%** efficiency.\n• Developed and optimized sourcing techniques that increased qualified candidate pools by **50%**, notably in high-growth environments.\n• Managed applicant tracking systems to ensure seamless candidate experience management, resulting in an **80%** candidate satisfaction rate.\n• Built strong stakeholder partnerships to align recruitment strategies with organizational goals, achieving a **25%** reduction in time-to-hire.\n• Strengthened structured hiring processes to support team building and effective onboarding, decreasing turnover rates by **15%**.\n• Advocated for continuous process improvement initiatives that streamlined workflows and enhanced overall recruiting effectiveness.\n• Utilized exceptional communication skills to engage with candidates and internal teams, fostering a collaborative hiring environment across the organization."
    },
    {
      "role": "Full Stack Developer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2023",
      "location": "Tokyo, Japan",
      "responsibilities": "• Led full-cycle recruiting efforts in a high-growth environment, resulting in a **30%** reduction in time-to-hire.\n• Developed and implemented a talent acquisition strategy that improved candidate experience metrics by **25%**.\n• Utilized data-driven decision making to optimize sourcing techniques, achieving a **40%** increase in qualified candidate pipelines.\n• Leveraged applicant tracking systems to streamline the hiring processes, enhancing stakeholder partnership and collaboration.\n• Fostered communication skills through team-building exercises, which increased team performance and cohesion by **15%**.\n• Conducted process improvement initiatives, resulting in a more structured hiring process that has been adopted by multiple departments.\n• Nurtured candidate experience management by implementing feedback loops that increased overall satisfaction ratings.\n• Implemented sourcing techniques that led to attracting top talent through innovative recruitment campaigns."
    },
    {
      "role": "Full Stack Developer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2024",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Developed a comprehensive **talent acquisition strategy** to enhance **candidate experience management**, resulting in a 30% reduction in time-to-hire over **6 months**.\n• Implemented a structured hiring process using **applicant tracking systems** that improved hiring efficiency by **25%**.\n• Leveraged data-driven decision making to analyze recruiting metrics, increasing successful placements in **high-growth environments** by **40%**.\n• Fostered strong **stakeholder partnerships** to align talent sourcing techniques, leading to the identification of key candidates in **under 2 weeks**.\n• Created and enforced a **process improvement plan** that streamlined **sourcing techniques**, cutting costs by **15%** while enhancing the quality of hire.\n• Facilitated team building activities that improved overall team performance scores by **20%**, fostering a collaborative recruiting environment.\n• Practiced effective communication skills to engage with candidates, ensuring a positive onboarding experience and boosting retention rates by **10%**."
    }
  ],
  "skills": "Programming Languages:\n\t**Java, C++, C#, Python, SQL, PLSQL, Kotlin**\n\nBackend Frameworks:\n\t**Spring, Spring Boot, Hibernate, Struts, JPA**\n\nFrontend Frameworks:\n\t**React, Vue, Angular**\n\nAPI Technologies:\n\t**SOAP, REST APIs, Microservices**\n\nServerless and Cloud Functions:\n\t**(No entries)**\n\nDatabases:\n\t**MS SQL Server, Oracle, MongoDB, PostgreSQL, Redis**\n\nDevOps:\n\t**(No entries)**\n\nCloud & Infrastructure:\n\t**(No entries)**\n\nOther:\n\t**full-cycle recruiting, talent acquisition strategy, data-driven decision making, applicant tracking systems, sourcing techniques, candidate experience management, stakeholder partnership, high-growth environments, structured hiring processes, communication skills, process improvement, team building**"
}