{
  "name": "Rei Taro",
  "role_name": "Senior Query Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Query Engineer with over 10 years of experience in software design and systems programming. Proficient in crafting efficient databases and query engines, focused on leveraging advanced data structures and algorithms to optimize performance and code quality. Extensive background in multi-cloud environments, specifically using **AWS** and **Azure**, alongside expertise in **Change Streams** and **Atlas** for seamless data analytics. Known for delivering robust production code that enhances transactional and time-series data management, contributing to high-driven projects at leading firms such as VISA, Sii Poland, and Reply Polska. A strong foundation in backend development complemented by a passion for innovative solutions and cloud-native architectures.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Query Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Utilized **C++** for high-performance systems programming and engineered robust software design solutions for complex data structures and algorithms.\nDeveloped and optimized **database** architectures to enhance the efficiency of query engines and support transactional and time-series analytics.\nImplemented strict **code quality** measures in production code to ensure reliability and maintainability, achieving less than **5%** bug rates.\nLeveraged **Change Streams** for real-time data handling and updates, effectively managing data flow across multi-cloud environments.\nDesigned and executed cutting-edge analytics solutions, enhancing decision-making and reducing processing times by over **30%**.\nCollaborated closely with teams to refine development processes and ensure alignment with best practices in cloud-native environments, achieving a **99.9%** uptime record in service availability.\nAdopted tooling and strategies to maintain resilience and scalability within cross-cloud frameworks, promoting efficient infrastructure management."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **C++** for developing high-performance query engines, enhancing system programming efficiency.\nImplemented robust data structures and algorithms in project components to optimize query performance and system design.\nEnsured production code quality through rigorous testing and adherence to coding standards, facilitating code reviews that improved overall maintainability by **25%**.\nEngineered and maintained scalable databases and analytics solutions, leveraging **cloud-native** technologies for improved responsiveness under load.\nDesigned and optimized database queries, achieving a **30%** reduction in average query response time.\nCollaborated with cross-functional teams to define system architecture and ensure compliance with industry standards, resulting in successful project delivery on time, meeting **100%** of deployment deadlines.\nIntegrated **Change Streams** in **Atlas** to provide real-time analytics capabilities for time-series data handling, enhancing data retrieval processes."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Leveraged **C++** to develop high-performance backend services that enhance trading operations and optimize query performance.\nUtilized robust **database** management techniques to improve transactional efficiency and data accessibility for portfolio management and account tracking.\nDesigned and implemented advanced **query engine** functionalities that efficiently process complex data structures and algorithms, achieving a **20%** reduction in query response times.\nFocused on high-quality **production code** development, ensuring adherence to strict code quality standards through regular code reviews and maintenance.\nEmployed **cloud-native** strategies for deploying services in a **multi-cloud** environment, providing scalable and resilient solutions.\nIncorporated analytics to monitor performance metrics, improving processing times by **15%** across critical backend tasks.\nCollaborated in systems programming to enhance the platform's infrastructure, ensuring compliance with regulatory requirements, including MiFID II and GDPR.\nDelivered a comprehensive test suite utilizing **PyTest** and other testing frameworks, contributing to a **30%** increase in deployment frequency and reliability."
    }
  ],
  "skills": "**Programming Languages**\n\tC++, Python (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure, cloud native\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis, Change Streams, transactional, time-series, analytics, atlas\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, code quality\n\n**Cloud & Infrastructure**\n\tmulti-cloud\n\n**Other**\n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, data structures, algorithms, software design, systems programming, production code",
  "apply_company": "MongoDB"
}