{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Skilled Software Engineer with 13+ years of experience specializing in **React**, **JavaScript**, **HTML**, **CSS**, and comprehensive backend development. Proficient in creating high-performance applications with a focus on UI/UX and performance profiling. Experienced in using testing libraries to ensure robust application functionality and optimizing code performance.\nDemonstrated ability in cross-team collaboration to deliver solutions effectively within diverse environments. Background includes significant contributions to open-source projects, enhancing industry knowledge and technical skills. Additional strengths include familiarity with **Ruby** and **Go**, combined with excellent written and verbal communication skills.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed dynamic and user-friendly interfaces using **React** and **JavaScript** to enhance the overall user experience in healthcare and fintech applications.\n• Implemented responsive design principles utilizing **HTML** and **CSS** to ensure compatibility across various devices and browsers.\n• Collaborated with cross-functional teams to align on project goals and deliver high-quality software solutions, fostering effective communication through written documentation and public speaking.\n• Conducted thorough testing and debugging using various testing libraries to ensure product reliability and performance, implementing UI tests with tools like Jest and Cypress.\n• Championed performance profiling initiatives to optimize application speed and responsiveness, achieving loading times optimized to less than **2 seconds**.\n• Contributed to open-source projects to maintain best practices in coding, tools, and technologies, enhancing personal and team visibility in the developer community.\n• Engaged in backend development using **Ruby** and **Go** for building robust server-side applications, ensuring seamless integration with frontend components.\n• Created detailed technical documentation to facilitate knowledge sharing and maintain project transparency among team members.\n• Drove innovative UI/UX design improvements based on user feedback and usability testing, leading to increased user satisfaction by **25%**.\n• Actively participated in code reviews to uphold the quality of codebase and enforce coding standards and best practices, resulting in a **30%** increase in onboarding efficiency for new team members.\n• Enhanced team collaboration and productivity through effective communication strategies, ensuring alignment within teams and clarity on project expectations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React** (18), **JavaScript**, **HTML**, and **CSS** to develop interactive and user-friendly front-end applications for financial tools and admin panels, improving the overall **UI/UX** and user engagement.\nEmployed performance profiling techniques to enhance application efficiency, ensuring responsiveness and optimal resource usage for high-volume transactional systems.\nCollaborated with cross-functional teams to integrate back-end services using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), aligning efforts towards shared project goals and improving project delivery timelines by **20%**.\nImplemented robust testing libraries to ensure high code quality and reliability within all deployed applications, maximizing uptime and user satisfaction.\nDesigned and constructed a microservices architecture for core financial platforms, significantly enhancing scalability and performance across various transactional services.\nDelivered real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, enabling instant insights and decision-making for operational teams handling over **1M** transactions per month.\nContributed to open-source projects and engaged in public speaking events to share insights on best practices in software engineering, fostering community growth.\nDeveloped and deployed ETL pipelines for financial data processing using **Apache Airflow** and **Azure Data Factory**, efficiently managing both batch and real-time data ingestion.\nUtilized machine learning libraries such as **scikit-learn** and **XGBoost** for fraud detection, creating models based on user behavior and transaction patterns, achieving a detection rate improvement of **30%**.\nCreated machine learning pipelines for credit scoring and churn prediction, leveraging **MLflow** and **Airflow** to ensure seamless integration of model inference into back-end services."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized user interfaces utilizing **React** and **JavaScript**, ensuring a high-quality, responsive user experience aligned with UI/UX best practices.\nImplemented modern web standards through **HTML5** and **CSS3**, creating visually appealing, efficient, and accessible designs in compliance with WCAG 2.1.\nConducted rigorous performance profiling for web applications, achieving up to **30%** improvement in load times and enhancing overall user satisfaction.\nCollaborated effectively with cross-functional teams to deliver seamless backend development, utilizing frameworks such as **Ruby on Rails** and **Go**, ensuring robust integration of services across the platform.\nContributed to open-source projects, increasing engagement with the developer community and enhancing personal technical skills while promoting company visibility.\nUtilized various testing libraries to maintain high code quality, ensuring the delivery of reliable and maintainable software solutions.\nParticipated in public speaking engagements to share insights on software development practices and the effective use of **API** integrations, raising awareness of best practices in the industry.\nMaintained clear and concise written communication with stakeholders to document project updates and technical specifications, facilitating better understanding and collaboration across teams."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact,\n\tJavaScript,\n\tHTML,\n\tCSS,\n\tVue,\n\tAngular,\n\n**Backend Frameworks:**\n\tPython: FastAPI,\n\tFlask,\n\tDjango,\n\n**Other:**\n\tUI/UX,\n\tTesting libraries,\n\tBackend development,\n\tCross-team collaboration,\n\tPerformance profiling,\n\tOpen-source contribution,\n\tRuby,\n\tGo,\n\tPublic speaking,\n\tWritten communication,\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC),\n\tOAuth2,\n\tJWT,\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS,\n\tLambda,\n\tRDS,\n\tS3,\n\tAzure: App Services,\n\tBlob Storage,\n\tSQL Database,\n\n**Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\n**DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose,\n\n**Cloud & Infrastructure:**\n\tAWS,\n\tAzure,\n\tNginx,\n\tLet’s Encrypt,\n\tCertbot"
}