{
  "name": "Rei Taro",
  "role_name": "Senior Application Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Application Engineer with over 10 years of experience in robust security practices including Bug Bounty, Pentesting, and vulnerability assessments using tools such as **Burp Suite**, **OWASP**, **SAST**, **DAST**, **SonarQube**, and **Snyk**. Proficient in CI/CD processes utilizing **Jenkins** and **GitLabCI**, and skilled with **Terraform** and **Helm** for infrastructure as code deployments, ensuring high-quality, secure, and scalable applications. Excellent problem-solving and communication skills contribute to effective project execution. Proven experience in designing backend systems for financial platforms and automation tools leveraging **Python** (FastAPI, Django, Flask) and deploying on **AWS** and **Azure**. Demonstrated ability to improve security posture and optimize performance while contributing to impactful projects at renowned organizations like VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Application Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Implemented security best practices to enhance application integrity, utilizing tools such as **Burp Suite**, **SonarQube**, and **Snyk** for continuous vulnerability assessment and remediation.\nConducted penetration testing and security assessments in line with **OWASP** guidelines, ensuring robust application security.\nDeveloped CI/CD pipelines with **Jenkins** and **GitLabCI**, achieving a **30%** increase in deployment efficiency and reducing code integration errors by **25%**.\nUtilized **Terraform** and **Helm** for infrastructure management, achieving a **20%** reduction in deployment times and maintaining version-controlled infrastructure as code.\nApplied Static Application Security Testing (**SAST**) and Dynamic Application Security Testing (**DAST**) to improve secure coding practices and decrease potential vulnerabilities by **40%**.\nEffectively collaborated with cross-functional teams to solve complex integration challenges and ensure compliance with industry standards, showcasing strong problem-solving and communication skills.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Utilized **CI/CD** practices with **Jenkins** and **GitLabCI** to enhance the deployment pipeline for the backend systems, increasing deployment frequency by **40%**.\nImplemented automated security testing protocols using **SAST**, **DAST**, and tools like **SonarQube** and **Snyk** to identify vulnerabilities, improving code quality and security standards compliance, achieving a **30%** reduction in security-related issues.\nConducted extensive **penetration testing** and security assessments utilizing **Burp Suite** and **OWASP** methodologies, successfully identifying and mitigating risks in application security.\nDeveloped robust backend systems in **Python** and **FastAPI** to automate document workflows, streamline user onboarding processes, and manage complex reporting needs, effectively reducing processing time by **25%**.\nCreated event-driven microservices using **Celery** and **Redis**, enabling asynchronous processing for **financial data** and transaction requests for over **200,000** transactions per day.\nManaged the deployment of microservices on **Azure App Services**, employing **Terraform** for infrastructure automation to ensure consistent and scalable environments, supporting an increase in monthly users from **10,000 to 50,000**.\nEngineered data pipelines for secure regulatory data exchanges using **Apache Airflow** and **Azure Functions**, automating data flow and improving efficiency by **35%**.\nPerformed comprehensive security audits ensuring compliance with industry standards, integrating **OAuth2** and **Azure AD B2C** for robust authentication and secure access control systems.\nCollaborated with cross-functional teams to ensure smooth system integration and successful release management, enhancing overall project communication and problem-solving strategies."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Implemented robust security measures throughout the application lifecycle utilizing **Burp Suite**, **OWASP** best practices, and **SonarQube** to identify vulnerabilities and enhance security posture.\n• Engaged in proactive **Pentesting** activities to ensure compliance with security standards and continuously improve system resilience.\n• Developed and maintained CI/CD pipelines with **Jenkins** and **GitLabCI**, ensuring reliable deployments and streamlined collaboration across teams.\n• Integrated **Terraform** and **Helm** for streamlined infrastructure management and deployment automation in cloud environments.\n• Fostered effective communication across teams and stakeholders to convey technical concepts and solutions, leading to improved project outcomes.\n• Streamlined application security through **SAST** and **DAST** methodologies, achieving a security-pass rate of over **95%** in code reviews.\n• Drove problem-solving initiatives within the team, resulting in the resolution of critical bugs and the enhancement of application stability by **30%**.\n• Collaborated closely with application development teams to establish a **WAF** (Web Application Firewall) that reduced attack vectors by **40%**, protecting user data and enhancing overall system security."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Frontend Frameworks**\n\t\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, Jenkins, GitLabCI, Terraform, Helm\n\n**Cloud & Infrastructure**\n\t\n\n**Other**\n\tBug Bounty, Pentesting, Burp Suite, OWASP, SAST, DAST, SonarQube, Snyk, WAF, Problem-Solving, Communication",
  "apply_company": "Swapcard"
}