{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior React Native Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior React Native Software Engineer with 8 years of experience, I specialize in developing cross-platform mobile applications utilizing **React Native** alongside **JavaScript** and **TypeScript**. My hands-on expertise in creating seamless user experiences is bolstered by a strong understanding of **UI/UX best practices**, where I prioritize user engagement and functionality.\nI possess extensive experience in building **RESTful APIs** and integrating with **Bluetooth Low Energy (BLE)** for hardware-connected applications, enhancing the functionality of smart home and energy systems. My background in software development includes proficiency with **CI/CD processes**, ensuring efficient and reliable code deployment.\nAdditionally, I am skilled in using tools like **Git** for version control and have a collaborative mindset that fosters strong communication across teams. My ability to work with **native modules** and **BLE libraries** further supports the development of innovative IoT solutions, including **EV charging tech**. I am committed to delivering high-performance solutions in dynamic environments, ensuring that projects are completed on time and meet top-quality standards.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior React Native Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed cross-platform mobile applications using **React Native** and **TypeScript**, ensuring adherence to **UI/UX best practices** for optimal user experiences across both iOS and Android platforms.\n• Collaborated with team members applying **RESTful APIs** to integrate smart home and **Bluetooth Low Energy (BLE)** technologies into healthcare applications, enhancing device connectivity.\n• Lead the implementation of **CI/CD processes** using Git, optimizing automated testing and deployment pipelines, and ensuring code quality through tools like **Jest**.\n• Architected mobile applications that utilize **native modules** to provide seamless interaction with hardware-connected capabilities, delivering high-performance enhancements.\n• Collaborated effectively with cross-functional teams leveraging strong **communication skills** to drive project timelines and deliver innovative solutions in energy systems and IoT applications.\n• Ensured scalable application performance through effective versioning and continuous updates, including maintaining Bluetooth libraries for enhanced connectivity.\n• Integrated collaborative debugging and testing strategies involving **Jest** and other testing frameworks to ensure robust application reliability across all platforms.\n• Actively participated in code reviews, fostering a **collaborative mindset** that encouraged sharing of knowledge and best practices amongst team members to enhance development efficiency."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **React Native** to develop cross-platform mobile applications for financial services, ensuring a seamless user experience and adherence to UI/UX best practices.\nImplemented **RESTful APIs** using **JavaScript** and **TypeScript** to enable dynamic interaction between front-end applications and backend services, ensuring data integrity and performance.\nIntegrated **Git** for version control, enhancing collaboration and promoting a robust CI/CD process that reduced deployment times by **30%**.\nLeveraged **Jest** for unit and integration testing, achieving **95%** code coverage to ensure application reliability and performance.\nParticipated in the design and deployment of hardware-connected applications, introducing **Bluetooth Low Energy (BLE)** capabilities to facilitate communication with smart home devices, enhancing user engagement.\nCollaborated with cross-functional teams to develop effective **IoT** solutions, specifically in smart home energy systems and **EV charging tech**, ensuring products met market demands.\nChampioned communication skills within the team, promoting a collaborative mindset that fostered innovation and timely project completion leading to **20%** increase in team efficiency.\nConducted thorough reviews of third-party libraries and **BLE** libraries for compatibility and performance, resulting in streamlined integrations and reduced development time.\nEngaged actively in client feedback cycles, utilizing insights to iterate on design and functionality, achieving a **4.8/5** user satisfaction rating in app reviews."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed cross-platform mobile applications using **React Native**, ensuring seamless integration with **RESTful APIs** for enhanced user experiences across both iOS and Android platforms.\nImplemented **TypeScript** for type safety and maintainability, promoting best practices and enabling smoother collaboration among developers.\nUtilized **JavaScript** for creating robust and scalable mobile features, leveraging **Git** for version control and collaborative development.\nConducted extensive **UI/UX** design reviews to adhere to best practices, ensuring applications are user-friendly and aligned with industry standards.\nEngineered integration with **Bluetooth Low Energy (BLE)** devices for smart home and IoT applications, allowing for innovative functionalities within the mobile environment.\nOptimized CI/CD processes for efficient deployment, utilizing tools like **Jest** for maintaining high-quality code through automated testing workflows.\nCollaborated on the design and implementation of **native modules** that enhance application performance and access to device capabilities.\nApplied best practices in **communication**, fostering a collaborative mindset within the development team to meet project timelines and client expectations.\nParticipated in discussions on **energy systems** and **EV charging tech**, ensuring all app features meet market needs and user demands within the smart home industry.\nProduced measurable improvements in app performance and user engagement, receiving positive feedback on application usability scores by up to **25%** in user testing."
    }
  ],
  "skills": "**Programming Languages:**\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, React Native, Vue, Angular\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tRESTful APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Git, CI/CD processes, UI/UX best practices, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Bluetooth Low Energy (BLE), Cross-platform mobile apps, Native modules, BLE libraries, Jest, IoT, smart home, hardware-connected apps, energy systems, EV charging tech, communication skills, collaborative mindset"
}