{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior SAP Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior SAP Engineer with a strong aptitude for configuration, troubleshooting, and root-cause analysis, complemented by over 13 years of experience as a Full Stack Developer in the healthcare and financial sectors. Proficient in collaborating with cross-functional teams to deliver high-performance solutions while leveraging analytical and problem-solving skills. Excellent communicator with a proven ability to navigate complex challenges effectively.\n\nExpertise in developing applications using **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms and deploying cloud-native systems on **AWS** and **Azure**. Skilled in implementing microservices and event-driven architectures, alongside CI/CD pipelines. Familiar with compliance standards such as HIPAA, FHIR, PCI DSS, and SOC 2, and MLOps techniques including **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior SAP Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized advanced **SAP** configuration and troubleshooting techniques to optimize payroll systems for UK clients, ensuring adherence to local regulations and improving operational efficiency.\nConducted thorough root-cause analysis to identify and resolve system issues, enhancing the overall user experience and minimizing downtime by **30%**.\nCollaborated effectively with cross-functional teams to design and implement strategic solutions, achieving a reduction in processing errors of **25%**.\nDemonstrated strong analytical skills by analyzing payroll data and providing actionable insights to stakeholders, improving team alignment and decision-making.\nEngaged in proactive communication with team members and stakeholders, facilitating smooth implementation processes and fostering a collaborative work environment.\nTrained junior team members on **SAP** functionalities and troubleshooting methodologies, improving team performance and knowledge-sharing.\nContributed to continuous improvement initiatives, leading to enhanced configuration processes and increased satisfaction among users by **20%**.\nImplemented SAP best practices, ensuring compliance with company standards and elevating the system's reliability and efficiency.\nLeveraged problem-solving skills to effectively address user queries and technical challenges, maintaining a high level of service and support."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **SAP** for configuration and troubleshooting, enhancing financial processes and payroll management systems.\nConducted root-cause analysis to address system issues and improve overall performance, directly impacting the efficiency of UK Payroll processes.\nCollaborated with cross-functional teams to streamline workflows, ensuring effective communication and team collaboration on projects.\nApplied analytical skills and problem-solving techniques to address system discrepancies, ensuring timely resolutions and maintaining system integrity.\nEngaged in **troubleshooting** existing applications, implementing solutions that led to a **30%** reduction in system downtimes and improved user satisfaction ratings.\nPresented complex findings and solutions to stakeholders, honing communication skills while driving clarity on SAP operational strategies.\nLeveraged team collaboration tools which reduced project completion times by **15%**, enabling faster delivery of payroll solutions."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Configured and optimized **SAP** solutions related to UK Payroll, ensuring compliance with current regulations and streamlining payroll processes for over **1,000** employees.\nConducted thorough troubleshooting and root-cause analysis on SAP Payroll issues, improving resolution time by **25%** and enhancing overall system reliability.\nCollaborated effectively with cross-functional teams, facilitating smooth communication between stakeholders and ensuring project goals were met within expected timelines.\nUtilized strong analytical skills to assess system performance and user challenges, identifying areas for improvement that led to more efficient payroll processing.\nDelivered comprehensive documentation for all configurations and troubleshooting procedures, equipping team members with the resources necessary for future projects.\nDemonstrated exceptional problem-solving abilities by implementing strategic solutions that reduced payroll discrepancies by **15%**.\nEngaged in regular team collaboration meetings to discuss system enhancements, process flows, and user feedback, fostered an environment of continuous improvement and knowledge sharing.\nEnsured effective communication of project status and technical issues to teams, resulting in improved project transparency and stakeholder satisfaction."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tSAP\n\tUK Payroll\n\tconfiguration\n\ttroubleshooting\n\troot-cause analysis\n\tteam collaboration\n\tanalytical skills\n\tproblem-solving\n\tcommunication",
  "apply_company": "Support Revolution"
}