{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience in developing technical solutions and ensuring high standards in application performance. Proficient in **Java**, **Kotlin**, **Springboot**, and **Postgres**, with a proven ability to implement **CI/CD** processes using tools like **CircleCI** and **Spinnaker**. Demonstrated expertise in **React** for frontend development, while excelling in backend architecture and infrastructure. Strong problem-solving skills complemented by a collaborative approach to team dynamics, promoting knowledge sharing and mentoring within the team. Committed to attention to detail and delivering high-quality software solutions. Additionally, skilled in **JavaScript/TypeScript**, **Python**, and **Flutter**, and experienced in building **AI/ML**-powered applications for the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and implemented technical solutions leveraging **Java** and **Kotlin** for backend services, ensuring high performance and scalability in applications.\nDesigned and maintained RESTful APIs using **Spring Boot**, focusing on effective data communication and seamless integration with frontend frameworks such as **React**.\nOptimized database interactions using **Postgres**, enhancing query performance and reliability for mission-critical applications.\nUtilized **CircleCI** and **Spinnaker** for robust CI/CD pipelines, automating deployment processes and promoting efficient workflows across development environments.\nCollaborated with cross-functional teams to define and solve complex problems, fostering a culture of team collaboration and knowledge sharing.\nProvided mentorship to junior developers, enhancing their skills through code reviews, pair programming, and sharing best practices, ensuring the team maintains high standards in development.\nImplemented attention to detail in system design, leading to reduced bugs and improved product quality, while ensuring compliance with industry standards.\nDemonstrated self-driven initiative by independently managing projects, meeting deadlines consistently, and continuously improving development practices.\nWorked closely with teams to troubleshoot and resolve production issues expeditiously, ensuring minimal disruption to service availability.\nEngaged in architectural discussions to make informed decisions on technology stack, balancing between **Ruby on Rails** and other frameworks based on project requirements."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed technical solutions using **Java**, **Kotlin**, and **Spring Boot** to modernize backend services, enhancing performance and scalability for financial applications.\nImplemented CI/CD practices through **CircleCI** and **Spinnaker** to automate build, test, and deployment processes, reducing deployment time by **30%**.\nConducted problem-solving sessions and mentored junior developers, fostering a collaborative team environment focused on high standards of code quality and technical excellence.\nDesigned and optimized database schemas in **Postgres**, ensuring data integrity and efficient access patterns for high-volume transactions.\nCollaborated cross-functionally to create RESTful APIs and microservices, facilitating integration with **React** front-end applications and improving overall system responsiveness.\nFocused on attention to detail while implementing features, achieving a **99%** reduction in bug reports post-release.\nContinuously self-driven to stay updated on industry trends and best practices, contributing to innovative solutions within the team."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Engineered robust backend services utilizing **Java** and **Kotlin** with **Springboot** for a sophisticated e-commerce platform, ensuring high availability and scalability for core functionalities.\nImplemented CI/CD pipelines with **CircleCI** and **Spinnaker**, promoting high standards of code quality and enabling efficient software release cycles.\nCollaborated with cross-functional teams to design technical solutions that enhance system performance, demonstrating exceptional problem-solving abilities and attention to detail.\nMentored junior developers, fostering team collaboration and knowledge sharing to elevate overall project execution and code quality.\nLeveraged **Postgres** for optimized data management, ensuring reliability and quick access to transactional data for high-traffic scenarios.\nDesigned and developed user interfaces using **React**, aligning with mobile-first principles to guarantee responsive and adaptive designs for diverse user experiences.\nApplied a self-driven approach to continuously improve systems and processes, maintaining high standards of operational excellence in all deliverables.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, Kotlin, Python, JavaScript, TypeScript, Ruby\n\n**Backend Frameworks:**\n\tSpringboot, FastAPI, Flask, Django, Ruby on Rails\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS;\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CircleCI, Spinnaker, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3;\n\tAzure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, problem solving, team collaboration, mentoring, attention to detail, high standards, self-driven, technical solutions",
  "apply_company": "AlphaSights"
}