{
  "name": "Marcin Karol Kotlinski",
  "role_name": "DevOps Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As a dedicated DevOps Engineer with 8 years of experience, I excel in implementing CI/CD pipelines and cloud solutions primarily using **AWS** and **GitHub Actions**. My technical expertise encompasses **CI/CD**, **Maven**, **Bitbucket Pipelines**, and **AWS CodeBuild**, ensuring streamlined deployments and operational efficiency. With a strong foundation in **Linux** environments and proficiency in programming languages such as **Python** and **Java**, I develop and optimize automated processes that enhance productivity and reduce downtime.\nI possess in-depth knowledge of compliance standards, including **SOC 2** and **ISO27001**, and I effectively apply these standards in the DevOps lifecycle. My analytical problem-solving skills enable me to troubleshoot complex system issues efficiently, while my strong communication and collaboration abilities facilitate seamless teamwork across cross-functional teams. My experience also includes a focus on enhancing performance through container orchestration and leveraging modern tools in cloud infrastructure.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "DevOps Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented enterprise-level **DevOps** pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI**, incorporating linting, testing, security scans, and multi-environment deployments for both web and API services.\nArchitected and developed scalable solutions employing **AWS**, enhancing cloud service efficiency, for both healthcare and financial platforms.\nLed the optimization of CI/CD processes utilizing **AWS CodeBuild** and **Bitbucket pipelines**, improving deployment frequency by **30%**.\nCollaborated with multi-disciplinary teams to improve communication and ensure seamless integration between **Java** and **Python** applications, while facilitating **Git** version control and continuous integration.\nDeveloped and maintained applications in **Python** (including **FastAPI**) and **Java**, focusing on enhancing operational efficiency and reliability within large-scale systems.\nUtilized **TCP/IP** and **HTTP** protocols for robust web services, ensuring high availability and responsiveness of applications across various environments.\nImplemented and maintained monitoring solutions across all environments, ensuring continual uptime and enhancing user experience with proactive response mechanisms.\nEmployed **analytical problem solving** and **collaboration** to troubleshoot and resolve issues, ensuring system integrity and performance while adhering to **ISO27001** and **SOC2** compliance.\nExecuted application and infrastructure management on **Linux** systems, optimizing server configurations for enhanced application performance.\nDrove strategic initiatives to enhance security and compliance processes, successfully achieving adherence to industry standards and practices."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **CI/CD** pipelines using **GitHub Actions** and **Bitbucket pipelines**, improving deployment efficiency by **40%** while ensuring seamless integration across development and production environments.\nLeveraged **AWS** services for cloud computing solutions, optimizing infrastructure costs by **30%** and enhancing application performance through strategic resource allocation and scalable design.\nDeveloped deployment automation scripts using **Python**, incorporating best practices like **Maven** for seamless builds, resulting in a sustainable and repeatable deployment process across environments.\nMonitored system health and performance through **Linux** system administration, ensuring uptime of **99.9%** and rapid incident response, enhancing overall user satisfaction.\nCollaborated with cross-functional teams to enhance communication and workflow efficiency, employing **analytical problem solving** skills to navigate complex technical challenges and achieve project goals.\nEnsured compliance with industry standards such as **ISO27001** and **Soc2**, achieving certification readiness for the organization by implementing necessary controls and documentation rigor.\nConducted training sessions on DevOps practices, fostering a collaborative culture that improved team performance and clarified roles in the development lifecycle.\nUtilized **Java** and **C#** in various system integrations, maintaining a strong focus on code quality and performance, which led to a reduction in system bugs by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Implemented CI/CD pipelines using **GitHub Actions** and **Bitbucket Pipelines** to automate build, test, and deployment processes, achieving 90% reduction in deployment time and increasing overall workflow efficiency.\nEngineered robust cloud infrastructures on **AWS** with services such as **AWS CodeBuild** and Linux-based frameworks, ensuring a scalable and secure environment for applications while maintaining ISO27001 and SOC2 compliance.\nLeveraged **Python** to develop automation scripts for infrastructure management, resulting in a 75% decrease in manual workload and minimizing human errors.\nFacilitated collaboration across teams by utilizing **Docker** containers, fostering an environment of seamless communication for software development and deployment processes.\nImplemented monitoring and logging solutions, ensuring system reliability and performance, leading to a 50% decrease in incident response times.\nOptimized system performance through **Linux** configurations, improving application speed by 30% and enhancing the user experience across multiple platforms.\nConducted analytical problem-solving sessions, translating complex technical issues into actionable solutions with an emphasis on scalability and efficiency.\nEnsured secure application operations by applying role-based access control (RBAC) and **OAuth 2.0**, maintaining the highest standards of user data protection and compliance with GDPR regulations.\nMentored team members on **DevOps** best practices and tools, fostering a culture of continuous improvement and knowledge sharing within the organization."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, C#, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tHTTP, OAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Bitbucket pipelines, AWS Codebuild, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tLinux, CI/CD, ISO27001, Soc2\n\n **Other:**\n\tanalytical problem solving, communication, collaboration, MLflow, Airflow, Kubeflow, Nginx, Certbot"
}