{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Machine Learning Engineer (GraphRAG & Retrieval Tools)",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Machine Learning Engineer with 13+ years of experience, specializing in **Machine Learning**, **Graph Data Science**, **Graph Neural Networks (GNNs)**, and **Retrieval-Augmented Generation (RAG) Pipelines**. Proficient in developing and deploying machine learning models using **Python**, **PyTorch**, **scikit-learn**, and leveraging advanced data structures like **Knowledge Graphs**. Skilled in implementing AI solutions that drive innovation in the healthcare and financial sectors, with a focus on **Data Preparation**, **Monitoring**, and **Deployment**.\n\nStrong expertise in software development, particularly in **FastAPI** for building robust APIs, and experience with **Docker** for containerization. Well-versed in collaboration techniques and effective communication to ensure alignment with project milestones. Proven ability to deliver high-performance applications, with hands-on knowledge of **Pandas** for data manipulation and analysis. Background includes developing applications that adhere to compliance standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Machine Learning Engineer (GraphRAG & Retrieval Tools)",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Leveraged **Python** and **PyTorch** to develop and implement Machine Learning models focused on Graph Data Science, including **Graph Neural Networks (GNNs)** and **Link Prediction**, enhancing overall data prediction capabilities.\nUtilized **FastAPI** to build efficient and scalable APIs, facilitating seamless data communication and integration within systems while adhering to industry standards.\nExecuted **Data Preparation** strategies that encompassed cleaning, transforming, and organizing large datasets, optimizing workflow and ensuring data integrity across various domains.\nDesigned and developed **Retrieval-Augmented Generation (RAG) Pipelines**, addressing dynamic query tasks with a focus on enhancing text-to-query models and improving retrieval accuracy and efficiency.\nImplemented advanced monitoring and iteration techniques for machine learning models, ensuring performance stability and accuracy in live environments through continuous evaluation and adaptation.\nCollaborated with cross-functional teams to communicate findings and methodologies effectively, ensuring alignment and fostering a productive environment that encourages innovation.\nDeveloped and maintained containerized applications using **Docker**, supporting streamlined deployments and enhancing the maintainability of machine learning services.\nEngaged in robust **Collaboration** with stakeholders to gather requirements and provide updates, ensuring transparency and mutual understanding throughout project lifecycles.\nExecuted state-of-the-art tools and libraries such as **Pandas** for data manipulation and analysis, crating efficient workflows tailored for machine learning tasks and data analysis.\nLed initiatives to expand knowledge within the team on emerging technologies and methodologies related to Graph Data Science and Machine Learning, thereby fostering development and growth within the engineering team."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- Developed and implemented machine learning models for graph data science applications, leveraging **Python**, **scikit-learn**, and **PyTorch** to enhance predictive analytics and data representation.\n- Designed and built **Retrieval-Augmented Generation (RAG)** pipelines, which improved the efficiency of text-to-query conversion and link prediction accuracy.\n- Utilized **Graph Neural Networks (GNNs)** to advance project goals in knowledge graphs, increasing the depth of insights gained from complex datasets by **50%**.\n- Conducted data preparation using **Pandas** to ensure high-quality training datasets, achieving a **90%** accuracy rate in predictive analysis for financial transactions.\n- Integrated APIs for seamless collaboration across services, enhancing product features through effective communication and agile development strategies.\n- Deployed machine learning applications using **Docker** to streamline the deployment process, reducing downtime during updates by **30%**.\n- Managed and monitored machine learning systems to guarantee optimal performance, iterating on existing models based on feedback and performance metrics.\n- Collaborated effectively with cross-functional teams, demonstrating advanced communication skills to drive project success in a fast-paced environment.\n- Led initiatives on the enhancement of data workflows, achieving significant improvements in processing times for both batch and real-time operations.\n- Mentored junior engineers in machine learning practices and technologies, contributing to the growth of the team’s capabilities and project outputs."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and implemented **Machine Learning** models focused on **Graph Data Science** and **Link Prediction** using **Python** and **Pandas**, enhancing data insights for e-commerce operations.\n• Engineered and optimized **Graph Neural Networks (GNNs)** to improve user experience by leveraging **Knowledge Graphs** for personalized recommendations across **8+ distinct product categories**.\n• Designed and integrated **Text-to-Query Models** and **LLMs** to process user queries in real-time, improving search relevance and reducing response times by **20%**.\n• Collaborated on the development of **Retrieval-Augmented Generation (RAG) Pipelines** to facilitate dynamic content generation based on customer interactions, improving conversion rates **by 15%**.\n• Managed the deployment of trained models using **Docker** and optimized API configurations, ensuring seamless integration within backend services.\n• Conducted data preparation and iterative modeling processes, focusing on effective collaboration and communication with cross-functional teams to achieve project milestones efficiently.\n• Established performance monitoring metrics using **scikit-learn** and other analytical tools to track model accuracy and performance post-deployment, ensuring continuous improvement.\n• Facilitated knowledge sharing sessions leveraging best practices in **Machine Learning**, fostering an environment of learning and innovation among team members."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPIs\n\n **Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tTerraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMachine Learning, MLflow, Airflow, Kubeflow, Pandas, PyTorch, scikit-learn, Graph Data Science, Knowledge Graphs, Graph Neural Networks (GNNs), Link Prediction, Cypher, Text-to-Query Models, LLMs, Retrieval-Augmented Generation (RAG) Pipelines, Data Preparation, Deployment, Monitoring, Iteration, Collaboration, Communication, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}