{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Solutions Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "Accomplished Solutions Engineer with 8 years of experience in leveraging **AWS**, **Azure**, and **GCP** to architect and implement high-performance solutions tailored for the healthcare and financial sectors. I possess strong technical communication skills, operational experience in **API workflows**, and a deep understanding of **SaaS** technologies. My hands-on expertise also includes seamless integration with third-party tools like **Okta**, **Google Workspace**, and **Entra ID** to enhance user authentication and data workflow.\n\nI excel in collaboration and problem-solving, contributing to high-impact teams by delivering robust applications that comply with industry standards such as HIPAA and PCI DSS. My technical acumen is supported by a solid foundation in **React**, **Node.js**, **FastAPI**, and **Django**, with experience in CI/CD automation using platforms like **GitHub**, **BitBucket**, and **GitLab**.\n\nWith a commitment to continuous learning, I have developed a passion for machine learning and MLOps, building pipelines and solutions that incorporate predictive analytics and intelligent automation, utilizing tools like MLflow and Airflow. I bring analytical thinking and effective presentation skills to engage stakeholders in driving technology adoption and innovation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Solutions Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **AWS**, **Azure**, and **GCP** to architect and develop scalable, full-stack healthcare and financial platforms ensuring compliance with HIPAA, FHIR, GDPR, and financial regulatory standards (e.g., PCI DSS, SOX).\nEngaged in collaborative problem-solving and technical communication while developing and deploying cross-platform mobile applications using **Flutter** and **React Native** to enhance user experiences on iOS and Android platforms.\nImplemented effective API workflows to ensure seamless integration between systems and services, including cloud services such as **Okta** for identity management.\nDeveloped robust CI/CD pipelines using **GitHub Actions**, **Azure DevOps**, and **BitBucket**, ensuring quality through automated testing, security scans, and multi-environment deployments for both web and API services.\nLed the transition from monolithic applications to microservices-based architectures leveraging **Docker** and **Kubernetes (EKS/AKS)**, which improved system availability by **99%**.\nDesigned and maintained cloud-native data architecture using **PostgreSQL**, **MongoDB**, and **Redis**, enabling efficient storage and querying of large-scale healthcare and financial data, processing up to **1 million transactions** daily.\nIntegrated enterprise-level analytical features using **Tableau** and **Power BI Embedded** to deliver insightful data visualization tools, tracking transaction trends and operational KPIs in real-time.\nCollaborated with teams to implement strategies for NLP models (using **spaCy** and **Hugging Face Transformers**) to facilitate advanced healthcare document parsing and financial anomaly detection.\nUsed **continuous learning** to stay abreast of emerging technologies, enhancing skills in the latest frameworks and tools including **Apache Airflow** for MLOps pipelines.\nExhibited strong presentation skills through effective communication of complex technical concepts to stakeholders and team members."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **AWS**, **GCP**, and **Azure** to deliver scalable solutions with a focus on cloud services, ensuring robust infrastructure for financial platforms.\nDemonstrated technical communication and collaboration skills by leading cross-functional teams in the modernization of financial platforms with a microservices-based architecture using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, enhancing system scalability and maintainability for high-volume transactions.\nImplemented API workflows to support seamless integration across various systems, ensuring real-time data availability and efficient operations.\nLeveraged **React (18)**, **Vue 3**, and **Next.js** to build user-focused applications, applying **Redux Toolkit** and **Tailwind CSS** to create responsive dashboards for financial analytics.\nDeveloped and deployed real-time transaction monitoring dashboards using **D3.js** and **Power BI Embedded**, facilitating effective analytical thinking for anomaly detection in financial activity with the capability to handle data from **9** different sources.\nIntegrated messaging frameworks like **Kafka** and **RabbitMQ** to enhance event-driven architecture, allowing efficient asynchronous processing of **10 million** transactions daily and improving compliance workflows.\nBuilt and orchestrated ETL pipelines with **Apache Airflow** and **Azure Data Factory**, achieving batch and real-time ingestion of financial data with automation that reduced processing time by **40%**.\nDesigned and implemented AI/ML-powered fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, analyzing historical transaction patterns to reduce false positives by **30%**.\nCreated ML pipelines for credit scoring and churn prediction, integrating model inference into backend services using **MLflow** for actionable insights, thereby facilitating continuous learning and problem-solving objectives."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **AWS**, **GCP**, and **Azure** cloud services to design and optimize backend solutions, ensuring seamless API workflows and high availability for a global e-commerce platform.\nLeveraged **GitHub**, **BitBucket**, and **GitLab** for version control, fostering collaboration among development teams and enhancing continuous learning through shared knowledge.\nDemonstrated strong problem-solving skills by engineering real-time features with **WebSockets**, utilizing **Kafka** and **RabbitMQ** for event-driven architecture, resulting in a 30% improvement in order processing speed.\nApplied technical communication skills to present complex data storage solutions using **MongoDB**, **PostgreSQL**, and **Redis**, improving fault tolerance and performance for high-traffic e-commerce workflows.\nIntegrated **Okta** for secure user authentication and implemented role-based access control (RBAC) and **OAuth 2.0** for GDPR compliance, enhancing data protection measures across the platform.\nCollaborated cross-functionally to develop frontend applications with **React (18)**, **Vue 3**, and **Angular**, achieving a 25% reduction in page load times with optimized user interfaces and improved accessibility (WCAG 2.1).\nImplemented feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes**, enabling effective risk mitigation strategies and achieving a 40% reduction in deployment times during updates.\nConducted presentations to share insights on integrating AI/ML-based recommendation engines with **scikit-learn**, **LightGBM**, and **TensorFlow**, enhancing product listings and conversion rates using real-time behavioral data.\nBuilt secure payment workflows using **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI compliance with a 100% success rate in transaction processing during peak traffic.\nEngaged in continuous learning to stay abreast of new technologies and best practices, continually enhancing team capabilities and project outcomes."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI workflows\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL), GCP\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, GCP, GitHub, BitBucket, GitLab\n\n **Other:**\n\tOkta, Google Workspace, Entra ID, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, SaaS, technical communication, problem-solving, collaboration, analytical thinking, presentation skills, continuous learning"
}