{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Security Analyst",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-kotlinski-08ba40390/",
  "profile_summary": "As a skilled Security Analyst with 8 years of experience, I specialize in leveraging **AWS** and modern programming languages like **JavaScript**, **TypeScript**, and **Python** to enhance security protocols and compliance across healthcare and financial sectors. My proficiency extends to implementing security measures aligned with standards such as ISO 27001, ISO 27002, SOC 2, and PCI DSS, ensuring that applications and infrastructure meet necessary compliance requirements.\nWith a solid background in **process documentation**, I am experienced in utilizing tools for Static Application Security Testing (**SAST**) and Software Composition Analysis (**SCA**) to identify vulnerabilities and ensure secure development practices. My expertise also includes building robust systems while maintaining a focus on security best practices.\nI excel at collaborating across teams to promote security awareness and streamline security protocols while leveraging my strong experience in cloud environments and full-stack development to contribute to comprehensive security initiatives.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Security Analyst",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Conducted thorough assessments of security compliance with standards such as **ISO 27001**, **ISO 27002**, and **PCI DSS**, ensuring alignment with **SAST** and **SCA** methodologies.\n- Utilized **JavaScript** and **TypeScript** to develop security tooling and scripts for vulnerability assessments and remediations in healthcare and financial applications.\n- Employed **Python** to automate security processes and tasks, streamlining the monitoring and documentation of security incidents.\n- Collaborated with cross-functional teams to establish robust process documentation to facilitate adherence to security policies and standards.\n- Leveraged **AWS** for secure cloud infrastructure management, implementing best practices to safeguard sensitive data in transit and at rest.\n- Conducted security audits to ensure compliance with regulatory agreements and internal security policies, maintaining documentation in line with **SOC** requirements.\n- Provided training and guidance on security best practices to development teams, emphasizing the importance of security throughout the software development lifecycle.\n- Implemented logging and monitoring solutions to detect and respond to security incidents in real-time, enhancing the overall security posture of applications.\n- Designed and led security awareness programs, improving organization-wide understanding of cybersecurity threats and safe practices.\n- Reviewed and assessed third-party security practices and protocols for partners and vendors, ensuring alignment with internal security standards."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Conducted thorough security assessments and process documentation to ensure compliance with standard frameworks like **ISO 27001**, **ISO 27002**, **SOC**, and **PCI**.\nUtilized scripting in **Bash** to automate security monitoring tasks and improve overall efficiency in security operations.\nCollaborated with development teams to integrate security measures into software development processes, employing **JavaScript** and **TypeScript** to enforce best practices in coding and vulnerabilities scanning.\nImplemented Static Application Security Testing (**SAST**) and Software Composition Analysis (**SCA**) tools to analyze code quality and identify security vulnerabilities, enhancing the overall security posture of applications by **90%**.\nRegularly conducted security training sessions to improve team awareness and compliance with security practices in financial platforms, resulting in **50%** fewer incidents.\nEngaged in risk assessments, identifying potential threats in systems and processes while aligning with industry regulations and standards, promoting a proactive security culture in the organization.\nUtilized cloud security best practices in **AWS** to safeguard financial data across platforms, resulting in a **30%** reduction in security threats.\nParticipated in incident response activities, employing analytical skills and security methodologies to quickly isolate and remediate security breaches, achieving recovery in less than **24 hours**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Analyzed and documented security processes in compliance with **ISO 27001** and **ISO 27002**, ensuring adherence to best practices and regulatory standards for a global e-commerce platform.\nUtilized **AWS** cloud services to enhance infrastructure security, implementing rigorous protocols to protect user data and ensure system integrity across all platforms.\nConducted software security analysis via **SAST** (Static Application Security Testing) and **SCA** (Software Composition Analysis), identifying vulnerabilities and recommending remediation strategies to development teams to maintain application security.\nLed training sessions in **Bash** scripting for automating security-related tasks and improving overall operational efficiency.\nPerformed regular audits and assessments of the security framework, implementing necessary changes to achieve compliance with **SOC** and **PCI** requirements, maintaining a secure environment for sensitive data handling.\nCollaborated closely with development teams to document and refine security processes, ensuring all technical changes adhered to defined security standards and practices.\nCommunicated effectively in **English** with cross-functional teams, stakeholders, and external auditors to provide insights and updates on security posture.\nDeveloped and maintained comprehensive process documentation to support security initiatives and maintain continuity across roles and responsibilities in the organization."
    }
  ],
  "skills": "Programming Languages:\n\t**Python**, **JavaScript**, **TypeScript**, **Bash**\n\n**Backend Frameworks:**\n\t**FastAPI**, **Flask**, **Django**\n\n**Frontend Frameworks:**\n\t**React**, **Vue**, **Angular**\n\n**API Technologies:**\n\t**JWT**, **OAuth2**\n\n**Serverless and Cloud Functions:**\n\t**AWS (ECS, Lambda, RDS, S3)**\n\n**Databases:**\n\t**PostgreSQL (Fintech)**, **MySQL (Healthcare)**, **MongoDB (Gaming)**, **Redis**\n\n**DevOps:**\n\t**Docker**, **Kubernetes**, **GitHub Actions**, **GitLab CI/CD**, **Terraform**, **Ansible**, **Helm**, **Docker Compose**\n\n**Cloud & Infrastructure:**\n\t**Azure (App Services, Blob, SQL)**\n\n**Other:**\n\t**SAST**, **SCA**, **ISO 27001**, **ISO 27002**, **ISO**, **SOC**, **PCI**, **process documentation**, **English**, **Keycloak (OIDC, RBAC)**, **Let’s Encrypt**, **Nginx**, **Certbot**, **MLflow**, **Airflow**, **Kubeflow**"
}