{
  "name": "Rei Taro",
  "role_name": "Senior PHP Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Detail-oriented Senior PHP Engineer with over 10 years of experience in developing robust web infrastructures and implementing secure coding practices. Proficient in **PHP**, **RESTful APIs**, and **web security**, with a strong foundation in **OOP**, **SOLID principles**, and **design patterns**. Skilled in **Docker** for containerization and adept at mentoring junior developers and facilitating team communication. Proven ability to leverage problem-solving techniques in building scalable applications. Strong background in integrating **C#** and **.NET Core**, as well as utilizing data processing tools like **Knime**. Previously contributed to significant projects at prestigious organizations, ensuring optimal performance across diverse technology stacks, including cloud services.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior PHP Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Developed and maintained robust backend services using **PHP** and **RESTful APIs** to support document automation and user onboarding workflows.\nEngineered scalable web infrastructure ensuring adherence to **OOP**, **SOLID**, and **Clean Code** principles.\nImplemented event-driven solutions utilizing **Docker** for containerized applications, optimizing asynchronous processing for large volumes of financial transactions.\nManaged deployment pipelines on Azure App Services, employing **HTTP** protocols for seamless integration with third-party services.\nLed initiatives to enhance web security, implementing secure coding practices and conducting thorough assessments of system vulnerabilities.\nCollaborated effectively with cross-functional teams to resolve integration issues, ensuring compliance with regulatory standards.\nMentored junior developers, fostering skills in design patterns, problem-solving, and communication within the team."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "Developed and maintained backend systems using **PHP** and **RESTful APIs**, ensuring adherence to **OOP** principles and **SOLID** design patterns to create clean, efficient code.\nImplemented web infrastructure best practices to enhance system performance, including integration of **Docker** for containerization and consistent deployment across environments.\nEngineered robust solutions for secure coding practices, mitigating vulnerabilities related to **web security** and maintaining compliance with industry standards.\nMentored junior developers, fostering problem-solving capabilities and enhancing team communication skills to drive project success.\nCollaborated with cross-functional teams to facilitate effective integration of **HTTP** services and manage release cycles efficiently, demonstrating strong project management skills.\nDesigned and executed complex workflows leveraging **Knime** to automate data processing and ensure high-quality outcomes.\nUtilized strong networking and communication skills to troubleshoot issues and implement solutions effectively, driving continual improvement in processes."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Utilized **PHP** along with **RESTful APIs** to develop and maintain robust backend services for trade execution, portfolio management, and account tracking, significantly enhancing efficiency in trading operations.\nEmphasized **web security** and **secure coding** practices throughout development, ensuring the longevity and integrity of the services.\nImplemented **OOP**, **SOLID**, and **design patterns** to create scalable and maintainable systems, contributing to the overall architecture of the platform.\nLed the development of **HTTP** communications, optimizing data transfers and ensuring compliance with protocol standards for seamless service integration.\nCollaborated with cross-functional teams to deliver data through REST APIs, enhancing user experience by reducing latency by **35%** through improved backend infrastructure.\nMentored junior developers in adhering to **Clean Code** principles, fostering a culture of quality and efficiency across teams by conducting at least **2** training sessions per month.\nContributed to problem-solving sessions and agile stand-ups, improving project workflow and communication, achieving a **20%** increase in team productivity.\nImplemented CI/CD practices using **Docker**, enhancing deployment efficiency by **50%** and reducing downtime during updates."
    }
  ],
  "skills": " **Programming Languages** \n\tC#, PHP, Python (3.8+), JavaScript, SQL, Bash\n\n **Backend Frameworks** \n\tFastAPI, Flask, Django, Celery, .NET Core\n\n **Frontend Frameworks** \n\t\n\n **API Technologies** \n\tRESTful APIs, REST/gRPC APIs, HTTP, Microservices\n\n **Serverless and Cloud Functions** \n\tAWS (EC2, S3, Lambda), Azure, Docker, Kubernetes\n\n **Databases** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps** \n\tCI/CD, GitHub Actions, Azure DevOps, Docker\n\n **Cloud & Infrastructure** \n\tweb infrastructure\n\n **Other** \n\tAI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, OOP, SOLID, Clean Code, design patterns, secure coding, mentoring, problem-solving, communication, web security, Kafka, PyTest, Git",
  "apply_company": "LastPass"
}