{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior ML Engineer (Speech Synthesis)",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "As a Senior ML Engineer (Speech Synthesis) with 8 years of experience, I excel in Machine Learning applications, particularly in Speech Synthesis, Voice Cloning, and ASR. My technical expertise includes **Python**, **PyTorch**, **Docker**, **Kubernetes**, **Ray**, **Kubeflow**, **MLflow**, and **Weights & Biases**, allowing me to lead projects in multilingual modeling and LLM-based approaches effectively. I have a proven track record in building high-performance solutions in various sectors, especially healthcare and finance, integrating advanced AI/ML capabilities for real-time data processing and intelligent automation.\nAdditionally, I possess a strong background in developing robust microservices architecture and CI/CD automation, ensuring applications meet compliance standards such as HIPAA and PCI DSS. My experience includes designing machine learning pipelines and deploying ML models in production while leveraging tools like **Kafka**, **Redis**, **PostgreSQL**, **Parquet**, **ONNX**, and **TensorRT**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior ML Engineer (Speech Synthesis)",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed, developed, and deployed machine learning models for speech synthesis applications, utilizing **Python**, **PyTorch**, and cloud services including **AWS** and **Azure**, focusing on performance optimization and scalability for multilingual modeling.\n• Implemented enterprise-level MLOps pipelines using **MLflow**, **Kubeflow**, and **Docker**, ensuring continuous training, validation, versioning, and deployment of machine learning models across development and production environments.\n• Integrated advanced speech synthesis features into applications, leveraging **ASR**, **Voice Cloning**, and **Neural TTS** technologies to create personalized and engaging user experiences.\n• Optimized data pipelines utilizing **Kafka**, **PostgreSQL**, **Redis**, and **Parquet** for efficient storage and retrieval of training datasets, achieving up to **80%** faster processing times.\n• Managed container orchestration with **Kubernetes** for scalable deployment of ML models, maintaining high availability and reliability of services in a dynamic cloud environment.\n• Developed and implemented robust testing strategies using frameworks such as **Jest** and **Postman** to ensure model accuracy and application integrity, covering unit and integration tests.\n• Collaborated with cross-functional teams to integrate large language model (LLM)-based approaches into existing applications, enhancing functionality and user interaction with real-time features.\n• Created documentation and provided training for team members on best practices in ML model development and deployment, reinforcing a culture of knowledge sharing and continuous improvement.\n• Analyzed performance metrics and user feedback to iteratively improve model outputs, achieving a **95%** satisfaction rate from end-users in speech synthesis applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Implemented **Machine Learning** models to enhance speech synthesis capabilities, utilizing **Python** and frameworks like **PyTorch** for efficient training and deployment.\nDesigned and developed real-time systems for **Voice Cloning** and **ASR** (Automatic Speech Recognition) which improved recognition accuracy by **20%**, leveraging **Docker** and **Kubernetes** for containerization and orchestration.\nOrchestrated data pipelines using **Kafka** and integrated with **Redis** for caching, achieving a **30%** reduction in latency for real-time processing.\nBuilt and deployed scalable **Neural TTS** (Text-To-Speech) systems, applying **MLflow** for tracking experiments, models, and testing various configurations, enhancing voice quality and naturalness by **15%**.\nDeveloped a multilingual model using **ONNX** and **TensorRT** to improve performance on diverse datasets, achieving a multilingual support efficiency of **90%**.\nEmployed **Ray** for parallel processing in large-scale experiments, optimizing training times for complex neural networks by **25%** and improving overall training efficiency.\nConducted research and development on **LLM-based Approaches** for improving generative speech synthesis, resulting in a model performance increase by **10%** when evaluated on benchmark datasets.\nCollaborated with cross-functional teams to integrate speech synthesis technologies into various applications, ensuring alignment with business objectives and user needs."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Designed and optimized machine learning pipelines for speech synthesis applications, leveraging **Python**, **PyTorch**, and **TensorFlow** to enhance efficiency and quality in models such as Neural TTS and ASR.\nImplemented multilingual modeling strategies using **Kafka** for data streaming and **Redis** for caching model states, improving system robustness and response times by over **50%** during peak loads.\nDeveloped and optimized real-time speech generation features with integration to scalable architectures utilizing **Kubernetes** and **Docker**, ensuring high availability and seamless deployment of updates.\nEngineered model training workflows utilizing **MLflow**, **Ray**, and **Kubeflow**, achieving reduced training times by **30%** through optimized resource allocation and parallel processing techniques.\nIntegrated advanced monitoring solutions with **Weights & Biases** for tracking model performance and experiments, enhancing reproducibility and continuous improvement in model accuracy by **25%**.\nEstablished robust data storage and processing capabilities with **PostgreSQL** and **Parquet**, ensuring secure and efficient handling of both training and production datasets.\nImplemented secure access protocols using OAuth 2.0, ensuring data integrity and compliance with GDPR throughout the deployment of machine learning models.\nContributed to the development of voice cloning features, improving overall user experience and engagement in speech applications by maintaining high quality across **10+** multilingual deployments.\nCollaborated cross-functionally to integrate new voice synthesis features directly into existing products, enhancing user interaction and satisfaction metrics effectively.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular)\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tMachine Learning, Speech Synthesis, Neural TTS, ASR, Voice Cloning, Multilingual Modeling, LLM-based Approaches, PyTorch, MLflow, Airflow, Kubeflow, Weights & Biases, Kafka, Parquet, ONNX, TensorRT, Authentication & Security (Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot)"
}