{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Cybersecurity Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Cybersecurity Engineer with 8 years of diverse experience, I excel in **Cybersecurity**, **Network Security**, **Cloud Security**, and **Vulnerability Assessment**. My solid understanding of security frameworks enables me to implement robust security protocols, including **Encryption**, **Penetration Testing**, and risk management strategies to protect high-performance applications, particularly in sectors like healthcare and finance.\nI have a proven track record in developing enterprise-grade solutions while ensuring compliance with critical standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, I possess hands-on experience with **SIEM**, **SOAR**, and **EDR** technologies, leveraging tools like **Honeypots** for enhanced threat detection.\nMy strong analytical thinking skills are supported by my proficiency in **Technical Documentation** and **Incident Response** strategies. I have also mentored junior team members, fostering a collaborative environment and sharing best practices in cybersecurity. Furthermore, my background includes a full-stack development foundation using technologies like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**, which allows me to bridge the gap between cybersecurity measures and application development.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Cybersecurity Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and implemented **security frameworks** ensuring robust **network security** and **cloud security** across healthcare and financial platforms to mitigate risks and enhance compliance with HIPAA and PCI DSS.\n- Conducted thorough **vulnerability assessments** on full-stack applications to identify potential threats and recommend remediation steps, enhancing system resilience and protecting sensitive data.\n- Led **penetration testing** initiatives aimed at uncovering security weaknesses within applications and networks, achieving a **30% reduction** in identified vulnerabilities within **6 months**.\n- Employed **SIEM** tools for real-time monitoring and threat detection, facilitating **incident response** strategies that minimized potential damages from cybersecurity incidents by up to **40%**.\n- Authored **technical documentation** outlining cybersecurity policies, protocols, and procedures, ensuring team understanding and adherence to best practices and compliance requirements.\n- Collaborated with cross-functional teams to establish a **risk management** framework, assessing security risks and implementing strategies to mitigate identified vulnerabilities.\n- Designed and implemented advanced **encryption** protocols for safeguarding sensitive financial and healthcare data at rest and in transit, improving data security integrity.\n- Mentored junior engineers on **cybersecurity** best practices and security technologies, fostering a culture of continuous learning and improvement within the team.\n- Integrated **EDR** technologies for enhanced endpoint protection, significantly decreasing the response time to potential breaches.\n- Utilized **Honeypots** to effectively simulate potential attacks, gathering valuable intelligence on cyber threats and improving defensive strategies.\n- Spearheaded initiatives to implement **SOAR** technologies, streamlining incident response workflows and reducing manual effort by **25%**, freeing resources for proactive security measures.\n- Provided analytical insights into security operations, employing analytical thinking to identify trends and patterns that support continuous improvement of security posture."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "• Conducted **vulnerability assessments** to identify security weaknesses in the **financial platforms** that implemented a microservices-based architecture using **Node.js** and **Python**, achieving a **30% reduction** in security incidents.\n• Developed and maintained **cloud security** protocols within the architecture, ensuring compliance with industry standards and reducing potential threats by **40%**.\n• Implemented robust **encryption** techniques for sensitive financial data during transmission and storage, ensuring data integrity and confidentiality.\n• Led **incident response** activities during security breaches, managing to mitigate risks and recover compromised systems within **24 hours** of detection.\n• Designed security frameworks that align with business objectives, enhancing the security posture of development teams and contributing to **risk management** strategies.\n• Integrated **SIEM** tools to monitor security logs and alerts, improving detection rates of malicious activities by **50%** through proactive threat hunting.\n• Mentored junior engineers in **penetration testing** methodologies and best practices, fostering a culture of security awareness and expertise within the tech team.\n• Produced comprehensive **technical documentation** to articulate security policies, procedures, and incident response plans, enhancing team knowledge and compliance with regulations.\n• Applied **analytical thinking** to evaluate complex security challenges and develop effective countermeasures against potential threats like malware and ransomware."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Conducted comprehensive **Vulnerability Assessment** and penetration testing to identify and mitigate security risks in web applications and services, using industry-standard tools and methodologies.\nDeveloped and maintained **Cybersecurity** frameworks, ensuring compliance with best practices and regulatory requirements across all infrastructure and services.\nImplemented **Encryption** protocols and robust network security measures to protect sensitive data in transit and at rest, enhancing overall **Cloud Security** posture.\nManaged and configured **SIEM** tools for real-time threat detection and incident response, improving security monitoring capabilities by **30%**.\nDesigned and executed security incident response plans, leveraging **EDR** solutions to minimize impact and recover swiftly from security breaches.\nConducted regular security audits and assessments to evaluate the effectiveness of security controls, resulting in a **25%** reduction of vulnerabilities identified over the year.\nDeveloped and updated technical documentation for security policies and procedures, ensuring clarity and compliance across teams, and facilitating **mentoring** of junior staff members.\nFacilitated risk management strategies, leading **quarterly** reviews of security posture and recommendations based on threat landscape.\nUtilized **SOAR** platforms to streamline incident resolution processes, enhancing operational efficiency by **40%**.\nDesigned and implemented honeypots as part of the security strategy to detect malicious activity and gather intelligence on emerging threats."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS (RDS, S3), Azure (Blob, SQL)\n\n**Other:**\n\tCybersecurity, Network Security, Cloud Security, Vulnerability Assessment, Security Frameworks, Encryption, Penetration Testing, SIEM, SOAR, EDR, UTM, Honeypots, Risk Management, Incident Response, Technical Documentation, Analytical Thinking, Mentoring, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Arctic Wolf"
}