{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior FullStack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Full Stack Engineer with 13+ years of experience in delivering high-performance applications, specializing in **JavaScript**, **TypeScript**, and **React** along with **Next.js** and **Vercel** for building responsive designs. Demonstrates expertise in **Serverless Architecture** and **Tailwind CSS**, ensuring optimal UI/UX through Figma and responsive design practices.\nAdept at leveraging AI technologies, including **LLM**, **OpenAI**, and **Context Engineering**, to develop innovative solutions in automation systems and image/audio/video generation. Skilled in creating robust **data pipelines** and managing **job queues** for efficient **async operations**.\nProficient in backend development using **PostgreSQL** and **Supabase**, and experience in implementing APIs for seamless integration. Additionally, knowledgeable about **AI cost optimization** strategies and familiar with **vector databases** and **embeddings**.\nPossesses a strong foundation in compliance, ensuring solutions meet industry standards such as HIPAA and PCI DSS. Excels in employing modern deployment practices, including CI/CD pipelines on cloud platforms like AWS and Azure.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed dynamic front-end applications using **JavaScript**, **TypeScript**, and **React 17–18**, while ensuring optimal UI/UX through **Tailwind CSS** and prototypes designed with **Figma**.\n• Engineered serverless architectures leveraging **AWS Lambda** and **Azure Functions**, improving deployment efficiency by **30%**.\n• Designed responsive web applications with **Next.js** integrated with **Vercel**, enabling deployment at **scale** for high traffic applications.\n• Created robust APIs and data pipelines utilizing **PostgreSQL** and **Supabase**, facilitating efficient **Async Operations** and job queues for seamless data handling.\n• Implemented AI-driven features including context engineering and embeddings through advanced integration with **OpenAI** and **Anthropic**, enhancing user engagement and personalization.\n• Spearheaded the automation of data pipelines and systems that resulted in a **40%** reduction in manual processes and improved data accuracy.\n• Collaborated on large-scale projects incorporating AI elements such as **Image Generation** and **Video Generation**, revolutionizing user interactions.\n• Championed the integration of advanced security measures and accessibility within applications, ensuring compliance with industry standards and enhancing overall user experience.\n• Developed comprehensive documentation and REST APIs for team collaboration and longevity of projects, establishing clear communication among potential stakeholders.\n• Optimized system performance through diligent monitoring using performance metrics, achieving a **25%** increase in application efficiency."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **JavaScript** and **TypeScript** to modernize core financial platforms, migrating to microservices architecture with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability for high-volume transactional systems.\n\nBuilt interactive front-end applications with **React** (18), **Vue 3**, and **Next.js**, utilizing **Tailwind CSS** for responsive design and integrating **Redux Toolkit** for state management, achieving user satisfaction scores of over **95%** in UX testing.\n\nDelivered real-time analytics dashboards leveraging **React**, **D3.js**, and **Power BI Embedded**, which improved operations teams' insight into transactions and anomalies by providing data overlays with refresh times of under **10 seconds**.\n\nDesigned and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication for critical workflows including payments and alerts, reducing latency by **30%**.\n\nDeveloped ETL pipelines for ingesting financial data sourced internally and from third parties using **Python**, **Apache Airflow**, and **Azure Data Factory**, achieving batch and real-time processing efficiencies that cut processing times by **25%**.\n\nConstructed machine learning models for fraud detection utilizing **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive identification of suspicious activities in transactions and user behavior, with accuracy improvements yielding a **15%** reduction in false positives.\n\nCreated machine learning pipelines designed for real-time credit scoring and churn prediction by leveraging **MLflow** and **Airflow**, seamlessly integrating model inference into backend services, contributing to an increase in predictive accuracy by **20%**.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **React (18)** to design and implement interactive frontend applications for a responsive e-commerce platform, enhancing user experiences with fast load times and mobile-first design.\nDeveloped server-side applications leveraging **Next.js** and **Vercel** to facilitate dynamic content handling and deployment, improving scalability and performance by **30%**.\nArchitected and optimized data management systems using **PostgreSQL** and **Supabase**, ensuring reliable data integrity and seamless async operations, achieving a **40%** reduction in query response time.\nCreated robust and intuitive UI/UX designs with **Figma** and **Tailwind CSS**, focusing on responsive design principles for enhanced accessibility and mobile engagement, compliant with WCAG 2.1 standards.\nImplemented automation systems and job queues to streamline backend processes, contributing to a more efficient development lifecycle and increasing deployment frequency by **50%**.\nDesigned and integrated serverless architecture using **APIs** and **automation frameworks**, aiming for lower operational costs and faster iteration on product features.\nExplored and integrated AI technologies, including context engineering with **OpenAI**, to enhance user interaction and personalize experiences, which led to a **20%** boost in user retention.\nCollaborated with cross-functional teams to develop and optimize data pipelines for real-time analytics, improving decision-making processes and operational efficiencies.\nExecuted version control and code management practices with **Git**, ensuring collaboration efficiency and code quality across the development team.\nInvestigated and leveraged automated video and audio generation technologies for enhanced user-generated content capabilities, aligning with emerging trends in media engagement."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, TypeScript\n\n **Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, Tailwind CSS, Figma\n\n **Backend Frameworks:**\n\tPython: FastAPI, Flask, Django\n\n **API Technologies:**\n\tAPIs\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services, Serverless Architecture\n\n **Databases:**\n\tPostgreSQL, MongoDB, MySQL, Redis, Supabase\n\n **DevOps:**\n\tDocker, Kubernetes, Git, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tAI, MLflow, OpenAI, Anthropic, Google, Image Generation, Context Engineering, Agentic AI, Data Pipelines, Automation Systems, Async Operations, Job Queues, AI Cost Optimization, Responsive Design, UI/UX, Video Generation, Audio Generation, Vector Databases, Embeddings",
  "apply_company": "Crypto Banter"
}