{
  "name": "Tomasz Lee",
  "role_name": "Staff Mobile Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Staff Mobile Engineer with 9+ years of experience in mobile application development and deep proficiency in **Kotlin Multiplatform Mobile (KMP)**, **CI/CD**, **Gradle**, **Fastlane**, **GitHub Actions**, and **Bitrise**. Expertise in mobile performance profiling using tools like **Android Studio Profiler**, **Instruments**, and **LeakCanary**. Strong background in API design, caching strategies, and data synchronization, ensuring high-performance applications. Proficient in developing build and release pipelines and implementing automated testing for robust code quality. Demonstrated leadership in mentoring teams and fostering a collaborative environment through pair programming and effective communication. A proven track record of driving projects to successful completion by enhancing team productivity and optimizing development processes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Staff Mobile Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Kotlin Multiplatform Mobile (KMP)** to design and develop cross-platform mobile applications, streamlining development and enhancing code reuse across platforms.\nImplemented **CI/CD** pipelines using **GitHub Actions** and **Bitrise**, reducing application deployment time by **40%**.\nExecuted mobile performance profiling using **Android Studio Profiler** and **Instruments**, achieving a **30%** increase in application responsiveness.\nDesigned caching strategies to optimize data retrieval, decreasing load times by **25%** and ensuring efficient use of network resources.\nDeveloped and maintained build and release pipelines to ensure consistent and reliable application deployment processes.\nFacilitated automated testing strategies, increasing code coverage by **50%**, which enhanced the reliability of delivered features.\nIntroduced observability practices to monitor application performance, identifying and resolving bottlenecks resulting in a **20%** improvement in overall app performance.\nMentored junior developers on **architecture**, effective **API design**, and **data synchronization**, fostering a collaborative team environment.\nEmployed **Fastlane** for automating builds and deployments, reducing manual efforts and enhancing team productivity.\nPromoted a pair-programming culture to elevate code quality and encourage continuous learning among team members."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Designed and implemented robust **CI/CD** pipelines using **GitHub Actions** and **Bitrise**, reducing production deployment errors by **30%** and ensuring smooth builds and releases for mobile applications.\nDeveloped architecture to support **Kotlin Multiplatform Mobile (KMP)** frameworks, facilitating seamless data synchronization and user experience across Android and iOS platforms.\nLed mobile performance profiling initiatives using **Android Studio Profiler** and **Instruments**, resulting in a **25%** increase in application responsiveness.\nIntegrated caching strategies within the mobile applications using tools like **LeakCanary**, enhancing data retrieval times and improving overall system performance.\nConducted code reviews and mentoring sessions, fostering a collaborative approach among junior developers and improving team productivity by **15%**.\nDesigned APIs with a focus on efficiency and error handling, ensuring optimal data flow and communication between mobile clients and backend services.\nUtilized **Gradle** for managing project dependencies and streamlined build processes, increasing development speed.\nEmphasized observability by implementing comprehensive automated testing frameworks, ensuring higher reliability of the mobile application.\nCollaborated effectively with cross-functional teams to gather system requirements and define project timelines, leading to timely delivery of features and enhancements.\nPromoted pair-programming practices to enhance code quality and strengthen team collaboration across development efforts."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Kotlin Multiplatform Mobile (KMP)** to develop cross-platform mobile applications, enhancing user experience and team productivity by **25%**.\nImplemented **CI/CD** pipelines to automate the build and release process using **GitHub Actions** and **Bitrise**, resulting in deployment speed improvements of **30%**.\nEmployed **Gradle** for efficient project management, fostering streamlined workflows across multiple teams.\nOptimized mobile performance through thorough profiling with **Android Studio Profiler** and **Instruments**, leading to a **15%** reduction in load times.\nDeveloped and maintained robust API design strategies to ensure smooth data synchronization and integration across platforms, facilitating seamless communication.\nMentored junior developers in best practices such as **automated testing** and **caching strategies**, promoting a culture of knowledge sharing and collaborative coding.\nDesigned and implemented solutions tailored for **white-label mobile platforms**, resulting in a **40%** increase in client adoption rates.\nEngaged in pair-programming sessions to strengthen team collaboration and ensure adherence to high coding standards.\nContributed to team documentation and knowledge transfer to enhance onboarding processes, improving new hire ramp-up time by **20%**.\nFostered a culture of observability and proactive communication to improve project alignment and deliverables."
    }
  ],
  "skills": "**Frontend Frameworks**\n\tHTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n**API Technologies**\n\tRESTful API, GraphQL, API design, caching strategies\n\n**Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**Cloud & Infrastructure**\n\tAWS, Azure, CI/CD, build and release pipeline\n\n**DevOps**\n\tCI/CD pipelines, GitHub Actions, Bitrise, Gradle, Fastlane\n\n**Other**\n\tUX/UI Design, Git, GitHub, Python, Redux, blockchain: Solidity, Ether.js, Web3.js, Ethereum, messaging & caching: Apache Kafka, RabbitMQ, Redis, automated testing, mobile performance profiling, Android Studio Profiler, Instruments, LeakCanary, architecture, observability, data synchronization, mentoring, communication skills, collaborative approach, pair-programming, team productivity"
}