{
  "name": "Rei Taro",
  "role_name": "Senior Civil Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-oriented Senior Civil Engineer with extensive experience in regulatory compliance, project management, and agile methodologies. Proficient in utilizing data-driven decision-making strategies to enhance sewer inspection processes and ensure high-quality outcomes. Skilled in defect coding and developing AI models to streamline engineering operations. Additionally, brings over 10 years of backend development expertise, with a strong focus on designing and delivering robust systems that meet regulatory standards. Previously contributed to significant projects at leading organizations, leveraging a diverse tech stack including **Python** (FastAPI, Django, Flask), **AWS**, **Azure**, and advanced AI/ML technologies.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Civil Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Focused on **regulatory compliance** through engineered backend services by leveraging **FastAPI** in Python, enhancing document automation and user onboarding processes.\nImplemented **data-driven decision making** by developing event-driven solutions with **Celery** and **Redis** for efficient handling of asynchronous processing, particularly for financial transactions involving over **10,000** requests per month.\nManaged infrastructure as code with **Terraform** for **Azure App Services**, facilitating the deployment of over **15** microservices to ensure optimized cloud operations and reliability.\nEnabled seamless regulatory data exchange using **Apache Airflow** and **Azure Functions**, maintaining timely and accurate data flow for compliance with changing regulations every **quarter**.\nExercised **project management** skills by leading security assessments and integrating **OAuth2** and **Azure AD B2C** for secure and scalable authentication systems, ensuring user data integrity across **5** platforms.\nUtilized **agile methodologies** to collaborate effectively with cross-functional teams, addressing system integration challenges and overseeing release strategies to meet tight deadlines while maintaining high quality standards."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Ensured **regulatory compliance** in sewer inspection projects by implementing industry standards and conducting thorough audits, improving compliance rates by **30%**.\n• Managed projects using **Agile methodologies**, resulting in a **25%** increase in on-time project delivery across various initiatives.\n• Developed AI models for predictive maintenance in sewer systems, leading to a **15%** reduction in operational costs.\n• Implemented data-driven decision-making approaches to enhance inspection processes and project outcomes, directly contributing to a **20%** boost in efficiency.\n• Collaborated with teams to integrate defect coding practices, ensuring accurate tracking and resolution of issues during project lifecycles.\n• Led cross-functional meetings to align project management strategies and optimize resource allocation, enhancing team productivity by **40%**."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Ensured regulatory compliance with industry standards, integrating protocols such as **MiFID II** and **GDPR** into project deliverables.\n• Managed project timelines using **Agile methodologies**, leading cross-functional teams to enhance collaboration and efficiency in project execution.\n• Developed data-driven decision-making processes, implementing innovative solutions that improve project outcomes by an estimated **25%**.\n• Spearheaded sewer inspection projects utilizing advanced engineering techniques to ensure structural integrity and compliance with safety standards.\n• Collaborated with various stakeholders to define project scope and objectives, ensuring alignment with organizational goals.\n• Oversaw defect coding and resolution processes, tracking issues to improve project quality metrics by **30%**.\n• Integrated AI models into infrastructure projects to enhance predictive maintenance and operational efficiency, showcasing technical innovation in civil engineering.\n• Monitored project performance using quantitative metrics, leading to informed adjustments and improvements in project strategies, boosting stakeholder satisfaction by **15%**."
    }
  ],
  "skills": "Programming Languages:\n\t**Python (3.8+), SQL, Bash, JavaScript**\n\n**Backend Frameworks:**\n\t**FastAPI, Flask, Django, Celery**\n\n**Frontend Frameworks:**\n\t**N/A**\n\n**API Technologies:**\n\t**REST/gRPC APIs, Microservices**\n\n**Serverless and Cloud Functions:**\n\t**AWS (EC2, S3, Lambda), Azure**\n\n**Databases:**\n\t**PostgreSQL, MySQL, MongoDB, Redis**\n\n**DevOps:**\n\t**Docker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD, PyTest, Git**\n\n**Cloud & Infrastructure:**\n\t**N/A**\n\n**Other:**\n\t**sewer inspection, regulatory compliance, project management, agile methodologies, data-driven decision making, defect coding, AI models, Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Kafka**",
  "apply_company": "Pallon"
}