{
  "name": "Tomasz Lee",
  "role_name": "Senior Data Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-oriented Senior Data Engineer with 9+ years of experience in data warehousing, data governance, and schema design. Proficient in **SQL**, **Databricks**, **Google BigQuery**, **Airflow**, **dbt**, **Docker**, **Kubernetes**, and **CI/CD** practices. Strong background in data modeling and metadata management, ensuring seamless data integration and management. Previously excelled as a .NET Full Stack Developer, demonstrating expertise in designing and implementing complex applications using **ReactJS**, **NextJS**, **.NET**, and **C#**. Proven track record of optimizing performance and collaborating effectively across teams to lead projects to successful outcomes.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Data Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "• Designed and implemented data warehousing solutions using **Google BigQuery** and **Databricks**, enhancing data retrieval efficiency by **30%**.\n• Developed ETL pipelines with **Airflow** and **dbt**, streamlining data processing and reducing data latency by **25%**.\n• Established CI/CD practices with **Docker** and **Kubernetes**, accelerating deployment times by **40%**.\n• Collaborated in schema design and metadata management for data governance, ensuring compliance and accuracy across datasets.\n• Conducted data modeling for enhanced data analysis and reporting, utilizing SQL queries for insights generation.\n• Led the optimization of database performance with focused SQL query tuning, improving execution speed by **20%**.\n• Implemented robust data governance frameworks to oversee data quality and compliance across various projects.\n• Engaged with cross-functional teams to develop and uphold best practices in data architecture and pipeline efficiency, contributing to a more resilient data ecosystem.\n• Streamlined the integration of new data sources while maintaining the integrity of the existing data structure."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **SQL** to optimize data storage and retrieval from **MSSQL** and **MySQL** databases, achieving a x% improvement in query performance.\nDesigned and implemented robust **data warehousing** solutions with **Google BigQuery** and **Databricks**, ensuring high availability and reliability in data access.\nDeveloped effective **data governance** and **metadata management** practices, streamlining workflow and enhancing compliance.\nLeveraged **Docker** and **Kubernetes** to containerize applications for enhanced scalability and maintainability, leading to a reduction in infrastructure costs by **20%**.\nEstablished **CI/CD** pipelines with **GitHub Actions**, lowering deployment errors by **30%** and accelerating release cycles.\nEmployed **Airflow** for orchestrating ETL processes, achieving a **40%** increase in automation efficiency.\nDesigned and developed data models that improved insights generation and reporting, ensuring alignment with business objectives.\nImplemented **dbt** for data transformation and management, reducing data preparation time from hours to minutes.\nCollaborated with cross-functional teams to define key metrics and benchmarks for performance assessment and reporting.\nMentored junior team members in best practices of data engineering, fostering a culture of continuous learning and improvement."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **SQL** and **Databricks** to design and implement robust data warehousing solutions, enhancing data retrieval speed by **30%**.\nDeveloped ETL pipelines using **Airflow** and **dbt**, automating data transformations and reducing manual processing time by **25%**.\nImplemented **Docker** containers for application scalability and to ensure consistent environments across development, testing, and production, improving deployment efficiency.\nOrchestrated data workflows with **Kubernetes**, enabling seamless updates and managing infrastructure as code for better resource utilization.\nEstablished CI/CD pipelines to automate testing and deployment processes, resulting in a **40%** reduction in deployment errors and faster release cycles.\nCollaborated on **metadata management** and **schema design** strategies to ensure data integrity and compliance with data governance policies.\nParticipated in code reviews and architecture discussions, reinforcing best practices in **data modeling** and governance strategies.\nCreated detailed technical documentation for data processes and workflows, facilitating better knowledge transfer within teams.\nEngaged in daily scrums and project planning sessions to ensure alignment with organizational objectives and project timelines."
    }
  ],
  "skills": "Frontend Technologies: HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n\tBackend Technologies: NodeJS, ExpressJS, NestJS, C#, .NET, Entity Framework, Microservices\n\n\tAPI Technologies: RESTful API, GraphQL\n\n\tDatabase Systems: MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, SQL\n\n\tCloud & Infrastructure: AWS, Azure, Docker, Kubernetes\n\n\tDevOps: CI/CD pipelines, Airflow\n\n\tOther Skills: UX/UI Design, Git, GitHub, Python, Redux, Blockchain: Solidity, Ether.js, Web3.js, Ethereum, Databricks, Google BigQuery, data warehousing, data governance, schema design, metadata management, data modeling, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest",
  "apply_company": "team.blue"
}