{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Software Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Software Engineer with 10+ years of experience in software development and project management, delivering high-performance solutions across healthcare and finance sectors. Expert in implementing AI and machine learning strategies, with hands-on experience across the full stack utilizing **JavaScript**, **TypeScript**, **Python**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Proven track record in developing cloud-native applications on **Azure** and **AWS**. Skilled in leading projects that require asynchronous collaboration and remote work environments. Adept at building secure, maintainable software solutions that adhere to compliance standards such as HIPAA and PCI DSS. Enthusiastic about leveraging modern technologies and methodologies to enhance system performance and drive significant real-world impacts.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and developed high-quality **software solutions** for various projects, adhering to **asynchronous work** principles to optimize remote collaboration.\n• Led projects efficiently by leveraging **project management** skills, ensuring timely delivery of software while meeting client expectations.\n• Integrated **AI** technologies into applications to enhance functionalities and improve user experiences, focusing on health and financial sectors.\n• Collaborated with cross-functional teams to successfully execute **contract work**, ensuring deliverables aligned with project requirements.\n• Implemented scalable, full-stack solutions using **TypeScript**, **Python (FastAPI)**, and **Node.js**, with modern frontends in **React (17–18)**, **Next.js**, and **Vue 3**, achieving compliance with regulatory standards like HIPAA, FHIR, GDPR, PCI DSS, and SOX.\n• Built and deployed cross-platform **mobile applications** with **Flutter** and **React Native**, enhancing user experiences on both **iOS** and **Android** through integrated native modules and state management with **Provider** and **Redux**.\n• Spearheaded the transition of monolithic applications to **microservices** architecture using **Docker**, **Kubernetes (AKS/EKS)**, and serverless solutions (**AWS Lambda**, **Azure Functions**), resulting in improved system reliability and scalability.\n• Designed and optimized **cloud-native data architectures** using **PostgreSQL**, **MongoDB**, **Redis**, and **GraphQL**, effectively handling large-scale data ingestion and queries for healthcare and finance applications.\n• Developed machine learning models for real-time applications in patient risk prediction and financial fraud detection using **Python (scikit-learn, PyTorch, TensorFlow)**, integrated via real-time inference services.\n• Established **MLOps pipelines** with tools like **MLflow**, **DVC**, and **Apache Airflow**, enabling continuous model training, validation, versioning, and deployment across environments.\n• Enhanced client-facing applications with AI-driven features, such as personalized health recommendations and predictive financial dashboards, leveraging APIs hosted on **Azure ML** and **AWS Sagemaker**.\n• Implemented robust DevOps pipelines utilizing **GitHub Actions**, **Azure DevOps**, and **CircleCI**, encompassing security scans and multi-environment deployments for both web and API services.\n• Developed complex financial data visualization tools using **D3.js**, **Chart.js**, and **Power BI Embedded**, facilitating real-time insights into financial metrics and trends.\n• Partnered with data scientists to incorporate **NLP models** (utilizing **spaCy**, **Hugging Face Transformers**) for tasks such as healthcare document parsing and financial anomaly detection, integrating them into core services through **RESTful APIs**.\n• Established comprehensive testing strategies using **Jest**, **Cypress**, **PyTest**, and **Postman**, ensuring quality assurance across both frontend and backend services through unit, integration, and contract testing.\n• Leveraged **Azure Cognitive Search** and **ElasticSearch** for enabling advanced search functionalities across vast collections of structured and unstructured health records and financial documents."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "• Led the software development of financial platforms by adopting a microservices-based architecture using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, enhancing scalability by **30%** and improving maintainability for high-volume transaction systems.\n• Spearheaded the development of user-focused front-end applications utilizing **React (18)**, **Vue 3**, **Next.js**, and **TypeScript**, leveraging **Redux Toolkit** and **Tailwind CSS** to ensure responsive and high-performance interfaces for financial dashboards, improving user engagement by **25%**.\n• Developed real-time transaction monitoring and analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, which empowered operations teams to track financial activities and detect anomalies, resulting in a **20%** increase in detection accuracy.\n• Integrated **Kafka**, **RabbitMQ**, and **Azure Service Bus** to establish a robust event-driven architecture for asynchronous communication and real-time processing of transactions, alerts, and compliance workflows, decreasing latency by **40%**.\n• Built and orchestrated ETL pipelines using **Python**, **Apache Airflow**, and **Azure Data Factory**, facilitating batch and real-time ingestion of financial data from internal and third-party sources, managing over **5 TB** of data monthly.\n• Implemented AI/ML-powered fraud detection systems using **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, analyzing transaction patterns to proactively flag suspicious activities with an efficiency rate of **95%**.\n• Created ML pipelines for credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, effectively integrating model inference into backend services for real-time decision-making, enhancing prediction accuracy by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Led software development efforts, ensuring robust and efficient code delivery across various modules of a global e-commerce platform using **Python (FastAPI, Django)** and **Node.js (NestJS, Express)** for high performance and scalability.\n• Managed remote and asynchronous work with Agile methodologies, driving project management initiatives to ensure timely release cycles and improved team collaboration in a distributed environment.\n• Implemented AI solutions for product recommendations utilizing **scikit-learn**, **LightGBM**, and **TensorFlow**, resulting in a **20%** increase in conversion rates based on real-time user behavior data.\n• Optimized backend systems for high availability and low latency, achieving a **99.9%** uptime and supporting **1M+** concurrent users during peak shopping hours.\n• Developed user-friendly frontend applications using **React (18)**, **Vue 3**, and **Angular**, enhancing user engagement and satisfaction through responsive web design.\n• Utilized **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for diverse data storage solutions, leading to a **30%** reduction in average response times thanks to effective caching strategies.\n• Employed continuous integration and deployment strategies using **Kubernetes** and **LaunchDarkly** for blue-green deployments, ensuring seamless updates and minimizing downtime during transitions.\n• Created secure payment systems integrated with **Stripe**, **PayPal**, and **Razorpay**, conforming to PCI compliance standards and enhancing security for sensitive transaction data.\n• Applied role-based access control and **OAuth 2.0** to safeguard user data and ensure compliance with **GDPR** regulations throughout the application.\n• Conducted project management and coordination of tasks within remote teams to ensure alignment on goals, fostering an environment of collaborative contract work."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:** \n\tReact, Vue, Angular\n\n **API Technologies:** \n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n **Serverless and Cloud Functions:** \n\tAWS (Lambda), Azure (App Services)\n\n **Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:** \n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:** \n\tMLflow, Airflow, Kubeflow, Remote Work, Asynchronous Work, Contract Work, Project Management, Nginx, Certbot, Let’s Encrypt",
  "apply_company": "Mercor"
}