{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Rust Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-karol-kotlinski-bb2520397/",
  "profile_summary": "Accomplished Rust Engineer with 8 years of full-stack development experience, specializing in secure system design and decentralized systems leveraging **Rust**, **Blockchain Fundamentals**, and **Smart Contract Development**. Proficient in crafting solutions that utilize **Cryptographic Techniques**, such as **Asynchronous Programming** and **Secure Multiparty Computation**, ensuring robust security and integrity for web3 applications. I am highly knowledgeable in consensus protocols and decentralized identity solutions, enabling the creation of decentralized applications (dApps) with verifiable credentials (VCs).\n\nAdditionally, I have extensive experience with **JavaScript**, **TypeScript**, and **Python**, utilizing frameworks like **React**, **Next.js**, **Node.js**, and **FastAPI** for full-stack projects. My cloud expertise spans **Azure** and **AWS**, and I have successfully led the development of enterprise-grade platforms, integrating AI/ML capabilities for predictive analytics. My commitment to compliance is reflected in my familiarity with standards like HIPAA and PCI DSS. I also have hands-on experience in developing machine learning pipelines, which I complement with solid practices in CI/CD automation.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Rust Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed decentralized applications utilizing **Rust** for programming, while ensuring secure system design principles were embedded throughout the project lifecycle.\nImplemented consensus protocols and blockchain fundamentals to build robust decentralized systems, enhancing system integrity and transaction validation in **DeFi projects**.\nUtilized asynchronous programming techniques to ensure high concurrency and responsiveness in decentralized applications, leveraging the capabilities of **Rust** for performance optimization.\nEngineered secure multiparty computation methods to facilitate privacy-preserving interactions in client applications, contributing to secure identity management.\nIntegrated decentralized identity solutions, including Verifiable Credentials (VCs) and OAuth/OpenID protocols, into applications to enforce secure user authentication and authorization processes.\nDesigned and developed smart contracts for various blockchain platforms, ensuring adherence to industry standards and best practices while optimizing for gas efficiency and security.\nImplemented high-performance node software development strategies using **Rust**, which improved the overall throughput and reduced latency in decentralized networks.\nCollaborated with cross-functional teams to establish secure enclave programming practices, enhancing the security measures for sensitive data processing in decentralized applications.\nConducted thorough testing and validation of asynchronous components in **Rust** to ensure reliability and resilience of applications under different usage scenarios.\nParticipated in the architectural design and evolution of systems aimed at integrating advanced cryptographic techniques for enhanced data integrity and privacy in decentralized solutions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and implemented **Rust** applications for decentralized systems, ensuring adherence to blockchain fundamentals and consensus protocols for secure and efficient operations.\nDesigned and maintained robust **smart contract development** practices, leveraging **cryptographic techniques** to enhance security across decentralized identity solutions.\nEmployed asynchronous programming methodologies to create high-performance, concurrent systems that bolster system reliability and scalability for **DeFi projects**.\nUtilized **secure multiparty computation** to facilitate data privacy and security, integrating decentralized identity (DID) and verifiable credentials (VCs) into applications.\nArchitected and executed comprehensive security measures through **secure system design**, ensuring integrity and confidentiality in transactions.\nCollaborated on cross-functional teams to integrate **OAuth** and **OpenID** protocols for seamless user authentication and authorization in secure environments.\nEnhanced existing frameworks and libraries, achieving an increment in throughput by **30%** through optimization and refactoring efforts in Rust.\nImplemented robust blockchain protocols, contributing to the development lifecycle with a focus on version **1.0.0** compliance, and maintaining strict code quality standards."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and implemented **Web3** solutions using **Rust**, focusing on decentralized systems and infrastructure that enhance blockchain fundamentals and consensus protocols.\nEngineered secure and efficient decentralized applications, leveraging cryptographic techniques and secure multiparty computation to ensure data integrity and confidentiality in DeFi projects.\nDesigned role-based access control (RBAC) and integrated **OAuth** and **OpenID** for secure identity management, ensuring user data protection and alignment with decentralized identity (DID) principles.\nUtilized asynchronous programming and concurrent system design to enhance application performance, enabling high scalability and responsiveness in a decentralized environment.\nCreated smart contracts using **Rust** for secure transactions, implementing cryptography to protect sensitive data and maintain compliance with applicable regulations such as GDPR.\nApplied techniques in secure system design to build resilient decentralized applications, ensuring fault tolerance and efficient handling of high-traffic scenarios.\nCollaborated with cross-functional teams to deploy features in a production environment, integrating decentralized identity solutions and verifiable credentials (VCs) to enhance user authentication processes.\nOptimized workflow processes and security protocols using **Rust** for node software development, ensuring seamless integration and communication between decentralized systems and traditional infrastructures.\nConducted comprehensive testing and validation of decentralized applications, achieving a reduction in vulnerabilities by **40%** through rigorous security assessments and code reviews.\nLed the development of new features in a decentralized platform, improving overall user experience and engagement by **25%** with the implementation of responsive design principles."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular), Rust\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth, OpenID, Keycloak (OIDC, RBAC), JWT, OAuth2\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Decentralized Systems, Blockchain Fundamentals, Consensus Protocols, Cryptographic Techniques, Asynchronous Programming, Concurrent System Design, Secure System Design, Web3, Decentralized Identity (DID), Verifiable Credentials (VCs), Cryptography, Secure Enclave Programming, Smart Contract Development, Node Software Development, Secure Multiparty Computation, Decentralized Identity Solutions, DeFi Projects"
}