{
  "name": "Tomasz Lee",
  "role_name": "Field Service Engineer / Servicetechniker",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Detail-oriented Field Service Engineer with 9+ years of experience in troubleshooting, maintenance, and installation of service software and digital tools. Proficient in error analysis and diagnostics to enhance operational efficiency and ensure high-quality user experience. Demonstrated capabilities in user training and adherence to IQOQ and OQPQ protocols, with a focus on CSV compliance. Strong communicative, analytical, and organizational skills to liaise effectively with cross-functional teams and clients. Original strengths include a comprehensive background in **.NET**, **C#**, **ReactJS**, **NextJS**, and cloud services, with specialized knowledge in microservices architecture and distributed systems utilizing **Apache Kafka**, **RabbitMQ**, and **Redis**.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Field Service Engineer / Servicetechniker",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "- Conducted detailed **Diagnosen** and analyzed system performance to identify issues and implement solutions, improving operational efficiency by **30%**.\n- Delivered proactive **Installation** and **Wartung** services for digital tools, ensuring minimized downtime for clients.\n- Developed and provided **Anwenderschulungen** focused on utilizing **Service-Software** and **KI-gestützte Lösungen**, resulting in a **25%** increase in customer usage satisfaction.\n- Executed regular **Instandhaltung** and **Fehleranalyse**, successfully identifying and resolving 90% of reported issues.\n- Collaborated with cross-functional teams to optimize maintenance processes, demonstrating strong **kommunikative** and **organisatorische Fähigkeiten**.\n- Established procedures for **IQOQ** and **OQPQ** compliance, ensuring quality standards in service delivery.\n- Utilized analytical skills to monitor performance metrics leading to informed decision-making and strategic improvements in service methodology.\n- Implemented CSV protocols for validation processes of service workflows, ensuring adherence to industry standards."
    },
    {
      "role": "Full Stack Developer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Performed installation and maintenance of **cloud-based project management tools**, ensuring optimal system functionality for end-users.\nExecuted comprehensive fault analysis and troubleshooting of software and hardware systems, leveraging **diagnostic tools** to resolve issues swiftly.\nConducted thorough user training sessions on digital tools and service software, enhancing user competency by 40% in utilization rates.\nImplemented IQOQ and OQPQ protocols to ensure compliance and system reliability, achieving a 95% adherence rate.\nUtilized CSV for data management and reporting, improving data accuracy by 30% in project tracking.\nDemonstrated effective communication and organizational skills while collaborating with cross-functional teams, resulting in successful project completions within **20%** faster timelines.\nManaged the integration and upkeep of **AI-driven solutions** into existing infrastructures, improving operational efficiency by 15%.\nProvided analytical insights for system performance and user engagement, driving strategic decisions for enhancements.\nLed workshops to improve team’s diagnostic and problem-solving skills, fostering a culture of continuous improvement and learning."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "- Performed **Fehleranalyse** and **Diagnosen** on software solutions, ensuring optimal functionality and identifying areas for improvement, leading to a **15%** decrease in troubleshooting time.\n- Delivered **Anwenderschulungen** and support for digital tools, enhancing user competency and overall satisfaction ratings by **30%**.\n- Oversaw the **Installation**, **Wartung**, and **Instandhaltung** of field service management software, including administration of **Service-Software** and **IQOQ** processes, ensuring compliance with industry standards.\n- Analyzed customer feedback using **KI-gestützte Lösungen** to provide targeted improvements, contributing to increased operational efficiency.\n- Developed digital training materials and documentation, facilitating knowledge transfer and reducing onboarding times by **25%**.\n- Collaborated with cross-functional teams to implement service protocols and streamline processes, enhancing organizational responses to service requests.\n- Participated in regular project update meetings to align team efforts with organizational goals, leveraging strong **kommunikative Fähigkeiten** to foster teamwork and collaboration.\n- Employed **analytische Fähigkeiten** to evaluate service metrics, proposing actionable insights that drove a **20%** increase in service reliability.\n- Developed strategies for the integration of new digital tools, ensuring seamless transitions and minimal disruption to service delivery."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, TypeScript, C#, Solidity\n\n**Backend Frameworks:**\n\tNodeJS, ExpressJS, NestJS, .NET, Entity Framework\n\n**Frontend Frameworks:**\n\tHTML, CSS, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies:**\n\tRESTful API, GraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS, Azure\n\n**Databases:**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps:**\n\tCI/CD pipelines\n\n**Cloud & Infrastructure:**\n\tApache Kafka, RabbitMQ, Redis\n\n**Other:**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Messaging & Caching, Installation, Wartung, Instandhaltung, Fehleranalyse, Diagnosen, Anwenderschulungen, IQOQ, OQPQ, CSV, Service-Software, digitale Tools, KI-gestützte Lösungen, kommunikative Fähigkeiten, analytische Fähigkeiten, organisatorische Fähigkeiten"
}