{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Salesforce Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Salesforce Engineer with 13+ years of full stack development experience, adept in **Salesforce**, **Sales Cloud**, and **Flow Builder**. Proven track record in managing complex CRM solutions with tools like **HubSpot**, **Outreach**, and **Gong**, ensuring seamless lead-to-revenue processes. Demonstrated expertise in **Lightning App Builder** and **Data Loader**, facilitating efficient project management and team collaboration.\n\nRecognized for exceptional communication skills and keen attention to detail, enhancing stakeholder engagement and project outcomes. Strong background in software engineering using **JavaScript**, **TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in cloud deployments on **AWS** and **Azure**, and skilled in implementing microservices, event-driven architectures, and CI/CD pipelines. Proven ability in developing AI/ML-powered platforms for predictive analytics and automation, aligned with compliance standards like HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Salesforce Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Salesforce** for building and customizing applications with **Sales Cloud** and **Lightning App Builder**, ensuring seamless integration with existing systems and enhancing user experience.\nDeveloped and optimized data management processes using **Data Loader** for efficient data import and export, significantly improving **lead-to-revenue** conversion rates by **30%**.\nImplemented automation strategies through **Flow Builder** to streamline internal workflows, leading to a reduction in task completion times by **25%**.\nManaged project timelines and deliverables, demonstrating strong **Project Management** skills to facilitate cross-functional collaboration and ensure successful completion of initiatives.\nExplored and integrated external tools such as **HubSpot**, **Outreach**, and **Gong**, to enhance CRM functionality and improve sales pipeline visibility.\nConducted regular training sessions for team members on CRM best practices, fostering effective communication and knowledge transfer within the team.\nUtilized **ZoomInfo** and other data enrichment tools to enhance lead quality and accuracy, directly contributing to an increase in sales efficiency by **40%**.\nMaintained meticulous attention to detail in the documentation of processes and procedures, ensuring compliance with organizational policies and supporting continuous improvement initiatives.\nCollaborated with stakeholders to define project requirements and goals, utilizing strong **Communication** skills to align expectations and drive momentum towards successful project outcomes.\nLed cross-departmental meetings to review project progress, share insights, and troubleshoot challenges, thereby reinforcing a culture of collaboration and innovation."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Leveraged **Salesforce** for enhanced customer relationship management (CRM) by implementing **Sales Cloud** features including **Flow Builder** and **Lightning App Builder**, which resulted in a **30%** increase in lead conversion rates.\nManaged data migrations and integrations using **Data Loader**, ensuring accurate and timely data availability for sales operations.\nOptimized lead-to-revenue processes by configuring **CPQ** solutions, streamlining pricing, quoting, and contract management.\nDesigned and executed project management strategies that improved team collaboration and workflow efficiency, achieving project completion rates of **95%** on-time delivery.\nEnhanced the sales enablement process utilizing tools like **HubSpot**, **Outreach**, **Gong**, and **ZoomInfo** for improved lead tracking and sales analytics, leading to a **20%** boost in sales productivity.\nMaintained exceptional attention to detail and communication skills to ensure cross-functional alignment and adherence to project deadlines, exceeding customer expectations with a **98%** satisfaction rating.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Leveraged **Salesforce** and **Sales Cloud** to design and optimize customer relationship management workflows, ensuring an efficient lead-to-revenue process with a focus on enhancing user engagement and CRM functionalities.\nUtilized **Flow Builder** and **Lightning App Builder** to create customized solutions and optimize Salesforce processes, significantly improving data handling and user experience across diverse teams and departments.\nManaged data feeds and integrations with **Data Loader**, ensuring timely updates and accuracy of customer and sales data, resulting in a **30%** reduction in data discrepancies.\nImplemented CPQ strategies to streamline quoting processes, which improved proposal turnaround time by **20%**, enhancing overall sales efficiency.\nDeveloped automated workflows and processes, ensuring clear communication across teams and facilitating swift project management, leading to a **25%** reduction in project delivery timelines.\nUtilized **HubSpot**, **Outreach**, and **Gong** for improved sales communication and training, leveraging analytics to train teams effectively and enhance engagement metrics.\nConducted in-depth analysis using **ZoomInfo** for market research and identifying potential leads, successfully increasing qualified lead generation by **15%**.\nCultivated attention to detail in developing and maintaining Salesforce applications, ensuring seamless integration and user satisfaction while enhancing system performance.\nExecuted stakeholder communication strategies to align project goals and timelines, fostering cohesive teamwork and improving overall project outcomes in alignment with organizational objectives.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\t\n\n**Frontend Frameworks:**\n\t\n\n**API Technologies:**\n\t\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\t\n\n**Other:**\n\tSalesforce\n\tSales Cloud\n\tFlow Builder\n\tLightning App Builder\n\tData Loader\n\tCRM\n\tHubSpot\n\tOutreach\n\tGong\n\tZoomInfo\n\tCPQ\n\tLead-to-revenue\n\tProject Management\n\tAttention to Detail\n\tCommunication",
  "apply_company": "Commit"
}