{
  "name": "Mariusz Jan Skobel",
  "role_name": "Full Stack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Full Stack Engineer with 10+ years of experience specializing in **Python**, **JavaScript**, and SQL, adept in both front-end and back-end development. Proficient in **HTML**, utilizing **C#** and **C++** to effectively solve complex problems through algorithms and data structures. Demonstrated expertise in debugging and problem solving, ensuring the delivery of high-performance software solutions in diverse domains, including healthcare and finance. Experienced with modern frameworks and libraries such as **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Skilled in deploying applications on **AWS** and **Azure**, leveraging microservices architecture and CI/CD automation to build secure, maintainable solutions that adhere to compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, possesses practical knowledge in MLOps, developing and deploying machine learning pipelines using tools like **MLflow**, **Airflow**, and **Kubeflow**. A collaborative communicator passionate about creating systems that deliver significant real-world impact.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Full Stack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions utilizing **Python** and **JavaScript** for optimal functionality in healthcare and finance domains, ensuring compliance with regulatory standards.\n• Developed immersive user experiences for mobile applications on both iOS and Android platforms by leveraging **Flutter** and **React Native**, integrating state management using Provider and Redux, achieving user satisfaction scores exceeding **90%**.\n• Led the transition from monolithic architectures to microservices, utilizing **Docker**, **Kubernetes** (specifically **AKS/EKS**), and serverless solutions like **AWS Lambda** and **Azure Functions**, enhancing system resilience with an uptime of **99.9%**.\n• Designed robust cloud-native data architectures with **PostgreSQL**, **MongoDB**, and **Redis**, improving data processing speeds by **40%** for healthcare and finance applications.\n• Developed machine learning models for patient risk prediction, financial fraud detection, and document classification using **Python** and frameworks such as **scikit-learn**, **PyTorch**, and **TensorFlow**, integrating real-time inference capabilities into backend systems.\n• Built MLOps pipelines employing **MLflow**, **DVC**, and **Apache Airflow** to enable continuous integration and deployment of models, enhancing deployment efficiency by **30%**.\n• Integrated AI-driven features, such as personalized health recommendations and predictive alerts, into applications utilizing models hosted on **Azure ML** and **AWS Sagemaker**.\n• Established enterprise-level DevOps practices through **GitHub Actions**, **Azure DevOps**, and **CircleCI**, ensuring seamless testing and deployment cycles for both web and API services.\n• Developed dynamic financial data visualization tools using **D3.js**, **Chart.js**, and **Power BI**, allowing users to derive insights from transaction data in real time.\n• Collaborated with data scientists to implement NLP models using **spaCy** and **Hugging Face Transformers** for advanced document parsing and financial anomaly detection, integrating these solutions through RESTful APIs.\n• Established comprehensive testing strategies using **Jest**, **Cypress**, **PyTest**, and **Postman**, achieving over **95%** test coverage across both front-end and back-end services.\n• Integrated cutting-edge search capabilities utilizing **Azure Cognitive Search** and **ElasticSearch** to manage millions of health records and financial documents, drastically improving search performance."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **JavaScript** to develop and modernize financial platforms, implementing microservices-based architecture with **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), improving scalability and throughput for **9** million high-volume transactions per day.\nDesigned and developed dynamic front-end applications using **React (18)**, **Vue 3**, and **Next.js** on **TypeScript**, employing **Redux Toolkit** and **Tailwind CSS** to enhance user experience and performance for financial dashboards and admin portals with a responsiveness score of over **95**.\nEngineered real-time transaction monitoring and analytics dashboards using **React**, **D3.js**, and **Power BI Embedded**, allowing operations teams to process over **100 million** transactions monthly, detect anomalies, and generate actionable insights.\nLeveraged messaging technologies such as **Kafka**, **RabbitMQ**, and **Azure Service Bus** to establish a robust event-driven architecture, facilitating asynchronous communication and real-time event processing that reduced latency by **30%**.\nConstructed and orchestrated ETL pipelines utilizing **Python**, **Apache Airflow**, and **Azure Data Factory** for efficient batch and real-time ingestion of financial data from internal and third-party sources, processing **10 TB** of data daily.\nApplied AI/ML algorithms, employing **scikit-learn**, **XGBoost**, and **Azure Machine Learning**, to build fraud detection systems that analyze transaction patterns, enabling proactive alerts for suspicious activities, significantly improving detection rates by **15%**.\nDeveloped ML pipelines for critical functions such as credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, seamlessly integrating model inference into backend services for enhanced real-time decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **JavaScript** (React, Vue, Angular) to design and optimize backend and frontend services, ensuring high availability, low latency, and scalability across key e-commerce modules.\nImplemented **SQL** for database management, leveraging **MongoDB** and **PostgreSQL** for distributed data storage, providing fast, fault-tolerant data access for high-traffic workflows.\nDeveloped efficient algorithms and data structures to enhance system performance and optimize resource utilization in both backend and frontend applications.\nEmployed problem-solving skills to troubleshoot and optimize existing features, applying extensive debugging techniques to ensure rapid resolution of issues.\nEnhanced communication across cross-functional teams to deliver comprehensive updates, ensuring alignment on project goals and timelines.\nEngineered real-time features using **WebSockets**, event-driven architecture, **Kafka**, and **RabbitMQ**, enabling responsive updates and dynamic state management.\nLeveraged **AI/ML** technologies such as **scikit-learn** and **TensorFlow** to develop recommendation engines, optimizing search relevance and improving conversion rates based on real-time data analysis.\nImplemented **Redis** caching strategies for efficient data retrieval and improved application responsiveness, achieving a **30%** reduction in database read pressure.\nExecuted feature flags and blue-green deployments using **LaunchDarkly** and **Kubernetes**, achieving controlled rollouts and minimizing risks during major updates.\nCreated mobile-first, responsive user interfaces with **Next.js**, ensuring fast and SEO-friendly e-commerce experiences, compliant with accessibility standards (WCAG 2.1).\nBuilt secure payment workflows integrated with **Stripe**, **PayPal**, and **Razorpay**, utilizing tokenization and maintaining PCI compliance for sensitive user transactions.\nApplied role-based access control (RBAC) and **OAuth 2.0** for enhanced security, ensuring user data protection and GDPR compliance throughout the platform."
    }
  ],
  "skills": " **Programming Languages:**\n\t Python, JavaScript, C#, C++, HTML, SQL, Swift\n\n**Backend Frameworks:**\n\t FastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\t React, Vue, Angular\n\n**API Technologies:**\n\t Keycloak (OIDC, RBAC), JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\t AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\t PostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\t Docker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD & Infrastructure as Code (Terraform, Ansible, Helm, Docker Compose)\n\n**Other:**\n\t MLflow, Airflow, Kubeflow, algorithms, data structures, debugging, problem solving, communication, Let’s Encrypt, Nginx, Certbot"
}