{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior FullStack Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Full Stack Engineer with 13+ years of experience in delivering high-performance applications, particularly in the healthcare and financial sectors. Expertise in **C#**, **Angular**, and **T-SQL**, complemented by a solid understanding of **Microservices** and **Service Fabric** architecture. Proven ability to develop and deploy robust applications leveraging **SQL Server** and cloud computing technologies. \n \nSkilled in building AI solutions and implementing customer-focused features while maintaining a strong emphasis on IT security. Demonstrated communication and collaboration strengths enhance cross-functional teamwork, ensuring successful project outcomes. Proficient in the tech stack including **JavaScript/TypeScript**, **Python**, **Flutter**, **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced with cloud-native deployment on **AWS** and **Azure**, alongside expertise in creating **CI/CD pipelines** and maintaining compliance with standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable Full-Stack applications utilizing **C#**, **Angular**, and **Microservices** architecture to ensure high performance and maintainability.\n• Designed and implemented secure database solutions using **T-SQL** and **SQL Server**, ensuring data integrity and compliance with IT Security standards.\n• Collaborated with cross-functional teams to enhance customer-focused features in real-time applications, leveraging excellent **Communication Skills** and **Collaboration** practices.\n• Led initiatives to integrate **Cloud Computing** services, improving deployment efficiency and application resilience.\n• Implemented robust microservices using **Service Fabric** to enable fault-tolerance and scalability in environments handling millions of requests per day.\n• Architected solutions that incorporate AI-driven features, enhancing user engagement and system responsiveness based on comprehensive customer feedback analytics.\n• Conducted training sessions and workshops to enhance team skills in **C#** and **Angular**, fostering a culture of learning and collaboration.\n• Championed best practices in coding and testing by defining testing strategies that cover unit, integration, and functional tests across the stack.\n• Monitored and optimized system performance, achieving a 40% increase in application speed and reliability after migrating to a microservices-based architecture.\n• Invested in building a strong DevOps pipeline, utilizing tools for CI/CD that cut deployment times by **50%** and improved overall service delivery.\n• Created technical documentation that improved onboarding time for new team members by **30%**, reinforcing the importance of effective communication in project execution."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Utilized **C#** and **Angular** to develop scalable web applications in a microservices architecture, ensuring high-performance execution of customer-centric solutions.\n• Implemented robust **T-SQL** queries for efficient data retrieval and manipulation within a **SQL Server** environment, optimizing database performance.\n• Spearheaded the design and deployment of microservices using **Service Fabric**, contributing to enhanced system reliability and maintainability.\n• Collaborated on cloud computing solutions to harness scalable resources for application deployment and management, improving operational efficiency.\n• Prioritized IT security by implementing best practices to safeguard sensitive customer data within financial applications, elevating customer trust and engagement.\n• Enhanced customer focus by integrating user feedback into the development lifecycle, ensuring products met evolving user needs across **AI** and analytics tools.\n• Fostered effective communication skills by coordinating with cross-functional teams to deliver solutions that exceeded stakeholder expectations.\n• Cultivated a collaborative team environment while mentoring junior developers, leading to a 30% increase in sprint productivity.\n• Successfully managed a project timeline that reduced deployment from 10 weeks to 6 weeks by implementing agile methodologies, enhancing team efficiency and responsiveness."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **C#** to design and implement microservices architecture, enhancing scalability and maintainability of backend systems in the role of a Senior FullStack Engineer.\nDeveloped dynamic and responsive web applications with **Angular** (latest version), ensuring a seamless user experience and efficient component management in line with customer focus.\nImplemented robust database solutions using **T-SQL** and **SQL Server**, optimizing query performance by **30%** through advanced indexing strategies and well-structured database schemas.\nLeveraged **Service Fabric** for deploying and managing microservices in a distributed cloud environment, achieving high availability and reducing downtime by **25%** during updates.\nApplied cloud computing principles to build scalable applications with embedded IT security measures, ensuring the protection of sensitive data through **encryption** and **role-based access control (RBAC)**.\nFostered a culture of collaboration and communication within cross-functional teams to align project goals with customer needs, leading to a **15%** increase in customer satisfaction ratings.\nIncorporated artificial intelligence (AI) techniques to enhance application features, tailoring solutions to user behavior and preferences, which improved user engagement metrics by over **20%**.\nFacilitated effective teamwork through established communication protocols, ensuring project milestones were met on time and within budget, thus delivering **5 major releases** in one fiscal year.\nConducted regular code reviews and mentoring sessions to promote best practices in coding and architecture within the team, consequently enhancing overall team productivity by **18%**."
    }
  ],
  "skills": " **Programming Languages:**\n\tC#, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Service Fabric, Microservices\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, SQL Server, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tAI, IT Security, Customer Focus, Communication Skills, Collaboration",
  "apply_company": "Inycom"
}