{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with over 9 years of experience in designing and implementing robust API solutions in **Java** and **Spring Boot**. Proficient in both relational and NoSQL databases, adept at leveraging **SQL** and **NoSQL** technologies to optimize data management. Strong advocate of Test Driven Development (TDD) principles and experienced in documenting technical specifications to foster collaboration across teams. Skilled in utilizing **AWS** and **CDK** for cloud infrastructure and deployment, with a commitment to continuous improvement and a growth mindset. Original strengths include a solid foundation in **.NET**, **C#**, and distributed systems with hands-on experience in **Apache Kafka**, **RabbitMQ**, and **Redis**, enabling the delivery of high-quality software solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Java** and **Spring Boot** to develop robust APIs for backend services, ensuring seamless integration with front-end applications.\nEmployed **AWS** services such as Lambda and S3 to enhance application scalability and reliability.\nImplemented **CDK** (Cloud Development Kit) for infrastructure as code, facilitating consistent deployments across environments.\nDesigned and optimized databases using **SQL** and **NoSQL** solutions, achieving a **20%** reduction in query execution time and improved data retrieval efficiency.\nApplied **Python** for building automation scripts, contributing to faster development cycles and maintaining code quality.\nPracticed Test Driven Development (TDD) to ensure high-quality code and reliability, resulting in reduced bugs in production.\nCollaborated effectively with cross-functional teams to enhance system features, supporting a growth mindset and fostering innovation.\nCreated comprehensive documentation for APIs and system architecture, promoting knowledge sharing and smoother onboarding processes.\nEngaged in peer code reviews and provided constructive feedback to peers, improving overall code quality and team productivity.\nMonitored system performance and implemented solutions to optimize throughput and resilience, contributing to overall system stability."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "- Developed RESTful APIs using **Java** and **Spring Boot** to ensure efficient data access and integration with various data storage solutions such as **SQL** and **NoSQL** databases.\n- Designed and implemented infrastructure solutions on **AWS** using **Cloud Development Kit (CDK)** to enhance scalability and reliability of applications.\n- Collaborated with cross-functional teams to define system requirements and development timelines, ensuring timely project delivery of up to **9** major releases per year.\n- Led the implementation of Test Driven Development (TDD) practices to improve code quality and reduce bugs by **25%**.\n- Documented system architecture and APIs to facilitate onboarding and knowledge sharing among team members, increasing team efficiency.\n- Created interactive dashboards for project status using **D3.js**, improving stakeholder communication and reporting accuracy.\n- Mentored junior developers, enhancing their skills and contributing to a **30%** increase in overall team productivity.\n- Streamlined development processes through continuous integration and deployment strategies, leading to a **20%** reduction in deployment times."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Developed RESTful APIs with **Java** and **Spring Boot**, ensuring optimal performance and scalability for backend services.\nImplemented **AWS** services, including **CDK** for infrastructure as code, resulting in a **30%** reduction in deployment time.\nUtilized **SQL** and **NoSQL** databases to optimize data storage and retrieval processes, which increased query efficiency by **25%**.\nApplied Test Driven Development (TDD) principles to enhance code reliability, focusing on a measurable improvement in bug reduction by **40%**.\nCollaborated with cross-functional teams to define and implement necessary API integrations, fostering seamless data sharing across platforms.\nLed documentation efforts for system architecture and development processes, improving team onboarding efficiency.\nEngaged in regular code reviews and pair programming sessions to promote knowledge sharing and best practices across the engineering team.\nEmbraced a growth mindset by continuously seeking feedback and improving skills through training and collaborative projects.\nLeveraged **Python** for automation scripts, enhancing workflow efficiency by **20%**."
    }
  ],
  "skills": "**Programming Languages**\n\tJava, Python, TypeScript\n\n**Backend Frameworks**\n\tSpringboot, NodeJS, ExpressJS, NestJS, C#, .NET, Microservices\n\n**Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n**API Technologies**\n\tRESTful API, GraphQL, API\n\n**Serverless and Cloud Functions**\n\tAWS, CDK\n\n**Databases**\n\tSQL, NoSQL, MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n**DevOps**\n\tAzure, CI/CD pipelines\n\n**Cloud & Infrastructure**\n\tAWS\n\n**Other**\n\tUX/UI Design, Git, GitHub, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Documentation, Collaboration, Test Driven Development, Growth Mindset, Blockchain: Solidity, Ether.js, Web3.js, Ethereum",
  "apply_company": "Enfuce"
}