{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Backend Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Dynamic Senior Backend Engineer with 8+ years of robust software engineering experience, specializing in **Node.js** and **TypeScript** for scalable backend solutions. Well-versed in **AWS** cloud services and **PostgreSQL** database management, I excel in developing RESTful APIs in line with industry standards. My proficiency in **Git** for version control, combined with a strong understanding of **Serverless** architecture, enables me to create efficient, modular systems. Experienced in Agile methodologies, I bring a collaborative approach to projects, ensuring timely delivery of high-quality software. Additionally, my foundation in stemming from **Python** frameworks such as **FastAPI**, **Django**, and **Flask** enriches my problem-solving capabilities. I am committed to integrating **AI** solutions and optimizing development processes for enhanced system performance.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Developed and maintained RESTful APIs using **Node.js** and **TypeScript**, ensuring integration with **PostgreSQL** for efficient data management and retrieval.\n• Implemented serverless architectures on **AWS**, enhancing application scalability and cost efficiency by utilizing AWS Lambda and other cloud-native services.\n• Collaborated effectively in an Agile environment, adopting workflows that emphasize rapid iteration and continuous delivery of high-quality software solutions.\n• Integrated AI technologies to enhance backend functionalities, improving user experiences and system responsiveness.\n• Led the migration of existing systems to modular **Node.js** microservices, improving overall system resilience and maintainability by **30%**.\n• Utilized **Git** for version control, streamlining collaboration within the development team and ensuring code quality through effective branching strategies.\n• Established best practices for API development, performance optimization, and serverless deployment, driving productivity within the engineering team.\n• Mentored junior engineers in **Node.js**, **TypeScript**, and RESTful API design, fostering a culture of knowledge sharing and technical growth.\n• Monitored and optimized backend services for performance and availability, ensuring a **99.9%** uptime and seamless user experiences.\n• Implemented automated testing frameworks to ensure quality and consistency in code deployment, reducing bug count by **40%** pre-release.\n• Emphasized the importance of proper documentation and clear communication to align team objectives and project goals, improving team coherence and project success rates."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed and maintained backend systems using **Node.js** and **TypeScript**, optimizing performance and scalability in accordance with Agile methodologies.\n• Built RESTful APIs ensuring seamless communication with client-side applications, enhancing user experience across platforms.\n• Designed and deployed serverless architecture with **AWS**, leveraging services like Lambda for efficient and cost-effective application deployment.\n• Integrated PostgreSQL for robust data management and analytics, ensuring high availability and performance.\n• Collaborated with cross-functional teams to implement **AI** solutions, improving the capabilities of backend services.\n• Implemented automated quality assurance processes using **Git** for version control and continuous integration, streamlining the development workflow.\n• Developed comprehensive unit and integration tests to ensure code reliability and performance, contributing to a structured development approach.\n• Actively participated in code reviews and pair programming sessions, sharing knowledge and ensuring adherence to best coding practices.\n• Managed and optimized delivery pipelines for continuous deployment, enhancing release efficiency and reducing downtime.\n• Maintained documentation for backend processes and system components, ensuring clarity and reference for future development efforts."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and developed scalable backend services using **Node.js** and **TypeScript**, enhancing system performance and user experience for a major e-commerce platform.\nCreated robust **RESTful APIs** integrating with **PostgreSQL** to handle over **10,000** high-volume transactions per day, ensuring efficient communication between backend systems and frontend interfaces.\nImplemented serverless architecture on **AWS**, optimizing environmental resources and reducing costs by **20%** while maintaining uptime and performance.\nManaged agile development processes with a focus on continuous delivery, resulting in a **30%** increase in project turnaround time.\nDeveloped AI-driven features to improve personalization, enhancing customer engagement and retention.\nUtilized **Zod** for TypeScript schema validation, ensuring data integrity and reducing runtime errors.\nAutomated CI/CD pipelines using **Git** and **AWS Lambda**, ensuring rapid deployment cycles while minimizing downtime.\nEnhanced existing microservices to utilize serverless functions, thereby increasing scalability and reducing operational overhead.\nCollaborated in a cross-functional team employing Agile methodologies, improving team efficiency and communication.\nConducted performance tuning and optimizations on databases, using **PostgreSQL** to enhance query performance by **15%**.\nBuilt and maintained comprehensive unit and integration tests using **Jest** to ensure robust software quality, achieving over **90%** test coverage in critical modules.\nParticipated in code reviews and knowledge sharing sessions, fostering a culture of continuous improvement and skill development within the team."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, Node.js, TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs, RESTful\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda, Serverless\n\n**Databases:**\n\tPostgreSQL, SQLAlchemy, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Agile\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tZOD, Pydantic, Celery, Authentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), AI, Git",
  "apply_company": "Vita Health"
}