{
  "name": "Patryk Zaslawski",
  "role_name": "Lead Website Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-107978395/",
  "profile_summary": "As a Lead Website Software Engineer with 8+ years of expertise, I excel in JavaScript and front-end development, leveraging tools within the **martech stack** such as **Marketo**, **Wistia**, and **Chili Piper**. I bring a strong technical vision and architectural decision-making capabilities, ensuring robust and scalable solutions. My background in AI SEO tooling contributes to enhanced site visibility and performance. I am also adept at experimentation frameworks, enabling data-driven decisions and fostering a culture of innovation. Beyond technical skills, I possess strong coaching, leadership, and collaboration abilities that drive team success. My experience encompasses creating high-performance solutions for diverse sectors, utilizing a wide tech stack including **Python** (FastAPI, Django, Flask, SQLAlchemy), **Angular**, **Vue**, **React**, **Next.js**, **AWS**, **Azure**, and databases like **PostgreSQL**, **MySQL**, and **MongoDB** for optimum system reliability and efficiency.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Lead Website Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Highlighted key skills in front-end development and architectural decisions for the organization:\n- Spearheaded the architectural design of scalable web applications using **JavaScript frameworks** (React, Angular, Vue) to enhance user engagement and optimize SEO in line with marketing strategies.\n- Developed an experimentation framework leveraging AI SEO tooling and analytics insights to drive performance optimization across digital platforms, resulting in a **30% increase** in website traffic.\n- Collaborated cross-functionally to deliver integrated solutions using **martech stack** tools like **Marketo** and **Wistia** to streamline user interactions and enhance content delivery.\n- Coached and led a team of 10+ engineers, fostering communication and collaboration skills while ensuring high-quality code practices and adherence to design principles.\n- Established a technical vision that incorporated best practices in front-end development, enhancing the overall user experience with measurable improvements in conversion rates.\n- Optimized website performance through effective utilization of **Adobe Experience Manager (AEM)**, integrating it seamlessly with **JavaScript** front-end solutions for a personalized experience.\n- Planned and executed architectural decisions that ensured scalability and maintainability of codebases, facilitating **continuous deployment** cycles.\n- Rigorously tested web applications with tools like **Selenium** and **Apache JMeter** to ensure high availability, reliability, and performance standards.\n- Championed collaborative problem-solving sessions to address design challenges, cultivating a culture of innovation and agile methodologies within the team.\n- Enhanced the digital healthcare experience through effective communication of technical concepts, ensuring stakeholders understood the implementation of new technologies and features."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Spearheaded front-end development leveraging **JavaScript** frameworks, ensuring responsive and user-friendly interfaces by implementing best practices in design and SEO strategies, enhancing overall site visibility and performance.\n• Collaborated with marketing teams to integrate **martech stack** tools like **Marketo**, **Wistia**, and **Chili Piper**, aligning technical solutions with business objectives to drive user engagement and conversion rates by over **20%**.\n• Provided coaching and mentorship to junior developers, fostering a culture of continuous learning, collaboration, and technical vision within the team, while enhancing team productivity by **15%**.\n• Led architectural decisions to streamline development workflows, promoting the use of an experimentation framework for A/B testing, resulting in informed design choices and improved user experience metrics.\n• Communicated effectively with cross-functional teams to coordinate project efforts, resolving conflicts and ensuring alignment with stakeholders for enhanced collaboration.\n• Implemented rigorous problem-solving strategies to address technical challenges, driving innovative solutions that resulted in **10%** faster load times.\n• Enhanced SEO practices through the adoption of **AI SEO tooling**, monitoring site performance metrics to ensure high ranking and compliance with best practices.\n• Utilized design eye to critique and improve user interface designs, ensuring all developments met brand standards and user expectations."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Led architectural decisions and technical vision for website development, ensuring all projects adhere to modern standards and best practices.\nCoached and mentored team members in front-end development, enhancing their skills with tools such as **JavaScript** and robust frameworks (React, Next.js, Angular, Vue).\nCollaborated with cross-functional teams, effectively communicating project requirements and progress to stakeholders, fostering a culture of teamwork and innovation.\nDesigned SEO-optimized, mobile-friendly websites using **Next.js**, **React**, and **Angular**, integrating with Python APIs for enhanced performance and cross-device compatibility.\nImplemented experimental frameworks for A/B testing, utilizing **AI SEO tooling** to optimize site visibility and drive traffic.\nEvaluated and integrated martech stack tools like **Marketo**, **Wistia**, and **Chili Piper**, improving marketing efficiency and lead generation by **30%**.\nDirected and streamlined development processes through effective collaboration with design teams, ensuring a strong design eye for user interface and experience improvements.\nOversaw the automation of builds and deployments with CI/CD pipelines (**GitHub Actions**, **Azure DevOps**, **Jenkins**), achieving a **50%** reduction in deployment times.\nUtilized modern methodologies and best practices in both front-end and back-end technologies to enhance code quality and maintainability, serving as a key problem solver and decision-maker in project outcomes.\nConducted design workshops and brainstorming sessions, fostering creativity and collaboration among team members to drive innovation in website features and functionalities."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, SQLAlchemy\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Other:**\n\tSEO, martech stack, Marketo, Wistia, Chili Piper, AI SEO tooling, front-end development, experimentation framework, technical vision, architectural decisions, coaching, leadership, communication, collaboration, problem solving, design eye"
}