{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Backend Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Backend Engineer with 13+ years of experience delivering high-performance applications in the healthcare and financial sectors. Proficient in **API** development, **Scalability**, and **Systems Design**. Adept in **Ruby**, **Ruby on Rails**, **Go**, and **TypeScript**, ensuring robust backend services. Specialized in observability and incident response, I excel in creating resilient and maintainable infrastructures. Experienced in leveraging cloud-native platforms while implementing microservices architecture.\nAdditionally, I bring hands-on expertise in AI/ML-powered solutions with knowledge in **Python** and cloud deployment on **AWS** and **Azure**. I possess a strong background in compliance-driven development, ensuring solutions align with industry standards such as HIPAA and PCI DSS.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed robust **API** services using **Ruby on Rails** and **Go** to enhance backend services, ensuring high performance and scalability.\nEmployed **TypeScript** effectively in backend applications, collaborating with frontend teams to deliver seamless user experiences.\nImplemented observability strategies to monitor backend services, enabling proactive incident response and minimizing downtime across systems.\nDesigned scalable systems architecture that supports future growth and high user demand, incorporating best practices for system design.\nLed the migration of monolithic applications to microservices, explicitly adjusting for growth in terms of user load, with a 30% improvement in response times.\nEnhanced incident response protocols by utilizing monitoring tools and ensuring swift resolution of backend functionality issues, achieving a 95% incident resolution rate.\nCollaborated across teams to ensure robust integration of various backend services, achieving a 99% uptime across critical applications.\nMapped out and defined testing strategies for backend components, ensuring code reliability with automated tests covering 85% of features.\nOptimized backend performance through iterative improvements and applying best practices across existing services, resulting in a 40% performance increase in load handling.\nFostered strong communication and collaboration within cross-functional teams to align backend services with overall business objectives."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "- **Designed** and developed scalable **API** services utilizing **Node.js**, enhancing system performance and reliability for high-volume transactions.\n- Implemented robust **observability** practices to monitor backend services, ensuring swift **incident response** and high availability of applications.\n- Collaborated with cross-functional teams to improve backend architecture using **Ruby on Rails** and **Go**, driving efficiency in systems design and deployment.\n- Developed and maintained code in **Typescript**, ensuring type safety and consistency across backend services, further improving maintainability.\n- Optimized backend processes to handle a 30% increase in transaction volume, leading to a significant improvement in system responsiveness and user experience.\n- Engaged in regular code reviews and knowledge sharing, contributing to a 25% decrease in bug rates and enhanced team collaboration.\n- Led the **migration** of legacy systems to modern frameworks, improving scalability by **50%** and reducing system downtime during peak periods.\n- Actively participated in designing solutions that increased system throughput by **40%**, addressing both scalability challenges and user demand efficiently."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and optimized **API** services for a global e-commerce platform using **Ruby on Rails** and **Go**, ensuring high availability, low latency, and scalability across critical modules like checkout and order fulfillment.\nEngineered incident response strategies and observability features to monitor backend services, achieving a downtime reduction of **99.9%** across **3** major platform updates.\nDesigned scalable backend architectures accommodating **10K+** concurrent users, utilizing effective systems design principles to enhance performance and reliability.\nLeveraged **Typescript** in building robust backend solutions, integrating with various data stores, including **MongoDB**, ensuring fast, fault-tolerant access to high-traffic e-commerce workflows.\nImplemented effective monitoring tools to enhance observability of backend services, minimizing response times by **30%** through proactive incident management and response plans.\nCollaborated with frontend teams to ensure seamless integration using **API** technologies, creating efficient data pathways for smooth user experiences across mobile and web platforms.\nEnhanced performance of backend services by applying caching strategies with **Redis**, achieving a **40%** increase in data retrieval speed and system responsiveness.\nEngaged in continuous improvement of backend systems and processes, fostering agile development practices to maintain alignment with e-commerce industry standards and growth objectives.\nOptimized application scalability by utilizing cloud resources effectively, enabling the infrastructure to handle up to **5X** the usual load during peak sales seasons."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Ruby, Go, Elixir\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Ruby on Rails\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tAPI\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n \n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Observability, Incident Response, Backend Services, Scalability, Systems Design",
  "apply_company": "Gigs"
}