{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Data Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Data Engineer with 13+ years of experience in delivering high-performance applications, specialized in data handling and analytics across the healthcare and financial sectors. Proficient in **SQL**, **Snowflake**, and **dbt**, with a strong command of data visualization tools like **Power BI**. Adept at using **Git** for version control and experienced in implementing **CI/CD** practices for efficient workflow management.\nDemonstrated teamwork capabilities while successfully deploying cloud-native systems on **AWS** and **Azure**, and leveraging frameworks such as **React**, **Node.js**, and **Django** for comprehensive data processing. Skilled in adapting compliance-driven development methodologies, ensuring alignment with standards such as HIPAA and PCI DSS. Complemented by a solid grasp of AI/ML technologies, advancing MLOps practices through tools like **MLflow** and **Airflow**, enhancing real-time data processing and predictive analytics.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Data Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **SQL** to query and manipulate large datasets to support analytical and reporting needs in healthcare and fintech sectors.\nDeveloped and maintained data pipelines using **dbt** for transforming and modeling data, ensuring accuracy and integrity of datasets.\nCollaborated with cross-functional teams to integrate data solutions with **Snowflake** for efficient data warehousing and retrieval processes, handling over **1TB** of data monthly.\nImplemented continuous integration and continuous deployment (**CI/CD**) strategies using **Git** to streamline code updates and enhance collaboration within the data engineering team.\nEmployed **Power BI** for advanced data visualization, creating dashboards that provided insights on key metrics and trends, facilitating data-driven decision making.\nWorked alongside teams utilizing **SAP** and **Salesforce** to ensure seamless data integration and analysis across various business processes.\nEngaged in teamwork and cross-department collaborations to understand stakeholder requirements, delivering solutions that met their data analytics needs effectively.\nMaintained documentation for processes, data models, and systems to ensure clarity and accountability, enhancing team communication in **English**.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed data models and transformations using **SQL** and **dbt** to ensure high-quality data alignment with business needs for effective reporting and analytics.\n• Optimized workflows and queries in **Snowflake** to enhance data retrieval performance by **40%**, enabling faster data-driven decision making.\n• Integrated data pipelines with **SAP** and **Salesforce** to streamline data flow and enhance CRM capabilities, resulting in a **30%** increase in operational efficiency.\n• Collaborated with cross-functional teams to implement real-time reporting solutions using **Power BI**, providing stakeholders with actionable insights into business performance.\n• Employed **Git** for version control and documentation, promoting teamwork and maintaining code integrity across multiple projects.\n• Implemented **CI/CD** pipelines for automated deployment processes, reducing deployment times by **50%** and minimizing downtime during updates.\n• Fostered an environment of teamwork and collaboration by leading regular stand-ups and engaging in knowledge sharing sessions, enhancing team communication skills.\n• Conducted presentations in English for technical and non-technical audiences, effectively communicating complex data engineering concepts and project statuses."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **SQL** to query and manipulate data for analytical purposes, ensuring data accuracy and integrity in the e-commerce backend services.\nImplemented **dbt** for data transformation and modeling, streamlining the ETL process and optimizing data workflows within the data pipeline.\nWorked with **Snowflake** as a cloud data warehouse solution to store and analyze large datasets, enhancing data accessibility and analytics performance.\nIntegrated **SAP** and **Salesforce** for seamless flow of data across systems, improving business intelligence and customer relationship management.\nCreated insightful dashboards and reports using **Power BI**, providing stakeholders with real-time data visualizations to inform strategic decision-making.\nUtilized **Git** for version control and collaboration within the development team, ensuring smooth workflows and code management.\nImplemented **CI-CD** practices to automate deployments and ensure quick release cycles, enhancing software reliability and speed of delivery.\nFostered a strong sense of **teamwork** by collaborating with cross-functional teams, sharing knowledge, and solving complex data challenges together.\nCommunicated effectively in **English** with team members and stakeholders to ensure alignment on project goals and deliverables."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\tOAuth2, JWT\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, SQL, Snowflake\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI-CD\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), Nginx, Let’s Encrypt, Certbot, dbt, SAP, Salesforce, Power BI, teamwork, English"
}