{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Python Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior Python Engineer with 13+ years of experience in developing scalable architectures and high-performance applications in the healthcare and financial industries. Proficient in **FastAPI**, **React**, and **Python**, leveraging **AWS** services, including **ECS** and **Fargate**, to build cloud-native systems. Expert in implementing **Docker** for containerization and optimizing CI/CD pipelines for rapid deployment.\nSkilled in ML and NLP processes, focusing on data processing and model inference APIs to enhance automation and analytics capabilities. Experienced in constructing AI/ML-integrated platforms utilizing techniques for predictive analysis and real-time data processing. Well-versed in compliance-driven development, adhering to standards like HIPAA and PCI DSS, ensuring secure and reliable solutions.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable architecture solutions leveraging **FastAPI** and **Python** to enhance full-stack platforms, ensuring smooth performance across the healthcare and fintech domains.\n• Implemented CI/CD pipelines using **Docker** and automation tools to enable rapid development and deployment cycles, achieving deployment efficiency increases of **30%**.\n• Engineered data processing solutions with **AWS** services, optimizing data ingestion and model inference APIs for real-time capabilities in health and finance applications.\n• Integrated advanced **NLP** models into platforms for document parsing, ensuring robust security using secure REST APIs, thereby increasing data processing speed by **25%**.\n• Collaborated with multi-disciplinary teams to deploy ML applications utilizing **ML** frameworks, ensuring compliance and regulatory standards in healthcare.\n• Enhanced front-end interfaces using **React** to build engaging user experiences, improving user engagement metrics by **40%**.\n• Championed efforts to transform legacy systems into containerized services using **ECS** and **Fargate**, boosting system reliability and scalability.\n• Maintained serverless functions on **AWS Lambda** to execute tasks efficiently with minimal resource overhead, leading to a **15%** reduction in operational costs.\n• Developed infrastructure to support model inference APIs, ensuring high availability and performance across multiple services.\n• Conducted testing strategies across project stacks utilizing frameworks like **Postman** and **PyTest**, significantly enhancing test coverage rates by **50%**."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Develop and maintain scalable architecture for high-traffic applications using **FastAPI** and **React (18)**, ensuring smooth functionality and user experience.\nLeverage **CI/CD** methodologies to streamline development and deployment processes, enhancing delivery efficiency by **30%**.\nDesign and implement containerized applications with **Docker**, orchestrating them using **AWS ECS** and **Fargate** for optimal resource management.\nUtilize **Python** for building robust machine learning (ML) solutions, focusing on **NLP** and data processing to extract valuable insights from unstructured data.\nCreate and manage model inference APIs to facilitate seamless integration of ML models into existing backend services, reducing latency by **15%**.\nCollaborate with cross-functional teams to establish a unified development approach, ensuring adherence to best practices in coding and architecture.\nConduct regular code reviews and maintain documentation to promote team knowledge sharing and adhere to coding standards.\nImplement monitoring and logging solutions for applications deployed on **AWS**, improving system reliability and performance metrics visibility by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Focused on designing and optimizing scalable architecture for backend services using **Python** with **FastAPI**, ensuring high availability and low latency performance in key modules.\nDeveloped model inference APIs and integrated AI/ML solutions for real-time data processing, enhancing user experience and system responsiveness across the platform.\nLeveraged **AWS** infrastructure including **ECS** and **Fargate** for deploying applications, optimizing resource allocation, and ensuring reliable service delivery.\nImplemented CI/CD pipelines to facilitate seamless deployment and version control, significantly improving development workflow and reducing deployment time by **30%**.\nUtilized **Docker** for containerization of applications, ensuring consistent environments from development to production.\nEngineered robust data processing capabilities, applying best practices for handling and analyzing large volumes of data to support machine learning applications.\nWorked with front-end technologies including **React (18)** to create responsive user interfaces, enhancing user engagement and accessibility.\nCollaborated on features enhancing NLP-driven functionalities, integrating models that personalized user interactions and improved conversion rates by **15%**.\nConducted performance optimization, resulting in a **25%** reduction in load times across user applications and backend services.\nMaintained compliance with security standards, leveraging OAuth 2.0 for secure access control and ensuring data protection in line with regulations.\n"
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI\n\n**Frontend Frameworks:**\n\tReact\n\n**API Technologies:**\n\tmodel inference APIs\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, Fargate\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, NLP, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, CI/CD & Infrastructure as Code",
  "apply_company": "Natobotics"
}