{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Python Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Python Engineer with 10+ years of extensive experience in delivering high-performance software solutions. Proficient in **Python**, **Django**, and **FastAPI** for backend development, along with **RESTful** and **GraphQL** API design to enhance system interoperability. Solid expertise in database management and integration with **PostgreSQL**, **MySQL**, and **MongoDB**, ensuring efficient data handling. Experience in implementing authentication mechanisms using **JWT** and **OAuth2** to secure applications and user data. Skilled in deploying applications on cloud platforms like **AWS S3** and **Google Cloud Storage**, utilizing **Docker** for containerization to streamline deployment workflows.\n\nIn addition to core development skills, adept in CI/CD practices, enabling smooth integration and delivery processes. Brings practical experience in **debugging** and problem-solving, with a track record of building secure and maintainable solutions compliant with industry standards. Known for driving real-world impact through innovative software design and development initiatives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Python Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions leveraging **Python** (FastAPI, Django, Flask) and **RESTful** architecture, ensuring compliance with industry regulations and standards.\n• Developed robust backend services using **PostgreSQL**, **MongoDB**, and **Django ORM** for efficient data storage and retrieval, optimizing data interactions for healthcare and finance sectors with a focus on performance.\n• Utilized **Docker** for containerization and implemented CI/CD practices, leading to faster deployment cycles and enhanced reliability across **multiple environments**.\n• Built and integrated secure APIs using **JWT** and **OAuth2**, enhancing authentication for client-facing applications and ensuring secure data transactions.\n• Collaborated on architectural decisions to create microservices using industry-standard practices, ensuring **high availability** and fault tolerance in production environments.\n• Established data workflows for analytics using **SQLAlchemy**, embedding complex data queries and transformation logic to improve operational KPIs.\n• Employed debugging techniques and advanced problem-solving skills to enhance application performance, reducing runtime errors by **up to 25%**.\n• Participated in Agile development methodologies, contributing to sprint planning and retrospectives to continuously improve team efficiency and output.\n• Led the integration of payment solutions like **Stripe** and **PayPal**, significantly streamlining transaction processes in web applications, achieving **100% reliability** in payment processing.\n• Provided mentorship and guidance to junior engineers, fostering knowledge sharing and improving team capabilities in modern software practices. \n• Maintained comprehensive documentation for all services built, ensuring clarity and technical guidance for future development and maintenance."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Utilized **Python**, **FastAPI**, and **Django** to lead the development of scalable and maintainable financial platforms, enhancing system throughput for high-volume transactions by over **30%**.\nEmployed **Flask** for creating RESTful and GraphQL APIs, ensuring secure authentication through **JWT** and **OAuth2**, improving user access management for over **100,000** users.\nWorked with **PostgreSQL** and **MongoDB** to design data models that optimize storage and retrieval, achieving a reduction in query response time by **25%**.\nImplemented containerization using **Docker** for application deployment, establishing a CI/CD pipeline that decreased deployment times from hours to mere **minutes**.\nApplied problem-solving skills to debug complex issues across the tech stack, leading to a **40%** decrease in bug resolution time and improved system reliability.\nCollaborated with cross-functional teams on integrating payment gateways such as **Stripe** and **PayPal**, which increased customer transactions by **50%** in the first quarter post-implementation.\nLeveraged **AWS S3** and **Google Cloud Storage** for efficient data storage solutions, ensuring compliance with data security regulations for handling sensitive financial information.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "• Developed and optimized backend services for a global e-commerce platform using **Python** (Django, FastAPI) and RESTful APIs, achieving **99.9%** uptime across crucial modules like checkout and order fulfillment.\n• Implemented secure user authentication and authorization using **JWT** and **OAuth2**, enhancing user data protection and ensuring compliance with GDPR standards.\n• Engineered efficient data handling and retrieval through integrations with **PostgreSQL** and **MongoDB**, capable of processing over **10,000** transactions per minute.\n• Led secure payment processing by integrating Stripe and PayPal, ensuring PCI compliance and managing sensitive data transactions with encrypted tokens.\n• Employed **Docker** for containerization and **CI/CD** practices, ensuring seamless deployment processes and reducing application downtime during updates.\n• Spearheaded debugging and problem-solving efforts that reduced incident response time by **30%**, while also streamlining issue resolution processes on the backend.\n• Collaborated with cross-functional teams to design and implement features using **Flask**, creating RESTful services that improved system scalability and responsiveness.\n• Established robust data handling protocols using **SQLAlchemy** and **Django ORM**, optimizing query performance and ensuring data integrity.\n• Maintained version control and collaborative coding standards through **Git**, facilitating teamwork and code quality improvements across the development team."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tRESTful, GraphQL, JWT, OAuth2\n\n**Serverless and Cloud Functions:**\n\tAWS S3, Google Cloud Storage, Firebase, OneSignal\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB\n\n**DevOps:**\n\tDocker, Git, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tArtificial Intelligence & Machine Learning (MLflow, Airflow, Kubeflow), Debugging, Problem-solving, Stripe, PayPal, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, Redis, Terraform, Ansible, Helm, Docker Compose, GitHub Actions, GitLab CI/CD",
  "apply_company": "Digital Smarthands Inc."
}