{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior QA Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Results-driven Senior QA Engineer with 13+ years of experience in delivering high-performance applications and robust testing frameworks. Proficient in **Python**, **JavaScript**, **REST API**, and experienced in testing tools such as **PyTest**, **Playwright**, and **TestRail**. Demonstrated expertise in leveraging **Azure Pipelines** and **Azure DevOps** for continuous integration and delivery, ensuring high software quality through consistent testing practices.\nStrong background in project management tools like **Jira** and version control with **Git**, complemented by hands-on experience utilizing **Active Directory**, **Cosmos DB**, and **MongoDB** for comprehensive testing environments.\nCommitted to aligning testing strategies with industry standards and compliance requirements, focusing on improving scalability and reliability of applications while utilizing tools like **Datadog** for monitoring and performance optimization. Adept at collaborating with cross-functional teams to deliver seamless software solutions in the healthcare and financial sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior QA Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed and executed comprehensive testing strategies using **PyTest** and **Playwright** to ensure high-quality deliverables across various platforms.\n- Created automated test cases for **REST API** endpoints and full-stack applications, utilizing tools such as **Git** and **Azure DevOps** for efficient version control and integration.\n- Collaborated with cross-functional teams to identify and document test requirements using **Jira** and **TestRail**, ensuring alignment with project goals and timelines.\n- Implemented continuous testing practices within **Azure Pipelines** to facilitate rapid feedback loops, achieving a reduction in bug detection time by **30%**.\n- Led performance testing initiatives using **Datadog**, focusing on API response times and system reliability under high load conditions, managing scalability testing for **8+** different deployment environments.\n- Conducted manual and automated testing of databases leveraging **MongoDB** and **Cosmos DB**, ensuring data integrity and optimal performance across multiple use cases.\n- Ensured compliance with security standards by participating in review sessions for Active Directory configurations and user access management.\n- Participated in sprint planning and retrospective meetings, using agile methodologies to prioritize testing efforts and enhance team collaboration and responsiveness.\n- Provided actionable insights and recommendations based on testing outcomes to improve development processes and reduce regression rates by **25%**.\n- Engaged in continuous learning and improvement of testing tools and practices to adapt to new technologies and methodologies within the QA landscape."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Ensured high-quality software delivery by developing automated testing frameworks using **Python** and **JavaScript**, enhancing test coverage for various applications.\nExecuted comprehensive test plans for REST APIs, utilizing tools like **PyTest** and **Playwright** to validate functionality and performance.\nCollaborated with development teams through **Azure DevOps** to integrate testing into continuous integration/continuous deployment (CI/CD) pipelines, resulting in a **30%** decrease in release cycle time.\nUtilized **Datadog** for monitoring application performance and error tracking, leading to a **25%** improvement in issue resolution times.\nManaged test case documentation and tracking through **TestRail** and **Jira**, enhancing team visibility and accountability in quality assurance processes.\nConducted API testing and performance validation with automated scripts, ensuring compliance with specifications and reducing manual testing efforts by **40%**.\nParticipated in code reviews and provided feedback to developers, fostering a culture of quality and accountability within the agile team environment.\nMaintained effective communication with team members in the **Azure Pipelines** environment to ensure the timely execution and reporting of tests, contributing to overall project success."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed and executed comprehensive test strategies for backend services developed in **Python** (FastAPI, Django) and **JavaScript** (Node.js, NestJS, Express), utilizing **PyTest** and **Playwright** for automated testing to ensure high quality and performance across all modules.\nImplemented end-to-end testing frameworks for real-time features built with **WebSockets** and event-driven architecture, leveraging **Kafka** and **RabbitMQ** to validate order updates and inventory tracking effectiveness.\nConducted performance testing for frontend applications using **React** (18), **Vue 3**, and **Angular**, ensuring compliance with **WCAG 2.1** for accessibility, and optimizing user experiences across both web and mobile platforms.\nExecuted database testing and validation with **MongoDB**, **PostgreSQL**, and **Cassandra**, ensuring data integrity and fast access for high-traffic e-commerce workflows, while caching frequent queries with **Redis**.\nUtilized **REST API** testing to ensure seamless integration of AI/ML-based recommendation engines powered by **scikit-learn**, **TensorFlow**, and **LightGBM**, contributing to enhanced search relevance and improved conversion rates.\nManaged CI/CD pipelines using **Azure Pipelines** for automated deployment testing, incorporating **Azure DevOps** with **Git** for version control, ensuring efficient deployment cycles and reliable release management.\nCreated comprehensive test documentation in **TestRail** and coordinated with cross-functional teams using **Jira** to enhance collaboration and track project progress in aligning with quality standards.\nMonitored application performance and health using **Datadog**, providing insights into potential issues during transaction processing with payment gateways including **Stripe**, **PayPal**, and **Razorpay**.\nEnsured proper access control through role-based access control (RBAC) and **OAuth 2.0**, validating compliance with **GDPR** guidelines in data security and user privacy protocols."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tREST API\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda, ECS\n\n**Cloud & Infrastructure:**\n\tAzure: App Services, Blob Storage, SQL Database\n\tAzure DevOps, GitHub Actions, GitLab CI/CD\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis, Cosmos DB\n\n**DevOps:**\n\tDocker, Kubernetes\n\tCI/CD & Infrastructure as Code: Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tPyTest, Playwright, TestRail, Jira, Active Directory, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Datadog",
  "apply_company": "One Identity"
}