{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Sales Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "With a strong foundation in **Technical Sales** and **Communication**, I am a seasoned professional with 8 years of experience in engaging clients and driving market strategies across sectors. My expertise in **Market Segmentation** and **Pricing Strategy** empowers teams to effectively position innovative full-stack solutions tailored to client needs. As a Full Stack Developer, I bring a robust technical background, proficiently utilizing **JavaScript**, **TypeScript**, **Python**, and **Flutter** for seamless development across diverse platforms.\nI have hands-on experience with modern frameworks including **React**, **Next.js**, **Vue**, and backend technologies such as **Node.js**, **FastAPI**, and **Django**. My deep cloud experience spans **Azure** and **AWS**, driving deployment efficiency and scalability. I've led the design of enterprise-grade platforms that incorporate AI/ML capabilities, enhancing predictive analytics and automation.\nCommitted to compliance, I have implemented applications that adhere to standards like HIPAA, FHIR, PCI DSS, and SOC 2, alongside a strong proficiency in microservices architecture and CI/CD automation. I also possess experience in developing machine learning pipelines and MLOps workflows using tools like **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized strong **communication** skills to present complex technical solutions, ensuring clarity for both technical and non-technical audiences during sales presentations and discussions.\nCollaborated effectively within cross-functional teams, employing **teamwork** to align technical solutions with customer requirements, resulting in increased customer satisfaction and a 20% uptick in sales conversions.\nConducted comprehensive **market segmentation** analyses to identify potential clients for tailored sales strategies, directly contributing to a 15% increase in targeted lead generation.\nDeveloped and executed **pricing strategies** that enhanced product offerings, balancing technical capabilities and market demands, which increased profit margins by 10% in competitive segments.\nLeveraged **MS Office** for creating impactful sales proposals, reports, and presentations, streamlining the documentation process and improving team productivity by 30%.\nProvided **technical sales** support by explaining complex product features, benefits, and integrations to prospective clients, enhancing understanding and interest in customized solutions.\nUtilized insights from engineering practices to inform sales strategies and approach, strengthening the connection between customer needs and product capabilities.\nOptimized sales performance through the use of CRM tools and sales analytics, resulting in enhanced tracking of leads and a 25% improvement in follow-up efficiency.\nMaintained up-to-date knowledge of industry trends and emerging technologies to inform customers of innovations and enhance competitive positioning.\nRegularly trained and mentored junior sales associates on technical product features, enhancing their pitch effectiveness and contributing to overall team success."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized strong **communication** skills to present technical solutions to clients, effectively bridging the gap between sales and engineering teams, resulting in a **30%** increase in customer satisfaction ratings.\nConducted detailed **market segmentation** analysis to identify opportunities, developing tailored **pricing strategies** that contributed to a **15%** increase in sales.\nCollaborated with cross-functional teams, demonstrating exceptional **teamwork** to ensure successful project delivery, improving project turnaround time by **25%**.\nLeveraged technical expertise in **MS Office** for data analysis and presentation, creating compelling reports that informed executive decisions and strategic directions.\nEnhanced client engagement through proactive **technical sales** approaches, explaining product functionalities and benefits, which led to securing **5 new contracts** in the first quarter.\nDeveloped and implemented marketing strategies tailored to target audiences, utilizing insights gained from comprehensive market research to improve lead generation.\nTrained and mentored junior sales engineers, fostering a collaborative environment that emphasized shared knowledge and skills development, which improved team performance.\nApplied engineering principles to troubleshoot client issues, ensuring timely resolutions and maintaining a strong support relationship, reducing issue resolution time by **40%**."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Applied technical sales expertise to deliver high-quality backend services for a global e-commerce platform, enhancing sales support with robust solutions in **Python** (FastAPI, Django) and **Node.js** (NestJS, Express).\nUtilized advanced communication strategies to collaborate with cross-functional teams, ensuring alignment on sales tactics that leverage engineering insights for better customer engagement.\nDesigned intuitive user experience frameworks that support market segmentation strategies using **React** (18), **Vue 3**, and **Angular**, achieving over **95%** user satisfaction on key product features.\nImplemented competitive pricing strategies informed by data analytics, leveraging **MongoDB**, **PostgreSQL**, **Redis**, and **Cassandra** for streamlined data access, improving sales performance metrics by **30%** year-over-year.\nParticipated in team-oriented projects to develop AI/ML-driven sales tools with **scikit-learn**, **LightGBM**, and **TensorFlow** that enhanced pricing strategies and market analysis, resulting in a **40%** increase in targeted lead conversions.\nCollaborated on technical sales presentations using **MS Office** tools, highlighting innovative features such as Redis caching for real-time application responsiveness which reduced latency by **50%**. \nConducted training sessions on market trends and product features, enhancing team knowledge and fostering a spirit of teamwork and shared success, achieving **100%** team engagement in quarterly reviews.\nHelped in managing customer relationships through application of role-based access control (RBAC), ensuring secure onboarding processes and user data protection, aligning with GDPR compliance.\nEngaged with high-impact technical sales initiatives that integrated secure payment solutions utilizing **Stripe**, **PayPal**, and **Razorpay**, ensuring PCI compliance and enhancing customer trust in the platform.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript, TypeScript\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n **API Technologies:**\n\t\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\t\n\n **Other:**\n\tSales, Marketing, Market Segmentation, Pricing Strategy, Technical Sales, Communication, Teamwork, MS Office, Engineering, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "Atlas Copco"
}