{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Driven Senior Engineer with 13+ years of full-stack web application development experience, specializing in **React**, **TypeScript**, **Next.js**, and **Python**. Proficient in modern web technologies including **SCSS**, **REST**, and **GraphQL**, with a track record of successful CI/CD practices utilizing **GitHub Actions**. Experienced in deploying applications on cloud platforms such as **AWS**, enhancing performance and scalability.\n\nDemonstrated ability in A/B testing, debugging, and collaborative problem-solving within cross-functional teams. Adept at integrating compliance-driven development aligning solutions with industry standards like HIPAA and PCI DSS. Strong background in AI/ML initiatives and MLOps, with hands-on expertise in utilizing tools like **MLflow**, **Airflow**, and **Kubeflow** for advanced data processing.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed and maintained **full-stack web applications** utilizing **React (17-18)**, **TypeScript**, and **Next.js**, ensuring high-quality user experiences and seamless interactions.\n• Implemented robust **CI/CD** pipelines through **GitHub Actions**, enhancing deployment processes for consistent performance and rapid delivery.\n• Engineered state management solutions in applications using **REST** and **GraphQL**, optimizing data retrieval and integration.\n• Collaborated with cross-functional teams to brainstorm innovative solutions, employing effective **problem-solving** techniques to overcome technical challenges.\n• Enhanced application styling and responsiveness with **SCSS**, achieving a cohesive look and feel across devices.\n• Analyzed user feedback and conducted **A/B testing** strategies to refine product features, boost engagement, and achieve a **15% increase** in user interaction metrics.\n• Drove debugging efforts across the tech stack, identifying and resolving issues swiftly to maintain optimal application functionality.\n• Spearheaded collaborations with backend teams to ensure **Python** services were seamlessly integrated with frontend frameworks, improving overall system efficiency.\n• Championed best practices in code quality and documentation, promoting a collaborative environment focused on continuous improvement.\n• Developed comprehensive test strategies leveraging tools like Jest and Cypress, covering **100%** of critical paths through unit, integration, and E2E tests."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed full-stack web applications utilizing **React** (18), **Next.js**, **TypeScript**, and **SCSS**, creating immersive user experiences while enhancing performance and maintainability.\n• Implemented robust RESTful and GraphQL APIs with **Python** (FastAPI, Django) to support seamless data interactions and improve application responsiveness.\n• Employed **CI/CD** practices using **GitHub Actions** to automate deployment processes, reducing delivery times by **30%** and minimizing downtime.\n• Collaborated cross-functionally to solve complex problems and ensure alignment on project goals, leveraging teamwork and communication skills effectively.\n• Executed A/B testing strategies to optimize user interfaces and increase engagement, resulting in an average conversion rate increase of **15%**.\n• Capitalized on cloud services including **AWS** to scale applications efficiently, improving system reliability and reducing operational costs.\n• Demonstrated exceptional debugging skills by resolving critical issues in production environments, enhancing system stability and user satisfaction.\n• Led initiatives for continuous improvement in development processes, fostering a culture of innovation and excellence across teams."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **React (18)**, **TypeScript**, and **Next.js** to design and develop full-stack web applications, ensuring responsive user interfaces and optimized performance for end-users.\nExpertly implemented **REST** and **GraphQL** APIs to streamline communication between frontend and backend systems, enhancing overall application efficiency.\nApplied **CI/CD** practices using **GitHub Actions** to automate deployment processes, improving code quality and reducing deployment times by **30%**.\nCollaborated with cross-functional teams to address complex problems, fostering an environment of innovation and technical excellence while enhancing product features based on user feedback.\nImplemented **AWS** services for hosting and scaling applications in a cloud environment, contributing to a more versatile and cost-effective infrastructure for the platform.\nProficiently debugged issues across the tech stack, leveraging analytical and problem-solving skills to improve application reliability and user satisfaction.\nEngineered reusable and maintainable components using **SCSS**, optimizing stylesheets for faster load times and a more efficient development process.\nOversaw integration and testing of new features, applying A/B testing strategies to refine user experiences and validate design choices based on analytics data.\nLed team discussions to share knowledge and best practices in **debugging** and **collaboration**, thereby increasing team efficiency and project alignment."
    }
  ],
  "skills": "**Frontend Frameworks:**\n\tReact, Next.js, TypeScript, SCSS\n\n**Programming Languages:**\n\tPython\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tREST, GraphQL\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, A/B testing, problem solving, collaboration, debugging, Authentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot"
}