{
  "name": "Rei Taro",
  "role_name": "Senior DevOps Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Skilled Senior DevOps Engineer with over 10 years of experience managing cloud-native architectures and backend systems, specifically in financial platforms and AI/ML pipelines. Proficient in **AWS**, **Terraform**, **Docker**, **Kubernetes**, and robust CI/CD practices, I excel in building scalable services and high-performing APIs. My background includes a strong focus on performance profiling, software architecture, and design patterns, complemented by original strengths in communication and collaboration. I have made notable contributions to projects at prestigious organizations like VISA, Sii Poland, and Reply Polska, driving innovation and efficiency.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Designed and implemented CI/CD pipelines to enhance deployment efficiency and reliability by **30%**.\nUtilized **Docker** and **Kubernetes** for container orchestration, ensuring a flexible and scalable microservices architecture across **5** active projects.\nManaged infrastructure as code using **Terraform**, enabling automated deployment across multiple cloud environments, including **AWS** and **Azure**.\nConducted performance profiling to optimize system performance, achieving a **20%** reduction in latency for critical applications.\nCollaborated closely with cross-functional teams to improve software architecture and design patterns, driving the successful release of **3** major software updates.\nIntegrated AI productivity tools and Large Language Models to innovate solutions in document automation and user onboarding.\nLed initiatives for secure application development, assessing security measures within a **10%** timeframe to ensure compliance with industry standards."
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "- Leveraged **Terraform** for infrastructure automation, ensuring consistent deployments across **AWS** and **Azure** environments while enhancing CI/CD practices for a 30% faster deployment pipeline.\n- Utilized **Docker** and **Kubernetes** for container orchestration, optimizing resource management and achieving a 25% reduction in infrastructure costs.\n- Designed and implemented performance profiling strategies for microservices, leading to a 15% increase in application efficiency and lowered latency.\n- Collaborated on the integration of **Large Language Models** and **Computer Vision** technologies, helping improve application capabilities and user experience by 20%.\n- Engaged in cross-functional collaboration, fostering communication between teams, resulting in successful project implementations and a 95% compliance rate with regulatory standards.\n- Engineered solutions following software architecture principles and design patterns, enabling scalable and maintainable code across projects.\n- Conducted security audits and integrated **OAuth2** and **Azure AD B2C**, ensuring robust authentication measures and reducing security vulnerabilities by 40%."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "• Developed and maintained CI/CD pipelines utilizing **Terraform**, **Docker**, and **AWS**, facilitating seamless integration and deployment cycles across **9** projects.\n• Collaborated with development teams to implement performance profiling techniques and design patterns, improving system performance by **30%**.\n• Engaged in cross-functional communication to ensure effective collaboration between teams, leading to a **25%** quicker project turnaround.\n• Leveraged **Kubernetes** for container orchestration, managing over **15** microservices with high availability and scalability.\n• Ensured robust software architecture for critical applications, adhering to industry best practices and regulatory standards.\n• Employed large language models and vision-language models to enhance AI productivity tools, increasing user efficiency by **40%**.\n• Implemented robust Linux server environments for hosting applications, ensuring optimal performance and reliability.\n• Utilized advanced data structures to optimize backend functionalities, driving efficiency and throughput in system design.\n• Achieved AWS certification, demonstrating proficiency in cloud services and enhancing the organization's cloud strategy."
    }
  ],
  "skills": " **Programming Languages**\n\tPython (3.8+), SQL, Bash, JavaScript\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**API Technologies**\n\tREST/gRPC APIs, Microservices\n\n**Serverless and Cloud Functions**\n\tAWS (EC2, S3, Lambda), Azure\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Cloud & Infrastructure**\n\tAWS certification, Terraform, Linux\n\n**Other**\n\tperformance profiling, design patterns, data structures, software architecture, communication, collaboration, Large Language Models, Computer Vision, Vision-Language Models, AI productivity tools, Kafka, PyTest, Git, Airflow, MLflow",
  "apply_company": "SQUAD"
}