{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Senior Software Engineer with 13+ years of experience specializing in Python and SQL, effectively implementing ETL processes and managing data modeling initiatives. Proficient in **Airflow** for orchestrating workflows and streamlining data pipelines. Expertise in building robust APIs and leveraging relational databases along with advanced techniques in data warehousing and **columnar storage**.\nWell-versed in automated testing to ensure high-quality deliverables, and experienced in **Lean/Agile methodologies** to foster team collaboration and enhance product development cycles. Strong aptitude for critical thinking and problem-solving, combined with excellent communication skills and the ability to empathize and listen actively to team members and stakeholders.\nAdditionally, I have hands-on experience with **JavaScript/TypeScript**, **Flutter**, **React**, **Next.js**, **Vue**, and backend frameworks like **Node.js**, **FastAPI**, and **Django**, allowing for full-stack development capabilities. My background includes delivering high-performance applications across the healthcare and financial industries, with a commitment to compliance-driven development aligned with industry standards such as HIPAA, FHIR, PCI DSS, and SOC 2.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed robust ETL processes using **Python** and **Airflow** to facilitate seamless data integration and processing across various systems, ensuring timely and accurate data availability for analysis.\n• Leveraged **SQL** for complex data modeling and query optimization in relational databases, including PostgreSQL and MongoDB, achieving a **30%** increase in data retrieval efficiency.\n• Designed and implemented APIs that enable data access and real-time interactions across platforms, ensuring adherence to best practices for scalability and security.\n• Built efficient data warehousing solutions with a focus on **Columnar Storage** strategies, improving-read accessibility for analytics workloads by **25%**.\n• Collaborated on team projects utilizing **Lean/Agile Methodologies**, enhancing project delivery speed by maintaining effective communication and teamwork across diverse groups.\n• Executed automated testing frameworks for data pipelines, ensuring high-quality standards and reducing incident response time by **15%** through consistent validation.\n• Applied critical thinking and problem-solving to address data-related challenges, fostering an environment of innovation and empathy during team discussions.\n• Engaged in active listening during stakeholder meetings to ensure requirements were accurately captured and articulated in the software development cycle, bolstering client satisfaction.\n• Enhanced data visualization capabilities using advanced tools, improving business insights and decision-making processes, resulting in more informed strategic direction for business units."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed and maintained ETL processes using **Python**, **Apache Airflow**, and **DBT** for efficient data ingestion and transformation, ensuring timely and accurate reporting across various financial platforms.\n• Architected relational databases and implemented data warehousing solutions with **SQL** to enhance data accessibility and leverage **Columnar Storage** for performance optimization, improving query speed by **40%**.\n• Collaborated with cross-functional teams to design APIs that facilitate seamless integration between microservices, contributing to the agile development process and fostering team collaboration in line with Lean/Agile methodologies.\n• Created data models to support analytical and operational reporting, leveraging critical thinking to ensure data integrity and relevance, resulting in enhanced decision-making across departments.\n• Implemented automated testing frameworks to ensure code quality and performance, significantly reducing bug rates in production environments by **30%** through rigorous testing protocols.\n• Employed in-memory databases for rapid data retrieval and processing, achieving a **50%** reduction in latency for end-user applications.\n• Developed comprehensive documentation and communicated complex technical concepts effectively to stakeholders, enhancing team empathy and active listening across all levels of the organization.\n• Led initiatives to cultivate a culture of continuous improvement and shared learning within the team, driving overall project efficiency and team morale."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and optimized robust **ETL** processes using **Airflow** for seamless data integration, ensuring high data accuracy and timely delivery across **SQL** databases and **data warehousing** solutions.\n• Designed and implemented **APIs** to facilitate smooth data access and interaction between services, promoting efficient communication and collaboration across teams.\n• Engaged in **data modeling**, using **DBT** to structure and transform large datasets, enabling insightful analytics and reporting for various stakeholders in the organization.\n• Collaborated with cross-functional teams, leveraging **Lean/Agile methodologies** to enhance project delivery and encourage continuous improvement in processes and software development cycles.\n• Conducted regular **automated testing** to ensure the integrity and performance of code, contributing to a more efficient development cycle and reducing bug rates by up to **30%**.\n• Utilized **Python** for scripting and data manipulation, enhancing data processing capabilities and ensuring efficient handling of large-scale data operations.\n• Implemented **in-memory databases** for optimized data retrieval and improved application performance, achieving a **50%** reduction in data processing times.\n• Employed **relational databases** for structured data storage, ensuring fast and reliable access to critical data for various applications.\n• Actively communicated with team members and stakeholders to gather requirements, provide updates, and ensure alignment on project goals, fostering a collaborative work environment.\n• Demonstrated critical thinking and problem-solving skills to tackle complex issues, improving overall system efficiency and user satisfaction.\n• Applied active listening and empathy to understand team dynamics and user needs, contributing to a supportive and productive team culture."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython,\n\tJavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI,\n\tFlask,\n\tDjango\n\n**Frontend Frameworks:**\n\tReact,\n\tVue,\n\tAngular\n\n**API Technologies:**\n\tAPIs\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda,\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL (Fintech),\n\tMySQL (Healthcare),\n\tMongoDB (Gaming),\n\tRedis,\n\tSQL,\n\tRelational Databases,\n\tIn-Memory Databases\n\n**DevOps:**\n\tDocker,\n\tKubernetes,\n\tGitHub Actions,\n\tGitLab CI/CD,\n\tTerraform,\n\tAnsible,\n\tHelm,\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: RDS, S3,\n\tAzure: Blob Storage,\n\tSQL Database\n\n**Other:**\n\tMLflow,\n\tData Modeling,\n\tAirflow,\n\tDBT,\n\tETL,\n\tData Warehousing,\n\tColumnar Storage,\n\tAutomated Testing,\n\tLean/Agile Methodologies,\n\tTeam Collaboration,\n\tCommunication Skills,\n\tCritical Thinking,\n\tEmpathy,\n\tActive Listening"
}