{
  "name": "Damian Franciszek Pospiech",
  "role_name": "L1 Cloud Operations Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Proficient in **AWS**, **GCP**, and **Infrastructure as Code** tools such as **Terraform** and **CloudFormation**, with 13+ years of full stack development experience. Expertise in **Kubernetes**, **Git**, and cloud management consoles drives efficient deployment and management of cloud-native systems. Skilled in implementing **observability** tools including **Prometheus** and **Grafana** to enhance system performance and reliability.\nVersatile programming abilities in **JavaScript/TypeScript** and **Python**, complemented by comprehensive knowledge of development frameworks like **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. Experienced in building AI/ML-powered platforms for predictive analytics, automation, and real-time processing. Strong background in compliance-driven environments, aligning solutions with standards such as HIPAA, FHIR, PCI DSS, and SOC 2. Familiar with MLOps strategies, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "L1 Cloud Operations Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Managed cloud infrastructure utilizing **AWS** and **GCP**, focusing on **Infrastructure as Code** methodologies employing **Terraform** and **CloudFormation** for efficient resource provisioning.\nImplemented robust observability solutions using **Prometheus** and **Grafana** for monitoring cloud services, ensuring optimal performance and uptime metrics tracking with alerts via **PagerDuty**.\nCollaborated with development teams using **Git**, **GitHub**, and **GitLab** for version control and CI/CD workflows, ensuring seamless integration of code changes across environments.\nSupported cloud management consoles for real-time resource visualization and management, handling environments with **Kubernetes** for orchestration of containerized applications.\nStrengthened network configurations and security protocols within cloud environments to enhance data protection and compliance, focusing on resilience in service availability.\nTransformed legacy systems by migrating to containerized services on **Kubernetes**, implementing best practices in resource management for improved scalability.\nExecuted deployment automation for applications using CI/CD pipelines integrated with **GitHub Actions** and **GitLab CI**, achieving efficiency improvements of up to **30%** in deployment times.\nStreamlined support processes by integrating tools such as **Freshdesk** and **Zendesk** into cloud operations for enhanced customer relations and issue tracking.\nDeveloped procedural documentation and training resources for operational teams addressing best practices in **Linux** system management and cloud operations.\nMaintained high standards of system reliability with uptime commitments exceeding **99.9%**, essential for mission-critical applications in both healthcare and finance sectors."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **AWS** and **GCP** to ensure efficient management of cloud infrastructure, leveraging **Infrastructure as Code** tools such as **Terraform** and **CloudFormation** for streamlined deployments and configurations.\nEmployed **Kubernetes** for orchestrating containerized applications, enhancing scalability and reliability of cloud-native services across environments.\nMaintained version control and collaboration using **Git**, implementing workflows via **GitHub** and **GitLab** to manage code and document changes effectively.\nImplemented **Observability** practices by setting up monitoring solutions with **Prometheus** and **Grafana**, achieving operational excellence and minimizing downtime by **30%**.\nManaged alerts and incident response using **PagerDuty**, ensuring rapid response times and issue resolution, thus improving overall service reliability by **25%**.\nOptimized networking configurations to enhance performance and reduce latency in cloud services, ensuring seamless connectivity for applications and users.\nConfigured and supported **CRM Systems** including **Freshdesk** and **Zendesk** to improve customer support interactions and aid in troubleshooting across IT operations.\nDeveloped automation scripts in **Python** and integrated them with existing frameworks to streamline operational tasks and improve efficiency by **40%**.\nEngaged in continuous learning and application of **Linux** principles to automate processes and manage servers effectively, contributing to operational stability."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Managed and optimized cloud infrastructure on **AWS** and **GCP**, ensuring high availability and performance aligned with organizational objectives.\nUtilized **Terraform** and **CloudFormation** for Infrastructure as Code (IaC) practices, automating deployment processes by **90%**, and streamlining infrastructure management.\nDeployed container orchestration using **Kubernetes**, enhancing scalability and reliability, reducing application downtime by **40%**.\nImplemented observability solutions using **Prometheus** and **Grafana**, ensuring a proactive approach to monitoring, resulting in a **30%** reduction in incident response times.\nUtilized **Git**, **GitHub**, and **GitLab** for version control and collaboration, achieving seamless integration and continuous delivery across projects.\nConfigured and maintained **Linux** environments to support backend services, leveraging the command line for efficiency and productivity improvements.\nProvided support for CRM Systems including **Freshdesk** and **Zendesk**, integrating customer service workflows to improve response times by **50%**.\nManaged networking components and cloud management consoles for secure access and resource optimization, implementing role-based access controls with **Git** and **OAuth 2.0** standards.\nOptimized cloud resource usage, maintaining monthly operating costs under **$5,000** while ensuring compliance and efficient use of resources across cloud platforms.\nActively participated in incident management using **PagerDuty**, improving issue resolution efficiency and maintaining SLA commitments."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tOAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS Lambda\n\n**Cloud & Infrastructure:**\n\tAWS, GCP, Azure, Kubernetes, Infrastructure as Code, CloudFormation, Cloud Management Consoles, Networking, Linux\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Git, GitHub, GitLab, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose, Prometheus, Grafana, PagerDuty\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Nginx, Let’s Encrypt, Certbot, CRM Systems, Freshdesk, Zendesk"
}