{
  "name": "Patryk Zaslawski",
  "role_name": "Software Engineer (C++ and C#)",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a dedicated Software Engineer with 8+ years of experience, I excel in **C++** and **C#**, leveraging Object-Oriented Programming and Design Patterns to develop robust software solutions. My expertise in **Microsoft Visual Studio** and the **.NET Framework** enables me to create high-quality applications effectively. Proficient in Agile methodologies and Scrum, I am committed to continuous learning and improving team dynamics through effective communication and problem-solving skills. Additionally, I possess experience in XML and XSLT, complemented by a solid foundation in **Python** frameworks such as **FastAPI**, **Django**, and **Flask**. I have a track record of building secure, scalable applications tailored to the financial, healthcare, and e-commerce sectors while adhering to industry best practices.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer (C++ and C#)",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Utilized **C++** and **C#** to implement Object-Oriented Programming principles and design patterns, ensuring robust software development practices in line with Agile and Scrum methodologies.\nDeveloped unit tests to validate code functionality and reliability, enhancing overall software quality and performance.\nApplied effective communication skills to collaborate within a cross-functional team, ensuring successful project delivery and alignment with business objectives.\nEngaged in continuous learning to stay current with industry advancements, integrating best practices into ongoing projects to optimize performance and user experience.\nUtilized **Microsoft Visual Studio** and the **.NET Framework** for application development, ensuring adherence to coding standards and guidelines.\nLeveraged **XML** and **XSLT** for effective data manipulation and business logic integration, leading to enhanced application features and user satisfaction.\nImplemented design patterns to create scalable and maintainable software architecture, improving code reuse and efficiency across the development lifecycle.\nParticipated in code reviews and team meetings, contributing to a collaborative environment that emphasizes knowledge sharing and problem-solving."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Applied **C++** and **C#** expertise to develop efficient back-end applications, employing **Object-Oriented Programming** principles and **Design Patterns** for optimal code structure and maintainability.\n• Utilized **Microsoft Visual Studio** to create and debug software solutions, enhancing productivity and collaboration within **Agile** and **Scrum** environments.\n• Conducted comprehensive **Unit Testing** and implemented automated testing approaches to ensure code quality and application reliability.\n• Collaborated with cross-functional teams, demonstrating effective communication skills and problem-solving abilities to deliver timely software solutions.\n• Facilitated continuous learning and adaptation of new technologies, contributing to team knowledge and project advancement.\n• Enhanced existing applications by integrating modular components, ensuring the overall architecture is robust and scalable.\n• Mentored junior developers on best practices in **C++** and **C#**, sharing knowledge on **XML**, **XSLT**, and design strategies.\n• Managed project documentation and code repositories, ensuring clear communication of system designs and updates among stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **C++** and **C#** to design and develop scalable and maintainable software solutions, adhering to **Object-Oriented Programming** principles and leveraging **Design Patterns** for effective system architecture.\nCollaborated within an **Agile** environment, participating in **Scrum** ceremonies to ensure timely delivery and alignment with project objectives.\nImplemented comprehensive **Unit Testing** strategies to maintain code quality, reducing bug rates by **30%** through diligent testing practices.\nEngaged in effective communication with cross-functional teams to gather requirements, present solutions, and support ongoing projects, enhancing collaboration and stakeholder satisfaction.\nAdapted to new technologies and continually enhanced skills through **Continuous Learning**, embracing best practices and emerging trends in software development.\nDeveloped intricate XML and XSLT solutions for data manipulation and integration, streamlining workflows and improving system interoperability.\nLeveraged **Microsoft Visual Studio** and the **.NET Framework** for building robust applications, enhancing deployment efficiency, and ensuring compliance with industry standards.\nFacilitated problem-solving sessions to address technical challenges, improving system performance by **40%** through strategic optimizations.\nMentored junior developers on best practices in **C++** and **C#**, fostering a culture of learning and development within the team.\nUnderstood and analyzed user requirements to deliver high-quality software that meets business needs and enhances user engagement."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, C++, C#, Object-Oriented Programming\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, .NET Framework\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot, Agile, Scrum, XML, XSLT, Unit Testing, Design Patterns, Microsoft Visual Studio, Problem Solving, Effective Communication, Continuous Learning"
}