{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Software Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Results-driven Senior Software Engineer with 8+ years of experience in software development, specializing in **JavaScript**, **Python**, and **Go**. Adept at software verification and documentation processes, ensuring high-quality deliverables. Proven ability to design and implement scalable applications using **FastAPI**, **Django**, and **Flask**, alongside frontend frameworks like **Angular** and **React**. Skilled in leveraging cloud technologies such as **AWS** and **Azure**, as well as optimizing databases like **PostgreSQL** and **MongoDB** for performance. With a strong background in creating enterprise-level solutions, I excel at aligning technical strategies with business goals while staying updated on industry advancements.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "Developed and maintained high-quality software solutions using **Python**, ensuring adherence to best practices in software verification and documentation.\nCreated robust applications by integrating **JavaScript** frameworks such as **React**, improving user interfaces for seamless interacting.\nCollaborated with cross-functional teams to design and implement complex software systems utilizing various programming languages including **C++** and **Ruby**.\nEngineered scalable components for software architectures that leverage AI models and algorithms to enhance functionality and performance.\nConducted rigorous testing protocols, using automated software verification techniques to ensure the reliability of applications and systems.\nAuthored comprehensive documentation detailing software functionalities, usage instructions, and system requirements for end-users and developers.\nSpearheaded code reviews and provided constructive feedback to promote coding best practices and enhance team skill sets.\nImplemented software integration processes with various APIs and services, maximizing software interoperability and functionality.\nMentored junior software developers in programming best practices and in the effective use of **Python** and **JavaScript** technologies.\nParticipated actively in agile development methodologies, contributing to sprint planning, retrospectives, and continuous improvement sessions."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Developed scalable web applications using **JavaScript** frameworks and **Python** to enhance user experience and performance metrics by **30%**.\n• Led software verification processes by implementing automated testing frameworks in **Python**, ensuring over **95%** coverage and reducing bugs in production.\n• Conducted thorough documentation of software architecture and APIs, facilitating easier onboarding and knowledge transfer across teams.\n• Collaborated in a multi-functional team to design and deploy solutions in **Python**, yielding a more structured approach that improved code maintainability.\n• Utilized advanced functionalities and performance optimizations in **JavaScript** to develop user interfaces that supported up to **1,000** simultaneous users without performance degradation.\n• Created documentation for development processes and system integrations, ensuring clarity and ease of maintenance in complex codebases.\n• Implemented and maintained CI/CD pipelines with **Python** and **JavaScript** technologies, ensuring regular software updates without compromising system stability.\n• Developed training materials and engaged in knowledge transfer for best coding practices in **Python** and **JavaScript**, strengthening the team's technical skills."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Developed and maintained scalable backend services using **Python** for high-performance applications, leading to a 30% improvement in user experience.\n• Engineered seamless integrations and APIs utilizing **JavaScript** frameworks, enhancing communication between frontend and backend services.\n• Conducted thorough software verification processes to ensure code quality, reducing bugs by 25% in production environments.\n• Documented and implemented coding standards for a team of 5 developers, improving workflow efficiency and clarity around development processes.\n• Collaborated on microservices architecture utilizing **Python**, ensuring responsive solutions that adhere to client specifications and user needs.\n• Applied best practices in code review and testing, significantly increasing system reliability with automated testing for backend services.\n• Utilized **AI** methodologies to optimize algorithms and enhance functionality across projects, driving innovation in software solutions.\n• Actively participated in team meetings and design reviews to ensure alignment on technical approaches and project goals, contributing to a cohesive development strategy.\n• Engaged with stakeholders to gather requirements and provide updates, ensuring transparency and timely delivery of features.\n• Analyzed performance metrics from deployed applications, achieving an average **40% faster response time** after optimizations.\n• Mentored junior developers in **Python** and **JavaScript**, fostering a culture of growth and learning within the team."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript, Go, C++, Ruby\n\n**Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n**Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**API Technologies:**\n\tREST & gRPC APIs\n\n**Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (App Services, Blob, SQL), Nginx, Certbot\n\n**Other:**\n\tSQLAlchemy, Pydantic, Celery, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, AI, Software Verification, Documentation",
  "apply_company": "Not specified"
}