{
  "name": "Rei Taro",
  "role_name": "Senior Implementation Engineer",
  "email": "rei515@outlook.com",
  "phone": "+48732529451",
  "address": "Warszawa, Poland",
  "linkedin": "https://www.linkedin.com/in/rei-taro-81a410391/",
  "profile_summary": "Results-driven Senior Implementation Engineer with over 10 years of experience in developing and delivering robust backend systems for financial platforms and digital marketing initiatives. Proficient in utilizing **APIs**, **SQL**, and cloud services such as **AWS** and **GCP** to enhance data accessibility and analytics strategies. Strong background in integrating tools like **TealiumIQ**, **Adobe Analytics**, and **Salesforce** to optimize customer engagement and support. Demonstrated expertise in utilizing **JavaScript**, **Workato**, and **Amazon Quicksight** for effective data visualization and process automation. Proven ability to collaborate and communicate effectively with cross-functional teams, contributing to impactful projects at top-tier organizations, including VISA, Sii Poland, and Reply Polska.",
  "education": [
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2010",
      "to_year": "2015",
      "location": "Japan",
      "university": "Keio University"
    }
  ],
  "experience": [
    {
      "role": "Senior Implementation Engineer",
      "company": "Leobit",
      "from_date": "Aug 2022",
      "to_date": "Present",
      "location": "Poland",
      "responsibilities": "Executed integrations of **APIs** for seamless data communication between various systems to enhance digital marketing strategies.\nDeveloped robust solutions utilizing **JavaScript** frameworks to optimize user engagement and improve overall customer support.\nImplemented **SQL** database solutions in compliance with data access protocols to facilitate accurate data retrieval and analysis, improving efficiency by **25%**.\nLeveraged **AWS** and **GCP** for scalable cloud computing solutions, managing deployment processes that resulted in a **20%** reduction in downtime.\nUtilized **TealiumIQ**, **AudienceStream**, and **EventStream** to enhance data management capabilities for targeted marketing, resulting in a **30%** improvement in campaign performance metrics.\nEmployed **AdobeAnalytics** and **GoogleAds** for comprehensive analytics and tracking of digital marketing efforts, enabling real-time optimization based on campaign performance.\nCollaborated with client teams to address and resolve integration challenges, ensuring adherence to compliance standards and successful project delivery within **3 weeks** of the planned timeline.\nUtilized **CharlesProxy** and **BrowserDeveloperTools** for debugging and optimizing web applications, enhancing user experience and reliability.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Innovature",
      "from_date": "Nov 2018",
      "to_date": "Jun 2022",
      "location": "Japan",
      "responsibilities": "• Developed and integrated **APIs** to enhance data access and ensure seamless communication between systems, utilizing **JavaScript** to improve frontend interactions.\n• Managed data flow and streamline workflows with tools like **Salesforce** and **SQL**, achieving a **20%** reduction in processing time for customer support queries.\n• Collaborated with digital marketing teams to implement tracking and analytics using **Adobe Analytics** and optimize campaigns, boosting conversion rates by **15%** through targeted data strategies.\n• Engineered data pipelines utilizing **AWS** and **GCP** for scalability, processing over **100,000** data entries per day, ensuring real-time insights and reporting.\n• Implemented event-driven architectures using **TealiumIQ**, creating user segments that drive personalized marketing strategies while managing data efficiently with **EventStream**.\n• Led initiatives for continuous improvement in system performance, with a focus on enhancing *customer support* through effective use of third-party tools like **CharlesProxy** and **Workato**.\n• Ensured compliance with industry standards through regular security audits and the adoption of best practices in data handling, integrating modern authentication solutions like **OAuth2** for secure access control."
    },
    {
      "role": "Software Developer",
      "company": "Wizcorp",
      "from_date": "Apr 2015",
      "to_date": "Nov 2018",
      "location": "Japan",
      "responsibilities": "Designed and integrated robust **APIs** leveraging **JavaScript** for seamless communication with client applications, ensuring high reliability and usability.\nExecuted digital marketing strategies using **AdobeAnalytics**, **GoogleAds**, and **TealiumIQ**, driving user engagement and conversion rates by **25%**.\nOptimized data access and management practices utilizing **SQL** and orchestrated data flows through **AWS** and **GCP** to support **real-time** analytics and reporting for clients.\nCollaborated with cross-functional teams to implement and troubleshoot integration solutions across multiple platforms including **Salesforce** and **AmazonQuicksight**.\nFacilitated effective audience segmentation and insights by harnessing the power of **AudienceStream** and **EventStream**, resulting in targeted campaigns that improved customer retention by **15%**.\nDeveloped mobile strategies utilizing **MobileFrameworks** and integrated robust tracking methods through **BrowserDeveloperTools** and **CharlesProxy**, enhancing user experience and monitoring.\nProvided top-tier **Customer Support**, ensuring satisfaction and continuous communication with clients throughout the implementation phases, leading to a **30%** reduction in support tickets.\nStreamlined project workflows using **Workato** for efficient process automation, increasing team productivity by **20%**."
    }
  ],
  "skills": "**Programming Languages**\n\tPython (3.8+), SQL, JavaScript\n\n**API Technologies**\n\tREST/gRPC APIs\n\n**Backend Frameworks**\n\tFastAPI, Flask, Django, Celery\n\n**Cloud & Infrastructure**\n\tAWS (EC2, S3, Lambda), GCP, Azure\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, Azure DevOps, CI/CD\n\n**Databases**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**Other**\n\tDigitalMarketing, TealiumIQ, AudienceStream, EventStream, Predict, DataAccess, AdobeAnalytics, GoogleAds, Salesforce, BrowserDeveloperTools, CharlesProxy, Workato, MobileFrameworks, AmazonQuicksight, CustomerSupport, Communication, AI/ML Tools: Pandas, NumPy, scikit-learn, TensorFlow, Airflow, MLflow, Microservices, Kafka, PyTest, Git",
  "apply_company": "Tealium"
}