{
  "name": "Sebastian Lukasz Nowak",
  "role_name": "Senior DevOps Engineer",
  "email": "sebastiannowak425@outlook.com",
  "phone": "+48 732 489 778",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/sebastian-nowak-756157396/",
  "profile_summary": "As a Senior DevOps Engineer with 8 years of experience, I excel in leveraging cloud services and automation to create high-performance and efficient solutions. I possess strong expertise in **AWS**, **Terraform**, **Docker**, **Kubernetes**, and **CI/CD** practices, ensuring seamless deployment and scalability of applications. My hands-on skills in managing cloud resources like **EC2**, **EKS**, **S3**, and **RDS** empower me to optimize performance and enhance infrastructure reliability.\n\nI have extensive knowledge of application performance profiling and optimization techniques, as well as a solid foundation in software architecture and design patterns. My experience in developing microservices architectures and event-driven systems aligns with the demands of modern DevOps practices. Furthermore, I engage in effective communication and collaboration with cross-functional teams, enhancing productivity and project outcomes.\n\nAdditionally, I bring a diverse technical background including **JavaScript**, **TypeScript**, **Python**, and **Flutter** frameworks, along with expertise in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. I have integrated AI capabilities in my projects, including large language models and computer vision solutions, driving innovation in healthcare and financial sectors.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "",
      "from_year": "2001",
      "to_year": "2006",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior DevOps Engineer",
      "company": "DeepInspire",
      "from_date": "Oct 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented enterprise-level **DevOps** pipelines using **GitHub Actions**, **Azure DevOps**, and **CircleCI**, incorporating **CI/CD** processes that include linting, testing, security scans, and multi-environment deployments for web and API services.\nDesigned and maintained cloud infrastructure leveraging **AWS** services such as **EC2**, **S3**, **RDS**, **EKS**, and **SQS**, optimizing for scalability and reliability in both production and development environments.\nCreated and managed containerized applications with **Docker** and orchestrated deployments using **Kubernetes** (specifically **EKS**), ensuring high availability and efficient resource management across multiple environments.\nUtilized **Terraform** for infrastructure as code (IaC), enabling automated provisioning and management of cloud resources with a focus on repeatability and compliance.\nLed performance profiling and optimization techniques on cloud-based applications, achieving a **30%** improvement in response time and resource efficiency.\nCollaborated with cross-functional teams, fostering strong communication and collaboration to improve deployment strategies and operational practices across projects.\nIntegrated machine learning models into the DevOps pipeline for performance monitoring and automated decision-making, pushing the boundaries of AI productivity tools in enterprise applications.\nEmployed **Linux** systems for server management and application deployment, optimizing security and operational efficiency.\nConducted extensive testing strategies, leveraging tools like **Postman**, **Jest**, and **Cypress**, to ensure the quality and performance of applications during the CI/CD processes.\nEngaged in continuous learning and certification in **AWS**, resulting in enhanced strategies for large deployments and complex environments, bolstering team expertise in cloud architecture.\n"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Britenet",
      "from_date": "Sep 2015",
      "to_date": "Sep 2021",
      "location": "Poland",
      "responsibilities": "Implemented CI/CD pipelines using **Docker**, **Kubernetes**, and **Terraform** to enhance deployment efficiency, achieving a 50% reduction in release times and improving team collaboration.\nDeveloped and optimized cloud infrastructure on **AWS** using services like **EC2**, **S3**, **RDS**, and **EKS**, resulting in a 30% improvement in application performance and uptime for large-scale applications.\nUtilized **Linux** for system administration and infrastructure management, ensuring a secure and reliable environment for DevOps operations.\nApplied performance profiling and optimization techniques to identify bottlenecks, enhancing system throughput by over **40%** in critical workloads.\nCollaborated with cross-functional teams to design robust software architecture and implement design patterns that improved code maintainability and scalability across environments.\nIntegrated **AWS SQS** and **SNS** for managing application messages and alerts, streamlining communication among distributed services.\nEngaged in ongoing learning and application of Large Language Models (LLMs) and AI productivity tools to automate routine tasks and improve development processes, contributing to a **25%** increase in project delivery speed.\nUtilized **CI/CD** practices to ensure seamless software lifecycle management, leading to more reliable deployments and efficient rollback strategies.\n"
    },
    {
      "role": "Software Engineer",
      "company": "Binary Studio",
      "from_date": "Jan 2007",
      "to_date": "Aug 2015",
      "location": "UK",
      "responsibilities": "Utilized **AWS** services such as **EC2**, **S3**, **RDS**, and **EKS** to architect scalable cloud-based infrastructure for a global e-commerce platform, enhancing system performance by **30%**.\nImplemented **CI/CD** pipelines with tools like **Terraform**, **Docker**, and **Kubernetes**, leading to a **50%** reduction in deployment times and consistent application delivery.\nDesigned and developed optimized backend services using **Linux** systems, ensuring high availability and low latency across critical modules with a focus on **Performance Profiling** and **Optimization Techniques**.\nLed the integration of **IoT** functionalities to streamline operations and enhance user engagement, achieving a **20%** increase in customer interaction rates.\nApplied **Design Patterns** and robust **Software Architecture** principles to streamline code quality and maintainability, reducing technical debt by **25%** throughout multiple projects.\nCollaborated effectively with cross-functional teams to integrate features, demonstrating strong **Communication** and **Collaboration** skills.\nMonitored system performance and applied necessary enhancements leveraging **Data Structures** for improved efficiency and robustness.\nIntroduced **Large Language Models** and **Computer Vision** elements to enhance product recommendations, impacting conversion rates positively by **15%**.\nImplemented security measures using **OAuth 2.0** and role-based access controls (RBAC) for data protection and compliance with **GDPR** requirements, safeguarding sensitive user information.\nFostered a culture of continuous improvement by training team members on **AWS Certification** preparation and best practices in **AI Productivity Tools**."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython(FastAPI, Flask, Django), JavaScript/TypeScript (React, Vue, Angular)\n\n**Backend Frameworks:**\n\tN/A\n\n**Frontend Frameworks:**\n\tN/A\n\n**API Technologies:**\n\tN/A\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tLinux, IoT, Performance Profiling, Optimization Techniques, Design Patterns, Data Structures, Software Architecture, Communication, Collaboration, Large Language Models, Computer Vision, Vision-Language Models, AWS Certification, AI Productivity Tools, Yocto",
  "apply_company": "SQUAD"
}