{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Application Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Experienced Senior Application Engineer with a strong foundation in secure coding, Bug Bounty, and Pentesting. Proficient in utilizing tools such as **OWASP**, **Burp Suite**, **SAST**, **DAST**, **SonarQube**, **Snyk**, **Jenkins**, **GitLabCI**, **Terraform**, and **Helm** to implement robust security measures and enhance application security. Skilled in CI/CD methodologies to ensure seamless deployment and integration processes.\n\nAs a Full Stack Developer with 13+ years of experience, I have a history of delivering high-performance applications in the healthcare and financial sectors. I am proficient in **JavaScript/TypeScript**, **Python**, and **Flutter**, with hands-on expertise in both frontend and backend development using **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. My background includes building AI/ML-powered platforms for predictive analytics, automation, and real-time processing.\n\nI have extensive experience in cloud-native systems deployment on **AWS** and **Azure**, implementing microservices, event-driven architectures, and CI/CD pipelines. Additionally, I understand compliance-driven development, aligning solutions with HIPAA, FHIR, PCI DSS, and SOC 2 standards, and have a strong background in MLOps, including model training, serving, and orchestration using **MLflow**, **Airflow**, and **Kubeflow**. My problem-solving capabilities and effective communication skills have been instrumental in collaborating with teams to achieve successful project outcomes.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Application Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented secure coding practices and vulnerability management strategies by integrating **OWASP** guidelines, **Burp Suite**, and **SAST** tools such as **SonarQube** and **Snyk** to enhance application security.\nConducted extensive **pentesting** and **Bug Bounty** assessments, identifying and rectifying security flaws across web applications and services to ensure compliance with security standards.\nDesigned and established CI/CD pipelines leveraging **Jenkins** and **GitLabCI**, automating deployment workflows and integrating security checks to streamline development processes across **3** different projects.\nUtilized **Terraform** and **Helm** for infrastructure as code practices, enabling consistent and repeatable environment setups for application deployments, effectively reducing setup time by **50%**.\nDeveloped and integrated **WAF** and **anti-bot solutions** to enhance the security posture of deployed applications, providing real-time protections against threats and malicious activities.\nCreated comprehensive documentation and conducted training sessions on secure coding practices and vulnerability assessments, fostering a culture of security awareness within the development team.\nLed security initiatives and provided communication across departments regarding security measures, ensuring alignment in achieving organizational goals.\nManaged collaboration with cross-functional teams to address security issues through problem-solving and fostering open communication channels, enhancing collective responsibility towards application security."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Implemented secure coding practices aligned with OWASP standards to enhance application security and protect sensitive financial data.\nLeveraged **Burp Suite** for penetration testing, conducting thorough assessments to identify and remediate vulnerabilities across high-volume applications.\nUtilized **SonarQube** for continuous static analysis, ensuring code quality and security by integrating it into the CI/CD pipeline with **Jenkins** and **GitLabCI**.\nConducted dynamic application security testing (DAST) to proactively identify security issues in production environments, facilitating a secure user experience.\nOrchestrated infrastructure deployment using **Terraform** and **Helm**, achieving scalable resource management and efficient application delivery within **Azure** cloud infrastructure.\nEstablished robust anti-bot solutions to protect applications from malicious attacks and ensure secure transaction processing, maintaining uptime of over **99.9%**.\nCollaborated with cross-functional teams to enhance problem-solving strategies, improving communication channels for rapid incident response and resolution.\nParticipated in continuous integration and continuous deployment (CI/CD) strategies, increasing deployment frequency by **40%** while reducing time-to-recovery through automated processes.\nDrove bug bounty programs to identify and resolve vulnerabilities, fostering a culture of security awareness among development teams and contributing to a **30%** reduction in security incidents."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented secure coding practices and conducted comprehensive **pentesting** using **Burp Suite** to identify and mitigate vulnerabilities, ensuring the application meets **OWASP** standards.\nUtilized **SonarQube** for static application security testing (**SAST**) and dynamic application security testing (**DAST**), achieving a **20%** reduction in security flaws within the codebase during **quarterly** audits.\nDeveloped continuous integration and continuous delivery (**CI/CD**) pipelines utilizing **Jenkins** and **GitLabCI** for streamlined deployment processes, resulting in a **30%** decrease in deployment times.\nApplied **Terraform** and **Helm** for infrastructure as code, enabling efficient provisioning and management of cloud resources with a focus on security and scalability.\nIntegrated web application firewalls (**WAF**) and anti-bot solutions to safeguard e-commerce transactions, significantly improving the system's resilience against cyber threats.\nCommunicated effectively with cross-functional teams to identify and resolve application security issues, enhancing overall security posture of the platform through proactive problem-solving strategies.\nMonitored and optimized application performance using insights from **Snyk** to detect vulnerabilities in open-source dependencies, maintaining a **99.9%** uptime across all deployed services.\nCollaborated in a **bug bounty** program to identify additional security vulnerabilities, fostering a collaborative environment for continuous security improvement and engagement with the security research community.\n"
    }
  ],
  "skills": " **Programming Languages:**\n\t•\tPython: FastAPI, Flask, Django\n\t•\tJavaScript/TypeScript: React, Vue, Angular\n\n **Backend Frameworks:**\n\t•\tFlask\n\t•\tFastAPI\n\t•\tDjango\n\n **Frontend Frameworks:**\n\t•\tReact\n\t•\tVue\n\t•\tAngular\n\n **API Technologies:**\n\t•\tKeycloak (OIDC, RBAC)\n\t•\tOAuth2\n\t•\tJWT\n\n **Serverless and Cloud Functions:**\n\t•\tAWS: Lambda\n\t•\tAzure: App Services\n\n **Databases:**\n\t•\tPostgreSQL (Fintech)\n\t•\tMySQL (Healthcare)\n\t•\tMongoDB (Gaming)\n\t•\tRedis\n\n **DevOps:**\n\t•\tDocker\n\t•\tKubernetes\n\t•\tGitHub Actions\n\t•\tGitLab CI/CD\n\t•\tJenkins\n\n **Cloud & Infrastructure:**\n\t•\tAWS: ECS, RDS, S3\n\t•\tAzure: Blob Storage, SQL Database\n\t•\tTerraform\n\t•\tAnsible\n\t•\tHelm\n\t•\tDocker Compose\n\n **Other:**\n\t•\tBug Bounty\n\t•\tPentesting\n\t•\tOWASP\n\t•\tBurp Suite\n\t•\tSAST\n\t•\tDAST\n\t•\tSonarQube\n\t•\tSnyk\n\t•\tWAF\n\t•\tAnti-bot solutions\n\t•\tSecure coding\n\t•\tCI/CD\n\t•\tProblem-solving\n\t•\tCommunication",
  "apply_company": "Swapcard"
}