{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Software Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a Senior Software Engineer with 8 years of experience, I leverage **Python**, **Docker**, and **CI/CD** practices to build high-performance solutions within the healthcare and financial sectors. My extensive technical expertise includes automation and verification, ensuring robust application performance through a strong foundation in **Linux**, **GitLab CI**, and **Jenkins**. I am proficient in utilizing **Allure**, **Grafana**, and **Kibana** for monitoring and observability, enabling data-driven decisions and efficient troubleshooting.\nBeyond my technical capabilities, I excel in problem-solving and communication, coupled with critical thinking and interpersonal skills, essential for leading collaborative projects. I have successfully led the development of enterprise-grade platforms incorporating AI/ML capabilities, enhancing predictive analytics and intelligent automation. My dedication to maintaining compliance standards such as HIPAA and PCI DSS ensures that my solutions are not only innovative but also secure and reliable.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **Python** for backend development to build scalable applications, while implementing **Docker** for containerization, enhancing deployment efficiencies.\nDeveloped and maintained CI/CD pipelines using **Jenkins** and **GitLab CI**, ensuring automated testing and smooth deployment processes across multiple environments.\nEmployed **Linux** for server management and application deployment, optimizing performance and security in production environments.\nImplemented virtualization technologies within **KVM**, enhancing resource management and flexibility in application deployment.\nDesigned and managed automation frameworks to streamline development workflows, significantly reducing deployment times by up to **30%**.\nConducted verification processes to ensure code quality, employing tools like **Allure** for test reporting and tracking, ensuring comprehensive coverage and effective feedback loops.\nCollaborated closely with team members, leveraging strong communication and interpersonal skills to facilitate project discussions and foster a cohesive team environment.\nExecuted critical thinking skills to troubleshoot complex issues, utilizing **Bash** scripting for system automation and problem resolution.\nLed efforts in networking solutions, optimizing communication between services and enhancing application performance.\nGenerated insights and reports using visualization tools, driving data-driven decisions in project planning and execution, minimizing project delays by **15%**.\nProvided mentorship and guidance to junior engineers, fostering a collaborative and engaging learning environment for skill enhancement.\nDemonstrated exceptional problem-solving capabilities, identifying and resolving performance bottlenecks in cloud-based architectures effectively."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **Linux** expertise to lead the development and modernization of financial platforms following a microservices-based architecture, enhancing scalability and maintainability for high-volume transaction systems.\nEmployed **Docker** and **KVM** to containerize applications, improving deployment consistency and efficiency across multiple environments.\nStreamlined CI/CD processes by leveraging **Jenkins** and **GitLab CI**, resulting in a 30% reduction in deployment times and increased release frequency.\nImplemented monitoring and logging solutions using **Grafana** and **Kibana** to ensure high availability and performance of critical financial applications, achieving over 99.9% uptime.\nDeveloped dynamic, user-focused front-end applications using **React (18)**, **Next.js**,**Vue 3**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** to enhance user experience on financial dashboards and admin portals.\nDesigned and built real-time transaction monitoring and analytics dashboards with **D3.js** and **Power BI Embedded**, enabling operational teams to detect anomalies and gain insights from over 1 million transactions daily.\nIntegrated messaging services including **Kafka**, **RabbitMQ**, and **Azure Service Bus** to establish a robust event-driven architecture, facilitating real-time event processing for transactions and alerts.\nCreated and orchestrated ETL pipelines using **Apache Airflow** and **Azure Data Factory**, optimizing data ingestion from internal and third-party sources and ensuring updated financial data availability.\nApplied **AI/ML** techniques with **scikit-learn** and **XGBoost** to develop fraud detection systems, analyzing tens of thousands of transaction patterns to proactively flag suspicious activities.\nConstructed ML pipelines for credit scoring, churn prediction, and transaction classification using **MLflow** and **Airflow**, integrating model inference into backend services for real-time decision-making."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "- Engineered backend services and automation tools using **Python** and **Bash** on a **Linux** environment, ensuring high availability and scalability across all service modules.\n- Developed CI/CD pipelines utilizing **Jenkins** and **GitLab CI**, streamlining software deployment processes and improving release cycles by **30%**.\n- Implemented containerization strategies with **Docker** to simplify application deployments and maintain consistent environments across development, testing, and production.\n- Designed network configurations and managed virtual environments using **KVM** and other virtualization tools to enhance resource utilization and minimize operational costs.\n- Utilized **Grafana** and **Kibana** for monitoring application performance and system health, leading to faster identification and resolution of issues by **25%**.\n- Collaborated across teams through effective communication and interpersonal skills, resulting in improved project outcomes and reduced cycle times.\n- Engaged in critical thinking and problem-solving to streamline processes and enhance system reliability in a high-traffic e-commerce setting.\n- Developed secured networking practices ensuring compliant access control with **RBAC** and **OAuth 2.0**, safeguarding customer and admin data while maintaining GDPR compliance.\n- Leveraged automation strategies to enhance system verification and testing protocols, contributing to a **40%** reduction in production bugs.\n- Participated in knowledge sharing and mentoring sessions enhancing team capability and technical growth through effective interpersonal communication."
    }
  ],
  "skills": "Programming Languages:\n\tPython\n\nBackend Frameworks:\n\tFastAPI, Flask, Django\n\nFrontend Frameworks:\n\tJavaScript/TypeScript (React, Vue, Angular)\n\nAPI Technologies:\n\t\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda), Azure (App Services)\n\nDatabases:\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Jenkins, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\tAWS (RDS, S3), Azure (Blob, SQL), Linux, KVM, Virtualization, Networking\n\nOther:\n\tBash, CI/CD, Allure, Grafana, Kibana, GIT, Automation, Verification, Problem-solving, Communication, Critical thinking, Interpersonal skills",
  "apply_company": "NVIDIA"
}