{
  "name": "Patryk Zaslawski",
  "role_name": "Senior Workday Extend Developer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-zaslawski-6b04a8397/",
  "profile_summary": "As a Senior Workday Extend Developer with 8+ years of experience in software engineering, I specialize in building integrations and custom solutions on the **Workday Extend** platform. Leveraging my strong expertise in **REST** and **SOAP** API development, I ensure seamless integration with existing business processes, always maintaining a customer-focused approach. My background in **Agile** methodologies enables me to efficiently manage project requirements and deliver high-quality results. Proven skills in **DevOps** practices allow for streamlined deployments and improved collaboration across teams. Additionally, I possess a robust foundation in Python (FastAPI, Django, Flask, SQLAlchemy) and frontend technologies like **Angular**, **Vue**, and **React**, allowing for a comprehensive understanding of full-stack development. Committed to enhancing performance and reliability through database optimization with **PostgreSQL**, **MySQL**, and **MongoDB**, I deliver solutions that align with industry best practices and exceed client expectations.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior Workday Extend Developer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "- Developed and integrated **REST** and **SOAP** APIs within the **Workday Extend** environment to enhance HCM functionalities and facilitate seamless data exchange with third-party systems.\n- Championed **Agile** methodologies to improve team collaboration and delivery, ensuring a customer-focused approach in meeting healthcare client requirements in the Workday ecosystem.\n- Led the implementation of automated deployment workflows utilizing **DevOps** practices, reducing deployment times by **30%** through CI/CD pipelines.\n- Delivered customized solutions in **Workday Extend** for client-specific needs, significantly improving user engagement and operational efficiency in HCM processes.\n- Collaborated closely with cross-functional teams to design and optimize integrations with various enterprise systems, leveraging a deep understanding of **HCM** and user-centric design principles.\n- Provided mentorship to junior developers in developing robust applications on **Workday Extend**, fostering a culture of continuous improvement and technical excellence.\n- Developed successful integration strategies that increased data accuracy by **20%**, ensuring critical information flow between Workday and external applications.\n- Ensured consistent application of best practices in software development, including test-driven development (TDD) and effective use of Agile techniques to enhance team outputs.\n- Engaged with stakeholders to gather requirements and translated them into technical specifications for enhanced **Workday** functionalities, demonstrating a strong customer focus.\n- Actively participated in code reviews and provided constructive feedback to enhance code quality and maintainability across the development team.\n- Led the improvement of system performance, achieving a **25%** increase in API response times and user satisfaction ratings in the deployed applications."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "- Designed and implemented **RESTful** and **SOAP** APIs to ensure seamless integration of **Workday Extend** functionalities within existing infrastructure, enhancing HCM capabilities and user engagement.\n- Executed Agile methodologies to lead iterative development processes while collaborating closely with cross-functional teams, ensuring timely deliverables aligned with customer focus.\n- Developed integration solutions leveraging **Workday Extend** to connect with external systems, ensuring a robust exchange of HCM data and improving operational efficiency.\n- Managed the deployment of microservices within a **DevOps** framework, employing CI/CD practices to automate build and deployment pipelines using tools such as **Azure DevOps** and **GitHub Actions**.\n- Maintained consistent customer feedback loops to refine product features, resulting in a **20%** increase in user satisfaction ratings.\n- Improved release cycles, achieving a **30%** reduction in deployment time through the implementation of efficient DevOps practices and integration methodologies.\n- Conducted training sessions for teams on the use of **Workday Extend**, achieving a **95%** adoption rate within the first quarter of rollout.\n- Enhanced system reliability by integrating automated testing frameworks and practices into the SDLC, significantly reducing post-deployment defects by **40%**.\n- Collaborated on cross-departmental initiatives aimed at increasing the agility of the HCM processes, streamlining workflows, and enhancing overall customer experience.\n- Participated in code reviews and provided constructive feedback, fostering a culture of continuous improvement and knowledge sharing within the development team."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Utilized **Workday Extend** to develop and enhance integrations for HCM processes, ensuring seamless data exchange between Workday and third-party systems.\nDesigned and implemented RESTful and SOAP APIs for Workday Extend applications, improving integration efficiency and data accuracy across various HR modules.\nAdopted **Agile** methodologies to lead project teams in the development of customer-focused solutions, facilitating iterative feedback and continuous improvement.\nCollaborated with cross-functional teams to gather user requirements and deliver tailored HCM solutions that enhance overall system functionality.\nImplemented CI/CD practices leveraging **DevOps** principles to automate build, test, and deployment workflows for Workday Extend applications, ensuring rapid and reliable feature releases.\nDeveloped integrations using **REST** and **SOAP** protocols to streamline organizational processes and improve data reliability across the HCM landscape.\nUtilized advanced debugging techniques to troubleshoot and resolve integration issues within Workday Extend, resulting in a 30% reduction in response time for data queries.\nLeveraged vendor APIs for seamless connection with external systems, enhancing client relationships and improving data management efficiency.\nConducted user training sessions on Workday Extend capabilities to enrich user understanding and maximize system usage, contributing to a 25% increase in user satisfaction ratings.\nManaged integrations in a version-controlled environment, ensuring consistent delivery of updates and features across **Version 2023**.\nDeveloped custom solutions in **Workday Extend** to improve customer focus and adapt HCM applications to changing business needs, resulting in a 20% increase in user adoption.\nOptimized data workflows within Workday Extend applications, effectively reducing system load and enhancing processing speeds for key HR functions."
    }
  ],
  "skills": "**API Technologies**\n\tREST, SOAP\n\n**Cloud & Infrastructure**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**DevOps**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Programming Languages**\n\tPython (FastAPI, Django, Flask)\n\n**Backend Frameworks**\n\tSQLAlchemy, Pydantic, Celery, Spring Boot\n\n**Frontend Frameworks**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n**Authentication & Security**\n\tKeycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n**Databases**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**Other**\n\tWorkday Extend, Agile, Integration, HCM, Customer Focus, DevOps"
}