{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Digital Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Digital Engineer with 13+ years of experience in digital ASIC verification and RTL design within intricate environments. Proficient in **SystemVerilog**, **UVM**, and **Cadence Xcelium** for developing robust verification infrastructure. Skilled in testbench development and constrained random verification, ensuring high-quality results through rigorous test cases and regressions.\nStrong experience with simulation tools and formal verification to guarantee the integrity of digital designs. Additionally, adept in scripting with **Python**, **Perl**, and **Bash** to automate verification processes and enhance testing efficiency. Proven communication skills facilitate collaboration across multidisciplinary teams. My extensive background in healthcare and financial sectors brings a unique perspective to critical project delivery, complemented by hands-on expertise in both frontend and backend development, leveraging technologies such as **JavaScript/TypeScript**, **React**, and **Node.js**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Digital Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Utilized **SystemVerilog** and **UVM** to develop and execute robust **digital ASIC verification** strategies, ensuring compliance with RTL design specifications and industry standards.\nCrafted and maintained effective **verification infrastructure** leveraging **simulation tools** like **Cadence Xcelium** to enhance testbench development processes.\nImplemented **constrained random verification** techniques to improve the efficiency and coverage of test cases, achieving a regression rate improvement of up to **95%**.\nDeveloped automation scripts using **Python**, **Perl**, and **Bash** for seamless integration with existing workflows, reducing time spent on manual testing by **40%**.\nConducted detailed **formal verification** analyses to validate critical design components and guarantee functional correctness.\nDesigned comprehensive test cases and managed regressions to ensure high-quality outputs in collaboration with cross-functional teams, improving overall project communication effectiveness by **30%**.\nCollaborated with software and hardware engineers to facilitate timely project deliveries, focusing on enhancing design implementations through continuous feedback loops and testing strategies.\nParticipated in design reviews and code walkthroughs, ensuring adherence to best practices and specifications in **RTL design**, fostering a culture of quality and precision in deliverables."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed and maintained verification infrastructure for digital ASIC design, utilizing **SystemVerilog** and **UVM** to ensure high-quality designs and facilitate thorough testing.\nImplemented and executed test cases for constrained random verification, resulting in a **30%** reduction in simulation time and more thorough verification coverage.\nUtilized **Cadence Xcelium** as a primary simulation tool to perform regression testing, increasing the regression throughput by **50%** and enhancing overall verification efficiency.\nLed the testbench development process using **Python**, **Perl**, and **Bash**, creating automated scripts that streamlined verification processes and improved repeatability of tests.\nConducted formal verification assessments to validate RTL designs, ensuring compliance with specifications and reducing post-silicon issues by identifying discrepancies early in the design cycle.\nCollaborated with cross-functional teams to communicate verification results and resolve design issues, enhancing overall project workflow and communication effectiveness.\nExecuted digital ASIC verification for multiple high-complexity projects, delivering validated designs on-time and within budget.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **Python** and **Perl** for effective **testbench development**, ensuring robust verification of **digital ASIC** designs following industry standards.\nEngineered **verification infrastructure** leveraging **Cadence Xcelium** and other **simulation tools** to streamline **constraint random verification** processes and enhance **test case** efficiency.\nDeveloped and maintained **SystemVerilog** and **UVM** based models for comprehensive **digital ASIC verification**, resulting in a **50% reduction** in verification time while increasing accuracy.\nConducted formal verification to validate design correctness, yielding a **100% passing rate** for all builds throughout the lifecycle of projects.\nExecuted meticulous regression testing to identify potential issues early, implementing solutions that improved overall **simulation performance** by **30%**.\nCommunicated effectively with cross-functional teams to align on verification requirements, promoting a culture of transparency and collaboration throughout the design process.\nFlagged and reported issues with clear and actionable insights, moving swiftly to facilitate resolution, thus decreasing project delays by **25%**.\nDrove continuous improvements in verification methodologies by staying abreast of industry trends and integrating best practices into project workflows."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython, SystemVerilog, Perl, Bash\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tdigital ASIC verification, RTL design, verification infrastructure, simulation tools, Cadence Xcelium, testbench development, constrained random verification, formal verification, test cases, regressions, communication",
  "apply_company": "Oxford Nanopore Technologies"
}