{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Software Engineer II",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Software Engineer II with 13+ years of experience in full stack development, specializing in **React**, **TypeScript**, and **JavaScript**, with robust capabilities in **HTML**, **CSS**, and **C#/.NET**. Expert in building scalable applications leveraging both frontend and backend technologies while promoting best practices in **DevOps**, **CI/CD**, and **infrastructure as code**. Proven track record in utilizing **AWS** and **GCP** for cloud deployment, with experience in **DynamoDB** and **MySQL** for database management.\n\nDemonstrated ability to implement microservices and microfrontend architectures within monorepo structures, enhancing team collaboration and code efficiency. Strong problem-solving skills complemented by effective communication and collaboration within dynamic teams. Committed to delivering high-performance solutions across diverse sectors, including healthcare and finance, while maintaining compliance with industry standards.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer II",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed responsive web applications using **React (17-18)**, **TypeScript**, **HTML**, **JavaScript**, and **CSS**, ensuring seamless user experiences.\n• Implemented scalable backend solutions leveraging **GraphQL**, **AWS**, and **GCP**, enhancing data retrieval and management alongside database technologies like **MySQL** and **DynamoDB**.\n• Built robust CI/CD pipelines using **DevOps** practices, ensuring efficient and automated deployment processes across development environments.\n• Led efforts to adopt infrastructure as code, facilitating reproducible environments and consistent deployment strategies for multi-environment setups.\n• Collaborated within a **monorepo** architecture, optimizing code sharing and maintenance across multiple projects and modules.\n• Enhanced system performance through **microfrontend** strategies, improving component reusability and reducing loading times.\n• Engaged in proactive problem-solving and effective communication to align with cross-functional teams, fostering collaboration in developing cutting-edge software solutions.\n• Integrated analytics and monitoring tools to support **CI/CD** and **DevOps** efforts, maintaining high standards for code quality and security.\n• Participated in code reviews and maintained documentation, ensuring adherence to best practices for development workflows and coding standards.\n• Applied advanced data visualization techniques with libraries like **D3.js** and **Chart.js**, driving insights from complex datasets and improving decision-making capabilities."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **React (18)** and **TypeScript** to build interactive and responsive web applications, enhancing user experience for financial tools and admin panels.\nImplemented CI/CD practices to streamline deployment processes and ensure rapid delivery, fostering collaboration across cross-functional teams.\nDesigned and maintained infrastructure as code (IaC) using **AWS** and **GCP**, ensuring scalable and secure environments for applications to operate flawlessly.\nDeveloped microservices following clean architecture principles with **Node.js (NestJS/Express)** and **Python (FastAPI)**, significantly improving the scalability and resilience of financial systems.\nCollaborated with product teams to create seamless integrations using **GraphQL** and REST APIs, enhancing data retrieval efficiency and enabling real-time updates.\nEmployed strong problem-solving skills to troubleshoot and resolve complex technical issues, contributing to a **30% reduction in system downtime**.\nLed initiatives to implement a **monorepo** strategy for better code management and consistency across projects, ensuring **20% faster onboarding** for new developers.\nOrchestrated DevOps practices by implementing configuration management and automation tools, reducing deployment times from **10 hours to under 2 hours**.\n"
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed responsive, SEO-friendly e-commerce UIs using **React (18)**, **HTML5**, **CSS3**, and **TypeScript**, optimized for mobile-first engagement to enhance the user experience across devices.\nUtilized **JavaScript** to build interactive frontend applications, improving performance metrics and scalability, effectively handling over **100,000** concurrent users.\nDesigned backend services utilizing **C#/.NET**, facilitating seamless integration with **MySQL** and **DynamoDB**, ensuring robust data management and retrieval processes across applications.\nImplemented **GraphQL** for efficient data querying, enhancing frontend capabilities and reducing load times by **30%**, thereby improving overall application performance.\nEngineered CI/CD pipelines leveraging **AWS** and **GCP**, ensuring smooth deployment processes and significant reductions in deployment cycles by over **50%**.\nEmployed **DevOps** practices and **infrastructure as code** methodologies to streamline system operations and enhance collaboration between development and operations teams, minimizing deployment issues by **25%**.\nAdopted microfrontend architecture, enabling independent development and deployment of various e-commerce components, improving team productivity and deployment speed.\nCollaborated with cross-functional teams to define project scopes and deliverables, utilizing strong communication and problem-solving skills to address challenges efficiently.\nParticipated in code reviews and team meetings, fostering a culture of collaboration and continuous improvement within the engineering team."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript, Python, C#/.NET\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular, HTML, CSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tGraphQL\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, DynamoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, DevOps\n\n**Cloud & Infrastructure:**\n\tAWS, Azure, GCP, ECS, Lambda, RDS, S3, App Services, Blob Storage, SQL Database\n\n**Serverless and Cloud Functions:**\n\tLambda\n\n**Other:**\n\tMLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot, Terraform, Ansible, Helm, Docker Compose, Microfrontend, monorepo, problem-solving, communication, collaboration\n"
}