{
  "name": "Damian Franciszek Pospiech",
  "role_name": "SeniorGrowthEngineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic Senior Growth Engineer with extensive experience in data analysis and market analysis, adept at leveraging quantitative skills to drive user engagement and optimize trading volume. Proven ability to communicate complex concepts clearly and collaborate with cross-functional teams in high-pressure environments. \n\nBringing 13+ years as a Full Stack Developer, skilled in developing high-performance applications using **JavaScript**, **TypeScript**, **Python**, and **Flutter**. Expertise in both frontend and backend development with hands-on experience in **React**, **Next.js**, **Vue**, **Node.js**, **FastAPI**, and **Django**. \n\nExperienced in deploying cloud-native systems on **AWS** and **Azure**, and executing microservices, event-driven architectures, and CI/CD pipelines. Proficient in implementing compliance-driven development adhering to HIPAA, FHIR, PCI DSS, and SOC 2 standards. Adept in AI/ML integrations with a strong background in MLOps, utilizing **MLflow**, **Airflow**, and **Kubeflow** for model training and orchestration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "SeniorGrowthEngineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Conducted comprehensive **data analysis** to inform event strategies and marketing initiatives, resulting in a **20%** increase in user engagement across platforms.\n• Leveraged advanced collaboration techniques to enhance team communication, leading to **15%** higher productivity during high-pressure projects.\n• Developed and executed event planning strategies that aligned with overall growth objectives, directly increasing trading volume by **25%** in targeted markets.\n• Engaged with diverse user groups to collect feedback and insights, driving product improvements and optimizing user experiences based on market analysis.\n• Harnessed problem-solving skills to address challenges in event execution and market conditions, ensuring seamless operations under tight deadlines.\n• Partnered with the marketing team to refine promotional strategies using **financial derivatives** and **cryptocurrency** offerings, significantly boosting participation rates.\n• Collaborated with cross-functional teams to integrate innovative communication channels within events, promoting real-time updates and active participation.\n• Analyzed **market trends** and provided actionable insights to navigate competitive environments effectively, utilizing data-driven decisions to enhance growth initiatives.\n• Demonstrated exceptional **teamwork** capabilities by mentoring junior team members, fostering a collaborative environment to achieve shared goals."
    },
    {
      "role": "Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **data analysis** to develop and deliver real-time analytics dashboards with **React (18)**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies impacting **trading volume**.\nCollaborated effectively with cross-functional teams to modernize core financial platforms by migrating to microservices architecture using **Node.js (NestJS/Express)** and **Python (FastAPI, Django)**, enhancing scalability and performance for high-volume transactional systems.\nSuccessfully executed **event planning** for product releases, ensuring effective communication strategies were in place while enhancing **user engagement** through interactive front-end applications built with **React**, **Vue 3**, **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces.\nDesigned and deployed a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, facilitating asynchronous communication across critical workflows such as payments, alerts, and compliance, which improved overall team collaboration.\nDeveloped **ETL pipelines** for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, supporting both batch and real-time processing of **financial derivatives** data.\nImplemented machine learning models for fraud detection and proactive analysis using **scikit-learn**, **XGBoost**, and **Azure ML**, enhancing problem-solving capabilities related to suspicious activity detection based on user behavior and transaction patterns.\nCreated ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** integrating model inference into backend services to improve overall operational efficiency under pressure."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Conducted data analysis to identify growth opportunities within the e-commerce platform, leveraging insights to drive marketing strategies and user engagement.\nFacilitated communication across cross-functional teams, ensuring collaboration between development, marketing, and customer support departments to enhance overall platform performance.\nImplemented marketing strategies to boost trading volume and user engagement, utilizing metrics to inform decision-making and optimizecampaign effectiveness.\nGained hands-on experience in cryptocurrency and financial derivatives, analyzing market trends and consumer behavior to improve product offerings and user experience.\nUtilized event planning skills to coordinate cross-team initiatives and feature launches, focusing on problem-solving and managing timelines under pressure.\nEmployed advanced data analytics to assess customer interactions and harness feedback, enhancing user experience and conversion rates for e-commerce solutions.\nParticipated in teamwork-centric projects that demanded high collaboration, delivering impactful results while adhering to tight deadlines and project scopes.\nAnalyzed market data and competitor performance to refine feature offerings and user journeys, ultimately influencing strategic growth decisions and resource allocation.\nEngaged in ongoing learning and adaptation to market changes within the cryptocurrency sector, providing insights that shaped platform enhancements and user acquisition tactics."
    }
  ],
  "skills": "**Backend Frameworks:**\n\tFlask, Django, FastAPI\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, Lambda, RDS, S3, Azure: App Services, Blob Storage, SQL Database\n\n**Other:**\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, event planning, data analysis, communication, marketing, user engagement, trading volume, collaboration, cryptocurrency, financial derivatives, market analysis, problem-solving, teamwork, pressure handling",
  "apply_company": "MEXC"
}