{
  "name": "Damian Franciszek Pospiech",
  "role_name": "AI Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "AI Software Engineer with 13+ years of experience in developing innovative applications with a focus on AI and machine learning. Proficient in **Python**, **FastAPI**, and **Flask**, demonstrating strong expertise in **microservices architecture** and **event-driven architectures**. Skilled in utilizing **OpenAI APIs**, including interaction with **large language models** such as GPT, Claude, and Gemini, with experience in fine-tuning and prompt engineering to enhance performance of AI solutions.\n\nExperienced in integrating advanced technologies such as **Kafka**, **WebSocket**, and **SSE** for real-time data processing and communication. Adept at utilizing **vector databases** like **OpenSearch** and **FAISS** for efficient data retrieval and implementing **retrieval-augmented generation** systems.\n\nProficient in deploying robust, scalable solutions in compliance with regulatory standards such as HIPAA and PCI DSS. Proven track record in problem-solving, collaboration, and effective communication with cross-functional teams to drive successful project outcomes. Strong background in MLOps practices, incorporating CI/CD pipelines and orchestration with tools like **MLflow** and **Airflow**.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "AI Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained **Python** applications using **FastAPI** and **Flask**, adhering to microservices architecture principles for scalable and efficient service deployment.\nEngineered solutions leveraging **Event-driven Architecture** with **Kafka**, **SSE**, and **WebSocket**, ensuring responsive and real-time data processing capabilities.\nDesigned and implemented **Large Language Models** strategies incorporating **GPT**, **Claude**, and **Gemini**, focusing on fine-tuning and prompt engineering for tailored AI interactions.\nCreated and optimized **Vector Databases** with **OpenSearch** and **FAISS**, enabling high-performance querying and retrieval for AI applications.\nCollaborated with cross-functional teams, enhancing problem-solving and communication skills to drive AI project success and address complex technical challenges.\nExecuted the deployment of conversational AI features utilizing **OpenAI APIs** and **RAG Systems**, improving user engagement and interaction quality.\nSupervised and trained junior engineers, fostering a culture of collaboration and innovation within the team for project development and idea sharing.\nDesigned comprehensive testing strategies using modern tools to ensure robust code quality across all layers of the applications, covering unit, integration, and performance testing.\nProvided technical guidance and support in building AI agents, enhancing the user experience through intelligent automation and personalized interactions.\nAchieved measurable improvements in project efficiencies, reducing deployment times by **25%** through optimized DevOps processes and streamlined workflows."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized **Python** and **FastAPI** to develop AI solutions, implementing **microservices architecture** to enhance the modularity and scalability of applications.\nEngineered **event-driven architecture** using **Kafka** to facilitate real-time data processing for AI applications, ensuring efficient communication and workflow.\nDesigned and developed fine-tuned models leveraging **Large Language Models** including **GPT** for conversational AI capabilities, ensuring proactive and intelligent user interactions.\nImplemented solutions with **OpenAI APIs** to enhance retrieval-augmented generation, providing accurate responses and predictions in real-time scenarios.\nCollaborated effectively with cross-functional teams to gather requirements and deliver AI projects ahead of deadlines, demonstrating strong **communication** and **collaboration** skills.\nDeveloped and deployed robust machine learning models, including real-time credit scoring using **scikit-learn** and **XGBoost**, delivering a 95% accuracy rate in fraud detection.\nBuilt user-friendly applications incorporating large-scale data processing with **Flask** and **WebSocket** technology, enabling seamless user interaction.\nLed initiatives to integrate vector databases like **FAISS** and **OpenSearch** into existing systems, improving document retrieval speeds by up to **50%**.\nConducted problem-solving sessions to resolve complexities in machine learning pipelines and enhance overall system efficiency, ensuring timely project delivery."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "• Developed and optimized backend services utilizing **Python (FastAPI, Flask)**, implementing **Microservices Architecture** to enhance performance and scalability of AI-driven features.\n• Engineered real-time data processing solutions using **WebSockets** and **Event-driven Architecture** with **Kafka**, facilitating seamless communication for conversational AI applications.\n• Collaborated on the integration of **AI Agents** and **Conversational AI** technologies, focusing on **Large Language Models** like **GPT** and **Claude**, ensuring high relevance and user satisfaction in AI interactions.\n• Fine-tuned AI models using advanced techniques, including **Prompt Engineering**, and integrated with retrieval systems leveraging **Vector Databases** and **OpenSearch** for effective data retrieval and management.\n• Implemented responsive, intuitive user interfaces for AI platforms using **React (18)** and **Vue 3**, ensuring compliance with accessibility standards while providing engaging experiences.\n• Utilized best practices for **problem-solving**, focusing heavily on the architecture and design of service-oriented components, successfully reducing latency by **30%** in AI processing tasks.\n• Fostered collaboration among cross-functional teams to enhance AI product features, engaging in effective communication to align objectives and deliverables.\n• Created and maintained well-documented APIs and services to ensure smooth interactions between AI components, improving team efficiency by **25%**.\n• Applied security protocols including **OAuth 2.0** to protect user data and ensure compliance with guidelines, contributing to a secure product environment for sensitive AI functionalities.\n• Actively contributed to the planning and execution of **blue-green deployments** and feature flags to enhance the scalability of applications, achieving successful rollouts without downtime during **3 major releases**."
    }
  ],
  "skills": "  **Programming Languages:**\n\tPython, JavaScript/TypeScript\n\n  **Backend Frameworks:**\n\tFastAPI, Flask, Django, Microservices Architecture\n\n  **Frontend Frameworks:**\n\tReact, Vue, Angular\n\n  **API Technologies:**\n\tOpenAI APIs, SSE, WebSocket\n\n  **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n  **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis, Vector Databases, OpenSearch, FAISS\n\n  **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n  **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database\n\n  **Other:**\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT, Nginx, Let’s Encrypt, Certbot\n\tArtificial Intelligence & Machine Learning: MLflow, Airflow, Kubeflow, Large Language Models, Fine-tuning, Prompt Engineering, Conversational AI, AI Agents, RAG Systems, Problem-solving, Communication, Collaboration"
}