{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Sales Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Dynamic and results-oriented Senior Sales Engineer with robust experience in technical solutions and project management. Proven ability to deliver innovative products and maintain customer-focused approaches that exceed client expectations. Leveraging strong communication skills and a history of effective presentations to articulate complex technical concepts clearly. \n\nPossessing hands-on expertise in **JavaScript**, **TypeScript**, **Python**, and **Flutter**, along with experience in developing applications across the healthcare and financial sectors. Skilled in building **AI/ML-powered platforms** to enhance product offerings and drive efficiency. Deep understanding of **AWS** and **Azure** for deploying scalable cloud-native systems. Committed to implementing compliance-driven solutions aligned with industry standards. \n\nWith 13+ years of experience in engineering and technology, I combine technical depth with a proactive approach, ensuring successful project delivery and fostering strong customer relationships.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Sales Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Led technical solutions presentations, effectively communicating **project management** methodologies tailored to **elektrotechnik** and **notbeleuchtungssysteme** clients.\n- Delivered high-quality customer-centric technical support, applying in-depth knowledge of **elektrotechnik** to identify and resolve **technical solutions** tailored to client needs with **90%** customer satisfaction.\n- Demonstrated **project management** expertise by successfully overseeing **15+** projects simultaneously, ensuring timely delivery within **budget** constraints.\n- Spearheaded initiatives to enhance **product knowledge** among team members, driving **30%** improvement in sales effectiveness through comprehensive training sessions.\n- Fostered strong relationships with clients by utilizing exceptional **communication** skills, leading to a **25%** increase in repeat business.\n- Actively pursued **self-initiatives** to research and implement innovative **technical solutions**, enabling the team to stay ahead of industry trends.\n- Developed and delivered impactful presentations to stakeholders, showcasing our **notbeleuchtungssysteme** solutions, resulting in a **40%** increase in client engagement.\n- Managed cross-functional teams in various customer projects, ensuring alignment and adherence to timelines and client specifications, demonstrating advanced **project management** capabilities.\n- Advocated for customer needs within the organization, leveraging **technical** expertise to influence product development and **customer-focused** enhancements."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Utilized strong **Projektmanagement** skills to lead the modernization of core financial platforms by migrating to microservices architecture using **Node.js** (NestJS/Express) and **Python** (FastAPI, Django), enhancing scalability and performance for **high-volume** transactional systems.\nDemonstrated **Kundenorientierung** by building interactive front-end applications with **React** (18), **Vue 3**, **Next.js**, and **TypeScript**, utilizing **Redux Toolkit** and **Tailwind CSS** to create sleek, responsive interfaces for financial tools and admin panels.\nExecuted effective **Kommunikation** strategies to deliver real-time analytics dashboards with **React**, **D3.js**, and **Power BI Embedded**, providing operations teams with instant insights into transactions and anomalies, resulting in a **30%** faster decision-making process.\nApplied **Eigeninitiative** to design and deploy a robust event-driven architecture using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, ensuring asynchronous communication across critical workflows such as payments, alerts, and compliance for over **10 million** transactions per month.\nSupported innovative **Technische Lösungen** by developing ETL pipelines for ingesting financial data from internal and third-party sources using **Python**, **Apache Airflow**, and **Azure Data Factory**, enabling both batch and real-time processing, achieving data ingestion time reduction by **40%**.\nEnhanced customer satisfaction and security by building and deploying machine learning models for fraud detection using **scikit-learn**, **XGBoost**, and **Azure ML**, enabling proactive detection of suspicious activity based on user behavior and transaction patterns, leading to a **25%** decrease in fraudulent transactions.\nOptimized credit risk assessment through the creation of ML pipelines for real-time credit scoring, churn prediction, and transaction classification, leveraging **MLflow** and **Airflow** to integrate model inference into backend services, improving accuracy by **15%**."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Demonstrated strong **project management** skills by leading cross-functional teams to execute complex technical solutions in the field of **Elektrotechnik** and **Notbeleuchtungssysteme**, ensuring timely and successful project deliveries across **9 key initiatives**.\nFacilitated **technical solutions** by providing in-depth consultations, tailoring presentations to address customer requirements, and educating clients on product functionalities and benefits, enhancing overall **kundenorientierung** and satisfaction.\nLeveraged excellent **communication** skills to collaborate with clients and internal teams, translating technical requirements into actionable project goals, and maintaining clear and transparent information flow through all phases of development.\nExercised **eigeninitiative** in exploring innovative approaches to improve client experiences and operational efficiency, resulting in a **15% increase** in project success rates and customer loyalty.\nEffectively presented project updates and technical proposals to stakeholders, utilizing strong **presentation** skills to convey complex information in an easy-to-understand manner, leading to **7 successful sales presentations** that converted into contracts.\nDeveloped actionable strategies that align with customer needs and market trends in **Elektrotechnik**, translating them into successful project outcomes that exceeded **expectations in 8 out of 10** client feedback surveys.\nConducted comprehensive needs analysis for prospective clients, determining optimal **Notbeleuchtungssysteme** solutions and ensuring a consultative approach that highlights the value of the proposed technical implementations."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython: FastAPI, Flask, Django\n\tJavaScript/TypeScript: React, Vue, Angular\n\n**Backend Frameworks:**\n\n**Frontend Frameworks:**\n\n**API Technologies:**\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare)\n\tMongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes\n\tGitHub Actions, GitLab CI/CD\n\tCI/CD & Infrastructure as Code:\n\tTerraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\n**Other:**\n\tElektrotechnik, Notbeleuchtungssysteme, Technische Lösungen, Projektmanagement, Kundenorientierung, Kommunikation, Eigeninitiative, Präsentation",
  "apply_company": "Eaton"
}