{
  "name": "Tomasz Lee",
  "role_name": "Senior Backend Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Backend Engineer with over 9 years of experience in backend development, specializing in Python, **Django**, and **Django REST** for building efficient and scalable applications. Proficient with **PostgreSQL** for database management and experienced in implementing **Celery** for asynchronous processing. Skilled in monitoring and observability tools such as **Sentry**, **Datadog**, and **Grafana** to enhance system performance. Familiar with **Git** for version control, and adept at utilizing **OpenAPI** for API development. Strong expertise in **Kubernetes** for container orchestration, and experience with **Elasticsearch** and **ClickHouse** for data analysis. Known for mentorship and collaboration across teams to drive projects to successful completion while delivering high-quality solutions.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **Python** and **Django** to develop scalable backend services, enhancing application performance by 30%.\nDesigned and implemented **Django REST** APIs for seamless integration with frontend applications, improving data accessibility.\nManaged **PostgreSQL** databases, optimizing query performance by 25% and improving data retrieval efficiency.\nImplemented asynchronous processing using **Celery**, increasing task completion rates and enhancing user experience.\nMonitored application performance using **Sentry**, **Datadog**, and **Grafana**, leading to a 15% reduction in downtime.\nCollaborated with cross-functional teams to ensure smooth project delivery and adherence to best practices, fostering a culture of mentorship and collaboration.\nIntegrated **Elasticsearch** for advanced search capabilities, improving search response time by 40% for users.\nUtilized **OpenAPI** standards for API documentation, ensuring clarity and consistency across services.\nImplemented caching strategies to significantly reduce database load, achieving response time improvements of up to 50%.\nDeployed applications using **Kubernetes**, enhancing scalability and automating deployment processes."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "• Developed and maintained robust backend services using **Python** and **Django**, enhancing application reliability and performance metrics by 20%.\n• Implemented **Django REST** API endpoints for seamless integration with frontend systems, enabling 99.9% availability.\n• Designed asynchronous task management with **Celery**, significantly improving data processing speed for tasks by 40%.\n• Utilized **PostgreSQL** for efficient data storage, including optimization of complex queries to improve response times by 30%.\n• Integrated **Sentry** and **Datadog** for real-time monitoring and logging, allowing for rapid identification and troubleshooting of production issues, which reduced downtime by 25%.\n• Developed comprehensive dashboards using **Grafana** to visualize application performance and user metrics, leading to data-informed decision-making.\n• Collaborated with cross-functional teams to define user requirements and deliver high-quality software solutions on time and within budget.\n• Played a key role in adopting **OpenAPI** standards to enhance API documentation and streamline integration processes.\n• Conducted mentorship sessions for junior developers, promoting skills growth and team collaboration, which resulted in a 15% increase in overall team output.\n• Contributed to container orchestration and management using **Kubernetes**, ensuring scalable deployment strategies that scaled by 50% as the application user base grew.\n• Implemented caching strategies leveraging **Elasticsearch** for search capabilities and improved data retrieval times by 35%.\n• Engaged in regular code reviews and feedback sessions, fostering a culture of continuous improvement within the development team."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **Python** and **Django REST** to design and implement robust backend services, ensuring system scalability and performance benchmarks of a **99.9%** uptime.\nLeveraged **Celery** for task scheduling and **asynchronous processing**, optimizing task execution time by **30%**.\nEngaged in database management with **PostgreSQL** to enhance query performance, resulting in a **25%** reduction in response times.\nConfigured and integrated monitoring tools such as **Sentry**, **Datadog**, and **Grafana** for real-time system telemetry and alerting.\nCollaborated closely with frontend teams to ensure seamless integration using **OpenAPI** and provided mentorship on backend development practices.\nDeployed applications in a **Kubernetes** environment, improving deployment times and system reliability.\nDeveloped caching strategies to improve application performance, achieving load time reductions by **40%**.\nParticipated in code reviews and collaborative design sessions to maintain high coding standards and team alignment.\nDocumented APIs and system architecture in a clear, concise manner, aiding future development initiatives and knowledge sharing across teams.\nUtilized **Git** for version control, ensuring code integrity and facilitating a smooth collaboration process across a team of **10** engineers."
    }
  ],
  "skills": " **Programming Languages** \n\t Python\n\n **Backend Frameworks** \n\t Django, Django REST, Celery\n\n **Frontend Frameworks** \n\t HTML, CSS, JavaScript, TypeScript, ReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n **API Technologies** \n\t RESTful API, GraphQL, OpenAPI\n\n **Serverless and Cloud Functions** \n\t AWS, Azure, Serverless Framework\n\n **Databases** \n\t MSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB, ClickHouse\n\n **DevOps** \n\t CI/CD pipelines, Kubernetes, Sentry, Datadog, Grafana\n\n **Cloud & Infrastructure** \n\t Caching, Messaging & Caching: Apache Kafka, RabbitMQ, Redis\n\n **Other** \n\t Microservices, Testing Tools: NUnit, xUnit, Selenium, Moq, Postman, Cypress, JMeter, Jest, Solidity, Ether.js, Web3.js, Ethereum, UX/UI Design, Git, GitHub, Mentorship, Collaboration",
  "apply_company": "Search Atlas"
}