{
  "name": "Tomasz Lee",
  "role_name": "Senior Cloud Engineer",
  "email": "tomasz.lee8@outlook.com",
  "phone": "+48 732 145 942",
  "address": "Warsaw, Poland",
  "linkedin": "https://www.linkedin.com/in/tomasz-lee-b9a25a391/",
  "profile_summary": "Results-driven Senior Cloud Engineer with 9+ years of experience in cloud management, specializing in **AWS**, **GCP**, **Terraform**, **CloudFormation**, and **Kubernetes**. Proficient in leveraging modern observability tools such as **Prometheus**, **Grafana**, **PagerDuty**, **Freshdesk**, and **Zendesk** to enhance system performance and reliability. Strong expertise in networking and developing robust solutions using both frontend and backend technologies, including **ReactJS**, **NextJS**, **.NET**, and **C#**. Demonstrated ability to streamline development processes and collaborate effectively across teams to drive projects to successful completion while optimizing performance.",
  "education": [
    {
      "degree": "Master of Computer Science",
      "category": "",
      "from_year": "Apr 2012",
      "to_year": "Oct 2014",
      "location": "",
      "university": "National University of Singapore"
    },
    {
      "degree": "Bachelor of Computer Science",
      "category": "",
      "from_year": "Apr 2008",
      "to_year": "Mar 2012",
      "location": "",
      "university": "National University of Singapore"
    }
  ],
  "experience": [
    {
      "role": "Senior Cloud Engineer",
      "company": "CD Projekt RED",
      "from_date": "May 2022",
      "to_date": "Oct 2025",
      "location": "Warsaw, Poland",
      "responsibilities": "Utilized **AWS** and **GCP** for cloud management and deployment strategies, ensuring robust infrastructure reliability.\nImplemented **Terraform** and **CloudFormation** for infrastructure as code, streamlining the provisioning process by **50%**.\nManaged container orchestration using **Kubernetes**, enhancing deployment efficiency and scaling capabilities for applications.\nConducted observability tasks using **Prometheus** and **Grafana** for monitoring system performance and health, leading to quicker issue resolution by **30%**.\nIntegrated incident management tools such as **PagerDuty**, **Freshdesk**, and **Zendesk** to improve incident response times and customer support efficiency.\nDeveloped and maintained CI/CD pipelines with **Git**, **GitHub**, and **GitLab**, improving the release cycle by **40%**.\nCollaborated with developers to optimize application performance through efficient programming practices and networking strategies.\nImplemented Linux-based solutions, enhancing system management and operational efficiency.\nDesigned and developed a web-based customer management platform using **.NET 7**, **ReactJS**, and **Next.js**, improving user satisfaction by **25%**.\nOptimized databases and integrated various microservices, enhancing application resilience and scalability."
    },
    {
      "role": "Software Engineer",
      "company": "Sea Group",
      "from_date": "Mar 2018",
      "to_date": "Apr 2022",
      "location": "Shopee, Singapore",
      "responsibilities": "Utilized **AWS** and **GCP** to develop and deploy scalable cloud architecture solutions, contributing to a **20%** reduction in operational costs.\nDesigned and implemented **Terraform** scripts for infrastructure as code management, ensuring consistent environment setups and reducing provisioning time by **50%**.\nManaged and orchestrated containerized applications using **Kubernetes**, achieving a **40%** improvement in deployment speed and resource utilization.\nIntegrated **Prometheus** and **Grafana** for observability and monitoring, enabling proactive incident response and reducing downtime by **15%**.\nLeveraged **Git**, **GitHub**, and **GitLab** for version control and collaboration, streamlining the development workflow.\nDeveloped networking solutions and configurations in cloud environments, ensuring enhanced security and performance.\nConducted performance optimization for cloud resources, reducing latency by **30%** and improving application responsiveness.\nEngaged in incident management with **PagerDuty**, **Freshdesk**, and **Zendesk**, ensuring swift resolution of issues and maintaining high service availability.\nImplemented CI/CD pipelines to automate deployment processes, improving code release frequency by **25%**.\nCollaborated with cross-functional teams to gather requirements and provide cloud management solutions, ensuring alignment with business objectives."
    },
    {
      "role": "Software Developer",
      "company": "Grab Holdings Inc",
      "from_date": "Jan 2015",
      "to_date": "Feb 2018",
      "location": "Singapore",
      "responsibilities": "Utilized **AWS** and **GCP** cloud platforms to deploy scalable applications, ensuring high availability and optimized performance.\nImplemented **Terraform** for infrastructure as code, facilitating consistent environment management across development and production with a **10%** reduction in deployment time.\nManaged Kubernetes clusters, streamlining container orchestration and improving deployment efficiency by **25%**.\nEnhanced observability practices by incorporating **Prometheus** and **Grafana**, leading to improved system monitoring and alerting capabilities, which decreased downtime by **15%**.\nConducted network management activities, including load balancing and securing data flows, to bolster system security and accessibility.\nDeveloped and maintained CI/CD pipelines with **Git**, **GitHub**, and **GitLab**, promoting seamless code integration and delivery.\nCollaborated with support tools like **PagerDuty**, **Freshdesk**, and **Zendesk** to ensure prompt incident response and service sustainability.\nProvided extensive documentation and knowledge transfer sessions to equip team members with essential cloud management skills, enhancing team productivity by **20%**.\nParticipated in agile ceremonies, including daily standups and sprint planning, to align with project timelines and goals.\nAssured high-quality programming practices and code reviews to maintain coding standards and consistency across multiple projects."
    }
  ],
  "skills": "  **Programming Languages**\n\tJavaScript, TypeScript, Python, C#, Solidity\n\n  **Backend Frameworks**\n\tNodeJS, ExpressJS, NestJS, .NET\n\n  **Frontend Frameworks**\n\tReactJS, NextJS, VueJS, NuxtJS, Angular, Material UI, Three.js, D3.js, React Native, Flutter, Chakra UI, TailwindCSS\n\n  **API Technologies**\n\tRESTful API, GraphQL\n\n  **Serverless and Cloud Functions**\n\tAWS, GCP, Lambda\n\n  **Databases**\n\tMSSQL Server, MySQL, PostgreSQL, MongoDB, DynamoDB, CosmosDB\n\n  **DevOps**\n\tCI/CD pipelines, Terraform, CloudFormation, Kubernetes, Git, GitHub, GitLab, observability, networking, logging\n\n  **Cloud & Infrastructure**\n\tAWS, Azure, cloud management, Prometheus, Grafana, PagerDuty, Freshdesk, Zendesk, Linux\n\n  **Other**\n\tUX/UI Design, Redis, RabbitMQ, Apache Kafka, JMeter, Postman, Cypress, Moq, NUnit, xUnit, Jest, Microservices, programming",
  "apply_company": "Revolgy"
}