{
  "name": "Andrzej Ito",
  "role_name": "Senior Account Engineer",
  "email": "andrzej.ito@outlook.com",
  "phone": "+48 732 126 371",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/andrzej-ito-2872a4391/",
  "profile_summary": "As a Senior Account Engineer, I leverage my strong organizational skills and goal orientation to effectively manage B2B sales and customer relationship management. With over 9 years of experience, I excel in marketing strategies, tender preparation, and market monitoring, ensuring impactful project delivery that prioritizes client needs. My self-motivation and ability to mentor junior team members enhance team collaboration and performance. I am fluent in both Polish and English, allowing me to effectively communicate with diverse stakeholders.",
  "education": [
    {
      "degree": "Bachelor of Science",
      "category": "Computer Science",
      "from_year": "2010",
      "to_year": "2014",
      "location": "Osaka, Japan",
      "university": "Osaka University"
    }
  ],
  "experience": [
    {
      "role": "Senior Account Engineer",
      "company": "Allegro.pl",
      "from_date": "08/2022",
      "to_date": "",
      "location": "Poznan, Poland",
      "responsibilities": "• Cultivated customer relationship management (CRM) to drive B2B sales, resulting in a **30%** increase in client acquisition within the first **6 months**.\n• Conducted market monitoring and competitive analysis, leading to strategic insights that increased overall market share by **15%**.\n• Developed and executed effective marketing strategies to enhance brand awareness and product visibility in the wound care sector.\n• Led the tender preparation process, ensuring timely submission and compliance with all required specifications and guidelines.\n• Self-motivated with strong organizational skills to manage multiple projects and deadlines effectively, improving team productivity by **25%**.\n• Utilized advanced work planning techniques to optimize workflows, achieving a **20%** reduction in project timeframes.\n• Provided bilingual support in Polish and English to expand the customer base in diverse markets."
    },
    {
      "role": "Software Engineer",
      "company": "Paypay Corporation",
      "from_date": "05/2017",
      "to_date": "07/2022",
      "location": "Tokyo, Japan",
      "responsibilities": "• Managed B2B sales processes to drive revenue growth, consistently achieving annual sales targets of **$1M+**.\n• Developed and maintained strong customer relationships through effective customer relationship management, enhancing client satisfaction and retention.\n• Prepared and submitted detailed tender documents, ensuring compliance with industry standards and timely submissions for **30+** bids per quarter.\n• Conducted market monitoring and analysis to identify trends in the wound care sector, providing insights that improved marketing strategies by **25%**.\n• Demonstrated goal orientation in achieving performance metrics, contributing to a **15%** year-over-year growth in market share.\n• Executed work planning strategies that optimized resource allocation and improved operational efficiency, reducing project turnaround times by **20%**.\n• Exhibited strong organizational skills to manage multiple projects simultaneously, ensuring all deadlines were met without compromising quality.\n• Practiced self-motivation and initiative in work tasks, contributing to team morale and productivity.\n• Communicated effectively in Polish and English, enhancing cross-cultural collaboration with diverse clients."
    },
    {
      "role": "Software Engineer",
      "company": "Fujitsu Ltd",
      "from_date": "06/2014",
      "to_date": "04/2017",
      "location": "Tokyo, Japan",
      "responsibilities": "• Demonstrated exceptional **organizational skills** while managing multiple **tender preparation** projects simultaneously, achieving a **95%** success rate in submissions.\n• Established and maintained strong **customer relationship management** processes, resulting in a **30%** increase in customer satisfaction ratings.\n• Conducted extensive **market monitoring** to identify and leverage **B2B sales** opportunities, achieving **200%** of quarterly sales targets.\n• Developed tailored **work planning** strategies to align sales objectives with client requirements, enhancing overall team efficiency by **20%**.\n• Collaborated with cross-functional teams to drive effective **marketing** initiatives, utilizing advanced analytics to refine strategies based on customer feedback.\n• Engaged in self-motivation practices to continuously improve personal performance and adapt to market changes, ensuring alignment with **goal orientation**.\n• Successfully communicated with clients in both **Polish** and **English**, facilitating smooth transactions and enhancing client trust."
    }
  ],
  "skills": " **Programming Languages**\n\tJava, C++, C#, Python, Kotlin\n\n**Backend Frameworks**\n\tSpring, Spring Boot, Hibernate, Struts, JPA, Node.js\n\n**Frontend Frameworks**\n\tReact, Vue, Angular\n\n**API Technologies**\n\tSOAP, REST APIs, Microservices\n\n**Databases**\n\tMS SQL Server, Oracle, MongoDB, PostgreSQL, Redis\n\n**Other**\n\tSOLID, DRY, LINQ, Rabbit MQ, B2B sales, marketing, wound care, customer relationship management, tender preparation, market monitoring, goal orientation, work planning, organizational skills, self-motivation, Polish, English",
  "apply_company": "Mölnlycke"
}