{
  "name": "DANIEL HE",
  "role_name": "Senior FrontEnd Engineer",
  "email": "daniel.he8@outlook.com ",
  "phone": "+48 730 743 032",
  "address": "Rzeszów, Poland",
  "linkedin": "https://www.linkedin.com/in/daniel-he-a5a536397/",
  "profile_summary": "Dynamic Senior FrontEnd Engineer skilled in **C#**, **.Net**, **HTML**, **CSS**, **JavaScript**, and **Python**, with extensive experience in **UI/UX**, responsive design, and adaptive design. Proven track record in utilizing **Git** for version control and ensuring cross-browser compatibility for dynamic web applications. Experienced in leveraging Azure DevOps for streamlined project management and deployment. Previously excelled as a Full-Stack Software Engineer, recognized for creating scalable, reliable, user-centric applications across various sectors including healthcare, eCommerce, and finance. Committed to driving improvements through automation and architecting robust solutions while maintaining a high standard of clean and efficient code.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2016",
      "location": "Beijing, China ",
      "university": "Tsinghua University "
    }
  ],
  "experience": [
    {
      "role": "Senior FrontEnd Engineer",
      "company": "Britenet",
      "from_date": "Feb 2023 ",
      "to_date": "Present",
      "location": "Warsaw, Poland",
      "responsibilities": "Developed responsive and adaptive web applications utilizing **C#** and **.Net**, ensuring cross-browser compatibility and maintaining a seamless user experience.\nImplemented UI/UX optimizations with a focus on HTML, CSS, and JavaScript, leading to a **30%** reduction in user task completion time.\nCreated dynamic user interfaces with a responsive design mindset, enhancing engagement metrics by **25%**.\nUtilized **Git** for version control, achieving a collaborative workflow that maximized code quality and project efficiency.\nAutomated deployment processes using **Azure DevOps**, reducing deployment times by **70%**.\nConducted thorough testing and validation to ensure consistent user experience across different browsers and devices, contributing to a **40%** increase in customer satisfaction ratings.\nCollaborated closely with backend teams to integrate services seamlessly, improving overall application performance by **25%**."
    },
    {
      "role": "Software Engineer",
      "company": "Alibaba Group",
      "from_date": "Oct 2020 ",
      "to_date": "Dec 2022",
      "location": "Hangzhou, China",
      "responsibilities": "Utilized **C#** and **.Net** for developing high-performance front-end applications, ensuring cross-browser compatibility and responsive design.\nDesigned user interfaces with **HTML**, **CSS**, and **JavaScript**, enhancing UI/UX and improving user engagement by 30%.\nImplemented adaptive design principles, facilitating a consistent experience across devices and platforms.\nCollaborated with DevOps teams using **Azure DevOps**, streamlining deployment processes and improving delivery time by 40%.\nManaged source control and versioning with **Git**, maintaining project integrity and facilitating rapid development cycles.\nApplied **Python** for backend integration, improving data processing efficiency by 20%."
    },
    {
      "role": "Software Engineer ",
      "company": "Huawei Technologies Co., Ltd",
      "from_date": "May 2016 ",
      "to_date": "Sep 2020",
      "location": "Shenzhen, China ",
      "responsibilities": "Developed responsive web applications with **HTML**, **CSS**, and **JavaScript**, ensuring cross-browser compatibility and achieving a user satisfaction score of 95%.\nUtilized **Git** for version control, facilitating collaboration with team members on projects with over 20 contributors.\nEnhanced UI/UX design using adaptive design principles, leading to a 30% increase in user engagement metrics.\nImplemented unit testing in **C#** and **.Net** for comprehensive testing coverage, reducing deployment issues by 25%.\nLeveraged Azure DevOps to streamline CI/CD pipelines, achieving deployment times reduced to under 15 minutes per release."
    }
  ],
  "skills": "**Programming Languages**\n\tC#, Java, JavaScript, Go, Python, SQL, Swift, Kotlin\n\n**Backend Frameworks**\n\t.NET, Spring Boot, Spring Security, Hibernate, Node.js, Express.js, JPA, Kafka, RabbitMQ\n\n**Frontend Frameworks**\n\tHTML, CSS, React, Vue.js, Angular, Pixi.js, Redux, Next.js, React Router, Material-UI, Ant Design, D3.js, Webpack, Babel, Jest, UI/UX, responsive design, adaptive design, cross-browser compatibility\n\n**API Technologies**\n\tRESTful API design\n\n**Serverless and Cloud Functions**\n\tAWS Lambda, Azure DevOps\n\n**Databases**\n\tMySQL, PostgreSQL, Redis, MongoDB\n\n**DevOps**\n\tDocker, Kubernetes (AWS EKS), Jenkins, GitHub Actions, Terraform, AWS CodePipeline, Git\n\n**Cloud & Infrastructure**\n\tAWS (EKS, RDS, CloudFront, S3), API Gateway, CloudWatch, ELK Stack\n\n**Other**\n\tMicroservices, CI/CD, Infrastructure as Code (IaC), Data structures and algorithms, Agile/Scrum methodologies",
  "apply_company": "Greenberg Traurig"
}