{
  "name": "Patryk Zaslawski",
  "role_name": "Senior FHIR Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "As a seasoned Senior FHIR Engineer with 8+ years of experience in software engineering, I excel in integrating healthcare data standards including **FHIR**, **HL7**, **SNOMED CT**, **LOINC**, **ICD-10**, **CPT**, and **RxNorm**. Proficient in **Java**, **C#**, and **Python** (FastAPI, Django, Flask), I develop secure and efficient applications focused on healthcare solutions, ensuring compliance with **HIPAA** regulations. My skill set includes developing **RESTful APIs** and leveraging cloud services such as **AWS**, **Azure**, and **GCP** for robust application architecture. I am adept at leading projects with a strong emphasis on **SMART on FHIR** and **OAuth 2.0** authentication protocols. Additionally, I utilize my strong problem-solving abilities and effective communication skills to drive project success while mentoring junior developers towards professional growth.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior FHIR Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Led the development of a scalable, cloud-native Healthcare Experience Platform leveraging **Python** (FastAPI, Django, Flask) to ensure compliance with **FHIR**, **HIPAA**, **HL7**, and **GDPR** standards across **9** microservices.\n• Designed RESTful APIs integrating **OAuth 2.0** for secure data exchange between healthcare providers and third-party platforms, ensuring adherence to **CPT**, **ICD-10**, and **RxNorm** protocols.\n• Spearheaded the integration of payment gateways (**Stripe**, **PayPal**, **Adyen**) to facilitate secure, multi-currency transactions, enhancing patient engagement and financial workflows by **30%**.\n• Developed automated tokenization and end-to-end encryption strategies within the **Azure** ecosystem to secure sensitive health data, achieving **0 breaches** under PCI DSS compliance in the last **3 years**.\n• Architected and implemented ETL pipelines utilizing **Apache Airflow**, **Azure Event Hubs**, and **Kafka** to streamline batch and real-time data processing, enhancing data ingestion speeds by **50%**.\n• Built monitoring and observability solutions using **Prometheus**, **Grafana**, and **OpenTelemetry** across **10+** Python microservices, ensuring proactive issue resolution and operational insights.\n• Mentored a diverse team of **10+** engineers, fostering skills in **Python**, **JavaScript**, and cloud-native architecture on platforms like **AWS** and **Azure**.\n• Championed DevOps transformation by automating CI/CD pipelines with **GitHub Actions** and **Azure DevOps**, reducing deployment times by **40%** through the use of **Terraform** and **Helm**.\n• Established improved data storage and querying mechanisms with **PostgreSQL**, **Azure SQL**, and **MongoDB**, implementing effective indexing strategies to optimize performance for large datasets.\n• Integrated **ElasticSearch** and **Azure Cognitive Search** to enhance search capabilities across structured and unstructured healthcare records, significantly reducing average query times by **25%**.\n• Developed front-end integrations with popular frameworks such as **Angular**, **React** (v17-18), and **Vue** (v3.x) to enhance user experience for end-users interacting with the healthcare platform.\n• Guided the adoption of event-driven architecture using **Kafka** and **Azure Service Bus**, facilitating efficient asynchronous communication within distributed services.\n• Ensured compliance with **SOC 2**, **ISO 27001**, and other regulatory frameworks by embedding best security practices in Python microservices and cloud workflows."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Led the development and integration of **Python** microservices with strong focus on **FHIR** standards, ensuring compliance with **HIPAA** and improving data interoperability.\n• Designed and implemented **RESTful APIs** for **EHR** systems utilizing **OAuth 2.0** for secure access and authentication, streamlining information exchange with **SMART on FHIR** applications.\n• Migrated legacy systems to a **Python** ecosystem while maintaining support for industry standards like **HL7**, **SNOMED CT**, and **ICD-10**, resulting in improved functionality and flexibility.\n• Developed efficient data models for healthcare applications using terminology standards such as **LOINC**, **CPT**, and **RxNorm**, contributing to enhanced patient care and data accuracy.\n• Enhanced team performance through leadership in cross-functional projects, ensuring alignment with project timelines and effective communication across stakeholders.\n• Utilized **JavaScript** frameworks (React, Angular) to create intuitive user interfaces for healthcare applications, applying best practices in accessibility and usability.\n• Implemented cloud solutions on **Azure** and **AWS** for scalable application deployment, achieving a **40%** decrease in resource costs with effective management of cloud services.\n• Conducted thorough testing and validation of services to meet regulatory compliance, reducing incident reports by **25%** in the first year post-deployment.\n• Fostered a culture of problem-solving within the team, promoting innovative solutions to complex healthcare data challenges and improving service delivery.\n• Oversaw the integration of third-party services and APIs supporting healthcare workflows, ensuring all data exchanges adhered to stringent security protocols.\n• Managed continuous deployment pipelines using **Azure DevOps** and **GitHub Actions**, achieving a **50%** improvement in deployment frequency while maintaining high system availability.\n• Spearheaded the incorporation of data protection protocols into applications, ensuring secure patient information handling across all developed services."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "• Designed and optimized FHIR-compliant backend services using **Python (FastAPI, Django, Flask)**, significantly enhancing system interoperability and data exchange in healthcare applications.\n• Developed RESTful APIs compliant with **HL7, SNOMED CT, LOINC**, and **ICD-10** standards to ensure robust integration between electronic health records (EHR) and user interfaces for real-time medical data access.\n• Utilized** PostgreSQL, SQL Server, and MySQL** for managing healthcare data, improving query performance by up to **40%** and minimizing latency in high-demand environments.\n• Implemented OAuth 2.0 for secure user authentication across **RESTful API** endpoints, ensuring adherence to **HIPAA** compliance and enhancing data security in patient management systems.\n• Led the migration of legacy systems to **Python microservices**, preserving critical workflows while implementing **FHIR** standards for enhanced interoperability.\n• Integrated cloud services including **Azure**, **AWS**, and **GCP** for scalable and reliable backend solutions in healthcare applications, improving deployment efficiency and operational flexibility.\n• Applied modern JavaScript frameworks such as **React, Next.js, Angular, and Vue** to build responsive frontends, ensuring seamless interactions with patient data and healthcare services.\n• Implemented automated testing strategies using **PyTest, unittest**, and **Selenium** to maintain high code quality and reduce deployment issues by **30%**.\n• Conducted performance testing with **Apache JMeter** and **Locust** to ensure system stability during peak usage periods, with a focus on optimizing response time by adhering to best practices for **RESTful API** design.\n• Developed comprehensive documentation and led knowledge-sharing sessions to enhance team understanding of **FHIR, HL7**, and healthcare integration standards.\n• Enhanced patient communication by building real-time WebSocket-based features in Python, providing instant support to healthcare inquiries and improving patient satisfaction metrics by **25%**.\n• Implemented caching strategies with **Redis**, resulting in a **50%** reduction in database load and improved response times for frequently accessed healthcare resources.\n• Designed SEO-optimized, mobile-friendly healthcare web applications using **Next.js** and integrated with **Python APIs**, ensuring cross-device accessibility and user engagement."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, Java, C#, JavaScript\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs, RESTful API, OAuth 2.0, FHIR, HL7, SNOMED CT, LOINC, ICD-10, CPT, RxNorm, SMART on FHIR\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tAWS, Azure, GCP\n\n **Other:**\n\tJWT, Keycloak (OIDC, RBAC), Let’s Encrypt, Nginx, Certbot, HIPAA, problem-solving, communication, leadership",
  "apply_company": "Experis"
}