{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Backend Developer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-187801395/",
  "profile_summary": "Backend Developer with over 13 years of experience in building robust applications in the healthcare and financial sectors. Expertise in **Kotlin**, **Spring Boot**, and the design of **RESTful APIs** and **Web Services**. Adept at managing both relational and NoSQL databases while utilizing **Git** for version control and implementing CI/CD processes to ensure seamless integration and deployment.\nStrong knowledge of **Docker** and **Kubernetes** for containerization and orchestration. Proven experience in agile methodologies that enhance team collaboration and project success. \nOriginal strengths include delivering AI/ML-driven platforms utilizing **Python**, with a focus on predictive analytics and real-time processing. Proficient in deploying cloud-native services on **AWS** and **Azure**, with a commitment to compliance aligned with HIPAA and PCI DSS standards. Excellent problem-solving skills, attention to detail, and strong verbal and written communication abilities stand out in my professional profile.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Backend Developer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and maintained RESTful APIs using **Kotlin** and **Spring Boot** to power backend functionality for applications in healthcare and fintech domains.\nImplemented **Git** for version control, ensuring seamless collaboration within an agile team while adhering to **continuous integration** and **continuous deployment** practices.\nUtilized **Docker** and **Kubernetes** for containerization and orchestration, optimizing deployment processes and resource management.\nEngaged in rigorous testing by employing various **testing frameworks** to ensure high-quality code through unit, integration, and functional testing.\nDesigned and managed relational database (PostgreSQL) and NoSQL database (MongoDB) solutions, optimizing schema design for high availability and performance.\nContributed to the development of engaging front-end applications with **Angular**, while supporting back-end integration to enhance user experience.\nExecuted agile methodologies to promote iterative development and continuous improvements within cross-functional teams.\nProvided effective verbal and written communication to articulate technical concepts and project updates to stakeholders, contributing to overall team cohesion and project success.\nFocused on problem-solving and attention to detail in code reviews and debugging activities, ensuring robust and reliable application performance.\nCollaborated on deployment and maintenance strategies integrating external services and APIs, enabling scalable and secure web services for diverse software applications."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Developed scalable backend solutions utilizing **Kotlin** and **Spring Boot** for RESTful APIs, enhancing overall system performance and reliability.\nImplemented and maintained **NoSQL databases** and relational databases to efficiently handle and query financial data.\nCollaborated with front-end teams to design and integrate comprehensive web services using **Angular**, ensuring seamless user interactions.\nEngaged in Agile methodologies to optimize development processes, delivering features every **2 weeks** while maintaining high standards through **continuous integration** and **continuous deployment** practices.\nUtilized **Docker** and **Kubernetes** to containerize applications, enabling faster deployments and simplified scaling of applications, achieving a **30%** reduction in deployment time.\nManaged source code effectively with **Git**, ensuring version control across multiple releases.\nPerformed thorough testing using various **testing frameworks** to ensure software quality and reliability, achieving a **95%** test coverage.\nDemonstrated strong problem-solving skills and attention to detail while documenting technical processes and system architecture for clear verbal and written communication with stakeholders."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Developed RESTful APIs leveraging **Kotlin** and **Spring Boot** to build robust backend services for high-traffic applications, ensuring optimal system performance and reliability, achieving a **20%** reduction in response times.\nDesigned and implemented **Web Services** that communicate efficiently with frontend applications built on **Angular** (latest version), enabling seamless user interactions and speeding up feature delivery with **80%** quicker iteration cycles.\nManaged both relational databases (such as MySQL, PostgreSQL) and NoSQL solutions (including MongoDB), optimizing data queries and improving cache performance by leveraging **Redis**, resulting in a **40%** increase in data retrieval speeds during peak loads.\nEmployed **Docker** and **Kubernetes** for containerization and orchestration, facilitating CI/CD pipelines which decreased deployment time by **50%**, while maintaining high availability and scalability of services.\nAdhered to **agile methodologies** through effective collaboration with cross-functional teams, ensuring alignment on project goals and increasing team productivity by implementing daily stand-ups and regular retrospectives.\nUtilized **Git** for version control, enforcing code quality standards through pull request reviews and integration tests, leading to a **30%** drop in critical bugs during the production phase.\nEnhanced testing frameworks to support increased test coverage and reliability, leveraging tools like **JUnit** and **Mockito**, thereby improving release confidence and ensuring quality assurance benchmarks are met consistently.\nExhibited strong **problem-solving** skills by diagnosing system issues and implementing effective solutions in real-time, contributing to a **95%** uptime across services.\nDemonstrated meticulous **attention to detail** in code reviews and documentation, ensuring a clear understanding of project specifications and future maintainability of backend systems.\nCommunicated complex technical information effectively through **verbal** and **written communication**, facilitating stakeholder understanding and promoting a culture of shared knowledge among team members."
    }
  ],
  "skills": " **Programming Languages:**\n\tKotlin, Python, JavaScript/TypeScript\n\n **Backend Frameworks:**\n\tSpring Boot, FastAPI, Flask, Django\n\n **Frontend Frameworks:**\n\tAngular, React, Vue\n\n **API Technologies:**\n\tRESTful APIs, Web Services\n\n **Serverless and Cloud Functions:**\n\tAWS: Lambda, Azure: App Services\n\n **Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, relational databases, NoSQL databases\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, continuous integration, continuous deployment\n\n **Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3, Azure: Blob Storage, SQL Database, Terraform, Ansible, Helm, Docker Compose\n\n **Other:**\n\tMLflow, Airflow, Kubeflow, Git, agile methodologies, attention to detail, problem-solving, testing frameworks, Nginx, Let’s Encrypt, Certbot, Keycloak (OIDC, RBAC), OAuth2, JWT, verbal communication, written communication, frontend build tools"
}