{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Senior Software Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-261821397/",
  "profile_summary": "Senior Software Engineer with 13+ years of expertise in delivering high-performance applications, specializing in **TypeScript**, **React**, **Node.js**, **Postgres**, and **CI/CD**. Proven track record in frontend and backend development, adept at building scalable solutions and optimizing performance in complex environments.\nSkilled in **GraphQL** for efficient data-fetching and proficient in database management with **Postgres** and **Redis**. Experienced in collaborating with cross-functional teams, leveraging strong communication and collaboration skills for effective product management and user research.\nSuccessfully developed and deployed AI/ML-powered platforms, implementing microservices and event-driven architectures. Well-versed in compliance-driven development aligned with industry standards including HIPAA and PCI DSS. Demonstrated MLOps skills with frameworks like MLflow and Airflow, ensuring streamlined workflows and continuous integration.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable and maintainable applications using **TypeScript**, **Node.js**, and **React (17–18)**, aligning with user experience standards and ensuring high performance.\n• Designed GraphQL APIs to enhance data interactions with PostgreSQL for efficient data retrieval and management, supporting complex queries from the client-side.\n• Implemented CI/CD pipelines utilizing tools such as **GitHub Actions** and **CircleCI**, ensuring automated testing and seamless deployments across environments, reducing deployment time by **30%**.\n• Collaborated with cross-functional teams, leveraging strong communication and collaboration skills to translate user research insights into technical solutions and prototypes.\n• Prioritized and managed product features effectively, ensuring alignment with business objectives and user needs, while adhering to agile project management methodologies.\n• Conducted user research to inform the development process, enhancing user satisfaction by implementing feedback-driven design improvements.\n• Created and maintained Redis for caching strategies, resulting in a **50%** performance improvement in data retrieval times.\n• Actively participated in prototyping sessions to iterate on product features reflecting user-centered design principles, expediting the development lifecycle.\n• Led workshops and presentations to communicate project statuses and technical challenges, enhancing team collaboration and stakeholder engagement."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "• Developed scalable front-end applications using **TypeScript**, **React (18)**, and **Next.js**, ensuring high performance and responsive design for user interfaces in financial tools.\n• Enhanced back-end services by leveraging **Node.js** and **Postgres** for reliable data management and efficient processing in financial applications.\n• Implemented **CI/CD** practices to streamline deployment processes, facilitating quicker product iterations and improving delivery timelines by **30%**.\n• Collaborated closely with product management and user research teams to gather requirements and feedback, fostering a user-centric approach in **prototyping** new features for financial services.\n• Conducted comprehensive user research, leading to the development of user-friendly interfaces which enhanced user engagement metrics by **25%**.\n• Utilized **Redis** for caching mechanisms to significantly improve data retrieval times, resulting in a **20%** reduction in load times for dynamic web applications.\n• Established effective communication channels within cross-functional teams to ensure project alignment and increase collaboration efficiency, resulting in improved team productivity by **15%**.\n• Designed and implemented real-time analytics using **GraphQL** for data querying, enabling users to access critical financial insights on demand."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Utilized **TypeScript** to develop scalable applications, leveraging **React (18)** to craft intuitive user interfaces that boost user engagement and meet business requirements.\nCollaborated on product management tasks, ensuring alignment of technical delivery with user research findings and stakeholder goals, enhancing product quality and customer satisfaction.\nIntegrated **Node.js** for backend services, ensuring robust architecture and interoperability with **Postgres** for reliable data management and secure transactions.\nEstablished CI/CD pipelines for streamlined deployment processes and continuous improvement, significantly reducing deployment times by up to **50%**.\nDeveloped caching strategies using **Redis** to optimize performance, leading to application responsiveness improvements over **30%**.\nImplemented GraphQL APIs for efficient data retrieval, minimizing the number of requests made and improving overall application performance.\nEngaged in ongoing user research to iterate on product features, collaborating closely with cross-functional teams to refine product offerings based on user feedback.\nLeveraged prototyping techniques to rapidly develop MVP features, enabling quick iterations and responsive adjustments in line with market demands.\nFostered a culture of clear communication and collaboration within the team, leading to a more engaged and productive development environment.\nActively contributed ideas and insights during brainstorming sessions, aiding in the conceptualization of new features and improvements."
    }
  ],
  "skills": "**Programming Languages:**\n\tPython\n\tJavaScript\n\tTypeScript\n\n**Backend Frameworks:**\n\tFastAPI\n\tFlask\n\tDjango\n\tNode.js\n\n**Frontend Frameworks:**\n\tReact\n\tVue\n\tAngular\n\n**API Technologies:**\n\tGraphQL\n\n**Serverless and Cloud Functions:**\n\tAWS: Lambda\n\tAzure: App Services\n\n**Databases:**\n\tPostgreSQL\n\tMySQL\n\tMongoDB\n\tRedis\n\n**DevOps:**\n\tDocker\n\tKubernetes\n\tGitHub Actions\n\tGitLab CI/CD\n\tTerraform\n\tAnsible\n\tHelm\n\tDocker Compose\n\n**Cloud & Infrastructure:**\n\tAWS: ECS, RDS, S3\n\tAzure: Blob Storage, SQL Database\n\n**Other:**\n\tMLflow\n\tAirflow\n\tKubeflow\n\tAuthentication & Security: Keycloak (OIDC, RBAC), OAuth2, JWT\n\tNginx, Let’s Encrypt, Certbot\n\tPrototyping\n\tProduct Management\n\tUser Research\n\tCommunication\n\tCollaboration",
  "apply_company": "Ashby"
}