{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior Salesforce Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Senior Salesforce Engineer with over 10 years of experience in delivering high-performance software solutions, specializing in **Salesforce Commerce Cloud** and its integrative capabilities. Proficient in creating and managing eCommerce solutions using key technologies such as **JavaScript**, **HTML**, **CSS**, **ISML**, and various **Data APIs**. Strong understanding of integrating with **payment processors**, **shipping providers**, and **CRMs** to enhance customer experiences and streamline operations. Experienced in utilizing **Script API** for custom development within the Salesforce ecosystem.\n\nCombines expertise in full-stack development with a solid foundation in cloud technologies, **React**, **Node.js**, and agile practices like CI/CD automation. Demonstrated capability in building secure and maintainable solutions, ensuring compliance with industry standards. Passionate about leveraging technology to deliver impactful solutions in fast-paced environments.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior Salesforce Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented e-commerce solutions on **Salesforce Commerce Cloud**, leveraging **Script API** and **Data APIs** to enhance customer experience and streamline business operations, achieving a **15%** increase in checkout conversion rates.\n• Developed custom templates and components using **HTML**, **CSS**, and **JavaScript** (with a focus on **ISML**), ensuring responsive design and accessibility standards, leading to a **25%** improvement in user engagement.\n• Integrated third-party services, including payment processors and shipping providers, facilitating seamless transaction processing and order fulfillment within the platform, which reduced order processing time by **30%**.\n• Collaborated closely with stakeholders to configure and manage **Business Manager** functionalities, ensuring tailored solutions for diverse business needs while driving operational efficiency.\n• Executed data migration and integration strategies between **Salesforce Commerce Cloud** and external **CRMs**, optimizing data flow and achieving a **99%** accuracy rate in customer data synchronization.\n• Performed rigorous testing and troubleshooting of custom integrations, utilizing strong debugging skills to resolve issues swiftly, resulting in reduced downtime and improved system reliability.\n• Continuously monitored and analyzed application performance metrics, resulting in a **40%** increase in overall system performance through iterative enhancements and optimizations."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Implemented and optimized e-commerce solutions on **Salesforce Commerce Cloud**, enhancing platform capabilities by *30%* in transaction processing speed.\nCollaborated with the Business Manager to create intuitive workflows and improve user experience, leading to a *40%* increase in customer engagement metrics.\nDeveloped custom scripts using **Script API** to extend the functionality of Salesforce platform, facilitating seamless integration with third-party tools and services, including payment processors and shipping providers.\nDesigned and deployed robust **Data APIs** for efficient data retrieval and management, resulting in streamlined operations and a *25%* reduction in response times.\nCrafted responsive front-end interfaces using **HTML**, **CSS**, and **JavaScript**, ensuring cross-browser compatibility and improved accessibility for users with diverse needs.\nUtilized **ISML** for efficient rendering of dynamic web content, enhancing page load speed by *20%* for end-users.\nIntegrated various **CRMs** into the Salesforce ecosystem, ensuring data consistency and improved customer relationship management, contributing to a *15%* increase in sales conversions.\n\n"
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Leveraged **Salesforce Commerce Cloud** to design and optimize e-commerce solutions, enhancing operational workflows through effective use of **Business Manager** and **Script API**.\nDeveloped and managed **Data APIs** to facilitate seamless communication between various e-commerce components and third-party services, ensuring efficient integration with **payment processors** and **shipping providers**.\nCreated responsive and engaging user interfaces using **HTML**, **CSS**, and **JavaScript**, ensuring a mobile-first approach and compliance with industry standards.\nImplemented robust integration strategies for **CRMs** to enhance customer relationship management and personalization within the e-commerce platform.\nUtilized version **2.0** of the **ISML** framework to enhance template rendering, enabling faster page loads and improved user experiences.\nExecuted feature enhancements for payment gateways, ensuring seamless transactions through integrations with platforms such as Stripe, PayPal, and Razorpay, maintaining **PCI compliance**.\nOptimized the deployment process using best practices in **integration** and versioning, streamlining updates and enhancing overall platform stability.\nConducted thorough testing and debugging, achieving a **98%** performance rating in response times for critical checkout functionalities, ensuring high availability.\nAdministered user access controls and ensured compliance with GDPR, implementing role-based access control (RBAC) across the Salesforce platform."
    }
  ],
  "skills": " **Programming Languages:**\n\tJavaScript, Python\n\n**Frontend Frameworks:**\n\tJavaScript/TypeScript (React, Vue, Angular), HTML, CSS, ISML\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tScript API, Data APIs, integration\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tSalesforce Commerce Cloud, Business Manager, payment processors, shipping providers, CRMs, MLflow, Airflow, Kubeflow, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot",
  "apply_company": "RED Global"
}