{
  "name": "Patryk Zaslawski",
  "role_name": "Senior SRE Engineer",
  "email": "patrykzas0428@outlook.com",
  "phone": "+48669862402",
  "address": "Gdanski, Poland",
  "linkedin": "https://www.linkedin.com/in/patryk-z-9b9455391/",
  "profile_summary": "Results-driven Senior SRE Engineer with 8+ years of experience in software engineering, specializing in **Python** and **Linux** environments. Proven track record in building and maintaining **microservices** architectures to deliver high-performance and reliable solutions. Expertise in **Redis**, **FastAPI**, and **Celery** for efficient asynchronous processing. Strong background in **CI/CD** pipelines and deployment strategies using **Ansible** and **Git**, ensuring seamless integration and delivery. Committed to adhering to **SOLID**, **DRY**, and **Clean Code** principles to create maintainable and scalable systems. Adept at **performance optimization** and incident response strategies, contributing to refined post-mortem analyses and documentation practices. Known for mentoring teams and fostering collaboration, I leverage advanced problem-solving skills and leadership to drive project success while meeting business objectives.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2014",
      "to_year": "2017",
      "location": "United Kingdom",
      "university": "The University of Manchester"
    }
  ],
  "experience": [
    {
      "role": "Senior SRE Engineer",
      "company": "Binary Studio",
      "from_date": "Aug 2023",
      "to_date": "Present",
      "location": "United Kingdom (Remote)",
      "responsibilities": "• Spearheaded the architectural design and development of a scalable, cloud-native Healthcare Experience Platform utilizing **Python** and **FastAPI**, ensuring high performance and reliability across microservices.\n• Championed the implementation of **CI/CD** pipelines using **Git** and **Ansible**, achieving a **30%** increase in deployment efficiency and consistency.\n• Optimized microservices performance by leveraging **Redis** for caching, resulting in a **50%** reduction in response times and enhanced user experience.\n• Completed a successful transition to **asynchronous** architectures, leading to significant improvements in system responsiveness and resource utilization.\n• Enforced software development best practices such as **SOLID**, **DRY**, and **Clean Code**, fostering a culture of quality and maintainability within the engineering team.\n• Mentored junior engineers in **Python** and microservices development, enhancing team skills in problem-solving, documentation, and incident response strategies.\n• Developed and maintained comprehensive documentation for system architectures and workflows, ensuring knowledge transfer and easier onboarding for new team members.\n• Collaborated with cross-functional teams to troubleshoot, resolve incidents effectively, and conduct post-mortem analyses to prevent future issues.\n• Implemented performance optimization techniques across Python-based applications, ensuring adherence to industry standards and reliability.\n• Led efforts in maintaining **Linux** server environments to support microservices, enhancing operational stability and performance across all projects.\n• Championed a collaborative environment that emphasized leadership, encouraging proactive communication, problem-solving, and innovative thinking among team members."
    },
    {
      "role": "Software Engineer",
      "company": "Ardigen",
      "from_date": "Mar 2020",
      "to_date": "Aug 2023",
      "location": "Poland",
      "responsibilities": "• Spearheaded the migration to a **Python** (including **FastAPI**, **Django**, and **Flask**) microservices architecture, enhancing scalability and performance by **90%** through seamless integration with SQL Server, PostgreSQL, and MongoDB.\n• Designed and implemented robust RESTful and gRPC APIs using **Python**, ensuring secure and efficient communication between internal applications with a **50%** reduction in response latency.\n• Refactored legacy .NET/VB.NET systems into **Python** microservices, ensuring compatibility while preserving critical business functionality and achieving a **70%** improvement in maintainability.\n• Collaborated with frontend teams to build dynamic, user-centric interfaces integrated with **Python** backends using frameworks like **Angular**, **Vue**, **React**, and **Next.js**, applying **Redux/NgRx** for performance.\n• Developed a real-time transaction monitoring dashboard powered by **Python** APIs with an **Angular** UI, integrated with **Power BI** to enhance reporting capabilities by **80%**.\n• Implemented efficient system integrations with **MuleSoft** and **Python** services for streamlining ACH transfers and credit card payments, reducing transaction processing time by **60%**.\n• Ensured data protection in **Python** services with **RBAC**, **OAuth 2.0**, and **JWT**, maintaining compliance with strict financial regulations.\n• Optimized **SQL Server**, **DynamoDB**, and **Redis** performance through fine-tuned **Python** queries, ensuring high availability and reliability for transactional data.\n• Leveraged **Kafka** and **RabbitMQ** to build an event-driven architecture with **Python** microservices, capable of processing **10,000+** transactions per second.\n• Configured and managed **Azure Service Bus** using **Python** for reliable message brokering, improving system modularity by **40%**.\n• Designed secure authentication mechanisms in **Python** APIs using **OAuth 2.0**, significantly enhancing security measures for user data.\n• Developed fraud detection services in **Python**, utilizing **Azure Machine Learning** models to identify suspicious activities with **95%** accuracy.\n• Created secure payment gateway integrations with **Python**, ensuring PCI compliance for ACH transfers, credit card payments, and wire transfers.\n• Built serverless components using **AWS Lambda** and **Azure Functions** to create ETL pipelines, lowering infrastructure overhead by **30%**.\n• Implemented the **ELK stack** (Elasticsearch, Logstash, Kibana) with **Python** services for centralized logging and monitoring, improving issue resolution time by **40%**.\n• Managed **Kubernetes** clusters for deploying **Python** microservices, facilitating rolling updates and enabling **99.9%** uptime.\n• Applied best practices in **Python** development including automated testing with **PyTest** and integration testing, ensuring reliability in backend services.\n• Designed integration solutions in **Python** with **MuleSoft** for secure external data exchange, ensuring compliance with financial security standards.\n• Contributed to event-driven architecture enhancements using **Kafka**, **RabbitMQ**, and **Azure Service Bus**, improving overall system performance and resilience.\n• Integrated unit tests and CI/CD pipelines (using **Azure DevOps** and **GitHub Actions**) for automation in quality assurance and continuous delivery."
    },
    {
      "role": "Software Engineer",
      "company": "Altum Software",
      "from_date": "Oct 2017",
      "to_date": "Feb 2020",
      "location": "United Kingdom",
      "responsibilities": "Designed and optimized backend services for an e-commerce platform using **Python** (**FastAPI**, **Django**, **Flask**, **SQLAlchemy**), improving scalability and performance, ensuring a seamless user experience across checkout, cart, and order fulfillment modules.\n\n- Developed robust RESTful APIs in **Python** to handle high-volume transactions, ensuring integration between frontend interfaces and backend systems, facilitating real-time customer interactions and optimizing performance.\n- Incorporated **microservices** architecture, enhancing deployment flexibility and maintenance efficiency, allowing for easy scaling of applications, resulting in a 30% increase in throughput during peak hours.\n- Utilized **Redis** for caching strategies in **Python** services, significantly reducing database load by **50%** and enhancing response times for frequently accessed resources.\n- Automated builds, testing, and deployments with **CI/CD** pipelines (GitHub Actions, Azure DevOps, Jenkins) to assure a reliable delivery process, reducing deployment time by **40%**.\n- Mentored junior developers on best practices in **Python** development and **Clean Code** principles, fostering a culture of continuous learning and collaboration.\n- Conducted performance optimization initiatives, leading to a **25%** improvement in system response times under high concurrent user loads.\n- Leveraged **Git** for version control, ensuring efficient code management and collaboration among team members.\n- Engaged in incident response and post-mortem analysis, implementing lessons learned to enhance system resilience and uptime, decreasing incident recurrence by **15%**.\n- Documented system architecture and processes using best practices to facilitate onboarding and future development efforts.\n- Collaborated with cross-functional teams to troubleshoot problems, ensuring smooth operational workflows and contributing to overall team success.\n- Designed and developed automated monitoring solutions for **performance optimization**, employing tools like **Prometheus** and **Grafana** to maintain system health and respond promptly to anomalies.\n- Applied SOLID and DRY principles to foster maintainable codebases, significantly improving code quality and reducing technical debt.\n- Successfully transitioned legacy systems to **microservices**, modernizing backend infrastructures and allowing for quick adaptations to business needs."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython\n\n **Backend Frameworks:**\n\tFastAPI, Django, Flask, Spring Boot, Celery\n\n **Frontend Frameworks:**\n\tAngular (1–16), React (15–18), Next.js, Vue.js (2/3), Blazor\n\n **API Technologies:**\n\tREST & gRPC APIs\n\n **Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD\n\n **Cloud & Infrastructure:**\n\tLinux, Keycloak (OIDC, RBAC), JWT, OAuth2, Let’s Encrypt, Nginx, Certbot\n\n **Other:**\n\tmicroservices, asynchronous, Ansible, Git, CI/CD, SOLID, DRY, Clean Code, OOP, performance optimization, mentoring, incident response, post-mortem, documentation, collaboration, problem-solving, leadership",
  "apply_company": "Raidboxes"
}