{
  "name": "Mariusz Jan Skobel",
  "role_name": "Conversational Voice System Developer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-789557397/",
  "profile_summary": "Conversational Voice System Developer with 10+ years of experience implementing high-performance software solutions, specifically within healthcare and finance sectors. Expertise in **Python**, **Django**, **FastAPI**, and microservices architecture for designing and developing scalable systems. Proficient in cloud services including **AWS**, leveraging tools such as **Amazon Connect** and **Amazon Lex** for building voice-driven applications. Strong skills in API orchestration, event-driven workflows, and technical design, ensuring systems are robust and optimized for performance. Demonstrated experience in data modeling with both SQL and NoSQL, focusing on query optimization and call flow enhancement to improve voice agent accuracy and reduce latency. Committed to fostering collaboration and mentorship within development teams to elevate project delivery. Passionate about deploying generative AI solutions to enhance real-time analytics and automate decision-making processes.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Conversational Voice System Developer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "•\tDeveloped and implemented **Conversational Voice Systems** using **Python**, enhancing voice agent accuracy and optimizing call flows through advanced **AWS** services like **Amazon Lex** and **Amazon Connect**.\n•\tDesigned scalable **API orchestration** for voice interactions, ensuring seamless integration and low latency across **microservices**.\n•\tLed the transition to **event-driven workflows**, optimizing system architecture for responsiveness and scalability in high-volume environments.\n•\tBuilt and maintained **data modeling** frameworks, employing both **SQL** and **NoSQL** databases for effective data storage and retrieval supporting voice interaction features.\n•\tEnhanced system performance with **query optimization**, leading to a remarkable **30% reduction** in latency for user interactions.\n•\tIntegrated **Generative AI** models to improve user experience, delivering personalized responses and adapting to user queries in real time, resulting in a **25% increase** in user engagement metrics.\n•\tConducted comprehensive **technical design** reviews and implemented best practices that improved overall system reliability and maintainability.\n•\tProvided mentorship to junior developers, fostering a collaborative environment and enhancing team problem-solving capabilities.\n•\tEstablished testing strategies using frameworks such as **PyTest** and **Postman**, achieving **95% test coverage** across systems for robust system performance.\n•\tCollaborated effectively with cross-functional teams to design and optimize voice interfaces, leveraging insights from users to refine interactions."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Developed and modernized conversational voice systems leveraging **Python** (Django, FastAPI) and **Flask** frameworks to enhance **systems architecture** and support an effective **microservices** design.\nIntegrated **AWS** services including **Amazon Connect** and **Amazon Lex** to implement robust & scalable voice workflows, achieving up to **90% voice agent accuracy** in customer interactions.\nDesigned and orchestrated **API orchestration** strategies to facilitate seamless communication between systems, improving **latency reduction** by **30%**.\nEmployed **Generative AI** techniques to enhance user interactions, ensuring dynamic and engaging conversations that adapt to user preferences.\nCollaborated in the development of **event-driven workflows** that enable real-time processing and analysis of conversational data, delivering insights that drive system improvements.\nImplemented sophisticated **data modeling** practices and optimized **SQL** and **NoSQL** queries for efficient data retrieval in voice applications, reducing response time by **25%**.\nMentored junior developers on best practices in technical design and **problem-solving**, fostering a collaborative and innovative team environment.\nUtilized a strong focus on **call flow optimization** to deliver smooth and responsive user experiences in complex conversational scenarios."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Developed scalable and efficient backend systems for conversational voice applications using **Python** frameworks such as **Django** and **FastAPI**, with a focus on **microservices** architecture to ensure low latency and high availability across voice interaction modules.\nEngineered **event-driven workflows** utilizing **AWS** services to optimize call flow and improve voice agent accuracy, reducing average latency by **30%** across all voice interactions.\nDesigned and implemented API orchestration strategies that facilitate dynamic interaction with voice agents, streamlining user access to conversational capabilities via **API orchestration**.\nLeveraged **NoSQL** databases for rapid data modeling and query optimization, achieving a **50%** improvement in data retrieval speeds necessary for real-time voice processing.\nCollaborated with cross-functional teams to tackle complex problems, mentoring junior developers in **technical design** and best practices for **systems architecture**.\nIntegrated **Amazon Connect**, **Amazon Lex**, and generative AI models to enhance voice response accuracy and user experience, contributing to an overall **25%** increase in user satisfaction ratings.\nConducted thorough assessments of existing systems for **latency reduction** and performance tuning, ensuring the development of robust and resilient conversational interfaces.\nEmployed **Flask** for lightweight microservice deployment, facilitating quick iterations and enhancements based on user feedback.\nEngineered real-time monitoring and logging solutions to troubleshoot and optimize voice workflows effectively.\nApplied strong problem-solving skills to navigate complex technical design challenges, ensuring successful project delivery within timelines."
    }
  ],
  "skills": "Programming Languages:\n\tPython, JavaScript/TypeScript\n\nBackend Frameworks:\n\tFastAPI, Flask, Django\n\nFrontend Frameworks:\n\tReact, Vue, Angular\n\nAPI Technologies:\n\tAPI orchestration\n\nServerless and Cloud Functions:\n\tAWS (ECS, Lambda, RDS, S3), Amazon Connect, Amazon Lex\n\nDatabases:\n\tPostgreSQL, MySQL, MongoDB, SQL, NoSQL\n\nDevOps:\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\nCloud & Infrastructure:\n\tAzure (App Services, Blob, SQL)\n\nOther:\n\tGenerative AI, Systems Architecture, Microservices, Event-driven workflows, Data modeling, Query optimization, Call flow optimization, Latency reduction, Voice agent accuracy, Technical design, Mentorship, Problem-solving, Collaboration"
}