{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Digital Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a skilled Senior Digital Engineer, I bring 8 years of profound expertise in **Python**, leveraging my deep knowledge of **Digital Logic**, **RTL Design**, and **Testbench Development** to deliver high-performance digital solutions. My proficiency extends to advanced debugging and regression testing, ensuring accurate and reliable results. I have extensive experience with **Simulation** tools, particularly **Cadence Xcelium**, optimizing testing processes with **Perl** and **Bash** scripting.\n\nI have successfully led projects in high-stakes environments, focusing on robust, scalable systems. My experience in full-stack development with frameworks such as **React**, **Next.js**, and **Node.js** complements my understanding of complex architectures. Additionally, I possess strong cloud capabilities using services such as **AWS** and **Azure**, ensuring that all solutions meet industry compliance standards. My commitment to quality and innovation drives my passion for developing efficient and effective solutions.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Digital Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Developed and optimized complex testbench architectures for digital logic simulations using **SystemVerilog**, enhancing simulation accuracy and efficiency by **25%**.\nImplemented a robust testing framework leveraging **UVM** for structured and reusable testbench components, significantly reducing regression testing time by **30%**.\nExecuted comprehensive regression testing and debugging strategies with **Cadence Xcelium** to ensure reliable RTL designs and compliance with product specifications, resulting in a **20%** increase in defect detection.\nUtilized **Python** and **Perl** scripts for automation of simulation tasks and test data generation, streamlining workflows and reducing manual effort by **40%**.\nDesigned and developed RTL designs that align with industry standards, leading to improved performance and integration time for new product features by **15%**.\nMaintained and enhanced existing digital design verification environments, contributing to a **50%** improvement in simulation turnaround time through effective resource management and optimization techniques.\nConducted detailed debugging sessions using advanced tools and techniques, facilitating early identification and resolution of design issues, thus minimizing integration delays by **35%**.\nCollaborated with cross-functional teams to facilitate smooth integration of designs and verification processes, ensuring alignment with project timelines and deliverable quality.\nLeveraged **Bash** for scripting efficient automation processes as part of continuous integration in the build pipeline, improving team productivity and software delivery cycles.\nIntegrated new methodologies and tools into the existing verification environment, paving the way for adopting forward-thinking practices in digital design and verification."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Enhanced RTL Design and Testbench Development processes by leveraging **SystemVerilog** and **UVM**, achieving a **30%** reduction in simulation time for complex digital logic systems.\nUtilized **Cadence Xcelium** for simulation and regression testing, conducting thorough debugging that led to improved code quality and a **25%** decrease in post-simulation issues.\nDeveloped Python scripts to automate testing and simulation tasks, significantly increasing efficiency in testbench development and regression analysis.\nImplemented robust **Bash** scripts for build and deployment automation, leading to consistent environments and a **40%** faster turnaround time for releasing updates.\nConducted comprehensive digital logic simulations, ensuring compliance with specifications and functional requirements to achieve higher reliability in design validation.\nCollaborated with cross-functional teams to fine-tune simulation parameters, which resulted in optimized performance metrics for high-density digital logic designs.\nExecuted targeted regression testing cycles, utilizing Perl for parameter analysis, ensuring all legacy and new features were validated adequately and reducing bug occurrences in production."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Developed and optimized **Testbench Development** processes using **SystemVerilog** and **UVM** for comprehensive validation of digital logic designs, ensuring robustness and reliability in deployments.\nEngineered **Digital Logic** for high-performance **RTL Design**, participating in **simulation** processes and implementing regression testing that improved verification efficiency by **30%**.\nUtilized **Cadence Xcelium** for advanced simulation techniques to maximize debugging efficiency and reduce cycle time on tests, achieving up to **15%** better performance metrics.\nSpearheaded automation scripts using **Python**, **Perl**, and **Bash** to streamline **Debugging**, significantly reducing manual effort by **40%** and enhancing overall productivity in test environments.\nCollaborated with cross-functional teams to refine testing methodologies and uphold high standards in **Regression Testing**, leading to higher test coverage and improved system reliability metrics.\nDesigned modular and reusable components in **SystemVerilog** to facilitate easier updates and maintenance, resulting in a **25%** reduction in integration time across multiple projects.\nAdopted industry best practices in **Simulation** to ensure precision on digital circuits, influencing positive feedback from peers and reducing error rates by over **20%** across projects.\nImplemented a structured version control approach, improving team collaboration and visibility into changes across all testbench developments and digital system designs."
    }
  ],
  "skills": " **Programming Languages:** \n\tPython, Perl, Bash, SystemVerilog\n\n**Backend Frameworks:** \n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:** \n\tJavaScript, TypeScript, React, Vue, Angular\n\n**API Technologies:** \n\tJWT, OAuth2\n\n**Serverless and Cloud Functions:** \n\tAWS (ECS, Lambda), Azure (App Services)\n\n**Databases:** \n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:** \n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:** \n\tAWS (S3, RDS), Azure (Blob, SQL), Nginx, Certbot.\n\n**Other:** \n\tDigital Logic, RTL Design, UVM, Testbench Development, Simulation, Debugging, Regression Testing, MLflow, Airflow, Kubeflow",
  "apply_company": "Oxford Nanopore Technologies"
}