{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Full Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a dedicated Senior Full Stack Engineer with 8 years of experience, I excel in utilizing **Node.js**, **VueJS**, and modern JavaScript technologies to build high-performance applications. My strong skills in **CSS**, **HTML**, and various tools such as **Git**, **Webpack**, and **npm** enhance my development process and ensure efficient, scalable web solutions. I implement **Test-Driven Development** practices using **Mocha** and **Jest**, ensuring high-quality code and reliability in production environments. \n\nBeyond my proficiency in web technologies, I have substantial expertise in developing enterprise-grade platforms within the healthcare and financial sectors, integrating AI capabilities for predictive analytics and intelligent automation. I possess a strong foundation in microservices architecture, event-driven systems, and CI/CD automation. My cloud experience spans both **Azure** and **AWS**, and I adhere to compliance standards like HIPAA, FHIR, PCI DSS, and SOC 2. Additionally, I have hands-on experience in machine learning pipeline development and MLOps workflows utilizing tools such as MLflow, Airflow, and Kubeflow.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Full Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "- Developed innovative AI-based features in client-facing applications, enhancing user experiences with predictive alerts and personalized recommendations powered by trained models.\n- Engineered efficient and robust applications utilizing **Node.js**, **VueJS**, **CSS**, **JavaScript**, and **HTML**, which improved overall performance and user engagement by up to **30%**.\n- Ensured clean and maintainable code through robust Test-Driven Development practices, employing tools such as **Jest**, **Mocha**, and **Cypress** to achieve over **90%** code coverage across projects.\n- Collaborated effectively in a team environment, utilizing **Git** for version control and incorporating **Webpack** to manage asset bundling and optimizations for seamless deployments.\n- Optimized front-end performance using **PostCSS** and **SASS**, leading to an improved load time of around **20%** across the applications.\n- Implemented and maintained CI/CD pipelines using **GitHub Actions** for effective multi-environment deployments, minimizing release times significantly by up to **50%**.\n- Developed extensive documentation and testing strategies, ensuring clarity and adherence to coding standards during sprints, thus improving team productivity metrics by **30%**.\n- Engaged in continuous learning to adapt to emerging technologies and methodologies, actively participating in code reviews which led to enhanced product quality and team collaboration."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Developed and modernized web applications leveraging **Node.js** for server-side logic and **Vue.js** for dynamic user interfaces, ensuring a seamless user experience across financial platforms.\nUtilized **JavaScript** (ES6) and **CSS** techniques to enhance the responsiveness and performance of applications, adhering to best practices with a Test-Driven Development (TDD) approach using **Mocha** and **Jest** for rigorous quality assurance.\nManaged source code and collaborated with teams using **Git** for version control, facilitating a streamlined development workflow with integrated CI/CD practices.\nConstructed user-friendly components in **HTML** and **CSS**, employing methodologies such as **SASS** and **PostCSS** to style applications efficiently and maintainably.\nImplemented build processes using **Webpack** and ensured smooth package management with **npm**, optimizing throughput for high-volume transactions within financial systems.\nCollaborated on backend development tasks in **PHP** using the **Symfony** framework, enhancing functionality and performance for core application features.\nMaintained platform reliability and performance, achieving a **30%** improvement in load times and a **40%** increase in user engagement through iterative user feedback and updates.\nContributed to ongoing education and updates in the team, ensuring that all engineering practices align with the latest industry standards and emerging technologies."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "• Developed and maintained responsive web applications utilizing **Node.js** (Express, NestJS) and **VueJS** (3), ensuring adherence to SEO standards and mobile-first design principles, achieving **95%** load performance optimization.\n• Applied best practices in **JavaScript**, **CSS** (SASS, PostCSS), and HTML to create interactive and engaging user interfaces, meeting accessibility compliance (WCAG 2.1).\n• Implemented a robust version control system using **Git**, streamlining collaboration and deployment processes across **5** project teams.\n• Engineered scalable APIs and integrated frontend solutions using **Test-Driven Development** techniques with **Mocha** and **Jest**, improving code reliability and decreasing bug rates by **30%**.\n• Collaborated on backend services with expertise in **PHP** and **Symfony**, enhancing application performance and maintaining **99.9%** uptime across crucial services.\n• Leveraged **Webpack** and **npm** for efficient asset management and bundle optimization, reducing application build times by **40%**.\n• Conducted thorough code reviews and provided mentorship, fostering a culture of continuous learning and improvement within the engineering team.\n• Delivered feature enhancements and resolved critical production issues, maintaining high-quality software standards and minimizing downtime for end users."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, PHP\n\n **Backend Frameworks:**\n\tFastAPI, Flask, Django, Node.js, Symfony\n\n **Frontend Frameworks:**\n\tReact, Vue, Angular, VueJS, HTML, CSS, SASS, PostCSS, Webpack, npm\n\n **API Technologies:**\n\tMLflow, Airflow, Kubeflow\n\n **Serverless and Cloud Functions:**\n\tAWS (Lambda), Azure (App Services)\n\n **Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n **DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n **Cloud & Infrastructure:**\n\tAWS (ECS, RDS, S3), Azure (Blob, SQL)\n\n **Other:**\n\tAuthentication & Security (Keycloak, JWT, OAuth2, Let’s Encrypt, Nginx, Certbot), Test-Driven Development, Mocha, Jest, Git",
  "apply_company": "Skipso"
}