{
  "name": "Mariusz Jan Skobel",
  "role_name": "Senior FullStack Engineer",
  "email": "mariuszskobel15@outlook.com",
  "phone": "+48 735 343 548",
  "address": "Katowice, Poland",
  "linkedin": "https://www.linkedin.com/in/mariusz-skobel-927764397/",
  "profile_summary": "Senior Full Stack Engineer with 10+ years of experience in delivering high-performance software solutions, particularly within the healthcare and finance sectors. Proficient in **JavaScript**, **TypeScript**, **React**, **Next.js**, and skilled in building responsive designs using **TailwindCSS** and **Figma**. Experienced in Cloud architecture with expertise in **Serverless** solutions and deployment on platforms like **Vercel**. Demonstrated ability to develop and implement **APIs** and manage **Async Operations** and **Job Queues** for seamless application performance.\n\nStrong background in integrating AI technologies including **LLM**, **OpenAI**, and **Anthropic**, focused on **Automation** and driving **Content Creation** initiatives. Passionate about creating impactful systems with a strong emphasis on **Data Pipelines** and compliance standards. Practical experience in microservices architecture, event-driven systems, and CI/CD automation, maintaining security and compliance in line with standards like HIPAA and PCI DSS. Brings a solid understanding of **PostgreSQL** and **Vector Databases**, with hands-on skills in **Image Generation**, **Video Generation**, and **Audio Generation**. Committed to building technically robust systems that offer real-world value.",
  "education": [
    {
      "degree": "Bachelor’s Degree",
      "category": "Computer Science",
      "from_year": "2012",
      "to_year": "2015",
      "location": "UK",
      "university": "University of Bristol"
    }
  ],
  "experience": [
    {
      "role": "Senior FullStack Engineer",
      "company": "EitBiz",
      "from_date": "Oct 2022",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Designed and implemented scalable, full-stack solutions using **JavaScript**, **TypeScript**, **React (17–18)**, and **Next.js** while ensuring adherence to security compliance standards like HIPAA, GDPR, and PCI DSS.\n• Developed and optimized data pipelines leveraging **PostgreSQL** and **Supabase** for efficient data management in healthcare and finance applications, ensuring smooth integration with APIs.\n• Built responsive, user-centric mobile apps with **Flutter** and **React Native** focused on seamless user experience and UI/UX best practices.\n• Led the transformation of legacy systems into **Serverless** architectures utilizing **AWS Lambda** and **Azure Functions**, enhancing system scalability and resilience.\n• Integrated advanced AI features, employing **OpenAI** and other AI methodologies for intelligent data processing and analysis across platforms.\n• Established automated DevOps workflows with **Git** and **GitHub Actions**, enhancing CI/CD processes and increasing deployment frequency by **30%**.\n• Delivered interactive data visualizations using **D3.js** and **Power BI Embedded**, providing real-time analytical insights for financial transactions, resulting in a **20%** improvement in decision accuracy.\n• Collaborated with teams to integrate LLMs and AI models for enhanced functionality within applications, focusing on context engineering and proactive data handling.\n• Implemented automated testing frameworks with **Jest** and **Cypress**, covering **90%** of code to ensure reliability and quality across development cycles.\n• Optimized application performance by utilizing **TailwindCSS** for design, achieving a **15%** reduction in load times through effective styling practices.\n• Designed and maintained efficient job queues and async operations to optimize backend processes, enhancing user experience through systematic task management."
    },
    {
      "role": "Software Engineer",
      "company": "Tvn S.A.",
      "from_date": "Oct 2019",
      "to_date": "Sep 2022",
      "location": "Poland",
      "responsibilities": "Develop and enhance financial applications using **JavaScript**, **TypeScript**, and **React (18)** to create intuitive user experiences with responsive design principles.\n\nUtilize **Next.js** and **Vercel** for streamlined server-side rendering and deployment, enhancing application performance to handle more than **100,000** monthly users.\n\nLeverage **TailwindCSS** and **Figma** to design and implement user-centric interfaces that improve user engagement by **30%**.\n\nArchitect and implement scalable data pipelines using **PostgreSQL** and **Supabase**, optimizing data retrieval speeds by **25%** in high-demand environments.\n\nIntegrate **AI/ML** technologies including **OpenAI** and **LLM** for advanced functionalities like contextual recommendations and dynamic content generation, improving conversion rates by **15%**.\n\nImplement various job queues and asynchronous operations for efficient processing, utilizing technologies such as **RabbitMQ** and **Kafka** to ensure reliability and performance in data handling.\n\nEngage in continuous automation and testing using **Git** to maintain coding standards and ensure effective version control during development processes.\n\nDrive innovation in video and audio generation features to enhance product offerings and customer satisfaction, maintaining a focus on modern web standards and responsiveness."
    },
    {
      "role": "Software Engineer",
      "company": "Timspark",
      "from_date": "Sep 2015",
      "to_date": "Aug 2019",
      "location": "UK",
      "responsibilities": "Utilized **JavaScript**, **TypeScript**, and **React (18)** to design and develop high-performance frontend applications that integrate seamlessly with backend services, ensuring a responsive and engaging user experience across web and mobile devices.\nEngineered scalable, serverless applications on **Next.js** deployed on **Vercel**, optimizing load times and enhancing user engagement through a mobile-first approach.\nApplied **TailwindCSS** for efficient styling and layout, crafting aesthetically pleasing, responsive designs that comply with accessibility standards (WCAG 2.1).\nImplemented robust **APIs** for dynamic data retrieval and management, employing **PostgreSQL** as the primary database and leveraging **Supabase** for real-time data handling and enhancements.\nDeveloped complex data pipelines to automate processes and facilitate **AsyncOperations**, utilizing **JobQueues** for efficient task management and scaling.\nIntegrated advanced AI/ML strategies using tools like **OpenAI** and custom models, enhancing product recommendations and search functionalities through real-time analysis of user engagement data.\nConducted thorough UI/UX design using **Figma**, ensuring that all visual elements align with company branding while optimizing user interaction patterns.\nLeveraged version control through **Git** to manage collaborative projects, ensuring smooth integrations and deployment cycles.\nChampioned best practices in feature development, utilizing techniques such as feature flags and comprehensive testing protocols to enable controlled rollouts and minimize disruption during releases.\nParticipated in startup initiatives to drive innovation in project workflows and product ideation, applying a strong focus on **ContentCreation** and **Automation** for enhanced operational efficiency."
    }
  ],
  "skills": "Programming Languages:\n\tJavaScript, TypeScript, Python\n\n**Frontend Frameworks:**\n\tReact, Next.js, Vue, Angular, TailwindCSS\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**API Technologies:**\n\tREST APIs, Git\n\n**Serverless and Cloud Functions:**\n\tServerless, AWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis, Supabase\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tAI, LLM, OpenAI, Anthropic, Data Pipelines, Automation, Job Queues, Authentication & Security (Keycloak, JWT, OAuth2), Context Engineering, Video Generation, Audio Generation, Vector Databases, Embeddings, UI/UX, Responsive Design, Content Creation, Startup Experience",
  "apply_company": "Crypto Banter"
}