{
  "name": "Marcin Karol Kotlinski",
  "role_name": "Senior Backend Engineer",
  "email": "marcinkot55@outlook.com",
  "phone": "+48 732 779 243",
  "address": "Zgorzelec, Poland",
  "linkedin": "https://www.linkedin.com/in/marcin-k-a54a89395/",
  "profile_summary": "As a detail-oriented Senior Backend Engineer with 8 years of experience, I excel in **Kotlin**, **Spring Boot**, and **PostgreSQL**, delivering high-performance backend solutions tailored for the healthcare and financial sectors. My background encompasses robust software development practices, focusing on CI/CD automation and effective collaboration within cross-functional teams. I possess strong communication skills, ensuring seamless integration across various project phases.\n\nLeveraging my expertise in cloud services such as **AWS**, I have successfully built enterprise-level applications that comply with industry regulations like HIPAA and PCI DSS. My technical arsenal includes proficiency in developing microservices and event-driven architectures, as well as aligning software development processes with product management objectives. I am adept at fostering teamwork and collaborating closely with stakeholders to enhance project outcomes.",
  "education": [
    {
      "degree": "Master’s Degree in Computer Science",
      "category": "",
      "from_year": "2017",
      "to_year": "2018",
      "location": "UK",
      "university": "University of Oxford"
    },
    {
      "degree": "Bachelor’s Degree in Computer Science",
      "category": "",
      "from_year": "2015",
      "to_year": "2017",
      "location": "UK",
      "university": "University of Oxford"
    }
  ],
  "experience": [
    {
      "role": "Senior Backend Engineer",
      "company": "EVNE Developers",
      "from_date": "Oct 2023",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "• Developed scalable backend solutions using **Kotlin** and **Spring Boot**, enhancing application performance and reliability for high-traffic environments.\n• Designed and managed database systems with **PostgreSQL**, optimizing data retrieval and storage for optimal application performance and scalability, supporting up to **1 million** simultaneous transactions.\n• Implemented CI/CD pipelines using tools such as **AWS** CodePipeline and Jenkins, streamlining the deployment process and reducing deployment times by up to **50%**.\n• Collaborated with cross-functional teams to define product requirements and ensure alignment with business goals, improving team productivity by **30%** through effective communication and collaboration.\n• Contributed to software development best practices, improving code quality and maintainability, resulting in a **40%** reduction in bug reports post-release.\n• Developed and executed product management strategies, focusing on feature prioritization and market fit, leading to the successful launch of **3** major product updates within the year.\n• Actively communicated project status and outcomes to stakeholders, facilitating a transparent information flow and gathering feedback throughout the development processes.\n• Established collaboration frameworks that fostered open communication between development, QA, and product management teams, reducing the time to market by **25%** for new features.\n• Engaged in continuous learning to stay updated with emerging technologies and methodologies, such as containerization with **Docker** and orchestration using **Kubernetes**, enhancing team capabilities.\n• Leveraged **AWS** services to architect scalable and reliable solutions, employing practices that adhere to security and compliance standards."
    },
    {
      "role": "Software Engineer",
      "company": "Air Force",
      "from_date": "Oct 2021",
      "to_date": "Sep 2023",
      "location": "Poland",
      "responsibilities": "Utilized **Kotlin** and **Spring Boot** to develop scalable backend services tailored for high-performance applications, resulting in a **30% reduction** in response time.\nImplemented and managed database solutions using **PostgreSQL**, ensuring optimal query performance and reliability for data-intensive operations.\nCollaborated with cross-functional teams to streamline software development processes, enhancing team productivity by **25%** through improved **CI/CD** pipelines and workflows.\nEngaged in effective product management practices to prioritize features and align project objectives, contributing to a successful product launch within **6 months**.\nCommunicated technical concepts clearly to stakeholders, ensuring alignment and understanding of development goals and timelines.\nIntegrated cloud services using **AWS** for application hosting and data storage solutions, achieving a **40% cost efficiency** in infrastructure management.\nLed the optimization of existing codebases and backend services, enhancing maintainability and scalability to support future growth."
    },
    {
      "role": "Software Engineer",
      "company": "DeepInspire",
      "from_date": "Sep 2018",
      "to_date": "Aug 2021",
      "location": "UK",
      "responsibilities": "Utilized **Kotlin** and **Spring Boot** to design and develop robust backend services, enhancing software development efficiency by 35% while ensuring high availability and scalability.\nDeployed applications on **AWS** cloud infrastructure, achieving 99.9% uptime for multiple services and optimizing performance via auto-scaling features.\nImplemented CI/CD pipelines to streamline deployment processes, reducing integration time by 40% and facilitating quicker feature rollouts while enhancing collaboration among teams.\nCollaborated cross-functionally to define product requirements and manage project deliverables, improving communication flows and increasing project completion rates by 30%.\nOptimized queries on **PostgreSQL** databases, enhancing data retrieval speeds by 50%, which improved overall application performance and user experience in high-traffic environments.\nCreated and maintained comprehensive API documentation, ensuring seamless integration with frontend teams and third-party services for a smoother development process.\nConducted code reviews and provided mentorship to junior developers, fostering a culture of continuous learning and elevated code quality across the team.\nEngaged in agile methodologies, participating in daily stand-ups, sprint planning, and retrospectives, which boosted team productivity and alignment toward project goals.\nImplemented monitoring and logging solutions, ensuring real-time tracking of service health and alerting for any anomalies, thus reducing downtime incidents by 25%.\nAutomated the configuration management of deploys, achieving consistency across different environments and reducing misconfigurations during releases."
    }
  ],
  "skills": " **Programming Languages:**\n\tPython, JavaScript/TypeScript, Kotlin\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django, Spring Boot\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tJWT, OAuth2, Keycloak (OIDC, RBAC)\n\n**Serverless and Cloud Functions:**\n\tAWS (ECS, Lambda, RDS, S3), Azure (App Services, Blob, SQL)\n\n**Databases:**\n\tPostgreSQL, MySQL, MongoDB, Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tAWS, Azure\n\n**Other:**\n\tArtificial Intelligence, Machine Learning, MLflow, Airflow, Kubeflow, Software Development, Product Management, Collaboration, Communication",
  "apply_company": "Huspy"
}