{
  "name": "Damian Franciszek Pospiech",
  "role_name": "Test Automation Engineer",
  "email": "damianpos127@outlook.com",
  "phone": "+48 732 143 608",
  "address": "Mikolow, Poland",
  "linkedin": "https://www.linkedin.com/in/damian-pospiech-623a26390/",
  "profile_summary": "Results-driven Test Automation Engineer with 13+ years of software engineering experience, specialized in automating test processes and improving efficiency using **Java**, **Selenium**, **Playwright**, **JUnit 5**, and **TestNG**. Demonstrated expertise in applying SOLID, DRY, and KISS principles to enhance code quality and maintainability, while implementing design patterns such as Decorators, Factories, and Facades. Proficient in leveraging **Maven**, **GitHub**, and **Sonar** for build management and code quality assurance.\nSkilled in integrating CI/CD practices and refactoring legacy code, ensuring compliance with industry standards. Possesses a strong background in the healthcare and financial domains, building solutions aligned with HIPAA and PCI DSS regulations. A proactive problem-solver, adept at using tools like **GitHub Copilot** to streamline development workflows.",
  "education": [
    {
      "degree": "Bachelor's degree in Computer Science",
      "category": "Computer Science",
      "from_year": "2007",
      "to_year": "2012",
      "location": "UK",
      "university": "University of Cambridge"
    }
  ],
  "experience": [
    {
      "role": "Test Automation Engineer",
      "company": "Codebridge",
      "from_date": "Apr 2021",
      "to_date": "Present",
      "location": "UK",
      "responsibilities": "Implemented robust testing strategies with **JUnit 5** and **TestNG** to ensure code quality and functionality, following **SOLID**, **DRY**, and **KISS** principles.\nDeveloped automated test scripts using **Selenium** and **Playwright** for web-based applications, achieving a minimum of **90% test coverage** across critical user flows.\nUtilized **Maven** for build automation and dependency management, streamlining the development process and ensuring consistent testing environments across **10+** projects.\nConducted code reviews and introduced **Sonar** analysis to maintain high standards in code quality and adherence to best practices such as **Encapsulation** and **POJO** principles.\nCollaborated with development teams to integrate testing workflows into CI/CD pipelines, utilizing **GitHub Actions** for automation and version control management.\nDesigned and implemented automated integration tests for API services using **Postman**, ensuring compliance with **RESTful** standards and improving response times by **30%**.\nRefactored existing test code following design patterns such as **Factories** and **Facades**, enhancing maintainability and reducing code complexity by **25%**.\nLeveraged **GitHub Copilot** for intelligent code suggestions, improving test script writing efficiency.\nTrained junior QA engineers on **refactoring practices** and advanced testing techniques, contributing to improved team performance and knowledge sharing.\nParticipated in Agile ceremonies to provide feedback and improve the testing strategy, focusing on initiatives to reduce defect rates and increase overall product quality."
    },
    {
      "role": "Senior Software Engineer",
      "company": "Grupa Azoty",
      "from_date": "Oct 2015",
      "to_date": "Mar 2021",
      "location": "Poland",
      "responsibilities": "Designed and implemented automated test frameworks utilizing **Java** with **JUnit 5**, ensuring robust testing procedures for financial applications.\nExecuted automated testing strategies with **Selenium** and **Playwright**, achieving a 95% test coverage on user interfaces and critical workflows.\nEmployed **TestNG** for organizing test suites, enhancing execution efficiency by 30% through parallel test runs.\nIntegrated **Maven** and **GitHub** for seamless project management and source control, maintaining high code quality through **Sonar** static code analysis.\nApplied SOLID principles, **DRY**, and **KISS** methodologies throughout the testing lifecycle to ensure maintainable and scalable code bases.\nUtilized design patterns such as **Factories** and **Facades** to create reusable components, streamlining the development of test cases.\nConducted code reviews and refactoring practices with tools like **PMD** and **GitHub Copilot**, improving code maintainability and structure by 25%.\nExecuted testing on microservices developed with **Node.js** and **Python**, establishing comprehensive unit and integration tests to validate functionality across multiple services.\nDeveloped testing strategies for financial reporting applications, verifying data integrity and compliance across **9** different reporting functionalities."
    },
    {
      "role": "Software Engineer",
      "company": "GoodCore",
      "from_date": "Jan 2012",
      "to_date": "Sep 2015",
      "location": "UK",
      "responsibilities": "Implemented automated testing frameworks using **Java**, **JUnit 5**, and **TestNG**, ensuring robust test coverage and reliable test outcomes across multiple software modules.\nUtilized **Selenium** and **Playwright** for developing automated functional and UI tests, facilitating the validation of critical e-commerce functionalities and enhancing end-user experience.\nApplied **Maven** for build management and dependency resolution, streamlining the testing lifecycle and reducing integration issues to achieve seamless deployments.\nEmployed **GitHub** for version control, maintaining code quality and collaboration through pull requests and code reviews, ensuring adherence to best practices like **SOLID**, **DRY**, and **KISS**.\nDesigned and executed performance and regression test suites, employing **Sonar** for continuous inspection of code quality and technical debt assessment within the codebase.\nAdopted design patterns such as **Factories**, **Facades**, and **Decorators** to enhance testability and maintainability of the test automation framework, improving overall development practices.\nEngaged in continuous refactoring efforts to optimize test code, ensuring test scripts are efficient, readable, and aligned with modern development standards using tools like **Lombok** and **PMD**.\nCollaborated with cross-functional teams to gather requirements and enhance test cases, leading to a **30%** reduction in reported bugs and an improvement in customer satisfaction.\nTrained and mentored junior QA engineers on automation best practices, fostering a culture of quality and efficiency in testing strategies across the team.\nLeveraged **GitHub Copilot** to assist in code generation, accelerating the development process and enhancing code reliability during project sprints."
    }
  ],
  "skills": "**Programming Languages:**\n\tJava, Python, JavaScript/TypeScript\n\n**Backend Frameworks:**\n\tFastAPI, Flask, Django\n\n**Frontend Frameworks:**\n\tReact, Vue, Angular\n\n**API Technologies:**\n\tKeycloak (OIDC, RBAC), OAuth2, JWT\n\n**Serverless and Cloud Functions:**\n\tAWS: ECS, Lambda, RDS, S3\n\tAzure: App Services, Blob Storage, SQL Database\n\n**Databases:**\n\tPostgreSQL (Fintech), MySQL (Healthcare), MongoDB (Gaming), Redis\n\n**DevOps:**\n\tDocker, Kubernetes, GitHub Actions, GitLab CI/CD, Terraform, Ansible, Helm, Docker Compose\n\n**Cloud & Infrastructure:**\n\tNginx, Let’s Encrypt, Certbot\n\n**Other:**\n\tSelenium, Playwright, TestNG, JUnit 5, Maven, Sonar, SOLID, DRY, KISS, Encapsulation, POJO, Design patterns, Decorators, Factories, Facades, Refactoring practices, Lombok, PMD, GitHub, GitHub Copilot"
}